// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: LiteNetLib.NatAddressType
#include "LiteNetLib/NatAddressType.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
  // Forward declaring type: NetDataReader
  class NetDataReader;
  // Forward declaring type: NetPacketProcessor
  class NetPacketProcessor;
}
// Forward declaring namespace: LiteNetLib
namespace LiteNetLib {
  // Forward declaring type: NetSocket
  class NetSocket;
  // Forward declaring type: INatPunchListener
  class INatPunchListener;
  // Forward declaring type: NetPacket
  class NetPacket;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Completed forward declares
// Type namespace: LiteNetLib
namespace LiteNetLib {
  // Autogenerated type: LiteNetLib.NatPunchModule
  class NatPunchModule : public ::Il2CppObject {
    public:
    // Nested type: LiteNetLib::NatPunchModule::RequestEventData
    struct RequestEventData;
    // Nested type: LiteNetLib::NatPunchModule::SuccessEventData
    struct SuccessEventData;
    // Nested type: LiteNetLib::NatPunchModule::NatIntroduceRequestPacket
    class NatIntroduceRequestPacket;
    // Nested type: LiteNetLib::NatPunchModule::NatIntroduceResponsePacket
    class NatIntroduceResponsePacket;
    // Nested type: LiteNetLib::NatPunchModule::NatPunchPacket
    class NatPunchPacket;
    // Autogenerated type: LiteNetLib.NatPunchModule/RequestEventData
    struct RequestEventData : public System::ValueType {
      public:
      // public System.Net.IPEndPoint LocalEndPoint
      // Offset: 0x0
      System::Net::IPEndPoint* LocalEndPoint;
      // public System.Net.IPEndPoint RemoteEndPoint
      // Offset: 0x8
      System::Net::IPEndPoint* RemoteEndPoint;
      // public System.String Token
      // Offset: 0x10
      ::Il2CppString* Token;
      // Creating value type constructor for type: RequestEventData
      constexpr RequestEventData(System::Net::IPEndPoint* LocalEndPoint_ = {}, System::Net::IPEndPoint* RemoteEndPoint_ = {}, ::Il2CppString* Token_ = {}) noexcept : LocalEndPoint{LocalEndPoint_}, RemoteEndPoint{RemoteEndPoint_}, Token{Token_} {}
    }; // LiteNetLib.NatPunchModule/RequestEventData
    // Autogenerated type: LiteNetLib.NatPunchModule/SuccessEventData
    struct SuccessEventData : public System::ValueType {
      public:
      // public System.Net.IPEndPoint TargetEndPoint
      // Offset: 0x0
      System::Net::IPEndPoint* TargetEndPoint;
      // public LiteNetLib.NatAddressType Type
      // Offset: 0x8
      LiteNetLib::NatAddressType Type;
      // public System.String Token
      // Offset: 0x10
      ::Il2CppString* Token;
      // Creating value type constructor for type: SuccessEventData
      constexpr SuccessEventData(System::Net::IPEndPoint* TargetEndPoint_ = {}, LiteNetLib::NatAddressType Type_ = {}, ::Il2CppString* Token_ = {}) noexcept : TargetEndPoint{TargetEndPoint_}, Type{Type_}, Token{Token_} {}
    }; // LiteNetLib.NatPunchModule/SuccessEventData
    // private readonly LiteNetLib.NetSocket _socket
    // Offset: 0x10
    LiteNetLib::NetSocket* socket;
    // private readonly System.Collections.Generic.Queue`1<LiteNetLib.NatPunchModule/RequestEventData> _requestEvents
    // Offset: 0x18
    System::Collections::Generic::Queue_1<LiteNetLib::NatPunchModule::RequestEventData>* requestEvents;
    // private readonly System.Collections.Generic.Queue`1<LiteNetLib.NatPunchModule/SuccessEventData> _successEvents
    // Offset: 0x20
    System::Collections::Generic::Queue_1<LiteNetLib::NatPunchModule::SuccessEventData>* successEvents;
    // private readonly LiteNetLib.Utils.NetDataReader _cacheReader
    // Offset: 0x28
    LiteNetLib::Utils::NetDataReader* cacheReader;
    // private readonly LiteNetLib.Utils.NetDataWriter _cacheWriter
    // Offset: 0x30
    LiteNetLib::Utils::NetDataWriter* cacheWriter;
    // private readonly LiteNetLib.Utils.NetPacketProcessor _netPacketProcessor
    // Offset: 0x38
    LiteNetLib::Utils::NetPacketProcessor* netPacketProcessor;
    // private LiteNetLib.INatPunchListener _natPunchListener
    // Offset: 0x40
    LiteNetLib::INatPunchListener* natPunchListener;
    // static field const value: static public System.Int32 MaxTokenLength
    static constexpr const int MaxTokenLength = 256;
    // Get static field: static public System.Int32 MaxTokenLength
    static int _get_MaxTokenLength();
    // Set static field: static public System.Int32 MaxTokenLength
    static void _set_MaxTokenLength(int value);
    // System.Void .ctor(LiteNetLib.NetSocket socket)
    // Offset: 0x18056E4
    static NatPunchModule* New_ctor(LiteNetLib::NetSocket* socket);
    // System.Void ProcessMessage(System.Net.IPEndPoint senderEndPoint, LiteNetLib.NetPacket packet)
    // Offset: 0x1805950
    void ProcessMessage(System::Net::IPEndPoint* senderEndPoint, LiteNetLib::NetPacket* packet);
    // public System.Void Init(LiteNetLib.INatPunchListener listener)
    // Offset: 0x1805A8C
    void Init(LiteNetLib::INatPunchListener* listener);
    // private System.Void Send(T packet, System.Net.IPEndPoint target)
    // Offset: 0xFFFFFFFF
    template<class T>
    void Send(T packet, System::Net::IPEndPoint* target) {
      THROW_UNLESS(il2cpp_utils::RunGenericMethod(this, "Send", {il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<T>::get()}, packet, target));
    }
    // public System.Void NatIntroduce(System.Net.IPEndPoint hostInternal, System.Net.IPEndPoint hostExternal, System.Net.IPEndPoint clientInternal, System.Net.IPEndPoint clientExternal, System.String additionalInfo)
    // Offset: 0x1805A94
    void NatIntroduce(System::Net::IPEndPoint* hostInternal, System::Net::IPEndPoint* hostExternal, System::Net::IPEndPoint* clientInternal, System::Net::IPEndPoint* clientExternal, ::Il2CppString* additionalInfo);
    // public System.Void PollEvents()
    // Offset: 0x1805BB0
    void PollEvents();
    // public System.Void SendNatIntroduceRequest(System.String host, System.Int32 port, System.String additionalInfo)
    // Offset: 0x1805F08
    void SendNatIntroduceRequest(::Il2CppString* host, int port, ::Il2CppString* additionalInfo);
    // public System.Void SendNatIntroduceRequest(System.Net.IPEndPoint masterServerEndPoint, System.String additionalInfo)
    // Offset: 0x1806040
    void SendNatIntroduceRequest(System::Net::IPEndPoint* masterServerEndPoint, ::Il2CppString* additionalInfo);
    // private System.Void OnNatIntroductionRequest(LiteNetLib.NatPunchModule/NatIntroduceRequestPacket req, System.Net.IPEndPoint senderEndPoint)
    // Offset: 0x1806358
    void OnNatIntroductionRequest(LiteNetLib::NatPunchModule::NatIntroduceRequestPacket* req, System::Net::IPEndPoint* senderEndPoint);
    // private System.Void OnNatIntroductionResponse(LiteNetLib.NatPunchModule/NatIntroduceResponsePacket req)
    // Offset: 0x18064CC
    void OnNatIntroductionResponse(LiteNetLib::NatPunchModule::NatIntroduceResponsePacket* req);
    // private System.Void OnNatPunch(LiteNetLib.NatPunchModule/NatPunchPacket req, System.Net.IPEndPoint senderEndPoint)
    // Offset: 0x18069EC
    void OnNatPunch(LiteNetLib::NatPunchModule::NatPunchPacket* req, System::Net::IPEndPoint* senderEndPoint);
  }; // LiteNetLib.NatPunchModule
}
DEFINE_IL2CPP_ARG_TYPE(LiteNetLib::NatPunchModule*, "LiteNetLib", "NatPunchModule");
DEFINE_IL2CPP_ARG_TYPE(LiteNetLib::NatPunchModule::RequestEventData, "LiteNetLib", "NatPunchModule/RequestEventData");
DEFINE_IL2CPP_ARG_TYPE(LiteNetLib::NatPunchModule::SuccessEventData, "LiteNetLib", "NatPunchModule/SuccessEventData");
#pragma pack(pop)
