// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: LiteNetLib.ConnectionState
#include "LiteNetLib/ConnectionState.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: LiteNetLib
namespace LiteNetLib {
  // Forward declaring type: NetPacketPool
  class NetPacketPool;
  // Forward declaring type: NetPacket
  class NetPacket;
  // Forward declaring type: BaseChannel
  class BaseChannel;
  // Forward declaring type: NetManager
  class NetManager;
  // Forward declaring type: NetStatistics
  class NetStatistics;
  // Forward declaring type: NetConnectAcceptPacket
  class NetConnectAcceptPacket;
  // Forward declaring type: DeliveryMethod
  struct DeliveryMethod;
  // Forward declaring type: DisconnectResult
  struct DisconnectResult;
  // Forward declaring type: ShutdownResult
  struct ShutdownResult;
  // Forward declaring type: ConnectRequestResult
  struct ConnectRequestResult;
  // Forward declaring type: NetConnectRequestPacket
  class NetConnectRequestPacket;
}
// Forward declaring namespace: System::Diagnostics
namespace System::Diagnostics {
  // Forward declaring type: Stopwatch
  class Stopwatch;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: DateTime
  struct DateTime;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
}
// Completed forward declares
// Type namespace: LiteNetLib
namespace LiteNetLib {
  // Size: 0x148
  #pragma pack(push, 1)
  // Autogenerated type: LiteNetLib.NetPeer
  // [TokenAttribute] Offset: FFFFFFFF
  class NetPeer : public ::Il2CppObject {
    public:
    // Nested type: LiteNetLib::NetPeer::IncomingFragments
    class IncomingFragments;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private System.Int32 _rtt
    // Size: 0x4
    // Offset: 0x10
    int rtt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _avgRtt
    // Size: 0x4
    // Offset: 0x14
    int avgRtt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _rttCount
    // Size: 0x4
    // Offset: 0x18
    int rttCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: rttCount and: resendDelay
    char __padding2[0x4] = {};
    // private System.Double _resendDelay
    // Size: 0x8
    // Offset: 0x20
    double resendDelay;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Int32 _pingSendTimer
    // Size: 0x4
    // Offset: 0x28
    int pingSendTimer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _rttResetTimer
    // Size: 0x4
    // Offset: 0x2C
    int rttResetTimer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Diagnostics.Stopwatch _pingTimer
    // Size: 0x8
    // Offset: 0x30
    System::Diagnostics::Stopwatch* pingTimer;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Stopwatch*) == 0x8);
    // private System.Int32 _timeSinceLastPacket
    // Size: 0x4
    // Offset: 0x38
    int timeSinceLastPacket;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: timeSinceLastPacket and: remoteDelta
    char __padding7[0x4] = {};
    // private System.Int64 _remoteDelta
    // Size: 0x8
    // Offset: 0x40
    int64_t remoteDelta;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private readonly LiteNetLib.NetPacketPool _packetPool
    // Size: 0x8
    // Offset: 0x48
    LiteNetLib::NetPacketPool* packetPool;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetPacketPool*) == 0x8);
    // private readonly System.Object _flushLock
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppObject* flushLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private readonly System.Object _sendLock
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppObject* sendLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private readonly System.Object _shutdownLock
    // Size: 0x8
    // Offset: 0x60
    ::Il2CppObject* shutdownLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // LiteNetLib.NetPeer NextPeer
    // Size: 0x8
    // Offset: 0x68
    LiteNetLib::NetPeer* NextPeer;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetPeer*) == 0x8);
    // LiteNetLib.NetPeer PrevPeer
    // Size: 0x8
    // Offset: 0x70
    LiteNetLib::NetPeer* PrevPeer;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetPeer*) == 0x8);
    // private readonly System.Collections.Generic.Queue`1<LiteNetLib.NetPacket> _unreliableChannel
    // Size: 0x8
    // Offset: 0x78
    System::Collections::Generic::Queue_1<LiteNetLib::NetPacket*>* unreliableChannel;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Queue_1<LiteNetLib::NetPacket*>*) == 0x8);
    // private readonly LiteNetLib.BaseChannel[] _channels
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<LiteNetLib::BaseChannel*> channels;
    // Field size check
    static_assert(sizeof(::ArrayW<LiteNetLib::BaseChannel*>) == 0x8);
    // private LiteNetLib.BaseChannel _headChannel
    // Size: 0x8
    // Offset: 0x88
    LiteNetLib::BaseChannel* headChannel;
    // Field size check
    static_assert(sizeof(LiteNetLib::BaseChannel*) == 0x8);
    // private System.Int32 _mtu
    // Size: 0x4
    // Offset: 0x90
    int mtu;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _mtuIdx
    // Size: 0x4
    // Offset: 0x94
    int mtuIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _finishMtu
    // Size: 0x1
    // Offset: 0x98
    bool finishMtu;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: finishMtu and: mtuCheckTimer
    char __padding20[0x3] = {};
    // private System.Int32 _mtuCheckTimer
    // Size: 0x4
    // Offset: 0x9C
    int mtuCheckTimer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _mtuCheckAttempts
    // Size: 0x4
    // Offset: 0xA0
    int mtuCheckAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: mtuCheckAttempts and: mtuMutex
    char __padding22[0x4] = {};
    // private readonly System.Object _mtuMutex
    // Size: 0x8
    // Offset: 0xA8
    ::Il2CppObject* mtuMutex;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.UInt16 _fragmentId
    // Size: 0x2
    // Offset: 0xB0
    uint16_t fragmentId;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: fragmentId and: holdedFragments
    char __padding24[0x6] = {};
    // private readonly System.Collections.Generic.Dictionary`2<System.UInt16,LiteNetLib.NetPeer/LiteNetLib.IncomingFragments> _holdedFragments
    // Size: 0x8
    // Offset: 0xB8
    System::Collections::Generic::Dictionary_2<uint16_t, LiteNetLib::NetPeer::IncomingFragments*>* holdedFragments;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<uint16_t, LiteNetLib::NetPeer::IncomingFragments*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.UInt16,System.UInt16> _deliveredFramgnets
    // Size: 0x8
    // Offset: 0xC0
    System::Collections::Generic::Dictionary_2<uint16_t, uint16_t>* deliveredFramgnets;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<uint16_t, uint16_t>*) == 0x8);
    // private readonly LiteNetLib.NetPacket _mergeData
    // Size: 0x8
    // Offset: 0xC8
    LiteNetLib::NetPacket* mergeData;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetPacket*) == 0x8);
    // private System.Int32 _mergePos
    // Size: 0x4
    // Offset: 0xD0
    int mergePos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _mergeCount
    // Size: 0x4
    // Offset: 0xD4
    int mergeCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _connectAttempts
    // Size: 0x4
    // Offset: 0xD8
    int connectAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _connectTimer
    // Size: 0x4
    // Offset: 0xDC
    int connectTimer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int64 _connectTime
    // Size: 0x8
    // Offset: 0xE0
    int64_t connectTime;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Byte _connectNum
    // Size: 0x1
    // Offset: 0xE8
    uint8_t connectNum;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private LiteNetLib.ConnectionState _connectionState
    // Size: 0x1
    // Offset: 0xE9
    LiteNetLib::ConnectionState connectionState;
    // Field size check
    static_assert(sizeof(LiteNetLib::ConnectionState) == 0x1);
    // Padding between fields: connectionState and: shutdownPacket
    char __padding34[0x6] = {};
    // private LiteNetLib.NetPacket _shutdownPacket
    // Size: 0x8
    // Offset: 0xF0
    LiteNetLib::NetPacket* shutdownPacket;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetPacket*) == 0x8);
    // private System.Int32 _shutdownTimer
    // Size: 0x4
    // Offset: 0xF8
    int shutdownTimer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: shutdownTimer and: pingPacket
    char __padding36[0x4] = {};
    // private readonly LiteNetLib.NetPacket _pingPacket
    // Size: 0x8
    // Offset: 0x100
    LiteNetLib::NetPacket* pingPacket;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetPacket*) == 0x8);
    // private readonly LiteNetLib.NetPacket _pongPacket
    // Size: 0x8
    // Offset: 0x108
    LiteNetLib::NetPacket* pongPacket;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetPacket*) == 0x8);
    // private readonly LiteNetLib.NetPacket _connectRequestPacket
    // Size: 0x8
    // Offset: 0x110
    LiteNetLib::NetPacket* connectRequestPacket;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetPacket*) == 0x8);
    // private readonly LiteNetLib.NetPacket _connectAcceptPacket
    // Size: 0x8
    // Offset: 0x118
    LiteNetLib::NetPacket* connectAcceptPacket;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetPacket*) == 0x8);
    // public readonly System.Net.IPEndPoint EndPoint
    // Size: 0x8
    // Offset: 0x120
    System::Net::IPEndPoint* EndPoint;
    // Field size check
    static_assert(sizeof(System::Net::IPEndPoint*) == 0x8);
    // public readonly LiteNetLib.NetManager NetManager
    // Size: 0x8
    // Offset: 0x128
    LiteNetLib::NetManager* NetManager;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetManager*) == 0x8);
    // public readonly System.Int32 Id
    // Size: 0x4
    // Offset: 0x130
    int Id;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Id and: Tag
    char __padding43[0x4] = {};
    // public System.Object Tag
    // Size: 0x8
    // Offset: 0x138
    ::Il2CppObject* Tag;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public readonly LiteNetLib.NetStatistics Statistics
    // Size: 0x8
    // Offset: 0x140
    LiteNetLib::NetStatistics* Statistics;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetStatistics*) == 0x8);
    public:
    // static field const value: static private System.Int32 MtuCheckDelay
    static constexpr const int MtuCheckDelay = 1000;
    // Get static field: static private System.Int32 MtuCheckDelay
    static int _get_MtuCheckDelay();
    // Set static field: static private System.Int32 MtuCheckDelay
    static void _set_MtuCheckDelay(int value);
    // static field const value: static private System.Int32 MaxMtuCheckAttempts
    static constexpr const int MaxMtuCheckAttempts = 4;
    // Get static field: static private System.Int32 MaxMtuCheckAttempts
    static int _get_MaxMtuCheckAttempts();
    // Set static field: static private System.Int32 MaxMtuCheckAttempts
    static void _set_MaxMtuCheckAttempts(int value);
    // static field const value: static private System.Int32 ShutdownDelay
