// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: UnityEngine.TextCore
namespace UnityEngine::TextCore {
  // Forward declaring type: FaceInfo
  struct FaceInfo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::TextCore::FaceInfo, "UnityEngine.TextCore", "FaceInfo");
// Type namespace: UnityEngine.TextCore
namespace UnityEngine::TextCore {
  // Size: 0x5C
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.TextCore.FaceInfo
  // [TokenAttribute] Offset: FFFFFFFF
  // [UsedByNativeCodeAttribute] Offset: 11DE018
  struct FaceInfo/*, public System::ValueType*/ {
    public:
    public:
    // [NativeNameAttribute] Offset: 0x11DE174
    // private System.Int32 m_FaceIndex
    // Size: 0x4
    // Offset: 0x0
    int m_FaceIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_FaceIndex and: m_FamilyName
    char __padding0[0x4] = {};
    // [NativeNameAttribute] Offset: 0x11DE1C0
    // private System.String m_FamilyName
    // Size: 0x8
    // Offset: 0x8
    ::StringW m_FamilyName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [NativeNameAttribute] Offset: 0x11DE20C
    // private System.String m_StyleName
    // Size: 0x8
    // Offset: 0x10
    ::StringW m_StyleName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [NativeNameAttribute] Offset: 0x11DE258
    // private System.Int32 m_PointSize
    // Size: 0x4
    // Offset: 0x18
    int m_PointSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE2A4
    // private System.Single m_Scale
    // Size: 0x4
    // Offset: 0x1C
    float m_Scale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE2F0
    // private System.Single m_LineHeight
    // Size: 0x4
    // Offset: 0x20
    float m_LineHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE33C
    // private System.Single m_AscentLine
    // Size: 0x4
    // Offset: 0x24
    float m_AscentLine;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE388
    // private System.Single m_CapLine
    // Size: 0x4
    // Offset: 0x28
    float m_CapLine;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE3D4
    // private System.Single m_MeanLine
    // Size: 0x4
    // Offset: 0x2C
    float m_MeanLine;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE420
    // private System.Single m_Baseline
    // Size: 0x4
    // Offset: 0x30
    float m_Baseline;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE46C
    // private System.Single m_DescentLine
    // Size: 0x4
    // Offset: 0x34
    float m_DescentLine;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE4B8
    // private System.Single m_SuperscriptOffset
    // Size: 0x4
    // Offset: 0x38
    float m_SuperscriptOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE504
    // private System.Single m_SuperscriptSize
    // Size: 0x4
    // Offset: 0x3C
    float m_SuperscriptSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE550
    // private System.Single m_SubscriptOffset
    // Size: 0x4
    // Offset: 0x40
    float m_SubscriptOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE59C
    // private System.Single m_SubscriptSize
    // Size: 0x4
    // Offset: 0x44
    float m_SubscriptSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE5E8
    // private System.Single m_UnderlineOffset
    // Size: 0x4
    // Offset: 0x48
    float m_UnderlineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE634
    // private System.Single m_UnderlineThickness
    // Size: 0x4
    // Offset: 0x4C
    float m_UnderlineThickness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE680
    // private System.Single m_StrikethroughOffset
    // Size: 0x4
    // Offset: 0x50
    float m_StrikethroughOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE6CC
    // private System.Single m_StrikethroughThickness
    // Size: 0x4
    // Offset: 0x54
    float m_StrikethroughThickness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NativeNameAttribute] Offset: 0x11DE718
    // private System.Single m_TabWidth
    // Size: 0x4
    // Offset: 0x58
    float m_TabWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating value type constructor for type: FaceInfo
