// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: MarshalByRefObject
  class MarshalByRefObject;
  // Forward declaring type: IntPtr
  struct IntPtr;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Runtime::Remoting::Contexts
namespace System::Runtime::Remoting::Contexts {
  // Forward declaring type: Context
  class Context;
}
// Forward declaring namespace: System::Runtime::Remoting
namespace System::Runtime::Remoting {
  // Forward declaring type: Identity
  class Identity;
  // Forward declaring type: ClientIdentity
  class ClientIdentity;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Forward declaring namespace: System::Runtime::Remoting::Messaging
namespace System::Runtime::Remoting::Messaging {
  // Forward declaring type: IMessage
  class IMessage;
  // Forward declaring type: IMethodReturnMessage
  class IMethodReturnMessage;
  // Forward declaring type: MonoMethodMessage
  class MonoMethodMessage;
}
// Completed forward declares
// Type namespace: System.Runtime.Remoting.Proxies
namespace System::Runtime::Remoting::Proxies {
  // Autogenerated type: System.Runtime.Remoting.Proxies.RealProxy
  class RealProxy : public ::Il2CppObject {
    public:
    // private System.Type class_to_proxy
    // Offset: 0x10
    System::Type* class_to_proxy;
    // System.Runtime.Remoting.Contexts.Context _targetContext
    // Offset: 0x18
    System::Runtime::Remoting::Contexts::Context* targetContext;
    // System.MarshalByRefObject _server
    // Offset: 0x20
    System::MarshalByRefObject* server;
    // private System.Int32 _targetDomainId
    // Offset: 0x28
    int targetDomainId;
    // System.String _targetUri
    // Offset: 0x30
    ::Il2CppString* targetUri;
    // System.Runtime.Remoting.Identity _objectIdentity
    // Offset: 0x38
    System::Runtime::Remoting::Identity* objectIdentity;
    // private System.Object _objTP
    // Offset: 0x40
    ::Il2CppObject* objTP;
    // private System.Object _stubData
    // Offset: 0x48
    ::Il2CppObject* stubData;
    // protected System.Void .ctor(System.Type classToProxy)
    // Offset: 0xD7229C
    static RealProxy* New_ctor(System::Type* classToProxy);
    // System.Void .ctor(System.Type classToProxy, System.Runtime.Remoting.ClientIdentity identity)
    // Offset: 0xD7240C
    static RealProxy* New_ctor(System::Type* classToProxy, System::Runtime::Remoting::ClientIdentity* identity);
    // protected System.Void .ctor(System.Type classToProxy, System.IntPtr stub, System.Object stubData)
    // Offset: 0xD722F4
    static RealProxy* New_ctor(System::Type* classToProxy, System::IntPtr stub, ::Il2CppObject* stubData);
    // static private System.Type InternalGetProxyType(System.Object transparentProxy)
    // Offset: 0xD72478
    static System::Type* InternalGetProxyType(::Il2CppObject* transparentProxy);
    // public System.Type GetProxiedType()
    // Offset: 0xD7247C
    System::Type* GetProxiedType();
    // public System.Void GetObjectData(System.Runtime.Serialization.SerializationInfo info, System.Runtime.Serialization.StreamingContext context)
    // Offset: 0xD72528
    void GetObjectData(System::Runtime::Serialization::SerializationInfo* info, System::Runtime::Serialization::StreamingContext context);
    // System.Runtime.Remoting.Identity get_ObjectIdentity()
    // Offset: 0xD725CC
    System::Runtime::Remoting::Identity* get_ObjectIdentity();
    // System.Void set_ObjectIdentity(System.Runtime.Remoting.Identity value)
    // Offset: 0xD725D4
    void set_ObjectIdentity(System::Runtime::Remoting::Identity* value);
    // public System.Runtime.Remoting.Messaging.IMessage Invoke(System.Runtime.Remoting.Messaging.IMessage msg)
    // Offset: 0xFFFFFFFF
    System::Runtime::Remoting::Messaging::IMessage* Invoke(System::Runtime::Remoting::Messaging::IMessage* msg);
    // static System.Object PrivateInvoke(System.Runtime.Remoting.Proxies.RealProxy rp, System.Runtime.Remoting.Messaging.IMessage msg, System.Exception exc, System.Object[] out_args)
    // Offset: 0xD725DC
    static ::Il2CppObject* PrivateInvoke(System::Runtime::Remoting::Proxies::RealProxy* rp, System::Runtime::Remoting::Messaging::IMessage* msg, System::Exception*& exc, ::Array<::Il2CppObject*>*& out_args);
    // System.Object InternalGetTransparentProxy(System.String className)
    // Offset: 0xD736AC
    ::Il2CppObject* InternalGetTransparentProxy(::Il2CppString* className);
    // public System.Object GetTransparentProxy()
    // Offset: 0xD736B0
    ::Il2CppObject* GetTransparentProxy();
    // protected System.Void AttachServer(System.MarshalByRefObject s)
    // Offset: 0xD73830
    void AttachServer(System::MarshalByRefObject* s);
    // System.Void SetTargetDomain(System.Int32 domainId)
    // Offset: 0xD73838
    void SetTargetDomain(int domainId);
    // System.Object GetAppDomainTarget()
    // Offset: 0xD73840
    ::Il2CppObject* GetAppDomainTarget();
    // static private System.Object[] ProcessResponse(System.Runtime.Remoting.Messaging.IMethodReturnMessage mrm, System.Runtime.Remoting.Messaging.MonoMethodMessage call)
    // Offset: 0xD72FB8
    static ::Array<::Il2CppObject*>* ProcessResponse(System::Runtime::Remoting::Messaging::IMethodReturnMessage* mrm, System::Runtime::Remoting::Messaging::MonoMethodMessage* call);
    // protected System.Void .ctor()
    // Offset: 0xD7228C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static RealProxy* New_ctor();
  }; // System.Runtime.Remoting.Proxies.RealProxy
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Remoting::Proxies::RealProxy*, "System.Runtime.Remoting.Proxies", "RealProxy");
#pragma pack(pop)
