// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Data.Common.StorageType
#include "System/Data/Common/StorageType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataColumn
  class DataColumn;
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: DataSetDateTime
  struct DataSetDateTime;
  // Forward declaring type: AggregateType
  struct AggregateType;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Tuple`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Tuple_4;
  // Forward declaring type: IFormatProvider
  class IFormatProvider;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: BitArray
  class BitArray;
}
// Forward declaring namespace: System::Collections::Concurrent
namespace System::Collections::Concurrent {
  // Forward declaring type: ConcurrentDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class ConcurrentDictionary_2;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: XmlWriter
  class XmlWriter;
}
// Forward declaring namespace: System::Xml::Serialization
namespace System::Xml::Serialization {
  // Forward declaring type: XmlRootAttribute
  class XmlRootAttribute;
}
// Completed forward declares
// Type namespace: System.Data.Common
namespace System::Data::Common {
  // Forward declaring type: DataStorage
  class DataStorage;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Data::Common::DataStorage);
DEFINE_IL2CPP_ARG_TYPE(System::Data::Common::DataStorage*, "System.Data.Common", "DataStorage");
// Type namespace: System.Data.Common
namespace System::Data::Common {
  // Size: 0x4C
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.Common.DataStorage
  // [TokenAttribute] Offset: FFFFFFFF
  class DataStorage : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // readonly System.Data.DataColumn _column
    // Size: 0x8
    // Offset: 0x10
    System::Data::DataColumn* column;
    // Field size check
    static_assert(sizeof(System::Data::DataColumn*) == 0x8);
    // readonly System.Data.DataTable _table
    // Size: 0x8
    // Offset: 0x18
    System::Data::DataTable* table;
    // Field size check
    static_assert(sizeof(System::Data::DataTable*) == 0x8);
    // readonly System.Type _dataType
    // Size: 0x8
    // Offset: 0x20
    System::Type* dataType;
    // Field size check
    static_assert(sizeof(System::Type*) == 0x8);
    // readonly System.Data.Common.StorageType _storageTypeCode
    // Size: 0x4
    // Offset: 0x28
    System::Data::Common::StorageType storageTypeCode;
    // Field size check
    static_assert(sizeof(System::Data::Common::StorageType) == 0x4);
    // Padding between fields: storageTypeCode and: dbNullBits
    char __padding3[0x4] = {};
    // private System.Collections.BitArray _dbNullBits
    // Size: 0x8
    // Offset: 0x30
    System::Collections::BitArray* dbNullBits;
    // Field size check
    static_assert(sizeof(System::Collections::BitArray*) == 0x8);
    // private readonly System.Object _defaultValue
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppObject* defaultValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // readonly System.Object _nullValue
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppObject* nullValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // readonly System.Boolean _isCloneable
    // Size: 0x1
    // Offset: 0x48
    bool isCloneable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // readonly System.Boolean _isCustomDefinedType
    // Size: 0x1
    // Offset: 0x49
    bool isCustomDefinedType;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // readonly System.Boolean _isStringType
    // Size: 0x1
    // Offset: 0x4A
    bool isStringType;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // readonly System.Boolean _isValueType
    // Size: 0x1
    // Offset: 0x4B
    bool isValueType;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Type[] s_storageClassType
    static ::ArrayW<System::Type*> _get_s_storageClassType();
    // Set static field: static private readonly System.Type[] s_storageClassType
    static void _set_s_storageClassType(::ArrayW<System::Type*> value);
    // Get static field: static private readonly System.Func`2<System.Type,System.Tuple`4<System.Boolean,System.Boolean,System.Boolean,System.Boolean>> s_inspectTypeForInterfaces
    static System::Func_2<System::Type*, System::Tuple_4<bool, bool, bool, bool>*>* _get_s_inspectTypeForInterfaces();
    // Set static field: static private readonly System.Func`2<System.Type,System.Tuple`4<System.Boolean,System.Boolean,System.Boolean,System.Boolean>> s_inspectTypeForInterfaces
