// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Org.BouncyCastle.X509.X509ExtensionBase
#include "Org/BouncyCastle/X509/X509ExtensionBase.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Org::BouncyCastle::Asn1::X509
namespace Org::BouncyCastle::Asn1::X509 {
  // Forward declaring type: X509CertificateStructure
  class X509CertificateStructure;
  // Forward declaring type: BasicConstraints
  class BasicConstraints;
  // Forward declaring type: X509Name
  class X509Name;
  // Forward declaring type: X509Extensions
  class X509Extensions;
}
// Forward declaring namespace: Org::BouncyCastle::Crypto
namespace Org::BouncyCastle::Crypto {
  // Forward declaring type: AsymmetricKeyParameter
  class AsymmetricKeyParameter;
}
// Forward declaring namespace: Org::BouncyCastle::Math
namespace Org::BouncyCastle::Math {
  // Forward declaring type: BigInteger
  class BigInteger;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: DateTime
  struct DateTime;
}
// Completed forward declares
// Type namespace: Org.BouncyCastle.X509
namespace Org::BouncyCastle::X509 {
  // Autogenerated type: Org.BouncyCastle.X509.X509Certificate
  class X509Certificate : public Org::BouncyCastle::X509::X509ExtensionBase {
    public:
    // private readonly Org.BouncyCastle.Asn1.X509.X509CertificateStructure c
    // Offset: 0x10
    Org::BouncyCastle::Asn1::X509::X509CertificateStructure* c;
    // private readonly System.String sigAlgName
    // Offset: 0x18
    ::Il2CppString* sigAlgName;
    // private readonly System.Byte[] sigAlgParams
    // Offset: 0x20
    ::Array<uint8_t>* sigAlgParams;
    // private readonly Org.BouncyCastle.Asn1.X509.BasicConstraints basicConstraints
    // Offset: 0x28
    Org::BouncyCastle::Asn1::X509::BasicConstraints* basicConstraints;
    // private readonly System.Boolean[] keyUsage
    // Offset: 0x30
    ::Array<bool>* keyUsage;
    // private readonly System.Object cacheLock
    // Offset: 0x38
    ::Il2CppObject* cacheLock;
    // private Org.BouncyCastle.Crypto.AsymmetricKeyParameter publicKeyValue
    // Offset: 0x40
    Org::BouncyCastle::Crypto::AsymmetricKeyParameter* publicKeyValue;
    // private System.Boolean hashValueSet
    // Offset: 0x48
    bool hashValueSet;
    // private System.Int32 hashValue
    // Offset: 0x4C
    int hashValue;
    // public System.Void .ctor(Org.BouncyCastle.Asn1.X509.X509CertificateStructure c)
    // Offset: 0x1B38D7C
    static X509Certificate* New_ctor(Org::BouncyCastle::Asn1::X509::X509CertificateStructure* c);
    // public System.Int32 get_Version()
    // Offset: 0x1B39590
    int get_Version();
    // public Org.BouncyCastle.Math.BigInteger get_SerialNumber()
    // Offset: 0x1B395AC
    Org::BouncyCastle::Math::BigInteger* get_SerialNumber();
    // public Org.BouncyCastle.Asn1.X509.X509Name get_IssuerDN()
    // Offset: 0x1B395D8
    Org::BouncyCastle::Asn1::X509::X509Name* get_IssuerDN();
    // public Org.BouncyCastle.Asn1.X509.X509Name get_SubjectDN()
    // Offset: 0x1B395F4
    Org::BouncyCastle::Asn1::X509::X509Name* get_SubjectDN();
    // public System.DateTime get_NotBefore()
    // Offset: 0x1B39610
    System::DateTime get_NotBefore();
    // public System.DateTime get_NotAfter()
    // Offset: 0x1B3963C
    System::DateTime get_NotAfter();
    // public System.Byte[] GetSignature()
    // Offset: 0x1B39668
    ::Array<uint8_t>* GetSignature();
    // public System.String get_SigAlgName()
    // Offset: 0x1B39684
    ::Il2CppString* get_SigAlgName();
    // public Org.BouncyCastle.Crypto.AsymmetricKeyParameter GetPublicKey()
    // Offset: 0x1B396DC
    Org::BouncyCastle::Crypto::AsymmetricKeyParameter* GetPublicKey();
    // public System.Byte[] GetEncoded()
    // Offset: 0x1B397C4
    ::Array<uint8_t>* GetEncoded();
    // protected override Org.BouncyCastle.Asn1.X509.X509Extensions GetX509Extensions()
    // Offset: 0x1B3968C
    // Implemented from: Org.BouncyCastle.X509.X509ExtensionBase
    // Base method: Org.BouncyCastle.Asn1.X509.X509Extensions X509ExtensionBase::GetX509Extensions()
    Org::BouncyCastle::Asn1::X509::X509Extensions* GetX509Extensions();
    // public override System.Boolean Equals(System.Object other)
    // Offset: 0x1B397E0
    // Implemented from: System.Object
    // Base method: System.Boolean Object::Equals(System.Object other)
    bool Equals(::Il2CppObject* other);
    // public override System.Int32 GetHashCode()
    // Offset: 0x1B39908
    // Implemented from: System.Object
    // Base method: System.Int32 Object::GetHashCode()
    int GetHashCode();
    // public override System.String ToString()
    // Offset: 0x1B39970
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::Il2CppString* ToString();
  }; // Org.BouncyCastle.X509.X509Certificate
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Org::BouncyCastle::X509::X509Certificate*, "Org.BouncyCastle.X509", "X509Certificate");
#pragma pack(pop)
