// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Org.BouncyCastle.X509.X509ExtensionBase
#include "Org/BouncyCastle/X509/X509ExtensionBase.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Org::BouncyCastle::Asn1::X509
namespace Org::BouncyCastle::Asn1::X509 {
  // Forward declaring type: CertificateList
  class CertificateList;
  // Forward declaring type: X509Name
  class X509Name;
  // Forward declaring type: X509Extensions
  class X509Extensions;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: DateTime
  struct DateTime;
}
// Forward declaring namespace: Org::BouncyCastle::Utilities::Date
namespace Org::BouncyCastle::Utilities::Date {
  // Forward declaring type: DateTimeObject
  class DateTimeObject;
}
// Forward declaring namespace: Org::BouncyCastle::Utilities::Collections
namespace Org::BouncyCastle::Utilities::Collections {
  // Forward declaring type: ISet
  class ISet;
}
// Completed forward declares
// Type namespace: Org.BouncyCastle.X509
namespace Org::BouncyCastle::X509 {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Org.BouncyCastle.X509.X509Crl
  // [] Offset: FFFFFFFF
  class X509Crl : public Org::BouncyCastle::X509::X509ExtensionBase {
    public:
    // private readonly Org.BouncyCastle.Asn1.X509.CertificateList c
    // Size: 0x8
    // Offset: 0x10
    Org::BouncyCastle::Asn1::X509::CertificateList* c;
    // Field size check
    static_assert(sizeof(Org::BouncyCastle::Asn1::X509::CertificateList*) == 0x8);
    // private readonly System.String sigAlgName
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* sigAlgName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.Byte[] sigAlgParams
    // Size: 0x8
    // Offset: 0x20
    ::Array<uint8_t>* sigAlgParams;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private readonly System.Boolean isIndirect
    // Size: 0x1
    // Offset: 0x28
    bool isIndirect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hashValueSet
    // Size: 0x1
    // Offset: 0x29
    bool hashValueSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hashValueSet and: hashValue
    char __padding4[0x2] = {};
    // private System.Int32 hashValue
    // Size: 0x4
    // Offset: 0x2C
    int hashValue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: X509Crl
    X509Crl(Org::BouncyCastle::Asn1::X509::CertificateList* c_ = {}, ::Il2CppString* sigAlgName_ = {}, ::Array<uint8_t>* sigAlgParams_ = {}, bool isIndirect_ = {}, bool hashValueSet_ = {}, int hashValue_ = {}) noexcept : c{c_}, sigAlgName{sigAlgName_}, sigAlgParams{sigAlgParams_}, isIndirect{isIndirect_}, hashValueSet{hashValueSet_}, hashValue{hashValue_} {}
    // public System.Void .ctor(Org.BouncyCastle.Asn1.X509.CertificateList c)
    // Offset: 0x1E2F3D0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static X509Crl* New_ctor(Org::BouncyCastle::Asn1::X509::CertificateList* c) {
      static auto ___internal__logger = ::Logger::get().WithContext("Org::BouncyCastle::X509::X509Crl::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<X509Crl*, creationType>(c)));
    }
    // public System.Int32 get_Version()
    // Offset: 0x1E2F5DC
    int get_Version_NEW();
    // public Org.BouncyCastle.Asn1.X509.X509Name get_IssuerDN()
    // Offset: 0x1E2F5F8
    Org::BouncyCastle::Asn1::X509::X509Name* get_IssuerDN_NEW();
    // public System.DateTime get_ThisUpdate()
    // Offset: 0x1E2F614
    System::DateTime get_ThisUpdate_NEW();
    // public Org.BouncyCastle.Utilities.Date.DateTimeObject get_NextUpdate()
    // Offset: 0x1E2F640
    Org::BouncyCastle::Utilities::Date::DateTimeObject* get_NextUpdate_NEW();
    // private Org.BouncyCastle.Utilities.Collections.ISet LoadCrlEntries()
    // Offset: 0x1E2F6E8
    Org::BouncyCastle::Utilities::Collections::ISet* LoadCrlEntries();
    // public Org.BouncyCastle.Utilities.Collections.ISet GetRevokedCertificates()
    // Offset: 0x1E2FAF8
    Org::BouncyCastle::Utilities::Collections::ISet* GetRevokedCertificates_NEW();
    // public System.Byte[] GetSignature()
    // Offset: 0x1E2FBC0
    ::Array<uint8_t>* GetSignature_NEW();
    // public System.String get_SigAlgName()
    // Offset: 0x1E2FBDC
    ::Il2CppString* get_SigAlgName_NEW();
    // protected System.Boolean get_IsIndirectCrl()
    // Offset: 0x1E30BC0
    bool get_IsIndirectCrl_NEW();
    // protected override Org.BouncyCastle.Asn1.X509.X509Extensions GetX509Extensions()
    // Offset: 0x1E2F58C
    // Implemented from: Org.BouncyCastle.X509.X509ExtensionBase
    // Base method: Org.BouncyCastle.Asn1.X509.X509Extensions X509ExtensionBase::GetX509Extensions_NEW()
    Org::BouncyCastle::Asn1::X509::X509Extensions* GetX509Extensions();
    // public override System.Boolean Equals(System.Object other)
    // Offset: 0x1E2FBE4
    // Implemented from: System.Object
    // Base method: System.Boolean Object::Equals_NEW(System.Object other)
    bool Equals(::Il2CppObject* other);
    // public override System.Int32 GetHashCode()
    // Offset: 0x1E2FD0C
    // Implemented from: System.Object
    // Base method: System.Int32 Object::GetHashCode_NEW()
    int GetHashCode();
    // public override System.String ToString()
    // Offset: 0x1E2FD74
    // Implemented from: System.Object
    // Base method: System.String Object::ToString_NEW()
    ::Il2CppString* ToString();
  }; // Org.BouncyCastle.X509.X509Crl
  #pragma pack(pop)
  static check_size<sizeof(X509Crl), 44 + sizeof(int)> __Org_BouncyCastle_X509_X509CrlSizeCheck;
  static_assert(sizeof(X509Crl) == 0x30);
}
DEFINE_IL2CPP_ARG_TYPE(Org::BouncyCastle::X509::X509Crl*, "Org.BouncyCastle.X509", "X509Crl");
