// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Int32
#include "System/Int32.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Xft
namespace Xft {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector3
  struct Vector3;
  // Forward declaring type: Vector2
  struct Vector2;
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Mesh
  class Mesh;
}
// Completed forward declares
// Type namespace: Xft
namespace Xft {
  // Autogenerated type: Xft.VertexPool
  class VertexPool : public ::Il2CppObject {
    public:
    // Nested type: Xft::VertexPool::VertexSegment
    class VertexSegment;
    // public UnityEngine.Vector3[] vertices
    // Offset: 0x10
    ::Array<UnityEngine::Vector3>* vertices;
    // public System.Int32[] indices
    // Offset: 0x18
    ::Array<int>* indices;
    // public UnityEngine.Vector2[] uvs
    // Offset: 0x20
    ::Array<UnityEngine::Vector2>* uvs;
    // public UnityEngine.Color[] colors
    // Offset: 0x28
    ::Array<UnityEngine::Color>* colors;
    // public System.Boolean indiceChanged
    // Offset: 0x30
    bool indiceChanged;
    // public System.Boolean colorChanged
    // Offset: 0x31
    bool colorChanged;
    // public System.Boolean uvChanged
    // Offset: 0x32
    bool uvChanged;
    // public System.Boolean vertChanged
    // Offset: 0x33
    bool vertChanged;
    // public System.Boolean uv2Changed
    // Offset: 0x34
    bool uv2Changed;
    // private System.Int32 _vertexTotal
    // Offset: 0x38
    int vertexTotal;
    // private System.Int32 _vertexUsed
    // Offset: 0x3C
    int vertexUsed;
    // private System.Int32 _indexTotal
    // Offset: 0x40
    int indexTotal;
    // private System.Int32 _indexUsed
    // Offset: 0x44
    int indexUsed;
    // private System.Boolean _vertCountChanged
    // Offset: 0x48
    bool vertCountChanged;
    // private UnityEngine.Mesh _mesh
    // Offset: 0x50
    UnityEngine::Mesh* mesh;
    // static field const value: static private System.Int32 _blockSize
    static constexpr const int _blockSize = 108;
    // Get static field: static private System.Int32 _blockSize
    static int _get__blockSize();
    // Set static field: static private System.Int32 _blockSize
    static void _set__blockSize(int value);
    // public System.Void .ctor(UnityEngine.Mesh mesh)
    // Offset: 0xC576BC
    static VertexPool* New_ctor(UnityEngine::Mesh* mesh);
    // public Xft.VertexPool/VertexSegment GetVertices(System.Int32 vcount, System.Int32 icount)
    // Offset: 0xC577F4
    Xft::VertexPool::VertexSegment* GetVertices(int vcount, int icount);
    // public System.Void EnlargeArrays(System.Int32 count, System.Int32 icount)
    // Offset: 0xC57944
    void EnlargeArrays(int count, int icount);
    // public System.Void ManualUpdate(System.Single deltaTime)
    // Offset: 0xC57B30
    void ManualUpdate(float deltaTime);
  }; // Xft.VertexPool
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Xft::VertexPool*, "Xft", "VertexPool");
#pragma pack(pop)
