// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: Xft.VertexPool
#include "Xft/VertexPool.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Xft
namespace Xft {
  // Forward declaring type: Spline
  class Spline;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: XWeaponTrailRenderer
  class XWeaponTrailRenderer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Xft
namespace Xft {
  // Autogenerated type: Xft.XWeaponTrail
  class XWeaponTrail : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: Xft::XWeaponTrail::Element
    class Element;
    // Nested type: Xft::XWeaponTrail::ElementPool
    class ElementPool;
    // private XWeaponTrailRenderer _trailRendererPrefab
    // Offset: 0x18
    GlobalNamespace::XWeaponTrailRenderer* trailRendererPrefab;
    // private UnityEngine.Transform _pointStart
    // Offset: 0x20
    UnityEngine::Transform* pointStart;
    // private UnityEngine.Transform _pointEnd
    // Offset: 0x28
    UnityEngine::Transform* pointEnd;
    // private System.Int32 _maxFrame
    // Offset: 0x30
    int maxFrame;
    // private System.Int32 _granularity
    // Offset: 0x34
    int granularity;
    // private System.Int32 _whiteSteps
    // Offset: 0x38
    int whiteSteps;
    // private UnityEngine.Color _color
    // Offset: 0x3C
    UnityEngine::Color color;
    // private System.Int32 _skipFirstFrames
    // Offset: 0x4C
    int skipFirstFrames;
    // private System.Single _trailWidth
    // Offset: 0x50
    float trailWidth;
    // private System.Collections.Generic.List`1<Xft.XWeaponTrail/Element> _snapshotList
    // Offset: 0x58
    System::Collections::Generic::List_1<Xft::XWeaponTrail::Element*>* snapshotList;
    // private Xft.XWeaponTrail/ElementPool _elemPool
    // Offset: 0x60
    Xft::XWeaponTrail::ElementPool* elemPool;
    // private Xft.Spline _spline
    // Offset: 0x68
    Xft::Spline* spline;
    // private Xft.VertexPool _vertexPool
    // Offset: 0x70
    Xft::VertexPool* vertexPool;
    // private Xft.VertexPool/VertexSegment _vertexSegment
    // Offset: 0x78
    Xft::VertexPool::VertexSegment* vertexSegment;
    // private XWeaponTrailRenderer _trailRenderer
    // Offset: 0x80
    GlobalNamespace::XWeaponTrailRenderer* trailRenderer;
    // private System.Int32 _frameNum
    // Offset: 0x88
    int frameNum;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public UnityEngine.Vector3 get_curHeadPos()
    // Offset: 0xC57D58
    UnityEngine::Vector3 get_curHeadPos();
    // public UnityEngine.Color get_color()
    // Offset: 0xC57E34
    UnityEngine::Color get_color();
    // public System.Void set_color(UnityEngine.Color value)
    // Offset: 0xC57E40
    void set_color(UnityEngine::Color value);
    // protected System.Void Start()
    // Offset: 0xC57E4C
    void Start();
    // protected System.Void OnEnable()
    // Offset: 0xC58414
    void OnEnable();
    // protected System.Void OnDisable()
    // Offset: 0xC5841C
    void OnDisable();
    // protected System.Void LateUpdate()
    // Offset: 0xC584B0
    void LateUpdate();
    // protected System.Void OnDestroy()
    // Offset: 0xC5902C
    void OnDestroy();
    // private System.Void OnDrawGizmosSelected()
    // Offset: 0xC590F8
    void OnDrawGizmosSelected();
    // private System.Void RefreshSpline()
    // Offset: 0xC58A24
    void RefreshSpline();
    // protected System.Void UpdateVertices()
    // Offset: 0xC58C2C
    void UpdateVertices();
    // protected System.Void UpdateIndices()
    // Offset: 0xC581B8
    void UpdateIndices();
    // protected System.Void UpdateHeadElem()
    // Offset: 0xC58838
    void UpdateHeadElem();
    // private System.Void RecordCurElem()
    // Offset: 0xC588F4
    void RecordCurElem();
    // public System.Void .ctor()
    // Offset: 0xC59508
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static XWeaponTrail* New_ctor();
  }; // Xft.XWeaponTrail
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Xft::XWeaponTrail*, "Xft", "XWeaponTrail");
#pragma pack(pop)
