// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: Newtonsoft.Json.Required
#include "Newtonsoft/Json/Required.hpp"
// Including type: Newtonsoft.Json.NullValueHandling
#include "Newtonsoft/Json/NullValueHandling.hpp"
// Including type: Newtonsoft.Json.DefaultValueHandling
#include "Newtonsoft/Json/DefaultValueHandling.hpp"
// Including type: Newtonsoft.Json.ReferenceLoopHandling
#include "Newtonsoft/Json/ReferenceLoopHandling.hpp"
// Including type: Newtonsoft.Json.ObjectCreationHandling
#include "Newtonsoft/Json/ObjectCreationHandling.hpp"
// Including type: Newtonsoft.Json.TypeNameHandling
#include "Newtonsoft/Json/TypeNameHandling.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Predicate`1<T>
  template<typename T>
  class Predicate_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: Newtonsoft::Json::Serialization
namespace Newtonsoft::Json::Serialization {
  // Forward declaring type: JsonContract
  class JsonContract;
  // Forward declaring type: IValueProvider
  class IValueProvider;
  // Forward declaring type: IAttributeProvider
  class IAttributeProvider;
}
// Forward declaring namespace: Newtonsoft::Json
namespace Newtonsoft::Json {
  // Forward declaring type: JsonConverter
  class JsonConverter;
  // Forward declaring type: JsonWriter
  class JsonWriter;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json.Serialization
namespace Newtonsoft::Json::Serialization {
  // Forward declaring type: JsonProperty
  class JsonProperty;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Newtonsoft::Json::Serialization::JsonProperty);
DEFINE_IL2CPP_ARG_TYPE(::Newtonsoft::Json::Serialization::JsonProperty*, "Newtonsoft.Json.Serialization", "JsonProperty");
// Type namespace: Newtonsoft.Json.Serialization
namespace Newtonsoft::Json::Serialization {
  // WARNING Size may be invalid!
  // Autogenerated type: Newtonsoft.Json.Serialization.JsonProperty
  // [TokenAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: FFFFFFFF
  class JsonProperty : public ::Il2CppObject {
    public:
    public:
    // System.Nullable`1<Newtonsoft.Json.Required> _required
    // Size: 0xFFFFFFFF
    // Offset: 0x10
    ::System::Nullable_1<::Newtonsoft::Json::Required> required;
    // System.Boolean _hasExplicitDefaultValue
    // Size: 0x1
    // Offset: 0x18
    bool hasExplicitDefaultValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Object _defaultValue
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* defaultValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean _hasGeneratedDefaultValue
    // Size: 0x1
    // Offset: 0x28
    bool hasGeneratedDefaultValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.String _propertyName
    // Size: 0x8
    // Offset: 0x30
    ::StringW propertyName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Boolean _skipPropertyNameEscape
    // Size: 0x1
    // Offset: 0x38
    bool skipPropertyNameEscape;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Type _propertyType
    // Size: 0x8
    // Offset: 0x40
    ::System::Type* propertyType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private Newtonsoft.Json.Serialization.JsonContract <PropertyContract>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::Newtonsoft::Json::Serialization::JsonContract* PropertyContract;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Serialization::JsonContract*) == 0x8);
    // private System.Type <DeclaringType>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::System::Type* DeclaringType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private System.Nullable`1<System.Int32> <Order>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0x58
    ::System::Nullable_1<int> Order;
    // private System.String <UnderlyingName>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::StringW UnderlyingName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Newtonsoft.Json.Serialization.IValueProvider <ValueProvider>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::Newtonsoft::Json::Serialization::IValueProvider* ValueProvider;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Serialization::IValueProvider*) == 0x8);
    // private Newtonsoft.Json.Serialization.IAttributeProvider <AttributeProvider>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::Newtonsoft::Json::Serialization::IAttributeProvider* AttributeProvider;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Serialization::IAttributeProvider*) == 0x8);
    // private Newtonsoft.Json.JsonConverter <Converter>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::Newtonsoft::Json::JsonConverter* Converter;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::JsonConverter*) == 0x8);
    // private Newtonsoft.Json.JsonConverter <MemberConverter>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::Newtonsoft::Json::JsonConverter* MemberConverter;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::JsonConverter*) == 0x8);
    // private System.Boolean <Ignored>k__BackingField
    // Size: 0x1
    // Offset: 0x88
    bool Ignored;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <Readable>k__BackingField
    // Size: 0x1
    // Offset: 0x89
    bool Readable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <Writable>k__BackingField
    // Size: 0x1
    // Offset: 0x8A
    bool Writable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <HasMemberAttribute>k__BackingField
    // Size: 0x1
    // Offset: 0x8B
    bool HasMemberAttribute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Boolean> <IsReference>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0x8C
    ::System::Nullable_1<bool> IsReference;
    // private System.Nullable`1<Newtonsoft.Json.NullValueHandling> <NullValueHandling>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0x90
    ::System::Nullable_1<::Newtonsoft::Json::NullValueHandling> NullValueHandling;
    // private System.Nullable`1<Newtonsoft.Json.DefaultValueHandling> <DefaultValueHandling>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0x98
    ::System::Nullable_1<::Newtonsoft::Json::DefaultValueHandling> DefaultValueHandling;
    // private System.Nullable`1<Newtonsoft.Json.ReferenceLoopHandling> <ReferenceLoopHandling>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0xA0
    ::System::Nullable_1<::Newtonsoft::Json::ReferenceLoopHandling> ReferenceLoopHandling;
    // private System.Nullable`1<Newtonsoft.Json.ObjectCreationHandling> <ObjectCreationHandling>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0xA8
    ::System::Nullable_1<::Newtonsoft::Json::ObjectCreationHandling> ObjectCreationHandling;
    // private System.Nullable`1<Newtonsoft.Json.TypeNameHandling> <TypeNameHandling>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0xB0
    ::System::Nullable_1<::Newtonsoft::Json::TypeNameHandling> TypeNameHandling;
    // private System.Predicate`1<System.Object> <ShouldSerialize>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::System::Predicate_1<::Il2CppObject*>* ShouldSerialize;
    // Field size check
    static_assert(sizeof(::System::Predicate_1<::Il2CppObject*>*) == 0x8);
    // private System.Predicate`1<System.Object> <ShouldDeserialize>k__BackingField
    // Size: 0x8
    // Offset: 0xC0
    ::System::Predicate_1<::Il2CppObject*>* ShouldDeserialize;
    // Field size check
    static_assert(sizeof(::System::Predicate_1<::Il2CppObject*>*) == 0x8);
    // private System.Predicate`1<System.Object> <GetIsSpecified>k__BackingField
    // Size: 0x8
    // Offset: 0xC8
    ::System::Predicate_1<::Il2CppObject*>* GetIsSpecified;
    // Field size check
    static_assert(sizeof(::System::Predicate_1<::Il2CppObject*>*) == 0x8);
    // private System.Action`2<System.Object,System.Object> <SetIsSpecified>k__BackingField
    // Size: 0x8
    // Offset: 0xD0
    ::System::Action_2<::Il2CppObject*, ::Il2CppObject*>* SetIsSpecified;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    // private Newtonsoft.Json.JsonConverter <ItemConverter>k__BackingField
    // Size: 0x8
    // Offset: 0xD8
    ::Newtonsoft::Json::JsonConverter* ItemConverter;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::JsonConverter*) == 0x8);
    // private System.Nullable`1<System.Boolean> <ItemIsReference>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0xE0
    ::System::Nullable_1<bool> ItemIsReference;
    // private System.Nullable`1<Newtonsoft.Json.TypeNameHandling> <ItemTypeNameHandling>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0xE4
    ::System::Nullable_1<::Newtonsoft::Json::TypeNameHandling> ItemTypeNameHandling;
    // private System.Nullable`1<Newtonsoft.Json.ReferenceLoopHandling> <ItemReferenceLoopHandling>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0xEC
    ::System::Nullable_1<::Newtonsoft::Json::ReferenceLoopHandling> ItemReferenceLoopHandling;
    public:
    // Get instance field reference: System.Nullable`1<Newtonsoft.Json.Required> _required
    [[deprecated("Use field access instead!")]] ::System::Nullable_1<::Newtonsoft::Json::Required>& dyn__required();
    // Get instance field reference: System.Boolean _hasExplicitDefaultValue
    [[deprecated("Use field access instead!")]] bool& dyn__hasExplicitDefaultValue();
    // Get instance field reference: private System.Object _defaultValue
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn__defaultValue();
    // Get instance field reference: private System.Boolean _hasGeneratedDefaultValue
    [[deprecated("Use field access instead!")]] bool& dyn__hasGeneratedDefaultValue();
    // Get instance field reference: private System.String _propertyName
    [[deprecated("Use field access instead!")]] ::StringW& dyn__propertyName();
