// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Newtonsoft.Json.ReadType
#include "Newtonsoft/Json/ReadType.hpp"
// Including type: Newtonsoft.Json.Serialization.JsonContractType
#include "Newtonsoft/Json/Serialization/JsonContractType.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Newtonsoft::Json::Serialization
namespace Newtonsoft::Json::Serialization {
  // Forward declaring type: SerializationCallback
  class SerializationCallback;
  // Forward declaring type: SerializationErrorCallback
  class SerializationErrorCallback;
  // Forward declaring type: ErrorContext
  class ErrorContext;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Forward declaring namespace: Newtonsoft::Json
namespace Newtonsoft::Json {
  // Forward declaring type: JsonConverter
  class JsonConverter;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: MethodInfo
  class MethodInfo;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json.Serialization
namespace Newtonsoft::Json::Serialization {
  // Forward declaring type: JsonContract
  class JsonContract;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Newtonsoft::Json::Serialization::JsonContract);
DEFINE_IL2CPP_ARG_TYPE(::Newtonsoft::Json::Serialization::JsonContract*, "Newtonsoft.Json.Serialization", "JsonContract");
// Type namespace: Newtonsoft.Json.Serialization
namespace Newtonsoft::Json::Serialization {
  // WARNING Size may be invalid!
  // Autogenerated type: Newtonsoft.Json.Serialization.JsonContract
  // [TokenAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: FFFFFFFF
  class JsonContract : public ::Il2CppObject {
    public:
    // Nested type: ::Newtonsoft::Json::Serialization::JsonContract::$$c__DisplayClass73_0
    class $$c__DisplayClass73_0;
    // Nested type: ::Newtonsoft::Json::Serialization::JsonContract::$$c__DisplayClass74_0
    class $$c__DisplayClass74_0;
    public:
    // System.Boolean IsNullable
    // Size: 0x1
    // Offset: 0x10
    bool IsNullable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean IsConvertable
    // Size: 0x1
    // Offset: 0x11
    bool IsConvertable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean IsEnum
    // Size: 0x1
    // Offset: 0x12
    bool IsEnum;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Type NonNullableUnderlyingType
    // Size: 0x8
    // Offset: 0x18
    ::System::Type* NonNullableUnderlyingType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // Newtonsoft.Json.ReadType InternalReadType
    // Size: 0x4
    // Offset: 0x20
    ::Newtonsoft::Json::ReadType InternalReadType;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::ReadType) == 0x4);
    // Newtonsoft.Json.Serialization.JsonContractType ContractType
    // Size: 0x4
    // Offset: 0x24
    ::Newtonsoft::Json::Serialization::JsonContractType ContractType;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Serialization::JsonContractType) == 0x4);
    // System.Boolean IsReadOnlyOrFixedSize
    // Size: 0x1
    // Offset: 0x28
    bool IsReadOnlyOrFixedSize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean IsSealed
    // Size: 0x1
    // Offset: 0x29
    bool IsSealed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean IsInstantiable
    // Size: 0x1
    // Offset: 0x2A
    bool IsInstantiable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Collections.Generic.List`1<Newtonsoft.Json.Serialization.SerializationCallback> _onDeserializedCallbacks
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::Newtonsoft::Json::Serialization::SerializationCallback*>* onDeserializedCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Newtonsoft::Json::Serialization::SerializationCallback*>*) == 0x8);
    // private System.Collections.Generic.IList`1<Newtonsoft.Json.Serialization.SerializationCallback> _onDeserializingCallbacks
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::IList_1<::Newtonsoft::Json::Serialization::SerializationCallback*>* onDeserializingCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::Newtonsoft::Json::Serialization::SerializationCallback*>*) == 0x8);
    // private System.Collections.Generic.IList`1<Newtonsoft.Json.Serialization.SerializationCallback> _onSerializedCallbacks
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::IList_1<::Newtonsoft::Json::Serialization::SerializationCallback*>* onSerializedCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::Newtonsoft::Json::Serialization::SerializationCallback*>*) == 0x8);
    // private System.Collections.Generic.IList`1<Newtonsoft.Json.Serialization.SerializationCallback> _onSerializingCallbacks
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::IList_1<::Newtonsoft::Json::Serialization::SerializationCallback*>* onSerializingCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::Newtonsoft::Json::Serialization::SerializationCallback*>*) == 0x8);
    // private System.Collections.Generic.IList`1<Newtonsoft.Json.Serialization.SerializationErrorCallback> _onErrorCallbacks
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::IList_1<::Newtonsoft::Json::Serialization::SerializationErrorCallback*>* onErrorCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::Newtonsoft::Json::Serialization::SerializationErrorCallback*>*) == 0x8);
    // private System.Type _createdType
    // Size: 0x8
    // Offset: 0x58
    ::System::Type* createdType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private System.Type <UnderlyingType>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::System::Type* UnderlyingType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private System.Nullable`1<System.Boolean> <IsReference>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0x68
    ::System::Nullable_1<bool> IsReference;
    // private Newtonsoft.Json.JsonConverter <Converter>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::Newtonsoft::Json::JsonConverter* Converter;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::JsonConverter*) == 0x8);
    // private Newtonsoft.Json.JsonConverter <InternalConverter>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::Newtonsoft::Json::JsonConverter* InternalConverter;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::JsonConverter*) == 0x8);
    // private System.Func`1<System.Object> <DefaultCreator>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::System::Func_1<::Il2CppObject*>* DefaultCreator;
    // Field size check
    static_assert(sizeof(::System::Func_1<::Il2CppObject*>*) == 0x8);
    // private System.Boolean <DefaultCreatorNonPublic>k__BackingField
    // Size: 0x1
    // Offset: 0x88
    bool DefaultCreatorNonPublic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: System.Boolean IsNullable
    [[deprecated("Use field access instead!")]] bool& dyn_IsNullable();
    // Get instance field reference: System.Boolean IsConvertable
    [[deprecated("Use field access instead!")]] bool& dyn_IsConvertable();
    // Get instance field reference: System.Boolean IsEnum
    [[deprecated("Use field access instead!")]] bool& dyn_IsEnum();
    // Get instance field reference: System.Type NonNullableUnderlyingType
    [[deprecated("Use field access instead!")]] ::System::Type*& dyn_NonNullableUnderlyingType();
    // Get instance field reference: Newtonsoft.Json.ReadType InternalReadType
    [[deprecated("Use field access instead!")]] ::Newtonsoft::Json::ReadType& dyn_InternalReadType();
    // Get instance field reference: Newtonsoft.Json.Serialization.JsonContractType ContractType
