// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Newtonsoft.Json.Serialization.JsonContainerContract
#include "Newtonsoft/Json/Serialization/JsonContainerContract.hpp"
// Including type: Newtonsoft.Json.MemberSerialization
#include "Newtonsoft/Json/MemberSerialization.hpp"
// Including type: Newtonsoft.Json.MissingMemberHandling
#include "Newtonsoft/Json/MissingMemberHandling.hpp"
// Including type: Newtonsoft.Json.Required
#include "Newtonsoft/Json/Required.hpp"
// Including type: Newtonsoft.Json.NullValueHandling
#include "Newtonsoft/Json/NullValueHandling.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Newtonsoft::Json::Serialization
namespace Newtonsoft::Json::Serialization {
  // Forward declaring type: JsonPropertyCollection
  class JsonPropertyCollection;
  // Forward declaring type: ExtensionDataSetter
  class ExtensionDataSetter;
  // Forward declaring type: ExtensionDataGetter
  class ExtensionDataGetter;
  // Forward declaring type: ObjectConstructor`1<T>
  class ObjectConstructor_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  class Func_2;
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json.Serialization
namespace Newtonsoft::Json::Serialization {
  // Forward declaring type: JsonObjectContract
  class JsonObjectContract;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(Newtonsoft::Json::Serialization::JsonObjectContract);
DEFINE_IL2CPP_ARG_TYPE(Newtonsoft::Json::Serialization::JsonObjectContract*, "Newtonsoft.Json.Serialization", "JsonObjectContract");
// Type namespace: Newtonsoft.Json.Serialization
namespace Newtonsoft::Json::Serialization {
  // WARNING Size may be invalid!
  // Autogenerated type: Newtonsoft.Json.Serialization.JsonObjectContract
  // [TokenAttribute] Offset: FFFFFFFF
  // [NullableContextAttribute] Offset: 1202A28
  // [NullableAttribute] Offset: 1202A28
  class JsonObjectContract : public Newtonsoft::Json::Serialization::JsonContainerContract {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private Newtonsoft.Json.MemberSerialization <MemberSerialization>k__BackingField
    // Size: 0x4
    // Offset: 0xBC
    Newtonsoft::Json::MemberSerialization MemberSerialization;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::MemberSerialization) == 0x4);
    // private System.Nullable`1<Newtonsoft.Json.MissingMemberHandling> <MissingMemberHandling>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0xC0
    System::Nullable_1<Newtonsoft::Json::MissingMemberHandling> MissingMemberHandling;
    // private System.Nullable`1<Newtonsoft.Json.Required> <ItemRequired>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0xC8
    System::Nullable_1<Newtonsoft::Json::Required> ItemRequired;
    // private System.Nullable`1<Newtonsoft.Json.NullValueHandling> <ItemNullValueHandling>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0xD0
    System::Nullable_1<Newtonsoft::Json::NullValueHandling> ItemNullValueHandling;
    // [NullableAttribute] Offset: 0x1206474
    // private readonly Newtonsoft.Json.Serialization.JsonPropertyCollection <Properties>k__BackingField
    // Size: 0x8
    // Offset: 0xD8
    Newtonsoft::Json::Serialization::JsonPropertyCollection* Properties;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::JsonPropertyCollection*) == 0x8);
    // private Newtonsoft.Json.Serialization.ExtensionDataSetter <ExtensionDataSetter>k__BackingField
    // Size: 0x8
    // Offset: 0xE0
    Newtonsoft::Json::Serialization::ExtensionDataSetter* ExtensionDataSetter;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::ExtensionDataSetter*) == 0x8);
    // private Newtonsoft.Json.Serialization.ExtensionDataGetter <ExtensionDataGetter>k__BackingField
    // Size: 0x8
    // Offset: 0xE8
    Newtonsoft::Json::Serialization::ExtensionDataGetter* ExtensionDataGetter;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::ExtensionDataGetter*) == 0x8);
    // [NullableAttribute] Offset: 0x12064D0
    // private System.Func`2<System.String,System.String> <ExtensionDataNameResolver>k__BackingField
    // Size: 0x8
    // Offset: 0xF0
    System::Func_2<::StringW, ::StringW>* ExtensionDataNameResolver;
    // Field size check
    static_assert(sizeof(System::Func_2<::StringW, ::StringW>*) == 0x8);
    // System.Boolean ExtensionDataIsJToken
    // Size: 0x1
    // Offset: 0xF8
    bool ExtensionDataIsJToken;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Boolean> _hasRequiredOrDefaultValueProperties
    // Size: 0xFFFFFFFF
    // Offset: 0xF9
    System::Nullable_1<bool> hasRequiredOrDefaultValueProperties;
    // [NullableAttribute] Offset: 0x1206554
    // private Newtonsoft.Json.Serialization.ObjectConstructor`1<System.Object> _overrideCreator
    // Size: 0x8
    // Offset: 0x100
    Newtonsoft::Json::Serialization::ObjectConstructor_1<::Il2CppObject*>* overrideCreator;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::ObjectConstructor_1<::Il2CppObject*>*) == 0x8);
    // [NullableAttribute] Offset: 0x12065C0
    // private Newtonsoft.Json.Serialization.ObjectConstructor`1<System.Object> _parameterizedCreator
    // Size: 0x8
    // Offset: 0x108
    Newtonsoft::Json::Serialization::ObjectConstructor_1<::Il2CppObject*>* parameterizedCreator;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::ObjectConstructor_1<::Il2CppObject*>*) == 0x8);
    // private Newtonsoft.Json.Serialization.JsonPropertyCollection _creatorParameters
    // Size: 0x8
    // Offset: 0x110
    Newtonsoft::Json::Serialization::JsonPropertyCollection* creatorParameters;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::JsonPropertyCollection*) == 0x8);
    // private System.Type _extensionDataValueType
    // Size: 0x8
    // Offset: 0x118
    System::Type* extensionDataValueType;
    // Field size check
    static_assert(sizeof(System::Type*) == 0x8);
    public:
    // Get instance field reference: private Newtonsoft.Json.MemberSerialization <MemberSerialization>k__BackingField
    Newtonsoft::Json::MemberSerialization& dyn_$MemberSerialization$k__BackingField();
    // Get instance field reference: private System.Nullable`1<Newtonsoft.Json.MissingMemberHandling> <MissingMemberHandling>k__BackingField
    System::Nullable_1<Newtonsoft::Json::MissingMemberHandling>& dyn_$MissingMemberHandling$k__BackingField();
    // Get instance field reference: private System.Nullable`1<Newtonsoft.Json.Required> <ItemRequired>k__BackingField
    System::Nullable_1<Newtonsoft::Json::Required>& dyn_$ItemRequired$k__BackingField();
    // Get instance field reference: private System.Nullable`1<Newtonsoft.Json.NullValueHandling> <ItemNullValueHandling>k__BackingField
