// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Timeline.TrackAsset
#include "UnityEngine/Timeline/TrackAsset.hpp"
// Including type: UnityEngine.Timeline.ILayerable
#include "UnityEngine/Timeline/ILayerable.hpp"
// Including type: UnityEngine.Timeline.TimelineClip/ClipExtrapolation
#include "UnityEngine/Timeline/TimelineClip.hpp"
// Including type: UnityEngine.Timeline.AnimationPlayableAsset/LoopMode
#include "UnityEngine/Timeline/AnimationPlayableAsset.hpp"
// Including type: UnityEngine.Timeline.MatchTargetFields
#include "UnityEngine/Timeline/MatchTargetFields.hpp"
// Including type: UnityEngine.Timeline.TrackOffset
#include "UnityEngine/Timeline/TrackOffset.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Timeline
namespace UnityEngine::Timeline {
  // Skipping declaration: TimelineClip because it is already included!
  // Forward declaring type: IntervalTree`1<T>
  template<typename T>
  class IntervalTree_1;
  // Forward declaring type: RuntimeElement
  class RuntimeElement;
  // Forward declaring type: AppliedOffsetMode
  struct AppliedOffsetMode;
  // Forward declaring type: IPropertyCollector
  class IPropertyCollector;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AvatarMask
  class AvatarMask;
  // Forward declaring type: AnimationClip
  class AnimationClip;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Animator
  class Animator;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine::Playables
namespace UnityEngine::Playables {
  // Skipping declaration: Playable because it is already included!
  // Forward declaring type: PlayableGraph
  struct PlayableGraph;
  // Forward declaring type: PlayableDirector
  class PlayableDirector;
}
// Forward declaring namespace: UnityEngine::Animations
namespace UnityEngine::Animations {
  // Forward declaring type: AnimationLayerMixerPlayable
  struct AnimationLayerMixerPlayable;
}
// Completed forward declares
// Type namespace: UnityEngine.Timeline
namespace UnityEngine::Timeline {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Timeline.AnimationTrack
  // [TrackClipTypeAttribute] Offset: CFC944
  // [TrackBindingTypeAttribute] Offset: CFC944
  // [ExcludeFromPresetAttribute] Offset: CFC944
  class AnimationTrack : public UnityEngine::Timeline::TrackAsset/*, public UnityEngine::Timeline::ILayerable*/ {
    public:
    // Nested type: UnityEngine::Timeline::AnimationTrack::AnimationTrackUpgrade
    class AnimationTrackUpgrade;
    // Nested type: UnityEngine::Timeline::AnimationTrack::$get_outputs$d__49
    class $get_outputs$d__49;
    // [FormerlySerializedAsAttribute] Offset: 0xCFD258
    // private UnityEngine.Timeline.TimelineClip/ClipExtrapolation m_InfiniteClipPreExtrapolation
    // Size: 0x4
    // Offset: 0xA0
    UnityEngine::Timeline::TimelineClip::ClipExtrapolation m_InfiniteClipPreExtrapolation;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::TimelineClip::ClipExtrapolation) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0xCFD2A4
    // private UnityEngine.Timeline.TimelineClip/ClipExtrapolation m_InfiniteClipPostExtrapolation
    // Size: 0x4
    // Offset: 0xA4
    UnityEngine::Timeline::TimelineClip::ClipExtrapolation m_InfiniteClipPostExtrapolation;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::TimelineClip::ClipExtrapolation) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0xCFD2F0
    // private UnityEngine.Vector3 m_InfiniteClipOffsetPosition
    // Size: 0xC
    // Offset: 0xA8
    UnityEngine::Vector3 m_InfiniteClipOffsetPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [FormerlySerializedAsAttribute] Offset: 0xCFD33C
    // private UnityEngine.Vector3 m_InfiniteClipOffsetEulerAngles
    // Size: 0xC
    // Offset: 0xB4
    UnityEngine::Vector3 m_InfiniteClipOffsetEulerAngles;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [FormerlySerializedAsAttribute] Offset: 0xCFD388
    // private System.Double m_InfiniteClipTimeOffset
    // Size: 0x8
    // Offset: 0xC0
    double m_InfiniteClipTimeOffset;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xCFD3D4
    // private System.Boolean m_InfiniteClipRemoveOffset
    // Size: 0x1
    // Offset: 0xC8
    bool m_InfiniteClipRemoveOffset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_InfiniteClipApplyFootIK
    // Size: 0x1
    // Offset: 0xC9
    bool m_InfiniteClipApplyFootIK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [HideInInspector] Offset: 0xCFD430
    // private UnityEngine.Timeline.AnimationPlayableAsset/LoopMode mInfiniteClipLoop
    // Size: 0x4
    // Offset: 0xCC
    UnityEngine::Timeline::AnimationPlayableAsset::LoopMode mInfiniteClipLoop;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::AnimationPlayableAsset::LoopMode) == 0x4);
    // private UnityEngine.Timeline.MatchTargetFields m_MatchTargetFields
    // Size: 0x4
    // Offset: 0xD0
    UnityEngine::Timeline::MatchTargetFields m_MatchTargetFields;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::MatchTargetFields) == 0x4);
    // private UnityEngine.Vector3 m_Position
    // Size: 0xC
    // Offset: 0xD4
    UnityEngine::Vector3 m_Position;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_EulerAngles
    // Size: 0xC
    // Offset: 0xE0
    UnityEngine::Vector3 m_EulerAngles;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.AvatarMask m_AvatarMask
    // Size: 0x8
    // Offset: 0xF0
    UnityEngine::AvatarMask* m_AvatarMask;
    // Field size check
    static_assert(sizeof(UnityEngine::AvatarMask*) == 0x8);
    // private System.Boolean m_ApplyAvatarMask
    // Size: 0x1
    // Offset: 0xF8
    bool m_ApplyAvatarMask;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Timeline.TrackOffset m_TrackOffset
    // Size: 0x4
    // Offset: 0xFC
    UnityEngine::Timeline::TrackOffset m_TrackOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::TrackOffset) == 0x4);
    // [HideInInspector] Offset: 0xCFD4C8
    // private UnityEngine.AnimationClip m_InfiniteClip
    // Size: 0x8
    // Offset: 0x100
    UnityEngine::AnimationClip* m_InfiniteClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // [ObsoleteAttribute] Offset: 0xCFD500
    // [HideInInspector] Offset: 0xCFD500
    // private UnityEngine.Quaternion m_OpenClipOffsetRotation
    // Size: 0x10
    // Offset: 0x108
    UnityEngine::Quaternion m_OpenClipOffsetRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // [ObsoleteAttribute] Offset: 0xCFD560
    // [HideInInspector] Offset: 0xCFD560
    // private UnityEngine.Quaternion m_Rotation
    // Size: 0x10
    // Offset: 0x118
    UnityEngine::Quaternion m_Rotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // [ObsoleteAttribute] Offset: 0xCFD5C0
    // [HideInInspector] Offset: 0xCFD5C0
    // private System.Boolean m_ApplyOffsets
    // Size: 0x1
    // Offset: 0x128
    bool m_ApplyOffsets;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: AnimationTrack
