// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Playables.PlayableAsset
#include "UnityEngine/Playables/PlayableAsset.hpp"
// Including type: UnityEngine.Timeline.ITimelineClipAsset
#include "UnityEngine/Timeline/ITimelineClipAsset.hpp"
// Including type: UnityEngine.Timeline.IPropertyPreview
#include "UnityEngine/Timeline/IPropertyPreview.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: UnityEngine.Timeline.MatchTargetFields
#include "UnityEngine/Timeline/MatchTargetFields.hpp"
// Including type: UnityEngine.Timeline.AppliedOffsetMode
#include "UnityEngine/Timeline/AppliedOffsetMode.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Timeline
namespace UnityEngine::Timeline {
  // Skipping declaration: LoopMode because it is already included!
  // Forward declaring type: ClipCaps
  struct ClipCaps;
  // Forward declaring type: IPropertyCollector
  class IPropertyCollector;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationClip
  class AnimationClip;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::Playables
namespace UnityEngine::Playables {
  // Forward declaring type: Playable
  struct Playable;
  // Forward declaring type: PlayableGraph
  struct PlayableGraph;
  // Forward declaring type: PlayableDirector
  class PlayableDirector;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: UnityEngine.Timeline
namespace UnityEngine::Timeline {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Timeline.AnimationPlayableAsset
  // [TokenAttribute] Offset: FFFFFFFF
  // [NotKeyableAttribute] Offset: DF6B50
  class AnimationPlayableAsset : public UnityEngine::Playables::PlayableAsset/*, public UnityEngine::Timeline::ITimelineClipAsset, public UnityEngine::Timeline::IPropertyPreview, public UnityEngine::ISerializationCallbackReceiver*/ {
    public:
    // Nested type: UnityEngine::Timeline::AnimationPlayableAsset::LoopMode
    struct LoopMode;
    // Nested type: UnityEngine::Timeline::AnimationPlayableAsset::Versions
    struct Versions;
    // Nested type: UnityEngine::Timeline::AnimationPlayableAsset::AnimationPlayableAssetUpgrade
    class AnimationPlayableAssetUpgrade;
    // Nested type: UnityEngine::Timeline::AnimationPlayableAsset::$get_outputs$d__45
    class $get_outputs$d__45;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct LoopMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: LoopMode
      constexpr LoopMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // [TooltipAttribute] Offset: 0xDF813C
      // static field const value: static public UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode UseSourceAsset
      static constexpr const int UseSourceAsset = 0;
      // Get static field: static public UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode UseSourceAsset
      static UnityEngine::Timeline::AnimationPlayableAsset::LoopMode _get_UseSourceAsset();
      // Set static field: static public UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode UseSourceAsset
      static void _set_UseSourceAsset(UnityEngine::Timeline::AnimationPlayableAsset::LoopMode value);
      // [TooltipAttribute] Offset: 0xDF8174
      // static field const value: static public UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode On
      static constexpr const int On = 1;
      // Get static field: static public UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode On
      static UnityEngine::Timeline::AnimationPlayableAsset::LoopMode _get_On();
      // Set static field: static public UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode On
      static void _set_On(UnityEngine::Timeline::AnimationPlayableAsset::LoopMode value);
      // [TooltipAttribute] Offset: 0xDF81AC
      // static field const value: static public UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode Off
      static constexpr const int Off = 2;
      // Get static field: static public UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode Off
      static UnityEngine::Timeline::AnimationPlayableAsset::LoopMode _get_Off();
      // Set static field: static public UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode Off
      static void _set_Off(UnityEngine::Timeline::AnimationPlayableAsset::LoopMode value);
      // Get instance field: public System.Int32 value__
      int _get_value__();
      // Set instance field: public System.Int32 value__
      void _set_value__(int value);
    }; // UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode
    #pragma pack(pop)
    static check_size<sizeof(AnimationPlayableAsset::LoopMode), 0 + sizeof(int)> __UnityEngine_Timeline_AnimationPlayableAsset_LoopModeSizeCheck;
    static_assert(sizeof(AnimationPlayableAsset::LoopMode) == 0x4);
    // private UnityEngine.AnimationClip m_Clip
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::AnimationClip* m_Clip;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // private UnityEngine.Vector3 m_Position
    // Size: 0xC
    // Offset: 0x20
    UnityEngine::Vector3 m_Position;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_EulerAngles
    // Size: 0xC
    // Offset: 0x2C
    UnityEngine::Vector3 m_EulerAngles;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private System.Boolean m_UseTrackMatchFields
    // Size: 0x1
    // Offset: 0x38
    bool m_UseTrackMatchFields;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UseTrackMatchFields and: m_MatchTargetFields
    char __padding3[0x3] = {};
    // private UnityEngine.Timeline.MatchTargetFields m_MatchTargetFields
    // Size: 0x4
    // Offset: 0x3C
    UnityEngine::Timeline::MatchTargetFields m_MatchTargetFields;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::MatchTargetFields) == 0x4);
    // private System.Boolean m_RemoveStartOffset
    // Size: 0x1
    // Offset: 0x40
    bool m_RemoveStartOffset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ApplyFootIK
    // Size: 0x1
    // Offset: 0x41
    bool m_ApplyFootIK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ApplyFootIK and: m_Loop
    char __padding6[0x2] = {};
    // private UnityEngine.Timeline.AnimationPlayableAsset/UnityEngine.Timeline.LoopMode m_Loop
    // Size: 0x4
    // Offset: 0x44
    UnityEngine::Timeline::AnimationPlayableAsset::LoopMode m_Loop;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::AnimationPlayableAsset::LoopMode) == 0x4);
    // private UnityEngine.Timeline.AppliedOffsetMode <appliedOffsetMode>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    UnityEngine::Timeline::AppliedOffsetMode appliedOffsetMode;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::AppliedOffsetMode) == 0x4);
    // private System.Int32 m_Version
    // Size: 0x4
    // Offset: 0x4C
    int m_Version;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [ObsoleteAttribute] Offset: 0xDF747C
    // private UnityEngine.Quaternion m_Rotation
    // Size: 0x10
    // Offset: 0x50
    UnityEngine::Quaternion m_Rotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // Creating value type constructor for type: AnimationPlayableAsset
