// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Timeline.ICurvesOwner
#include "UnityEngine/Timeline/ICurvesOwner.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.Timeline.ClipCaps
#include "UnityEngine/Timeline/ClipCaps.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Timeline
namespace UnityEngine::Timeline {
  // Skipping declaration: BlendCurveMode because it is already included!
  // Forward declaring type: TrackAsset
  class TrackAsset;
  // Skipping declaration: ClipExtrapolation because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Object
  class Object;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: AnimationClip
  class AnimationClip;
}
// Completed forward declares
// Type namespace: UnityEngine.Timeline
namespace UnityEngine::Timeline {
  // Size: 0xB8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Timeline.TimelineClip
  class TimelineClip : public ::Il2CppObject/*, public UnityEngine::Timeline::ICurvesOwner, public UnityEngine::ISerializationCallbackReceiver*/ {
    public:
    // Nested type: UnityEngine::Timeline::TimelineClip::Versions
    struct Versions;
    // Nested type: UnityEngine::Timeline::TimelineClip::TimelineClipUpgrade
    class TimelineClipUpgrade;
    // Nested type: UnityEngine::Timeline::TimelineClip::ClipExtrapolation
    struct ClipExtrapolation;
    // Nested type: UnityEngine::Timeline::TimelineClip::BlendCurveMode
    struct BlendCurveMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Timeline.TimelineClip/ClipExtrapolation
    struct ClipExtrapolation/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ClipExtrapolation
      constexpr ClipExtrapolation(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation None
      static UnityEngine::Timeline::TimelineClip::ClipExtrapolation _get_None();
      // Set static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation None
      static void _set_None(UnityEngine::Timeline::TimelineClip::ClipExtrapolation value);
      // static field const value: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation Hold
      static constexpr const int Hold = 1;
      // Get static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation Hold
      static UnityEngine::Timeline::TimelineClip::ClipExtrapolation _get_Hold();
      // Set static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation Hold
      static void _set_Hold(UnityEngine::Timeline::TimelineClip::ClipExtrapolation value);
      // static field const value: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation Loop
      static constexpr const int Loop = 2;
      // Get static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation Loop
      static UnityEngine::Timeline::TimelineClip::ClipExtrapolation _get_Loop();
      // Set static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation Loop
      static void _set_Loop(UnityEngine::Timeline::TimelineClip::ClipExtrapolation value);
      // static field const value: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation PingPong
      static constexpr const int PingPong = 3;
      // Get static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation PingPong
      static UnityEngine::Timeline::TimelineClip::ClipExtrapolation _get_PingPong();
      // Set static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation PingPong
      static void _set_PingPong(UnityEngine::Timeline::TimelineClip::ClipExtrapolation value);
      // static field const value: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation Continue
      static constexpr const int Continue = 4;
      // Get static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation Continue
      static UnityEngine::Timeline::TimelineClip::ClipExtrapolation _get_Continue();
      // Set static field: static public UnityEngine.Timeline.TimelineClip/ClipExtrapolation Continue
      static void _set_Continue(UnityEngine::Timeline::TimelineClip::ClipExtrapolation value);
    }; // UnityEngine.Timeline.TimelineClip/ClipExtrapolation
    #pragma pack(pop)
    static check_size<sizeof(TimelineClip::ClipExtrapolation), 0 + sizeof(int)> __UnityEngine_Timeline_TimelineClip_ClipExtrapolationSizeCheck;
    static_assert(sizeof(TimelineClip::ClipExtrapolation) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Timeline.TimelineClip/BlendCurveMode
    struct BlendCurveMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: BlendCurveMode
      constexpr BlendCurveMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Timeline.TimelineClip/BlendCurveMode Auto
      static constexpr const int Auto = 0;
      // Get static field: static public UnityEngine.Timeline.TimelineClip/BlendCurveMode Auto
      static UnityEngine::Timeline::TimelineClip::BlendCurveMode _get_Auto();
      // Set static field: static public UnityEngine.Timeline.TimelineClip/BlendCurveMode Auto
      static void _set_Auto(UnityEngine::Timeline::TimelineClip::BlendCurveMode value);
      // static field const value: static public UnityEngine.Timeline.TimelineClip/BlendCurveMode Manual
      static constexpr const int Manual = 1;
      // Get static field: static public UnityEngine.Timeline.TimelineClip/BlendCurveMode Manual
      static UnityEngine::Timeline::TimelineClip::BlendCurveMode _get_Manual();
      // Set static field: static public UnityEngine.Timeline.TimelineClip/BlendCurveMode Manual
      static void _set_Manual(UnityEngine::Timeline::TimelineClip::BlendCurveMode value);
    }; // UnityEngine.Timeline.TimelineClip/BlendCurveMode
    #pragma pack(pop)
    static check_size<sizeof(TimelineClip::BlendCurveMode), 0 + sizeof(int)> __UnityEngine_Timeline_TimelineClip_BlendCurveModeSizeCheck;
    static_assert(sizeof(TimelineClip::BlendCurveMode) == 0x4);
    // [HideInInspector] Offset: 0xDD7EF4
    // private System.Int32 m_Version
    // Size: 0x4
    // Offset: 0x10
    int m_Version;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_Version and: m_Start
    char __padding0[0x4] = {};
    // private System.Double m_Start
    // Size: 0x8
    // Offset: 0x18
    double m_Start;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double m_ClipIn
    // Size: 0x8
    // Offset: 0x20
    double m_ClipIn;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private UnityEngine.Object m_Asset
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::Object* m_Asset;
    // Field size check
    static_assert(sizeof(UnityEngine::Object*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xDD7F5C
    // private System.Double m_Duration
    // Size: 0x8
    // Offset: 0x30
    double m_Duration;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double m_TimeScale
    // Size: 0x8
    // Offset: 0x38
    double m_TimeScale;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private UnityEngine.Timeline.TrackAsset m_ParentTrack
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::Timeline::TrackAsset* m_ParentTrack;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::TrackAsset*) == 0x8);
    // private System.Double m_EaseInDuration
    // Size: 0x8
    // Offset: 0x48
    double m_EaseInDuration;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double m_EaseOutDuration
    // Size: 0x8
    // Offset: 0x50
    double m_EaseOutDuration;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double m_BlendInDuration
    // Size: 0x8
    // Offset: 0x58
    double m_BlendInDuration;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double m_BlendOutDuration
    // Size: 0x8
    // Offset: 0x60
    double m_BlendOutDuration;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private UnityEngine.AnimationCurve m_MixInCurve
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::AnimationCurve* m_MixInCurve;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve m_MixOutCurve
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::AnimationCurve* m_MixOutCurve;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.Timeline.TimelineClip/BlendCurveMode m_BlendInCurveMode
    // Size: 0x4
    // Offset: 0x78
    UnityEngine::Timeline::TimelineClip::BlendCurveMode m_BlendInCurveMode;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::TimelineClip::BlendCurveMode) == 0x4);
    // private UnityEngine.Timeline.TimelineClip/BlendCurveMode m_BlendOutCurveMode
    // Size: 0x4
    // Offset: 0x7C
    UnityEngine::Timeline::TimelineClip::BlendCurveMode m_BlendOutCurveMode;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::TimelineClip::BlendCurveMode) == 0x4);
    // private System.Collections.Generic.List`1<System.String> m_ExposedParameterNames
    // Size: 0x8
    // Offset: 0x80
    System::Collections::Generic::List_1<::Il2CppString*>* m_ExposedParameterNames;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<::Il2CppString*>*) == 0x8);
    // private UnityEngine.AnimationClip m_AnimationCurves
    // Size: 0x8
    // Offset: 0x88
    UnityEngine::AnimationClip* m_AnimationCurves;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // private System.Boolean m_Recordable
    // Size: 0x1
    // Offset: 0x90
    bool m_Recordable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Recordable and: m_PostExtrapolationMode
    char __padding17[0x3] = {};
    // private UnityEngine.Timeline.TimelineClip/ClipExtrapolation m_PostExtrapolationMode
    // Size: 0x4
    // Offset: 0x94
    UnityEngine::Timeline::TimelineClip::ClipExtrapolation m_PostExtrapolationMode;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::TimelineClip::ClipExtrapolation) == 0x4);
    // private UnityEngine.Timeline.TimelineClip/ClipExtrapolation m_PreExtrapolationMode
    // Size: 0x4
    // Offset: 0x98
    UnityEngine::Timeline::TimelineClip::ClipExtrapolation m_PreExtrapolationMode;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::TimelineClip::ClipExtrapolation) == 0x4);
    // Padding between fields: m_PreExtrapolationMode and: m_PostExtrapolationTime
    char __padding19[0x4] = {};
    // private System.Double m_PostExtrapolationTime
    // Size: 0x8
    // Offset: 0xA0
    double m_PostExtrapolationTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double m_PreExtrapolationTime
    // Size: 0x8
    // Offset: 0xA8
    double m_PreExtrapolationTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.String m_DisplayName
    // Size: 0x8
    // Offset: 0xB0
    ::Il2CppString* m_DisplayName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: TimelineClip
