// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Playables.PlayableAsset
#include "UnityEngine/Playables/PlayableAsset.hpp"
// Including type: UnityEngine.Timeline.IPropertyPreview
#include "UnityEngine/Timeline/IPropertyPreview.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: UnityEngine.Timeline.ICurvesOwner
#include "UnityEngine/Timeline/ICurvesOwner.hpp"
// Including type: UnityEngine.Timeline.DiscreteTime
#include "UnityEngine/Timeline/DiscreteTime.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: UnityEngine.Timeline.MarkerList
#include "UnityEngine/Timeline/MarkerList.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.Playables.Playable
#include "UnityEngine/Playables/Playable.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"

  // Forward declaring type: String
  class String;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationClip
  class AnimationClip;
  // Skipping declaration: ScriptableObject because it is already included!
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Forward declaring namespace: UnityEngine::Playables
namespace UnityEngine::Playables {
  // Forward declaring type: PlayableGraph
  struct PlayableGraph;
  // Skipping declaration: IPlayableAsset because it is already included!
  // Forward declaring type: PlayableDirector
  class PlayableDirector;
}
// Completed forward declares
// Type namespace: UnityEngine.Timeline
namespace UnityEngine::Timeline {
  // Forward declaring type: TrackAsset
  class TrackAsset;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(UnityEngine::Timeline::TrackAsset);
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Timeline::TrackAsset*, "UnityEngine.Timeline", "TrackAsset");
// Type namespace: UnityEngine.Timeline
namespace UnityEngine::Timeline {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Timeline.TrackAsset
  // [TokenAttribute] Offset: FFFFFFFF
  // [IgnoreOnPlayableTrackAttribute] Offset: EFB9DC
  class TrackAsset : public UnityEngine::Playables::PlayableAsset/*, public UnityEngine::Timeline::IPropertyPreview, public UnityEngine::ISerializationCallbackReceiver, public UnityEngine::Timeline::ICurvesOwner*/ {
    public:
    // Nested type: UnityEngine::Timeline::TrackAsset::Versions
    struct Versions;
    // Nested type: UnityEngine::Timeline::TrackAsset::TrackAssetUpgrade
    class TrackAssetUpgrade;
    // Nested type: UnityEngine::Timeline::TrackAsset::TransientBuildData
    struct TransientBuildData;
    // Nested type: UnityEngine::Timeline::TrackAsset::$get_outputs$d__65
    class $get_outputs$d__65;
    // Nested type: UnityEngine::Timeline::TrackAsset::$$c
    class $$c;
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.Timeline.TrackAsset/UnityEngine.Timeline.TransientBuildData
    // [TokenAttribute] Offset: FFFFFFFF
    struct TransientBuildData/*, public System::ValueType*/ {
      public:
      public:
      // public System.Collections.Generic.List`1<UnityEngine.Timeline.TrackAsset> trackList
      // Size: 0x8
      // Offset: 0x0
      System::Collections::Generic::List_1<UnityEngine::Timeline::TrackAsset*>* trackList;
      // Field size check
      static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::Timeline::TrackAsset*>*) == 0x8);
      // public System.Collections.Generic.List`1<UnityEngine.Timeline.TimelineClip> clipList
      // Size: 0x8
      // Offset: 0x8
      System::Collections::Generic::List_1<UnityEngine::Timeline::TimelineClip*>* clipList;
      // Field size check
      static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::Timeline::TimelineClip*>*) == 0x8);
      // public System.Collections.Generic.List`1<UnityEngine.Timeline.IMarker> markerList
      // Size: 0x8
      // Offset: 0x10
      System::Collections::Generic::List_1<UnityEngine::Timeline::IMarker*>* markerList;
      // Field size check
      static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::Timeline::IMarker*>*) == 0x8);
      public:
      // Creating value type constructor for type: TransientBuildData
      constexpr TransientBuildData(System::Collections::Generic::List_1<UnityEngine::Timeline::TrackAsset*>* trackList_ = {}, System::Collections::Generic::List_1<UnityEngine::Timeline::TimelineClip*>* clipList_ = {}, System::Collections::Generic::List_1<UnityEngine::Timeline::IMarker*>* markerList_ = {}) noexcept : trackList{trackList_}, clipList{clipList_}, markerList{markerList_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get instance field reference: public System.Collections.Generic.List`1<UnityEngine.Timeline.TrackAsset> trackList
      System::Collections::Generic::List_1<UnityEngine::Timeline::TrackAsset*>*& dyn_trackList();
      // Get instance field reference: public System.Collections.Generic.List`1<UnityEngine.Timeline.TimelineClip> clipList
      System::Collections::Generic::List_1<UnityEngine::Timeline::TimelineClip*>*& dyn_clipList();
      // Get instance field reference: public System.Collections.Generic.List`1<UnityEngine.Timeline.IMarker> markerList
      System::Collections::Generic::List_1<UnityEngine::Timeline::IMarker*>*& dyn_markerList();
      // static public UnityEngine.Timeline.TrackAsset/UnityEngine.Timeline.TransientBuildData Create()
      // Offset: 0x261C608
      static UnityEngine::Timeline::TrackAsset::TransientBuildData Create();
      // public System.Void Clear()
      // Offset: 0x2619D54
      void Clear();
    }; // UnityEngine.Timeline.TrackAsset/UnityEngine.Timeline.TransientBuildData
    #pragma pack(pop)
    static check_size<sizeof(TrackAsset::TransientBuildData), 16 + sizeof(System::Collections::Generic::List_1<UnityEngine::Timeline::IMarker*>*)> __UnityEngine_Timeline_TrackAsset_TransientBuildDataSizeCheck;
    static_assert(sizeof(TrackAsset::TransientBuildData) == 0x18);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Int32 m_Version
    // Size: 0x4
    // Offset: 0x18
    int m_Version;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [ObsoleteAttribute] Offset: 0xEFC9B4
    // [FormerlySerializedAsAttribute] Offset: 0xEFC9B4
    // UnityEngine.AnimationClip m_AnimClip
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::AnimationClip* m_AnimClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // private System.Boolean m_Locked
    // Size: 0x1
    // Offset: 0x28
    bool m_Locked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Muted
    // Size: 0x1
    // Offset: 0x29
    bool m_Muted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.String m_CustomPlayableFullTypename
    // Size: 0x8
    // Offset: 0x30
    ::StringW m_CustomPlayableFullTypename;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.AnimationClip m_Curves
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::AnimationClip* m_Curves;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // private UnityEngine.Playables.PlayableAsset m_Parent
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::Playables::PlayableAsset* m_Parent;
    // Field size check
    static_assert(sizeof(UnityEngine::Playables::PlayableAsset*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.ScriptableObject> m_Children
    // Size: 0x8
    // Offset: 0x48
    System::Collections::Generic::List_1<UnityEngine::ScriptableObject*>* m_Children;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::ScriptableObject*>*) == 0x8);
    // private System.Int32 m_ItemsHash
    // Size: 0x4
    // Offset: 0x50
    int m_ItemsHash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Timeline.TimelineClip[] m_ClipsCache
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<UnityEngine::Timeline::TimelineClip*> m_ClipsCache;
    // Field size check
    static_assert(sizeof(::ArrayW<UnityEngine::Timeline::TimelineClip*>) == 0x8);
    // private UnityEngine.Timeline.DiscreteTime m_Start
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::Timeline::DiscreteTime m_Start;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::DiscreteTime) == 0x8);
    // private UnityEngine.Timeline.DiscreteTime m_End
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::Timeline::DiscreteTime m_End;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::DiscreteTime) == 0x8);
    // private System.Boolean m_CacheSorted
    // Size: 0x1
    // Offset: 0x70
    bool m_CacheSorted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Boolean> m_SupportsNotifications
    // Size: 0xFFFFFFFF
    // Offset: 0x71
    System::Nullable_1<bool> m_SupportsNotifications;
    // private System.Collections.Generic.IEnumerable`1<UnityEngine.Timeline.TrackAsset> m_ChildTrackCache
    // Size: 0x8
    // Offset: 0x78
    System::Collections::Generic::IEnumerable_1<UnityEngine::Timeline::TrackAsset*>* m_ChildTrackCache;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::IEnumerable_1<UnityEngine::Timeline::TrackAsset*>*) == 0x8);
    // protected internal System.Collections.Generic.List`1<UnityEngine.Timeline.TimelineClip> m_Clips
    // Size: 0x8
    // Offset: 0x80
    System::Collections::Generic::List_1<UnityEngine::Timeline::TimelineClip*>* m_Clips;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::Timeline::TimelineClip*>*) == 0x8);
    // private UnityEngine.Timeline.MarkerList m_Markers
    // Size: 0x12
    // Offset: 0x88
    UnityEngine::Timeline::MarkerList m_Markers;
    // Field size check
    static_assert(sizeof(UnityEngine::Timeline::MarkerList) == 0x12);
    public:
    // Creating interface conversion operator: operator UnityEngine::Timeline::IPropertyPreview
    operator UnityEngine::Timeline::IPropertyPreview() noexcept {
      return *reinterpret_cast<UnityEngine::Timeline::IPropertyPreview*>(this);
    }
    // Creating interface conversion operator: operator UnityEngine::ISerializationCallbackReceiver
    operator UnityEngine::ISerializationCallbackReceiver() noexcept {
      return *reinterpret_cast<UnityEngine::ISerializationCallbackReceiver*>(this);
    }
    // Creating interface conversion operator: operator UnityEngine::Timeline::ICurvesOwner
    operator UnityEngine::Timeline::ICurvesOwner() noexcept {
      return *reinterpret_cast<UnityEngine::Timeline::ICurvesOwner*>(this);
    }
    // Deleting conversion operator: operator System::IntPtr
