// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Playables.PlayableAsset
#include "UnityEngine/Playables/PlayableAsset.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: UnityEngine.Timeline.IPropertyPreview
#include "UnityEngine/Timeline/IPropertyPreview.hpp"
// Including type: UnityEngine.Timeline.ICurvesOwner
#include "UnityEngine/Timeline/ICurvesOwner.hpp"
// Including type: UnityEngine.Timeline.DiscreteTime
#include "UnityEngine/Timeline/DiscreteTime.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: UnityEngine.Timeline.MarkerList
#include "UnityEngine/Timeline/MarkerList.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.Playables.Playable
#include "UnityEngine/Playables/Playable.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Timeline
namespace UnityEngine::Timeline {
  // Forward declaring type: TimelineClip
  class TimelineClip;
  // Forward declaring type: TrackBindingTypeAttribute

  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationClip
  class AnimationClip;
  // Skipping declaration: ScriptableObject because it is already included!
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::Playables
namespace UnityEngine::Playables {
  // Forward declaring type: PlayableGraph
  struct PlayableGraph;
  // Skipping declaration: IPlayableAsset because it is already included!
  // Forward declaring type: PlayableDirector
  class PlayableDirector;
}
// Completed forward declares
// Type namespace: UnityEngine.Timeline
namespace UnityEngine::Timeline {
  // Autogenerated type: UnityEngine.Timeline.TrackAsset
  class TrackAsset : public UnityEngine::Playables::PlayableAsset, public UnityEngine::ISerializationCallbackReceiver, public UnityEngine::Timeline::IPropertyPreview, public UnityEngine::Timeline::ICurvesOwner {
    public:
    // Nested type: UnityEngine::Timeline::TrackAsset::Versions
    struct Versions;
    // Nested type: UnityEngine::Timeline::TrackAsset::TrackAssetUpgrade
    class TrackAssetUpgrade;
    // Nested type: UnityEngine::Timeline::TrackAsset::TransientBuildData
    struct TransientBuildData;
    // Nested type: UnityEngine::Timeline::TrackAsset::$get_outputs$d__65
    class $get_outputs$d__65;
    // Nested type: UnityEngine::Timeline::TrackAsset::$$c
    class $$c;
    // Autogenerated type: UnityEngine.Timeline.TrackAsset/TransientBuildData
    struct TransientBuildData : public System::ValueType {
      public:
      // public System.Collections.Generic.List`1<UnityEngine.Timeline.TrackAsset> trackList
      // Offset: 0x0
      System::Collections::Generic::List_1<UnityEngine::Timeline::TrackAsset*>* trackList;
      // public System.Collections.Generic.List`1<UnityEngine.Timeline.TimelineClip> clipList
      // Offset: 0x8
      System::Collections::Generic::List_1<UnityEngine::Timeline::TimelineClip*>* clipList;
      // public System.Collections.Generic.List`1<UnityEngine.Timeline.IMarker> markerList
      // Offset: 0x10
      System::Collections::Generic::List_1<UnityEngine::Timeline::IMarker*>* markerList;
      // Creating value type constructor for type: TransientBuildData
      TransientBuildData(System::Collections::Generic::List_1<UnityEngine::Timeline::TrackAsset*>* trackList_ = {}, System::Collections::Generic::List_1<UnityEngine::Timeline::TimelineClip*>* clipList_ = {}, System::Collections::Generic::List_1<UnityEngine::Timeline::IMarker*>* markerList_ = {}) : trackList{trackList_}, clipList{clipList_}, markerList{markerList_} {}
      // static public UnityEngine.Timeline.TrackAsset/TransientBuildData Create()
      // Offset: 0x1904668
      static UnityEngine::Timeline::TrackAsset::TransientBuildData Create();
      // public System.Void Clear()
      // Offset: 0xA598F4
      void Clear();
    }; // UnityEngine.Timeline.TrackAsset/TransientBuildData
    // static field const value: static private System.Int32 k_LatestVersion
    static constexpr const int k_LatestVersion = 3;
    // Get static field: static private System.Int32 k_LatestVersion
    static int _get_k_LatestVersion();
    // Set static field: static private System.Int32 k_LatestVersion
    static void _set_k_LatestVersion(int value);
    // private System.Int32 m_Version
    // Offset: 0x18
    int m_Version;
    // UnityEngine.AnimationClip m_AnimClip
    // Offset: 0x20
    UnityEngine::AnimationClip* m_AnimClip;
    // Get static field: static private UnityEngine.Timeline.TrackAsset/TransientBuildData s_BuildData
    static UnityEngine::Timeline::TrackAsset::TransientBuildData _get_s_BuildData();
    // Set static field: static private UnityEngine.Timeline.TrackAsset/TransientBuildData s_BuildData
    static void _set_s_BuildData(UnityEngine::Timeline::TrackAsset::TransientBuildData value);
    // static field const value: static System.String kDefaultCurvesName
    static constexpr const char* kDefaultCurvesName = "Track Parameters";
    // Get static field: static System.String kDefaultCurvesName
    static ::CsString* _get_kDefaultCurvesName();
    // Set static field: static System.String kDefaultCurvesName
    static void _set_kDefaultCurvesName(::CsString* value);
    // Get static field: static private System.Action`3<UnityEngine.Timeline.TimelineClip,UnityEngine.GameObject,UnityEngine.Playables.Playable> OnClipPlayableCreate
    static System::Action_3<UnityEngine::Timeline::TimelineClip*, UnityEngine::GameObject*, UnityEngine::Playables::Playable>* _get_OnClipPlayableCreate();
    // Set static field: static private System.Action`3<UnityEngine.Timeline.TimelineClip,UnityEngine.GameObject,UnityEngine.Playables.Playable> OnClipPlayableCreate
    static void _set_OnClipPlayableCreate(System::Action_3<UnityEngine::Timeline::TimelineClip*, UnityEngine::GameObject*, UnityEngine::Playables::Playable>* value);
    // Get static field: static private System.Action`3<UnityEngine.Timeline.TrackAsset,UnityEngine.GameObject,UnityEngine.Playables.Playable> OnTrackAnimationPlayableCreate
    static System::Action_3<UnityEngine::Timeline::TrackAsset*, UnityEngine::GameObject*, UnityEngine::Playables::Playable>* _get_OnTrackAnimationPlayableCreate();
    // Set static field: static private System.Action`3<UnityEngine.Timeline.TrackAsset,UnityEngine.GameObject,UnityEngine.Playables.Playable> OnTrackAnimationPlayableCreate
    static void _set_OnTrackAnimationPlayableCreate(System::Action_3<UnityEngine::Timeline::TrackAsset*, UnityEngine::GameObject*, UnityEngine::Playables::Playable>* value);
    // private System.Boolean m_Locked
    // Offset: 0x28
    bool m_Locked;
    // private System.Boolean m_Muted
    // Offset: 0x29
    bool m_Muted;
    // private System.String m_CustomPlayableFullTypename
    // Offset: 0x30
    ::CsString* m_CustomPlayableFullTypename;
    // private UnityEngine.AnimationClip m_Curves
    // Offset: 0x38
    UnityEngine::AnimationClip* m_Curves;
    // private UnityEngine.Playables.PlayableAsset m_Parent
    // Offset: 0x40
    UnityEngine::Playables::PlayableAsset* m_Parent;
    // private System.Collections.Generic.List`1<UnityEngine.ScriptableObject> m_Children
    // Offset: 0x48
    System::Collections::Generic::List_1<UnityEngine::ScriptableObject*>* m_Children;
    // private System.Int32 m_ItemsHash
    // Offset: 0x50
    int m_ItemsHash;
    // private UnityEngine.Timeline.TimelineClip[] m_ClipsCache
    // Offset: 0x58
    ::Array<UnityEngine::Timeline::TimelineClip*>* m_ClipsCache;
    // private UnityEngine.Timeline.DiscreteTime m_Start
    // Offset: 0x60
    UnityEngine::Timeline::DiscreteTime m_Start;
    // private UnityEngine.Timeline.DiscreteTime m_End
    // Offset: 0x68
    UnityEngine::Timeline::DiscreteTime m_End;
    // private System.Boolean m_CacheSorted
    // Offset: 0x70
    bool m_CacheSorted;
    // private System.Nullable`1<System.Boolean> m_SupportsNotifications
    // Offset: 0x71
    System::Nullable_1<bool> m_SupportsNotifications;
    // Get static field: static private UnityEngine.Timeline.TrackAsset[] s_EmptyCache
    static ::Array<UnityEngine::Timeline::TrackAsset*>* _get_s_EmptyCache();
    // Set static field: static private UnityEngine.Timeline.TrackAsset[] s_EmptyCache
    static void _set_s_EmptyCache(::Array<UnityEngine::Timeline::TrackAsset*>* value);
    // private System.Collections.Generic.IEnumerable`1<UnityEngine.Timeline.TrackAsset> m_ChildTrackCache
    // Offset: 0x78
    System::Collections::Generic::IEnumerable_1<UnityEngine::Timeline::TrackAsset*>* m_ChildTrackCache;
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.Type,UnityEngine.Timeline.TrackBindingTypeAttribute> s_TrackBindingTypeAttributeCache
    static System::Collections::Generic::Dictionary_2<System::Type*, UnityEngine::Timeline::TrackBindingTypeAttribute*>* _get_s_TrackBindingTypeAttributeCache();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.Type,UnityEngine.Timeline.TrackBindingTypeAttribute> s_TrackBindingTypeAttributeCache
    static void _set_s_TrackBindingTypeAttributeCache(System::Collections::Generic::Dictionary_2<System::Type*, UnityEngine::Timeline::TrackBindingTypeAttribute*>* value);
    // protected internal System.Collections.Generic.List`1<UnityEngine.Timeline.TimelineClip> m_Clips
    // Offset: 0x80
    System::Collections::Generic::List_1<UnityEngine::Timeline::TimelineClip*>* m_Clips;
    // private UnityEngine.Timeline.MarkerList m_Markers
    // Offset: 0x88
    UnityEngine::Timeline::MarkerList m_Markers;
    // protected System.Void OnBeforeTrackSerialize()
    // Offset: 0x18FE674
    void OnBeforeTrackSerialize();
    // protected System.Void OnAfterTrackDeserialize()
    // Offset: 0x18FE678
    void OnAfterTrackDeserialize();
    // System.Void OnUpgradeFromVersion(System.Int32 oldVersion)
    // Offset: 0x18FE67C
    void OnUpgradeFromVersion(int oldVersion);
    // private System.Void UpgradeToLatestVersion()
    // Offset: 0x18FEBD0
    void UpgradeToLatestVersion();
    // static System.Void add_OnClipPlayableCreate(System.Action`3<UnityEngine.Timeline.TimelineClip,UnityEngine.GameObject,UnityEngine.Playables.Playable> value)
    // Offset: 0x18FEBE0
    static void add_OnClipPlayableCreate(System::Action_3<UnityEngine::Timeline::TimelineClip*, UnityEngine::GameObject*, UnityEngine::Playables::Playable>* value);
