// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: NUnit.Framework.Interfaces.ITest
#include "NUnit/Framework/Interfaces/ITest.hpp"
// Including type: System.IComparable
#include "System/IComparable.hpp"
// Including type: NUnit.Framework.Interfaces.RunState
#include "NUnit/Framework/Interfaces/RunState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: MethodInfo
  class MethodInfo;
  // Forward declaring type: ICustomAttributeProvider
  class ICustomAttributeProvider;
}
// Forward declaring namespace: NUnit::Framework::Interfaces
namespace NUnit::Framework::Interfaces {
  // Forward declaring type: ITypeInfo
  class ITypeInfo;
  // Forward declaring type: IMethodInfo
  class IMethodInfo;
  // Forward declaring type: IPropertyBag
  class IPropertyBag;
  // Forward declaring type: TNode
  class TNode;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Forward declaring namespace: NUnit::Framework::Internal
namespace NUnit::Framework::Internal {
  // Forward declaring type: TestResult
  class TestResult;
}
// Completed forward declares
// Type namespace: NUnit.Framework.Internal
namespace NUnit::Framework::Internal {
  // Forward declaring type: Test
  class Test;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::NUnit::Framework::Internal::Test);
DEFINE_IL2CPP_ARG_TYPE(::NUnit::Framework::Internal::Test*, "NUnit.Framework.Internal", "Test");
// Type namespace: NUnit.Framework.Internal
namespace NUnit::Framework::Internal {
  // Size: 0x75
  #pragma pack(push, 1)
  // Autogenerated type: NUnit.Framework.Internal.Test
  // [TokenAttribute] Offset: FFFFFFFF
  class Test : public ::Il2CppObject/*, public ::NUnit::Framework::Interfaces::ITest, public ::System::IComparable*/ {
    public:
    public:
    // protected System.Reflection.MethodInfo[] setUpMethods
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::System::Reflection::MethodInfo*> setUpMethods;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Reflection::MethodInfo*>) == 0x8);
    // protected System.Reflection.MethodInfo[] tearDownMethods
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::System::Reflection::MethodInfo*> tearDownMethods;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Reflection::MethodInfo*>) == 0x8);
    // protected NUnit.Framework.Interfaces.ITypeInfo DeclaringTypeInfo
    // Size: 0x8
    // Offset: 0x20
    ::NUnit::Framework::Interfaces::ITypeInfo* DeclaringTypeInfo;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Interfaces::ITypeInfo*) == 0x8);
    // private NUnit.Framework.Interfaces.IMethodInfo _method
    // Size: 0x8
    // Offset: 0x28
    ::NUnit::Framework::Interfaces::IMethodInfo* method;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Interfaces::IMethodInfo*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x1107490
    // private System.String <Id>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::StringW Id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x11074CC
    // private System.String <Name>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::StringW Name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x1107508
    // private System.String <FullName>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::StringW FullName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x1107544
    // private NUnit.Framework.Interfaces.ITypeInfo <TypeInfo>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::NUnit::Framework::Interfaces::ITypeInfo* TypeInfo;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Interfaces::ITypeInfo*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x1107580
    // private NUnit.Framework.Interfaces.RunState <RunState>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    ::NUnit::Framework::Interfaces::RunState RunState;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Interfaces::RunState) == 0x4);
    // Padding between fields: RunState and: Properties
    char __padding8[0x4] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x11075BC
    // private NUnit.Framework.Interfaces.IPropertyBag <Properties>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::NUnit::Framework::Interfaces::IPropertyBag* Properties;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Interfaces::IPropertyBag*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x11075F8
    // private NUnit.Framework.Interfaces.ITest <Parent>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::NUnit::Framework::Interfaces::ITest* Parent;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Interfaces::ITest*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x1107634
    // private System.Object <Fixture>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::Il2CppObject* Fixture;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x11076AC
    // private System.Int32 <Seed>k__BackingField
    // Size: 0x4
    // Offset: 0x70
    int Seed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x11076E8
    // private System.Boolean <RequiresThread>k__BackingField
    // Size: 0x1
    // Offset: 0x74
    bool RequiresThread;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::NUnit::Framework::Interfaces::ITest
    operator ::NUnit::Framework::Interfaces::ITest() noexcept {
      return *reinterpret_cast<::NUnit::Framework::Interfaces::ITest*>(this);
    }
    // Creating interface conversion operator: i_ITest
    inline ::NUnit::Framework::Interfaces::ITest* i_ITest() noexcept {
      return reinterpret_cast<::NUnit::Framework::Interfaces::ITest*>(this);
    }
    // Creating interface conversion operator: operator ::System::IComparable
    operator ::System::IComparable() noexcept {
      return *reinterpret_cast<::System::IComparable*>(this);
    }
    // Creating interface conversion operator: i_IComparable
    inline ::System::IComparable* i_IComparable() noexcept {
      return reinterpret_cast<::System::IComparable*>(this);
    }
