// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Runtime.Serialization.StreamingContext
#include "System/Runtime/Serialization/StreamingContext.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: DeserializationEventHandler
  class DeserializationEventHandler;
  // Forward declaring type: SerializationEventHandler
  class SerializationEventHandler;
  // Forward declaring type: ObjectHolder
  class ObjectHolder;
  // Forward declaring type: ObjectHolderList
  class ObjectHolderList;
  // Forward declaring type: ISurrogateSelector
  class ISurrogateSelector;
  // Forward declaring type: FixupHolder
  class FixupHolder;
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: FieldInfo
  class FieldInfo;
  // Forward declaring type: MemberInfo
  class MemberInfo;
  // Forward declaring type: RuntimeConstructorInfo
  class RuntimeConstructorInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: RuntimeType
  class RuntimeType;
}
// Completed forward declares
// Type namespace: System.Runtime.Serialization
namespace System::Runtime::Serialization {
  // Size: 0x54
  #pragma pack(push, 1)
  // Autogenerated type: System.Runtime.Serialization.ObjectManager
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: D9CFCC
  class ObjectManager : public ::Il2CppObject {
    public:
    // private System.Runtime.Serialization.DeserializationEventHandler m_onDeserializationHandler
    // Size: 0x8
    // Offset: 0x10
    System::Runtime::Serialization::DeserializationEventHandler* m_onDeserializationHandler;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::DeserializationEventHandler*) == 0x8);
    // private System.Runtime.Serialization.SerializationEventHandler m_onDeserializedHandler
    // Size: 0x8
    // Offset: 0x18
    System::Runtime::Serialization::SerializationEventHandler* m_onDeserializedHandler;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::SerializationEventHandler*) == 0x8);
    // System.Runtime.Serialization.ObjectHolder[] m_objects
    // Size: 0x8
    // Offset: 0x20
    ::Array<System::Runtime::Serialization::ObjectHolder*>* m_objects;
    // Field size check
    static_assert(sizeof(::Array<System::Runtime::Serialization::ObjectHolder*>*) == 0x8);
    // System.Object m_topObject
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* m_topObject;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Runtime.Serialization.ObjectHolderList m_specialFixupObjects
    // Size: 0x8
    // Offset: 0x30
    System::Runtime::Serialization::ObjectHolderList* m_specialFixupObjects;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ObjectHolderList*) == 0x8);
    // System.Int64 m_fixupCount
    // Size: 0x8
    // Offset: 0x38
    int64_t m_fixupCount;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Runtime.Serialization.ISurrogateSelector m_selector
    // Size: 0x8
    // Offset: 0x40
    System::Runtime::Serialization::ISurrogateSelector* m_selector;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ISurrogateSelector*) == 0x8);
    // System.Runtime.Serialization.StreamingContext m_context
    // Size: 0xC
    // Offset: 0x48
    System::Runtime::Serialization::StreamingContext m_context;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::StreamingContext) == 0xC);
    // Creating value type constructor for type: ObjectManager
