// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
  // Forward declaring type: ISerializationSurrogate
  class ISerializationSurrogate;
  // Forward declaring type: FixupHolderList
  class FixupHolderList;
  // Forward declaring type: LongList
  class LongList;
  // Forward declaring type: ValueTypeFixupInfo
  class ValueTypeFixupInfo;
  // Forward declaring type: TypeLoadExceptionHolder
  class TypeLoadExceptionHolder;
  // Forward declaring type: ObjectManager
  class ObjectManager;
  // Forward declaring type: FixupHolder
  class FixupHolder;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: FieldInfo
  class FieldInfo;
}
// Completed forward declares
// Type namespace: System.Runtime.Serialization
namespace System::Runtime::Serialization {
  // Size: 0x69
  #pragma pack(push, 1)
  // Autogenerated type: System.Runtime.Serialization.ObjectHolder
  // [TokenAttribute] Offset: FFFFFFFF
  class ObjectHolder : public ::Il2CppObject {
    public:
    // private System.Object m_object
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppObject* m_object;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Int64 m_id
    // Size: 0x8
    // Offset: 0x18
    int64_t m_id;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int32 m_missingElementsRemaining
    // Size: 0x4
    // Offset: 0x20
    int m_missingElementsRemaining;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_missingDecendents
    // Size: 0x4
    // Offset: 0x24
    int m_missingDecendents;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Runtime.Serialization.SerializationInfo m_serInfo
    // Size: 0x8
    // Offset: 0x28
    System::Runtime::Serialization::SerializationInfo* m_serInfo;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::SerializationInfo*) == 0x8);
    // System.Runtime.Serialization.ISerializationSurrogate m_surrogate
    // Size: 0x8
    // Offset: 0x30
    System::Runtime::Serialization::ISerializationSurrogate* m_surrogate;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ISerializationSurrogate*) == 0x8);
    // System.Runtime.Serialization.FixupHolderList m_missingElements
    // Size: 0x8
    // Offset: 0x38
    System::Runtime::Serialization::FixupHolderList* m_missingElements;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::FixupHolderList*) == 0x8);
    // System.Runtime.Serialization.LongList m_dependentObjects
    // Size: 0x8
    // Offset: 0x40
    System::Runtime::Serialization::LongList* m_dependentObjects;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::LongList*) == 0x8);
    // System.Runtime.Serialization.ObjectHolder m_next
    // Size: 0x8
    // Offset: 0x48
    System::Runtime::Serialization::ObjectHolder* m_next;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ObjectHolder*) == 0x8);
    // System.Int32 m_flags
    // Size: 0x4
    // Offset: 0x50
    int m_flags;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_markForFixupWhenAvailable
    // Size: 0x1
    // Offset: 0x54
    bool m_markForFixupWhenAvailable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_markForFixupWhenAvailable and: m_valueFixup
    char __padding10[0x3] = {};
    // private System.Runtime.Serialization.ValueTypeFixupInfo m_valueFixup
    // Size: 0x8
    // Offset: 0x58
    System::Runtime::Serialization::ValueTypeFixupInfo* m_valueFixup;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ValueTypeFixupInfo*) == 0x8);
    // private System.Runtime.Serialization.TypeLoadExceptionHolder m_typeLoad
    // Size: 0x8
    // Offset: 0x60
    System::Runtime::Serialization::TypeLoadExceptionHolder* m_typeLoad;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::TypeLoadExceptionHolder*) == 0x8);
    // private System.Boolean m_reachable
    // Size: 0x1
    // Offset: 0x68
    bool m_reachable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: ObjectHolder
