// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Runtime.Serialization.StreamingContext
#include "System/Runtime/Serialization/StreamingContext.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: DeserializationEventHandler
  class DeserializationEventHandler;
  // Forward declaring type: SerializationEventHandler
  class SerializationEventHandler;
  // Forward declaring type: ObjectHolder
  class ObjectHolder;
  // Forward declaring type: ObjectHolderList
  class ObjectHolderList;
  // Forward declaring type: ISurrogateSelector
  class ISurrogateSelector;
  // Forward declaring type: FixupHolder
  class FixupHolder;
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: FieldInfo
  class FieldInfo;
  // Forward declaring type: MemberInfo
  class MemberInfo;
  // Forward declaring type: RuntimeConstructorInfo
  class RuntimeConstructorInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: RuntimeType
  class RuntimeType;
}
// Completed forward declares
// Type namespace: System.Runtime.Serialization
namespace System::Runtime::Serialization {
  // Size: 0x54
  #pragma pack(push, 1)
  // Autogenerated type: System.Runtime.Serialization.ObjectManager
  // [] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: CAB438
  class ObjectManager : public ::Il2CppObject {
    public:
    // private System.Runtime.Serialization.DeserializationEventHandler m_onDeserializationHandler
    // Size: 0x8
    // Offset: 0x10
    System::Runtime::Serialization::DeserializationEventHandler* m_onDeserializationHandler;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::DeserializationEventHandler*) == 0x8);
    // private System.Runtime.Serialization.SerializationEventHandler m_onDeserializedHandler
    // Size: 0x8
    // Offset: 0x18
    System::Runtime::Serialization::SerializationEventHandler* m_onDeserializedHandler;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::SerializationEventHandler*) == 0x8);
    // System.Runtime.Serialization.ObjectHolder[] m_objects
    // Size: 0x8
    // Offset: 0x20
    ::Array<System::Runtime::Serialization::ObjectHolder*>* m_objects;
    // Field size check
    static_assert(sizeof(::Array<System::Runtime::Serialization::ObjectHolder*>*) == 0x8);
    // System.Object m_topObject
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* m_topObject;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Runtime.Serialization.ObjectHolderList m_specialFixupObjects
    // Size: 0x8
    // Offset: 0x30
    System::Runtime::Serialization::ObjectHolderList* m_specialFixupObjects;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ObjectHolderList*) == 0x8);
    // System.Int64 m_fixupCount
    // Size: 0x8
    // Offset: 0x38
    int64_t m_fixupCount;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Runtime.Serialization.ISurrogateSelector m_selector
    // Size: 0x8
    // Offset: 0x40
    System::Runtime::Serialization::ISurrogateSelector* m_selector;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ISurrogateSelector*) == 0x8);
    // System.Runtime.Serialization.StreamingContext m_context
    // Size: 0xC
    // Offset: 0x48
    System::Runtime::Serialization::StreamingContext m_context;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::StreamingContext) == 0xC);
    // Creating value type constructor for type: ObjectManager
    ObjectManager(System::Runtime::Serialization::DeserializationEventHandler* m_onDeserializationHandler_ = {}, System::Runtime::Serialization::SerializationEventHandler* m_onDeserializedHandler_ = {}, ::Array<System::Runtime::Serialization::ObjectHolder*>* m_objects_ = {}, ::Il2CppObject* m_topObject_ = {}, System::Runtime::Serialization::ObjectHolderList* m_specialFixupObjects_ = {}, int64_t m_fixupCount_ = {}, System::Runtime::Serialization::ISurrogateSelector* m_selector_ = {}, System::Runtime::Serialization::StreamingContext m_context_ = {}) noexcept : m_onDeserializationHandler{m_onDeserializationHandler_}, m_onDeserializedHandler{m_onDeserializedHandler_}, m_objects{m_objects_}, m_topObject{m_topObject_}, m_specialFixupObjects{m_specialFixupObjects_}, m_fixupCount{m_fixupCount_}, m_selector{m_selector_}, m_context{m_context_} {}
    // System.Void .ctor(System.Runtime.Serialization.ISurrogateSelector selector, System.Runtime.Serialization.StreamingContext context, System.Boolean checkSecurity, System.Boolean isCrossAppDomain)
    // Offset: 0x15450D0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ObjectManager* New_ctor(System::Runtime::Serialization::ISurrogateSelector* selector, System::Runtime::Serialization::StreamingContext context, bool checkSecurity, bool isCrossAppDomain) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Runtime::Serialization::ObjectManager::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ObjectManager*, creationType>(selector, context, checkSecurity, isCrossAppDomain)));
    }
    // private System.Boolean CanCallGetType(System.Object obj)
    // Offset: 0x15566B0
    bool CanCallGetType(::Il2CppObject* obj);
    // System.Void set_TopObject(System.Object value)
    // Offset: 0x15566B8
    void set_TopObject(::Il2CppObject* value);
    // System.Object get_TopObject()
    // Offset: 0x15566C0
    ::Il2CppObject* get_TopObject();
    // System.Runtime.Serialization.ObjectHolderList get_SpecialFixupObjects()
    // Offset: 0x15566C8
    System::Runtime::Serialization::ObjectHolderList* get_SpecialFixupObjects();
    // System.Runtime.Serialization.ObjectHolder FindObjectHolder(System.Int64 objectID)
    // Offset: 0x1556740
    System::Runtime::Serialization::ObjectHolder* FindObjectHolder(int64_t objectID);
    // System.Runtime.Serialization.ObjectHolder FindOrCreateObjectHolder(System.Int64 objectID)
    // Offset: 0x1554F00
    System::Runtime::Serialization::ObjectHolder* FindOrCreateObjectHolder(int64_t objectID);
    // private System.Void AddObjectHolder(System.Runtime.Serialization.ObjectHolder holder)
    // Offset: 0x15567A4
    void AddObjectHolder(System::Runtime::Serialization::ObjectHolder* holder);
    // private System.Boolean GetCompletionInfo(System.Runtime.Serialization.FixupHolder fixup, out System.Runtime.Serialization.ObjectHolder holder, out System.Object member, System.Boolean bThrowIfMissing)
    // Offset: 0x1556908
    bool GetCompletionInfo(System::Runtime::Serialization::FixupHolder* fixup, System::Runtime::Serialization::ObjectHolder*& holder, ::Il2CppObject*& member, bool bThrowIfMissing);
    // private System.Void FixupSpecialObject(System.Runtime.Serialization.ObjectHolder holder)
    // Offset: 0x1556BDC
    void FixupSpecialObject(System::Runtime::Serialization::ObjectHolder* holder);
    // private System.Boolean ResolveObjectReference(System.Runtime.Serialization.ObjectHolder holder)
    // Offset: 0x1557730
    bool ResolveObjectReference(System::Runtime::Serialization::ObjectHolder* holder);
    // private System.Boolean DoValueTypeFixup(System.Reflection.FieldInfo memberToFix, System.Runtime.Serialization.ObjectHolder holder, System.Object value)
    // Offset: 0x15570DC
    bool DoValueTypeFixup(System::Reflection::FieldInfo* memberToFix, System::Runtime::Serialization::ObjectHolder* holder, ::Il2CppObject* value);
    // System.Void CompleteObject(System.Runtime.Serialization.ObjectHolder holder, System.Boolean bObjectFullyComplete)
    // Offset: 0x15554B0
    void CompleteObject(System::Runtime::Serialization::ObjectHolder* holder, bool bObjectFullyComplete);
    // private System.Void DoNewlyRegisteredObjectFixups(System.Runtime.Serialization.ObjectHolder holder)
    // Offset: 0x1557654
    void DoNewlyRegisteredObjectFixups(System::Runtime::Serialization::ObjectHolder* holder);
    // public System.Object GetObject(System.Int64 objectID)
    // Offset: 0x15579B4
    ::Il2CppObject* GetObject(int64_t objectID);
    // System.Void RegisterString(System.String obj, System.Int64 objectID, System.Runtime.Serialization.SerializationInfo info, System.Int64 idOfContainingObj, System.Reflection.MemberInfo member)
    // Offset: 0x1548D28
    void RegisterString(::Il2CppString* obj, int64_t objectID, System::Runtime::Serialization::SerializationInfo* info, int64_t idOfContainingObj, System::Reflection::MemberInfo* member);
    // public System.Void RegisterObject(System.Object obj, System.Int64 objectID, System.Runtime.Serialization.SerializationInfo info, System.Int64 idOfContainingObj, System.Reflection.MemberInfo member, System.Int32[] arrayIndex)
    // Offset: 0x1548E1C
    void RegisterObject(::Il2CppObject* obj, int64_t objectID, System::Runtime::Serialization::SerializationInfo* info, int64_t idOfContainingObj, System::Reflection::MemberInfo* member, ::Array<int>* arrayIndex);
    // System.Void CompleteISerializableObject(System.Object obj, System.Runtime.Serialization.SerializationInfo info, System.Runtime.Serialization.StreamingContext context)
    // Offset: 0x1556E68
    void CompleteISerializableObject(::Il2CppObject* obj, System::Runtime::Serialization::SerializationInfo* info, System::Runtime::Serialization::StreamingContext context);
    // static System.Reflection.RuntimeConstructorInfo GetConstructor(System.RuntimeType t)
    // Offset: 0x1557A9C
    static System::Reflection::RuntimeConstructorInfo* GetConstructor(System::RuntimeType* t);
    // public System.Void DoFixups()
    // Offset: 0x1557BE0
    void DoFixups();
    // private System.Void RegisterFixup(System.Runtime.Serialization.FixupHolder fixup, System.Int64 objectToBeFixed, System.Int64 objectRequired)
    // Offset: 0x1557ED4
    void RegisterFixup(System::Runtime::Serialization::FixupHolder* fixup, int64_t objectToBeFixed, int64_t objectRequired);
    // public System.Void RecordFixup(System.Int64 objectToBeFixed, System.Reflection.MemberInfo member, System.Int64 objectRequired)
    // Offset: 0x1557FE4
    void RecordFixup(int64_t objectToBeFixed, System::Reflection::MemberInfo* member, int64_t objectRequired);
    // public System.Void RecordDelayedFixup(System.Int64 objectToBeFixed, System.String memberName, System.Int64 objectRequired)
    // Offset: 0x1558254
    void RecordDelayedFixup(int64_t objectToBeFixed, ::Il2CppString* memberName, int64_t objectRequired);
    // public System.Void RecordArrayElementFixup(System.Int64 arrayToBeFixed, System.Int32[] indices, System.Int64 objectRequired)
    // Offset: 0x15583A8
    void RecordArrayElementFixup(int64_t arrayToBeFixed, ::Array<int>* indices, int64_t objectRequired);
    // public System.Void RaiseDeserializationEvent()
    // Offset: 0x15584FC
    void RaiseDeserializationEvent();
    // System.Void AddOnDeserialization(System.Runtime.Serialization.DeserializationEventHandler handler)
    // Offset: 0x1558548
    void AddOnDeserialization(System::Runtime::Serialization::DeserializationEventHandler* handler);
    // System.Void AddOnDeserialized(System.Object obj)
    // Offset: 0x15585D8
    void AddOnDeserialized(::Il2CppObject* obj);
    // System.Void RaiseOnDeserializedEvent(System.Object obj)
    // Offset: 0x155868C
    void RaiseOnDeserializedEvent(::Il2CppObject* obj);
    // public System.Void RaiseOnDeserializingEvent(System.Object obj)
    // Offset: 0x154747C
    void RaiseOnDeserializingEvent(::Il2CppObject* obj);
  }; // System.Runtime.Serialization.ObjectManager
  #pragma pack(pop)
  static check_size<sizeof(ObjectManager), 72 + sizeof(System::Runtime::Serialization::StreamingContext)> __System_Runtime_Serialization_ObjectManagerSizeCheck;
  static_assert(sizeof(ObjectManager) == 0x54);
}
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Serialization::ObjectManager*, "System.Runtime.Serialization", "ObjectManager");
