// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: String
  class String;
  // Forward declaring type: DateTime
  struct DateTime;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: IFormatterConverter
  class IFormatterConverter;
  // Forward declaring type: SerializationInfoEnumerator
  class SerializationInfoEnumerator;
}
// Completed forward declares
// Type namespace: System.Runtime.Serialization
namespace System::Runtime::Serialization {
  // Size: 0x5B
  #pragma pack(push, 1)
  // Autogenerated type: System.Runtime.Serialization.SerializationInfo
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: DA30EC
  class SerializationInfo : public ::Il2CppObject {
    public:
    // System.String[] m_members
    // Size: 0x8
    // Offset: 0x10
    ::Array<::Il2CppString*>* m_members;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.Object[] m_data
    // Size: 0x8
    // Offset: 0x18
    ::Array<::Il2CppObject*>* m_data;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppObject*>*) == 0x8);
    // System.Type[] m_types
    // Size: 0x8
    // Offset: 0x20
    ::Array<System::Type*>* m_types;
    // Field size check
    static_assert(sizeof(::Array<System::Type*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> m_nameToIndex
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Generic::Dictionary_2<::Il2CppString*, int>* m_nameToIndex;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, int>*) == 0x8);
    // System.Int32 m_currMember
    // Size: 0x4
    // Offset: 0x30
    int m_currMember;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_currMember and: m_converter
    char __padding4[0x4] = {};
    // System.Runtime.Serialization.IFormatterConverter m_converter
    // Size: 0x8
    // Offset: 0x38
    System::Runtime::Serialization::IFormatterConverter* m_converter;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::IFormatterConverter*) == 0x8);
    // private System.String m_fullTypeName
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* m_fullTypeName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String m_assemName
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* m_assemName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Type objectType
    // Size: 0x8
    // Offset: 0x50
    System::Type* objectType;
    // Field size check
    static_assert(sizeof(System::Type*) == 0x8);
    // private System.Boolean isFullTypeNameSetExplicit
    // Size: 0x1
    // Offset: 0x58
    bool isFullTypeNameSetExplicit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isAssemblyNameSetExplicit
    // Size: 0x1
    // Offset: 0x59
    bool isAssemblyNameSetExplicit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean requireSameTokenInPartialTrust
    // Size: 0x1
    // Offset: 0x5A
    bool requireSameTokenInPartialTrust;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: SerializationInfo
