// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Object
#include "System/Object.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: String
  class String;
  // Forward declaring type: DateTime
  struct DateTime;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: IFormatterConverter
  class IFormatterConverter;
  // Forward declaring type: SerializationInfoEnumerator
  class SerializationInfoEnumerator;
}
// Completed forward declares
// Type namespace: System.Runtime.Serialization
namespace System::Runtime::Serialization {
  // Autogenerated type: System.Runtime.Serialization.SerializationInfo
  class SerializationInfo : public ::CsObject {
    public:
    // static field const value: static private System.Int32 defaultSize
    static constexpr const int defaultSize = 4;
    // Get static field: static private System.Int32 defaultSize
    static int _get_defaultSize();
    // Set static field: static private System.Int32 defaultSize
    static void _set_defaultSize(int value);
    // static field const value: static private System.String s_mscorlibAssemblySimpleName
    static constexpr const char* s_mscorlibAssemblySimpleName = "mscorlib";
    // Get static field: static private System.String s_mscorlibAssemblySimpleName
    static ::CsString* _get_s_mscorlibAssemblySimpleName();
    // Set static field: static private System.String s_mscorlibAssemblySimpleName
    static void _set_s_mscorlibAssemblySimpleName(::CsString* value);
    // static field const value: static private System.String s_mscorlibFileName
    static constexpr const char* s_mscorlibFileName = "mscorlib.dll";
    // Get static field: static private System.String s_mscorlibFileName
    static ::CsString* _get_s_mscorlibFileName();
    // Set static field: static private System.String s_mscorlibFileName
    static void _set_s_mscorlibFileName(::CsString* value);
    // System.String[] m_members
    // Offset: 0x10
    ::Array<::CsString*>* m_members;
    // System.Object[] m_data
    // Offset: 0x18
    ::Array<::CsObject*>* m_data;
    // System.Type[] m_types
    // Offset: 0x20
    ::Array<System::Type*>* m_types;
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> m_nameToIndex
    // Offset: 0x28
    System::Collections::Generic::Dictionary_2<::CsString*, int>* m_nameToIndex;
    // System.Int32 m_currMember
    // Offset: 0x30
    int m_currMember;
    // System.Runtime.Serialization.IFormatterConverter m_converter
    // Offset: 0x38
    System::Runtime::Serialization::IFormatterConverter* m_converter;
    // private System.String m_fullTypeName
    // Offset: 0x40
    ::CsString* m_fullTypeName;
    // private System.String m_assemName
    // Offset: 0x48
    ::CsString* m_assemName;
    // private System.Type objectType
    // Offset: 0x50
    System::Type* objectType;
    // private System.Boolean isFullTypeNameSetExplicit
    // Offset: 0x58
    bool isFullTypeNameSetExplicit;
    // private System.Boolean isAssemblyNameSetExplicit
    // Offset: 0x59
    bool isAssemblyNameSetExplicit;
    // private System.Boolean requireSameTokenInPartialTrust
    // Offset: 0x5A
    bool requireSameTokenInPartialTrust;
    // public System.Void .ctor(System.Type type, System.Runtime.Serialization.IFormatterConverter converter)
    // Offset: 0xFDA5DC
    static SerializationInfo* New_ctor(System::Type* type, System::Runtime::Serialization::IFormatterConverter* converter);
    // public System.Void .ctor(System.Type type, System.Runtime.Serialization.IFormatterConverter converter, System.Boolean requireSameTokenInPartialTrust)
    // Offset: 0xFDC89C
    static SerializationInfo* New_ctor(System::Type* type, System::Runtime::Serialization::IFormatterConverter* converter, bool requireSameTokenInPartialTrust);
    // public System.String get_FullTypeName()
    // Offset: 0xFE9E70
    ::CsString* get_FullTypeName();
    // public System.String get_AssemblyName()
    // Offset: 0xFE9E78
    ::CsString* get_AssemblyName();
    // public System.Void SetType(System.Type type)
    // Offset: 0xFE86B4
    void SetType(System::Type* type);
    // static private System.Boolean Compare(System.Byte[] a, System.Byte[] b)
    // Offset: 0xFE9E84
    static bool Compare(::Array<uint8_t>* a, ::Array<uint8_t>* b);
    // static System.Void DemandForUnsafeAssemblyNameAssignments(System.String originalAssemblyName, System.String newAssemblyName)
    // Offset: 0xFE9E80
    static void DemandForUnsafeAssemblyNameAssignments(::CsString* originalAssemblyName, ::CsString* newAssemblyName);
    // static System.Boolean IsAssemblyNameAssignmentSafe(System.String originalAssemblyName, System.String newAssemblyName)
    // Offset: 0xFDD584
    static bool IsAssemblyNameAssignmentSafe(::CsString* originalAssemblyName, ::CsString* newAssemblyName);
    // public System.Int32 get_MemberCount()
    // Offset: 0xFE9F10
    int get_MemberCount();
    // public System.Type get_ObjectType()
    // Offset: 0xFE9F18
    System::Type* get_ObjectType();
    // public System.Boolean get_IsFullTypeNameSetExplicit()
    // Offset: 0xFE9F20
    bool get_IsFullTypeNameSetExplicit();
    // public System.Boolean get_IsAssemblyNameSetExplicit()
    // Offset: 0xFE9F28
    bool get_IsAssemblyNameSetExplicit();
    // public System.Runtime.Serialization.SerializationInfoEnumerator GetEnumerator()
    // Offset: 0xFDD278
    System::Runtime::Serialization::SerializationInfoEnumerator* GetEnumerator();
    // private System.Void ExpandArrays()
    // Offset: 0xFE9FB4
    void ExpandArrays();
    // public System.Void AddValue(System.String name, System.Object value, System.Type type)
    // Offset: 0xFE85E8
    void AddValue(::CsString* name, ::CsObject* value, System::Type* type);
    // public System.Void AddValue(System.String name, System.Object value)
    // Offset: 0xFDA438
    void AddValue(::CsString* name, ::CsObject* value);
    // public System.Void AddValue(System.String name, System.Boolean value)
    // Offset: 0xFEA2E0
    void AddValue(::CsString* name, bool value);
    // public System.Void AddValue(System.String name, System.Char value)
    // Offset: 0xFEA3A4
    void AddValue(::CsString* name, ::Il2CppChar value);
    // public System.Void AddValue(System.String name, System.Byte value)
    // Offset: 0xFEA468
    void AddValue(::CsString* name, uint8_t value);
    // public System.Void AddValue(System.String name, System.Int16 value)
    // Offset: 0xFEA52C
    void AddValue(::CsString* name, int16_t value);
    // public System.Void AddValue(System.String name, System.Int32 value)
    // Offset: 0xFEA5F0
    void AddValue(::CsString* name, int value);
    // public System.Void AddValue(System.String name, System.Int64 value)
    // Offset: 0xFEA6B4
    void AddValue(::CsString* name, int64_t value);
    // public System.Void AddValue(System.String name, System.UInt64 value)
    // Offset: 0xFEA778
    void AddValue(::CsString* name, uint64_t value);
    // public System.Void AddValue(System.String name, System.Single value)
    // Offset: 0xFEA83C
    void AddValue(::CsString* name, float value);
    // public System.Void AddValue(System.String name, System.DateTime value)
    // Offset: 0xFEA900
    void AddValue(::CsString* name, System::DateTime value);
    // System.Void AddValueInternal(System.String name, System.Object value, System.Type type)
    // Offset: 0xFEA0F0
    void AddValueInternal(::CsString* name, ::CsObject* value, System::Type* type);
    // System.Void UpdateValue(System.String name, System.Object value, System.Type type)
    // Offset: 0xFE5CD8
    void UpdateValue(::CsString* name, ::CsObject* value, System::Type* type);
    // private System.Int32 FindElement(System.String name)
    // Offset: 0xFEA9C4
    int FindElement(::CsString* name);
    // private System.Object GetElement(System.String name, System.Type foundType)
    // Offset: 0xFEAA84
    ::CsObject* GetElement(::CsString* name, System::Type*& foundType);
    // private System.Object GetElementNoThrow(System.String name, System.Type foundType)
    // Offset: 0xFEABCC
    ::CsObject* GetElementNoThrow(::CsString* name, System::Type*& foundType);
    // public System.Object GetValue(System.String name, System.Type type)
    // Offset: 0xFE8250
    ::CsObject* GetValue(::CsString* name, System::Type* type);
    // System.Object GetValueNoThrow(System.String name, System.Type type)
    // Offset: 0xFE8130
    ::CsObject* GetValueNoThrow(::CsString* name, System::Type* type);
    // public System.Boolean GetBoolean(System.String name)
    // Offset: 0xFEAC74
    bool GetBoolean(::CsString* name);
    // public System.Int32 GetInt32(System.String name)
    // Offset: 0xFEADE8
    int GetInt32(::CsString* name);
    // public System.Int64 GetInt64(System.String name)
    // Offset: 0xFEAF50
    int64_t GetInt64(::CsString* name);
    // public System.Single GetSingle(System.String name)
    // Offset: 0xFEB0B8
    float GetSingle(::CsString* name);
    // public System.String GetString(System.String name)
    // Offset: 0xFEB220
    ::CsString* GetString(::CsString* name);
  }; // System.Runtime.Serialization.SerializationInfo
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Serialization::SerializationInfo*, "System.Runtime.Serialization", "SerializationInfo");
#pragma pack(pop)
