// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: LIV.SDK.Unity.INVALIDATION_FLAGS
#include "LIV/SDK/Unity/INVALIDATION_FLAGS.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: LIV::SDK::Unity
namespace LIV::SDK::Unity {
  // Forward declaring type: SDKRender
  class SDKRender;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: LIV.SDK.Unity
namespace LIV::SDK::Unity {
  // Forward declaring type: LIV
  class LIV;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::LIV::SDK::Unity::LIV);
DEFINE_IL2CPP_ARG_TYPE(::LIV::SDK::Unity::LIV*, "LIV.SDK.Unity", "LIV");
// Type namespace: LIV.SDK.Unity
namespace LIV::SDK::Unity {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: LIV.SDK.Unity.LIV
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: 1142D7C
  // [AddComponentMenu] Offset: 1142D7C
  class LIV : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::LIV::SDK::Unity::LIV::$WaitForUnityEndOfFrame$d__68
    class $WaitForUnityEndOfFrame$d__68;
    public:
    // public System.Action onActivate
    // Size: 0x8
    // Offset: 0x18
    ::System::Action* onActivate;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action`1<LIV.SDK.Unity.SDKRender> onPreRender
    // Size: 0x8
    // Offset: 0x20
    ::System::Action_1<::LIV::SDK::Unity::SDKRender*>* onPreRender;
    // Field size check
    static_assert(sizeof(::System::Action_1<::LIV::SDK::Unity::SDKRender*>*) == 0x8);
    // public System.Action`1<LIV.SDK.Unity.SDKRender> onPreRenderBackground
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_1<::LIV::SDK::Unity::SDKRender*>* onPreRenderBackground;
    // Field size check
    static_assert(sizeof(::System::Action_1<::LIV::SDK::Unity::SDKRender*>*) == 0x8);
    // public System.Action`1<LIV.SDK.Unity.SDKRender> onPostRenderBackground
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_1<::LIV::SDK::Unity::SDKRender*>* onPostRenderBackground;
    // Field size check
    static_assert(sizeof(::System::Action_1<::LIV::SDK::Unity::SDKRender*>*) == 0x8);
    // public System.Action`1<LIV.SDK.Unity.SDKRender> onPreRenderForeground
    // Size: 0x8
    // Offset: 0x38
    ::System::Action_1<::LIV::SDK::Unity::SDKRender*>* onPreRenderForeground;
    // Field size check
    static_assert(sizeof(::System::Action_1<::LIV::SDK::Unity::SDKRender*>*) == 0x8);
    // public System.Action`1<LIV.SDK.Unity.SDKRender> onPostRenderForeground
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_1<::LIV::SDK::Unity::SDKRender*>* onPostRenderForeground;
    // Field size check
    static_assert(sizeof(::System::Action_1<::LIV::SDK::Unity::SDKRender*>*) == 0x8);
    // public System.Action`1<LIV.SDK.Unity.SDKRender> onPostRender
    // Size: 0x8
    // Offset: 0x48
    ::System::Action_1<::LIV::SDK::Unity::SDKRender*>* onPostRender;
    // Field size check
    static_assert(sizeof(::System::Action_1<::LIV::SDK::Unity::SDKRender*>*) == 0x8);
    // public System.Action onDeactivate
    // Size: 0x8
    // Offset: 0x50
    ::System::Action* onDeactivate;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // [TooltipAttribute] Offset: 0x1142DFC
    // [FormerlySerializedAsAttribute] Offset: 0x1142DFC
    // private UnityEngine.Transform _stage
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* stage;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x1142E6C
    // [FormerlySerializedAsAttribute] Offset: 0x1142E6C
    // private UnityEngine.Transform _stageTransform
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* stageTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x1142EDC
    // [FormerlySerializedAsAttribute] Offset: 0x1142EDC
    // private UnityEngine.Camera _HMDCamera
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Camera* HMDCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // [TooltipAttribute] Offset: 0x1142F4C
    // [FormerlySerializedAsAttribute] Offset: 0x1142F4C
    // private UnityEngine.Camera _MRCameraPrefab
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Camera* MRCameraPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // [TooltipAttribute] Offset: 0x1142FBC
    // [FormerlySerializedAsAttribute] Offset: 0x1142FBC
    // private System.Boolean _disableStandardAssets
    // Size: 0x1
    // Offset: 0x78
    bool disableStandardAssets;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableStandardAssets and: spectatorLayerMask
    char __padding12[0x3] = {};
    // [TooltipAttribute] Offset: 0x114302C
    // [FormerlySerializedAsAttribute] Offset: 0x114302C
    // private UnityEngine.LayerMask _spectatorLayerMask
    // Size: 0x4
    // Offset: 0x7C
    ::UnityEngine::LayerMask spectatorLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // [TooltipAttribute] Offset: 0x114309C
    // [FormerlySerializedAsAttribute] Offset: 0x114309C
    // private System.String[] _excludeBehaviours
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::StringW> excludeBehaviours;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [TooltipAttribute] Offset: 0x114310C
    // [FormerlySerializedAsAttribute] Offset: 0x114310C
    // private System.Boolean _fixPostEffectsAlpha
    // Size: 0x1
    // Offset: 0x88
    bool fixPostEffectsAlpha;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isActive
    // Size: 0x1
    // Offset: 0x89
    bool isActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isActive and: render
    char __padding16[0x6] = {};
    // private LIV.SDK.Unity.SDKRender _render
    // Size: 0x8
    // Offset: 0x90
    ::LIV::SDK::Unity::SDKRender* render;
    // Field size check
    static_assert(sizeof(::LIV::SDK::Unity::SDKRender*) == 0x8);
    // private System.Boolean _wasReady
    // Size: 0x1
    // Offset: 0x98
    bool wasReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasReady and: invalidate
    char __padding18[0x3] = {};
    // private LIV.SDK.Unity.INVALIDATION_FLAGS _invalidate
    // Size: 0x4
    // Offset: 0x9C
    ::LIV::SDK::Unity::INVALIDATION_FLAGS invalidate;
    // Field size check
    static_assert(sizeof(::LIV::SDK::Unity::INVALIDATION_FLAGS) == 0x4);
    // private UnityEngine.Transform _stageCandidate
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Transform* stageCandidate;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Camera _HMDCameraCandidate
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Camera* HMDCameraCandidate;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Camera _MRCameraPrefabCandidate
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Camera* MRCameraPrefabCandidate;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private System.String[] _excludeBehavioursCandidate
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<::StringW> excludeBehavioursCandidate;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.Boolean _enabled
    // Size: 0x1
    // Offset: 0xC0
    bool enabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enabled and: waitForEndOfFrameCoroutine
    char __padding24[0x7] = {};
    // private UnityEngine.Coroutine _waitForEndOfFrameCoroutine
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Coroutine* waitForEndOfFrameCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Action onActivate
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_onActivate();
    // Get instance field reference: public System.Action`1<LIV.SDK.Unity.SDKRender> onPreRender
    [[deprecated("Use field access instead!")]] ::System::Action_1<::LIV::SDK::Unity::SDKRender*>*& dyn_onPreRender();
    // Get instance field reference: public System.Action`1<LIV.SDK.Unity.SDKRender> onPreRenderBackground
    [[deprecated("Use field access instead!")]] ::System::Action_1<::LIV::SDK::Unity::SDKRender*>*& dyn_onPreRenderBackground();
