// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.Rendering.CameraEvent
#include "UnityEngine/Rendering/CameraEvent.hpp"
// Including type: LIV.SDK.Unity.SDKOutputFrame
#include "LIV/SDK/Unity/SDKOutputFrame.hpp"
// Including type: LIV.SDK.Unity.SDKInputFrame
#include "LIV/SDK/Unity/SDKInputFrame.hpp"
// Including type: LIV.SDK.Unity.SDKResolution
#include "LIV/SDK/Unity/SDKResolution.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: ColorWriteMask
  struct ColorWriteMask;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
  // Forward declaring type: Vector3
  struct Vector3;
  // Forward declaring type: Quaternion
  struct Quaternion;
  // Forward declaring type: Plane
  struct Plane;
}
// Forward declaring namespace: LIV::SDK::Unity
namespace LIV::SDK::Unity {
  // Forward declaring type: LIV
  class LIV;
  // Forward declaring type: TEXTURE_ID
  struct TEXTURE_ID;
}
// Completed forward declares
// Type namespace: LIV.SDK.Unity
namespace LIV::SDK::Unity {
  // Forward declaring type: SDKRender
  class SDKRender;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::LIV::SDK::Unity::SDKRender);
DEFINE_IL2CPP_ARG_TYPE(::LIV::SDK::Unity::SDKRender*, "LIV.SDK.Unity", "SDKRender");
// Type namespace: LIV.SDK.Unity
namespace LIV::SDK::Unity {
  // Size: 0x33C
  #pragma pack(push, 1)
  // Autogenerated type: LIV.SDK.Unity.SDKRender
  // [TokenAttribute] Offset: FFFFFFFF
  class SDKRender : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    public:
    // private UnityEngine.Rendering.CommandBuffer _clipPlaneCommandBuffer
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::CommandBuffer* clipPlaneCommandBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // private UnityEngine.Rendering.CommandBuffer _combineAlphaCommandBuffer
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rendering::CommandBuffer* combineAlphaCommandBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // private UnityEngine.Rendering.CommandBuffer _captureTextureCommandBuffer
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Rendering::CommandBuffer* captureTextureCommandBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // private UnityEngine.Rendering.CommandBuffer _applyTextureCommandBuffer
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Rendering::CommandBuffer* applyTextureCommandBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // private UnityEngine.Rendering.CommandBuffer _optimizedRenderingCommandBuffer
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Rendering::CommandBuffer* optimizedRenderingCommandBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // private UnityEngine.Rendering.CameraEvent _clipPlaneCameraEvent
    // Size: 0x4
    // Offset: 0x38
    ::UnityEngine::Rendering::CameraEvent clipPlaneCameraEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CameraEvent) == 0x4);
    // private UnityEngine.Rendering.CameraEvent _optimizedRenderingCameraEvent
    // Size: 0x4
    // Offset: 0x3C
    ::UnityEngine::Rendering::CameraEvent optimizedRenderingCameraEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CameraEvent) == 0x4);
    // private UnityEngine.Mesh _clipPlaneMesh
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Mesh* clipPlaneMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Material _clipPlaneSimpleMaterial
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Material* clipPlaneSimpleMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _clipPlaneSimpleDebugMaterial
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Material* clipPlaneSimpleDebugMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _clipPlaneComplexMaterial
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Material* clipPlaneComplexMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _clipPlaneComplexDebugMaterial
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Material* clipPlaneComplexDebugMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _writeOpaqueToAlphaMaterial
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Material* writeOpaqueToAlphaMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _combineAlphaMaterial
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Material* combineAlphaMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _writeMaterial
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Material* writeMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _forceForwardRenderingMaterial
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Material* forceForwardRenderingMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.RenderTexture _backgroundRenderTexture
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::RenderTexture* backgroundRenderTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture _foregroundRenderTexture
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::RenderTexture* foregroundRenderTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture _optimizedRenderTexture
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::RenderTexture* optimizedRenderTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture _complexClipPlaneRenderTexture
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::RenderTexture* complexClipPlaneRenderTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private LIV.SDK.Unity.LIV _liv
    // Size: 0x8
    // Offset: 0xA8
    ::LIV::SDK::Unity::LIV* liv;
    // Field size check
    static_assert(sizeof(::LIV::SDK::Unity::LIV*) == 0x8);
    // private LIV.SDK.Unity.SDKOutputFrame _outputFrame
    // Size: 0xAC
    // Offset: 0xB0
    ::LIV::SDK::Unity::SDKOutputFrame outputFrame;
    // Field size check
    static_assert(sizeof(::LIV::SDK::Unity::SDKOutputFrame) == 0xAC);
    // Padding between fields: outputFrame and: inputFrame
    char __padding21[0x4] = {};
    // private LIV.SDK.Unity.SDKInputFrame _inputFrame
    // Size: 0x158
    // Offset: 0x160
    ::LIV::SDK::Unity::SDKInputFrame inputFrame;
    // Field size check
    static_assert(sizeof(::LIV::SDK::Unity::SDKInputFrame) == 0x158);
    // private LIV.SDK.Unity.SDKResolution _resolution
    // Size: 0x8
    // Offset: 0x2B8
    ::LIV::SDK::Unity::SDKResolution resolution;
    // Field size check
    static_assert(sizeof(::LIV::SDK::Unity::SDKResolution) == 0x8);
    // private UnityEngine.Camera _cameraInstance
    // Size: 0x8
    // Offset: 0x2C0
    ::UnityEngine::Camera* cameraInstance;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private LIV.SDK.Unity.SDKPose _requestedPose
    // Size: 0x70
    // Offset: 0x2C8
    ::LIV::SDK::Unity::SDKPose requestedPose;
    // Field size check
    static_assert(sizeof(::LIV::SDK::Unity::SDKPose) == 0x70);
    // private System.Int32 _requestedPoseFrameIndex
    // Size: 0x4
    // Offset: 0x338
    int requestedPoseFrameIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Creating interface conversion operator: i_IDisposable
    inline ::System::IDisposable* i_IDisposable() noexcept {
      return reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: private UnityEngine.Rendering.CommandBuffer _clipPlaneCommandBuffer
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::CommandBuffer*& dyn__clipPlaneCommandBuffer();
    // Get instance field reference: private UnityEngine.Rendering.CommandBuffer _combineAlphaCommandBuffer
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::CommandBuffer*& dyn__combineAlphaCommandBuffer();
