// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: VoiceConnection
  class VoiceConnection;
}
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: PhotonPeer
  class PhotonPeer;
}
// Completed forward declares
// Type namespace: Photon.Voice.Unity.UtilityScripts
namespace Photon::Voice::Unity::UtilityScripts {
  // Forward declaring type: PhotonVoiceLagSimulationGui
  class PhotonVoiceLagSimulationGui;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui*, "Photon.Voice.Unity.UtilityScripts", "PhotonVoiceLagSimulationGui");
// Type namespace: Photon.Voice.Unity.UtilityScripts
namespace Photon::Voice::Unity::UtilityScripts {
  // Size: 0x44
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Voice.Unity.UtilityScripts.PhotonVoiceLagSimulationGui
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 955BF4
  class PhotonVoiceLagSimulationGui : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private Photon.Voice.Unity.VoiceConnection voiceConnection
    // Size: 0x8
    // Offset: 0x18
    ::Photon::Voice::Unity::VoiceConnection* voiceConnection;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::VoiceConnection*) == 0x8);
    // private UnityEngine.Rect windowRect
    // Size: 0x10
    // Offset: 0x20
    ::UnityEngine::Rect windowRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private System.Int32 windowId
    // Size: 0x4
    // Offset: 0x30
    int windowId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean visible
    // Size: 0x1
    // Offset: 0x34
    bool visible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: visible and: peer
    char __padding3[0x3] = {};
    // private ExitGames.Client.Photon.PhotonPeer peer
    // Size: 0x8
    // Offset: 0x38
    ::ExitGames::Client::Photon::PhotonPeer* peer;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::PhotonPeer*) == 0x8);
    // private System.Single debugLostPercent
    // Size: 0x4
    // Offset: 0x40
    float debugLostPercent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private Photon.Voice.Unity.VoiceConnection voiceConnection
    [[deprecated("Use field access instead!")]] ::Photon::Voice::Unity::VoiceConnection*& dyn_voiceConnection();
    // Get instance field reference: private UnityEngine.Rect windowRect
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rect& dyn_windowRect();
    // Get instance field reference: private System.Int32 windowId
    [[deprecated("Use field access instead!")]] int& dyn_windowId();
    // Get instance field reference: private System.Boolean visible
    [[deprecated("Use field access instead!")]] bool& dyn_visible();
    // Get instance field reference: private ExitGames.Client.Photon.PhotonPeer peer
    [[deprecated("Use field access instead!")]] ::ExitGames::Client::Photon::PhotonPeer*& dyn_peer();
    // Get instance field reference: private System.Single debugLostPercent
    [[deprecated("Use field access instead!")]] float& dyn_debugLostPercent();
    // public System.Void .ctor()
    // Offset: 0x1045D2C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PhotonVoiceLagSimulationGui* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PhotonVoiceLagSimulationGui*, creationType>()));
    }
    // public System.Void OnEnable()
    // Offset: 0x1044F68
    void OnEnable();
    // private System.Void OnGUI()
    // Offset: 0x104512C
    void OnGUI();
    // private System.Void NetSimHasNoPeerWindow(System.Int32 windowId)
    // Offset: 0x10452A4
    void NetSimHasNoPeerWindow(int windowId);
    // private System.Void NetSimWindow(System.Int32 windowId)
    // Offset: 0x104537C
    void NetSimWindow(int windowId);
  }; // Photon.Voice.Unity.UtilityScripts.PhotonVoiceLagSimulationGui
  #pragma pack(pop)
  static check_size<sizeof(PhotonVoiceLagSimulationGui), 64 + sizeof(float)> __Photon_Voice_Unity_UtilityScripts_PhotonVoiceLagSimulationGuiSizeCheck;
  static_assert(sizeof(PhotonVoiceLagSimulationGui) == 0x44);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::*)()>(&Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::OnGUI
// Il2CppName: OnGUI
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::*)()>(&Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::OnGUI)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui*), "OnGUI", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::NetSimHasNoPeerWindow
// Il2CppName: NetSimHasNoPeerWindow
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::*)(int)>(&Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::NetSimHasNoPeerWindow)> {
  static const MethodInfo* get() {
    static auto* windowId = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui*), "NetSimHasNoPeerWindow", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{windowId});
  }
};
// Writing MetadataGetter for method: Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::NetSimWindow
// Il2CppName: NetSimWindow
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::*)(int)>(&Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui::NetSimWindow)> {
  static const MethodInfo* get() {
    static auto* windowId = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Photon::Voice::Unity::UtilityScripts::PhotonVoiceLagSimulationGui*), "NetSimWindow", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{windowId});
  }
};
