// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Org.BouncyCastle.Crypto.IBlockCipher
#include "Org/BouncyCastle/Crypto/IBlockCipher.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Org::BouncyCastle::Crypto
namespace Org::BouncyCastle::Crypto {
  // Forward declaring type: ICipherParameters
  class ICipherParameters;
}
// Completed forward declares
// Type namespace: Org.BouncyCastle.Crypto.Engines
namespace Org::BouncyCastle::Crypto::Engines {
  // Autogenerated type: Org.BouncyCastle.Crypto.Engines.RijndaelEngine
  class RijndaelEngine : public ::Il2CppObject/*, public Org::BouncyCastle::Crypto::IBlockCipher*/ {
    public:
    // private System.Int32 BC
    // Offset: 0x10
    int BC;
    // private System.Int64 BC_MASK
    // Offset: 0x18
    int64_t BC_MASK;
    // private System.Int32 ROUNDS
    // Offset: 0x20
    int ROUNDS;
    // private System.Int32 blockBits
    // Offset: 0x24
    int blockBits;
    // private System.Int64[][] workingKey
    // Offset: 0x28
    ::Array<::Array<int64_t>*>* workingKey;
    // private System.Int64 A0
    // Offset: 0x30
    int64_t A0;
    // private System.Int64 A1
    // Offset: 0x38
    int64_t A1;
    // private System.Int64 A2
    // Offset: 0x40
    int64_t A2;
    // private System.Int64 A3
    // Offset: 0x48
    int64_t A3;
    // private System.Boolean forEncryption
    // Offset: 0x50
    bool forEncryption;
    // private System.Byte[] shifts0SC
    // Offset: 0x58
    ::Array<uint8_t>* shifts0SC;
    // private System.Byte[] shifts1SC
    // Offset: 0x60
    ::Array<uint8_t>* shifts1SC;
    // Creating interface conversion operator: operator Org::BouncyCastle::Crypto::IBlockCipher
    operator Org::BouncyCastle::Crypto::IBlockCipher() noexcept {
      return *reinterpret_cast<Org::BouncyCastle::Crypto::IBlockCipher*>(this);
    }
    // Get static field: static private readonly System.Int32 MAXROUNDS
    static int _get_MAXROUNDS();
    // Set static field: static private readonly System.Int32 MAXROUNDS
    static void _set_MAXROUNDS(int value);
    // Get static field: static private readonly System.Int32 MAXKC
    static int _get_MAXKC();
    // Set static field: static private readonly System.Int32 MAXKC
    static void _set_MAXKC(int value);
    // Get static field: static private readonly System.Byte[] Logtable
    static ::Array<uint8_t>* _get_Logtable();
    // Set static field: static private readonly System.Byte[] Logtable
    static void _set_Logtable(::Array<uint8_t>* value);
    // Get static field: static private readonly System.Byte[] Alogtable
    static ::Array<uint8_t>* _get_Alogtable();
    // Set static field: static private readonly System.Byte[] Alogtable
    static void _set_Alogtable(::Array<uint8_t>* value);
    // Get static field: static private readonly System.Byte[] S
    static ::Array<uint8_t>* _get_S();
    // Set static field: static private readonly System.Byte[] S
    static void _set_S(::Array<uint8_t>* value);
    // Get static field: static private readonly System.Byte[] Si
    static ::Array<uint8_t>* _get_Si();
    // Set static field: static private readonly System.Byte[] Si
    static void _set_Si(::Array<uint8_t>* value);
    // Get static field: static private readonly System.Byte[] rcon
    static ::Array<uint8_t>* _get_rcon();
    // Set static field: static private readonly System.Byte[] rcon
    static void _set_rcon(::Array<uint8_t>* value);
    // Get static field: static private readonly System.Byte[][] shifts0
    static ::Array<::Array<uint8_t>*>* _get_shifts0();
    // Set static field: static private readonly System.Byte[][] shifts0
    static void _set_shifts0(::Array<::Array<uint8_t>*>* value);
    // Get static field: static private readonly System.Byte[][] shifts1
    static ::Array<::Array<uint8_t>*>* _get_shifts1();
    // Set static field: static private readonly System.Byte[][] shifts1
    static void _set_shifts1(::Array<::Array<uint8_t>*>* value);
    // private System.Byte Mul0x2(System.Int32 b)
    // Offset: 0x19D4DAC
    uint8_t Mul0x2(int b);
    // private System.Byte Mul0x3(System.Int32 b)
    // Offset: 0x19D4E6C
    uint8_t Mul0x3(int b);
    // private System.Byte Mul0x9(System.Int32 b)
    // Offset: 0x19D4F2C
    uint8_t Mul0x9(int b);
    // private System.Byte Mul0xb(System.Int32 b)
    // Offset: 0x19D4FD0
    uint8_t Mul0xb(int b);
    // private System.Byte Mul0xd(System.Int32 b)
    // Offset: 0x19D5074
    uint8_t Mul0xd(int b);
    // private System.Byte Mul0xe(System.Int32 b)
    // Offset: 0x19D5118
    uint8_t Mul0xe(int b);
    // private System.Void KeyAddition(System.Int64[] rk)
    // Offset: 0x19D51BC
    void KeyAddition(::Array<int64_t>* rk);
    // private System.Int64 Shift(System.Int64 r, System.Int32 shift)
    // Offset: 0x19D524C
    int64_t Shift(int64_t r, int shift);
    // private System.Void ShiftRow(System.Byte[] shiftsSC)
    // Offset: 0x19D5278
    void ShiftRow(::Array<uint8_t>* shiftsSC);
    // private System.Int64 ApplyS(System.Int64 r, System.Byte[] box)
    // Offset: 0x19D534C
    int64_t ApplyS(int64_t r, ::Array<uint8_t>* box);
    // private System.Void Substitution(System.Byte[] box)
    // Offset: 0x19D53C0
    void Substitution(::Array<uint8_t>* box);
    // private System.Void MixColumn()
    // Offset: 0x19D5430
    void MixColumn();
    // private System.Void InvMixColumn()
    // Offset: 0x19D55D4
    void InvMixColumn();
    // private System.Int64[][] GenerateWorkingKey(System.Byte[] key)
    // Offset: 0x19D5918
    ::Array<::Array<int64_t>*>* GenerateWorkingKey(::Array<uint8_t>* key);
    // public System.Void .ctor(System.Int32 blockBits)
    // Offset: 0x19D61B4
    static RijndaelEngine* New_ctor(int blockBits);
    // private System.Void UnPackBlock(System.Byte[] bytes, System.Int32 off)
    // Offset: 0x19D6854
    void UnPackBlock(::Array<uint8_t>* bytes, int off);
    // private System.Void PackBlock(System.Byte[] bytes, System.Int32 off)
    // Offset: 0x19D6C44
    void PackBlock(::Array<uint8_t>* bytes, int off);
    // private System.Void EncryptBlock(System.Int64[][] rk)
    // Offset: 0x19D6998
    void EncryptBlock(::Array<::Array<int64_t>*>* rk);
    // private System.Void DecryptBlock(System.Int64[][] rk)
    // Offset: 0x19D6AF8
    void DecryptBlock(::Array<::Array<int64_t>*>* rk);
    // static private System.Void .cctor()
    // Offset: 0x19D6D14
    static void _cctor();
    // public System.Void .ctor()
    // Offset: 0x19D61AC
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static RijndaelEngine* New_ctor();
    // public System.Void Init(System.Boolean forEncryption, Org.BouncyCastle.Crypto.ICipherParameters parameters)
    // Offset: 0x19D650C
    // Implemented from: Org.BouncyCastle.Crypto.IBlockCipher
    // Base method: System.Void IBlockCipher::Init(System.Boolean forEncryption, Org.BouncyCastle.Crypto.ICipherParameters parameters)
    void Init(bool forEncryption, Org::BouncyCastle::Crypto::ICipherParameters* parameters);
    // public System.String get_AlgorithmName()
    // Offset: 0x19D66A8
    // Implemented from: Org.BouncyCastle.Crypto.IBlockCipher
    // Base method: System.String IBlockCipher::get_AlgorithmName()
    ::Il2CppString* get_AlgorithmName();
    // public System.Boolean get_IsPartialBlockOkay()
    // Offset: 0x19D66F0
    // Implemented from: Org.BouncyCastle.Crypto.IBlockCipher
    // Base method: System.Boolean IBlockCipher::get_IsPartialBlockOkay()
    bool get_IsPartialBlockOkay();
    // public System.Int32 GetBlockSize()
    // Offset: 0x19D66F8
    // Implemented from: Org.BouncyCastle.Crypto.IBlockCipher
    // Base method: System.Int32 IBlockCipher::GetBlockSize()
    int GetBlockSize();
    // public System.Int32 ProcessBlock(System.Byte[] input, System.Int32 inOff, System.Byte[] output, System.Int32 outOff)
    // Offset: 0x19D670C
    // Implemented from: Org.BouncyCastle.Crypto.IBlockCipher
    // Base method: System.Int32 IBlockCipher::ProcessBlock(System.Byte[] input, System.Int32 inOff, System.Byte[] output, System.Int32 outOff)
    int ProcessBlock(::Array<uint8_t>* input, int inOff, ::Array<uint8_t>* output, int outOff);
    // public System.Void Reset()
    // Offset: 0x19D6D10
    // Implemented from: Org.BouncyCastle.Crypto.IBlockCipher
    // Base method: System.Void IBlockCipher::Reset()
    void Reset();
  }; // Org.BouncyCastle.Crypto.Engines.RijndaelEngine
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Org::BouncyCastle::Crypto::Engines::RijndaelEngine*, "Org.BouncyCastle.Crypto.Engines", "RijndaelEngine");
#pragma pack(pop)
