// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: Tayx::Graphy
namespace Tayx::Graphy {
  // Forward declaring type: GraphyManager
  class GraphyManager;
}
// Forward declaring namespace: Tayx::Graphy::Audio
namespace Tayx::Graphy::Audio {
  // Forward declaring type: G_AudioMonitor
  class G_AudioMonitor;
}
// Completed forward declares
// Type namespace: Tayx.Graphy.Audio
namespace Tayx::Graphy::Audio {
  // Forward declaring type: G_AudioText
  class G_AudioText;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Tayx::Graphy::Audio::G_AudioText);
DEFINE_IL2CPP_ARG_TYPE(::Tayx::Graphy::Audio::G_AudioText*, "Tayx.Graphy.Audio", "G_AudioText");
// Type namespace: Tayx.Graphy.Audio
namespace Tayx::Graphy::Audio {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: Tayx.Graphy.Audio.G_AudioText
  // [TokenAttribute] Offset: FFFFFFFF
  class G_AudioText : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.UI.Text m_DBText
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UI::Text* m_DBText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private Tayx.Graphy.GraphyManager m_graphyManager
    // Size: 0x8
    // Offset: 0x20
    ::Tayx::Graphy::GraphyManager* m_graphyManager;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager*) == 0x8);
    // private Tayx.Graphy.Audio.G_AudioMonitor m_audioMonitor
    // Size: 0x8
    // Offset: 0x28
    ::Tayx::Graphy::Audio::G_AudioMonitor* m_audioMonitor;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Audio::G_AudioMonitor*) == 0x8);
    // private System.Int32 m_updateRate
    // Size: 0x4
    // Offset: 0x30
    int m_updateRate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_deltaTimeOffset
    // Size: 0x4
    // Offset: 0x34
    float m_deltaTimeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.UI.Text m_DBText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_m_DBText();
    // Get instance field reference: private Tayx.Graphy.GraphyManager m_graphyManager
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::GraphyManager*& dyn_m_graphyManager();
    // Get instance field reference: private Tayx.Graphy.Audio.G_AudioMonitor m_audioMonitor
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::Audio::G_AudioMonitor*& dyn_m_audioMonitor();
    // Get instance field reference: private System.Int32 m_updateRate
    [[deprecated("Use field access instead!")]] int& dyn_m_updateRate();
    // Get instance field reference: private System.Single m_deltaTimeOffset
    [[deprecated("Use field access instead!")]] float& dyn_m_deltaTimeOffset();
    // public System.Void .ctor()
    // Offset: 0x2ADC8C0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static G_AudioText* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Tayx::Graphy::Audio::G_AudioText::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<G_AudioText*, creationType>()));
    }
    // private System.Void Awake()
    // Offset: 0x2ADC6B8
    void Awake();
    // private System.Void Update()
    // Offset: 0x2ADC784
    void Update();
    // public System.Void UpdateParameters()
    // Offset: 0x2ADBF98
    void UpdateParameters();
    // private System.Void Init()
    // Offset: 0x2ADC6BC
    void Init();
  }; // Tayx.Graphy.Audio.G_AudioText
  #pragma pack(pop)
  static check_size<sizeof(G_AudioText), 52 + sizeof(float)> __Tayx_Graphy_Audio_G_AudioTextSizeCheck;
  static_assert(sizeof(G_AudioText) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioText::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioText::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioText::*)()>(&Tayx::Graphy::Audio::G_AudioText::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioText*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioText::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioText::*)()>(&Tayx::Graphy::Audio::G_AudioText::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioText*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioText::UpdateParameters
// Il2CppName: UpdateParameters
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioText::*)()>(&Tayx::Graphy::Audio::G_AudioText::UpdateParameters)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioText*), "UpdateParameters", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioText::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioText::*)()>(&Tayx::Graphy::Audio::G_AudioText::Init)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioText*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
