// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Tayx.Graphy.Graph.G_Graph
#include "Tayx/Graphy/Graph/G_Graph.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
}
// Forward declaring namespace: Tayx::Graphy
namespace Tayx::Graphy {
  // Forward declaring type: GraphyManager
  class GraphyManager;
  // Forward declaring type: G_GraphShader
  class G_GraphShader;
}
// Forward declaring namespace: Tayx::Graphy::Audio
namespace Tayx::Graphy::Audio {
  // Forward declaring type: G_AudioMonitor
  class G_AudioMonitor;
}
// Completed forward declares
// Type namespace: Tayx.Graphy.Audio
namespace Tayx::Graphy::Audio {
  // Forward declaring type: G_AudioGraph
  class G_AudioGraph;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Tayx::Graphy::Audio::G_AudioGraph);
DEFINE_IL2CPP_ARG_TYPE(::Tayx::Graphy::Audio::G_AudioGraph*, "Tayx.Graphy.Audio", "G_AudioGraph");
// Type namespace: Tayx.Graphy.Audio
namespace Tayx::Graphy::Audio {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: Tayx.Graphy.Audio.G_AudioGraph
  // [TokenAttribute] Offset: FFFFFFFF
  class G_AudioGraph : public ::Tayx::Graphy::Graph::G_Graph {
    public:
    public:
    // private UnityEngine.UI.Image m_imageGraph
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UI::Image* m_imageGraph;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private UnityEngine.UI.Image m_imageGraphHighestValues
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UI::Image* m_imageGraphHighestValues;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private UnityEngine.Shader ShaderFull
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Shader* ShaderFull;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader ShaderLight
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Shader* ShaderLight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private System.Boolean m_isInitialized
    // Size: 0x1
    // Offset: 0x38
    bool m_isInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isInitialized and: m_graphyManager
    char __padding4[0x7] = {};
    // private Tayx.Graphy.GraphyManager m_graphyManager
    // Size: 0x8
    // Offset: 0x40
    ::Tayx::Graphy::GraphyManager* m_graphyManager;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager*) == 0x8);
    // private Tayx.Graphy.Audio.G_AudioMonitor m_audioMonitor
    // Size: 0x8
    // Offset: 0x48
    ::Tayx::Graphy::Audio::G_AudioMonitor* m_audioMonitor;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Audio::G_AudioMonitor*) == 0x8);
    // private System.Int32 m_resolution
    // Size: 0x4
    // Offset: 0x50
    int m_resolution;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_resolution and: m_shaderGraph
    char __padding7[0x4] = {};
    // private Tayx.Graphy.G_GraphShader m_shaderGraph
    // Size: 0x8
    // Offset: 0x58
    ::Tayx::Graphy::G_GraphShader* m_shaderGraph;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::G_GraphShader*) == 0x8);
    // private Tayx.Graphy.G_GraphShader m_shaderGraphHighestValues
    // Size: 0x8
    // Offset: 0x60
    ::Tayx::Graphy::G_GraphShader* m_shaderGraphHighestValues;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::G_GraphShader*) == 0x8);
    // private System.Single[] m_graphArray
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<float> m_graphArray;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single[] m_graphArrayHighestValue
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<float> m_graphArrayHighestValue;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.UI.Image m_imageGraph
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Image*& dyn_m_imageGraph();
    // Get instance field reference: private UnityEngine.UI.Image m_imageGraphHighestValues
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Image*& dyn_m_imageGraphHighestValues();
    // Get instance field reference: private UnityEngine.Shader ShaderFull
    [[deprecated("Use field access instead!")]] ::UnityEngine::Shader*& dyn_ShaderFull();
    // Get instance field reference: private UnityEngine.Shader ShaderLight
    [[deprecated("Use field access instead!")]] ::UnityEngine::Shader*& dyn_ShaderLight();
    // Get instance field reference: private System.Boolean m_isInitialized
    [[deprecated("Use field access instead!")]] bool& dyn_m_isInitialized();
    // Get instance field reference: private Tayx.Graphy.GraphyManager m_graphyManager
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::GraphyManager*& dyn_m_graphyManager();
    // Get instance field reference: private Tayx.Graphy.Audio.G_AudioMonitor m_audioMonitor
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::Audio::G_AudioMonitor*& dyn_m_audioMonitor();
    // Get instance field reference: private System.Int32 m_resolution
    [[deprecated("Use field access instead!")]] int& dyn_m_resolution();
    // Get instance field reference: private Tayx.Graphy.G_GraphShader m_shaderGraph
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::G_GraphShader*& dyn_m_shaderGraph();
    // Get instance field reference: private Tayx.Graphy.G_GraphShader m_shaderGraphHighestValues
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::G_GraphShader*& dyn_m_shaderGraphHighestValues();
    // Get instance field reference: private System.Single[] m_graphArray
    [[deprecated("Use field access instead!")]] ::ArrayW<float>& dyn_m_graphArray();
    // Get instance field reference: private System.Single[] m_graphArrayHighestValue
    [[deprecated("Use field access instead!")]] ::ArrayW<float>& dyn_m_graphArrayHighestValue();
    // private System.Void OnEnable()
    // Offset: 0x2ADA3AC
    void OnEnable();
    // private System.Void Update()
    // Offset: 0x2ADA404
    void Update();
    // public System.Void UpdateParameters()
    // Offset: 0x2ADA4BC
    void UpdateParameters();
    // private System.Void Init()
    // Offset: 0x2ADACE8
    void Init();
    // public System.Void .ctor()
    // Offset: 0x2ADB378
    // Implemented from: Tayx.Graphy.Graph.G_Graph
    // Base method: System.Void G_Graph::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static G_AudioGraph* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Tayx::Graphy::Audio::G_AudioGraph::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<G_AudioGraph*, creationType>()));
    }
    // protected override System.Void UpdateGraph()
    // Offset: 0x2ADA7C4
    // Implemented from: Tayx.Graphy.Graph.G_Graph
    // Base method: System.Void G_Graph::UpdateGraph()
    void UpdateGraph();
    // protected override System.Void CreatePoints()
    // Offset: 0x2ADAEB8
    // Implemented from: Tayx.Graphy.Graph.G_Graph
    // Base method: System.Void G_Graph::CreatePoints()
    void CreatePoints();
  }; // Tayx.Graphy.Audio.G_AudioGraph
  #pragma pack(pop)
  static check_size<sizeof(G_AudioGraph), 112 + sizeof(::ArrayW<float>)> __Tayx_Graphy_Audio_G_AudioGraphSizeCheck;
  static_assert(sizeof(G_AudioGraph) == 0x78);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioGraph::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioGraph::*)()>(&Tayx::Graphy::Audio::G_AudioGraph::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioGraph*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioGraph::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioGraph::*)()>(&Tayx::Graphy::Audio::G_AudioGraph::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioGraph*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioGraph::UpdateParameters
// Il2CppName: UpdateParameters
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioGraph::*)()>(&Tayx::Graphy::Audio::G_AudioGraph::UpdateParameters)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioGraph*), "UpdateParameters", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioGraph::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioGraph::*)()>(&Tayx::Graphy::Audio::G_AudioGraph::Init)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioGraph*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioGraph::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioGraph::UpdateGraph
// Il2CppName: UpdateGraph
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioGraph::*)()>(&Tayx::Graphy::Audio::G_AudioGraph::UpdateGraph)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioGraph*), "UpdateGraph", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Audio::G_AudioGraph::CreatePoints
// Il2CppName: CreatePoints
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Audio::G_AudioGraph::*)()>(&Tayx::Graphy::Audio::G_AudioGraph::CreatePoints)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Audio::G_AudioGraph*), "CreatePoints", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
