// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// WARNING Layout: Sequential may not be correctly taken into account!
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Playables
namespace UnityEngine::Playables {
  // Forward declaring type: PlayableOutput
  struct PlayableOutput;
  // Forward declaring type: PlayableGraph
  struct PlayableGraph;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Object
  class Object;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
struct Il2CppString;
template<class T>
struct Array;
// Completed il2cpp-utils forward declares
// Type namespace: UnityEngine.Playables
namespace UnityEngine::Playables {
  // Size: 0x20
  // Autogenerated type: UnityEngine.Playables.PlayableBinding
  // [] Offset: FFFFFFFF
  struct PlayableBinding/*, public System::ValueType*/ {
    public:
    // Nested type: UnityEngine::Playables::PlayableBinding::CreateOutputMethod
    class CreateOutputMethod;
    // private System.String m_StreamName
    // Size: 0x8
    // Offset: 0x0
    ::Il2CppString* m_StreamName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private UnityEngine.Object m_SourceObject
    // Size: 0x8
    // Offset: 0x8
    UnityEngine::Object* m_SourceObject;
    // Field size check
    static_assert(sizeof(UnityEngine::Object*) == 0x8);
    // private System.Type m_SourceBindingType
    // Size: 0x8
    // Offset: 0x10
    System::Type* m_SourceBindingType;
    // Field size check
    static_assert(sizeof(System::Type*) == 0x8);
    // private UnityEngine.Playables.PlayableBinding/CreateOutputMethod m_CreateOutputMethod
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Playables::PlayableBinding::CreateOutputMethod* m_CreateOutputMethod;
    // Field size check
    static_assert(sizeof(UnityEngine::Playables::PlayableBinding::CreateOutputMethod*) == 0x8);
    // Creating value type constructor for type: PlayableBinding
    constexpr PlayableBinding(::Il2CppString* m_StreamName_ = {}, UnityEngine::Object* m_SourceObject_ = {}, System::Type* m_SourceBindingType_ = {}, UnityEngine::Playables::PlayableBinding::CreateOutputMethod* m_CreateOutputMethod_ = {}) noexcept : m_StreamName{m_StreamName_}, m_SourceObject{m_SourceObject_}, m_SourceBindingType{m_SourceBindingType_}, m_CreateOutputMethod{m_CreateOutputMethod_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get static field: static public readonly UnityEngine.Playables.PlayableBinding[] None
    static ::Array<UnityEngine::Playables::PlayableBinding>* _get_None();
    // Set static field: static public readonly UnityEngine.Playables.PlayableBinding[] None
    static void _set_None(::Array<UnityEngine::Playables::PlayableBinding>* value);
    // Get static field: static public readonly System.Double DefaultDuration
    static double _get_DefaultDuration();
    // Set static field: static public readonly System.Double DefaultDuration
    static void _set_DefaultDuration(double value);
    // public System.String get_streamName()
    // Offset: 0xCA6FB4
    ::Il2CppString* get_streamName();
    // public UnityEngine.Object get_sourceObject()
    // Offset: 0xCA6FBC
    UnityEngine::Object* get_sourceObject();
    // UnityEngine.Playables.PlayableOutput CreateOutput(UnityEngine.Playables.PlayableGraph graph)
    // Offset: 0xCA6FC4
    UnityEngine::Playables::PlayableOutput CreateOutput(UnityEngine::Playables::PlayableGraph graph);
    // static UnityEngine.Playables.PlayableBinding CreateInternal(System.String name, UnityEngine.Object sourceObject, System.Type sourceType, UnityEngine.Playables.PlayableBinding/CreateOutputMethod createFunction)
    // Offset: 0x1731964
    static UnityEngine::Playables::PlayableBinding CreateInternal(::Il2CppString* name, UnityEngine::Object* sourceObject, System::Type* sourceType, UnityEngine::Playables::PlayableBinding::CreateOutputMethod* createFunction);
    // static private System.Void .cctor()
    // Offset: 0x17319FC
    static void _cctor();
  }; // UnityEngine.Playables.PlayableBinding
  static check_size<sizeof(PlayableBinding), 24 + sizeof(UnityEngine::Playables::PlayableBinding::CreateOutputMethod*)> __UnityEngine_Playables_PlayableBindingSizeCheck;
  static_assert(sizeof(PlayableBinding) == 0x20);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Playables::PlayableBinding, "UnityEngine.Playables", "PlayableBinding");
#pragma pack(pop)
