// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IEquatable`1
#include "System/IEquatable_1.hpp"
// Including type: LitJson.IJsonWrapper
#include "LitJson/IJsonWrapper.hpp"
// Including type: LitJson.JsonType
#include "LitJson/JsonType.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: ICollection because it is already included!
  // Forward declaring type: IDictionaryEnumerator
  class IDictionaryEnumerator;
  // Forward declaring type: IEnumerator
  class IEnumerator;
  // Skipping declaration: IDictionary because it is already included!
  // Skipping declaration: IList because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Array
  class Array;
}
// Forward declaring namespace: LitJson
namespace LitJson {
  // Forward declaring type: JsonWriter
  class JsonWriter;
}
// Completed forward declares
// Type namespace: LitJson
namespace LitJson {
  // Forward declaring type: JsonData
  class JsonData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::LitJson::JsonData);
DEFINE_IL2CPP_ARG_TYPE(::LitJson::JsonData*, "LitJson", "JsonData");
// Type namespace: LitJson
namespace LitJson {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: LitJson.JsonData
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: 992ED0
  class JsonData : public ::Il2CppObject/*, public ::System::IEquatable_1<::LitJson::JsonData*>, public ::LitJson::IJsonWrapper*/ {
    public:
    public:
    // private System.Collections.Generic.IList`1<LitJson.JsonData> inst_array
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::IList_1<::LitJson::JsonData*>* inst_array;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::LitJson::JsonData*>*) == 0x8);
    // private System.Boolean inst_boolean
    // Size: 0x1
    // Offset: 0x18
    bool inst_boolean;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inst_boolean and: inst_double
    char __padding1[0x7] = {};
    // private System.Double inst_double
    // Size: 0x8
    // Offset: 0x20
    double inst_double;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Int32 inst_int
    // Size: 0x4
    // Offset: 0x28
    int inst_int;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: inst_int and: inst_long
    char __padding3[0x4] = {};
    // private System.Int64 inst_long
    // Size: 0x8
    // Offset: 0x30
    int64_t inst_long;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Collections.Generic.IDictionary`2<System.String,LitJson.JsonData> inst_object
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::IDictionary_2<::StringW, ::LitJson::JsonData*>* inst_object;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IDictionary_2<::StringW, ::LitJson::JsonData*>*) == 0x8);
    // private System.String inst_string
    // Size: 0x8
    // Offset: 0x40
    ::StringW inst_string;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String json
    // Size: 0x8
    // Offset: 0x48
    ::StringW json;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private LitJson.JsonType type
    // Size: 0x4
    // Offset: 0x50
    ::LitJson::JsonType type;
    // Field size check
    static_assert(sizeof(::LitJson::JsonType) == 0x4);
    // Padding between fields: type and: object_list
    char __padding8[0x4] = {};
    // private System.Collections.Generic.IList`1<System.Collections.Generic.KeyValuePair`2<System.String,LitJson.JsonData>> object_list
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::IList_1<::System::Collections::Generic::KeyValuePair_2<::StringW, ::LitJson::JsonData*>>* object_list;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::System::Collections::Generic::KeyValuePair_2<::StringW, ::LitJson::JsonData*>>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IEquatable_1<::LitJson::JsonData*>
    operator ::System::IEquatable_1<::LitJson::JsonData*>() noexcept {
      return *reinterpret_cast<::System::IEquatable_1<::LitJson::JsonData*>*>(this);
    }
    // Creating interface conversion operator: operator ::LitJson::IJsonWrapper
    operator ::LitJson::IJsonWrapper() noexcept {
      return *reinterpret_cast<::LitJson::IJsonWrapper*>(this);
    }
    // Get instance field reference: private System.Collections.Generic.IList`1<LitJson.JsonData> inst_array
