// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: LitJson
namespace LitJson {
  // Forward declaring type: FsmContext
  class FsmContext;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: TextReader
  class TextReader;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: LitJson
namespace LitJson {
  // Forward declaring type: Lexer
  class Lexer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::LitJson::Lexer);
DEFINE_IL2CPP_ARG_TYPE(::LitJson::Lexer*, "LitJson", "Lexer");
// Type namespace: LitJson
namespace LitJson {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: LitJson.Lexer
  // [TokenAttribute] Offset: FFFFFFFF
  class Lexer : public ::Il2CppObject {
    public:
    // Nested type: ::LitJson::Lexer::StateHandler
    class StateHandler;
    public:
    // private System.Boolean allow_comments
    // Size: 0x1
    // Offset: 0x10
    bool allow_comments;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean allow_single_quoted_strings
    // Size: 0x1
    // Offset: 0x11
    bool allow_single_quoted_strings;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean end_of_input
    // Size: 0x1
    // Offset: 0x12
    bool end_of_input;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: end_of_input and: fsm_context
    char __padding2[0x5] = {};
    // private LitJson.FsmContext fsm_context
    // Size: 0x8
    // Offset: 0x18
    ::LitJson::FsmContext* fsm_context;
    // Field size check
    static_assert(sizeof(::LitJson::FsmContext*) == 0x8);
    // private System.Int32 input_buffer
    // Size: 0x4
    // Offset: 0x20
    int input_buffer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 input_char
    // Size: 0x4
    // Offset: 0x24
    int input_char;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.IO.TextReader reader
    // Size: 0x8
    // Offset: 0x28
    ::System::IO::TextReader* reader;
    // Field size check
    static_assert(sizeof(::System::IO::TextReader*) == 0x8);
    // private System.Int32 state
    // Size: 0x4
    // Offset: 0x30
    int state;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: state and: string_buffer
    char __padding7[0x4] = {};
    // private System.Text.StringBuilder string_buffer
    // Size: 0x8
    // Offset: 0x38
    ::System::Text::StringBuilder* string_buffer;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.String string_value
    // Size: 0x8
    // Offset: 0x40
    ::StringW string_value;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 token
    // Size: 0x4
    // Offset: 0x48
    int token;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 unichar
    // Size: 0x4
    // Offset: 0x4C
    int unichar;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private System.Int32[] fsm_return_table
    static ::ArrayW<int> _get_fsm_return_table();
    // Set static field: static private System.Int32[] fsm_return_table
    static void _set_fsm_return_table(::ArrayW<int> value);
    // Get static field: static private LitJson.Lexer/LitJson.StateHandler[] fsm_handler_table
    static ::ArrayW<::LitJson::Lexer::StateHandler*> _get_fsm_handler_table();
    // Set static field: static private LitJson.Lexer/LitJson.StateHandler[] fsm_handler_table
    static void _set_fsm_handler_table(::ArrayW<::LitJson::Lexer::StateHandler*> value);
    // Get instance field reference: private System.Boolean allow_comments
    [[deprecated("Use field access instead!")]] bool& dyn_allow_comments();
    // Get instance field reference: private System.Boolean allow_single_quoted_strings
