// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PlayFab::Events
namespace PlayFab::Events {
}
// Forward declaring namespace: PlayFab::AuthenticationModels
namespace PlayFab::AuthenticationModels {
  // Forward declaring type: GetEntityTokenRequest
  class GetEntityTokenRequest;
  // Forward declaring type: GetEntityTokenResponse
  class GetEntityTokenResponse;
  // Forward declaring type: ValidateEntityTokenRequest
  class ValidateEntityTokenRequest;
  // Forward declaring type: ValidateEntityTokenResponse
  class ValidateEntityTokenResponse;
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: LoginResult
  class LoginResult;
  // Forward declaring type: AcceptTradeRequest
  class AcceptTradeRequest;
  // Forward declaring type: AcceptTradeResponse
  class AcceptTradeResponse;
  // Forward declaring type: AddFriendRequest
  class AddFriendRequest;

  // Forward declaring type: ShutdownMultiplayerServerRequest
  class ShutdownMultiplayerServerRequest;
  // Forward declaring type: UntagContainerImageRequest
  class UntagContainerImageRequest;
  // Forward declaring type: UpdateBuildAliasRequest
  class UpdateBuildAliasRequest;
  // Forward declaring type: UpdateBuildRegionRequest
  class UpdateBuildRegionRequest;
  // Forward declaring type: UpdateBuildRegionsRequest
  class UpdateBuildRegionsRequest;
  // Forward declaring type: UploadCertificateRequest
  class UploadCertificateRequest;
}
// Forward declaring namespace: PlayFab::ProfilesModels
namespace PlayFab::ProfilesModels {
  // Forward declaring type: GetGlobalPolicyRequest
  class GetGlobalPolicyRequest;
  // Forward declaring type: GetGlobalPolicyResponse
  class GetGlobalPolicyResponse;
  // Forward declaring type: GetEntityProfileRequest
  class GetEntityProfileRequest;
  // Forward declaring type: GetEntityProfileResponse
  class GetEntityProfileResponse;
  // Forward declaring type: GetEntityProfilesRequest
  class GetEntityProfilesRequest;
  // Forward declaring type: GetEntityProfilesResponse
  class GetEntityProfilesResponse;
  // Forward declaring type: GetTitlePlayersFromMasterPlayerAccountIdsRequest
  class GetTitlePlayersFromMasterPlayerAccountIdsRequest;
  // Forward declaring type: GetTitlePlayersFromMasterPlayerAccountIdsResponse
  class GetTitlePlayersFromMasterPlayerAccountIdsResponse;
  // Forward declaring type: SetGlobalPolicyRequest
  class SetGlobalPolicyRequest;
  // Forward declaring type: SetGlobalPolicyResponse
  class SetGlobalPolicyResponse;
  // Forward declaring type: SetProfileLanguageRequest
  class SetProfileLanguageRequest;
  // Forward declaring type: SetProfileLanguageResponse
  class SetProfileLanguageResponse;
  // Forward declaring type: SetEntityProfilePolicyRequest
  class SetEntityProfilePolicyRequest;
  // Forward declaring type: SetEntityProfilePolicyResponse
  class SetEntityProfilePolicyResponse;
}
// Forward declaring namespace: PlayFab::SharedModels
namespace PlayFab::SharedModels {
  // Forward declaring type: PlayFabRequestCommon
  class PlayFabRequestCommon;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Forward declaring namespace: PlayFab::Internal
namespace PlayFab::Internal {
  // Forward declaring type: ApiProcessingEventArgs
  class ApiProcessingEventArgs;
}
// Completed forward declares
// Type namespace: PlayFab.Events
namespace PlayFab::Events {
  // Forward declaring type: PlayFabEvents
  class PlayFabEvents;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::Events::PlayFabEvents);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::Events::PlayFabEvents*, "PlayFab.Events", "PlayFabEvents");
// Type namespace: PlayFab.Events
namespace PlayFab::Events {
  // Size: 0x11F0
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.Events.PlayFabEvents
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayFabEvents : public ::Il2CppObject {
    public:
    // Nested type: ::PlayFab::Events::PlayFabEvents::PlayFabErrorEvent
    class PlayFabErrorEvent;
    // Nested type: ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<TResult>
    template<typename TResult>
    class PlayFabResultEvent_1;
    // Nested type: ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<TRequest>
    template<typename TRequest>
    class PlayFabRequestEvent_1;
    public:
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.AuthenticationModels.GetEntityTokenRequest> OnAuthenticationGetEntityTokenRequestEvent
    // Size: 0x8
    // Offset: 0x10
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::AuthenticationModels::GetEntityTokenRequest*>* OnAuthenticationGetEntityTokenRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::AuthenticationModels::GetEntityTokenRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.AuthenticationModels.GetEntityTokenResponse> OnAuthenticationGetEntityTokenResultEvent
    // Size: 0x8
    // Offset: 0x18
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::AuthenticationModels::GetEntityTokenResponse*>* OnAuthenticationGetEntityTokenResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::AuthenticationModels::GetEntityTokenResponse*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.AuthenticationModels.ValidateEntityTokenRequest> OnAuthenticationValidateEntityTokenRequestEvent
    // Size: 0x8
    // Offset: 0x20
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::AuthenticationModels::ValidateEntityTokenRequest*>* OnAuthenticationValidateEntityTokenRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::AuthenticationModels::ValidateEntityTokenRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.AuthenticationModels.ValidateEntityTokenResponse> OnAuthenticationValidateEntityTokenResultEvent
    // Size: 0x8
    // Offset: 0x28
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::AuthenticationModels::ValidateEntityTokenResponse*>* OnAuthenticationValidateEntityTokenResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::AuthenticationModels::ValidateEntityTokenResponse*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.LoginResult> OnLoginResultEvent
    // Size: 0x8
    // Offset: 0x30
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::LoginResult*>* OnLoginResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::LoginResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.AcceptTradeRequest> OnAcceptTradeRequestEvent
    // Size: 0x8
    // Offset: 0x38
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AcceptTradeRequest*>* OnAcceptTradeRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AcceptTradeRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.AcceptTradeResponse> OnAcceptTradeResultEvent
    // Size: 0x8
    // Offset: 0x40
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AcceptTradeResponse*>* OnAcceptTradeResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AcceptTradeResponse*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.AddFriendRequest> OnAddFriendRequestEvent
    // Size: 0x8
    // Offset: 0x48
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddFriendRequest*>* OnAddFriendRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddFriendRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.AddFriendResult> OnAddFriendResultEvent
    // Size: 0x8
    // Offset: 0x50
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddFriendResult*>* OnAddFriendResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddFriendResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.AddGenericIDRequest> OnAddGenericIDRequestEvent
    // Size: 0x8
    // Offset: 0x58
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddGenericIDRequest*>* OnAddGenericIDRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddGenericIDRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.AddGenericIDResult> OnAddGenericIDResultEvent
    // Size: 0x8
    // Offset: 0x60
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddGenericIDResult*>* OnAddGenericIDResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddGenericIDResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.AddOrUpdateContactEmailRequest> OnAddOrUpdateContactEmailRequestEvent
    // Size: 0x8
    // Offset: 0x68
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddOrUpdateContactEmailRequest*>* OnAddOrUpdateContactEmailRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddOrUpdateContactEmailRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.AddOrUpdateContactEmailResult> OnAddOrUpdateContactEmailResultEvent
    // Size: 0x8
    // Offset: 0x70
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddOrUpdateContactEmailResult*>* OnAddOrUpdateContactEmailResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddOrUpdateContactEmailResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.AddSharedGroupMembersRequest> OnAddSharedGroupMembersRequestEvent
    // Size: 0x8
    // Offset: 0x78
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddSharedGroupMembersRequest*>* OnAddSharedGroupMembersRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddSharedGroupMembersRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.AddSharedGroupMembersResult> OnAddSharedGroupMembersResultEvent
    // Size: 0x8
    // Offset: 0x80
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddSharedGroupMembersResult*>* OnAddSharedGroupMembersResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddSharedGroupMembersResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.AddUsernamePasswordRequest> OnAddUsernamePasswordRequestEvent
    // Size: 0x8
    // Offset: 0x88
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddUsernamePasswordRequest*>* OnAddUsernamePasswordRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddUsernamePasswordRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.AddUsernamePasswordResult> OnAddUsernamePasswordResultEvent
    // Size: 0x8
    // Offset: 0x90
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddUsernamePasswordResult*>* OnAddUsernamePasswordResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AddUsernamePasswordResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.AddUserVirtualCurrencyRequest> OnAddUserVirtualCurrencyRequestEvent
    // Size: 0x8
    // Offset: 0x98
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddUserVirtualCurrencyRequest*>* OnAddUserVirtualCurrencyRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AddUserVirtualCurrencyRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.ModifyUserVirtualCurrencyResult> OnAddUserVirtualCurrencyResultEvent
    // Size: 0x8
    // Offset: 0xA0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ModifyUserVirtualCurrencyResult*>* OnAddUserVirtualCurrencyResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ModifyUserVirtualCurrencyResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.AndroidDevicePushNotificationRegistrationRequest> OnAndroidDevicePushNotificationRegistrationRequestEvent
    // Size: 0x8
    // Offset: 0xA8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AndroidDevicePushNotificationRegistrationRequest*>* OnAndroidDevicePushNotificationRegistrationRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AndroidDevicePushNotificationRegistrationRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.AndroidDevicePushNotificationRegistrationResult> OnAndroidDevicePushNotificationRegistrationResultEvent
    // Size: 0x8
    // Offset: 0xB0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AndroidDevicePushNotificationRegistrationResult*>* OnAndroidDevicePushNotificationRegistrationResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AndroidDevicePushNotificationRegistrationResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.AttributeInstallRequest> OnAttributeInstallRequestEvent
    // Size: 0x8
    // Offset: 0xB8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AttributeInstallRequest*>* OnAttributeInstallRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::AttributeInstallRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.AttributeInstallResult> OnAttributeInstallResultEvent
    // Size: 0x8
    // Offset: 0xC0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AttributeInstallResult*>* OnAttributeInstallResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::AttributeInstallResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.CancelTradeRequest> OnCancelTradeRequestEvent
    // Size: 0x8
    // Offset: 0xC8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::CancelTradeRequest*>* OnCancelTradeRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::CancelTradeRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.CancelTradeResponse> OnCancelTradeResultEvent
    // Size: 0x8
    // Offset: 0xD0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::CancelTradeResponse*>* OnCancelTradeResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::CancelTradeResponse*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.ConfirmPurchaseRequest> OnConfirmPurchaseRequestEvent
    // Size: 0x8
    // Offset: 0xD8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ConfirmPurchaseRequest*>* OnConfirmPurchaseRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ConfirmPurchaseRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.ConfirmPurchaseResult> OnConfirmPurchaseResultEvent
    // Size: 0x8
    // Offset: 0xE0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ConfirmPurchaseResult*>* OnConfirmPurchaseResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ConfirmPurchaseResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.ConsumeItemRequest> OnConsumeItemRequestEvent
    // Size: 0x8
    // Offset: 0xE8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ConsumeItemRequest*>* OnConsumeItemRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ConsumeItemRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.ConsumeItemResult> OnConsumeItemResultEvent
    // Size: 0x8
    // Offset: 0xF0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ConsumeItemResult*>* OnConsumeItemResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ConsumeItemResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.ConsumePSNEntitlementsRequest> OnConsumePSNEntitlementsRequestEvent
    // Size: 0x8
    // Offset: 0xF8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ConsumePSNEntitlementsRequest*>* OnConsumePSNEntitlementsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ConsumePSNEntitlementsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.ConsumePSNEntitlementsResult> OnConsumePSNEntitlementsResultEvent
    // Size: 0x8
    // Offset: 0x100
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ConsumePSNEntitlementsResult*>* OnConsumePSNEntitlementsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ConsumePSNEntitlementsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.ConsumeXboxEntitlementsRequest> OnConsumeXboxEntitlementsRequestEvent
    // Size: 0x8
    // Offset: 0x108
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ConsumeXboxEntitlementsRequest*>* OnConsumeXboxEntitlementsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ConsumeXboxEntitlementsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.ConsumeXboxEntitlementsResult> OnConsumeXboxEntitlementsResultEvent
    // Size: 0x8
    // Offset: 0x110
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ConsumeXboxEntitlementsResult*>* OnConsumeXboxEntitlementsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ConsumeXboxEntitlementsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.CreateSharedGroupRequest> OnCreateSharedGroupRequestEvent
    // Size: 0x8
    // Offset: 0x118
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::CreateSharedGroupRequest*>* OnCreateSharedGroupRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::CreateSharedGroupRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.CreateSharedGroupResult> OnCreateSharedGroupResultEvent
    // Size: 0x8
    // Offset: 0x120
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::CreateSharedGroupResult*>* OnCreateSharedGroupResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::CreateSharedGroupResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.ExecuteCloudScriptRequest> OnExecuteCloudScriptRequestEvent
    // Size: 0x8
    // Offset: 0x128
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ExecuteCloudScriptRequest*>* OnExecuteCloudScriptRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ExecuteCloudScriptRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.ExecuteCloudScriptResult> OnExecuteCloudScriptResultEvent
    // Size: 0x8
    // Offset: 0x130
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ExecuteCloudScriptResult*>* OnExecuteCloudScriptResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ExecuteCloudScriptResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetAccountInfoRequest> OnGetAccountInfoRequestEvent
    // Size: 0x8
    // Offset: 0x138
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetAccountInfoRequest*>* OnGetAccountInfoRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetAccountInfoRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetAccountInfoResult> OnGetAccountInfoResultEvent
    // Size: 0x8
    // Offset: 0x140
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetAccountInfoResult*>* OnGetAccountInfoResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetAccountInfoResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetAdPlacementsRequest> OnGetAdPlacementsRequestEvent
    // Size: 0x8
    // Offset: 0x148
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetAdPlacementsRequest*>* OnGetAdPlacementsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetAdPlacementsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetAdPlacementsResult> OnGetAdPlacementsResultEvent
    // Size: 0x8
    // Offset: 0x150
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetAdPlacementsResult*>* OnGetAdPlacementsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetAdPlacementsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.ListUsersCharactersRequest> OnGetAllUsersCharactersRequestEvent
    // Size: 0x8
    // Offset: 0x158
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ListUsersCharactersRequest*>* OnGetAllUsersCharactersRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::ListUsersCharactersRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.ListUsersCharactersResult> OnGetAllUsersCharactersResultEvent
    // Size: 0x8
    // Offset: 0x160
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ListUsersCharactersResult*>* OnGetAllUsersCharactersResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::ListUsersCharactersResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetCatalogItemsRequest> OnGetCatalogItemsRequestEvent
    // Size: 0x8
    // Offset: 0x168
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCatalogItemsRequest*>* OnGetCatalogItemsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCatalogItemsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetCatalogItemsResult> OnGetCatalogItemsResultEvent
    // Size: 0x8
    // Offset: 0x170
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCatalogItemsResult*>* OnGetCatalogItemsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCatalogItemsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetCharacterDataRequest> OnGetCharacterDataRequestEvent
    // Size: 0x8
    // Offset: 0x178
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterDataRequest*>* OnGetCharacterDataRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterDataRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetCharacterDataResult> OnGetCharacterDataResultEvent
    // Size: 0x8
    // Offset: 0x180
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterDataResult*>* OnGetCharacterDataResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterDataResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetCharacterInventoryRequest> OnGetCharacterInventoryRequestEvent
    // Size: 0x8
    // Offset: 0x188
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterInventoryRequest*>* OnGetCharacterInventoryRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterInventoryRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetCharacterInventoryResult> OnGetCharacterInventoryResultEvent
    // Size: 0x8
    // Offset: 0x190
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterInventoryResult*>* OnGetCharacterInventoryResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterInventoryResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetCharacterLeaderboardRequest> OnGetCharacterLeaderboardRequestEvent
    // Size: 0x8
    // Offset: 0x198
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterLeaderboardRequest*>* OnGetCharacterLeaderboardRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterLeaderboardRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetCharacterLeaderboardResult> OnGetCharacterLeaderboardResultEvent
    // Size: 0x8
    // Offset: 0x1A0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterLeaderboardResult*>* OnGetCharacterLeaderboardResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterLeaderboardResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetCharacterDataRequest> OnGetCharacterReadOnlyDataRequestEvent
    // Size: 0x8
    // Offset: 0x1A8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterDataRequest*>* OnGetCharacterReadOnlyDataRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterDataRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetCharacterDataResult> OnGetCharacterReadOnlyDataResultEvent
    // Size: 0x8
    // Offset: 0x1B0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterDataResult*>* OnGetCharacterReadOnlyDataResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterDataResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetCharacterStatisticsRequest> OnGetCharacterStatisticsRequestEvent
    // Size: 0x8
    // Offset: 0x1B8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterStatisticsRequest*>* OnGetCharacterStatisticsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetCharacterStatisticsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetCharacterStatisticsResult> OnGetCharacterStatisticsResultEvent
    // Size: 0x8
    // Offset: 0x1C0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterStatisticsResult*>* OnGetCharacterStatisticsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetCharacterStatisticsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetContentDownloadUrlRequest> OnGetContentDownloadUrlRequestEvent
    // Size: 0x8
    // Offset: 0x1C8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetContentDownloadUrlRequest*>* OnGetContentDownloadUrlRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetContentDownloadUrlRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetContentDownloadUrlResult> OnGetContentDownloadUrlResultEvent
    // Size: 0x8
    // Offset: 0x1D0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetContentDownloadUrlResult*>* OnGetContentDownloadUrlResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetContentDownloadUrlResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.CurrentGamesRequest> OnGetCurrentGamesRequestEvent
    // Size: 0x8
    // Offset: 0x1D8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::CurrentGamesRequest*>* OnGetCurrentGamesRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::CurrentGamesRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.CurrentGamesResult> OnGetCurrentGamesResultEvent
    // Size: 0x8
    // Offset: 0x1E0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::CurrentGamesResult*>* OnGetCurrentGamesResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::CurrentGamesResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetFriendLeaderboardRequest> OnGetFriendLeaderboardRequestEvent
    // Size: 0x8
    // Offset: 0x1E8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetFriendLeaderboardRequest*>* OnGetFriendLeaderboardRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetFriendLeaderboardRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetLeaderboardResult> OnGetFriendLeaderboardResultEvent
    // Size: 0x8
    // Offset: 0x1F0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardResult*>* OnGetFriendLeaderboardResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetFriendLeaderboardAroundPlayerRequest> OnGetFriendLeaderboardAroundPlayerRequestEvent
    // Size: 0x8
    // Offset: 0x1F8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetFriendLeaderboardAroundPlayerRequest*>* OnGetFriendLeaderboardAroundPlayerRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetFriendLeaderboardAroundPlayerRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetFriendLeaderboardAroundPlayerResult> OnGetFriendLeaderboardAroundPlayerResultEvent
    // Size: 0x8
    // Offset: 0x200
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetFriendLeaderboardAroundPlayerResult*>* OnGetFriendLeaderboardAroundPlayerResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetFriendLeaderboardAroundPlayerResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetFriendsListRequest> OnGetFriendsListRequestEvent
    // Size: 0x8
    // Offset: 0x208
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetFriendsListRequest*>* OnGetFriendsListRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetFriendsListRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetFriendsListResult> OnGetFriendsListResultEvent
    // Size: 0x8
    // Offset: 0x210
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetFriendsListResult*>* OnGetFriendsListResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetFriendsListResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GameServerRegionsRequest> OnGetGameServerRegionsRequestEvent
    // Size: 0x8
    // Offset: 0x218
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GameServerRegionsRequest*>* OnGetGameServerRegionsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GameServerRegionsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GameServerRegionsResult> OnGetGameServerRegionsResultEvent
    // Size: 0x8
    // Offset: 0x220
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GameServerRegionsResult*>* OnGetGameServerRegionsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GameServerRegionsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetLeaderboardRequest> OnGetLeaderboardRequestEvent
    // Size: 0x8
    // Offset: 0x228
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetLeaderboardRequest*>* OnGetLeaderboardRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetLeaderboardRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetLeaderboardResult> OnGetLeaderboardResultEvent
    // Size: 0x8
    // Offset: 0x230
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardResult*>* OnGetLeaderboardResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetLeaderboardAroundCharacterRequest> OnGetLeaderboardAroundCharacterRequestEvent
    // Size: 0x8
    // Offset: 0x238
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetLeaderboardAroundCharacterRequest*>* OnGetLeaderboardAroundCharacterRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetLeaderboardAroundCharacterRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetLeaderboardAroundCharacterResult> OnGetLeaderboardAroundCharacterResultEvent
    // Size: 0x8
    // Offset: 0x240
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardAroundCharacterResult*>* OnGetLeaderboardAroundCharacterResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardAroundCharacterResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetLeaderboardAroundPlayerRequest> OnGetLeaderboardAroundPlayerRequestEvent
    // Size: 0x8
    // Offset: 0x248
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetLeaderboardAroundPlayerRequest*>* OnGetLeaderboardAroundPlayerRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetLeaderboardAroundPlayerRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetLeaderboardAroundPlayerResult> OnGetLeaderboardAroundPlayerResultEvent
    // Size: 0x8
    // Offset: 0x250
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardAroundPlayerResult*>* OnGetLeaderboardAroundPlayerResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardAroundPlayerResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetLeaderboardForUsersCharactersRequest> OnGetLeaderboardForUserCharactersRequestEvent
    // Size: 0x8
    // Offset: 0x258
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetLeaderboardForUsersCharactersRequest*>* OnGetLeaderboardForUserCharactersRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetLeaderboardForUsersCharactersRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetLeaderboardForUsersCharactersResult> OnGetLeaderboardForUserCharactersResultEvent
    // Size: 0x8
    // Offset: 0x260
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardForUsersCharactersResult*>* OnGetLeaderboardForUserCharactersResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetLeaderboardForUsersCharactersResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPaymentTokenRequest> OnGetPaymentTokenRequestEvent
    // Size: 0x8
    // Offset: 0x268
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPaymentTokenRequest*>* OnGetPaymentTokenRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPaymentTokenRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPaymentTokenResult> OnGetPaymentTokenResultEvent
    // Size: 0x8
    // Offset: 0x270
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPaymentTokenResult*>* OnGetPaymentTokenResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPaymentTokenResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPhotonAuthenticationTokenRequest> OnGetPhotonAuthenticationTokenRequestEvent
    // Size: 0x8
    // Offset: 0x278
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPhotonAuthenticationTokenRequest*>* OnGetPhotonAuthenticationTokenRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPhotonAuthenticationTokenRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPhotonAuthenticationTokenResult> OnGetPhotonAuthenticationTokenResultEvent
    // Size: 0x8
    // Offset: 0x280
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPhotonAuthenticationTokenResult*>* OnGetPhotonAuthenticationTokenResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPhotonAuthenticationTokenResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayerCombinedInfoRequest> OnGetPlayerCombinedInfoRequestEvent
    // Size: 0x8
    // Offset: 0x288
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerCombinedInfoRequest*>* OnGetPlayerCombinedInfoRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerCombinedInfoRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayerCombinedInfoResult> OnGetPlayerCombinedInfoResultEvent
    // Size: 0x8
    // Offset: 0x290
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerCombinedInfoResult*>* OnGetPlayerCombinedInfoResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerCombinedInfoResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayerProfileRequest> OnGetPlayerProfileRequestEvent
    // Size: 0x8
    // Offset: 0x298
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerProfileRequest*>* OnGetPlayerProfileRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerProfileRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayerProfileResult> OnGetPlayerProfileResultEvent
    // Size: 0x8
    // Offset: 0x2A0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerProfileResult*>* OnGetPlayerProfileResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerProfileResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayerSegmentsRequest> OnGetPlayerSegmentsRequestEvent
    // Size: 0x8
    // Offset: 0x2A8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerSegmentsRequest*>* OnGetPlayerSegmentsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerSegmentsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayerSegmentsResult> OnGetPlayerSegmentsResultEvent
    // Size: 0x8
    // Offset: 0x2B0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerSegmentsResult*>* OnGetPlayerSegmentsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerSegmentsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayerStatisticsRequest> OnGetPlayerStatisticsRequestEvent
    // Size: 0x8
    // Offset: 0x2B8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerStatisticsRequest*>* OnGetPlayerStatisticsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerStatisticsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayerStatisticsResult> OnGetPlayerStatisticsResultEvent
    // Size: 0x8
    // Offset: 0x2C0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerStatisticsResult*>* OnGetPlayerStatisticsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerStatisticsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayerStatisticVersionsRequest> OnGetPlayerStatisticVersionsRequestEvent
    // Size: 0x8
    // Offset: 0x2C8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerStatisticVersionsRequest*>* OnGetPlayerStatisticVersionsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerStatisticVersionsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayerStatisticVersionsResult> OnGetPlayerStatisticVersionsResultEvent
    // Size: 0x8
    // Offset: 0x2D0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerStatisticVersionsResult*>* OnGetPlayerStatisticVersionsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerStatisticVersionsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayerTagsRequest> OnGetPlayerTagsRequestEvent
    // Size: 0x8
    // Offset: 0x2D8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerTagsRequest*>* OnGetPlayerTagsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerTagsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayerTagsResult> OnGetPlayerTagsResultEvent
    // Size: 0x8
    // Offset: 0x2E0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerTagsResult*>* OnGetPlayerTagsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerTagsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayerTradesRequest> OnGetPlayerTradesRequestEvent
    // Size: 0x8
    // Offset: 0x2E8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerTradesRequest*>* OnGetPlayerTradesRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayerTradesRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayerTradesResponse> OnGetPlayerTradesResultEvent
    // Size: 0x8
    // Offset: 0x2F0
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerTradesResponse*>* OnGetPlayerTradesResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayerTradesResponse*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromFacebookIDsRequest> OnGetPlayFabIDsFromFacebookIDsRequestEvent
    // Size: 0x8
    // Offset: 0x2F8
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromFacebookIDsRequest*>* OnGetPlayFabIDsFromFacebookIDsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromFacebookIDsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromFacebookIDsResult> OnGetPlayFabIDsFromFacebookIDsResultEvent
    // Size: 0x8
    // Offset: 0x300
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromFacebookIDsResult*>* OnGetPlayFabIDsFromFacebookIDsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromFacebookIDsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromFacebookInstantGamesIdsRequest> OnGetPlayFabIDsFromFacebookInstantGamesIdsRequestEvent
    // Size: 0x8
    // Offset: 0x308
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromFacebookInstantGamesIdsRequest*>* OnGetPlayFabIDsFromFacebookInstantGamesIdsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromFacebookInstantGamesIdsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromFacebookInstantGamesIdsResult> OnGetPlayFabIDsFromFacebookInstantGamesIdsResultEvent
    // Size: 0x8
    // Offset: 0x310
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromFacebookInstantGamesIdsResult*>* OnGetPlayFabIDsFromFacebookInstantGamesIdsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromFacebookInstantGamesIdsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromGameCenterIDsRequest> OnGetPlayFabIDsFromGameCenterIDsRequestEvent
    // Size: 0x8
    // Offset: 0x318
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGameCenterIDsRequest*>* OnGetPlayFabIDsFromGameCenterIDsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGameCenterIDsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromGameCenterIDsResult> OnGetPlayFabIDsFromGameCenterIDsResultEvent
    // Size: 0x8
    // Offset: 0x320
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGameCenterIDsResult*>* OnGetPlayFabIDsFromGameCenterIDsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGameCenterIDsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromGenericIDsRequest> OnGetPlayFabIDsFromGenericIDsRequestEvent
    // Size: 0x8
    // Offset: 0x328
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGenericIDsRequest*>* OnGetPlayFabIDsFromGenericIDsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGenericIDsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromGenericIDsResult> OnGetPlayFabIDsFromGenericIDsResultEvent
    // Size: 0x8
    // Offset: 0x330
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGenericIDsResult*>* OnGetPlayFabIDsFromGenericIDsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGenericIDsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromGoogleIDsRequest> OnGetPlayFabIDsFromGoogleIDsRequestEvent
    // Size: 0x8
    // Offset: 0x338
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGoogleIDsRequest*>* OnGetPlayFabIDsFromGoogleIDsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGoogleIDsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromGoogleIDsResult> OnGetPlayFabIDsFromGoogleIDsResultEvent
    // Size: 0x8
    // Offset: 0x340
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGoogleIDsResult*>* OnGetPlayFabIDsFromGoogleIDsResultEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromGoogleIDsResult*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabRequestEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromKongregateIDsRequest> OnGetPlayFabIDsFromKongregateIDsRequestEvent
    // Size: 0x8
    // Offset: 0x348
    ::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromKongregateIDsRequest*>* OnGetPlayFabIDsFromKongregateIDsRequestEvent;
    // Field size check
    static_assert(sizeof(::PlayFab::Events::PlayFabEvents::PlayFabRequestEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromKongregateIDsRequest*>*) == 0x8);
    // private PlayFab.Events.PlayFabEvents/PlayFab.Events.PlayFabResultEvent`1<PlayFab.ClientModels.GetPlayFabIDsFromKongregateIDsResult> OnGetPlayFabIDsFromKongregateIDsResultEvent
    // Size: 0x8
    // Offset: 0x350
    ::PlayFab::Events::PlayFabEvents::PlayFabResultEvent_1<::PlayFab::ClientModels::GetPlayFabIDsFromKongregateIDsResult*>* OnGetPlayFabIDsFromKongregateIDsResultEvent;
