// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OnlineServices
namespace OnlineServices {
  // Forward declaring type: LeaderboardEntryData
  class LeaderboardEntryData;
  // Forward declaring type: GetLeaderboardEntriesResult
  struct GetLeaderboardEntriesResult;
}
// Completed forward declares
// Type namespace: OnlineServices
namespace OnlineServices {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: OnlineServices.LeaderboardEntriesResult
  // [TokenAttribute] Offset: FFFFFFFF
  class LeaderboardEntriesResult : public ::Il2CppObject {
    public:
    // public readonly System.Boolean isError
    // Size: 0x1
    // Offset: 0x10
    bool isError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isError and: localizedErrorMessage
    char __padding0[0x7] = {};
    // public readonly System.String localizedErrorMessage
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* localizedErrorMessage;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public readonly OnlineServices.LeaderboardEntryData[] leaderboardEntries
    // Size: 0x8
    // Offset: 0x20
    ::Array<OnlineServices::LeaderboardEntryData*>* leaderboardEntries;
    // Field size check
    static_assert(sizeof(::Array<OnlineServices::LeaderboardEntryData*>*) == 0x8);
    // public readonly System.Int32 referencePlayerScoreIndex
    // Size: 0x4
    // Offset: 0x28
    int referencePlayerScoreIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: LeaderboardEntriesResult
    LeaderboardEntriesResult(bool isError_ = {}, ::Il2CppString* localizedErrorMessage_ = {}, ::Array<OnlineServices::LeaderboardEntryData*>* leaderboardEntries_ = {}, int referencePlayerScoreIndex_ = {}) noexcept : isError{isError_}, localizedErrorMessage{localizedErrorMessage_}, leaderboardEntries{leaderboardEntries_}, referencePlayerScoreIndex{referencePlayerScoreIndex_} {}
    // Get instance field: public readonly System.Boolean isError
    bool _get_isError();
    // Set instance field: public readonly System.Boolean isError
    void _set_isError(bool value);
    // Get instance field: public readonly System.String localizedErrorMessage
    ::Il2CppString* _get_localizedErrorMessage();
    // Set instance field: public readonly System.String localizedErrorMessage
    void _set_localizedErrorMessage(::Il2CppString* value);
    // Get instance field: public readonly OnlineServices.LeaderboardEntryData[] leaderboardEntries
    ::Array<OnlineServices::LeaderboardEntryData*>* _get_leaderboardEntries();
    // Set instance field: public readonly OnlineServices.LeaderboardEntryData[] leaderboardEntries
    void _set_leaderboardEntries(::Array<OnlineServices::LeaderboardEntryData*>* value);
    // Get instance field: public readonly System.Int32 referencePlayerScoreIndex
    int _get_referencePlayerScoreIndex();
    // Set instance field: public readonly System.Int32 referencePlayerScoreIndex
    void _set_referencePlayerScoreIndex(int value);
    // static public OnlineServices.LeaderboardEntriesResult get_notInicializedError()
    // Offset: 0x1E4C0AC
    static OnlineServices::LeaderboardEntriesResult* get_notInicializedError();
    // static public OnlineServices.LeaderboardEntriesResult get_somethingWentWrongError()
    // Offset: 0x1E4C0FC
    static OnlineServices::LeaderboardEntriesResult* get_somethingWentWrongError();
    // static public OnlineServices.LeaderboardEntriesResult get_onlineServicesUnavailableError()
    // Offset: 0x1E4C14C
    static OnlineServices::LeaderboardEntriesResult* get_onlineServicesUnavailableError();
    // private System.Void .ctor(OnlineServices.LeaderboardEntryData[] leaderboardEntries, System.Int32 referencePlayerScoreIndex, System.Boolean isError, System.String localizedErrorMessage)
    // Offset: 0x1E4BFE4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LeaderboardEntriesResult* New_ctor(::Array<OnlineServices::LeaderboardEntryData*>* leaderboardEntries, int referencePlayerScoreIndex, bool isError, ::Il2CppString* localizedErrorMessage) {
      static auto ___internal__logger = ::Logger::get().WithContext("OnlineServices::LeaderboardEntriesResult::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LeaderboardEntriesResult*, creationType>(leaderboardEntries, referencePlayerScoreIndex, isError, localizedErrorMessage)));
    }
    // static private OnlineServices.LeaderboardEntriesResult ErrorResult(System.String localizedErrorMessage)
    // Offset: 0x1E4C038
    static OnlineServices::LeaderboardEntriesResult* ErrorResult(::Il2CppString* localizedErrorMessage);
    // static public OnlineServices.LeaderboardEntriesResult FromGetLeaderboardEntriesResult(OnlineServices.GetLeaderboardEntriesResult getLeaderboardEntriesResult)
    // Offset: 0x1E4C19C
    static OnlineServices::LeaderboardEntriesResult* FromGetLeaderboardEntriesResult(OnlineServices::GetLeaderboardEntriesResult getLeaderboardEntriesResult);
  }; // OnlineServices.LeaderboardEntriesResult
  #pragma pack(pop)
  static check_size<sizeof(LeaderboardEntriesResult), 40 + sizeof(int)> __OnlineServices_LeaderboardEntriesResultSizeCheck;
  static_assert(sizeof(LeaderboardEntriesResult) == 0x2C);
}
DEFINE_IL2CPP_ARG_TYPE(OnlineServices::LeaderboardEntriesResult*, "OnlineServices", "LeaderboardEntriesResult");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: OnlineServices::LeaderboardEntriesResult::get_notInicializedError
// Il2CppName: get_notInicializedError
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<OnlineServices::LeaderboardEntriesResult* (*)()>(&OnlineServices::LeaderboardEntriesResult::get_notInicializedError)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(OnlineServices::LeaderboardEntriesResult*), "get_notInicializedError", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: OnlineServices::LeaderboardEntriesResult::get_somethingWentWrongError
// Il2CppName: get_somethingWentWrongError
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<OnlineServices::LeaderboardEntriesResult* (*)()>(&OnlineServices::LeaderboardEntriesResult::get_somethingWentWrongError)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(OnlineServices::LeaderboardEntriesResult*), "get_somethingWentWrongError", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: OnlineServices::LeaderboardEntriesResult::get_onlineServicesUnavailableError
// Il2CppName: get_onlineServicesUnavailableError
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<OnlineServices::LeaderboardEntriesResult* (*)()>(&OnlineServices::LeaderboardEntriesResult::get_onlineServicesUnavailableError)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(OnlineServices::LeaderboardEntriesResult*), "get_onlineServicesUnavailableError", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: OnlineServices::LeaderboardEntriesResult::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: OnlineServices::LeaderboardEntriesResult::ErrorResult
// Il2CppName: ErrorResult
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<OnlineServices::LeaderboardEntriesResult* (*)(::Il2CppString*)>(&OnlineServices::LeaderboardEntriesResult::ErrorResult)> {
  static const MethodInfo* get() {
    static auto* localizedErrorMessage = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(OnlineServices::LeaderboardEntriesResult*), "ErrorResult", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{localizedErrorMessage});
  }
};
// Writing MetadataGetter for method: OnlineServices::LeaderboardEntriesResult::FromGetLeaderboardEntriesResult
// Il2CppName: FromGetLeaderboardEntriesResult
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<OnlineServices::LeaderboardEntriesResult* (*)(OnlineServices::GetLeaderboardEntriesResult)>(&OnlineServices::LeaderboardEntriesResult::FromGetLeaderboardEntriesResult)> {
  static const MethodInfo* get() {
    static auto* getLeaderboardEntriesResult = &::il2cpp_utils::GetClassFromName("OnlineServices", "GetLeaderboardEntriesResult")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(OnlineServices::LeaderboardEntriesResult*), "FromGetLeaderboardEntriesResult", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{getLeaderboardEntriesResult});
  }
};
