// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OnlineServices
namespace OnlineServices {
  // Forward declaring type: PlatformOnlineServicesAvailabilityModel
  class PlatformOnlineServicesAvailabilityModel;
  // Forward declaring type: LevelScoreResultsData
  struct LevelScoreResultsData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: HTTPLeaderboardsModel
  class HTTPLeaderboardsModel;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: OnlineServices
namespace OnlineServices {
  // Size: 0x40
  // Autogenerated type: OnlineServices.LevelScoreUploader
  // [] Offset: FFFFFFFF
  class LevelScoreUploader : public ::Il2CppObject {
    public:
    // Nested type: OnlineServices::LevelScoreUploader::LevelScoreResultsDataUploadInfo
    class LevelScoreResultsDataUploadInfo;
    // Nested type: OnlineServices::LevelScoreUploader::$SendLevelScoreResultAsync$d__13
    struct $SendLevelScoreResultAsync$d__13;
    // [CompilerGeneratedAttribute] Offset: 0xDD34F0
    // private System.Action`1<System.String> scoreForLeaderboardDidUploadEvent
    // Size: 0x8
    // Offset: 0x10
    System::Action_1<::Il2CppString*>* scoreForLeaderboardDidUploadEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // private System.Threading.CancellationTokenSource _cancellationTokenSource
    // Size: 0x8
    // Offset: 0x18
    System::Threading::CancellationTokenSource* cancellationTokenSource;
    // Field size check
    static_assert(sizeof(System::Threading::CancellationTokenSource*) == 0x8);
    // private HTTPLeaderboardsModel _leaderboardsModel
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::HTTPLeaderboardsModel* leaderboardsModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::HTTPLeaderboardsModel*) == 0x8);
    // private System.Collections.Generic.List`1<OnlineServices.LevelScoreUploader/LevelScoreResultsDataUploadInfo> _unsuccessfullySentLevelScoreResultsDataUploadInfos
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Generic::List_1<OnlineServices::LevelScoreUploader::LevelScoreResultsDataUploadInfo*>* unsuccessfullySentLevelScoreResultsDataUploadInfos;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<OnlineServices::LevelScoreUploader::LevelScoreResultsDataUploadInfo*>*) == 0x8);
    // private System.Collections.Generic.List`1<OnlineServices.LevelScoreUploader/LevelScoreResultsDataUploadInfo> _levelScoreResultsDataUploadInfos
    // Size: 0x8
    // Offset: 0x30
    System::Collections::Generic::List_1<OnlineServices::LevelScoreUploader::LevelScoreResultsDataUploadInfo*>* levelScoreResultsDataUploadInfos;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<OnlineServices::LevelScoreUploader::LevelScoreResultsDataUploadInfo*>*) == 0x8);
    // private OnlineServices.PlatformOnlineServicesAvailabilityModel _platformOnlineServicesAvailabilityModel
    // Size: 0x8
    // Offset: 0x38
    OnlineServices::PlatformOnlineServicesAvailabilityModel* platformOnlineServicesAvailabilityModel;
    // Field size check
    static_assert(sizeof(OnlineServices::PlatformOnlineServicesAvailabilityModel*) == 0x8);
    // Creating value type constructor for type: LevelScoreUploader
    LevelScoreUploader(System::Action_1<::Il2CppString*>* scoreForLeaderboardDidUploadEvent_ = {}, System::Threading::CancellationTokenSource* cancellationTokenSource_ = {}, GlobalNamespace::HTTPLeaderboardsModel* leaderboardsModel_ = {}, System::Collections::Generic::List_1<OnlineServices::LevelScoreUploader::LevelScoreResultsDataUploadInfo*>* unsuccessfullySentLevelScoreResultsDataUploadInfos_ = {}, System::Collections::Generic::List_1<OnlineServices::LevelScoreUploader::LevelScoreResultsDataUploadInfo*>* levelScoreResultsDataUploadInfos_ = {}, OnlineServices::PlatformOnlineServicesAvailabilityModel* platformOnlineServicesAvailabilityModel_ = {}) noexcept : scoreForLeaderboardDidUploadEvent{scoreForLeaderboardDidUploadEvent_}, cancellationTokenSource{cancellationTokenSource_}, leaderboardsModel{leaderboardsModel_}, unsuccessfullySentLevelScoreResultsDataUploadInfos{unsuccessfullySentLevelScoreResultsDataUploadInfos_}, levelScoreResultsDataUploadInfos{levelScoreResultsDataUploadInfos_}, platformOnlineServicesAvailabilityModel{platformOnlineServicesAvailabilityModel_} {}
    // static field const value: static private System.Int32 kMaxUploadAttempts
    static constexpr const int kMaxUploadAttempts = 3;
    // Get static field: static private System.Int32 kMaxUploadAttempts
    static int _get_kMaxUploadAttempts();
    // Set static field: static private System.Int32 kMaxUploadAttempts
    static void _set_kMaxUploadAttempts(int value);
    // public System.Void add_scoreForLeaderboardDidUploadEvent(System.Action`1<System.String> value)
    // Offset: 0xEFE3EC
    void add_scoreForLeaderboardDidUploadEvent(System::Action_1<::Il2CppString*>* value);
    // public System.Void remove_scoreForLeaderboardDidUploadEvent(System.Action`1<System.String> value)
    // Offset: 0xEFE490
    void remove_scoreForLeaderboardDidUploadEvent(System::Action_1<::Il2CppString*>* value);
    // public System.Void .ctor(HTTPLeaderboardsModel leaderboardsModel, OnlineServices.PlatformOnlineServicesAvailabilityModel platformOnlineServicesAvailabilityModel)
    // Offset: 0xEFE534
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LevelScoreUploader* New_ctor(GlobalNamespace::HTTPLeaderboardsModel* leaderboardsModel, OnlineServices::PlatformOnlineServicesAvailabilityModel* platformOnlineServicesAvailabilityModel) {
      static auto ___internal__logger = ::Logger::get().WithContext("OnlineServices::LevelScoreUploader::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LevelScoreUploader*, creationType>(leaderboardsModel, platformOnlineServicesAvailabilityModel)));
    }
    // public System.Void SendLevelScoreResult(OnlineServices.LevelScoreResultsData levelScoreResultsData)
    // Offset: 0xEFE60C
    void SendLevelScoreResult(OnlineServices::LevelScoreResultsData levelScoreResultsData);
    // public System.Void TrySendPreviouslyUnsuccessfullySentResults()
    // Offset: 0xEFE7FC
    void TrySendPreviouslyUnsuccessfullySentResults();
    // private System.Void SendLevelScoreResultAsync()
    // Offset: 0xEFE72C
    void SendLevelScoreResultAsync();
    // private System.Void AddUnsuccessfullySentResults()
    // Offset: 0xEFE820
    void AddUnsuccessfullySentResults();
    // protected System.Void OnDestroy()
    // Offset: 0xEFE894
    void OnDestroy();
  }; // OnlineServices.LevelScoreUploader
  static check_size<sizeof(LevelScoreUploader), 56 + sizeof(OnlineServices::PlatformOnlineServicesAvailabilityModel*)> __OnlineServices_LevelScoreUploaderSizeCheck;
  static_assert(sizeof(LevelScoreUploader) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(OnlineServices::LevelScoreUploader*, "OnlineServices", "LevelScoreUploader");
#pragma pack(pop)
