// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CalendarData
  class CalendarData;
  // Forward declaring type: NumberFormatInfo
  class NumberFormatInfo;
}
// Completed forward declares
// Type namespace: System.Globalization
namespace System::Globalization {
  // Forward declaring type: CultureData
  class CultureData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Globalization::CultureData);
DEFINE_IL2CPP_ARG_TYPE(::System::Globalization::CultureData*, "System.Globalization", "CultureData");
// Type namespace: System.Globalization
namespace System::Globalization {
  // Size: 0x88
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Globalization.CultureData
  // [TokenAttribute] Offset: FFFFFFFF
  class CultureData : public ::Il2CppObject {
    public:
    public:
    // private System.String sAM1159
    // Size: 0x8
    // Offset: 0x10
    ::StringW sAM1159;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String sPM2359
    // Size: 0x8
    // Offset: 0x18
    ::StringW sPM2359;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String sTimeSeparator
    // Size: 0x8
    // Offset: 0x20
    ::StringW sTimeSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String[] saLongTimes
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::StringW> saLongTimes;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String[] saShortTimes
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::StringW> saShortTimes;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.Int32 iFirstDayOfWeek
    // Size: 0x4
    // Offset: 0x38
    int iFirstDayOfWeek;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iFirstWeekOfYear
    // Size: 0x4
    // Offset: 0x3C
    int iFirstWeekOfYear;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32[] waCalendars
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<int> waCalendars;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Globalization.CalendarData[] calendars
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::System::Globalization::CalendarData*> calendars;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Globalization::CalendarData*>) == 0x8);
    // private System.String sISO639Language
    // Size: 0x8
    // Offset: 0x50
    ::StringW sISO639Language;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.String sRealName
    // Size: 0x8
    // Offset: 0x58
    ::StringW sRealName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean bUseOverrides
    // Size: 0x1
    // Offset: 0x60
    bool bUseOverrides;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bUseOverrides and: calendarId
    char __padding11[0x3] = {};
    // private System.Int32 calendarId
    // Size: 0x4
    // Offset: 0x64
    int calendarId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 numberIndex
    // Size: 0x4
    // Offset: 0x68
    int numberIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iDefaultAnsiCodePage
    // Size: 0x4
    // Offset: 0x6C
    int iDefaultAnsiCodePage;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iDefaultOemCodePage
    // Size: 0x4
    // Offset: 0x70
    int iDefaultOemCodePage;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iDefaultMacCodePage
    // Size: 0x4
    // Offset: 0x74
    int iDefaultMacCodePage;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iDefaultEbcdicCodePage
    // Size: 0x4
    // Offset: 0x78
    int iDefaultEbcdicCodePage;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean isRightToLeft
    // Size: 0x1
    // Offset: 0x7C
    bool isRightToLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isRightToLeft and: sListSeparator
    char __padding18[0x3] = {};
    // private System.String sListSeparator
    // Size: 0x8
    // Offset: 0x80
    ::StringW sListSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get static field: static private System.Globalization.CultureData s_Invariant
    static ::System::Globalization::CultureData* _get_s_Invariant();
    // Set static field: static private System.Globalization.CultureData s_Invariant
    static void _set_s_Invariant(::System::Globalization::CultureData* value);
    // Get instance field reference: private System.String sAM1159
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sAM1159();
    // Get instance field reference: private System.String sPM2359
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sPM2359();
    // Get instance field reference: private System.String sTimeSeparator
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sTimeSeparator();
    // Get instance field reference: private System.String[] saLongTimes
