// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CalendarData
  class CalendarData;
  // Forward declaring type: NumberFormatInfo
  class NumberFormatInfo;
}
// Completed forward declares
// Type namespace: System.Globalization
namespace System::Globalization {
  // Size: 0x88
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Globalization.CultureData
  class CultureData : public ::Il2CppObject {
    public:
    // private System.String sAM1159
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* sAM1159;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String sPM2359
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* sPM2359;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String sTimeSeparator
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* sTimeSeparator;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String[] saLongTimes
    // Size: 0x8
    // Offset: 0x28
    ::Array<::Il2CppString*>* saLongTimes;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // private System.String[] saShortTimes
    // Size: 0x8
    // Offset: 0x30
    ::Array<::Il2CppString*>* saShortTimes;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // private System.Int32 iFirstDayOfWeek
    // Size: 0x4
    // Offset: 0x38
    int iFirstDayOfWeek;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iFirstWeekOfYear
    // Size: 0x4
    // Offset: 0x3C
    int iFirstWeekOfYear;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32[] waCalendars
    // Size: 0x8
    // Offset: 0x40
    ::Array<int>* waCalendars;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Globalization.CalendarData[] calendars
    // Size: 0x8
    // Offset: 0x48
    ::Array<System::Globalization::CalendarData*>* calendars;
    // Field size check
    static_assert(sizeof(::Array<System::Globalization::CalendarData*>*) == 0x8);
    // private System.String sISO639Language
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppString* sISO639Language;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.String sRealName
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppString* sRealName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean bUseOverrides
    // Size: 0x1
    // Offset: 0x60
    bool bUseOverrides;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bUseOverrides and: calendarId
    char __padding11[0x3] = {};
    // private System.Int32 calendarId
    // Size: 0x4
    // Offset: 0x64
    int calendarId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 numberIndex
    // Size: 0x4
    // Offset: 0x68
    int numberIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iDefaultAnsiCodePage
    // Size: 0x4
    // Offset: 0x6C
    int iDefaultAnsiCodePage;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iDefaultOemCodePage
    // Size: 0x4
    // Offset: 0x70
    int iDefaultOemCodePage;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iDefaultMacCodePage
    // Size: 0x4
    // Offset: 0x74
    int iDefaultMacCodePage;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iDefaultEbcdicCodePage
    // Size: 0x4
    // Offset: 0x78
    int iDefaultEbcdicCodePage;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean isRightToLeft
    // Size: 0x1
    // Offset: 0x7C
    bool isRightToLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isRightToLeft and: sListSeparator
    char __padding18[0x3] = {};
    // private System.String sListSeparator
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppString* sListSeparator;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: CultureData
