// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.IFormatProvider
#include "System/IFormatProvider.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: NumberFormatInfo
  class NumberFormatInfo;
  // Forward declaring type: DateTimeFormatInfo
  class DateTimeFormatInfo;
  // Forward declaring type: TextInfo
  class TextInfo;
  // Forward declaring type: CompareInfo
  class CompareInfo;
  // Forward declaring type: Calendar
  class Calendar;
  // Forward declaring type: CultureData
  class CultureData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: System.Globalization
namespace System::Globalization {
  // Size: 0xC9
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Globalization.CultureInfo
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: E610D8
  class CultureInfo : public ::Il2CppObject/*, public System::ICloneable, public System::IFormatProvider*/ {
    public:
    // Nested type: System::Globalization::CultureInfo::Data
    struct Data;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private System.Boolean m_isReadOnly
    // Size: 0x1
    // Offset: 0x10
    bool m_isReadOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isReadOnly and: cultureID
    char __padding0[0x3] = {};
    // private System.Int32 cultureID
    // Size: 0x4
    // Offset: 0x14
    int cultureID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 parent_lcid
    // Size: 0x4
    // Offset: 0x18
    int parent_lcid;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 datetime_index
    // Size: 0x4
    // Offset: 0x1C
    int datetime_index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 number_index
    // Size: 0x4
    // Offset: 0x20
    int number_index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 default_calendar_type
    // Size: 0x4
    // Offset: 0x24
    int default_calendar_type;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_useUserOverride
    // Size: 0x1
    // Offset: 0x28
    bool m_useUserOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_useUserOverride and: numInfo
    char __padding6[0x7] = {};
    // System.Globalization.NumberFormatInfo numInfo
    // Size: 0x8
    // Offset: 0x30
    System::Globalization::NumberFormatInfo* numInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::NumberFormatInfo*) == 0x8);
    // System.Globalization.DateTimeFormatInfo dateTimeInfo
    // Size: 0x8
    // Offset: 0x38
    System::Globalization::DateTimeFormatInfo* dateTimeInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::DateTimeFormatInfo*) == 0x8);
    // private System.Globalization.TextInfo textInfo
    // Size: 0x8
    // Offset: 0x40
    System::Globalization::TextInfo* textInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::TextInfo*) == 0x8);
    // System.String m_name
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* m_name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String englishname
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppString* englishname;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String nativename
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppString* nativename;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String iso3lang
    // Size: 0x8
    // Offset: 0x60
    ::Il2CppString* iso3lang;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String iso2lang
    // Size: 0x8
    // Offset: 0x68
    ::Il2CppString* iso2lang;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String win3lang
    // Size: 0x8
    // Offset: 0x70
    ::Il2CppString* win3lang;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String territory
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppString* territory;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String[] native_calendar_names
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::Il2CppString*> native_calendar_names;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppString*>) == 0x8);
    // private System.Globalization.CompareInfo compareInfo
    // Size: 0x8
    // Offset: 0x88
    System::Globalization::CompareInfo* compareInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::CompareInfo*) == 0x8);
    // private readonly System.Void* textinfo_data
    // Size: 0x8
    // Offset: 0x90
    void* textinfo_data;
    // Field size check
    static_assert(sizeof(void*) == 0x8);
    // private System.Int32 m_dataItem
    // Size: 0x4
    // Offset: 0x98
    int m_dataItem;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_dataItem and: calendar
    char __padding20[0x4] = {};
    // private System.Globalization.Calendar calendar
    // Size: 0x8
    // Offset: 0xA0
    System::Globalization::Calendar* calendar;
    // Field size check
    static_assert(sizeof(System::Globalization::Calendar*) == 0x8);
    // private System.Globalization.CultureInfo parent_culture
    // Size: 0x8
    // Offset: 0xA8
    System::Globalization::CultureInfo* parent_culture;
    // Field size check
    static_assert(sizeof(System::Globalization::CultureInfo*) == 0x8);
    // private System.Boolean constructed
    // Size: 0x1
    // Offset: 0xB0
    bool constructed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: constructed and: cached_serialized_form
    char __padding23[0x7] = {};
    // System.Byte[] cached_serialized_form
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<uint8_t> cached_serialized_form;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // System.Globalization.CultureData m_cultureData
    // Size: 0x8
    // Offset: 0xC0
    System::Globalization::CultureData* m_cultureData;
    // Field size check
    static_assert(sizeof(System::Globalization::CultureData*) == 0x8);
    // System.Boolean m_isInherited
    // Size: 0x1
    // Offset: 0xC8
    bool m_isInherited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator System::ICloneable
    operator System::ICloneable() noexcept {
      return *reinterpret_cast<System::ICloneable*>(this);
    }
    // Creating interface conversion operator: operator System::IFormatProvider
    operator System::IFormatProvider() noexcept {
      return *reinterpret_cast<System::IFormatProvider*>(this);
    }
    // Get static field: static private System.Globalization.CultureInfo invariant_culture_info
    static System::Globalization::CultureInfo* _get_invariant_culture_info();
    // Set static field: static private System.Globalization.CultureInfo invariant_culture_info
    static void _set_invariant_culture_info(System::Globalization::CultureInfo* value);
    // Get static field: static private System.Object shared_table_lock
