// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.IFormatProvider
#include "System/IFormatProvider.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: NumberFormatInfo
  class NumberFormatInfo;
  // Forward declaring type: DateTimeFormatInfo
  class DateTimeFormatInfo;
  // Forward declaring type: TextInfo
  class TextInfo;
  // Forward declaring type: CompareInfo
  class CompareInfo;
  // Forward declaring type: Calendar
  class Calendar;
  // Forward declaring type: CultureData
  class CultureData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: System.Globalization
namespace System::Globalization {
  // Size: 0xC9
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Globalization.CultureInfo
  // [ComVisibleAttribute] Offset: CA7AD8
  class CultureInfo : public ::Il2CppObject/*, public System::ICloneable, public System::IFormatProvider*/ {
    public:
    // Nested type: System::Globalization::CultureInfo::Data
    struct Data;
    // private System.Boolean m_isReadOnly
    // Size: 0x1
    // Offset: 0x10
    bool m_isReadOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isReadOnly and: cultureID
    char __padding0[0x3] = {};
    // private System.Int32 cultureID
    // Size: 0x4
    // Offset: 0x14
    int cultureID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 parent_lcid
    // Size: 0x4
    // Offset: 0x18
    int parent_lcid;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 datetime_index
    // Size: 0x4
    // Offset: 0x1C
    int datetime_index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 number_index
    // Size: 0x4
    // Offset: 0x20
    int number_index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 default_calendar_type
    // Size: 0x4
    // Offset: 0x24
    int default_calendar_type;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_useUserOverride
    // Size: 0x1
    // Offset: 0x28
    bool m_useUserOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_useUserOverride and: numInfo
    char __padding6[0x7] = {};
    // System.Globalization.NumberFormatInfo numInfo
    // Size: 0x8
    // Offset: 0x30
    System::Globalization::NumberFormatInfo* numInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::NumberFormatInfo*) == 0x8);
    // System.Globalization.DateTimeFormatInfo dateTimeInfo
    // Size: 0x8
    // Offset: 0x38
    System::Globalization::DateTimeFormatInfo* dateTimeInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::DateTimeFormatInfo*) == 0x8);
    // private System.Globalization.TextInfo textInfo
    // Size: 0x8
    // Offset: 0x40
    System::Globalization::TextInfo* textInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::TextInfo*) == 0x8);
    // System.String m_name
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* m_name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String englishname
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppString* englishname;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String nativename
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppString* nativename;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String iso3lang
    // Size: 0x8
    // Offset: 0x60
    ::Il2CppString* iso3lang;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String iso2lang
    // Size: 0x8
    // Offset: 0x68
    ::Il2CppString* iso2lang;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String win3lang
    // Size: 0x8
    // Offset: 0x70
    ::Il2CppString* win3lang;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String territory
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppString* territory;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String[] native_calendar_names
    // Size: 0x8
    // Offset: 0x80
    ::Array<::Il2CppString*>* native_calendar_names;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // private System.Globalization.CompareInfo compareInfo
    // Size: 0x8
    // Offset: 0x88
    System::Globalization::CompareInfo* compareInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::CompareInfo*) == 0x8);
    // private readonly System.Void* textinfo_data
    // Size: 0x8
    // Offset: 0x90
    void* textinfo_data;
    // Field size check
    static_assert(sizeof(void*) == 0x8);
    // private System.Int32 m_dataItem
    // Size: 0x4
    // Offset: 0x98
    int m_dataItem;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_dataItem and: calendar
    char __padding20[0x4] = {};
    // private System.Globalization.Calendar calendar
    // Size: 0x8
    // Offset: 0xA0
    System::Globalization::Calendar* calendar;
    // Field size check
    static_assert(sizeof(System::Globalization::Calendar*) == 0x8);
    // private System.Globalization.CultureInfo parent_culture
    // Size: 0x8
    // Offset: 0xA8
    System::Globalization::CultureInfo* parent_culture;
    // Field size check
    static_assert(sizeof(System::Globalization::CultureInfo*) == 0x8);
    // private System.Boolean constructed
    // Size: 0x1
    // Offset: 0xB0
    bool constructed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: constructed and: cached_serialized_form
    char __padding23[0x7] = {};
    // System.Byte[] cached_serialized_form
    // Size: 0x8
    // Offset: 0xB8
    ::Array<uint8_t>* cached_serialized_form;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // System.Globalization.CultureData m_cultureData
    // Size: 0x8
    // Offset: 0xC0
    System::Globalization::CultureData* m_cultureData;
    // Field size check
    static_assert(sizeof(System::Globalization::CultureData*) == 0x8);
    // System.Boolean m_isInherited
    // Size: 0x1
    // Offset: 0xC8
    bool m_isInherited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: CultureInfo
    CultureInfo(bool m_isReadOnly_ = {}, int cultureID_ = {}, int parent_lcid_ = {}, int datetime_index_ = {}, int number_index_ = {}, int default_calendar_type_ = {}, bool m_useUserOverride_ = {}, System::Globalization::NumberFormatInfo* numInfo_ = {}, System::Globalization::DateTimeFormatInfo* dateTimeInfo_ = {}, System::Globalization::TextInfo* textInfo_ = {}, ::Il2CppString* m_name_ = {}, ::Il2CppString* englishname_ = {}, ::Il2CppString* nativename_ = {}, ::Il2CppString* iso3lang_ = {}, ::Il2CppString* iso2lang_ = {}, ::Il2CppString* win3lang_ = {}, ::Il2CppString* territory_ = {}, ::Array<::Il2CppString*>* native_calendar_names_ = {}, System::Globalization::CompareInfo* compareInfo_ = {}, void* textinfo_data_ = {}, int m_dataItem_ = {}, System::Globalization::Calendar* calendar_ = {}, System::Globalization::CultureInfo* parent_culture_ = {}, bool constructed_ = {}, ::Array<uint8_t>* cached_serialized_form_ = {}, System::Globalization::CultureData* m_cultureData_ = {}, bool m_isInherited_ = {}) noexcept : m_isReadOnly{m_isReadOnly_}, cultureID{cultureID_}, parent_lcid{parent_lcid_}, datetime_index{datetime_index_}, number_index{number_index_}, default_calendar_type{default_calendar_type_}, m_useUserOverride{m_useUserOverride_}, numInfo{numInfo_}, dateTimeInfo{dateTimeInfo_}, textInfo{textInfo_}, m_name{m_name_}, englishname{englishname_}, nativename{nativename_}, iso3lang{iso3lang_}, iso2lang{iso2lang_}, win3lang{win3lang_}, territory{territory_}, native_calendar_names{native_calendar_names_}, compareInfo{compareInfo_}, textinfo_data{textinfo_data_}, m_dataItem{m_dataItem_}, calendar{calendar_}, parent_culture{parent_culture_}, constructed{constructed_}, cached_serialized_form{cached_serialized_form_}, m_cultureData{m_cultureData_}, m_isInherited{m_isInherited_} {}
    // Creating interface conversion operator: operator System::ICloneable
    operator System::ICloneable() noexcept {
      return *reinterpret_cast<System::ICloneable*>(this);
    }
    // Creating interface conversion operator: operator System::IFormatProvider
    operator System::IFormatProvider() noexcept {
      return *reinterpret_cast<System::IFormatProvider*>(this);
    }
    // Get static field: static private System.Globalization.CultureInfo invariant_culture_info
    static System::Globalization::CultureInfo* _get_invariant_culture_info();
    // Set static field: static private System.Globalization.CultureInfo invariant_culture_info
    static void _set_invariant_culture_info(System::Globalization::CultureInfo* value);
    // Get static field: static private System.Object shared_table_lock
    static ::Il2CppObject* _get_shared_table_lock();
    // Set static field: static private System.Object shared_table_lock
    static void _set_shared_table_lock(::Il2CppObject* value);
    // Get static field: static private System.Globalization.CultureInfo default_current_culture
    static System::Globalization::CultureInfo* _get_default_current_culture();
    // Set static field: static private System.Globalization.CultureInfo default_current_culture
    static void _set_default_current_culture(System::Globalization::CultureInfo* value);
    // static field const value: static System.Int32 InvariantCultureId
    static constexpr const int InvariantCultureId = 127;
    // Get static field: static System.Int32 InvariantCultureId
    static int _get_InvariantCultureId();
    // Set static field: static System.Int32 InvariantCultureId
    static void _set_InvariantCultureId(int value);
    // static field const value: static private System.Int32 CalendarTypeBits
    static constexpr const int CalendarTypeBits = 8;
    // Get static field: static private System.Int32 CalendarTypeBits
    static int _get_CalendarTypeBits();
    // Set static field: static private System.Int32 CalendarTypeBits
    static void _set_CalendarTypeBits(int value);
    // static field const value: static private System.String MSG_READONLY
    static constexpr const char* MSG_READONLY = "This instance is read only";
    // Get static field: static private System.String MSG_READONLY
    static ::Il2CppString* _get_MSG_READONLY();
    // Set static field: static private System.String MSG_READONLY
    static void _set_MSG_READONLY(::Il2CppString* value);
    // Get static field: static private System.Globalization.CultureInfo s_DefaultThreadCurrentUICulture
    static System::Globalization::CultureInfo* _get_s_DefaultThreadCurrentUICulture();
    // Set static field: static private System.Globalization.CultureInfo s_DefaultThreadCurrentUICulture
    static void _set_s_DefaultThreadCurrentUICulture(System::Globalization::CultureInfo* value);
    // Get static field: static private System.Globalization.CultureInfo s_DefaultThreadCurrentCulture
    static System::Globalization::CultureInfo* _get_s_DefaultThreadCurrentCulture();
    // Set static field: static private System.Globalization.CultureInfo s_DefaultThreadCurrentCulture
    static void _set_s_DefaultThreadCurrentCulture(System::Globalization::CultureInfo* value);
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.Int32,System.Globalization.CultureInfo> shared_by_number
    static System::Collections::Generic::Dictionary_2<int, System::Globalization::CultureInfo*>* _get_shared_by_number();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.Int32,System.Globalization.CultureInfo> shared_by_number
    static void _set_shared_by_number(System::Collections::Generic::Dictionary_2<int, System::Globalization::CultureInfo*>* value);
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Globalization.CultureInfo> shared_by_name
    static System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Globalization::CultureInfo*>* _get_shared_by_name();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Globalization.CultureInfo> shared_by_name
    static void _set_shared_by_name(System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Globalization::CultureInfo*>* value);
    // Get static field: static readonly System.Boolean IsTaiwanSku
    static bool _get_IsTaiwanSku();
    // Set static field: static readonly System.Boolean IsTaiwanSku
    static void _set_IsTaiwanSku(bool value);
    // static public System.Globalization.CultureInfo get_InvariantCulture()
    // Offset: 0x1655AF4
    static System::Globalization::CultureInfo* get_InvariantCulture();
    // static public System.Globalization.CultureInfo get_CurrentCulture()
    // Offset: 0x1658C20
    static System::Globalization::CultureInfo* get_CurrentCulture();
    // static public System.Globalization.CultureInfo get_CurrentUICulture()
    // Offset: 0x16623F0
    static System::Globalization::CultureInfo* get_CurrentUICulture();
    // static System.Globalization.CultureInfo ConstructCurrentCulture()
    // Offset: 0x1662414
    static System::Globalization::CultureInfo* ConstructCurrentCulture();
    // static System.Globalization.CultureInfo ConstructCurrentUICulture()
    // Offset: 0x1662858
    static System::Globalization::CultureInfo* ConstructCurrentUICulture();
    // System.String get_Territory()
    // Offset: 0x16628B4
    ::Il2CppString* get_Territory();
    // public System.Int32 get_LCID()
    // Offset: 0x16628BC
    int get_LCID();
    // public System.String get_Name()
    // Offset: 0x16628C4
    ::Il2CppString* get_Name();
    // public System.Globalization.Calendar get_Calendar()
    // Offset: 0x16628CC
    System::Globalization::Calendar* get_Calendar();
    // public System.Globalization.CultureInfo get_Parent()
    // Offset: 0x1662B88
    System::Globalization::CultureInfo* get_Parent();
    // public System.Globalization.TextInfo get_TextInfo()
    // Offset: 0x1662DD4
    System::Globalization::TextInfo* get_TextInfo();
    // public System.Object Clone()
    // Offset: 0x1662F40
    ::Il2CppObject* Clone();
    // private System.Globalization.CultureInfo/Data GetTextInfoData()
    // Offset: 0x1663260
    System::Globalization::CultureInfo::Data GetTextInfoData();
    // public System.Globalization.CompareInfo get_CompareInfo()
    // Offset: 0x166328C
    System::Globalization::CompareInfo* get_CompareInfo();
    // public System.Boolean get_IsNeutralCulture()
    // Offset: 0x16633A4
    bool get_IsNeutralCulture();
    // private System.Void CheckNeutral()
    // Offset: 0x16633F8
    void CheckNeutral();
    // public System.Globalization.NumberFormatInfo get_NumberFormat()
    // Offset: 0x16633FC
    System::Globalization::NumberFormatInfo* get_NumberFormat();
    // public System.Void set_NumberFormat(System.Globalization.NumberFormatInfo value)
    // Offset: 0x166349C
    void set_NumberFormat(System::Globalization::NumberFormatInfo* value);
    // public System.Globalization.DateTimeFormatInfo get_DateTimeFormat()
    // Offset: 0x1663580
    System::Globalization::DateTimeFormatInfo* get_DateTimeFormat();
    // public System.Void set_DateTimeFormat(System.Globalization.DateTimeFormatInfo value)
    // Offset: 0x16636C8
    void set_DateTimeFormat(System::Globalization::DateTimeFormatInfo* value);
    // public System.String get_EnglishName()
    // Offset: 0x16637AC
    ::Il2CppString* get_EnglishName();
    // public System.Boolean get_IsReadOnly()
    // Offset: 0x16637E8
    bool get_IsReadOnly();
    // public System.Object GetFormat(System.Type formatType)
    // Offset: 0x16637F0
    ::Il2CppObject* GetFormat(System::Type* formatType);
    // private System.Void Construct()
    // Offset: 0x1662960
    void Construct();
    // private System.Boolean construct_internal_locale_from_lcid(System.Int32 lcid)
    // Offset: 0x16638F8
    bool construct_internal_locale_from_lcid(int lcid);
    // private System.Boolean construct_internal_locale_from_name(System.String name)
    // Offset: 0x16638FC
    bool construct_internal_locale_from_name(::Il2CppString* name);
    // static private System.String get_current_locale_name()
    // Offset: 0x16625BC
    static ::Il2CppString* get_current_locale_name();
    // private System.Void ConstructInvariant(System.Boolean read_only)
    // Offset: 0x1663900
    void ConstructInvariant(bool read_only);
    // private System.Globalization.TextInfo CreateTextInfo(System.Boolean readOnly)
    // Offset: 0x1662EBC
    System::Globalization::TextInfo* CreateTextInfo(bool readOnly);
    // public System.Void .ctor(System.Int32 culture)
    // Offset: 0x1662DC8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CultureInfo* New_ctor(int culture) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Globalization::CultureInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CultureInfo*, creationType>(culture)));
    }
    // public System.Void .ctor(System.Int32 culture, System.Boolean useUserOverride)
    // Offset: 0x1663A18
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CultureInfo* New_ctor(int culture, bool useUserOverride) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Globalization::CultureInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CultureInfo*, creationType>(culture, useUserOverride)));
    }
    // private System.Void .ctor(System.Int32 culture, System.Boolean useUserOverride, System.Boolean read_only)
    // Offset: 0x1663A24
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CultureInfo* New_ctor(int culture, bool useUserOverride, bool read_only) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Globalization::CultureInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CultureInfo*, creationType>(culture, useUserOverride, read_only)));
    }
    // public System.Void .ctor(System.String name)
    // Offset: 0x1662DBC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CultureInfo* New_ctor(::Il2CppString* name) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Globalization::CultureInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CultureInfo*, creationType>(name)));
    }
    // public System.Void .ctor(System.String name, System.Boolean useUserOverride)
    // Offset: 0x1661A04
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CultureInfo* New_ctor(::Il2CppString* name, bool useUserOverride) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Globalization::CultureInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CultureInfo*, creationType>(name, useUserOverride)));
    }
    // private System.Void .ctor(System.String name, System.Boolean useUserOverride, System.Boolean read_only)
    // Offset: 0x1663D40
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CultureInfo* New_ctor(::Il2CppString* name, bool useUserOverride, bool read_only) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Globalization::CultureInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CultureInfo*, creationType>(name, useUserOverride, read_only)));
    }
    // static private System.Void insert_into_shared_tables(System.Globalization.CultureInfo c)
    // Offset: 0x1664048
    static void insert_into_shared_tables(System::Globalization::CultureInfo* c);
    // static public System.Globalization.CultureInfo GetCultureInfo(System.Int32 culture)
    // Offset: 0x165F9B4
    static System::Globalization::CultureInfo* GetCultureInfo(int culture);
    // static public System.Globalization.CultureInfo GetCultureInfo(System.String name)
    // Offset: 0x165EB88
    static System::Globalization::CultureInfo* GetCultureInfo(::Il2CppString* name);
    // static System.Globalization.CultureInfo CreateCulture(System.String name, System.Boolean reference)
    // Offset: 0x16641A0
    static System::Globalization::CultureInfo* CreateCulture(::Il2CppString* name, bool reference);
    // static public System.Globalization.CultureInfo CreateSpecificCulture(System.String name)
    // Offset: 0x16625C0
    static System::Globalization::CultureInfo* CreateSpecificCulture(::Il2CppString* name);
    // static private System.Globalization.CultureInfo CreateSpecificCultureFromNeutral(System.String name)
    // Offset: 0x1664224
    static System::Globalization::CultureInfo* CreateSpecificCultureFromNeutral(::Il2CppString* name);
    // System.Int32 get_CalendarType()
    // Offset: 0x1663CA4
    int get_CalendarType();
    // static private System.Globalization.Calendar CreateCalendar(System.Int32 calendarType)
    // Offset: 0x166298C
    static System::Globalization::Calendar* CreateCalendar(int calendarType);
    // static private System.Exception CreateNotFoundException(System.String name)
    // Offset: 0x1663F80
    static System::Exception* CreateNotFoundException(::Il2CppString* name);
    // static public System.Globalization.CultureInfo get_DefaultThreadCurrentCulture()
    // Offset: 0x16662C0
    static System::Globalization::CultureInfo* get_DefaultThreadCurrentCulture();
    // static public System.Globalization.CultureInfo get_DefaultThreadCurrentUICulture()
    // Offset: 0x1666330
    static System::Globalization::CultureInfo* get_DefaultThreadCurrentUICulture();
    // System.String get_SortName()
    // Offset: 0x16663A0
    ::Il2CppString* get_SortName();
    // static System.Globalization.CultureInfo get_UserDefaultUICulture()
    // Offset: 0x16663A8
    static System::Globalization::CultureInfo* get_UserDefaultUICulture();
    // static System.Globalization.CultureInfo get_UserDefaultCulture()
    // Offset: 0x1666404
    static System::Globalization::CultureInfo* get_UserDefaultCulture();
    // static System.Void CheckDomainSafetyObject(System.Object obj, System.Object container)
    // Offset: 0x1666460
    static void CheckDomainSafetyObject(::Il2CppObject* obj, ::Il2CppObject* container);
    // static private System.Void .cctor()
    // Offset: 0x16665F0
    static void _cctor();
    // public override System.Boolean Equals(System.Object value)
    // Offset: 0x16631A0
    // Implemented from: System.Object
    // Base method: System.Boolean Object::Equals(System.Object value)
    bool Equals(::Il2CppObject* value);
    // public override System.Int32 GetHashCode()
    // Offset: 0x1663278
    // Implemented from: System.Object
    // Base method: System.Int32 Object::GetHashCode()
    int GetHashCode();
    // public override System.String ToString()
    // Offset: 0x1663284
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::Il2CppString* ToString();
    // private System.Void .ctor()
    // Offset: 0x166401C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CultureInfo* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Globalization::CultureInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CultureInfo*, creationType>()));
    }
  }; // System.Globalization.CultureInfo
  #pragma pack(pop)
  static check_size<sizeof(CultureInfo), 200 + sizeof(bool)> __System_Globalization_CultureInfoSizeCheck;
  static_assert(sizeof(CultureInfo) == 0xC9);
}
DEFINE_IL2CPP_ARG_TYPE(System::Globalization::CultureInfo*, "System.Globalization", "CultureInfo");
