// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.IFormatProvider
#include "System/IFormatProvider.hpp"
// Including type: System.Globalization.DateTimeFormatFlags
#include "System/Globalization/DateTimeFormatFlags.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Globalization.DateTimeStyles
#include "System/Globalization/DateTimeStyles.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureData
  class CultureData;
  // Forward declaring type: CompareInfo
  class CompareInfo;
  // Forward declaring type: CultureInfo
  class CultureInfo;
  // Forward declaring type: Calendar
  class Calendar;
  // Forward declaring type: TokenHashValue
  class TokenHashValue;
  // Forward declaring type: MonthNameStyles
  struct MonthNameStyles;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: DayOfWeek
  struct DayOfWeek;
  // Forward declaring type: __DTString
  struct __DTString;
  // Forward declaring type: TokenType
  struct TokenType;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Completed forward declares
// Type namespace: System.Globalization
namespace System::Globalization {
  // Autogenerated type: System.Globalization.DateTimeFormatInfo
  class DateTimeFormatInfo : public ::CsObject, public System::ICloneable, public System::IFormatProvider {
    public:
    // Get static field: static private System.Globalization.DateTimeFormatInfo invariantInfo
    static System::Globalization::DateTimeFormatInfo* _get_invariantInfo();
    // Set static field: static private System.Globalization.DateTimeFormatInfo invariantInfo
    static void _set_invariantInfo(System::Globalization::DateTimeFormatInfo* value);
    // private System.Globalization.CultureData m_cultureData
    // Offset: 0x10
    System::Globalization::CultureData* m_cultureData;
    // System.String m_name
    // Offset: 0x18
    ::CsString* m_name;
    // private System.String m_langName
    // Offset: 0x20
    ::CsString* m_langName;
    // private System.Globalization.CompareInfo m_compareInfo
    // Offset: 0x28
    System::Globalization::CompareInfo* m_compareInfo;
    // private System.Globalization.CultureInfo m_cultureInfo
    // Offset: 0x30
    System::Globalization::CultureInfo* m_cultureInfo;
    // System.String amDesignator
    // Offset: 0x38
    ::CsString* amDesignator;
    // System.String pmDesignator
    // Offset: 0x40
    ::CsString* pmDesignator;
    // System.String dateSeparator
    // Offset: 0x48
    ::CsString* dateSeparator;
    // System.String generalShortTimePattern
    // Offset: 0x50
    ::CsString* generalShortTimePattern;
    // System.String generalLongTimePattern
    // Offset: 0x58
    ::CsString* generalLongTimePattern;
    // System.String timeSeparator
    // Offset: 0x60
    ::CsString* timeSeparator;
    // System.String monthDayPattern
    // Offset: 0x68
    ::CsString* monthDayPattern;
    // System.String dateTimeOffsetPattern
    // Offset: 0x70
    ::CsString* dateTimeOffsetPattern;
    // static field const value: static System.String rfc1123Pattern
    static constexpr const char* rfc1123Pattern = "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'";
    // Get static field: static System.String rfc1123Pattern
    static ::CsString* _get_rfc1123Pattern();
    // Set static field: static System.String rfc1123Pattern
    static void _set_rfc1123Pattern(::CsString* value);
    // static field const value: static System.String sortableDateTimePattern
    static constexpr const char* sortableDateTimePattern = "yyyy'-'MM'-'dd'T'HH':'mm':'ss";
    // Get static field: static System.String sortableDateTimePattern
    static ::CsString* _get_sortableDateTimePattern();
    // Set static field: static System.String sortableDateTimePattern
    static void _set_sortableDateTimePattern(::CsString* value);
    // static field const value: static System.String universalSortableDateTimePattern
    static constexpr const char* universalSortableDateTimePattern = "yyyy'-'MM'-'dd HH':'mm':'ss'Z'";
    // Get static field: static System.String universalSortableDateTimePattern
    static ::CsString* _get_universalSortableDateTimePattern();
    // Set static field: static System.String universalSortableDateTimePattern
    static void _set_universalSortableDateTimePattern(::CsString* value);
    // System.Globalization.Calendar calendar
    // Offset: 0x78
    System::Globalization::Calendar* calendar;
    // System.Int32 firstDayOfWeek
    // Offset: 0x80
    int firstDayOfWeek;
    // System.Int32 calendarWeekRule
    // Offset: 0x84
    int calendarWeekRule;
    // System.String fullDateTimePattern
    // Offset: 0x88
    ::CsString* fullDateTimePattern;
    // System.String[] abbreviatedDayNames
    // Offset: 0x90
    ::Array<::CsString*>* abbreviatedDayNames;
    // System.String[] m_superShortDayNames
    // Offset: 0x98
    ::Array<::CsString*>* m_superShortDayNames;
    // System.String[] dayNames
    // Offset: 0xA0
    ::Array<::CsString*>* dayNames;
    // System.String[] abbreviatedMonthNames
    // Offset: 0xA8
    ::Array<::CsString*>* abbreviatedMonthNames;
    // System.String[] monthNames
    // Offset: 0xB0
    ::Array<::CsString*>* monthNames;
    // System.String[] genitiveMonthNames
    // Offset: 0xB8
    ::Array<::CsString*>* genitiveMonthNames;
    // System.String[] m_genitiveAbbreviatedMonthNames
    // Offset: 0xC0
    ::Array<::CsString*>* m_genitiveAbbreviatedMonthNames;
    // System.String[] leapYearMonthNames
    // Offset: 0xC8
    ::Array<::CsString*>* leapYearMonthNames;
    // System.String longDatePattern
    // Offset: 0xD0
    ::CsString* longDatePattern;
    // System.String shortDatePattern
    // Offset: 0xD8
    ::CsString* shortDatePattern;
    // System.String yearMonthPattern
    // Offset: 0xE0
    ::CsString* yearMonthPattern;
    // System.String longTimePattern
    // Offset: 0xE8
    ::CsString* longTimePattern;
    // System.String shortTimePattern
    // Offset: 0xF0
    ::CsString* shortTimePattern;
    // private System.String[] allYearMonthPatterns
    // Offset: 0xF8
    ::Array<::CsString*>* allYearMonthPatterns;
    // System.String[] allShortDatePatterns
    // Offset: 0x100
    ::Array<::CsString*>* allShortDatePatterns;
    // System.String[] allLongDatePatterns
    // Offset: 0x108
    ::Array<::CsString*>* allLongDatePatterns;
    // System.String[] allShortTimePatterns
    // Offset: 0x110
    ::Array<::CsString*>* allShortTimePatterns;
    // System.String[] allLongTimePatterns
    // Offset: 0x118
    ::Array<::CsString*>* allLongTimePatterns;
    // System.String[] m_eraNames
    // Offset: 0x120
    ::Array<::CsString*>* m_eraNames;
    // System.String[] m_abbrevEraNames
    // Offset: 0x128
    ::Array<::CsString*>* m_abbrevEraNames;
    // System.String[] m_abbrevEnglishEraNames
    // Offset: 0x130
    ::Array<::CsString*>* m_abbrevEnglishEraNames;
    // System.Int32[] optionalCalendars
    // Offset: 0x138
    ::Array<int>* optionalCalendars;
    // static field const value: static private System.Int32 DEFAULT_ALL_DATETIMES_SIZE
    static constexpr const int DEFAULT_ALL_DATETIMES_SIZE = 132;
    // Get static field: static private System.Int32 DEFAULT_ALL_DATETIMES_SIZE
    static int _get_DEFAULT_ALL_DATETIMES_SIZE();
    // Set static field: static private System.Int32 DEFAULT_ALL_DATETIMES_SIZE
    static void _set_DEFAULT_ALL_DATETIMES_SIZE(int value);
    // System.Boolean m_isReadOnly
    // Offset: 0x140
    bool m_isReadOnly;
    // System.Globalization.DateTimeFormatFlags formatFlags
    // Offset: 0x144
    System::Globalization::DateTimeFormatFlags formatFlags;
    // Get static field: static System.Boolean preferExistingTokens
    static bool _get_preferExistingTokens();
    // Set static field: static System.Boolean preferExistingTokens
    static void _set_preferExistingTokens(bool value);
    // private System.Int32 CultureID
    // Offset: 0x148
    int CultureID;
    // private System.Boolean m_useUserOverride
    // Offset: 0x14C
    bool m_useUserOverride;
    // private System.Boolean bUseCalendarInfo
    // Offset: 0x14D
    bool bUseCalendarInfo;
    // private System.Int32 nDataItem
    // Offset: 0x150
    int nDataItem;
    // System.Boolean m_isDefaultCalendar
    // Offset: 0x154
    bool m_isDefaultCalendar;
    // Get static field: static private System.Collections.Hashtable s_calendarNativeNames
    static System::Collections::Hashtable* _get_s_calendarNativeNames();
    // Set static field: static private System.Collections.Hashtable s_calendarNativeNames
    static void _set_s_calendarNativeNames(System::Collections::Hashtable* value);
    // System.String[] m_dateWords
    // Offset: 0x158
    ::Array<::CsString*>* m_dateWords;
    // private System.String m_fullTimeSpanPositivePattern
    // Offset: 0x160
    ::CsString* m_fullTimeSpanPositivePattern;
    // private System.String m_fullTimeSpanNegativePattern
    // Offset: 0x168
    ::CsString* m_fullTimeSpanNegativePattern;
    // static field const value: static System.Globalization.DateTimeStyles InvalidDateTimeStyles
    static constexpr const int InvalidDateTimeStyles = -256;
    // Get static field: static System.Globalization.DateTimeStyles InvalidDateTimeStyles
    static System::Globalization::DateTimeStyles _get_InvalidDateTimeStyles();
    // Set static field: static System.Globalization.DateTimeStyles InvalidDateTimeStyles
    static void _set_InvalidDateTimeStyles(System::Globalization::DateTimeStyles value);
    // private System.Globalization.TokenHashValue[] m_dtfiTokenHash
    // Offset: 0x170
    ::Array<System::Globalization::TokenHashValue*>* m_dtfiTokenHash;
    // static field const value: static private System.Int32 TOKEN_HASH_SIZE
    static constexpr const int TOKEN_HASH_SIZE = 199;
    // Get static field: static private System.Int32 TOKEN_HASH_SIZE
    static int _get_TOKEN_HASH_SIZE();
    // Set static field: static private System.Int32 TOKEN_HASH_SIZE
    static void _set_TOKEN_HASH_SIZE(int value);
    // static field const value: static private System.Int32 SECOND_PRIME
    static constexpr const int SECOND_PRIME = 197;
    // Get static field: static private System.Int32 SECOND_PRIME
    static int _get_SECOND_PRIME();
    // Set static field: static private System.Int32 SECOND_PRIME
    static void _set_SECOND_PRIME(int value);
    // static field const value: static private System.String dateSeparatorOrTimeZoneOffset
    static constexpr const char* dateSeparatorOrTimeZoneOffset = "-";
