// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.IFormatProvider
#include "System/IFormatProvider.hpp"
// Including type: System.Globalization.DateTimeFormatFlags
#include "System/Globalization/DateTimeFormatFlags.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Globalization.DateTimeStyles
#include "System/Globalization/DateTimeStyles.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureData
  class CultureData;
  // Forward declaring type: CompareInfo
  class CompareInfo;
  // Forward declaring type: CultureInfo
  class CultureInfo;
  // Forward declaring type: Calendar
  class Calendar;
  // Forward declaring type: TokenHashValue
  class TokenHashValue;
  // Forward declaring type: MonthNameStyles
  struct MonthNameStyles;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: DayOfWeek
  struct DayOfWeek;
  // Forward declaring type: __DTString
  struct __DTString;
  // Forward declaring type: TokenType
  struct TokenType;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Completed forward declares
// Type namespace: System.Globalization
namespace System::Globalization {
  // Autogenerated type: System.Globalization.DateTimeFormatInfo
  class DateTimeFormatInfo : public ::Il2CppObject, public System::ICloneable, public System::IFormatProvider {
    public:
    // private System.Globalization.CultureData m_cultureData
    // Offset: 0x10
    System::Globalization::CultureData* m_cultureData;
    // System.String m_name
    // Offset: 0x18
    ::Il2CppString* m_name;
    // private System.String m_langName
    // Offset: 0x20
    ::Il2CppString* m_langName;
    // private System.Globalization.CompareInfo m_compareInfo
    // Offset: 0x28
    System::Globalization::CompareInfo* m_compareInfo;
    // private System.Globalization.CultureInfo m_cultureInfo
    // Offset: 0x30
    System::Globalization::CultureInfo* m_cultureInfo;
    // System.String amDesignator
    // Offset: 0x38
    ::Il2CppString* amDesignator;
    // System.String pmDesignator
    // Offset: 0x40
    ::Il2CppString* pmDesignator;
    // System.String dateSeparator
    // Offset: 0x48
    ::Il2CppString* dateSeparator;
    // System.String generalShortTimePattern
    // Offset: 0x50
    ::Il2CppString* generalShortTimePattern;
    // System.String generalLongTimePattern
    // Offset: 0x58
    ::Il2CppString* generalLongTimePattern;
    // System.String timeSeparator
    // Offset: 0x60
    ::Il2CppString* timeSeparator;
    // System.String monthDayPattern
    // Offset: 0x68
    ::Il2CppString* monthDayPattern;
    // System.String dateTimeOffsetPattern
    // Offset: 0x70
    ::Il2CppString* dateTimeOffsetPattern;
    // System.Globalization.Calendar calendar
    // Offset: 0x78
    System::Globalization::Calendar* calendar;
    // System.Int32 firstDayOfWeek
    // Offset: 0x80
    int firstDayOfWeek;
    // System.Int32 calendarWeekRule
    // Offset: 0x84
    int calendarWeekRule;
    // System.String fullDateTimePattern
    // Offset: 0x88
    ::Il2CppString* fullDateTimePattern;
    // System.String[] abbreviatedDayNames
    // Offset: 0x90
    ::Array<::Il2CppString*>* abbreviatedDayNames;
    // System.String[] m_superShortDayNames
    // Offset: 0x98
    ::Array<::Il2CppString*>* m_superShortDayNames;
    // System.String[] dayNames
    // Offset: 0xA0
    ::Array<::Il2CppString*>* dayNames;
    // System.String[] abbreviatedMonthNames
    // Offset: 0xA8
    ::Array<::Il2CppString*>* abbreviatedMonthNames;
    // System.String[] monthNames
    // Offset: 0xB0
    ::Array<::Il2CppString*>* monthNames;
    // System.String[] genitiveMonthNames
    // Offset: 0xB8
    ::Array<::Il2CppString*>* genitiveMonthNames;
    // System.String[] m_genitiveAbbreviatedMonthNames
    // Offset: 0xC0
    ::Array<::Il2CppString*>* m_genitiveAbbreviatedMonthNames;
    // System.String[] leapYearMonthNames
    // Offset: 0xC8
    ::Array<::Il2CppString*>* leapYearMonthNames;
    // System.String longDatePattern
    // Offset: 0xD0
    ::Il2CppString* longDatePattern;
    // System.String shortDatePattern
    // Offset: 0xD8
    ::Il2CppString* shortDatePattern;
    // System.String yearMonthPattern
    // Offset: 0xE0
    ::Il2CppString* yearMonthPattern;
    // System.String longTimePattern
    // Offset: 0xE8
    ::Il2CppString* longTimePattern;
    // System.String shortTimePattern
    // Offset: 0xF0
    ::Il2CppString* shortTimePattern;
    // private System.String[] allYearMonthPatterns
    // Offset: 0xF8
    ::Array<::Il2CppString*>* allYearMonthPatterns;
    // System.String[] allShortDatePatterns
    // Offset: 0x100
    ::Array<::Il2CppString*>* allShortDatePatterns;
    // System.String[] allLongDatePatterns
    // Offset: 0x108
    ::Array<::Il2CppString*>* allLongDatePatterns;
    // System.String[] allShortTimePatterns
    // Offset: 0x110
    ::Array<::Il2CppString*>* allShortTimePatterns;
    // System.String[] allLongTimePatterns
    // Offset: 0x118
    ::Array<::Il2CppString*>* allLongTimePatterns;
    // System.String[] m_eraNames
    // Offset: 0x120
    ::Array<::Il2CppString*>* m_eraNames;
    // System.String[] m_abbrevEraNames
    // Offset: 0x128
    ::Array<::Il2CppString*>* m_abbrevEraNames;
    // System.String[] m_abbrevEnglishEraNames
    // Offset: 0x130
    ::Array<::Il2CppString*>* m_abbrevEnglishEraNames;
    // System.Int32[] optionalCalendars
    // Offset: 0x138
    ::Array<int>* optionalCalendars;
    // System.Boolean m_isReadOnly
    // Offset: 0x140
    bool m_isReadOnly;
    // System.Globalization.DateTimeFormatFlags formatFlags
    // Offset: 0x144
    System::Globalization::DateTimeFormatFlags formatFlags;
    // private System.Int32 CultureID
    // Offset: 0x148
    int CultureID;
    // private System.Boolean m_useUserOverride
    // Offset: 0x14C
    bool m_useUserOverride;
    // private System.Boolean bUseCalendarInfo
    // Offset: 0x14D
    bool bUseCalendarInfo;
    // private System.Int32 nDataItem
    // Offset: 0x150
    int nDataItem;
    // System.Boolean m_isDefaultCalendar
    // Offset: 0x154
    bool m_isDefaultCalendar;
    // System.String[] m_dateWords
    // Offset: 0x158
    ::Array<::Il2CppString*>* m_dateWords;
    // private System.String m_fullTimeSpanPositivePattern
    // Offset: 0x160
    ::Il2CppString* m_fullTimeSpanPositivePattern;
    // private System.String m_fullTimeSpanNegativePattern
    // Offset: 0x168
    ::Il2CppString* m_fullTimeSpanNegativePattern;
    // private System.Globalization.TokenHashValue[] m_dtfiTokenHash
    // Offset: 0x170
    ::Array<System::Globalization::TokenHashValue*>* m_dtfiTokenHash;
    // Get static field: static private System.Globalization.DateTimeFormatInfo invariantInfo
    static System::Globalization::DateTimeFormatInfo* _get_invariantInfo();
    // Set static field: static private System.Globalization.DateTimeFormatInfo invariantInfo
    static void _set_invariantInfo(System::Globalization::DateTimeFormatInfo* value);
    // static field const value: static System.String rfc1123Pattern
    static constexpr const char* rfc1123Pattern = "ddd, dd MMM yyyy HH':'mm':'ss 'GMT'";
    // Get static field: static System.String rfc1123Pattern
    static ::Il2CppString* _get_rfc1123Pattern();
    // Set static field: static System.String rfc1123Pattern
    static void _set_rfc1123Pattern(::Il2CppString* value);
    // static field const value: static System.String sortableDateTimePattern
