// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.IFormatProvider
#include "System/IFormatProvider.hpp"
// Including type: System.Globalization.DateTimeFormatFlags
#include "System/Globalization/DateTimeFormatFlags.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Globalization.DateTimeStyles
#include "System/Globalization/DateTimeStyles.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureData
  class CultureData;
  // Forward declaring type: CompareInfo
  class CompareInfo;
  // Forward declaring type: CultureInfo
  class CultureInfo;
  // Forward declaring type: Calendar
  class Calendar;
  // Forward declaring type: TokenHashValue
  class TokenHashValue;
  // Forward declaring type: MonthNameStyles
  struct MonthNameStyles;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: DayOfWeek
  struct DayOfWeek;
  // Forward declaring type: __DTString
  struct __DTString;
  // Forward declaring type: TokenType
  struct TokenType;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Completed forward declares
// Type namespace: System.Globalization
namespace System::Globalization {
  // Forward declaring type: DateTimeFormatInfo
  class DateTimeFormatInfo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Globalization::DateTimeFormatInfo);
DEFINE_IL2CPP_ARG_TYPE(::System::Globalization::DateTimeFormatInfo*, "System.Globalization", "DateTimeFormatInfo");
// Type namespace: System.Globalization
namespace System::Globalization {
  // Size: 0x178
  #pragma pack(push, 1)
  // Autogenerated type: System.Globalization.DateTimeFormatInfo
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: 1030F80
  class DateTimeFormatInfo : public ::Il2CppObject/*, public ::System::ICloneable, public ::System::IFormatProvider*/ {
    public:
    public:
    // private System.Globalization.CultureData m_cultureData
    // Size: 0x8
    // Offset: 0x10
    ::System::Globalization::CultureData* m_cultureData;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureData*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035C78
    // System.String m_name
    // Size: 0x8
    // Offset: 0x18
    ::StringW m_name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_langName
    // Size: 0x8
    // Offset: 0x20
    ::StringW m_langName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Globalization.CompareInfo m_compareInfo
    // Size: 0x8
    // Offset: 0x28
    ::System::Globalization::CompareInfo* m_compareInfo;
    // Field size check
    static_assert(sizeof(::System::Globalization::CompareInfo*) == 0x8);
    // private System.Globalization.CultureInfo m_cultureInfo
    // Size: 0x8
    // Offset: 0x30
    ::System::Globalization::CultureInfo* m_cultureInfo;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureInfo*) == 0x8);
    // System.String amDesignator
    // Size: 0x8
    // Offset: 0x38
    ::StringW amDesignator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String pmDesignator
    // Size: 0x8
    // Offset: 0x40
    ::StringW pmDesignator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035CB0
    // System.String dateSeparator
    // Size: 0x8
    // Offset: 0x48
    ::StringW dateSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035CE8
    // System.String generalShortTimePattern
    // Size: 0x8
    // Offset: 0x50
    ::StringW generalShortTimePattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035D20
    // System.String generalLongTimePattern
    // Size: 0x8
    // Offset: 0x58
    ::StringW generalLongTimePattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035D58
    // System.String timeSeparator
    // Size: 0x8
    // Offset: 0x60
    ::StringW timeSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String monthDayPattern
    // Size: 0x8
    // Offset: 0x68
    ::StringW monthDayPattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035D90
    // System.String dateTimeOffsetPattern
    // Size: 0x8
    // Offset: 0x70
    ::StringW dateTimeOffsetPattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Globalization.Calendar calendar
    // Size: 0x8
    // Offset: 0x78
    ::System::Globalization::Calendar* calendar;
    // Field size check
    static_assert(sizeof(::System::Globalization::Calendar*) == 0x8);
    // System.Int32 firstDayOfWeek
    // Size: 0x4
    // Offset: 0x80
    int firstDayOfWeek;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 calendarWeekRule
    // Size: 0x4
    // Offset: 0x84
    int calendarWeekRule;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [OptionalFieldAttribute] Offset: 0x1035DC8
    // System.String fullDateTimePattern
    // Size: 0x8
    // Offset: 0x88
    ::StringW fullDateTimePattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String[] abbreviatedDayNames
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::StringW> abbreviatedDayNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035E00
    // System.String[] m_superShortDayNames
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::StringW> m_superShortDayNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] dayNames
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::StringW> dayNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] abbreviatedMonthNames
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::StringW> abbreviatedMonthNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] monthNames
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<::StringW> monthNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035E38
    // System.String[] genitiveMonthNames
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<::StringW> genitiveMonthNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035E70
    // System.String[] m_genitiveAbbreviatedMonthNames
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::StringW> m_genitiveAbbreviatedMonthNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035EA8
    // System.String[] leapYearMonthNames
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<::StringW> leapYearMonthNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String longDatePattern
    // Size: 0x8
    // Offset: 0xD0
    ::StringW longDatePattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String shortDatePattern
    // Size: 0x8
    // Offset: 0xD8
    ::StringW shortDatePattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String yearMonthPattern
    // Size: 0x8
    // Offset: 0xE0
    ::StringW yearMonthPattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String longTimePattern
    // Size: 0x8
    // Offset: 0xE8
    ::StringW longTimePattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String shortTimePattern
    // Size: 0x8
    // Offset: 0xF0
    ::StringW shortTimePattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1035EE0
    // private System.String[] allYearMonthPatterns
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::StringW> allYearMonthPatterns;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] allShortDatePatterns
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::StringW> allShortDatePatterns;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] allLongDatePatterns
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::StringW> allLongDatePatterns;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] allShortTimePatterns
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::StringW> allShortTimePatterns;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] allLongTimePatterns
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<::StringW> allLongTimePatterns;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] m_eraNames
    // Size: 0x8
    // Offset: 0x120
    ::ArrayW<::StringW> m_eraNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] m_abbrevEraNames
    // Size: 0x8
    // Offset: 0x128
    ::ArrayW<::StringW> m_abbrevEraNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] m_abbrevEnglishEraNames
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<::StringW> m_abbrevEnglishEraNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.Int32[] optionalCalendars
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<int> optionalCalendars;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // System.Boolean m_isReadOnly
    // Size: 0x1
    // Offset: 0x140
    bool m_isReadOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isReadOnly and: formatFlags
    char __padding39[0x3] = {};
    // [OptionalFieldAttribute] Offset: 0x1035F18
    // System.Globalization.DateTimeFormatFlags formatFlags
    // Size: 0x4
    // Offset: 0x144
    ::System::Globalization::DateTimeFormatFlags formatFlags;
    // Field size check
    static_assert(sizeof(::System::Globalization::DateTimeFormatFlags) == 0x4);
    // [OptionalFieldAttribute] Offset: 0x1035F50
    // private System.Int32 CultureID
    // Size: 0x4
    // Offset: 0x148
    int CultureID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [OptionalFieldAttribute] Offset: 0x1035F88
    // private System.Boolean m_useUserOverride
    // Size: 0x1
    // Offset: 0x14C
    bool m_useUserOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [OptionalFieldAttribute] Offset: 0x1035FC0
    // private System.Boolean bUseCalendarInfo
    // Size: 0x1
    // Offset: 0x14D
    bool bUseCalendarInfo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bUseCalendarInfo and: nDataItem
    char __padding43[0x2] = {};
    // [OptionalFieldAttribute] Offset: 0x1035FF8
    // private System.Int32 nDataItem
    // Size: 0x4
    // Offset: 0x150
    int nDataItem;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [OptionalFieldAttribute] Offset: 0x1036030
    // System.Boolean m_isDefaultCalendar
    // Size: 0x1
    // Offset: 0x154
    bool m_isDefaultCalendar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isDefaultCalendar and: m_dateWords
    char __padding45[0x3] = {};
    // [OptionalFieldAttribute] Offset: 0x10360A0
    // System.String[] m_dateWords
    // Size: 0x8
    // Offset: 0x158
    ::ArrayW<::StringW> m_dateWords;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String m_fullTimeSpanPositivePattern
    // Size: 0x8
    // Offset: 0x160
    ::StringW m_fullTimeSpanPositivePattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_fullTimeSpanNegativePattern
    // Size: 0x8
    // Offset: 0x168
    ::StringW m_fullTimeSpanNegativePattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Globalization.TokenHashValue[] m_dtfiTokenHash
    // Size: 0x8
    // Offset: 0x170
    ::ArrayW<::System::Globalization::TokenHashValue*> m_dtfiTokenHash;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Globalization::TokenHashValue*>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::ICloneable
    operator ::System::ICloneable() noexcept {
      return *reinterpret_cast<::System::ICloneable*>(this);
    }
    // Creating interface conversion operator: operator ::System::IFormatProvider
    operator ::System::IFormatProvider() noexcept {
      return *reinterpret_cast<::System::IFormatProvider*>(this);
    }
    // Get static field: static private System.Globalization.DateTimeFormatInfo invariantInfo
    static ::System::Globalization::DateTimeFormatInfo* _get_invariantInfo();
    // Set static field: static private System.Globalization.DateTimeFormatInfo invariantInfo
    static void _set_invariantInfo(::System::Globalization::DateTimeFormatInfo* value);
