// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.IFormatProvider
#include "System/IFormatProvider.hpp"
// Including type: System.Globalization.DateTimeFormatFlags
#include "System/Globalization/DateTimeFormatFlags.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Globalization.DateTimeStyles
#include "System/Globalization/DateTimeStyles.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureData
  class CultureData;
  // Forward declaring type: CompareInfo
  class CompareInfo;
  // Forward declaring type: CultureInfo
  class CultureInfo;
  // Forward declaring type: Calendar
  class Calendar;
  // Forward declaring type: TokenHashValue
  class TokenHashValue;
  // Forward declaring type: MonthNameStyles
  struct MonthNameStyles;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: DayOfWeek
  struct DayOfWeek;
  // Forward declaring type: __DTString
  struct __DTString;
  // Forward declaring type: TokenType
  struct TokenType;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Completed forward declares
// Type namespace: System.Globalization
namespace System::Globalization {
  // Size: 0x178
  #pragma pack(push, 1)
  // Autogenerated type: System.Globalization.DateTimeFormatInfo
  // [ComVisibleAttribute] Offset: C95864
  class DateTimeFormatInfo : public ::Il2CppObject/*, public System::ICloneable, public System::IFormatProvider*/ {
    public:
    // private System.Globalization.CultureData m_cultureData
    // Size: 0x8
    // Offset: 0x10
    System::Globalization::CultureData* m_cultureData;
    // Field size check
    static_assert(sizeof(System::Globalization::CultureData*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A220
    // System.String m_name
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* m_name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String m_langName
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* m_langName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Globalization.CompareInfo m_compareInfo
    // Size: 0x8
    // Offset: 0x28
    System::Globalization::CompareInfo* m_compareInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::CompareInfo*) == 0x8);
    // private System.Globalization.CultureInfo m_cultureInfo
    // Size: 0x8
    // Offset: 0x30
    System::Globalization::CultureInfo* m_cultureInfo;
    // Field size check
    static_assert(sizeof(System::Globalization::CultureInfo*) == 0x8);
    // System.String amDesignator
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* amDesignator;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.String pmDesignator
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* pmDesignator;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A258
    // System.String dateSeparator
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* dateSeparator;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A290
    // System.String generalShortTimePattern
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppString* generalShortTimePattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A2C8
    // System.String generalLongTimePattern
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppString* generalLongTimePattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A300
    // System.String timeSeparator
    // Size: 0x8
    // Offset: 0x60
    ::Il2CppString* timeSeparator;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.String monthDayPattern
    // Size: 0x8
    // Offset: 0x68
    ::Il2CppString* monthDayPattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A338
    // System.String dateTimeOffsetPattern
    // Size: 0x8
    // Offset: 0x70
    ::Il2CppString* dateTimeOffsetPattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.Globalization.Calendar calendar
    // Size: 0x8
    // Offset: 0x78
    System::Globalization::Calendar* calendar;
    // Field size check
    static_assert(sizeof(System::Globalization::Calendar*) == 0x8);
    // System.Int32 firstDayOfWeek
    // Size: 0x4
    // Offset: 0x80
    int firstDayOfWeek;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 calendarWeekRule
    // Size: 0x4
    // Offset: 0x84
    int calendarWeekRule;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [OptionalFieldAttribute] Offset: 0xC9A370
    // System.String fullDateTimePattern
    // Size: 0x8
    // Offset: 0x88
    ::Il2CppString* fullDateTimePattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.String[] abbreviatedDayNames
    // Size: 0x8
    // Offset: 0x90
    ::Array<::Il2CppString*>* abbreviatedDayNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A3A8
    // System.String[] m_superShortDayNames
    // Size: 0x8
    // Offset: 0x98
    ::Array<::Il2CppString*>* m_superShortDayNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] dayNames
    // Size: 0x8
    // Offset: 0xA0
    ::Array<::Il2CppString*>* dayNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] abbreviatedMonthNames
    // Size: 0x8
    // Offset: 0xA8
    ::Array<::Il2CppString*>* abbreviatedMonthNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] monthNames
    // Size: 0x8
    // Offset: 0xB0
    ::Array<::Il2CppString*>* monthNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A3E0
    // System.String[] genitiveMonthNames
    // Size: 0x8
    // Offset: 0xB8
    ::Array<::Il2CppString*>* genitiveMonthNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A418
    // System.String[] m_genitiveAbbreviatedMonthNames
    // Size: 0x8
    // Offset: 0xC0
    ::Array<::Il2CppString*>* m_genitiveAbbreviatedMonthNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A450
    // System.String[] leapYearMonthNames
    // Size: 0x8
    // Offset: 0xC8
    ::Array<::Il2CppString*>* leapYearMonthNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String longDatePattern
    // Size: 0x8
    // Offset: 0xD0
    ::Il2CppString* longDatePattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.String shortDatePattern
    // Size: 0x8
    // Offset: 0xD8
    ::Il2CppString* shortDatePattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.String yearMonthPattern
    // Size: 0x8
    // Offset: 0xE0
    ::Il2CppString* yearMonthPattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.String longTimePattern
    // Size: 0x8
    // Offset: 0xE8
    ::Il2CppString* longTimePattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.String shortTimePattern
    // Size: 0x8
    // Offset: 0xF0
    ::Il2CppString* shortTimePattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xC9A488
    // private System.String[] allYearMonthPatterns
    // Size: 0x8
    // Offset: 0xF8
    ::Array<::Il2CppString*>* allYearMonthPatterns;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] allShortDatePatterns
    // Size: 0x8
    // Offset: 0x100
    ::Array<::Il2CppString*>* allShortDatePatterns;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] allLongDatePatterns
    // Size: 0x8
    // Offset: 0x108
    ::Array<::Il2CppString*>* allLongDatePatterns;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] allShortTimePatterns
    // Size: 0x8
    // Offset: 0x110
    ::Array<::Il2CppString*>* allShortTimePatterns;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] allLongTimePatterns
    // Size: 0x8
    // Offset: 0x118
    ::Array<::Il2CppString*>* allLongTimePatterns;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] m_eraNames
    // Size: 0x8
    // Offset: 0x120
    ::Array<::Il2CppString*>* m_eraNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] m_abbrevEraNames
    // Size: 0x8
    // Offset: 0x128
    ::Array<::Il2CppString*>* m_abbrevEraNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.String[] m_abbrevEnglishEraNames
    // Size: 0x8
    // Offset: 0x130
    ::Array<::Il2CppString*>* m_abbrevEnglishEraNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.Int32[] optionalCalendars
    // Size: 0x8
    // Offset: 0x138
    ::Array<int>* optionalCalendars;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // System.Boolean m_isReadOnly
    // Size: 0x1
    // Offset: 0x140
    bool m_isReadOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isReadOnly and: formatFlags
    char __padding39[0x3] = {};
    // [OptionalFieldAttribute] Offset: 0xC9A4C0
    // System.Globalization.DateTimeFormatFlags formatFlags
    // Size: 0x4
    // Offset: 0x144
    System::Globalization::DateTimeFormatFlags formatFlags;
    // Field size check
    static_assert(sizeof(System::Globalization::DateTimeFormatFlags) == 0x4);
    // [OptionalFieldAttribute] Offset: 0xC9A4F8
    // private System.Int32 CultureID
    // Size: 0x4
    // Offset: 0x148
    int CultureID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [OptionalFieldAttribute] Offset: 0xC9A530
    // private System.Boolean m_useUserOverride
    // Size: 0x1
    // Offset: 0x14C
    bool m_useUserOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [OptionalFieldAttribute] Offset: 0xC9A568
    // private System.Boolean bUseCalendarInfo
    // Size: 0x1
    // Offset: 0x14D
    bool bUseCalendarInfo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bUseCalendarInfo and: nDataItem
    char __padding43[0x2] = {};
    // [OptionalFieldAttribute] Offset: 0xC9A5A0
    // private System.Int32 nDataItem
    // Size: 0x4
    // Offset: 0x150
    int nDataItem;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [OptionalFieldAttribute] Offset: 0xC9A5D8
    // System.Boolean m_isDefaultCalendar
    // Size: 0x1
    // Offset: 0x154
    bool m_isDefaultCalendar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isDefaultCalendar and: m_dateWords
    char __padding45[0x3] = {};
    // [OptionalFieldAttribute] Offset: 0xC9A648
    // System.String[] m_dateWords
    // Size: 0x8
    // Offset: 0x158
    ::Array<::Il2CppString*>* m_dateWords;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // private System.String m_fullTimeSpanPositivePattern
    // Size: 0x8
    // Offset: 0x160
    ::Il2CppString* m_fullTimeSpanPositivePattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String m_fullTimeSpanNegativePattern
    // Size: 0x8
    // Offset: 0x168
    ::Il2CppString* m_fullTimeSpanNegativePattern;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Globalization.TokenHashValue[] m_dtfiTokenHash
    // Size: 0x8
    // Offset: 0x170
    ::Array<System::Globalization::TokenHashValue*>* m_dtfiTokenHash;
    // Field size check
    static_assert(sizeof(::Array<System::Globalization::TokenHashValue*>*) == 0x8);
    // Creating value type constructor for type: DateTimeFormatInfo
