// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.IFormatProvider
#include "System/IFormatProvider.hpp"
// Including type: System.Globalization.NumberStyles
#include "System/Globalization/NumberStyles.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureData
  class CultureData;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: System.Globalization
namespace System::Globalization {
  // Forward declaring type: NumberFormatInfo
  class NumberFormatInfo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Globalization::NumberFormatInfo);
DEFINE_IL2CPP_ARG_TYPE(::System::Globalization::NumberFormatInfo*, "System.Globalization", "NumberFormatInfo");
// Type namespace: System.Globalization
namespace System::Globalization {
  // Size: 0xD5
  #pragma pack(push, 1)
  // Autogenerated type: System.Globalization.NumberFormatInfo
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: 103100C
  class NumberFormatInfo : public ::Il2CppObject/*, public ::System::ICloneable, public ::System::IFormatProvider*/ {
    public:
    public:
    // System.Int32[] numberGroupSizes
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<int> numberGroupSizes;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // System.Int32[] currencyGroupSizes
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<int> currencyGroupSizes;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // System.Int32[] percentGroupSizes
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<int> percentGroupSizes;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // System.String positiveSign
    // Size: 0x8
    // Offset: 0x28
    ::StringW positiveSign;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String negativeSign
    // Size: 0x8
    // Offset: 0x30
    ::StringW negativeSign;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String numberDecimalSeparator
    // Size: 0x8
    // Offset: 0x38
    ::StringW numberDecimalSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String numberGroupSeparator
    // Size: 0x8
    // Offset: 0x40
    ::StringW numberGroupSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String currencyGroupSeparator
    // Size: 0x8
    // Offset: 0x48
    ::StringW currencyGroupSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String currencyDecimalSeparator
    // Size: 0x8
    // Offset: 0x50
    ::StringW currencyDecimalSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String currencySymbol
    // Size: 0x8
    // Offset: 0x58
    ::StringW currencySymbol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String ansiCurrencySymbol
    // Size: 0x8
    // Offset: 0x60
    ::StringW ansiCurrencySymbol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String nanSymbol
    // Size: 0x8
    // Offset: 0x68
    ::StringW nanSymbol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String positiveInfinitySymbol
    // Size: 0x8
    // Offset: 0x70
    ::StringW positiveInfinitySymbol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String negativeInfinitySymbol
    // Size: 0x8
    // Offset: 0x78
    ::StringW negativeInfinitySymbol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String percentDecimalSeparator
    // Size: 0x8
    // Offset: 0x80
    ::StringW percentDecimalSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String percentGroupSeparator
    // Size: 0x8
    // Offset: 0x88
    ::StringW percentGroupSeparator;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String percentSymbol
    // Size: 0x8
    // Offset: 0x90
    ::StringW percentSymbol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String perMilleSymbol
    // Size: 0x8
    // Offset: 0x98
    ::StringW perMilleSymbol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1036298
    // System.String[] nativeDigits
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::StringW> nativeDigits;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x10362D0
    // System.Int32 m_dataItem
    // Size: 0x4
    // Offset: 0xA8
    int m_dataItem;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 numberDecimalDigits
    // Size: 0x4
    // Offset: 0xAC
    int numberDecimalDigits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 currencyDecimalDigits
    // Size: 0x4
    // Offset: 0xB0
    int currencyDecimalDigits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 currencyPositivePattern
    // Size: 0x4
    // Offset: 0xB4
    int currencyPositivePattern;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 currencyNegativePattern
    // Size: 0x4
    // Offset: 0xB8
    int currencyNegativePattern;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 numberNegativePattern
    // Size: 0x4
    // Offset: 0xBC
    int numberNegativePattern;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 percentPositivePattern
    // Size: 0x4
    // Offset: 0xC0
    int percentPositivePattern;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 percentNegativePattern
    // Size: 0x4
    // Offset: 0xC4
    int percentNegativePattern;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 percentDecimalDigits
    // Size: 0x4
    // Offset: 0xC8
    int percentDecimalDigits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [OptionalFieldAttribute] Offset: 0x1036308
    // System.Int32 digitSubstitution
    // Size: 0x4
    // Offset: 0xCC
    int digitSubstitution;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean isReadOnly
    // Size: 0x1
    // Offset: 0xD0
    bool isReadOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [OptionalFieldAttribute] Offset: 0x1036340
    // System.Boolean m_useUserOverride
    // Size: 0x1
    // Offset: 0xD1
    bool m_useUserOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [OptionalFieldAttribute] Offset: 0x1036378
    // System.Boolean m_isInvariant
    // Size: 0x1
    // Offset: 0xD2
    bool m_isInvariant;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [OptionalFieldAttribute] Offset: 0x10363B0
    // System.Boolean validForParseAsNumber
    // Size: 0x1
    // Offset: 0xD3
    bool validForParseAsNumber;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [OptionalFieldAttribute] Offset: 0x10363E8
    // System.Boolean validForParseAsCurrency
    // Size: 0x1
    // Offset: 0xD4
    bool validForParseAsCurrency;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::ICloneable
    operator ::System::ICloneable() noexcept {
      return *reinterpret_cast<::System::ICloneable*>(this);
    }
    // Creating interface conversion operator: i_ICloneable
    inline ::System::ICloneable* i_ICloneable() noexcept {
      return reinterpret_cast<::System::ICloneable*>(this);
    }
    // Creating interface conversion operator: operator ::System::IFormatProvider
    operator ::System::IFormatProvider() noexcept {
      return *reinterpret_cast<::System::IFormatProvider*>(this);
    }
    // Creating interface conversion operator: i_IFormatProvider
    inline ::System::IFormatProvider* i_IFormatProvider() noexcept {
      return reinterpret_cast<::System::IFormatProvider*>(this);
    }
