// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ExitGames.Client.Photon.IPhotonPeerListener
#include "ExitGames/Client/Photon/IPhotonPeerListener.hpp"
// Including type: Photon.Chat.ChatState
#include "Photon/Chat/ChatState.hpp"
// Including type: Photon.Chat.ChatDisconnectCause
#include "Photon/Chat/ChatDisconnectCause.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
// Including type: ExitGames.Client.Photon.ConnectionProtocol
#include "ExitGames/Client/Photon/ConnectionProtocol.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Chat
namespace Photon::Chat {
  // Forward declaring type: AuthenticationValues
  class AuthenticationValues;
  // Forward declaring type: ChatChannel
  class ChatChannel;
  // Forward declaring type: IChatClientListener
  class IChatClientListener;
  // Forward declaring type: ChatPeer
  class ChatPeer;
  // Forward declaring type: ChatAppSettings
  class ChatAppSettings;
  // Forward declaring type: ChannelCreationOptions
  class ChannelCreationOptions;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: DebugLevel
  struct DebugLevel;
  // Forward declaring type: EventData
  class EventData;
  // Forward declaring type: OperationResponse
  class OperationResponse;
  // Forward declaring type: StatusCode
  struct StatusCode;
}
// Completed forward declares
// Type namespace: Photon.Chat
namespace Photon::Chat {
  // Forward declaring type: ChatClient
  class ChatClient;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Chat::ChatClient);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Chat::ChatClient*, "Photon.Chat", "ChatClient");
// Type namespace: Photon.Chat
namespace Photon::Chat {
  // WARNING Size may be invalid!
  // Autogenerated type: Photon.Chat.ChatClient
  // [TokenAttribute] Offset: FFFFFFFF
  class ChatClient : public ::Il2CppObject/*, public ::ExitGames::Client::Photon::IPhotonPeerListener*/ {
    public:
    public:
    // private System.Boolean <EnableProtocolFallback>k__BackingField
    // Size: 0x1
    // Offset: 0x10
    bool EnableProtocolFallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.String <NameServerAddress>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::StringW NameServerAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <FrontendAddress>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::StringW FrontendAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String chatRegion
    // Size: 0x8
    // Offset: 0x28
    ::StringW chatRegion;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Photon.Chat.ChatState <State>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    ::Photon::Chat::ChatState State;
    // Field size check
    static_assert(sizeof(::Photon::Chat::ChatState) == 0x4);
    // private Photon.Chat.ChatDisconnectCause <DisconnectedCause>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    ::Photon::Chat::ChatDisconnectCause DisconnectedCause;
    // Field size check
    static_assert(sizeof(::Photon::Chat::ChatDisconnectCause) == 0x4);
    // private System.String <AppVersion>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::StringW AppVersion;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <AppId>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::StringW AppId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Photon.Chat.AuthenticationValues <AuthValues>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::Photon::Chat::AuthenticationValues* AuthValues;
    // Field size check
    static_assert(sizeof(::Photon::Chat::AuthenticationValues*) == 0x8);
    // public System.Int32 MessageLimit
    // Size: 0x4
    // Offset: 0x50
    int MessageLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PrivateChatHistoryLength
    // Size: 0x4
    // Offset: 0x54
    int PrivateChatHistoryLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public readonly System.Collections.Generic.Dictionary`2<System.String,Photon.Chat.ChatChannel> PublicChannels
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::Dictionary_2<::StringW, ::Photon::Chat::ChatChannel*>* PublicChannels;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::Photon::Chat::ChatChannel*>*) == 0x8);
    // public readonly System.Collections.Generic.Dictionary`2<System.String,Photon.Chat.ChatChannel> PrivateChannels
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::Dictionary_2<::StringW, ::Photon::Chat::ChatChannel*>* PrivateChannels;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::Photon::Chat::ChatChannel*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<System.String> PublicChannelsUnsubscribing
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::HashSet_1<::StringW>* PublicChannelsUnsubscribing;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::StringW>*) == 0x8);
    // private readonly Photon.Chat.IChatClientListener listener
    // Size: 0x8
    // Offset: 0x70
    ::Photon::Chat::IChatClientListener* listener;
    // Field size check
    static_assert(sizeof(::Photon::Chat::IChatClientListener*) == 0x8);
    // public Photon.Chat.ChatPeer chatPeer
    // Size: 0x8
    // Offset: 0x78
    ::Photon::Chat::ChatPeer* chatPeer;
    // Field size check
    static_assert(sizeof(::Photon::Chat::ChatPeer*) == 0x8);
    // private System.Boolean didAuthenticate
    // Size: 0x1
    // Offset: 0x80
    bool didAuthenticate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Int32> statusToSetWhenConnected
    // Size: 0xFFFFFFFF
    // Offset: 0x84
    ::System::Nullable_1<int> statusToSetWhenConnected;
    // private System.Object messageToSetWhenConnected
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppObject* messageToSetWhenConnected;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Int32 msDeltaForServiceCalls
    // Size: 0x4
    // Offset: 0x98
    int msDeltaForServiceCalls;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 msTimestampOfLastServiceCall
    // Size: 0x4
    // Offset: 0x9C
    int msTimestampOfLastServiceCall;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <UseBackgroundWorkerForSending>k__BackingField
    // Size: 0x1
    // Offset: 0xA0
    bool UseBackgroundWorkerForSending;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::ExitGames::Client::Photon::IPhotonPeerListener
    operator ::ExitGames::Client::Photon::IPhotonPeerListener() noexcept {
      return *reinterpret_cast<::ExitGames::Client::Photon::IPhotonPeerListener*>(this);
    }
    // static field const value: static private System.Int32 FriendRequestListMax
    static constexpr const int FriendRequestListMax = 1024;
    // Get static field: static private System.Int32 FriendRequestListMax
    static int _get_FriendRequestListMax();
    // Set static field: static private System.Int32 FriendRequestListMax
    static void _set_FriendRequestListMax(int value);
    // static field const value: static public System.Int32 DefaultMaxSubscribers
    static constexpr const int DefaultMaxSubscribers = 100;
