// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.IDtdParser
#include "System/Xml/IDtdParser.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Including type: System.Xml.LineInfo
#include "System/Xml/LineInfo.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: IDtdParserAdapter
  class IDtdParserAdapter;
  // Forward declaring type: IDtdParserAdapterWithValidation
  class IDtdParserAdapterWithValidation;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: IDtdInfo
  class IDtdInfo;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: SchemaInfo
  class SchemaInfo;
  // Forward declaring type: SchemaAttDef
  class SchemaAttDef;
  // Forward declaring type: SchemaElementDecl
  class SchemaElementDecl;
  // Forward declaring type: ParticleContentValidator
  class ParticleContentValidator;
  // Forward declaring type: SchemaEntity
  class SchemaEntity;
  // Forward declaring type: XmlSeverityType
  struct XmlSeverityType;
  // Forward declaring type: XmlSchemaException
  class XmlSchemaException;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: DtdParser
  class DtdParser;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::DtdParser);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::DtdParser*, "System.Xml", "DtdParser");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.DtdParser
  // [TokenAttribute] Offset: FFFFFFFF
  class DtdParser : public ::Il2CppObject/*, public ::System::Xml::IDtdParser*/ {
    public:
    // Nested type: ::System::Xml::DtdParser::Token
    struct Token;
    // Nested type: ::System::Xml::DtdParser::ScanningFunction
    struct ScanningFunction;
    // Nested type: ::System::Xml::DtdParser::LiteralType
    struct LiteralType;
    // Nested type: ::System::Xml::DtdParser::UndeclaredNotation
    class UndeclaredNotation;
    // Nested type: ::System::Xml::DtdParser::ParseElementOnlyContent_LocalFrame
    class ParseElementOnlyContent_LocalFrame;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.DtdParser/System.Xml.ScanningFunction
    // [TokenAttribute] Offset: FFFFFFFF
    struct ScanningFunction/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ScanningFunction
      constexpr ScanningFunction(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction SubsetContent
      static constexpr const int SubsetContent = 0;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction SubsetContent
      static ::System::Xml::DtdParser::ScanningFunction _get_SubsetContent();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction SubsetContent
      static void _set_SubsetContent(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Name
      static constexpr const int Name = 1;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Name
      static ::System::Xml::DtdParser::ScanningFunction _get_Name();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Name
      static void _set_Name(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction QName
      static constexpr const int QName = 2;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction QName
      static ::System::Xml::DtdParser::ScanningFunction _get_QName();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction QName
      static void _set_QName(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Nmtoken
      static constexpr const int Nmtoken = 3;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Nmtoken
      static ::System::Xml::DtdParser::ScanningFunction _get_Nmtoken();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Nmtoken
      static void _set_Nmtoken(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Doctype1
      static constexpr const int Doctype1 = 4;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Doctype1
      static ::System::Xml::DtdParser::ScanningFunction _get_Doctype1();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Doctype1
      static void _set_Doctype1(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Doctype2
      static constexpr const int Doctype2 = 5;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Doctype2
      static ::System::Xml::DtdParser::ScanningFunction _get_Doctype2();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Doctype2
      static void _set_Doctype2(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element1
      static constexpr const int Element1 = 6;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element1
      static ::System::Xml::DtdParser::ScanningFunction _get_Element1();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element1
      static void _set_Element1(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element2
      static constexpr const int Element2 = 7;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element2
      static ::System::Xml::DtdParser::ScanningFunction _get_Element2();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element2
      static void _set_Element2(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element3
      static constexpr const int Element3 = 8;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element3
      static ::System::Xml::DtdParser::ScanningFunction _get_Element3();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element3
      static void _set_Element3(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element4
      static constexpr const int Element4 = 9;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element4
      static ::System::Xml::DtdParser::ScanningFunction _get_Element4();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element4
      static void _set_Element4(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element5
      static constexpr const int Element5 = 10;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element5
      static ::System::Xml::DtdParser::ScanningFunction _get_Element5();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element5
      static void _set_Element5(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element6
      static constexpr const int Element6 = 11;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element6
      static ::System::Xml::DtdParser::ScanningFunction _get_Element6();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element6
      static void _set_Element6(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element7
      static constexpr const int Element7 = 12;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element7
      static ::System::Xml::DtdParser::ScanningFunction _get_Element7();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Element7
      static void _set_Element7(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist1
      static constexpr const int Attlist1 = 13;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist1
      static ::System::Xml::DtdParser::ScanningFunction _get_Attlist1();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist1
      static void _set_Attlist1(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist2
      static constexpr const int Attlist2 = 14;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist2
      static ::System::Xml::DtdParser::ScanningFunction _get_Attlist2();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist2
      static void _set_Attlist2(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist3
      static constexpr const int Attlist3 = 15;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist3
      static ::System::Xml::DtdParser::ScanningFunction _get_Attlist3();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist3
      static void _set_Attlist3(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist4
      static constexpr const int Attlist4 = 16;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist4
      static ::System::Xml::DtdParser::ScanningFunction _get_Attlist4();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist4
      static void _set_Attlist4(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist5
      static constexpr const int Attlist5 = 17;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist5
      static ::System::Xml::DtdParser::ScanningFunction _get_Attlist5();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist5
      static void _set_Attlist5(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist6
      static constexpr const int Attlist6 = 18;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist6
      static ::System::Xml::DtdParser::ScanningFunction _get_Attlist6();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist6
      static void _set_Attlist6(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist7
      static constexpr const int Attlist7 = 19;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist7
      static ::System::Xml::DtdParser::ScanningFunction _get_Attlist7();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Attlist7
      static void _set_Attlist7(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Entity1
      static constexpr const int Entity1 = 20;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Entity1
      static ::System::Xml::DtdParser::ScanningFunction _get_Entity1();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Entity1
      static void _set_Entity1(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Entity2
      static constexpr const int Entity2 = 21;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Entity2
      static ::System::Xml::DtdParser::ScanningFunction _get_Entity2();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Entity2
      static void _set_Entity2(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Entity3
      static constexpr const int Entity3 = 22;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Entity3
      static ::System::Xml::DtdParser::ScanningFunction _get_Entity3();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Entity3
      static void _set_Entity3(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Notation1
      static constexpr const int Notation1 = 23;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Notation1
      static ::System::Xml::DtdParser::ScanningFunction _get_Notation1();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Notation1
      static void _set_Notation1(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction CondSection1
      static constexpr const int CondSection1 = 24;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction CondSection1
      static ::System::Xml::DtdParser::ScanningFunction _get_CondSection1();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction CondSection1
      static void _set_CondSection1(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction CondSection2
      static constexpr const int CondSection2 = 25;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction CondSection2
      static ::System::Xml::DtdParser::ScanningFunction _get_CondSection2();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction CondSection2
      static void _set_CondSection2(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction CondSection3
      static constexpr const int CondSection3 = 26;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction CondSection3
      static ::System::Xml::DtdParser::ScanningFunction _get_CondSection3();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction CondSection3
      static void _set_CondSection3(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction Literal
      static constexpr const int Literal = 27;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Literal
      static ::System::Xml::DtdParser::ScanningFunction _get_Literal();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction Literal
      static void _set_Literal(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction SystemId
      static constexpr const int SystemId = 28;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction SystemId
      static ::System::Xml::DtdParser::ScanningFunction _get_SystemId();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction SystemId
      static void _set_SystemId(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction PublicId1
      static constexpr const int PublicId1 = 29;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction PublicId1
      static ::System::Xml::DtdParser::ScanningFunction _get_PublicId1();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction PublicId1
      static void _set_PublicId1(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction PublicId2
      static constexpr const int PublicId2 = 30;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction PublicId2
      static ::System::Xml::DtdParser::ScanningFunction _get_PublicId2();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction PublicId2
      static void _set_PublicId2(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction ClosingTag
      static constexpr const int ClosingTag = 31;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction ClosingTag
      static ::System::Xml::DtdParser::ScanningFunction _get_ClosingTag();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction ClosingTag
      static void _set_ClosingTag(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction ParamEntitySpace
      static constexpr const int ParamEntitySpace = 32;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction ParamEntitySpace
      static ::System::Xml::DtdParser::ScanningFunction _get_ParamEntitySpace();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction ParamEntitySpace
      static void _set_ParamEntitySpace(::System::Xml::DtdParser::ScanningFunction value);
      // static field const value: static public System.Xml.DtdParser/System.Xml.ScanningFunction None
      static constexpr const int None = 33;
      // Get static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction None
      static ::System::Xml::DtdParser::ScanningFunction _get_None();
      // Set static field: static public System.Xml.DtdParser/System.Xml.ScanningFunction None
      static void _set_None(::System::Xml::DtdParser::ScanningFunction value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.DtdParser/System.Xml.ScanningFunction
    #pragma pack(pop)
    static check_size<sizeof(DtdParser::ScanningFunction), 0 + sizeof(int)> __System_Xml_DtdParser_ScanningFunctionSizeCheck;
    static_assert(sizeof(DtdParser::ScanningFunction) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.IDtdParserAdapter readerAdapter
    // Size: 0x8
    // Offset: 0x10
    ::System::Xml::IDtdParserAdapter* readerAdapter;
    // Field size check
    static_assert(sizeof(::System::Xml::IDtdParserAdapter*) == 0x8);
    // private System.Xml.IDtdParserAdapterWithValidation readerAdapterWithValidation
    // Size: 0x8
    // Offset: 0x18
    ::System::Xml::IDtdParserAdapterWithValidation* readerAdapterWithValidation;
    // Field size check
    static_assert(sizeof(::System::Xml::IDtdParserAdapterWithValidation*) == 0x8);
    // private System.Xml.XmlNameTable nameTable
    // Size: 0x8
    // Offset: 0x20
    ::System::Xml::XmlNameTable* nameTable;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.Schema.SchemaInfo schemaInfo
    // Size: 0x8
    // Offset: 0x28
    ::System::Xml::Schema::SchemaInfo* schemaInfo;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::SchemaInfo*) == 0x8);
    // private System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0x30
    ::System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlCharType) == 0x8);
    // private System.String systemId
    // Size: 0x8
    // Offset: 0x38
    ::StringW systemId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String publicId
    // Size: 0x8
    // Offset: 0x40
    ::StringW publicId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean normalize
    // Size: 0x1
    // Offset: 0x48
    bool normalize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean validate
    // Size: 0x1
    // Offset: 0x49
    bool validate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean supportNamespaces
    // Size: 0x1
    // Offset: 0x4A
    bool supportNamespaces;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean v1Compat
    // Size: 0x1
    // Offset: 0x4B
    bool v1Compat;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: v1Compat and: chars
    char __padding10[0x4] = {};
    // private System.Char[] chars
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::Il2CppChar> chars;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
    // private System.Int32 charsUsed
    // Size: 0x4
    // Offset: 0x58
    int charsUsed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 curPos
    // Size: 0x4
    // Offset: 0x5C
    int curPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.DtdParser/System.Xml.ScanningFunction scanningFunction
    // Size: 0x4
    // Offset: 0x60
    ::System::Xml::DtdParser::ScanningFunction scanningFunction;
    // Field size check
    static_assert(sizeof(::System::Xml::DtdParser::ScanningFunction) == 0x4);
    // private System.Xml.DtdParser/System.Xml.ScanningFunction nextScaningFunction
    // Size: 0x4
    // Offset: 0x64
    ::System::Xml::DtdParser::ScanningFunction nextScaningFunction;
    // Field size check
    static_assert(sizeof(::System::Xml::DtdParser::ScanningFunction) == 0x4);
    // private System.Xml.DtdParser/System.Xml.ScanningFunction savedScanningFunction
    // Size: 0x4
    // Offset: 0x68
    ::System::Xml::DtdParser::ScanningFunction savedScanningFunction;
    // Field size check
    static_assert(sizeof(::System::Xml::DtdParser::ScanningFunction) == 0x4);
    // private System.Boolean whitespaceSeen
    // Size: 0x1
    // Offset: 0x6C
    bool whitespaceSeen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: whitespaceSeen and: tokenStartPos
    char __padding17[0x3] = {};
    // private System.Int32 tokenStartPos
    // Size: 0x4
    // Offset: 0x70
    int tokenStartPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 colonPos
    // Size: 0x4
    // Offset: 0x74
    int colonPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Text.StringBuilder internalSubsetValueSb
    // Size: 0x8
    // Offset: 0x78
    ::System::Text::StringBuilder* internalSubsetValueSb;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Int32 externalEntitiesDepth
    // Size: 0x4
    // Offset: 0x80
    int externalEntitiesDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 currentEntityId
    // Size: 0x4
    // Offset: 0x84
    int currentEntityId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean freeFloatingDtd
    // Size: 0x1
    // Offset: 0x88
    bool freeFloatingDtd;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasFreeFloatingInternalSubset
    // Size: 0x1
    // Offset: 0x89
    bool hasFreeFloatingInternalSubset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasFreeFloatingInternalSubset and: stringBuilder
    char __padding24[0x6] = {};
    // private System.Text.StringBuilder stringBuilder
    // Size: 0x8
    // Offset: 0x90
    ::System::Text::StringBuilder* stringBuilder;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Int32 condSectionDepth
    // Size: 0x4
    // Offset: 0x98
    int condSectionDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.LineInfo literalLineInfo
    // Size: 0x8
    // Offset: 0x9C
    ::System::Xml::LineInfo literalLineInfo;
    // Field size check
    static_assert(sizeof(::System::Xml::LineInfo) == 0x8);
    // private System.Char literalQuoteChar
    // Size: 0x2
    // Offset: 0xA4
    ::Il2CppChar literalQuoteChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // Padding between fields: literalQuoteChar and: documentBaseUri
    char __padding28[0x2] = {};
    // private System.String documentBaseUri
    // Size: 0x8
    // Offset: 0xA8
    ::StringW documentBaseUri;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String externalDtdBaseUri
    // Size: 0x8
    // Offset: 0xB0
    ::StringW externalDtdBaseUri;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Xml.DtdParser/System.Xml.UndeclaredNotation> undeclaredNotations
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Xml::DtdParser::UndeclaredNotation*>* undeclaredNotations;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Xml::DtdParser::UndeclaredNotation*>*) == 0x8);
    // private System.Int32[] condSectionEntityIds
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<int> condSectionEntityIds;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::Xml::IDtdParser
    operator ::System::Xml::IDtdParser() noexcept {
      return *reinterpret_cast<::System::Xml::IDtdParser*>(this);
    }
    // Get instance field reference: private System.Xml.IDtdParserAdapter readerAdapter
    ::System::Xml::IDtdParserAdapter*& dyn_readerAdapter();
    // Get instance field reference: private System.Xml.IDtdParserAdapterWithValidation readerAdapterWithValidation
    ::System::Xml::IDtdParserAdapterWithValidation*& dyn_readerAdapterWithValidation();
    // Get instance field reference: private System.Xml.XmlNameTable nameTable
    ::System::Xml::XmlNameTable*& dyn_nameTable();
    // Get instance field reference: private System.Xml.Schema.SchemaInfo schemaInfo
    ::System::Xml::Schema::SchemaInfo*& dyn_schemaInfo();
