// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlNode
#include "System/Xml/XmlNode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlImplementation
  class XmlImplementation;
  // Forward declaring type: DomNameTable
  class DomNameTable;
  // Forward declaring type: XmlLinkedNode
  class XmlLinkedNode;
  // Forward declaring type: XmlNamedNodeMap
  class XmlNamedNodeMap;
  // Forward declaring type: XmlNodeChangedEventHandler
  class XmlNodeChangedEventHandler;
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: EmptyEnumerator
  class EmptyEnumerator;
  // Forward declaring type: XmlDocumentType
  class XmlDocumentType;
  // Forward declaring type: XmlDeclaration
  class XmlDeclaration;
  // Forward declaring type: XmlElement
  class XmlElement;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XmlName
  class XmlName;
  // Forward declaring type: XmlNodeType
  struct XmlNodeType;
  // Forward declaring type: XmlAttribute
  class XmlAttribute;
  // Forward declaring type: XmlCDataSection
  class XmlCDataSection;
  // Forward declaring type: XmlComment
  class XmlComment;
  // Forward declaring type: XmlDocumentFragment
  class XmlDocumentFragment;
  // Forward declaring type: XmlEntityReference
  class XmlEntityReference;
  // Forward declaring type: XmlProcessingInstruction
  class XmlProcessingInstruction;
  // Forward declaring type: XmlText
  class XmlText;
  // Forward declaring type: XmlSignificantWhitespace
  class XmlSignificantWhitespace;
  // Forward declaring type: XmlWhitespace
  class XmlWhitespace;
  // Forward declaring type: XmlTextReader
  class XmlTextReader;
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: XmlNodeChangedEventArgs
  class XmlNodeChangedEventArgs;
  // Forward declaring type: XmlEntity
  class XmlEntity;
  // Forward declaring type: XmlNodeChangedAction
  struct XmlNodeChangedAction;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: SchemaInfo
  class SchemaInfo;
  // Forward declaring type: XmlSchemaSet
  class XmlSchemaSet;
  // Forward declaring type: IXmlSchemaInfo
  class IXmlSchemaInfo;
  // Forward declaring type: SchemaElementDecl
  class SchemaElementDecl;
  // Forward declaring type: SchemaAttDef
  class SchemaAttDef;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: WeakReference
  class WeakReference;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XmlDocument
  class XmlDocument;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::XmlDocument);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::XmlDocument*, "System.Xml", "XmlDocument");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x138
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlDocument
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlDocument : public ::System::Xml::XmlNode {
    public:
    public:
    // private System.Xml.XmlImplementation implementation
    // Size: 0x8
    // Offset: 0x18
    ::System::Xml::XmlImplementation* implementation;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlImplementation*) == 0x8);
    // private System.Xml.DomNameTable domNameTable
    // Size: 0x8
    // Offset: 0x20
    ::System::Xml::DomNameTable* domNameTable;
    // Field size check
    static_assert(sizeof(::System::Xml::DomNameTable*) == 0x8);
    // private System.Xml.XmlLinkedNode lastChild
    // Size: 0x8
    // Offset: 0x28
    ::System::Xml::XmlLinkedNode* lastChild;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlLinkedNode*) == 0x8);
    // private System.Xml.XmlNamedNodeMap entities
    // Size: 0x8
    // Offset: 0x30
    ::System::Xml::XmlNamedNodeMap* entities;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNamedNodeMap*) == 0x8);
    // private System.Collections.Hashtable htElementIdMap
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Hashtable* htElementIdMap;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable htElementIDAttrDecl
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Hashtable* htElementIDAttrDecl;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Xml.Schema.SchemaInfo schemaInfo
    // Size: 0x8
    // Offset: 0x48
    ::System::Xml::Schema::SchemaInfo* schemaInfo;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::SchemaInfo*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSet schemas
    // Size: 0x8
    // Offset: 0x50
    ::System::Xml::Schema::XmlSchemaSet* schemas;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaSet*) == 0x8);
    // private System.Boolean reportValidity
    // Size: 0x1
    // Offset: 0x58
    bool reportValidity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean actualLoadingStatus
    // Size: 0x1
    // Offset: 0x59
    bool actualLoadingStatus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: actualLoadingStatus and: onNodeInsertingDelegate
    char __padding9[0x6] = {};
    // private System.Xml.XmlNodeChangedEventHandler onNodeInsertingDelegate
    // Size: 0x8
    // Offset: 0x60
    ::System::Xml::XmlNodeChangedEventHandler* onNodeInsertingDelegate;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeChangedEventHandler*) == 0x8);
    // private System.Xml.XmlNodeChangedEventHandler onNodeInsertedDelegate
    // Size: 0x8
    // Offset: 0x68
    ::System::Xml::XmlNodeChangedEventHandler* onNodeInsertedDelegate;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeChangedEventHandler*) == 0x8);
    // private System.Xml.XmlNodeChangedEventHandler onNodeRemovingDelegate
    // Size: 0x8
    // Offset: 0x70
    ::System::Xml::XmlNodeChangedEventHandler* onNodeRemovingDelegate;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeChangedEventHandler*) == 0x8);
    // private System.Xml.XmlNodeChangedEventHandler onNodeRemovedDelegate
    // Size: 0x8
    // Offset: 0x78
    ::System::Xml::XmlNodeChangedEventHandler* onNodeRemovedDelegate;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeChangedEventHandler*) == 0x8);
    // private System.Xml.XmlNodeChangedEventHandler onNodeChangingDelegate
    // Size: 0x8
    // Offset: 0x80
    ::System::Xml::XmlNodeChangedEventHandler* onNodeChangingDelegate;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeChangedEventHandler*) == 0x8);
    // private System.Xml.XmlNodeChangedEventHandler onNodeChangedDelegate
    // Size: 0x8
    // Offset: 0x88
    ::System::Xml::XmlNodeChangedEventHandler* onNodeChangedDelegate;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeChangedEventHandler*) == 0x8);
    // System.Boolean fEntRefNodesPresent
    // Size: 0x1
    // Offset: 0x90
    bool fEntRefNodesPresent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean fCDataNodesPresent
    // Size: 0x1
    // Offset: 0x91
    bool fCDataNodesPresent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean preserveWhitespace
    // Size: 0x1
    // Offset: 0x92
    bool preserveWhitespace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isLoading
    // Size: 0x1
    // Offset: 0x93
    bool isLoading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isLoading and: strDocumentName
    char __padding19[0x4] = {};
    // System.String strDocumentName
    // Size: 0x8
    // Offset: 0x98
    ::StringW strDocumentName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strDocumentFragmentName
    // Size: 0x8
    // Offset: 0xA0
    ::StringW strDocumentFragmentName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strCommentName
    // Size: 0x8
    // Offset: 0xA8
    ::StringW strCommentName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strTextName
    // Size: 0x8
    // Offset: 0xB0
    ::StringW strTextName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strCDataSectionName
    // Size: 0x8
    // Offset: 0xB8
    ::StringW strCDataSectionName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strEntityName
    // Size: 0x8
    // Offset: 0xC0
    ::StringW strEntityName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strID
    // Size: 0x8
    // Offset: 0xC8
    ::StringW strID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strXmlns
    // Size: 0x8
    // Offset: 0xD0
    ::StringW strXmlns;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strXml
    // Size: 0x8
    // Offset: 0xD8
    ::StringW strXml;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strSpace
    // Size: 0x8
    // Offset: 0xE0
    ::StringW strSpace;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strLang
    // Size: 0x8
    // Offset: 0xE8
    ::StringW strLang;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strEmpty
    // Size: 0x8
    // Offset: 0xF0
    ::StringW strEmpty;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strNonSignificantWhitespaceName
    // Size: 0x8
    // Offset: 0xF8
    ::StringW strNonSignificantWhitespaceName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strSignificantWhitespaceName
    // Size: 0x8
    // Offset: 0x100
    ::StringW strSignificantWhitespaceName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strReservedXmlns
    // Size: 0x8
    // Offset: 0x108
    ::StringW strReservedXmlns;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String strReservedXml
    // Size: 0x8
    // Offset: 0x110
    ::StringW strReservedXml;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String baseURI
    // Size: 0x8
    // Offset: 0x118
    ::StringW baseURI;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlResolver resolver
    // Size: 0x8
    // Offset: 0x120
    ::System::Xml::XmlResolver* resolver;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlResolver*) == 0x8);
    // System.Boolean bSetResolver
    // Size: 0x1
    // Offset: 0x128
    bool bSetResolver;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bSetResolver and: objLock
    char __padding38[0x7] = {};
    // System.Object objLock
    // Size: 0x8
    // Offset: 0x130
    ::Il2CppObject* objLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::Xml::XmlNode*
    constexpr operator ::System::Xml::XmlNode*() const noexcept = delete;
    // Get static field: static System.Xml.EmptyEnumerator EmptyEnumerator
    static ::System::Xml::EmptyEnumerator* _get_EmptyEnumerator();
    // Set static field: static System.Xml.EmptyEnumerator EmptyEnumerator
    static void _set_EmptyEnumerator(::System::Xml::EmptyEnumerator* value);
    // Get static field: static System.Xml.Schema.IXmlSchemaInfo NotKnownSchemaInfo
    static ::System::Xml::Schema::IXmlSchemaInfo* _get_NotKnownSchemaInfo();
    // Set static field: static System.Xml.Schema.IXmlSchemaInfo NotKnownSchemaInfo
    static void _set_NotKnownSchemaInfo(::System::Xml::Schema::IXmlSchemaInfo* value);
