// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Xml.XmlRawWriter
#include "System/Xml/XmlRawWriter.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Including type: System.Xml.NewLineHandling
#include "System/Xml/NewLineHandling.hpp"
// Including type: System.Xml.XmlStandalone
#include "System/Xml/XmlStandalone.hpp"
// Including type: System.Xml.XmlOutputMethod
#include "System/Xml/XmlOutputMethod.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: TextWriter
  class TextWriter;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
  // Forward declaring type: Encoder
  class Encoder;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: CharEntityEncoderFallback
  class CharEntityEncoderFallback;
  // Forward declaring type: XmlWriterSettings
  class XmlWriterSettings;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0xB6
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlEncodedRawTextWriter
  class XmlEncodedRawTextWriter : public System::Xml::XmlRawWriter {
    public:
    // private readonly System.Boolean useAsync
    // Size: 0x1
    // Offset: 0x20
    bool useAsync;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useAsync and: bufBytes
    char __padding0[0x7] = {};
    // protected System.Byte[] bufBytes
    // Size: 0x8
    // Offset: 0x28
    ::Array<uint8_t>* bufBytes;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // protected System.IO.Stream stream
    // Size: 0x8
    // Offset: 0x30
    System::IO::Stream* stream;
    // Field size check
    static_assert(sizeof(System::IO::Stream*) == 0x8);
    // protected System.Text.Encoding encoding
    // Size: 0x8
    // Offset: 0x38
    System::Text::Encoding* encoding;
    // Field size check
    static_assert(sizeof(System::Text::Encoding*) == 0x8);
    // protected System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0x40
    System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(System::Xml::XmlCharType) == 0x8);
    // protected System.Int32 bufPos
    // Size: 0x4
    // Offset: 0x48
    int bufPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 textPos
    // Size: 0x4
    // Offset: 0x4C
    int textPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 contentPos
    // Size: 0x4
    // Offset: 0x50
    int contentPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 cdataPos
    // Size: 0x4
    // Offset: 0x54
    int cdataPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 attrEndPos
    // Size: 0x4
    // Offset: 0x58
    int attrEndPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 bufLen
    // Size: 0x4
    // Offset: 0x5C
    int bufLen;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean writeToNull
    // Size: 0x1
    // Offset: 0x60
    bool writeToNull;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean hadDoubleBracket
    // Size: 0x1
    // Offset: 0x61
    bool hadDoubleBracket;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean inAttributeValue
    // Size: 0x1
    // Offset: 0x62
    bool inAttributeValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inAttributeValue and: bufBytesUsed
    char __padding13[0x1] = {};
    // protected System.Int32 bufBytesUsed
    // Size: 0x4
    // Offset: 0x64
    int bufBytesUsed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Char[] bufChars
    // Size: 0x8
    // Offset: 0x68
    ::Array<::Il2CppChar>* bufChars;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppChar>*) == 0x8);
    // protected System.Text.Encoder encoder
    // Size: 0x8
    // Offset: 0x70
    System::Text::Encoder* encoder;
    // Field size check
    static_assert(sizeof(System::Text::Encoder*) == 0x8);
    // protected System.IO.TextWriter writer
    // Size: 0x8
    // Offset: 0x78
    System::IO::TextWriter* writer;
    // Field size check
    static_assert(sizeof(System::IO::TextWriter*) == 0x8);
    // protected System.Boolean trackTextContent
    // Size: 0x1
    // Offset: 0x80
    bool trackTextContent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean inTextContent
    // Size: 0x1
    // Offset: 0x81
    bool inTextContent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inTextContent and: lastMarkPos
    char __padding19[0x2] = {};
    // private System.Int32 lastMarkPos
    // Size: 0x4
    // Offset: 0x84
    int lastMarkPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32[] textContentMarks
    // Size: 0x8
    // Offset: 0x88
    ::Array<int>* textContentMarks;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Xml.CharEntityEncoderFallback charEntityFallback
    // Size: 0x8
    // Offset: 0x90
    System::Xml::CharEntityEncoderFallback* charEntityFallback;
    // Field size check
    static_assert(sizeof(System::Xml::CharEntityEncoderFallback*) == 0x8);
    // protected System.Xml.NewLineHandling newLineHandling
    // Size: 0x4
    // Offset: 0x98
    System::Xml::NewLineHandling newLineHandling;
    // Field size check
    static_assert(sizeof(System::Xml::NewLineHandling) == 0x4);
    // protected System.Boolean closeOutput
    // Size: 0x1
    // Offset: 0x9C
    bool closeOutput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean omitXmlDeclaration
    // Size: 0x1
    // Offset: 0x9D
    bool omitXmlDeclaration;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: omitXmlDeclaration and: newLineChars
    char __padding25[0x2] = {};
    // protected System.String newLineChars
    // Size: 0x8
    // Offset: 0xA0
    ::Il2CppString* newLineChars;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // protected System.Boolean checkCharacters
    // Size: 0x1
    // Offset: 0xA8
    bool checkCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: checkCharacters and: standalone
    char __padding27[0x3] = {};
    // protected System.Xml.XmlStandalone standalone
    // Size: 0x4
    // Offset: 0xAC
    System::Xml::XmlStandalone standalone;
    // Field size check
    static_assert(sizeof(System::Xml::XmlStandalone) == 0x4);
    // protected System.Xml.XmlOutputMethod outputMethod
    // Size: 0x4
    // Offset: 0xB0
    System::Xml::XmlOutputMethod outputMethod;
    // Field size check
    static_assert(sizeof(System::Xml::XmlOutputMethod) == 0x4);
    // protected System.Boolean autoXmlDeclaration
    // Size: 0x1
    // Offset: 0xB4
    bool autoXmlDeclaration;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean mergeCDataSections
    // Size: 0x1
    // Offset: 0xB5
    bool mergeCDataSections;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: XmlEncodedRawTextWriter
