// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlNodeType
  struct XmlNodeType;
  // Forward declaring type: XmlNode
  class XmlNode;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XmlDocument
  class XmlDocument;
  // Forward declaring type: XmlSpace
  struct XmlSpace;
  // Forward declaring type: XmlDeclaration
  class XmlDeclaration;
  // Forward declaring type: XmlDocumentType
  class XmlDocumentType;
  // Forward declaring type: XmlElement
  class XmlElement;
  // Forward declaring type: XmlNamespaceScope
  struct XmlNamespaceScope;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: IXmlSchemaInfo
  class IXmlSchemaInfo;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XmlNodeReaderNavigator
  class XmlNodeReaderNavigator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::XmlNodeReaderNavigator);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::XmlNodeReaderNavigator*, "System.Xml", "XmlNodeReaderNavigator");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x69
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlNodeReaderNavigator
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlNodeReaderNavigator : public ::Il2CppObject {
    public:
    // Nested type: ::System::Xml::XmlNodeReaderNavigator::VirtualAttribute
    struct VirtualAttribute;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlNodeReaderNavigator/System.Xml.VirtualAttribute
    // [TokenAttribute] Offset: FFFFFFFF
    struct VirtualAttribute/*, public ::System::ValueType*/ {
      public:
      public:
      // System.String name
      // Size: 0x8
      // Offset: 0x0
      ::StringW name;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.String value
      // Size: 0x8
      // Offset: 0x8
      ::StringW value;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      public:
      // Creating value type constructor for type: VirtualAttribute
      constexpr VirtualAttribute(::StringW name_ = {}, ::StringW value_ = {}) noexcept : name{name_}, value{value_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: System.String name
      ::StringW& dyn_name();
      // Get instance field reference: System.String value
      ::StringW& dyn_value();
      // System.Void .ctor(System.String name, System.String value)
      // Offset: 0x14D2E28
      // ABORTED: conflicts with another method.  VirtualAttribute(::StringW name, ::StringW value);
    }; // System.Xml.XmlNodeReaderNavigator/System.Xml.VirtualAttribute
    #pragma pack(pop)
    static check_size<sizeof(XmlNodeReaderNavigator::VirtualAttribute), 8 + sizeof(::StringW)> __System_Xml_XmlNodeReaderNavigator_VirtualAttributeSizeCheck;
    static_assert(sizeof(XmlNodeReaderNavigator::VirtualAttribute) == 0x10);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.XmlNode curNode
    // Size: 0x8
    // Offset: 0x10
    ::System::Xml::XmlNode* curNode;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNode*) == 0x8);
    // private System.Xml.XmlNode elemNode
    // Size: 0x8
    // Offset: 0x18
    ::System::Xml::XmlNode* elemNode;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNode*) == 0x8);
    // private System.Xml.XmlNode logNode
    // Size: 0x8
    // Offset: 0x20
    ::System::Xml::XmlNode* logNode;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNode*) == 0x8);
    // private System.Int32 attrIndex
    // Size: 0x4
    // Offset: 0x28
    int attrIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 logAttrIndex
    // Size: 0x4
    // Offset: 0x2C
    int logAttrIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.XmlNameTable nameTable
    // Size: 0x8
    // Offset: 0x30
    ::System::Xml::XmlNameTable* nameTable;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.XmlDocument doc
    // Size: 0x8
    // Offset: 0x38
    ::System::Xml::XmlDocument* doc;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlDocument*) == 0x8);
    // private System.Int32 nAttrInd
    // Size: 0x4
    // Offset: 0x40
    int nAttrInd;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 nDeclarationAttrCount
    // Size: 0x4
    // Offset: 0x44
    int nDeclarationAttrCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 nDocTypeAttrCount
    // Size: 0x4
    // Offset: 0x48
    int nDocTypeAttrCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 nLogLevel
    // Size: 0x4
    // Offset: 0x4C
    int nLogLevel;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 nLogAttrInd
    // Size: 0x4
    // Offset: 0x50
    int nLogAttrInd;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean bLogOnAttrVal
    // Size: 0x1
    // Offset: 0x54
    bool bLogOnAttrVal;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bCreatedOnAttribute
    // Size: 0x1
    // Offset: 0x55
    bool bCreatedOnAttribute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bCreatedOnAttribute and: decNodeAttributes
    char __padding13[0x2] = {};
    // System.Xml.XmlNodeReaderNavigator/System.Xml.VirtualAttribute[] decNodeAttributes
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::System::Xml::XmlNodeReaderNavigator::VirtualAttribute> decNodeAttributes;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlNodeReaderNavigator::VirtualAttribute>) == 0x8);
    // System.Xml.XmlNodeReaderNavigator/System.Xml.VirtualAttribute[] docTypeNodeAttributes
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::System::Xml::XmlNodeReaderNavigator::VirtualAttribute> docTypeNodeAttributes;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlNodeReaderNavigator::VirtualAttribute>) == 0x8);
    // private System.Boolean bOnAttrVal
    // Size: 0x1
    // Offset: 0x68
    bool bOnAttrVal;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.Xml.XmlNode curNode
    ::System::Xml::XmlNode*& dyn_curNode();
    // Get instance field reference: private System.Xml.XmlNode elemNode
    ::System::Xml::XmlNode*& dyn_elemNode();
    // Get instance field reference: private System.Xml.XmlNode logNode
    ::System::Xml::XmlNode*& dyn_logNode();
    // Get instance field reference: private System.Int32 attrIndex
    int& dyn_attrIndex();
    // Get instance field reference: private System.Int32 logAttrIndex
    int& dyn_logAttrIndex();
    // Get instance field reference: private System.Xml.XmlNameTable nameTable
    ::System::Xml::XmlNameTable*& dyn_nameTable();
    // Get instance field reference: private System.Xml.XmlDocument doc
    ::System::Xml::XmlDocument*& dyn_doc();
    // Get instance field reference: private System.Int32 nAttrInd
    int& dyn_nAttrInd();
