// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlReader
#include "System/Xml/XmlReader.hpp"
// Including type: System.Xml.IXmlNamespaceResolver
#include "System/Xml/IXmlNamespaceResolver.hpp"
// Including type: System.Xml.XmlNodeType
#include "System/Xml/XmlNodeType.hpp"
// Including type: System.Xml.ReadState
#include "System/Xml/ReadState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlNodeReaderNavigator
  class XmlNodeReaderNavigator;
  // Forward declaring type: ReadContentAsBinaryHelper
  class ReadContentAsBinaryHelper;
  // Forward declaring type: XmlNode
  class XmlNode;
  // Forward declaring type: XmlNamespaceScope
  struct XmlNamespaceScope;
  // Forward declaring type: XmlSpace
  struct XmlSpace;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: IDtdInfo
  class IDtdInfo;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: IXmlSchemaInfo
  class IXmlSchemaInfo;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XmlNodeReader
  class XmlNodeReader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::XmlNodeReader);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::XmlNodeReader*, "System.Xml", "XmlNodeReader");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlNodeReader
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlNodeReader : public ::System::Xml::XmlReader/*, public ::System::Xml::IXmlNamespaceResolver*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.XmlNodeReaderNavigator readerNav
    // Size: 0x8
    // Offset: 0x10
    ::System::Xml::XmlNodeReaderNavigator* readerNav;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeReaderNavigator*) == 0x8);
    // private System.Xml.XmlNodeType nodeType
    // Size: 0x4
    // Offset: 0x18
    ::System::Xml::XmlNodeType nodeType;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeType) == 0x4);
    // private System.Int32 curDepth
    // Size: 0x4
    // Offset: 0x1C
    int curDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.ReadState readState
    // Size: 0x4
    // Offset: 0x20
    ::System::Xml::ReadState readState;
    // Field size check
    static_assert(sizeof(::System::Xml::ReadState) == 0x4);
    // private System.Boolean fEOF
    // Size: 0x1
    // Offset: 0x24
    bool fEOF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bResolveEntity
    // Size: 0x1
    // Offset: 0x25
    bool bResolveEntity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bStartFromDocument
    // Size: 0x1
    // Offset: 0x26
    bool bStartFromDocument;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bInReadBinary
    // Size: 0x1
    // Offset: 0x27
    bool bInReadBinary;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Xml.ReadContentAsBinaryHelper readBinaryHelper
    // Size: 0x8
    // Offset: 0x28
    ::System::Xml::ReadContentAsBinaryHelper* readBinaryHelper;
    // Field size check
    static_assert(sizeof(::System::Xml::ReadContentAsBinaryHelper*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::Xml::IXmlNamespaceResolver
    operator ::System::Xml::IXmlNamespaceResolver() noexcept {
      return *reinterpret_cast<::System::Xml::IXmlNamespaceResolver*>(this);
    }
    // Get instance field reference: private System.Xml.XmlNodeReaderNavigator readerNav
    ::System::Xml::XmlNodeReaderNavigator*& dyn_readerNav();
    // Get instance field reference: private System.Xml.XmlNodeType nodeType
    ::System::Xml::XmlNodeType& dyn_nodeType();
    // Get instance field reference: private System.Int32 curDepth
    int& dyn_curDepth();
    // Get instance field reference: private System.Xml.ReadState readState
    ::System::Xml::ReadState& dyn_readState();
    // Get instance field reference: private System.Boolean fEOF
