// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.ConformanceLevel
#include "System/Xml/ConformanceLevel.hpp"
// Including type: System.Xml.DtdProcessing
#include "System/Xml/DtdProcessing.hpp"
// Including type: System.Xml.ValidationType
#include "System/Xml/ValidationType.hpp"
// Including type: System.Xml.Schema.XmlSchemaValidationFlags
#include "System/Xml/Schema/XmlSchemaValidationFlags.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: XmlParserContext
  class XmlParserContext;
  // Forward declaring type: XmlValidatingReaderImpl
  class XmlValidatingReaderImpl;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaSet
  class XmlSchemaSet;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: TextReader
  class TextReader;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XmlReaderSettings
  class XmlReaderSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::XmlReaderSettings);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::XmlReaderSettings*, "System.Xml", "XmlReaderSettings");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x6B
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlReaderSettings
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlReaderSettings : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean useAsync
    // Size: 0x1
    // Offset: 0x10
    bool useAsync;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useAsync and: nameTable
    char __padding0[0x7] = {};
    // private System.Xml.XmlNameTable nameTable
    // Size: 0x8
    // Offset: 0x18
    System::Xml::XmlNameTable* nameTable;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.XmlResolver xmlResolver
    // Size: 0x8
    // Offset: 0x20
    System::Xml::XmlResolver* xmlResolver;
    // Field size check
    static_assert(sizeof(System::Xml::XmlResolver*) == 0x8);
    // private System.Int32 lineNumberOffset
    // Size: 0x4
    // Offset: 0x28
    int lineNumberOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 linePositionOffset
    // Size: 0x4
    // Offset: 0x2C
    int linePositionOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.ConformanceLevel conformanceLevel
    // Size: 0x4
    // Offset: 0x30
    System::Xml::ConformanceLevel conformanceLevel;
    // Field size check
    static_assert(sizeof(System::Xml::ConformanceLevel) == 0x4);
    // private System.Boolean checkCharacters
    // Size: 0x1
    // Offset: 0x34
    bool checkCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: checkCharacters and: maxCharactersInDocument
    char __padding6[0x3] = {};
    // private System.Int64 maxCharactersInDocument
    // Size: 0x8
    // Offset: 0x38
    int64_t maxCharactersInDocument;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 maxCharactersFromEntities
    // Size: 0x8
    // Offset: 0x40
    int64_t maxCharactersFromEntities;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean ignoreWhitespace
    // Size: 0x1
    // Offset: 0x48
    bool ignoreWhitespace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ignorePIs
    // Size: 0x1
    // Offset: 0x49
    bool ignorePIs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ignoreComments
    // Size: 0x1
    // Offset: 0x4A
    bool ignoreComments;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ignoreComments and: dtdProcessing
    char __padding11[0x1] = {};
    // private System.Xml.DtdProcessing dtdProcessing
    // Size: 0x4
    // Offset: 0x4C
    System::Xml::DtdProcessing dtdProcessing;
    // Field size check
    static_assert(sizeof(System::Xml::DtdProcessing) == 0x4);
    // private System.Xml.ValidationType validationType
    // Size: 0x4
    // Offset: 0x50
    System::Xml::ValidationType validationType;
    // Field size check
    static_assert(sizeof(System::Xml::ValidationType) == 0x4);
    // private System.Xml.Schema.XmlSchemaValidationFlags validationFlags
    // Size: 0x4
    // Offset: 0x54
    System::Xml::Schema::XmlSchemaValidationFlags validationFlags;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaValidationFlags) == 0x4);
    // private System.Xml.Schema.XmlSchemaSet schemas
    // Size: 0x8
    // Offset: 0x58
    System::Xml::Schema::XmlSchemaSet* schemas;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaSet*) == 0x8);
    // private System.Xml.Schema.ValidationEventHandler valEventHandler
    // Size: 0x8
    // Offset: 0x60
    System::Xml::Schema::ValidationEventHandler* valEventHandler;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::ValidationEventHandler*) == 0x8);
    // private System.Boolean closeInput
    // Size: 0x1
    // Offset: 0x68
    bool closeInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isReadOnly
    // Size: 0x1
    // Offset: 0x69
    bool isReadOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsXmlResolverSet>k__BackingField
    // Size: 0x1
    // Offset: 0x6A
    bool IsXmlResolverSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private System.Nullable`1<System.Boolean> s_enableLegacyXmlSettings
    static System::Nullable_1<bool> _get_s_enableLegacyXmlSettings();
    // Set static field: static private System.Nullable`1<System.Boolean> s_enableLegacyXmlSettings
    static void _set_s_enableLegacyXmlSettings(System::Nullable_1<bool> value);
    // Get instance field reference: private System.Boolean useAsync
    bool& dyn_useAsync();
    // Get instance field reference: private System.Xml.XmlNameTable nameTable
    System::Xml::XmlNameTable*& dyn_nameTable();
    // Get instance field reference: private System.Xml.XmlResolver xmlResolver
    System::Xml::XmlResolver*& dyn_xmlResolver();
    // Get instance field reference: private System.Int32 lineNumberOffset
    int& dyn_lineNumberOffset();
