// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlReader
#include "System/Xml/XmlReader.hpp"
// Including type: System.Xml.IXmlNamespaceResolver
#include "System/Xml/IXmlNamespaceResolver.hpp"
// Including type: System.Xml.XmlNodeType
#include "System/Xml/XmlNodeType.hpp"
// Including type: System.Xml.BinXmlToken
#include "System/Xml/BinXmlToken.hpp"
// Including type: System.Xml.DtdProcessing
#include "System/Xml/DtdProcessing.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Including type: System.Xml.ReadState
#include "System/Xml/ReadState.hpp"
// Including type: System.Xml.XmlSpace
#include "System/Xml/XmlSpace.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: SecureStringHasher
  class SecureStringHasher;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XmlReaderSettings
  class XmlReaderSettings;
  // Forward declaring type: XmlNamespaceScope
  struct XmlNamespaceScope;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Decimal
  struct Decimal;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XmlSqlBinaryReader
  class XmlSqlBinaryReader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::XmlSqlBinaryReader);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::XmlSqlBinaryReader*, "System.Xml", "XmlSqlBinaryReader");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x161
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlSqlBinaryReader
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlSqlBinaryReader : public System::Xml::XmlReader/*, public System::Xml::IXmlNamespaceResolver*/ {
    public:
    // Nested type: System::Xml::XmlSqlBinaryReader::ScanState
    struct ScanState;
    // Nested type: System::Xml::XmlSqlBinaryReader::QName
    struct QName;
    // Nested type: System::Xml::XmlSqlBinaryReader::ElemInfo
    struct ElemInfo;
    // Nested type: System::Xml::XmlSqlBinaryReader::AttrInfo
    struct AttrInfo;
    // Nested type: System::Xml::XmlSqlBinaryReader::NamespaceDecl
    class NamespaceDecl;
    // Nested type: System::Xml::XmlSqlBinaryReader::SymbolTables
    struct SymbolTables;
    // Nested type: System::Xml::XmlSqlBinaryReader::NestedBinXml
    class NestedBinXml;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlSqlBinaryReader/System.Xml.ScanState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ScanState/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ScanState
      constexpr ScanState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Doc
      static constexpr const int Doc = 0;
      // Get static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Doc
      static System::Xml::XmlSqlBinaryReader::ScanState _get_Doc();
      // Set static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Doc
      static void _set_Doc(System::Xml::XmlSqlBinaryReader::ScanState value);
      // static field const value: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState XmlText
      static constexpr const int XmlText = 1;
      // Get static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState XmlText
      static System::Xml::XmlSqlBinaryReader::ScanState _get_XmlText();
      // Set static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState XmlText
      static void _set_XmlText(System::Xml::XmlSqlBinaryReader::ScanState value);
      // static field const value: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Attr
      static constexpr const int Attr = 2;
      // Get static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Attr
      static System::Xml::XmlSqlBinaryReader::ScanState _get_Attr();
      // Set static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Attr
      static void _set_Attr(System::Xml::XmlSqlBinaryReader::ScanState value);
      // static field const value: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState AttrVal
      static constexpr const int AttrVal = 3;
      // Get static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState AttrVal
      static System::Xml::XmlSqlBinaryReader::ScanState _get_AttrVal();
      // Set static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState AttrVal
      static void _set_AttrVal(System::Xml::XmlSqlBinaryReader::ScanState value);
      // static field const value: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState AttrValPseudoValue
      static constexpr const int AttrValPseudoValue = 4;
      // Get static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState AttrValPseudoValue
      static System::Xml::XmlSqlBinaryReader::ScanState _get_AttrValPseudoValue();
      // Set static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState AttrValPseudoValue
      static void _set_AttrValPseudoValue(System::Xml::XmlSqlBinaryReader::ScanState value);
      // static field const value: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Init
      static constexpr const int Init = 5;
      // Get static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Init
      static System::Xml::XmlSqlBinaryReader::ScanState _get_Init();
      // Set static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Init
      static void _set_Init(System::Xml::XmlSqlBinaryReader::ScanState value);
      // static field const value: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Error
      static constexpr const int Error = 6;
      // Get static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Error
      static System::Xml::XmlSqlBinaryReader::ScanState _get_Error();
      // Set static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Error
      static void _set_Error(System::Xml::XmlSqlBinaryReader::ScanState value);
      // static field const value: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState EOF
      static constexpr const int _EOF = 7;
      // Get static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState EOF
      static System::Xml::XmlSqlBinaryReader::ScanState _get_EOF();
      // Set static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState EOF
      static void _set_EOF(System::Xml::XmlSqlBinaryReader::ScanState value);
      // static field const value: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Closed
      static constexpr const int Closed = 8;
      // Get static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Closed
      static System::Xml::XmlSqlBinaryReader::ScanState _get_Closed();
      // Set static field: static public System.Xml.XmlSqlBinaryReader/System.Xml.ScanState Closed
      static void _set_Closed(System::Xml::XmlSqlBinaryReader::ScanState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XmlSqlBinaryReader/System.Xml.ScanState
    #pragma pack(pop)
    static check_size<sizeof(XmlSqlBinaryReader::ScanState), 0 + sizeof(int)> __System_Xml_XmlSqlBinaryReader_ScanStateSizeCheck;
    static_assert(sizeof(XmlSqlBinaryReader::ScanState) == 0x4);
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlSqlBinaryReader/System.Xml.QName
    // [TokenAttribute] Offset: FFFFFFFF
    struct QName/*, public System::ValueType*/ {
      public:
      public:
      // public System.String prefix
      // Size: 0x8
      // Offset: 0x0
      ::StringW prefix;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String localname
      // Size: 0x8
      // Offset: 0x8
      ::StringW localname;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String namespaceUri
      // Size: 0x8
      // Offset: 0x10
      ::StringW namespaceUri;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      public:
      // Creating value type constructor for type: QName
      constexpr QName(::StringW prefix_ = {}, ::StringW localname_ = {}, ::StringW namespaceUri_ = {}) noexcept : prefix{prefix_}, localname{localname_}, namespaceUri{namespaceUri_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get instance field reference: public System.String prefix
      ::StringW& dyn_prefix();
      // Get instance field reference: public System.String localname
      ::StringW& dyn_localname();
      // Get instance field reference: public System.String namespaceUri
      ::StringW& dyn_namespaceUri();
      // public System.Void .ctor(System.String prefix, System.String lname, System.String nsUri)
      // Offset: 0x14E0DAC
      // ABORTED: conflicts with another method.  QName(::StringW prefix, ::StringW lname, ::StringW nsUri);
      // public System.Void Set(System.String prefix, System.String lname, System.String nsUri)
      // Offset: 0x14DFA6C
      void Set(::StringW prefix, ::StringW lname, ::StringW nsUri);
      // public System.Void Clear()
      // Offset: 0x14DBCBC
      void Clear();
      // public System.Boolean MatchNs(System.String lname, System.String nsUri)
      // Offset: 0x14E06A4
      bool MatchNs(::StringW lname, ::StringW nsUri);
      // public System.Boolean MatchPrefix(System.String prefix, System.String lname)
      // Offset: 0x14E06F8
      bool MatchPrefix(::StringW prefix, ::StringW lname);
      // public System.Void CheckPrefixNS(System.String prefix, System.String namespaceUri)
      // Offset: 0x14E0A8C
      void CheckPrefixNS(::StringW prefix, ::StringW namespaceUri);
      // public System.Int32 GetNSHashCode(System.Xml.SecureStringHasher hasher)
      // Offset: 0x14E4050
      int GetNSHashCode(System::Xml::SecureStringHasher* hasher);
      // public override System.Int32 GetHashCode()
      // Offset: 0x14E40A0
      // Implemented from: System.ValueType
      // Base method: System.Int32 ValueType::GetHashCode()
      int GetHashCode();
      // public override System.Boolean Equals(System.Object other)
      // Offset: 0x14E40F4
      // Implemented from: System.ValueType
      // Base method: System.Boolean ValueType::Equals(System.Object other)
      bool Equals(::Il2CppObject* other);
      // public override System.String ToString()
      // Offset: 0x14E1928
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::StringW ToString();
    }; // System.Xml.XmlSqlBinaryReader/System.Xml.QName
    #pragma pack(pop)
    static check_size<sizeof(XmlSqlBinaryReader::QName), 16 + sizeof(::StringW)> __System_Xml_XmlSqlBinaryReader_QNameSizeCheck;
    static_assert(sizeof(XmlSqlBinaryReader::QName) == 0x18);
    // Size: 0x30
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlSqlBinaryReader/System.Xml.ElemInfo
    // [TokenAttribute] Offset: FFFFFFFF
    struct ElemInfo/*, public System::ValueType*/ {
      public:
      public:
      // public System.Xml.XmlSqlBinaryReader/System.Xml.QName name
      // Size: 0x18
      // Offset: 0x0
      System::Xml::XmlSqlBinaryReader::QName name;
      // Field size check
      static_assert(sizeof(System::Xml::XmlSqlBinaryReader::QName) == 0x18);
      // public System.String xmlLang
      // Size: 0x8
      // Offset: 0x18
      ::StringW xmlLang;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Xml.XmlSpace xmlSpace
      // Size: 0x4
      // Offset: 0x20
      System::Xml::XmlSpace xmlSpace;
      // Field size check
      static_assert(sizeof(System::Xml::XmlSpace) == 0x4);
      // public System.Boolean xmlspacePreserve
      // Size: 0x1
      // Offset: 0x24
      bool xmlspacePreserve;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: xmlspacePreserve and: nsdecls
      char __padding3[0x3] = {};
      // public System.Xml.XmlSqlBinaryReader/System.Xml.NamespaceDecl nsdecls
      // Size: 0x8
      // Offset: 0x28
      System::Xml::XmlSqlBinaryReader::NamespaceDecl* nsdecls;
      // Field size check
      static_assert(sizeof(System::Xml::XmlSqlBinaryReader::NamespaceDecl*) == 0x8);
      public:
      // Creating value type constructor for type: ElemInfo
      constexpr ElemInfo(System::Xml::XmlSqlBinaryReader::QName name_ = {}, ::StringW xmlLang_ = {}, System::Xml::XmlSpace xmlSpace_ = {}, bool xmlspacePreserve_ = {}, System::Xml::XmlSqlBinaryReader::NamespaceDecl* nsdecls_ = {}) noexcept : name{name_}, xmlLang{xmlLang_}, xmlSpace{xmlSpace_}, xmlspacePreserve{xmlspacePreserve_}, nsdecls{nsdecls_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get instance field reference: public System.Xml.XmlSqlBinaryReader/System.Xml.QName name
      System::Xml::XmlSqlBinaryReader::QName& dyn_name();
      // Get instance field reference: public System.String xmlLang
      ::StringW& dyn_xmlLang();
      // Get instance field reference: public System.Xml.XmlSpace xmlSpace
      System::Xml::XmlSpace& dyn_xmlSpace();
      // Get instance field reference: public System.Boolean xmlspacePreserve
      bool& dyn_xmlspacePreserve();
      // Get instance field reference: public System.Xml.XmlSqlBinaryReader/System.Xml.NamespaceDecl nsdecls
      System::Xml::XmlSqlBinaryReader::NamespaceDecl*& dyn_nsdecls();
      // public System.Void Set(System.Xml.XmlSqlBinaryReader/System.Xml.QName name, System.Boolean xmlspacePreserve)
      // Offset: 0x14E2768
      void Set(System::Xml::XmlSqlBinaryReader::QName name, bool xmlspacePreserve);
      // public System.Xml.XmlSqlBinaryReader/System.Xml.NamespaceDecl Clear()
      // Offset: 0x14E1B24
      System::Xml::XmlSqlBinaryReader::NamespaceDecl* Clear();
    }; // System.Xml.XmlSqlBinaryReader/System.Xml.ElemInfo
    #pragma pack(pop)
    static check_size<sizeof(XmlSqlBinaryReader::ElemInfo), 40 + sizeof(System::Xml::XmlSqlBinaryReader::NamespaceDecl*)> __System_Xml_XmlSqlBinaryReader_ElemInfoSizeCheck;
    static_assert(sizeof(XmlSqlBinaryReader::ElemInfo) == 0x30);
    // Size: 0x2C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlSqlBinaryReader/System.Xml.AttrInfo
    // [TokenAttribute] Offset: FFFFFFFF
    struct AttrInfo/*, public System::ValueType*/ {
      public:
      public:
      // public System.Xml.XmlSqlBinaryReader/System.Xml.QName name
      // Size: 0x18
      // Offset: 0x0
      System::Xml::XmlSqlBinaryReader::QName name;
      // Field size check
      static_assert(sizeof(System::Xml::XmlSqlBinaryReader::QName) == 0x18);
      // public System.String val
      // Size: 0x8
      // Offset: 0x18
      ::StringW val;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Int32 contentPos
      // Size: 0x4
      // Offset: 0x20
      int contentPos;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 hashCode
      // Size: 0x4
      // Offset: 0x24
      int hashCode;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 prevHash
      // Size: 0x4
      // Offset: 0x28
      int prevHash;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AttrInfo
      constexpr AttrInfo(System::Xml::XmlSqlBinaryReader::QName name_ = {}, ::StringW val_ = {}, int contentPos_ = {}, int hashCode_ = {}, int prevHash_ = {}) noexcept : name{name_}, val{val_}, contentPos{contentPos_}, hashCode{hashCode_}, prevHash{prevHash_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get instance field reference: public System.Xml.XmlSqlBinaryReader/System.Xml.QName name
      System::Xml::XmlSqlBinaryReader::QName& dyn_name();
      // Get instance field reference: public System.String val
      ::StringW& dyn_val();
      // Get instance field reference: public System.Int32 contentPos
      int& dyn_contentPos();
      // Get instance field reference: public System.Int32 hashCode
      int& dyn_hashCode();
      // Get instance field reference: public System.Int32 prevHash
      int& dyn_prevHash();
      // public System.Void Set(System.Xml.XmlSqlBinaryReader/System.Xml.QName n, System.String v)
      // Offset: 0x14E0DB8
      void Set(System::Xml::XmlSqlBinaryReader::QName n, ::StringW v);
      // public System.Void Set(System.Xml.XmlSqlBinaryReader/System.Xml.QName n, System.Int32 pos)
      // Offset: 0x14E1244
      void Set(System::Xml::XmlSqlBinaryReader::QName n, int pos);
      // public System.Void GetLocalnameAndNamespaceUri(out System.String localname, out System.String namespaceUri)
      // Offset: 0x14E1910
      void GetLocalnameAndNamespaceUri(ByRef<::StringW> localname, ByRef<::StringW> namespaceUri);
      // public System.Int32 GetLocalnameAndNamespaceUriAndHash(System.Xml.SecureStringHasher hasher, out System.String localname, out System.String namespaceUri)
      // Offset: 0x14E19A0
      int GetLocalnameAndNamespaceUriAndHash(System::Xml::SecureStringHasher* hasher, ByRef<::StringW> localname, ByRef<::StringW> namespaceUri);
      // public System.Boolean MatchNS(System.String localname, System.String namespaceUri)
      // Offset: 0x14E1924
      bool MatchNS(::StringW localname, ::StringW namespaceUri);
      // public System.Boolean MatchHashNS(System.Int32 hash, System.String localname, System.String namespaceUri)
      // Offset: 0x14E19D4
      bool MatchHashNS(int hash, ::StringW localname, ::StringW namespaceUri);
      // public System.Void AdjustPosition(System.Int32 adj)
      // Offset: 0x14DFE9C
      void AdjustPosition(int adj);
    }; // System.Xml.XmlSqlBinaryReader/System.Xml.AttrInfo
    #pragma pack(pop)
    static check_size<sizeof(XmlSqlBinaryReader::AttrInfo), 40 + sizeof(int)> __System_Xml_XmlSqlBinaryReader_AttrInfoSizeCheck;
    static_assert(sizeof(XmlSqlBinaryReader::AttrInfo) == 0x2C);
    // Size: 0x1C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlSqlBinaryReader/System.Xml.SymbolTables
    // [TokenAttribute] Offset: FFFFFFFF
    struct SymbolTables/*, public System::ValueType*/ {
      public:
      public:
      // public System.String[] symtable
      // Size: 0x8
      // Offset: 0x0
      ::ArrayW<::StringW> symtable;
      // Field size check
      static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
      // public System.Int32 symCount
      // Size: 0x4
      // Offset: 0x8
      int symCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: symCount and: qnametable
      char __padding1[0x4] = {};
      // public System.Xml.XmlSqlBinaryReader/System.Xml.QName[] qnametable
      // Size: 0x8
      // Offset: 0x10
      ::ArrayW<System::Xml::XmlSqlBinaryReader::QName> qnametable;
      // Field size check
      static_assert(sizeof(::ArrayW<System::Xml::XmlSqlBinaryReader::QName>) == 0x8);
      // public System.Int32 qnameCount
      // Size: 0x4
      // Offset: 0x18
      int qnameCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SymbolTables
      constexpr SymbolTables(::ArrayW<::StringW> symtable_ = ::ArrayW<::StringW>(static_cast<void*>(nullptr)), int symCount_ = {}, ::ArrayW<System::Xml::XmlSqlBinaryReader::QName> qnametable_ = ::ArrayW<System::Xml::XmlSqlBinaryReader::QName>(static_cast<void*>(nullptr)), int qnameCount_ = {}) noexcept : symtable{symtable_}, symCount{symCount_}, qnametable{qnametable_}, qnameCount{qnameCount_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get instance field reference: public System.String[] symtable
      ::ArrayW<::StringW>& dyn_symtable();
      // Get instance field reference: public System.Int32 symCount
      int& dyn_symCount();
      // Get instance field reference: public System.Xml.XmlSqlBinaryReader/System.Xml.QName[] qnametable
      ::ArrayW<System::Xml::XmlSqlBinaryReader::QName>& dyn_qnametable();
      // Get instance field reference: public System.Int32 qnameCount
      int& dyn_qnameCount();
      // public System.Void Init()
      // Offset: 0x14DBBDC
      void Init();
    }; // System.Xml.XmlSqlBinaryReader/System.Xml.SymbolTables
    #pragma pack(pop)
    static check_size<sizeof(XmlSqlBinaryReader::SymbolTables), 24 + sizeof(int)> __System_Xml_XmlSqlBinaryReader_SymbolTablesSizeCheck;
    static_assert(sizeof(XmlSqlBinaryReader::SymbolTables) == 0x1C);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.IO.Stream inStrm
    // Size: 0x8
    // Offset: 0x10
    System::IO::Stream* inStrm;
    // Field size check
    static_assert(sizeof(System::IO::Stream*) == 0x8);
    // private System.Byte[] data
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<uint8_t> data;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Int32 pos
    // Size: 0x4
    // Offset: 0x20
    int pos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 mark
    // Size: 0x4
    // Offset: 0x24
    int mark;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 end
    // Size: 0x4
    // Offset: 0x28
    int end;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: end and: offset
    char __padding4[0x4] = {};
    // private System.Int64 offset
    // Size: 0x8
    // Offset: 0x30
    int64_t offset;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean eof
    // Size: 0x1
    // Offset: 0x38
    bool eof;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean sniffed
    // Size: 0x1
    // Offset: 0x39
    bool sniffed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isEmpty
    // Size: 0x1
    // Offset: 0x3A
    bool isEmpty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isEmpty and: docState
    char __padding8[0x1] = {};
    // private System.Int32 docState
    // Size: 0x4
    // Offset: 0x3C
    int docState;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.XmlSqlBinaryReader/System.Xml.SymbolTables symbolTables
    // Size: 0x1C
    // Offset: 0x40
    System::Xml::XmlSqlBinaryReader::SymbolTables symbolTables;
    // Field size check
    static_assert(sizeof(System::Xml::XmlSqlBinaryReader::SymbolTables) == 0x1C);
    // Padding between fields: symbolTables and: xnt
    char __padding10[0x4] = {};
    // private System.Xml.XmlNameTable xnt
    // Size: 0x8
    // Offset: 0x60
    System::Xml::XmlNameTable* xnt;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNameTable*) == 0x8);
    // private System.Boolean xntFromSettings
    // Size: 0x1
    // Offset: 0x68
    bool xntFromSettings;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: xntFromSettings and: xml
    char __padding12[0x7] = {};
    // private System.String xml
    // Size: 0x8
    // Offset: 0x70
    ::StringW xml;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String xmlns
    // Size: 0x8
    // Offset: 0x78
    ::StringW xmlns;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String nsxmlns
    // Size: 0x8
    // Offset: 0x80
    ::StringW nsxmlns;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String baseUri
    // Size: 0x8
    // Offset: 0x88
    ::StringW baseUri;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlSqlBinaryReader/System.Xml.ScanState state
    // Size: 0x4
    // Offset: 0x90
    System::Xml::XmlSqlBinaryReader::ScanState state;
    // Field size check
    static_assert(sizeof(System::Xml::XmlSqlBinaryReader::ScanState) == 0x4);
    // private System.Xml.XmlNodeType nodetype
    // Size: 0x4
    // Offset: 0x94
    System::Xml::XmlNodeType nodetype;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNodeType) == 0x4);
    // private System.Xml.BinXmlToken token
    // Size: 0x4
    // Offset: 0x98
    System::Xml::BinXmlToken token;
    // Field size check
    static_assert(sizeof(System::Xml::BinXmlToken) == 0x4);
    // private System.Int32 attrIndex
    // Size: 0x4
    // Offset: 0x9C
    int attrIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.XmlSqlBinaryReader/System.Xml.QName qnameOther
    // Size: 0x18
    // Offset: 0xA0
    System::Xml::XmlSqlBinaryReader::QName qnameOther;
    // Field size check
    static_assert(sizeof(System::Xml::XmlSqlBinaryReader::QName) == 0x18);
    // private System.Xml.XmlSqlBinaryReader/System.Xml.QName qnameElement
    // Size: 0x18
    // Offset: 0xB8
    System::Xml::XmlSqlBinaryReader::QName qnameElement;
    // Field size check
    static_assert(sizeof(System::Xml::XmlSqlBinaryReader::QName) == 0x18);
    // private System.Xml.XmlNodeType parentNodeType
    // Size: 0x4
    // Offset: 0xD0
    System::Xml::XmlNodeType parentNodeType;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNodeType) == 0x4);
    // Padding between fields: parentNodeType and: elementStack
    char __padding23[0x4] = {};
    // private System.Xml.XmlSqlBinaryReader/System.Xml.ElemInfo[] elementStack
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<System::Xml::XmlSqlBinaryReader::ElemInfo> elementStack;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Xml::XmlSqlBinaryReader::ElemInfo>) == 0x8);
    // private System.Int32 elemDepth
    // Size: 0x4
    // Offset: 0xE0
    int elemDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: elemDepth and: attributes
    char __padding25[0x4] = {};
    // private System.Xml.XmlSqlBinaryReader/System.Xml.AttrInfo[] attributes
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<System::Xml::XmlSqlBinaryReader::AttrInfo> attributes;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Xml::XmlSqlBinaryReader::AttrInfo>) == 0x8);
    // private System.Int32[] attrHashTbl
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<int> attrHashTbl;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Int32 attrCount
    // Size: 0x4
    // Offset: 0xF8
    int attrCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 posAfterAttrs
    // Size: 0x4
    // Offset: 0xFC
    int posAfterAttrs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean xmlspacePreserve
    // Size: 0x1
    // Offset: 0x100
    bool xmlspacePreserve;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: xmlspacePreserve and: tokLen
    char __padding30[0x3] = {};
    // private System.Int32 tokLen
    // Size: 0x4
    // Offset: 0x104
    int tokLen;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 tokDataPos
    // Size: 0x4
    // Offset: 0x108
    int tokDataPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean hasTypedValue
    // Size: 0x1
    // Offset: 0x10C
    bool hasTypedValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasTypedValue and: valueType
    char __padding33[0x3] = {};
    // private System.Type valueType
    // Size: 0x8
    // Offset: 0x110
    System::Type* valueType;
    // Field size check
    static_assert(sizeof(System::Type*) == 0x8);
    // private System.String stringValue
    // Size: 0x8
    // Offset: 0x118
    ::StringW stringValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Xml.XmlSqlBinaryReader/System.Xml.NamespaceDecl> namespaces
    // Size: 0x8
    // Offset: 0x120
    System::Collections::Generic::Dictionary_2<::StringW, System::Xml::XmlSqlBinaryReader::NamespaceDecl*>* namespaces;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::StringW, System::Xml::XmlSqlBinaryReader::NamespaceDecl*>*) == 0x8);
    // private System.Xml.XmlSqlBinaryReader/System.Xml.NestedBinXml prevNameInfo
    // Size: 0x8
    // Offset: 0x128
    System::Xml::XmlSqlBinaryReader::NestedBinXml* prevNameInfo;
    // Field size check
    static_assert(sizeof(System::Xml::XmlSqlBinaryReader::NestedBinXml*) == 0x8);
    // private System.Xml.XmlReader textXmlReader
    // Size: 0x8
    // Offset: 0x130
    System::Xml::XmlReader* textXmlReader;
    // Field size check
    static_assert(sizeof(System::Xml::XmlReader*) == 0x8);
    // private System.Boolean closeInput
    // Size: 0x1
    // Offset: 0x138
    bool closeInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean checkCharacters
    // Size: 0x1
    // Offset: 0x139
    bool checkCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ignoreWhitespace
    // Size: 0x1
    // Offset: 0x13A
    bool ignoreWhitespace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ignorePIs
    // Size: 0x1
    // Offset: 0x13B
    bool ignorePIs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ignoreComments
    // Size: 0x1
    // Offset: 0x13C
    bool ignoreComments;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ignoreComments and: dtdProcessing
    char __padding43[0x3] = {};
    // private System.Xml.DtdProcessing dtdProcessing
    // Size: 0x4
    // Offset: 0x140
    System::Xml::DtdProcessing dtdProcessing;
    // Field size check
    static_assert(sizeof(System::Xml::DtdProcessing) == 0x4);
    // Padding between fields: dtdProcessing and: hasher
    char __padding44[0x4] = {};
    // private System.Xml.SecureStringHasher hasher
    // Size: 0x8
    // Offset: 0x148
    System::Xml::SecureStringHasher* hasher;
    // Field size check
    static_assert(sizeof(System::Xml::SecureStringHasher*) == 0x8);
    // private System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0x150
    System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(System::Xml::XmlCharType) == 0x8);
    // private System.Text.Encoding unicode
    // Size: 0x8
    // Offset: 0x158
    System::Text::Encoding* unicode;
    // Field size check
    static_assert(sizeof(System::Text::Encoding*) == 0x8);
    // private System.Byte version
    // Size: 0x1
    // Offset: 0x160
    uint8_t version;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    public:
    // Creating interface conversion operator: operator System::Xml::IXmlNamespaceResolver
    operator System::Xml::IXmlNamespaceResolver() noexcept {
      return *reinterpret_cast<System::Xml::IXmlNamespaceResolver*>(this);
    }
    // Get static field: static readonly System.Type TypeOfObject
    static System::Type* _get_TypeOfObject();
    // Set static field: static readonly System.Type TypeOfObject
    static void _set_TypeOfObject(System::Type* value);
    // Get static field: static readonly System.Type TypeOfString
    static System::Type* _get_TypeOfString();
    // Set static field: static readonly System.Type TypeOfString
    static void _set_TypeOfString(System::Type* value);
    // Get static field: static private System.Type[] TokenTypeMap
    static ::ArrayW<System::Type*> _get_TokenTypeMap();
