// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlTextReaderImpl
#include "System/Xml/XmlTextReaderImpl.hpp"
// Including type: System.IComparable
#include "System/IComparable.hpp"
// Including type: System.Xml.XmlNodeType
#include "System/Xml/XmlNodeType.hpp"
// Including type: System.Xml.LineInfo
#include "System/Xml/LineInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::XmlTextReaderImpl::NodeData);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::XmlTextReaderImpl::NodeData*, "System.Xml", "XmlTextReaderImpl/NodeData");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlTextReaderImpl/System.Xml.NodeData
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlTextReaderImpl::NodeData : public ::Il2CppObject/*, public ::System::IComparable*/ {
    public:
    public:
    // System.Xml.XmlNodeType type
    // Size: 0x4
    // Offset: 0x10
    ::System::Xml::XmlNodeType type;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeType) == 0x4);
    // Padding between fields: type and: localName
    char __padding0[0x4] = {};
    // System.String localName
    // Size: 0x8
    // Offset: 0x18
    ::StringW localName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String prefix
    // Size: 0x8
    // Offset: 0x20
    ::StringW prefix;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String ns
    // Size: 0x8
    // Offset: 0x28
    ::StringW ns;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String nameWPrefix
    // Size: 0x8
    // Offset: 0x30
    ::StringW nameWPrefix;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String value
    // Size: 0x8
    // Offset: 0x38
    ::StringW value;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Char[] chars
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::Il2CppChar> chars;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
    // private System.Int32 valueStartPos
    // Size: 0x4
    // Offset: 0x48
    int valueStartPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 valueLength
    // Size: 0x4
    // Offset: 0x4C
    int valueLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Xml.LineInfo lineInfo
    // Size: 0x8
    // Offset: 0x50
    ::System::Xml::LineInfo lineInfo;
    // Field size check
    static_assert(sizeof(::System::Xml::LineInfo) == 0x8);
    // System.Xml.LineInfo lineInfo2
    // Size: 0x8
    // Offset: 0x58
    ::System::Xml::LineInfo lineInfo2;
    // Field size check
    static_assert(sizeof(::System::Xml::LineInfo) == 0x8);
    // System.Char quoteChar
    // Size: 0x2
    // Offset: 0x60
    ::Il2CppChar quoteChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // Padding between fields: quoteChar and: depth
    char __padding11[0x2] = {};
    // System.Int32 depth
    // Size: 0x4
    // Offset: 0x64
    int depth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean isEmptyOrDefault
    // Size: 0x1
    // Offset: 0x68
    bool isEmptyOrDefault;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isEmptyOrDefault and: entityId
    char __padding13[0x3] = {};
    // System.Int32 entityId
    // Size: 0x4
    // Offset: 0x6C
    int entityId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean xmlContextPushed
    // Size: 0x1
    // Offset: 0x70
    bool xmlContextPushed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: xmlContextPushed and: nextAttrValueChunk
    char __padding15[0x7] = {};
    // System.Xml.XmlTextReaderImpl/System.Xml.NodeData nextAttrValueChunk
    // Size: 0x8
    // Offset: 0x78
    ::System::Xml::XmlTextReaderImpl::NodeData* nextAttrValueChunk;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::NodeData*) == 0x8);
    // System.Object schemaType
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppObject* schemaType;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Object typedValue
    // Size: 0x8
    // Offset: 0x88
    ::Il2CppObject* typedValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IComparable
    operator ::System::IComparable() noexcept {
      return *reinterpret_cast<::System::IComparable*>(this);
    }
    // Creating interface conversion operator: i_IComparable
    inline ::System::IComparable* i_IComparable() noexcept {
      return reinterpret_cast<::System::IComparable*>(this);
    }
    // Get static field: static private System.Xml.XmlTextReaderImpl/System.Xml.NodeData s_None
    static ::System::Xml::XmlTextReaderImpl::NodeData* _get_s_None();
    // Set static field: static private System.Xml.XmlTextReaderImpl/System.Xml.NodeData s_None
    static void _set_s_None(::System::Xml::XmlTextReaderImpl::NodeData* value);
    // Get instance field reference: System.Xml.XmlNodeType type
