// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlWriter
#include "System/Xml/XmlWriter.hpp"
// Including type: System.Xml.Formatting
#include "System/Xml/Formatting.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Including type: System.Xml.XmlSpace
#include "System/Xml/XmlSpace.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Skipping declaration: NamespaceState because it is already included!
  // Forward declaring type: WriteState
  struct WriteState;
  // Skipping declaration: Token because it is already included!
  // Forward declaring type: XmlTextWriterBase64Encoder
  class XmlTextWriterBase64Encoder;
  // Forward declaring type: XmlTextEncoder
  class XmlTextEncoder;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: TextWriter
  class TextWriter;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XmlTextWriter
  class XmlTextWriter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::XmlTextWriter);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::XmlTextWriter*, "System.Xml", "XmlTextWriter");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlTextWriter
  // [TokenAttribute] Offset: FFFFFFFF
  // [EditorBrowsableAttribute] Offset: 1194074
  class XmlTextWriter : public System::Xml::XmlWriter {
    public:
    // Nested type: System::Xml::XmlTextWriter::NamespaceState
    struct NamespaceState;
    // Nested type: System::Xml::XmlTextWriter::TagInfo
    struct TagInfo;
    // Nested type: System::Xml::XmlTextWriter::Namespace
    struct Namespace;
    // Nested type: System::Xml::XmlTextWriter::SpecialAttr
    struct SpecialAttr;
    // Nested type: System::Xml::XmlTextWriter::State
    struct State;
    // Nested type: System::Xml::XmlTextWriter::Token
    struct Token;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlTextWriter/System.Xml.NamespaceState
    // [TokenAttribute] Offset: FFFFFFFF
    struct NamespaceState/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NamespaceState
      constexpr NamespaceState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState Uninitialized
      static constexpr const int Uninitialized = 0;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState Uninitialized
      static System::Xml::XmlTextWriter::NamespaceState _get_Uninitialized();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState Uninitialized
      static void _set_Uninitialized(System::Xml::XmlTextWriter::NamespaceState value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState NotDeclaredButInScope
      static constexpr const int NotDeclaredButInScope = 1;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState NotDeclaredButInScope
      static System::Xml::XmlTextWriter::NamespaceState _get_NotDeclaredButInScope();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState NotDeclaredButInScope
      static void _set_NotDeclaredButInScope(System::Xml::XmlTextWriter::NamespaceState value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState DeclaredButNotWrittenOut
      static constexpr const int DeclaredButNotWrittenOut = 2;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState DeclaredButNotWrittenOut
      static System::Xml::XmlTextWriter::NamespaceState _get_DeclaredButNotWrittenOut();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState DeclaredButNotWrittenOut
      static void _set_DeclaredButNotWrittenOut(System::Xml::XmlTextWriter::NamespaceState value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState DeclaredAndWrittenOut
      static constexpr const int DeclaredAndWrittenOut = 3;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState DeclaredAndWrittenOut
      static System::Xml::XmlTextWriter::NamespaceState _get_DeclaredAndWrittenOut();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.NamespaceState DeclaredAndWrittenOut
      static void _set_DeclaredAndWrittenOut(System::Xml::XmlTextWriter::NamespaceState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XmlTextWriter/System.Xml.NamespaceState
    #pragma pack(pop)
    static check_size<sizeof(XmlTextWriter::NamespaceState), 0 + sizeof(int)> __System_Xml_XmlTextWriter_NamespaceStateSizeCheck;
    static_assert(sizeof(XmlTextWriter::NamespaceState) == 0x4);
    // Size: 0x31
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlTextWriter/System.Xml.TagInfo
    // [TokenAttribute] Offset: FFFFFFFF
    struct TagInfo/*, public System::ValueType*/ {
      public:
      public:
      // System.String name
      // Size: 0x8
      // Offset: 0x0
      ::StringW name;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.String prefix
      // Size: 0x8
      // Offset: 0x8
      ::StringW prefix;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.String defaultNs
      // Size: 0x8
      // Offset: 0x10
      ::StringW defaultNs;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.Xml.XmlTextWriter/System.Xml.NamespaceState defaultNsState
      // Size: 0x4
      // Offset: 0x18
      System::Xml::XmlTextWriter::NamespaceState defaultNsState;
      // Field size check
      static_assert(sizeof(System::Xml::XmlTextWriter::NamespaceState) == 0x4);
      // System.Xml.XmlSpace xmlSpace
      // Size: 0x4
      // Offset: 0x1C
      System::Xml::XmlSpace xmlSpace;
      // Field size check
      static_assert(sizeof(System::Xml::XmlSpace) == 0x4);
      // System.String xmlLang
      // Size: 0x8
      // Offset: 0x20
      ::StringW xmlLang;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.Int32 prevNsTop
      // Size: 0x4
      // Offset: 0x28
      int prevNsTop;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 prefixCount
      // Size: 0x4
      // Offset: 0x2C
      int prefixCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Boolean mixed
      // Size: 0x1
      // Offset: 0x30
      bool mixed;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: TagInfo
      constexpr TagInfo(::StringW name_ = {}, ::StringW prefix_ = {}, ::StringW defaultNs_ = {}, System::Xml::XmlTextWriter::NamespaceState defaultNsState_ = {}, System::Xml::XmlSpace xmlSpace_ = {}, ::StringW xmlLang_ = {}, int prevNsTop_ = {}, int prefixCount_ = {}, bool mixed_ = {}) noexcept : name{name_}, prefix{prefix_}, defaultNs{defaultNs_}, defaultNsState{defaultNsState_}, xmlSpace{xmlSpace_}, xmlLang{xmlLang_}, prevNsTop{prevNsTop_}, prefixCount{prefixCount_}, mixed{mixed_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get instance field reference: System.String name
      ::StringW& dyn_name();
      // Get instance field reference: System.String prefix
      ::StringW& dyn_prefix();
      // Get instance field reference: System.String defaultNs
      ::StringW& dyn_defaultNs();
      // Get instance field reference: System.Xml.XmlTextWriter/System.Xml.NamespaceState defaultNsState
      System::Xml::XmlTextWriter::NamespaceState& dyn_defaultNsState();
      // Get instance field reference: System.Xml.XmlSpace xmlSpace
      System::Xml::XmlSpace& dyn_xmlSpace();
      // Get instance field reference: System.String xmlLang
      ::StringW& dyn_xmlLang();
      // Get instance field reference: System.Int32 prevNsTop
      int& dyn_prevNsTop();
      // Get instance field reference: System.Int32 prefixCount
      int& dyn_prefixCount();
      // Get instance field reference: System.Boolean mixed
      bool& dyn_mixed();
      // System.Void Init(System.Int32 nsTop)
      // Offset: 0x1BAEC94
      void Init(int nsTop);
    }; // System.Xml.XmlTextWriter/System.Xml.TagInfo
    #pragma pack(pop)
    static check_size<sizeof(XmlTextWriter::TagInfo), 48 + sizeof(bool)> __System_Xml_XmlTextWriter_TagInfoSizeCheck;
    static_assert(sizeof(XmlTextWriter::TagInfo) == 0x31);
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlTextWriter/System.Xml.Namespace
    // [TokenAttribute] Offset: FFFFFFFF
    struct Namespace/*, public System::ValueType*/ {
      public:
      public:
      // System.String prefix
      // Size: 0x8
      // Offset: 0x0
      ::StringW prefix;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.String ns
      // Size: 0x8
      // Offset: 0x8
      ::StringW ns;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.Boolean declared
      // Size: 0x1
      // Offset: 0x10
      bool declared;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: declared and: prevNsIndex
      char __padding2[0x3] = {};
      // System.Int32 prevNsIndex
      // Size: 0x4
      // Offset: 0x14
      int prevNsIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Namespace
      constexpr Namespace(::StringW prefix_ = {}, ::StringW ns_ = {}, bool declared_ = {}, int prevNsIndex_ = {}) noexcept : prefix{prefix_}, ns{ns_}, declared{declared_}, prevNsIndex{prevNsIndex_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get instance field reference: System.String prefix
      ::StringW& dyn_prefix();
      // Get instance field reference: System.String ns
      ::StringW& dyn_ns();
      // Get instance field reference: System.Boolean declared
      bool& dyn_declared();
      // Get instance field reference: System.Int32 prevNsIndex
      int& dyn_prevNsIndex();
      // System.Void Set(System.String prefix, System.String ns, System.Boolean declared)
      // Offset: 0x1BB3774
      void Set(::StringW prefix, ::StringW ns, bool declared);
    }; // System.Xml.XmlTextWriter/System.Xml.Namespace
    #pragma pack(pop)
    static check_size<sizeof(XmlTextWriter::Namespace), 20 + sizeof(int)> __System_Xml_XmlTextWriter_NamespaceSizeCheck;
    static_assert(sizeof(XmlTextWriter::Namespace) == 0x18);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlTextWriter/System.Xml.SpecialAttr
    // [TokenAttribute] Offset: FFFFFFFF
    struct SpecialAttr/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SpecialAttr
      constexpr SpecialAttr(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr None
      static constexpr const int None = 0;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr None
      static System::Xml::XmlTextWriter::SpecialAttr _get_None();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr None
      static void _set_None(System::Xml::XmlTextWriter::SpecialAttr value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr XmlSpace
      static constexpr const int XmlSpace = 1;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr XmlSpace
      static System::Xml::XmlTextWriter::SpecialAttr _get_XmlSpace();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr XmlSpace
      static void _set_XmlSpace(System::Xml::XmlTextWriter::SpecialAttr value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr XmlLang
      static constexpr const int XmlLang = 2;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr XmlLang
      static System::Xml::XmlTextWriter::SpecialAttr _get_XmlLang();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr XmlLang
      static void _set_XmlLang(System::Xml::XmlTextWriter::SpecialAttr value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr XmlNs
      static constexpr const int XmlNs = 3;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr XmlNs
      static System::Xml::XmlTextWriter::SpecialAttr _get_XmlNs();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.SpecialAttr XmlNs
      static void _set_XmlNs(System::Xml::XmlTextWriter::SpecialAttr value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XmlTextWriter/System.Xml.SpecialAttr
    #pragma pack(pop)
    static check_size<sizeof(XmlTextWriter::SpecialAttr), 0 + sizeof(int)> __System_Xml_XmlTextWriter_SpecialAttrSizeCheck;
    static_assert(sizeof(XmlTextWriter::SpecialAttr) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlTextWriter/System.Xml.State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State Start
      static constexpr const int Start = 0;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State Start
      static System::Xml::XmlTextWriter::State _get_Start();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State Start
      static void _set_Start(System::Xml::XmlTextWriter::State value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State Prolog
      static constexpr const int Prolog = 1;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State Prolog
      static System::Xml::XmlTextWriter::State _get_Prolog();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State Prolog
      static void _set_Prolog(System::Xml::XmlTextWriter::State value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State PostDTD
      static constexpr const int PostDTD = 2;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State PostDTD
      static System::Xml::XmlTextWriter::State _get_PostDTD();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State PostDTD
      static void _set_PostDTD(System::Xml::XmlTextWriter::State value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State Element
      static constexpr const int Element = 3;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State Element
      static System::Xml::XmlTextWriter::State _get_Element();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State Element
      static void _set_Element(System::Xml::XmlTextWriter::State value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State Attribute
      static constexpr const int Attribute = 4;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State Attribute
      static System::Xml::XmlTextWriter::State _get_Attribute();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State Attribute
      static void _set_Attribute(System::Xml::XmlTextWriter::State value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State Content
      static constexpr const int Content = 5;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State Content
      static System::Xml::XmlTextWriter::State _get_Content();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State Content
      static void _set_Content(System::Xml::XmlTextWriter::State value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State AttrOnly
      static constexpr const int AttrOnly = 6;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State AttrOnly
      static System::Xml::XmlTextWriter::State _get_AttrOnly();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State AttrOnly
      static void _set_AttrOnly(System::Xml::XmlTextWriter::State value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State Epilog
      static constexpr const int Epilog = 7;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State Epilog
      static System::Xml::XmlTextWriter::State _get_Epilog();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State Epilog
      static void _set_Epilog(System::Xml::XmlTextWriter::State value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State Error
      static constexpr const int Error = 8;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State Error
      static System::Xml::XmlTextWriter::State _get_Error();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State Error
      static void _set_Error(System::Xml::XmlTextWriter::State value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.State Closed
      static constexpr const int Closed = 9;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.State Closed
      static System::Xml::XmlTextWriter::State _get_Closed();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.State Closed
      static void _set_Closed(System::Xml::XmlTextWriter::State value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XmlTextWriter/System.Xml.State
    #pragma pack(pop)
    static check_size<sizeof(XmlTextWriter::State), 0 + sizeof(int)> __System_Xml_XmlTextWriter_StateSizeCheck;
    static_assert(sizeof(XmlTextWriter::State) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlTextWriter/System.Xml.Token
    // [TokenAttribute] Offset: FFFFFFFF
    struct Token/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Token
      constexpr Token(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token PI
      static constexpr const int PI = 0;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token PI
      static System::Xml::XmlTextWriter::Token _get_PI();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token PI
      static void _set_PI(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token Doctype
      static constexpr const int Doctype = 1;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token Doctype
      static System::Xml::XmlTextWriter::Token _get_Doctype();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token Doctype
      static void _set_Doctype(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token Comment
      static constexpr const int Comment = 2;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token Comment
      static System::Xml::XmlTextWriter::Token _get_Comment();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token Comment
      static void _set_Comment(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token CData
      static constexpr const int CData = 3;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token CData
      static System::Xml::XmlTextWriter::Token _get_CData();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token CData
      static void _set_CData(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token StartElement
      static constexpr const int StartElement = 4;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token StartElement
      static System::Xml::XmlTextWriter::Token _get_StartElement();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token StartElement
      static void _set_StartElement(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token EndElement
      static constexpr const int EndElement = 5;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token EndElement
      static System::Xml::XmlTextWriter::Token _get_EndElement();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token EndElement
      static void _set_EndElement(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token LongEndElement
      static constexpr const int LongEndElement = 6;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token LongEndElement
      static System::Xml::XmlTextWriter::Token _get_LongEndElement();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token LongEndElement
      static void _set_LongEndElement(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token StartAttribute
      static constexpr const int StartAttribute = 7;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token StartAttribute
      static System::Xml::XmlTextWriter::Token _get_StartAttribute();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token StartAttribute
      static void _set_StartAttribute(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token EndAttribute
      static constexpr const int EndAttribute = 8;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token EndAttribute
      static System::Xml::XmlTextWriter::Token _get_EndAttribute();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token EndAttribute
      static void _set_EndAttribute(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token Content
      static constexpr const int Content = 9;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token Content
      static System::Xml::XmlTextWriter::Token _get_Content();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token Content
      static void _set_Content(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token Base64
      static constexpr const int Base64 = 10;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token Base64
      static System::Xml::XmlTextWriter::Token _get_Base64();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token Base64
      static void _set_Base64(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token RawData
      static constexpr const int RawData = 11;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token RawData
      static System::Xml::XmlTextWriter::Token _get_RawData();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token RawData
      static void _set_RawData(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token Whitespace
      static constexpr const int Whitespace = 12;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token Whitespace
      static System::Xml::XmlTextWriter::Token _get_Whitespace();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token Whitespace
      static void _set_Whitespace(System::Xml::XmlTextWriter::Token value);
      // static field const value: static public System.Xml.XmlTextWriter/System.Xml.Token Empty
      static constexpr const int Empty = 13;
      // Get static field: static public System.Xml.XmlTextWriter/System.Xml.Token Empty
      static System::Xml::XmlTextWriter::Token _get_Empty();
      // Set static field: static public System.Xml.XmlTextWriter/System.Xml.Token Empty
      static void _set_Empty(System::Xml::XmlTextWriter::Token value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XmlTextWriter/System.Xml.Token
    #pragma pack(pop)
    static check_size<sizeof(XmlTextWriter::Token), 0 + sizeof(int)> __System_Xml_XmlTextWriter_TokenSizeCheck;
    static_assert(sizeof(XmlTextWriter::Token) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.IO.TextWriter textWriter
    // Size: 0x8
    // Offset: 0x18
    System::IO::TextWriter* textWriter;
    // Field size check
    static_assert(sizeof(System::IO::TextWriter*) == 0x8);
    // private System.Xml.XmlTextEncoder xmlEncoder
    // Size: 0x8
    // Offset: 0x20
    System::Xml::XmlTextEncoder* xmlEncoder;
    // Field size check
    static_assert(sizeof(System::Xml::XmlTextEncoder*) == 0x8);
    // private System.Text.Encoding encoding
    // Size: 0x8
    // Offset: 0x28
    System::Text::Encoding* encoding;
    // Field size check
    static_assert(sizeof(System::Text::Encoding*) == 0x8);
    // private System.Xml.Formatting formatting
    // Size: 0x4
    // Offset: 0x30
    System::Xml::Formatting formatting;
    // Field size check
    static_assert(sizeof(System::Xml::Formatting) == 0x4);
    // private System.Boolean indented
    // Size: 0x1
    // Offset: 0x34
    bool indented;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: indented and: indentation
    char __padding4[0x3] = {};
    // private System.Int32 indentation
    // Size: 0x4
    // Offset: 0x38
    int indentation;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Char indentChar
    // Size: 0x2
    // Offset: 0x3C
    ::Il2CppChar indentChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // Padding between fields: indentChar and: stack
    char __padding6[0x2] = {};
    // private System.Xml.XmlTextWriter/System.Xml.TagInfo[] stack
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<System::Xml::XmlTextWriter::TagInfo> stack;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Xml::XmlTextWriter::TagInfo>) == 0x8);
    // private System.Int32 top
    // Size: 0x4
    // Offset: 0x48
    int top;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: top and: stateTable
    char __padding8[0x4] = {};
    // private System.Xml.XmlTextWriter/System.Xml.State[] stateTable
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<System::Xml::XmlTextWriter::State> stateTable;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Xml::XmlTextWriter::State>) == 0x8);
    // private System.Xml.XmlTextWriter/System.Xml.State currentState
    // Size: 0x4
    // Offset: 0x58
    System::Xml::XmlTextWriter::State currentState;
    // Field size check
    static_assert(sizeof(System::Xml::XmlTextWriter::State) == 0x4);
    // private System.Xml.XmlTextWriter/System.Xml.Token lastToken
    // Size: 0x4
    // Offset: 0x5C
    System::Xml::XmlTextWriter::Token lastToken;
    // Field size check
    static_assert(sizeof(System::Xml::XmlTextWriter::Token) == 0x4);
    // private System.Xml.XmlTextWriterBase64Encoder base64Encoder
    // Size: 0x8
    // Offset: 0x60
    System::Xml::XmlTextWriterBase64Encoder* base64Encoder;
    // Field size check
    static_assert(sizeof(System::Xml::XmlTextWriterBase64Encoder*) == 0x8);
    // private System.Char quoteChar
    // Size: 0x2
    // Offset: 0x68
    ::Il2CppChar quoteChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // private System.Char curQuoteChar
    // Size: 0x2
    // Offset: 0x6A
    ::Il2CppChar curQuoteChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // private System.Boolean namespaces
    // Size: 0x1
    // Offset: 0x6C
    bool namespaces;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: namespaces and: specialAttr
    char __padding15[0x3] = {};
    // private System.Xml.XmlTextWriter/System.Xml.SpecialAttr specialAttr
    // Size: 0x4
    // Offset: 0x70
    System::Xml::XmlTextWriter::SpecialAttr specialAttr;
    // Field size check
    static_assert(sizeof(System::Xml::XmlTextWriter::SpecialAttr) == 0x4);
    // Padding between fields: specialAttr and: prefixForXmlNs
    char __padding16[0x4] = {};
    // private System.String prefixForXmlNs
    // Size: 0x8
    // Offset: 0x78
    ::StringW prefixForXmlNs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean flush
    // Size: 0x1
    // Offset: 0x80
    bool flush;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: flush and: nsStack
    char __padding18[0x7] = {};
    // private System.Xml.XmlTextWriter/System.Xml.Namespace[] nsStack
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<System::Xml::XmlTextWriter::Namespace> nsStack;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Xml::XmlTextWriter::Namespace>) == 0x8);
    // private System.Int32 nsTop
    // Size: 0x4
    // Offset: 0x90
    int nsTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: nsTop and: nsHashtable
    char __padding20[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> nsHashtable
    // Size: 0x8
    // Offset: 0x98
    System::Collections::Generic::Dictionary_2<::StringW, int>* nsHashtable;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::StringW, int>*) == 0x8);
    // private System.Boolean useNsHashtable
    // Size: 0x1
    // Offset: 0xA0
    bool useNsHashtable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useNsHashtable and: xmlCharType
    char __padding22[0x7] = {};
    // private System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0xA8
    System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(System::Xml::XmlCharType) == 0x8);
    public:
    // Deleting conversion operator: operator ::ArrayW<::Il2CppChar>
    constexpr operator ::ArrayW<::Il2CppChar>() const noexcept = delete;
    // Get static field: static private System.String[] stateName
    static ::ArrayW<::StringW> _get_stateName();
    // Set static field: static private System.String[] stateName
    static void _set_stateName(::ArrayW<::StringW> value);
    // Get static field: static private System.String[] tokenName
    static ::ArrayW<::StringW> _get_tokenName();
    // Set static field: static private System.String[] tokenName
    static void _set_tokenName(::ArrayW<::StringW> value);
    // Get static field: static private readonly System.Xml.XmlTextWriter/System.Xml.State[] stateTableDefault
    static ::ArrayW<System::Xml::XmlTextWriter::State> _get_stateTableDefault();
