// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlRawWriter
#include "System/Xml/XmlRawWriter.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Including type: System.Xml.NewLineHandling
#include "System/Xml/NewLineHandling.hpp"
// Including type: System.Xml.XmlStandalone
#include "System/Xml/XmlStandalone.hpp"
// Including type: System.Xml.XmlOutputMethod
#include "System/Xml/XmlOutputMethod.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlWriterSettings
  class XmlWriterSettings;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x86
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlUtf8RawTextWriter
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlUtf8RawTextWriter : public System::Xml::XmlRawWriter {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private readonly System.Boolean useAsync
    // Size: 0x1
    // Offset: 0x20
    bool useAsync;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useAsync and: bufBytes
    char __padding0[0x7] = {};
    // protected System.Byte[] bufBytes
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<uint8_t> bufBytes;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // protected System.IO.Stream stream
    // Size: 0x8
    // Offset: 0x30
    System::IO::Stream* stream;
    // Field size check
    static_assert(sizeof(System::IO::Stream*) == 0x8);
    // protected System.Text.Encoding encoding
    // Size: 0x8
    // Offset: 0x38
    System::Text::Encoding* encoding;
    // Field size check
    static_assert(sizeof(System::Text::Encoding*) == 0x8);
    // protected System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0x40
    System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(System::Xml::XmlCharType) == 0x8);
    // protected System.Int32 bufPos
    // Size: 0x4
    // Offset: 0x48
    int bufPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 textPos
    // Size: 0x4
    // Offset: 0x4C
    int textPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 contentPos
    // Size: 0x4
    // Offset: 0x50
    int contentPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 cdataPos
    // Size: 0x4
    // Offset: 0x54
    int cdataPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 attrEndPos
    // Size: 0x4
    // Offset: 0x58
    int attrEndPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 bufLen
    // Size: 0x4
    // Offset: 0x5C
    int bufLen;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean writeToNull
    // Size: 0x1
    // Offset: 0x60
    bool writeToNull;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean hadDoubleBracket
    // Size: 0x1
    // Offset: 0x61
    bool hadDoubleBracket;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean inAttributeValue
    // Size: 0x1
    // Offset: 0x62
    bool inAttributeValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inAttributeValue and: newLineHandling
    char __padding13[0x1] = {};
    // protected System.Xml.NewLineHandling newLineHandling
    // Size: 0x4
    // Offset: 0x64
    System::Xml::NewLineHandling newLineHandling;
    // Field size check
    static_assert(sizeof(System::Xml::NewLineHandling) == 0x4);
    // protected System.Boolean closeOutput
    // Size: 0x1
    // Offset: 0x68
    bool closeOutput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean omitXmlDeclaration
    // Size: 0x1
    // Offset: 0x69
    bool omitXmlDeclaration;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: omitXmlDeclaration and: newLineChars
    char __padding16[0x6] = {};
    // protected System.String newLineChars
    // Size: 0x8
    // Offset: 0x70
    ::Il2CppString* newLineChars;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // protected System.Boolean checkCharacters
    // Size: 0x1
    // Offset: 0x78
    bool checkCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: checkCharacters and: standalone
    char __padding18[0x3] = {};
    // protected System.Xml.XmlStandalone standalone
    // Size: 0x4
    // Offset: 0x7C
    System::Xml::XmlStandalone standalone;
    // Field size check
    static_assert(sizeof(System::Xml::XmlStandalone) == 0x4);
    // protected System.Xml.XmlOutputMethod outputMethod
    // Size: 0x4
    // Offset: 0x80
    System::Xml::XmlOutputMethod outputMethod;
    // Field size check
    static_assert(sizeof(System::Xml::XmlOutputMethod) == 0x4);
    // protected System.Boolean autoXmlDeclaration
    // Size: 0x1
    // Offset: 0x84
    bool autoXmlDeclaration;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean mergeCDataSections
    // Size: 0x1
    // Offset: 0x85
    bool mergeCDataSections;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private readonly System.Boolean useAsync
    bool& dyn_useAsync();
    // Get instance field reference: protected System.Byte[] bufBytes
    ::ArrayW<uint8_t>& dyn_bufBytes();
    // Get instance field reference: protected System.IO.Stream stream
    System::IO::Stream*& dyn_stream();
    // Get instance field reference: protected System.Text.Encoding encoding
    System::Text::Encoding*& dyn_encoding();
    // Get instance field reference: protected System.Xml.XmlCharType xmlCharType
    System::Xml::XmlCharType& dyn_xmlCharType();
    // Get instance field reference: protected System.Int32 bufPos
    int& dyn_bufPos();
    // Get instance field reference: protected System.Int32 textPos
    int& dyn_textPos();
    // Get instance field reference: protected System.Int32 contentPos
