// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlReader
#include "System/Xml/XmlReader.hpp"
// Including type: System.Xml.IXmlLineInfo
#include "System/Xml/IXmlLineInfo.hpp"
// Including type: System.Xml.IXmlNamespaceResolver
#include "System/Xml/IXmlNamespaceResolver.hpp"
// Including type: System.Xml.ValidationType
#include "System/Xml/ValidationType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlParserContext
  class XmlParserContext;
  // Forward declaring type: XmlTextReaderImpl
  class XmlTextReaderImpl;
  // Forward declaring type: ReadContentAsBinaryHelper
  class ReadContentAsBinaryHelper;
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: XmlNamespaceScope
  struct XmlNamespaceScope;
  // Forward declaring type: IDtdDefaultAttributeInfo
  class IDtdDefaultAttributeInfo;
  // Forward declaring type: XmlReaderSettings
  class XmlReaderSettings;
  // Forward declaring type: XmlNodeType
  struct XmlNodeType;
  // Forward declaring type: XmlSpace
  struct XmlSpace;
  // Forward declaring type: ReadState
  struct ReadState;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XmlNamespaceManager
  class XmlNamespaceManager;
  // Forward declaring type: IDtdInfo
  class IDtdInfo;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: BaseValidator
  class BaseValidator;
  // Forward declaring type: XmlSchemaCollection
  class XmlSchemaCollection;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: SchemaAttDef
  class SchemaAttDef;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XmlValidatingReaderImpl
  class XmlValidatingReaderImpl;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::XmlValidatingReaderImpl);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::XmlValidatingReaderImpl*, "System.Xml", "XmlValidatingReaderImpl");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlValidatingReaderImpl
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlValidatingReaderImpl : public ::System::Xml::XmlReader/*, public ::System::Xml::IXmlLineInfo, public ::System::Xml::IXmlNamespaceResolver*/ {
    public:
    // Nested type: ::System::Xml::XmlValidatingReaderImpl::ParsingFunction
    struct ParsingFunction;
    // Nested type: ::System::Xml::XmlValidatingReaderImpl::ValidationEventHandling
    class ValidationEventHandling;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction
    // [TokenAttribute] Offset: FFFFFFFF
    struct ParsingFunction/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ParsingFunction
      constexpr ParsingFunction(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction Read
      static constexpr const int Read = 0;
      // Get static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction Read
      static ::System::Xml::XmlValidatingReaderImpl::ParsingFunction _get_Read();
      // Set static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction Read
      static void _set_Read(::System::Xml::XmlValidatingReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction Init
      static constexpr const int Init = 1;
      // Get static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction Init
      static ::System::Xml::XmlValidatingReaderImpl::ParsingFunction _get_Init();
      // Set static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction Init
      static void _set_Init(::System::Xml::XmlValidatingReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction ParseDtdFromContext
      static constexpr const int ParseDtdFromContext = 2;
      // Get static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction ParseDtdFromContext
      static ::System::Xml::XmlValidatingReaderImpl::ParsingFunction _get_ParseDtdFromContext();
      // Set static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction ParseDtdFromContext
      static void _set_ParseDtdFromContext(::System::Xml::XmlValidatingReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction ResolveEntityInternally
      static constexpr const int ResolveEntityInternally = 3;
      // Get static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction ResolveEntityInternally
      static ::System::Xml::XmlValidatingReaderImpl::ParsingFunction _get_ResolveEntityInternally();
      // Set static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction ResolveEntityInternally
      static void _set_ResolveEntityInternally(::System::Xml::XmlValidatingReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction InReadBinaryContent
      static constexpr const int InReadBinaryContent = 4;
      // Get static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction InReadBinaryContent
      static ::System::Xml::XmlValidatingReaderImpl::ParsingFunction _get_InReadBinaryContent();
      // Set static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction InReadBinaryContent
      static void _set_InReadBinaryContent(::System::Xml::XmlValidatingReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction ReaderClosed
      static constexpr const int ReaderClosed = 5;
      // Get static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction ReaderClosed
      static ::System::Xml::XmlValidatingReaderImpl::ParsingFunction _get_ReaderClosed();
      // Set static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction ReaderClosed
      static void _set_ReaderClosed(::System::Xml::XmlValidatingReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction Error
      static constexpr const int Error = 6;
      // Get static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction Error
      static ::System::Xml::XmlValidatingReaderImpl::ParsingFunction _get_Error();
      // Set static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction Error
      static void _set_Error(::System::Xml::XmlValidatingReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction None
      static constexpr const int None = 7;
      // Get static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction None
      static ::System::Xml::XmlValidatingReaderImpl::ParsingFunction _get_None();
      // Set static field: static public System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction None
      static void _set_None(::System::Xml::XmlValidatingReaderImpl::ParsingFunction value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction
    #pragma pack(pop)
    static check_size<sizeof(XmlValidatingReaderImpl::ParsingFunction), 0 + sizeof(int)> __System_Xml_XmlValidatingReaderImpl_ParsingFunctionSizeCheck;
    static_assert(sizeof(XmlValidatingReaderImpl::ParsingFunction) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.XmlReader coreReader
    // Size: 0x8
    // Offset: 0x10
    ::System::Xml::XmlReader* coreReader;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlReader*) == 0x8);
    // private System.Xml.XmlTextReaderImpl coreReaderImpl
    // Size: 0x8
    // Offset: 0x18
    ::System::Xml::XmlTextReaderImpl* coreReaderImpl;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl*) == 0x8);
    // private System.Xml.IXmlNamespaceResolver coreReaderNSResolver
    // Size: 0x8
    // Offset: 0x20
    ::System::Xml::IXmlNamespaceResolver* coreReaderNSResolver;
    // Field size check
    static_assert(sizeof(::System::Xml::IXmlNamespaceResolver*) == 0x8);
    // private System.Xml.ValidationType validationType
    // Size: 0x4
    // Offset: 0x28
    ::System::Xml::ValidationType validationType;
    // Field size check
    static_assert(sizeof(::System::Xml::ValidationType) == 0x4);
    // Padding between fields: validationType and: validator
    char __padding3[0x4] = {};
    // private System.Xml.Schema.BaseValidator validator
    // Size: 0x8
    // Offset: 0x30
    ::System::Xml::Schema::BaseValidator* validator;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::BaseValidator*) == 0x8);
    // private System.Xml.Schema.XmlSchemaCollection schemaCollection
    // Size: 0x8
    // Offset: 0x38
    ::System::Xml::Schema::XmlSchemaCollection* schemaCollection;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaCollection*) == 0x8);
    // private System.Boolean processIdentityConstraints
    // Size: 0x1
    // Offset: 0x40
    bool processIdentityConstraints;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: processIdentityConstraints and: parsingFunction
    char __padding6[0x3] = {};
    // private System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction parsingFunction
    // Size: 0x4
    // Offset: 0x44
    ::System::Xml::XmlValidatingReaderImpl::ParsingFunction parsingFunction;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlValidatingReaderImpl::ParsingFunction) == 0x4);
    // private System.Xml.XmlValidatingReaderImpl/System.Xml.ValidationEventHandling eventHandling
    // Size: 0x8
    // Offset: 0x48
    ::System::Xml::XmlValidatingReaderImpl::ValidationEventHandling* eventHandling;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlValidatingReaderImpl::ValidationEventHandling*) == 0x8);
    // private System.Xml.XmlParserContext parserContext
    // Size: 0x8
    // Offset: 0x50
    ::System::Xml::XmlParserContext* parserContext;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlParserContext*) == 0x8);
    // private System.Xml.ReadContentAsBinaryHelper readBinaryHelper
    // Size: 0x8
    // Offset: 0x58
    ::System::Xml::ReadContentAsBinaryHelper* readBinaryHelper;
    // Field size check
    static_assert(sizeof(::System::Xml::ReadContentAsBinaryHelper*) == 0x8);
    // private System.Xml.XmlReader outerReader
    // Size: 0x8
    // Offset: 0x60
    ::System::Xml::XmlReader* outerReader;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlReader*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::Xml::IXmlLineInfo
    operator ::System::Xml::IXmlLineInfo() noexcept {
      return *reinterpret_cast<::System::Xml::IXmlLineInfo*>(this);
    }
    // Creating interface conversion operator: operator ::System::Xml::IXmlNamespaceResolver
    operator ::System::Xml::IXmlNamespaceResolver() noexcept {
      return *reinterpret_cast<::System::Xml::IXmlNamespaceResolver*>(this);
    }
    // Get static field: static private System.Xml.XmlResolver s_tempResolver
    static ::System::Xml::XmlResolver* _get_s_tempResolver();
    // Set static field: static private System.Xml.XmlResolver s_tempResolver
    static void _set_s_tempResolver(::System::Xml::XmlResolver* value);
    // Get instance field reference: private System.Xml.XmlReader coreReader
    ::System::Xml::XmlReader*& dyn_coreReader();
    // Get instance field reference: private System.Xml.XmlTextReaderImpl coreReaderImpl
    ::System::Xml::XmlTextReaderImpl*& dyn_coreReaderImpl();
    // Get instance field reference: private System.Xml.IXmlNamespaceResolver coreReaderNSResolver
    ::System::Xml::IXmlNamespaceResolver*& dyn_coreReaderNSResolver();
    // Get instance field reference: private System.Xml.ValidationType validationType
    ::System::Xml::ValidationType& dyn_validationType();
    // Get instance field reference: private System.Xml.Schema.BaseValidator validator
    ::System::Xml::Schema::BaseValidator*& dyn_validator();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaCollection schemaCollection
    ::System::Xml::Schema::XmlSchemaCollection*& dyn_schemaCollection();
    // Get instance field reference: private System.Boolean processIdentityConstraints
    bool& dyn_processIdentityConstraints();
    // Get instance field reference: private System.Xml.XmlValidatingReaderImpl/System.Xml.ParsingFunction parsingFunction
    ::System::Xml::XmlValidatingReaderImpl::ParsingFunction& dyn_parsingFunction();
    // Get instance field reference: private System.Xml.XmlValidatingReaderImpl/System.Xml.ValidationEventHandling eventHandling
    ::System::Xml::XmlValidatingReaderImpl::ValidationEventHandling*& dyn_eventHandling();
    // Get instance field reference: private System.Xml.XmlParserContext parserContext
    ::System::Xml::XmlParserContext*& dyn_parserContext();
    // Get instance field reference: private System.Xml.ReadContentAsBinaryHelper readBinaryHelper
    ::System::Xml::ReadContentAsBinaryHelper*& dyn_readBinaryHelper();
    // Get instance field reference: private System.Xml.XmlReader outerReader
    ::System::Xml::XmlReader*& dyn_outerReader();
    // public System.Int32 get_LineNumber()
    // Offset: 0x1BB9688
    int get_LineNumber();
    // public System.Int32 get_LinePosition()
    // Offset: 0x1BB9788
    int get_LinePosition();
    // System.Xml.ValidationType get_ValidationType()
    // Offset: 0x1BB9A24
    ::System::Xml::ValidationType get_ValidationType();
    // System.Xml.Schema.XmlSchemaCollection get_Schemas()
    // Offset: 0x1BB9A2C
    ::System::Xml::Schema::XmlSchemaCollection* get_Schemas();
    // System.Boolean get_Namespaces()
    // Offset: 0x1BB85BC
    bool get_Namespaces();
    // System.Xml.Schema.BaseValidator get_Validator()
    // Offset: 0x1BB9AB4
    ::System::Xml::Schema::BaseValidator* get_Validator();
    // System.Void set_Validator(System.Xml.Schema.BaseValidator value)
    // Offset: 0x1BB9ABC
    void set_Validator(::System::Xml::Schema::BaseValidator* value);
    // System.Boolean get_StandAlone()
    // Offset: 0x1BB9AE8
    bool get_StandAlone();
    // System.Void set_SchemaTypeObject(System.Object value)
    // Offset: 0x1BB9B04
    void set_SchemaTypeObject(::Il2CppObject* value);
    // System.Object get_TypedValueObject()
    // Offset: 0x1BB9B20
    ::Il2CppObject* get_TypedValueObject();
    // System.Void set_TypedValueObject(System.Object value)
    // Offset: 0x1BB9B3C
    void set_TypedValueObject(::Il2CppObject* value);
    // System.Void .ctor(System.Xml.XmlReader reader, System.Xml.Schema.ValidationEventHandler settingsEventHandler, System.Boolean processIdentityConstraints)
    // Offset: 0x1BB85D8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static XmlValidatingReaderImpl* New_ctor(::System::Xml::XmlReader* reader, ::System::Xml::Schema::ValidationEventHandler* settingsEventHandler, bool processIdentityConstraints) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Xml::XmlValidatingReaderImpl::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<XmlValidatingReaderImpl*, creationType>(reader, settingsEventHandler, processIdentityConstraints)));
    }
    // System.Void MoveOffEntityReference()
    // Offset: 0x1BB9580
    void MoveOffEntityReference();
    // public System.Boolean HasLineInfo()
    // Offset: 0x1BB9680
    bool HasLineInfo();
    // private System.Collections.Generic.IDictionary`2<System.String,System.String> System.Xml.IXmlNamespaceResolver.GetNamespacesInScope(System.Xml.XmlNamespaceScope scope)
    // Offset: 0x1BB9888
    ::System::Collections::Generic::IDictionary_2<::StringW, ::StringW>* System_Xml_IXmlNamespaceResolver_GetNamespacesInScope(::System::Xml::XmlNamespaceScope scope);
    // private System.String System.Xml.IXmlNamespaceResolver.LookupNamespace(System.String prefix)
    // Offset: 0x1BB994C
    ::StringW System_Xml_IXmlNamespaceResolver_LookupNamespace(::StringW prefix);
    // private System.String System.Xml.IXmlNamespaceResolver.LookupPrefix(System.String namespaceName)
    // Offset: 0x1BB995C
    ::StringW System_Xml_IXmlNamespaceResolver_LookupPrefix(::StringW namespaceName);
    // System.Collections.Generic.IDictionary`2<System.String,System.String> GetNamespacesInScope(System.Xml.XmlNamespaceScope scope)
    // Offset: 0x1BB988C
    ::System::Collections::Generic::IDictionary_2<::StringW, ::StringW>* GetNamespacesInScope(::System::Xml::XmlNamespaceScope scope);
    // System.String LookupPrefix(System.String namespaceName)
    // Offset: 0x1BB9960
    ::StringW LookupPrefix(::StringW namespaceName);
    // private System.Void ParseDtdFromParserContext()
    // Offset: 0x1BB9270
    void ParseDtdFromParserContext();
    // private System.Void ValidateDtd()
    // Offset: 0x1BB9A34
    void ValidateDtd();
    // private System.Void ResolveEntityInternally()
    // Offset: 0x1BB93E8
    void ResolveEntityInternally();
    // private System.Void SetupValidation(System.Xml.ValidationType valType)
    // Offset: 0x1BB8A44
    void SetupValidation(::System::Xml::ValidationType valType);
    // private System.Xml.XmlResolver GetResolver()
    // Offset: 0x1BB88C8
    ::System::Xml::XmlResolver* GetResolver();
    // private System.Void ProcessCoreReaderEvent()
    // Offset: 0x1BB9174
    void ProcessCoreReaderEvent();
    // System.Boolean AddDefaultAttribute(System.Xml.Schema.SchemaAttDef attdef)
    // Offset: 0x1BB9B58
    bool AddDefaultAttribute(::System::Xml::Schema::SchemaAttDef* attdef);
    // System.Void ValidateDefaultAttributeOnUse(System.Xml.IDtdDefaultAttributeInfo defaultAttribute, System.Xml.XmlTextReaderImpl coreReader)
    // Offset: 0x1BB9B98
    void ValidateDefaultAttributeOnUse(::System::Xml::IDtdDefaultAttributeInfo* defaultAttribute, ::System::Xml::XmlTextReaderImpl* coreReader);
    // public override System.Xml.XmlReaderSettings get_Settings()
    // Offset: 0x1BB8B88
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Xml.XmlReaderSettings XmlReader::get_Settings()
    ::System::Xml::XmlReaderSettings* get_Settings();
    // public override System.Xml.XmlNodeType get_NodeType()
    // Offset: 0x1BB8C60
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Xml.XmlNodeType XmlReader::get_NodeType()
    ::System::Xml::XmlNodeType get_NodeType();
    // public override System.String get_Name()
    // Offset: 0x1BB8C80
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::get_Name()
    ::StringW get_Name();
    // public override System.String get_LocalName()
    // Offset: 0x1BB8CA0
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::get_LocalName()
    ::StringW get_LocalName();
    // public override System.String get_NamespaceURI()
    // Offset: 0x1BB8CC0
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::get_NamespaceURI()
    ::StringW get_NamespaceURI();
    // public override System.String get_Prefix()
    // Offset: 0x1BB8CE0
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::get_Prefix()
    ::StringW get_Prefix();
    // public override System.String get_Value()
    // Offset: 0x1BB8D00
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::get_Value()
    ::StringW get_Value();
    // public override System.Int32 get_Depth()
    // Offset: 0x1BB8D20
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Int32 XmlReader::get_Depth()
    int get_Depth();
    // public override System.String get_BaseURI()
    // Offset: 0x1BB8D40
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::get_BaseURI()
    ::StringW get_BaseURI();
    // public override System.Boolean get_IsEmptyElement()
    // Offset: 0x1BB8D64
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::get_IsEmptyElement()
    bool get_IsEmptyElement();
    // public override System.Boolean get_IsDefault()
    // Offset: 0x1BB8D88
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::get_IsDefault()
    bool get_IsDefault();
    // public override System.Char get_QuoteChar()
    // Offset: 0x1BB8DAC
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Char XmlReader::get_QuoteChar()
    ::Il2CppChar get_QuoteChar();
    // public override System.Xml.XmlSpace get_XmlSpace()
    // Offset: 0x1BB8DD0
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Xml.XmlSpace XmlReader::get_XmlSpace()
    ::System::Xml::XmlSpace get_XmlSpace();
    // public override System.String get_XmlLang()
    // Offset: 0x1BB8DF4
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::get_XmlLang()
    ::StringW get_XmlLang();
    // public override System.Xml.ReadState get_ReadState()
    // Offset: 0x1BB8E18
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Xml.ReadState XmlReader::get_ReadState()
    ::System::Xml::ReadState get_ReadState();
    // public override System.Boolean get_EOF()
    // Offset: 0x1BB8E50
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::get_EOF()
    bool get_EOF();
    // public override System.Xml.XmlNameTable get_NameTable()
    // Offset: 0x1BB8E74
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Xml.XmlNameTable XmlReader::get_NameTable()
    ::System::Xml::XmlNameTable* get_NameTable();
    // public override System.Int32 get_AttributeCount()
    // Offset: 0x1BB8E98
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Int32 XmlReader::get_AttributeCount()
    int get_AttributeCount();
    // public override System.Boolean get_CanResolveEntity()
    // Offset: 0x1BB9544
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::get_CanResolveEntity()
    bool get_CanResolveEntity();
    // override System.Xml.XmlNamespaceManager get_NamespaceManager()
    // Offset: 0x1BB9AC4
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Xml.XmlNamespaceManager XmlReader::get_NamespaceManager()
    ::System::Xml::XmlNamespaceManager* get_NamespaceManager();
    // override System.Xml.IDtdInfo get_DtdInfo()
    // Offset: 0x1BB9B74
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Xml.IDtdInfo XmlReader::get_DtdInfo()
    ::System::Xml::IDtdInfo* get_DtdInfo();
    // public override System.String GetAttribute(System.String name)
    // Offset: 0x1BB8EBC
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::GetAttribute(System.String name)
    ::StringW GetAttribute(::StringW name);
    // public override System.String GetAttribute(System.String localName, System.String namespaceURI)
    // Offset: 0x1BB8EE0
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::GetAttribute(System.String localName, System.String namespaceURI)
    ::StringW GetAttribute(::StringW localName, ::StringW namespaceURI);
    // public override System.String GetAttribute(System.Int32 i)
    // Offset: 0x1BB8F04
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::GetAttribute(System.Int32 i)
    ::StringW GetAttribute(int i);
    // public override System.Boolean MoveToAttribute(System.String name)
    // Offset: 0x1BB8F28
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::MoveToAttribute(System.String name)
    bool MoveToAttribute(::StringW name);
    // public override System.Void MoveToAttribute(System.Int32 i)
    // Offset: 0x1BB8F74
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Void XmlReader::MoveToAttribute(System.Int32 i)
    void MoveToAttribute(int i);
    // public override System.Boolean MoveToFirstAttribute()
    // Offset: 0x1BB8FB0
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::MoveToFirstAttribute()
    bool MoveToFirstAttribute();
    // public override System.Boolean MoveToNextAttribute()
    // Offset: 0x1BB8FFC
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::MoveToNextAttribute()
    bool MoveToNextAttribute();
    // public override System.Boolean MoveToElement()
    // Offset: 0x1BB9048
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::MoveToElement()
    bool MoveToElement();
    // public override System.Boolean Read()
    // Offset: 0x1BB9094
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::Read()
    bool Read();
    // public override System.Void Close()
    // Offset: 0x1BB9474
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Void XmlReader::Close()
    void Close();
    // public override System.String LookupNamespace(System.String prefix)
    // Offset: 0x1BB94B4
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::LookupNamespace(System.String prefix)
    ::StringW LookupNamespace(::StringW prefix);
    // public override System.Boolean ReadAttributeValue()
    // Offset: 0x1BB94D8
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Boolean XmlReader::ReadAttributeValue()
    bool ReadAttributeValue();
    // public override System.Void ResolveEntity()
    // Offset: 0x1BB954C
    // Implemented from: System.Xml.XmlReader
    // Base method: System.Void XmlReader::ResolveEntity()
    void ResolveEntity();
    // public override System.String ReadString()
    // Offset: 0x1BB9658
    // Implemented from: System.Xml.XmlReader
    // Base method: System.String XmlReader::ReadString()
    ::StringW ReadString();
  }; // System.Xml.XmlValidatingReaderImpl
  #pragma pack(pop)
  static check_size<sizeof(XmlValidatingReaderImpl), 96 + sizeof(::System::Xml::XmlReader*)> __System_Xml_XmlValidatingReaderImplSizeCheck;
  static_assert(sizeof(XmlValidatingReaderImpl) == 0x68);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::XmlValidatingReaderImpl::ParsingFunction, "System.Xml", "XmlValidatingReaderImpl/ParsingFunction");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Xml::XmlValidatingReaderImpl::get_LineNumber
// Il2CppName: get_LineNumber
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (System::Xml::XmlValidatingReaderImpl::*)()>(&System::Xml::XmlValidatingReaderImpl::get_LineNumber)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Xml::XmlValidatingReaderImpl*), "get_LineNumber", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Xml::XmlValidatingReaderImpl::get_LinePosition
// Il2CppName: get_LinePosition
template<>
