// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Xml.XmlWriter
#include "System/Xml/XmlWriter.hpp"
// Including type: System.Xml.ConformanceLevel
#include "System/Xml/ConformanceLevel.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: SecureStringHasher
  class SecureStringHasher;
  // Forward declaring type: WriteState
  struct WriteState;
  // Forward declaring type: XmlRawWriter
  class XmlRawWriter;
  // Forward declaring type: IXmlNamespaceResolver
  class IXmlNamespaceResolver;
  // Skipping declaration: State because it is already included!
  // Forward declaring type: XmlWriterSettings
  class XmlWriterSettings;
  // Skipping declaration: SpecialAttribute because it is already included!
  // Forward declaring type: XmlStandalone
  struct XmlStandalone;
  // Forward declaring type: XmlException
  class XmlException;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Autogenerated type: System.Xml.XmlWellFormedWriter
  class XmlWellFormedWriter : public System::Xml::XmlWriter {
    public:
    // Nested type: System::Xml::XmlWellFormedWriter::State
    struct State;
    // Nested type: System::Xml::XmlWellFormedWriter::Token
    struct Token;
    // Nested type: System::Xml::XmlWellFormedWriter::NamespaceResolverProxy
    class NamespaceResolverProxy;
    // Nested type: System::Xml::XmlWellFormedWriter::ElementScope
    struct ElementScope;
    // Nested type: System::Xml::XmlWellFormedWriter::NamespaceKind
    struct NamespaceKind;
    // Nested type: System::Xml::XmlWellFormedWriter::Namespace
    struct Namespace;
    // Nested type: System::Xml::XmlWellFormedWriter::AttrName
    struct AttrName;
    // Nested type: System::Xml::XmlWellFormedWriter::SpecialAttribute
    struct SpecialAttribute;
    // Nested type: System::Xml::XmlWellFormedWriter::AttributeValueCache
    class AttributeValueCache;
    // Autogenerated type: System.Xml.XmlWellFormedWriter/State
    struct State : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Start
      static constexpr const int Start = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Start
      static System::Xml::XmlWellFormedWriter::State _get_Start();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Start
      static void _set_Start(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State TopLevel
      static constexpr const int TopLevel = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State TopLevel
      static System::Xml::XmlWellFormedWriter::State _get_TopLevel();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State TopLevel
      static void _set_TopLevel(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Document
      static constexpr const int Document = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Document
      static System::Xml::XmlWellFormedWriter::State _get_Document();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Document
      static void _set_Document(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Element
      static constexpr const int Element = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Element
      static System::Xml::XmlWellFormedWriter::State _get_Element();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Element
      static void _set_Element(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Content
      static constexpr const int Content = 4;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Content
      static System::Xml::XmlWellFormedWriter::State _get_Content();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Content
      static void _set_Content(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State B64Content
      static constexpr const int B64Content = 5;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State B64Content
      static System::Xml::XmlWellFormedWriter::State _get_B64Content();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State B64Content
      static void _set_B64Content(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State B64Attribute
      static constexpr const int B64Attribute = 6;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State B64Attribute
      static System::Xml::XmlWellFormedWriter::State _get_B64Attribute();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State B64Attribute
      static void _set_B64Attribute(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State AfterRootEle
      static constexpr const int AfterRootEle = 7;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State AfterRootEle
      static System::Xml::XmlWellFormedWriter::State _get_AfterRootEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State AfterRootEle
      static void _set_AfterRootEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Attribute
      static constexpr const int Attribute = 8;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Attribute
      static System::Xml::XmlWellFormedWriter::State _get_Attribute();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Attribute
      static void _set_Attribute(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State SpecialAttr
      static constexpr const int SpecialAttr = 9;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State SpecialAttr
      static System::Xml::XmlWellFormedWriter::State _get_SpecialAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State SpecialAttr
      static void _set_SpecialAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndDocument
      static constexpr const int EndDocument = 10;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndDocument
      static System::Xml::XmlWellFormedWriter::State _get_EndDocument();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndDocument
      static void _set_EndDocument(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State RootLevelAttr
      static constexpr const int RootLevelAttr = 11;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State RootLevelAttr
      static System::Xml::XmlWellFormedWriter::State _get_RootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State RootLevelAttr
      static void _set_RootLevelAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State RootLevelSpecAttr
      static constexpr const int RootLevelSpecAttr = 12;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State RootLevelSpecAttr
      static System::Xml::XmlWellFormedWriter::State _get_RootLevelSpecAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State RootLevelSpecAttr
      static void _set_RootLevelSpecAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State RootLevelB64Attr
      static constexpr const int RootLevelB64Attr = 13;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State RootLevelB64Attr
      static System::Xml::XmlWellFormedWriter::State _get_RootLevelB64Attr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State RootLevelB64Attr
      static void _set_RootLevelB64Attr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State AfterRootLevelAttr
      static constexpr const int AfterRootLevelAttr = 14;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State AfterRootLevelAttr
      static System::Xml::XmlWellFormedWriter::State _get_AfterRootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State AfterRootLevelAttr
      static void _set_AfterRootLevelAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Closed
      static constexpr const int Closed = 15;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Closed
      static System::Xml::XmlWellFormedWriter::State _get_Closed();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Closed
      static void _set_Closed(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Error
      static constexpr const int Error = 16;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Error
      static System::Xml::XmlWellFormedWriter::State _get_Error();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Error
      static void _set_Error(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartContent
      static constexpr const int StartContent = 101;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartContent
      static System::Xml::XmlWellFormedWriter::State _get_StartContent();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartContent
      static void _set_StartContent(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartContentEle
      static constexpr const int StartContentEle = 102;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartContentEle
      static System::Xml::XmlWellFormedWriter::State _get_StartContentEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartContentEle
      static void _set_StartContentEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartContentB64
      static constexpr const int StartContentB64 = 103;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartContentB64
      static System::Xml::XmlWellFormedWriter::State _get_StartContentB64();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartContentB64
      static void _set_StartContentB64(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartDoc
      static constexpr const int StartDoc = 104;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartDoc
      static System::Xml::XmlWellFormedWriter::State _get_StartDoc();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartDoc
      static void _set_StartDoc(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartDocEle
      static constexpr const int StartDocEle = 106;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartDocEle
      static System::Xml::XmlWellFormedWriter::State _get_StartDocEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartDocEle
      static void _set_StartDocEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrSEle
      static constexpr const int EndAttrSEle = 107;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSEle
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrSEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSEle
      static void _set_EndAttrSEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrEEle
      static constexpr const int EndAttrEEle = 108;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrEEle
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrEEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrEEle
      static void _set_EndAttrEEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrSCont
      static constexpr const int EndAttrSCont = 109;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSCont
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrSCont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSCont
      static void _set_EndAttrSCont(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrSAttr
      static constexpr const int EndAttrSAttr = 111;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSAttr
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrSAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSAttr
      static void _set_EndAttrSAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State PostB64Cont
      static constexpr const int PostB64Cont = 112;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State PostB64Cont
      static System::Xml::XmlWellFormedWriter::State _get_PostB64Cont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State PostB64Cont
      static void _set_PostB64Cont(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State PostB64Attr
      static constexpr const int PostB64Attr = 113;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State PostB64Attr
      static System::Xml::XmlWellFormedWriter::State _get_PostB64Attr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State PostB64Attr
      static void _set_PostB64Attr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State PostB64RootAttr
      static constexpr const int PostB64RootAttr = 114;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State PostB64RootAttr
      static System::Xml::XmlWellFormedWriter::State _get_PostB64RootAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State PostB64RootAttr
      static void _set_PostB64RootAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartFragEle
      static constexpr const int StartFragEle = 115;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartFragEle
      static System::Xml::XmlWellFormedWriter::State _get_StartFragEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartFragEle
      static void _set_StartFragEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartFragCont
      static constexpr const int StartFragCont = 116;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartFragCont
      static System::Xml::XmlWellFormedWriter::State _get_StartFragCont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartFragCont
      static void _set_StartFragCont(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartFragB64
      static constexpr const int StartFragB64 = 117;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartFragB64
      static System::Xml::XmlWellFormedWriter::State _get_StartFragB64();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartFragB64
      static void _set_StartFragB64(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartRootLevelAttr
      static constexpr const int StartRootLevelAttr = 118;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartRootLevelAttr
      static System::Xml::XmlWellFormedWriter::State _get_StartRootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartRootLevelAttr
      static void _set_StartRootLevelAttr(System::Xml::XmlWellFormedWriter::State value);
    }; // System.Xml.XmlWellFormedWriter/State
    // Autogenerated type: System.Xml.XmlWellFormedWriter/SpecialAttribute
    struct SpecialAttribute : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: SpecialAttribute
      constexpr SpecialAttribute(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute No
      static constexpr const int No = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute No
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_No();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute No
      static void _set_No(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute DefaultXmlns
      static constexpr const int DefaultXmlns = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute DefaultXmlns
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_DefaultXmlns();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute DefaultXmlns
      static void _set_DefaultXmlns(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute PrefixedXmlns
      static constexpr const int PrefixedXmlns = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute PrefixedXmlns
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_PrefixedXmlns();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute PrefixedXmlns
      static void _set_PrefixedXmlns(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlSpace
      static constexpr const int XmlSpace = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlSpace
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_XmlSpace();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlSpace
      static void _set_XmlSpace(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlLang
      static constexpr const int XmlLang = 4;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlLang
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_XmlLang();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlLang
      static void _set_XmlLang(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
    }; // System.Xml.XmlWellFormedWriter/SpecialAttribute
    // private System.Xml.XmlWriter writer
    // Offset: 0x10
    System::Xml::XmlWriter* writer;
    // private System.Xml.XmlRawWriter rawWriter
    // Offset: 0x18
    System::Xml::XmlRawWriter* rawWriter;
    // private System.Xml.IXmlNamespaceResolver predefinedNamespaces
    // Offset: 0x20
    System::Xml::IXmlNamespaceResolver* predefinedNamespaces;
    // private System.Xml.XmlWellFormedWriter/Namespace[] nsStack
    // Offset: 0x28
    ::Array<System::Xml::XmlWellFormedWriter::Namespace>* nsStack;
    // private System.Int32 nsTop
    // Offset: 0x30
    int nsTop;
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> nsHashtable
    // Offset: 0x38
    System::Collections::Generic::Dictionary_2<::Il2CppString*, int>* nsHashtable;
    // private System.Boolean useNsHashtable
    // Offset: 0x40
    bool useNsHashtable;
    // private System.Xml.XmlWellFormedWriter/ElementScope[] elemScopeStack
    // Offset: 0x48
    ::Array<System::Xml::XmlWellFormedWriter::ElementScope>* elemScopeStack;
    // private System.Int32 elemTop
    // Offset: 0x50
    int elemTop;
    // private System.Xml.XmlWellFormedWriter/AttrName[] attrStack
    // Offset: 0x58
    ::Array<System::Xml::XmlWellFormedWriter::AttrName>* attrStack;
    // private System.Int32 attrCount
    // Offset: 0x60
    int attrCount;
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> attrHashTable
    // Offset: 0x68
    System::Collections::Generic::Dictionary_2<::Il2CppString*, int>* attrHashTable;
    // private System.Xml.XmlWellFormedWriter/SpecialAttribute specAttr
    // Offset: 0x70
    System::Xml::XmlWellFormedWriter::SpecialAttribute specAttr;
    // private System.Xml.XmlWellFormedWriter/AttributeValueCache attrValueCache
    // Offset: 0x78
    System::Xml::XmlWellFormedWriter::AttributeValueCache* attrValueCache;
    // private System.String curDeclPrefix
    // Offset: 0x80
    ::Il2CppString* curDeclPrefix;
    // private System.Xml.XmlWellFormedWriter/State[] stateTable
    // Offset: 0x88
    ::Array<System::Xml::XmlWellFormedWriter::State>* stateTable;
    // private System.Xml.XmlWellFormedWriter/State currentState
    // Offset: 0x90
    System::Xml::XmlWellFormedWriter::State currentState;
    // private System.Boolean checkCharacters
    // Offset: 0x94
    bool checkCharacters;
    // private System.Boolean omitDuplNamespaces
    // Offset: 0x95
    bool omitDuplNamespaces;
    // private System.Boolean writeEndDocumentOnClose
    // Offset: 0x96
    bool writeEndDocumentOnClose;
    // private System.Xml.ConformanceLevel conformanceLevel
    // Offset: 0x98
    System::Xml::ConformanceLevel conformanceLevel;
    // private System.Boolean dtdWritten
    // Offset: 0x9C
    bool dtdWritten;
    // private System.Boolean xmlDeclFollows
    // Offset: 0x9D
    bool xmlDeclFollows;
    // private System.Xml.XmlCharType xmlCharType
    // Offset: 0xA0
    System::Xml::XmlCharType xmlCharType;
    // private System.Xml.SecureStringHasher hasher
    // Offset: 0xA8
    System::Xml::SecureStringHasher* hasher;
    // Get static field: static readonly System.String[] stateName
    static ::Array<::Il2CppString*>* _get_stateName();
    // Set static field: static readonly System.String[] stateName
    static void _set_stateName(::Array<::Il2CppString*>* value);
    // Get static field: static readonly System.String[] tokenName
    static ::Array<::Il2CppString*>* _get_tokenName();
    // Set static field: static readonly System.String[] tokenName
    static void _set_tokenName(::Array<::Il2CppString*>* value);
    // Get static field: static private System.Xml.WriteState[] state2WriteState
    static ::Array<System::Xml::WriteState>* _get_state2WriteState();
    // Set static field: static private System.Xml.WriteState[] state2WriteState
    static void _set_state2WriteState(::Array<System::Xml::WriteState>* value);
    // Get static field: static private readonly System.Xml.XmlWellFormedWriter/State[] StateTableDocument
