// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Xml.XmlWriter
#include "System/Xml/XmlWriter.hpp"
// Including type: System.Xml.ConformanceLevel
#include "System/Xml/ConformanceLevel.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Including type: System.Xml.WriteState
#include "System/Xml/WriteState.hpp"
// Including type: System.Xml.XmlSpace
#include "System/Xml/XmlSpace.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: SecureStringHasher
  class SecureStringHasher;
  // Forward declaring type: XmlStandalone
  struct XmlStandalone;
  // Skipping declaration: NamespaceKind because it is already included!
  // Skipping declaration: SpecialAttribute because it is already included!
  // Forward declaring type: XmlWriterSettings
  class XmlWriterSettings;
  // Forward declaring type: XmlRawWriter
  class XmlRawWriter;
  // Forward declaring type: IXmlNamespaceResolver
  class IXmlNamespaceResolver;
  // Forward declaring type: XmlException
  class XmlException;
  // Skipping declaration: State because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlWellFormedWriter
  class XmlWellFormedWriter : public System::Xml::XmlWriter {
    public:
    // Nested type: System::Xml::XmlWellFormedWriter::State
    struct State;
    // Nested type: System::Xml::XmlWellFormedWriter::Token
    struct Token;
    // Nested type: System::Xml::XmlWellFormedWriter::NamespaceResolverProxy
    class NamespaceResolverProxy;
    // Nested type: System::Xml::XmlWellFormedWriter::ElementScope
    struct ElementScope;
    // Nested type: System::Xml::XmlWellFormedWriter::NamespaceKind
    struct NamespaceKind;
    // Nested type: System::Xml::XmlWellFormedWriter::Namespace
    struct Namespace;
    // Nested type: System::Xml::XmlWellFormedWriter::AttrName
    struct AttrName;
    // Nested type: System::Xml::XmlWellFormedWriter::SpecialAttribute
    struct SpecialAttribute;
    // Nested type: System::Xml::XmlWellFormedWriter::AttributeValueCache
    class AttributeValueCache;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlWellFormedWriter/State
    struct State/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Start
      static constexpr const int Start = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Start
      static System::Xml::XmlWellFormedWriter::State _get_Start();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Start
      static void _set_Start(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State TopLevel
      static constexpr const int TopLevel = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State TopLevel
      static System::Xml::XmlWellFormedWriter::State _get_TopLevel();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State TopLevel
      static void _set_TopLevel(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Document
      static constexpr const int Document = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Document
      static System::Xml::XmlWellFormedWriter::State _get_Document();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Document
      static void _set_Document(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Element
      static constexpr const int Element = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Element
      static System::Xml::XmlWellFormedWriter::State _get_Element();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Element
      static void _set_Element(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Content
      static constexpr const int Content = 4;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Content
      static System::Xml::XmlWellFormedWriter::State _get_Content();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Content
      static void _set_Content(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State B64Content
      static constexpr const int B64Content = 5;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State B64Content
      static System::Xml::XmlWellFormedWriter::State _get_B64Content();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State B64Content
      static void _set_B64Content(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State B64Attribute
      static constexpr const int B64Attribute = 6;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State B64Attribute
      static System::Xml::XmlWellFormedWriter::State _get_B64Attribute();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State B64Attribute
      static void _set_B64Attribute(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State AfterRootEle
      static constexpr const int AfterRootEle = 7;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State AfterRootEle
      static System::Xml::XmlWellFormedWriter::State _get_AfterRootEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State AfterRootEle
      static void _set_AfterRootEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Attribute
      static constexpr const int Attribute = 8;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Attribute
      static System::Xml::XmlWellFormedWriter::State _get_Attribute();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Attribute
      static void _set_Attribute(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State SpecialAttr
      static constexpr const int SpecialAttr = 9;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State SpecialAttr
      static System::Xml::XmlWellFormedWriter::State _get_SpecialAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State SpecialAttr
      static void _set_SpecialAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndDocument
      static constexpr const int EndDocument = 10;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndDocument
      static System::Xml::XmlWellFormedWriter::State _get_EndDocument();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndDocument
      static void _set_EndDocument(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State RootLevelAttr
      static constexpr const int RootLevelAttr = 11;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State RootLevelAttr
      static System::Xml::XmlWellFormedWriter::State _get_RootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State RootLevelAttr
      static void _set_RootLevelAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State RootLevelSpecAttr
      static constexpr const int RootLevelSpecAttr = 12;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State RootLevelSpecAttr
      static System::Xml::XmlWellFormedWriter::State _get_RootLevelSpecAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State RootLevelSpecAttr
      static void _set_RootLevelSpecAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State RootLevelB64Attr
      static constexpr const int RootLevelB64Attr = 13;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State RootLevelB64Attr
      static System::Xml::XmlWellFormedWriter::State _get_RootLevelB64Attr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State RootLevelB64Attr
      static void _set_RootLevelB64Attr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State AfterRootLevelAttr
      static constexpr const int AfterRootLevelAttr = 14;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State AfterRootLevelAttr
      static System::Xml::XmlWellFormedWriter::State _get_AfterRootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State AfterRootLevelAttr
      static void _set_AfterRootLevelAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Closed
      static constexpr const int Closed = 15;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Closed
      static System::Xml::XmlWellFormedWriter::State _get_Closed();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Closed
      static void _set_Closed(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Error
      static constexpr const int Error = 16;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Error
      static System::Xml::XmlWellFormedWriter::State _get_Error();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Error
      static void _set_Error(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartContent
      static constexpr const int StartContent = 101;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartContent
      static System::Xml::XmlWellFormedWriter::State _get_StartContent();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartContent
      static void _set_StartContent(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartContentEle
      static constexpr const int StartContentEle = 102;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartContentEle
      static System::Xml::XmlWellFormedWriter::State _get_StartContentEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartContentEle
      static void _set_StartContentEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartContentB64
      static constexpr const int StartContentB64 = 103;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartContentB64
      static System::Xml::XmlWellFormedWriter::State _get_StartContentB64();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartContentB64
      static void _set_StartContentB64(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartDoc
      static constexpr const int StartDoc = 104;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartDoc
      static System::Xml::XmlWellFormedWriter::State _get_StartDoc();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartDoc
      static void _set_StartDoc(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartDocEle
      static constexpr const int StartDocEle = 106;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartDocEle
      static System::Xml::XmlWellFormedWriter::State _get_StartDocEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartDocEle
      static void _set_StartDocEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrSEle
      static constexpr const int EndAttrSEle = 107;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSEle
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrSEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSEle
      static void _set_EndAttrSEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrEEle
      static constexpr const int EndAttrEEle = 108;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrEEle
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrEEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrEEle
      static void _set_EndAttrEEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrSCont
      static constexpr const int EndAttrSCont = 109;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSCont
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrSCont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSCont
      static void _set_EndAttrSCont(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrSAttr
      static constexpr const int EndAttrSAttr = 111;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSAttr
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrSAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSAttr
      static void _set_EndAttrSAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State PostB64Cont
      static constexpr const int PostB64Cont = 112;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State PostB64Cont
      static System::Xml::XmlWellFormedWriter::State _get_PostB64Cont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State PostB64Cont
      static void _set_PostB64Cont(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State PostB64Attr
      static constexpr const int PostB64Attr = 113;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State PostB64Attr
      static System::Xml::XmlWellFormedWriter::State _get_PostB64Attr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State PostB64Attr
      static void _set_PostB64Attr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State PostB64RootAttr
      static constexpr const int PostB64RootAttr = 114;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State PostB64RootAttr
      static System::Xml::XmlWellFormedWriter::State _get_PostB64RootAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State PostB64RootAttr
      static void _set_PostB64RootAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartFragEle
      static constexpr const int StartFragEle = 115;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartFragEle
      static System::Xml::XmlWellFormedWriter::State _get_StartFragEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartFragEle
      static void _set_StartFragEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartFragCont
      static constexpr const int StartFragCont = 116;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartFragCont
      static System::Xml::XmlWellFormedWriter::State _get_StartFragCont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartFragCont
      static void _set_StartFragCont(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartFragB64
      static constexpr const int StartFragB64 = 117;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartFragB64
      static System::Xml::XmlWellFormedWriter::State _get_StartFragB64();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartFragB64
      static void _set_StartFragB64(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartRootLevelAttr
      static constexpr const int StartRootLevelAttr = 118;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartRootLevelAttr
      static System::Xml::XmlWellFormedWriter::State _get_StartRootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartRootLevelAttr
      static void _set_StartRootLevelAttr(System::Xml::XmlWellFormedWriter::State value);
    }; // System.Xml.XmlWellFormedWriter/State
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::State), 0 + sizeof(int)> __System_Xml_XmlWellFormedWriter_StateSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::State) == 0x4);
    // Size: 0x30
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlWellFormedWriter/ElementScope
    struct ElementScope/*, public System::ValueType*/ {
      public:
      // System.Int32 prevNSTop
      // Size: 0x4
      // Offset: 0x0
      int prevNSTop;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: prevNSTop and: prefix
      char __padding0[0x4] = {};
      // System.String prefix
      // Size: 0x8
      // Offset: 0x8
      ::Il2CppString* prefix;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // System.String localName
      // Size: 0x8
      // Offset: 0x10
      ::Il2CppString* localName;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // System.String namespaceUri
      // Size: 0x8
      // Offset: 0x18
      ::Il2CppString* namespaceUri;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // System.Xml.XmlSpace xmlSpace
      // Size: 0x4
      // Offset: 0x20
      System::Xml::XmlSpace xmlSpace;
      // Field size check
      static_assert(sizeof(System::Xml::XmlSpace) == 0x4);
      // Padding between fields: xmlSpace and: xmlLang
      char __padding4[0x4] = {};
      // System.String xmlLang
      // Size: 0x8
      // Offset: 0x28
      ::Il2CppString* xmlLang;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // Creating value type constructor for type: ElementScope
      constexpr ElementScope(int prevNSTop_ = {}, ::Il2CppString* prefix_ = {}, ::Il2CppString* localName_ = {}, ::Il2CppString* namespaceUri_ = {}, System::Xml::XmlSpace xmlSpace_ = {}, ::Il2CppString* xmlLang_ = {}) noexcept : prevNSTop{prevNSTop_}, prefix{prefix_}, localName{localName_}, namespaceUri{namespaceUri_}, xmlSpace{xmlSpace_}, xmlLang{xmlLang_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // System.Void Set(System.String prefix, System.String localName, System.String namespaceUri, System.Int32 prevNSTop)
      // Offset: 0xF22F2C
      void Set(::Il2CppString* prefix, ::Il2CppString* localName, ::Il2CppString* namespaceUri, int prevNSTop);
      // System.Void WriteEndElement(System.Xml.XmlRawWriter rawWriter)
      // Offset: 0xF22F48
      void WriteEndElement(System::Xml::XmlRawWriter* rawWriter);
      // System.Void WriteFullEndElement(System.Xml.XmlRawWriter rawWriter)
      // Offset: 0xF22F50
      void WriteFullEndElement(System::Xml::XmlRawWriter* rawWriter);
    }; // System.Xml.XmlWellFormedWriter/ElementScope
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::ElementScope), 40 + sizeof(::Il2CppString*)> __System_Xml_XmlWellFormedWriter_ElementScopeSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::ElementScope) == 0x30);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlWellFormedWriter/NamespaceKind
    struct NamespaceKind/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: NamespaceKind
      constexpr NamespaceKind(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/NamespaceKind Written
      static constexpr const int Written = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/NamespaceKind Written
      static System::Xml::XmlWellFormedWriter::NamespaceKind _get_Written();
      // Set static field: static public System.Xml.XmlWellFormedWriter/NamespaceKind Written
      static void _set_Written(System::Xml::XmlWellFormedWriter::NamespaceKind value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/NamespaceKind NeedToWrite
      static constexpr const int NeedToWrite = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/NamespaceKind NeedToWrite
      static System::Xml::XmlWellFormedWriter::NamespaceKind _get_NeedToWrite();
      // Set static field: static public System.Xml.XmlWellFormedWriter/NamespaceKind NeedToWrite
      static void _set_NeedToWrite(System::Xml::XmlWellFormedWriter::NamespaceKind value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/NamespaceKind Implied
      static constexpr const int Implied = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/NamespaceKind Implied
      static System::Xml::XmlWellFormedWriter::NamespaceKind _get_Implied();
      // Set static field: static public System.Xml.XmlWellFormedWriter/NamespaceKind Implied
      static void _set_Implied(System::Xml::XmlWellFormedWriter::NamespaceKind value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/NamespaceKind Special
      static constexpr const int Special = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/NamespaceKind Special
      static System::Xml::XmlWellFormedWriter::NamespaceKind _get_Special();
      // Set static field: static public System.Xml.XmlWellFormedWriter/NamespaceKind Special
      static void _set_Special(System::Xml::XmlWellFormedWriter::NamespaceKind value);
    }; // System.Xml.XmlWellFormedWriter/NamespaceKind
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::NamespaceKind), 0 + sizeof(int)> __System_Xml_XmlWellFormedWriter_NamespaceKindSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::NamespaceKind) == 0x4);
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlWellFormedWriter/Namespace
    struct Namespace/*, public System::ValueType*/ {
      public:
      // System.String prefix
      // Size: 0x8
      // Offset: 0x0
      ::Il2CppString* prefix;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // System.String namespaceUri
      // Size: 0x8
      // Offset: 0x8
      ::Il2CppString* namespaceUri;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // System.Xml.XmlWellFormedWriter/NamespaceKind kind
      // Size: 0x4
      // Offset: 0x10
      System::Xml::XmlWellFormedWriter::NamespaceKind kind;
      // Field size check
      static_assert(sizeof(System::Xml::XmlWellFormedWriter::NamespaceKind) == 0x4);
      // System.Int32 prevNsIndex
      // Size: 0x4
      // Offset: 0x14
      int prevNsIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: Namespace
      constexpr Namespace(::Il2CppString* prefix_ = {}, ::Il2CppString* namespaceUri_ = {}, System::Xml::XmlWellFormedWriter::NamespaceKind kind_ = {}, int prevNsIndex_ = {}) noexcept : prefix{prefix_}, namespaceUri{namespaceUri_}, kind{kind_}, prevNsIndex{prevNsIndex_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // System.Void Set(System.String prefix, System.String namespaceUri, System.Xml.XmlWellFormedWriter/NamespaceKind kind)
      // Offset: 0xF2301C
      void Set(::Il2CppString* prefix, ::Il2CppString* namespaceUri, System::Xml::XmlWellFormedWriter::NamespaceKind kind);
      // System.Void WriteDecl(System.Xml.XmlWriter writer, System.Xml.XmlRawWriter rawWriter)
      // Offset: 0xF2302C
      void WriteDecl(System::Xml::XmlWriter* writer, System::Xml::XmlRawWriter* rawWriter);
    }; // System.Xml.XmlWellFormedWriter/Namespace
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::Namespace), 20 + sizeof(int)> __System_Xml_XmlWellFormedWriter_NamespaceSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::Namespace) == 0x18);
    // Size: 0x1C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlWellFormedWriter/AttrName
    struct AttrName/*, public System::ValueType*/ {
      public:
      // System.String prefix
      // Size: 0x8
      // Offset: 0x0
      ::Il2CppString* prefix;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // System.String namespaceUri
      // Size: 0x8
      // Offset: 0x8
      ::Il2CppString* namespaceUri;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // System.String localName
      // Size: 0x8
      // Offset: 0x10
      ::Il2CppString* localName;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // System.Int32 prev
      // Size: 0x4
      // Offset: 0x18
      int prev;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: AttrName
      constexpr AttrName(::Il2CppString* prefix_ = {}, ::Il2CppString* namespaceUri_ = {}, ::Il2CppString* localName_ = {}, int prev_ = {}) noexcept : prefix{prefix_}, namespaceUri{namespaceUri_}, localName{localName_}, prev{prev_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // System.Void Set(System.String prefix, System.String localName, System.String namespaceUri)
      // Offset: 0xF22E08
      void Set(::Il2CppString* prefix, ::Il2CppString* localName, ::Il2CppString* namespaceUri);
      // System.Boolean IsDuplicate(System.String prefix, System.String localName, System.String namespaceUri)
      // Offset: 0xF22E18
      bool IsDuplicate(::Il2CppString* prefix, ::Il2CppString* localName, ::Il2CppString* namespaceUri);
    }; // System.Xml.XmlWellFormedWriter/AttrName
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::AttrName), 24 + sizeof(int)> __System_Xml_XmlWellFormedWriter_AttrNameSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::AttrName) == 0x1C);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlWellFormedWriter/SpecialAttribute
    struct SpecialAttribute/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: SpecialAttribute
      constexpr SpecialAttribute(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute No
      static constexpr const int No = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute No
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_No();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute No
      static void _set_No(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute DefaultXmlns
      static constexpr const int DefaultXmlns = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute DefaultXmlns
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_DefaultXmlns();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute DefaultXmlns
      static void _set_DefaultXmlns(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute PrefixedXmlns
      static constexpr const int PrefixedXmlns = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute PrefixedXmlns
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_PrefixedXmlns();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute PrefixedXmlns
      static void _set_PrefixedXmlns(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlSpace
      static constexpr const int XmlSpace = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlSpace
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_XmlSpace();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlSpace
      static void _set_XmlSpace(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlLang
      static constexpr const int XmlLang = 4;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlLang
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_XmlLang();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlLang
      static void _set_XmlLang(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
    }; // System.Xml.XmlWellFormedWriter/SpecialAttribute
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::SpecialAttribute), 0 + sizeof(int)> __System_Xml_XmlWellFormedWriter_SpecialAttributeSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::SpecialAttribute) == 0x4);
    // private System.Xml.XmlWriter writer
    // Size: 0x8
    // Offset: 0x10
    System::Xml::XmlWriter* writer;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWriter*) == 0x8);
    // private System.Xml.XmlRawWriter rawWriter
    // Size: 0x8
    // Offset: 0x18
    System::Xml::XmlRawWriter* rawWriter;
    // Field size check
    static_assert(sizeof(System::Xml::XmlRawWriter*) == 0x8);
    // private System.Xml.IXmlNamespaceResolver predefinedNamespaces
    // Size: 0x8
    // Offset: 0x20
    System::Xml::IXmlNamespaceResolver* predefinedNamespaces;
    // Field size check
    static_assert(sizeof(System::Xml::IXmlNamespaceResolver*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/Namespace[] nsStack
    // Size: 0x8
    // Offset: 0x28
    ::Array<System::Xml::XmlWellFormedWriter::Namespace>* nsStack;
    // Field size check
    static_assert(sizeof(::Array<System::Xml::XmlWellFormedWriter::Namespace>*) == 0x8);
    // private System.Int32 nsTop
    // Size: 0x4
    // Offset: 0x30
    int nsTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: nsTop and: nsHashtable
    char __padding4[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> nsHashtable
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Generic::Dictionary_2<::Il2CppString*, int>* nsHashtable;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, int>*) == 0x8);
    // private System.Boolean useNsHashtable
    // Size: 0x1
    // Offset: 0x40
    bool useNsHashtable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useNsHashtable and: elemScopeStack
    char __padding6[0x7] = {};
    // private System.Xml.XmlWellFormedWriter/ElementScope[] elemScopeStack
    // Size: 0x8
    // Offset: 0x48
    ::Array<System::Xml::XmlWellFormedWriter::ElementScope>* elemScopeStack;
    // Field size check
    static_assert(sizeof(::Array<System::Xml::XmlWellFormedWriter::ElementScope>*) == 0x8);
    // private System.Int32 elemTop
    // Size: 0x4
    // Offset: 0x50
    int elemTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: elemTop and: attrStack
    char __padding8[0x4] = {};
    // private System.Xml.XmlWellFormedWriter/AttrName[] attrStack
    // Size: 0x8
    // Offset: 0x58
    ::Array<System::Xml::XmlWellFormedWriter::AttrName>* attrStack;
    // Field size check
    static_assert(sizeof(::Array<System::Xml::XmlWellFormedWriter::AttrName>*) == 0x8);
    // private System.Int32 attrCount
    // Size: 0x4
    // Offset: 0x60
    int attrCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: attrCount and: attrHashTable
    char __padding10[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> attrHashTable
    // Size: 0x8
    // Offset: 0x68
    System::Collections::Generic::Dictionary_2<::Il2CppString*, int>* attrHashTable;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, int>*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/SpecialAttribute specAttr
    // Size: 0x4
    // Offset: 0x70
    System::Xml::XmlWellFormedWriter::SpecialAttribute specAttr;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWellFormedWriter::SpecialAttribute) == 0x4);
    // Padding between fields: specAttr and: attrValueCache
    char __padding12[0x4] = {};
    // private System.Xml.XmlWellFormedWriter/AttributeValueCache attrValueCache
    // Size: 0x8
    // Offset: 0x78
    System::Xml::XmlWellFormedWriter::AttributeValueCache* attrValueCache;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWellFormedWriter::AttributeValueCache*) == 0x8);
    // private System.String curDeclPrefix
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppString* curDeclPrefix;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/State[] stateTable
    // Size: 0x8
    // Offset: 0x88
    ::Array<System::Xml::XmlWellFormedWriter::State>* stateTable;
    // Field size check
    static_assert(sizeof(::Array<System::Xml::XmlWellFormedWriter::State>*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/State currentState
    // Size: 0x4
    // Offset: 0x90
    System::Xml::XmlWellFormedWriter::State currentState;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWellFormedWriter::State) == 0x4);
    // private System.Boolean checkCharacters
    // Size: 0x1
    // Offset: 0x94
    bool checkCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean omitDuplNamespaces
    // Size: 0x1
    // Offset: 0x95
    bool omitDuplNamespaces;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean writeEndDocumentOnClose
    // Size: 0x1
    // Offset: 0x96
    bool writeEndDocumentOnClose;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: writeEndDocumentOnClose and: conformanceLevel
    char __padding19[0x1] = {};
    // private System.Xml.ConformanceLevel conformanceLevel
    // Size: 0x4
    // Offset: 0x98
    System::Xml::ConformanceLevel conformanceLevel;
    // Field size check
    static_assert(sizeof(System::Xml::ConformanceLevel) == 0x4);
    // private System.Boolean dtdWritten
    // Size: 0x1
    // Offset: 0x9C
    bool dtdWritten;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean xmlDeclFollows
    // Size: 0x1
    // Offset: 0x9D
    bool xmlDeclFollows;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: xmlDeclFollows and: xmlCharType
    char __padding22[0x2] = {};
    // private System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0xA0
    System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(System::Xml::XmlCharType) == 0x8);
    // private System.Xml.SecureStringHasher hasher
    // Size: 0x8
    // Offset: 0xA8
    System::Xml::SecureStringHasher* hasher;
    // Field size check
    static_assert(sizeof(System::Xml::SecureStringHasher*) == 0x8);
    // Creating value type constructor for type: XmlWellFormedWriter
