// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// WARNING Layout: Sequential may not be correctly taken into account!
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Xml.XmlWellFormedWriter
#include "System/Xml/XmlWellFormedWriter.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Xml.XmlWellFormedWriter/NamespaceKind
#include "System/Xml/XmlWellFormedWriter_NamespaceKind.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlWriter
  class XmlWriter;
  // Forward declaring type: XmlRawWriter
  class XmlRawWriter;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x18
  // Autogenerated type: System.Xml.XmlWellFormedWriter/Namespace
  // [] Offset: FFFFFFFF
  struct XmlWellFormedWriter::Namespace/*, public System::ValueType*/ {
    public:
    // System.String prefix
    // Size: 0x8
    // Offset: 0x0
    ::Il2CppString* prefix;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.String namespaceUri
    // Size: 0x8
    // Offset: 0x8
    ::Il2CppString* namespaceUri;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.Xml.XmlWellFormedWriter/NamespaceKind kind
    // Size: 0x4
    // Offset: 0x10
    System::Xml::XmlWellFormedWriter::NamespaceKind kind;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWellFormedWriter::NamespaceKind) == 0x4);
    // System.Int32 prevNsIndex
    // Size: 0x4
    // Offset: 0x14
    int prevNsIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: Namespace
    constexpr Namespace(::Il2CppString* prefix_ = {}, ::Il2CppString* namespaceUri_ = {}, System::Xml::XmlWellFormedWriter::NamespaceKind kind_ = {}, int prevNsIndex_ = {}) noexcept : prefix{prefix_}, namespaceUri{namespaceUri_}, kind{kind_}, prevNsIndex{prevNsIndex_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // System.Void Set(System.String prefix, System.String namespaceUri, System.Xml.XmlWellFormedWriter/NamespaceKind kind)
    // Offset: 0xCB7954
    void Set(::Il2CppString* prefix, ::Il2CppString* namespaceUri, System::Xml::XmlWellFormedWriter::NamespaceKind kind);
    // System.Void WriteDecl(System.Xml.XmlWriter writer, System.Xml.XmlRawWriter rawWriter)
    // Offset: 0xCB79A0
    void WriteDecl(System::Xml::XmlWriter* writer, System::Xml::XmlRawWriter* rawWriter);
  }; // System.Xml.XmlWellFormedWriter/Namespace
  static check_size<sizeof(XmlWellFormedWriter::Namespace), 20 + sizeof(int)> __System_Xml_XmlWellFormedWriter_NamespaceSizeCheck;
  static_assert(sizeof(XmlWellFormedWriter::Namespace) == 0x18);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Xml::XmlWellFormedWriter::Namespace, "System.Xml", "XmlWellFormedWriter/Namespace");
#pragma pack(pop)
