// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Xml.XmlWriter
#include "System/Xml/XmlWriter.hpp"
// Including type: System.Xml.ConformanceLevel
#include "System/Xml/ConformanceLevel.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: SecureStringHasher
  class SecureStringHasher;
  // Forward declaring type: WriteState
  struct WriteState;
  // Forward declaring type: XmlRawWriter
  class XmlRawWriter;
  // Forward declaring type: IXmlNamespaceResolver
  class IXmlNamespaceResolver;
  // Skipping declaration: State because it is already included!
  // Forward declaring type: XmlWriterSettings
  class XmlWriterSettings;
  // Skipping declaration: SpecialAttribute because it is already included!
  // Forward declaring type: XmlStandalone
  struct XmlStandalone;
  // Forward declaring type: XmlException
  class XmlException;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0xB0
  // Autogenerated type: System.Xml.XmlWellFormedWriter
  // [] Offset: FFFFFFFF
  class XmlWellFormedWriter : public System::Xml::XmlWriter {
    public:
    // Nested type: System::Xml::XmlWellFormedWriter::State
    struct State;
    // Nested type: System::Xml::XmlWellFormedWriter::Token
    struct Token;
    // Nested type: System::Xml::XmlWellFormedWriter::NamespaceResolverProxy
    class NamespaceResolverProxy;
    // Nested type: System::Xml::XmlWellFormedWriter::ElementScope
    struct ElementScope;
    // Nested type: System::Xml::XmlWellFormedWriter::NamespaceKind
    struct NamespaceKind;
    // Nested type: System::Xml::XmlWellFormedWriter::Namespace
    struct Namespace;
    // Nested type: System::Xml::XmlWellFormedWriter::AttrName
    struct AttrName;
    // Nested type: System::Xml::XmlWellFormedWriter::SpecialAttribute
    struct SpecialAttribute;
    // Nested type: System::Xml::XmlWellFormedWriter::AttributeValueCache
    class AttributeValueCache;
    // Size: 0x4
    // Autogenerated type: System.Xml.XmlWellFormedWriter/State
    // [] Offset: FFFFFFFF
    struct State/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Start
      static constexpr const int Start = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Start
      static System::Xml::XmlWellFormedWriter::State _get_Start();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Start
      static void _set_Start(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State TopLevel
      static constexpr const int TopLevel = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State TopLevel
      static System::Xml::XmlWellFormedWriter::State _get_TopLevel();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State TopLevel
      static void _set_TopLevel(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Document
      static constexpr const int Document = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Document
      static System::Xml::XmlWellFormedWriter::State _get_Document();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Document
      static void _set_Document(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Element
      static constexpr const int Element = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Element
      static System::Xml::XmlWellFormedWriter::State _get_Element();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Element
      static void _set_Element(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Content
      static constexpr const int Content = 4;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Content
      static System::Xml::XmlWellFormedWriter::State _get_Content();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Content
      static void _set_Content(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State B64Content
      static constexpr const int B64Content = 5;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State B64Content
      static System::Xml::XmlWellFormedWriter::State _get_B64Content();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State B64Content
      static void _set_B64Content(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State B64Attribute
      static constexpr const int B64Attribute = 6;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State B64Attribute
      static System::Xml::XmlWellFormedWriter::State _get_B64Attribute();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State B64Attribute
      static void _set_B64Attribute(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State AfterRootEle
      static constexpr const int AfterRootEle = 7;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State AfterRootEle
      static System::Xml::XmlWellFormedWriter::State _get_AfterRootEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State AfterRootEle
      static void _set_AfterRootEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Attribute
      static constexpr const int Attribute = 8;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Attribute
      static System::Xml::XmlWellFormedWriter::State _get_Attribute();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Attribute
      static void _set_Attribute(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State SpecialAttr
      static constexpr const int SpecialAttr = 9;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State SpecialAttr
      static System::Xml::XmlWellFormedWriter::State _get_SpecialAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State SpecialAttr
      static void _set_SpecialAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndDocument
      static constexpr const int EndDocument = 10;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndDocument
      static System::Xml::XmlWellFormedWriter::State _get_EndDocument();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndDocument
      static void _set_EndDocument(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State RootLevelAttr
      static constexpr const int RootLevelAttr = 11;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State RootLevelAttr
      static System::Xml::XmlWellFormedWriter::State _get_RootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State RootLevelAttr
      static void _set_RootLevelAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State RootLevelSpecAttr
      static constexpr const int RootLevelSpecAttr = 12;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State RootLevelSpecAttr
      static System::Xml::XmlWellFormedWriter::State _get_RootLevelSpecAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State RootLevelSpecAttr
      static void _set_RootLevelSpecAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State RootLevelB64Attr
      static constexpr const int RootLevelB64Attr = 13;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State RootLevelB64Attr
      static System::Xml::XmlWellFormedWriter::State _get_RootLevelB64Attr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State RootLevelB64Attr
      static void _set_RootLevelB64Attr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State AfterRootLevelAttr
      static constexpr const int AfterRootLevelAttr = 14;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State AfterRootLevelAttr
      static System::Xml::XmlWellFormedWriter::State _get_AfterRootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State AfterRootLevelAttr
      static void _set_AfterRootLevelAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Closed
      static constexpr const int Closed = 15;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Closed
      static System::Xml::XmlWellFormedWriter::State _get_Closed();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Closed
      static void _set_Closed(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State Error
      static constexpr const int Error = 16;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State Error
      static System::Xml::XmlWellFormedWriter::State _get_Error();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State Error
      static void _set_Error(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartContent
      static constexpr const int StartContent = 101;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartContent
      static System::Xml::XmlWellFormedWriter::State _get_StartContent();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartContent
      static void _set_StartContent(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartContentEle
      static constexpr const int StartContentEle = 102;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartContentEle
      static System::Xml::XmlWellFormedWriter::State _get_StartContentEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartContentEle
      static void _set_StartContentEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartContentB64
      static constexpr const int StartContentB64 = 103;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartContentB64
      static System::Xml::XmlWellFormedWriter::State _get_StartContentB64();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartContentB64
      static void _set_StartContentB64(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartDoc
      static constexpr const int StartDoc = 104;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartDoc
      static System::Xml::XmlWellFormedWriter::State _get_StartDoc();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartDoc
      static void _set_StartDoc(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartDocEle
      static constexpr const int StartDocEle = 106;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartDocEle
      static System::Xml::XmlWellFormedWriter::State _get_StartDocEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartDocEle
      static void _set_StartDocEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrSEle
      static constexpr const int EndAttrSEle = 107;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSEle
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrSEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSEle
      static void _set_EndAttrSEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrEEle
      static constexpr const int EndAttrEEle = 108;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrEEle
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrEEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrEEle
      static void _set_EndAttrEEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrSCont
      static constexpr const int EndAttrSCont = 109;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSCont
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrSCont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSCont
      static void _set_EndAttrSCont(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State EndAttrSAttr
      static constexpr const int EndAttrSAttr = 111;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSAttr
      static System::Xml::XmlWellFormedWriter::State _get_EndAttrSAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State EndAttrSAttr
      static void _set_EndAttrSAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State PostB64Cont
      static constexpr const int PostB64Cont = 112;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State PostB64Cont
      static System::Xml::XmlWellFormedWriter::State _get_PostB64Cont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State PostB64Cont
      static void _set_PostB64Cont(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State PostB64Attr
      static constexpr const int PostB64Attr = 113;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State PostB64Attr
      static System::Xml::XmlWellFormedWriter::State _get_PostB64Attr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State PostB64Attr
      static void _set_PostB64Attr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State PostB64RootAttr
      static constexpr const int PostB64RootAttr = 114;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State PostB64RootAttr
      static System::Xml::XmlWellFormedWriter::State _get_PostB64RootAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State PostB64RootAttr
      static void _set_PostB64RootAttr(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartFragEle
      static constexpr const int StartFragEle = 115;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartFragEle
      static System::Xml::XmlWellFormedWriter::State _get_StartFragEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartFragEle
      static void _set_StartFragEle(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartFragCont
      static constexpr const int StartFragCont = 116;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartFragCont
      static System::Xml::XmlWellFormedWriter::State _get_StartFragCont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartFragCont
      static void _set_StartFragCont(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartFragB64
      static constexpr const int StartFragB64 = 117;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartFragB64
      static System::Xml::XmlWellFormedWriter::State _get_StartFragB64();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartFragB64
      static void _set_StartFragB64(System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/State StartRootLevelAttr
      static constexpr const int StartRootLevelAttr = 118;
      // Get static field: static public System.Xml.XmlWellFormedWriter/State StartRootLevelAttr
      static System::Xml::XmlWellFormedWriter::State _get_StartRootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/State StartRootLevelAttr
      static void _set_StartRootLevelAttr(System::Xml::XmlWellFormedWriter::State value);
    }; // System.Xml.XmlWellFormedWriter/State
    static check_size<sizeof(XmlWellFormedWriter::State), 0 + sizeof(int)> __System_Xml_XmlWellFormedWriter_StateSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::State) == 0x4);
    // Size: 0x4
    // Autogenerated type: System.Xml.XmlWellFormedWriter/SpecialAttribute
    // [] Offset: FFFFFFFF
    struct SpecialAttribute/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: SpecialAttribute
      constexpr SpecialAttribute(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute No
      static constexpr const int No = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute No
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_No();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute No
      static void _set_No(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute DefaultXmlns
      static constexpr const int DefaultXmlns = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute DefaultXmlns
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_DefaultXmlns();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute DefaultXmlns
      static void _set_DefaultXmlns(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute PrefixedXmlns
      static constexpr const int PrefixedXmlns = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute PrefixedXmlns
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_PrefixedXmlns();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute PrefixedXmlns
      static void _set_PrefixedXmlns(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlSpace
      static constexpr const int XmlSpace = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlSpace
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_XmlSpace();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlSpace
      static void _set_XmlSpace(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlLang
      static constexpr const int XmlLang = 4;
      // Get static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlLang
      static System::Xml::XmlWellFormedWriter::SpecialAttribute _get_XmlLang();
      // Set static field: static public System.Xml.XmlWellFormedWriter/SpecialAttribute XmlLang
      static void _set_XmlLang(System::Xml::XmlWellFormedWriter::SpecialAttribute value);
    }; // System.Xml.XmlWellFormedWriter/SpecialAttribute
    static check_size<sizeof(XmlWellFormedWriter::SpecialAttribute), 0 + sizeof(int)> __System_Xml_XmlWellFormedWriter_SpecialAttributeSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::SpecialAttribute) == 0x4);
    // private System.Xml.XmlWriter writer
    // Size: 0x8
    // Offset: 0x10
    System::Xml::XmlWriter* writer;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWriter*) == 0x8);
    // private System.Xml.XmlRawWriter rawWriter
    // Size: 0x8
    // Offset: 0x18
    System::Xml::XmlRawWriter* rawWriter;
    // Field size check
    static_assert(sizeof(System::Xml::XmlRawWriter*) == 0x8);
    // private System.Xml.IXmlNamespaceResolver predefinedNamespaces
    // Size: 0x8
    // Offset: 0x20
    System::Xml::IXmlNamespaceResolver* predefinedNamespaces;
    // Field size check
    static_assert(sizeof(System::Xml::IXmlNamespaceResolver*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/Namespace[] nsStack
    // Size: 0x8
    // Offset: 0x28
    ::Array<System::Xml::XmlWellFormedWriter::Namespace>* nsStack;
    // Field size check
    static_assert(sizeof(::Array<System::Xml::XmlWellFormedWriter::Namespace>*) == 0x8);
    // private System.Int32 nsTop
    // Size: 0x4
    // Offset: 0x30
    int nsTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: nsTop and: nsHashtable
    char __padding4[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> nsHashtable
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Generic::Dictionary_2<::Il2CppString*, int>* nsHashtable;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, int>*) == 0x8);
    // private System.Boolean useNsHashtable
    // Size: 0x1
    // Offset: 0x40
    bool useNsHashtable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useNsHashtable and: elemScopeStack
    char __padding6[0x7] = {};
    // private System.Xml.XmlWellFormedWriter/ElementScope[] elemScopeStack
    // Size: 0x8
    // Offset: 0x48
    ::Array<System::Xml::XmlWellFormedWriter::ElementScope>* elemScopeStack;
    // Field size check
    static_assert(sizeof(::Array<System::Xml::XmlWellFormedWriter::ElementScope>*) == 0x8);
    // private System.Int32 elemTop
    // Size: 0x4
    // Offset: 0x50
    int elemTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: elemTop and: attrStack
    char __padding8[0x4] = {};
    // private System.Xml.XmlWellFormedWriter/AttrName[] attrStack
    // Size: 0x8
    // Offset: 0x58
    ::Array<System::Xml::XmlWellFormedWriter::AttrName>* attrStack;
    // Field size check
    static_assert(sizeof(::Array<System::Xml::XmlWellFormedWriter::AttrName>*) == 0x8);
    // private System.Int32 attrCount
    // Size: 0x4
    // Offset: 0x60
    int attrCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: attrCount and: attrHashTable
    char __padding10[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> attrHashTable
    // Size: 0x8
    // Offset: 0x68
    System::Collections::Generic::Dictionary_2<::Il2CppString*, int>* attrHashTable;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, int>*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/SpecialAttribute specAttr
    // Size: 0x4
    // Offset: 0x70
    System::Xml::XmlWellFormedWriter::SpecialAttribute specAttr;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWellFormedWriter::SpecialAttribute) == 0x4);
    // Padding between fields: specAttr and: attrValueCache
    char __padding12[0x4] = {};
    // private System.Xml.XmlWellFormedWriter/AttributeValueCache attrValueCache
    // Size: 0x8
    // Offset: 0x78
    System::Xml::XmlWellFormedWriter::AttributeValueCache* attrValueCache;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWellFormedWriter::AttributeValueCache*) == 0x8);
    // private System.String curDeclPrefix
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppString* curDeclPrefix;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/State[] stateTable
    // Size: 0x8
    // Offset: 0x88
    ::Array<System::Xml::XmlWellFormedWriter::State>* stateTable;
    // Field size check
    static_assert(sizeof(::Array<System::Xml::XmlWellFormedWriter::State>*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/State currentState
    // Size: 0x4
    // Offset: 0x90
    System::Xml::XmlWellFormedWriter::State currentState;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWellFormedWriter::State) == 0x4);
    // private System.Boolean checkCharacters
    // Size: 0x1
    // Offset: 0x94
    bool checkCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean omitDuplNamespaces
    // Size: 0x1
    // Offset: 0x95
    bool omitDuplNamespaces;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean writeEndDocumentOnClose
    // Size: 0x1
    // Offset: 0x96
    bool writeEndDocumentOnClose;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: writeEndDocumentOnClose and: conformanceLevel
    char __padding19[0x1] = {};
    // private System.Xml.ConformanceLevel conformanceLevel
    // Size: 0x4
    // Offset: 0x98
    System::Xml::ConformanceLevel conformanceLevel;
    // Field size check
    static_assert(sizeof(System::Xml::ConformanceLevel) == 0x4);
    // private System.Boolean dtdWritten
    // Size: 0x1
    // Offset: 0x9C
    bool dtdWritten;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean xmlDeclFollows
    // Size: 0x1
    // Offset: 0x9D
    bool xmlDeclFollows;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: xmlDeclFollows and: xmlCharType
    char __padding22[0x2] = {};
    // private System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0xA0
    System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(System::Xml::XmlCharType) == 0x8);
    // private System.Xml.SecureStringHasher hasher
    // Size: 0x8
    // Offset: 0xA8
    System::Xml::SecureStringHasher* hasher;
    // Field size check
    static_assert(sizeof(System::Xml::SecureStringHasher*) == 0x8);
    // Creating value type constructor for type: XmlWellFormedWriter
    XmlWellFormedWriter(System::Xml::XmlWriter* writer_ = {}, System::Xml::XmlRawWriter* rawWriter_ = {}, System::Xml::IXmlNamespaceResolver* predefinedNamespaces_ = {}, ::Array<System::Xml::XmlWellFormedWriter::Namespace>* nsStack_ = {}, int nsTop_ = {}, System::Collections::Generic::Dictionary_2<::Il2CppString*, int>* nsHashtable_ = {}, bool useNsHashtable_ = {}, ::Array<System::Xml::XmlWellFormedWriter::ElementScope>* elemScopeStack_ = {}, int elemTop_ = {}, ::Array<System::Xml::XmlWellFormedWriter::AttrName>* attrStack_ = {}, int attrCount_ = {}, System::Collections::Generic::Dictionary_2<::Il2CppString*, int>* attrHashTable_ = {}, System::Xml::XmlWellFormedWriter::SpecialAttribute specAttr_ = {}, System::Xml::XmlWellFormedWriter::AttributeValueCache* attrValueCache_ = {}, ::Il2CppString* curDeclPrefix_ = {}, ::Array<System::Xml::XmlWellFormedWriter::State>* stateTable_ = {}, System::Xml::XmlWellFormedWriter::State currentState_ = {}, bool checkCharacters_ = {}, bool omitDuplNamespaces_ = {}, bool writeEndDocumentOnClose_ = {}, System::Xml::ConformanceLevel conformanceLevel_ = {}, bool dtdWritten_ = {}, bool xmlDeclFollows_ = {}, System::Xml::XmlCharType xmlCharType_ = {}, System::Xml::SecureStringHasher* hasher_ = {}) noexcept : writer{writer_}, rawWriter{rawWriter_}, predefinedNamespaces{predefinedNamespaces_}, nsStack{nsStack_}, nsTop{nsTop_}, nsHashtable{nsHashtable_}, useNsHashtable{useNsHashtable_}, elemScopeStack{elemScopeStack_}, elemTop{elemTop_}, attrStack{attrStack_}, attrCount{attrCount_}, attrHashTable{attrHashTable_}, specAttr{specAttr_}, attrValueCache{attrValueCache_}, curDeclPrefix{curDeclPrefix_}, stateTable{stateTable_}, currentState{currentState_}, checkCharacters{checkCharacters_}, omitDuplNamespaces{omitDuplNamespaces_}, writeEndDocumentOnClose{writeEndDocumentOnClose_}, conformanceLevel{conformanceLevel_}, dtdWritten{dtdWritten_}, xmlDeclFollows{xmlDeclFollows_}, xmlCharType{xmlCharType_}, hasher{hasher_} {}
    // Get static field: static readonly System.String[] stateName
    static ::Array<::Il2CppString*>* _get_stateName();
    // Set static field: static readonly System.String[] stateName
    static void _set_stateName(::Array<::Il2CppString*>* value);
    // Get static field: static readonly System.String[] tokenName
    static ::Array<::Il2CppString*>* _get_tokenName();
    // Set static field: static readonly System.String[] tokenName
    static void _set_tokenName(::Array<::Il2CppString*>* value);
    // Get static field: static private System.Xml.WriteState[] state2WriteState
    static ::Array<System::Xml::WriteState>* _get_state2WriteState();
    // Set static field: static private System.Xml.WriteState[] state2WriteState
    static void _set_state2WriteState(::Array<System::Xml::WriteState>* value);
    // Get static field: static private readonly System.Xml.XmlWellFormedWriter/State[] StateTableDocument
    static ::Array<System::Xml::XmlWellFormedWriter::State>* _get_StateTableDocument();
    // Set static field: static private readonly System.Xml.XmlWellFormedWriter/State[] StateTableDocument
    static void _set_StateTableDocument(::Array<System::Xml::XmlWellFormedWriter::State>* value);
    // Get static field: static private readonly System.Xml.XmlWellFormedWriter/State[] StateTableAuto
    static ::Array<System::Xml::XmlWellFormedWriter::State>* _get_StateTableAuto();
    // Set static field: static private readonly System.Xml.XmlWellFormedWriter/State[] StateTableAuto
    static void _set_StateTableAuto(::Array<System::Xml::XmlWellFormedWriter::State>* value);
    // System.Void .ctor(System.Xml.XmlWriter writer, System.Xml.XmlWriterSettings settings)
    // Offset: 0x14F2718
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static XmlWellFormedWriter* New_ctor(System::Xml::XmlWriter* writer, System::Xml::XmlWriterSettings* settings) {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Xml").WithContext("XmlWellFormedWriter").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<XmlWellFormedWriter*, creationType>(writer, settings)));
    }
    // System.Xml.XmlRawWriter get_RawWriter()
    // Offset: 0x14F7B90
    System::Xml::XmlRawWriter* get_RawWriter();
    // private System.Boolean get_SaveAttrValue()
    // Offset: 0x14F63F4
    bool get_SaveAttrValue();
    // private System.Boolean get_InBase64()
    // Offset: 0x14F7534
    bool get_InBase64();
    // private System.Void SetSpecialAttribute(System.Xml.XmlWellFormedWriter/SpecialAttribute special)
    // Offset: 0x14F4B6C
    void SetSpecialAttribute(System::Xml::XmlWellFormedWriter::SpecialAttribute special);
    // private System.Void WriteStartDocumentImpl(System.Xml.XmlStandalone standalone)
    // Offset: 0x14F2C3C
    void WriteStartDocumentImpl(System::Xml::XmlStandalone standalone);
    // private System.Void StartFragment()
    // Offset: 0x14F7B98
    void StartFragment();
    // private System.Void PushNamespaceImplicit(System.String prefix, System.String ns)
    // Offset: 0x14F3BCC
    void PushNamespaceImplicit(::Il2CppString* prefix, ::Il2CppString* ns);
    // private System.Boolean PushNamespaceExplicit(System.String prefix, System.String ns)
    // Offset: 0x14F58FC
    bool PushNamespaceExplicit(::Il2CppString* prefix, ::Il2CppString* ns);
    // private System.Void AddNamespace(System.String prefix, System.String ns, System.Xml.XmlWellFormedWriter/NamespaceKind kind)
    // Offset: 0x14F7CA4
    void AddNamespace(::Il2CppString* prefix, ::Il2CppString* ns, System::Xml::XmlWellFormedWriter::NamespaceKind kind);
    // private System.Void AddToNamespaceHashtable(System.Int32 namespaceIndex)
    // Offset: 0x14F7F48
    void AddToNamespaceHashtable(int namespaceIndex);
    // private System.Int32 LookupNamespaceIndex(System.String prefix)
    // Offset: 0x14F7BA4
    int LookupNamespaceIndex(::Il2CppString* prefix);
    // private System.Void PopNamespaces(System.Int32 indexFrom, System.Int32 indexTo)
    // Offset: 0x14F41F4
    void PopNamespaces(int indexFrom, int indexTo);
    // static private System.Xml.XmlException DupAttrException(System.String prefix, System.String localName)
    // Offset: 0x14F7E4C
    static System::Xml::XmlException* DupAttrException(::Il2CppString* prefix, ::Il2CppString* localName);
    // private System.Void AdvanceState(System.Xml.XmlWellFormedWriter/Token token)
    // Offset: 0x14F3248
    void AdvanceState(System::Xml::XmlWellFormedWriter::Token token);
    // private System.Void StartElementContent()
    // Offset: 0x14F82E0
    void StartElementContent();
    // static private System.String GetStateName(System.Xml.XmlWellFormedWriter/State state)
    // Offset: 0x14F803C
    static ::Il2CppString* GetStateName(System::Xml::XmlWellFormedWriter::State state);
    // System.String LookupNamespace(System.String prefix)
    // Offset: 0x14F3A68
    ::Il2CppString* LookupNamespace(::Il2CppString* prefix);
    // private System.String LookupLocalNamespace(System.String prefix)
    // Offset: 0x14F4D60
    ::Il2CppString* LookupLocalNamespace(::Il2CppString* prefix);
    // private System.String GeneratePrefix()
    // Offset: 0x14F4C20
    ::Il2CppString* GeneratePrefix();
    // private System.Void CheckNCName(System.String ncname)
    // Offset: 0x14F3914
    void CheckNCName(::Il2CppString* ncname);
    // static private System.Exception InvalidCharsException(System.String name, System.Int32 badCharIndex)
    // Offset: 0x14F83B8
    static System::Exception* InvalidCharsException(::Il2CppString* name, int badCharIndex);
    // private System.Void ThrowInvalidStateTransition(System.Xml.XmlWellFormedWriter/Token token, System.Xml.XmlWellFormedWriter/State currentState)
    // Offset: 0x14F80E8
    void ThrowInvalidStateTransition(System::Xml::XmlWellFormedWriter::Token token, System::Xml::XmlWellFormedWriter::State currentState);
    // private System.Boolean get_IsClosedOrErrorState()
    // Offset: 0x14F7B80
    bool get_IsClosedOrErrorState();
    // private System.Void AddAttribute(System.String prefix, System.String localName, System.String namespaceName)
    // Offset: 0x14F4E3C
    void AddAttribute(::Il2CppString* prefix, ::Il2CppString* localName, ::Il2CppString* namespaceName);
    // private System.Void AddToAttrHashTable(System.Int32 attributeIndex)
    // Offset: 0x14F8548
    void AddToAttrHashTable(int attributeIndex);
    // static private System.Void .cctor()
    // Offset: 0x14F8690
    static void _cctor();
    // public override System.Xml.WriteState get_WriteState()
    // Offset: 0x14F2B88
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Xml.WriteState XmlWriter::get_WriteState()
    System::Xml::WriteState get_WriteState();
    // public override System.Void WriteStartDocument()
    // Offset: 0x14F2C34
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteStartDocument()
    void WriteStartDocument();
    // public override System.Void WriteDocType(System.String name, System.String pubid, System.String sysid, System.String subset)
    // Offset: 0x14F2DFC
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteDocType(System.String name, System.String pubid, System.String sysid, System.String subset)
    void WriteDocType(::Il2CppString* name, ::Il2CppString* pubid, ::Il2CppString* sysid, ::Il2CppString* subset);
    // public override System.Void WriteStartElement(System.String prefix, System.String localName, System.String ns)
    // Offset: 0x14F3574
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteStartElement(System.String prefix, System.String localName, System.String ns)
    void WriteStartElement(::Il2CppString* prefix, ::Il2CppString* localName, ::Il2CppString* ns);
    // public override System.Void WriteEndElement()
    // Offset: 0x14F3FCC
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteEndElement()
    void WriteEndElement();
    // public override System.Void WriteFullEndElement()
    // Offset: 0x14F42CC
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteFullEndElement()
    void WriteFullEndElement();
    // public override System.Void WriteStartAttribute(System.String prefix, System.String localName, System.String namespaceName)
    // Offset: 0x14F44F4
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteStartAttribute(System.String prefix, System.String localName, System.String namespaceName)
    void WriteStartAttribute(::Il2CppString* prefix, ::Il2CppString* localName, ::Il2CppString* namespaceName);
    // public override System.Void WriteEndAttribute()
    // Offset: 0x14F50E0
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteEndAttribute()
    void WriteEndAttribute();
    // public override System.Void WriteCData(System.String text)
    // Offset: 0x14F5DB8
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteCData(System.String text)
    void WriteCData(::Il2CppString* text);
    // public override System.Void WriteComment(System.String text)
    // Offset: 0x14F5ED0
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteComment(System.String text)
    void WriteComment(::Il2CppString* text);
    // public override System.Void WriteProcessingInstruction(System.String name, System.String text)
    // Offset: 0x14F5FEC
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteProcessingInstruction(System.String name, System.String text)
    void WriteProcessingInstruction(::Il2CppString* name, ::Il2CppString* text);
    // public override System.Void WriteEntityRef(System.String name)
    // Offset: 0x14F626C
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteEntityRef(System.String name)
    void WriteEntityRef(::Il2CppString* name);
    // public override System.Void WriteCharEntity(System.Char ch)
    // Offset: 0x14F6404
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteCharEntity(System.Char ch)
    void WriteCharEntity(::Il2CppChar ch);
    // public override System.Void WriteSurrogateCharEntity(System.Char lowChar, System.Char highChar)
    // Offset: 0x14F65AC
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteSurrogateCharEntity(System.Char lowChar, System.Char highChar)
    void WriteSurrogateCharEntity(::Il2CppChar lowChar, ::Il2CppChar highChar);
    // public override System.Void WriteWhitespace(System.String ws)
    // Offset: 0x14F6764
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteWhitespace(System.String ws)
    void WriteWhitespace(::Il2CppString* ws);
    // public override System.Void WriteString(System.String text)
    // Offset: 0x14F6914
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteString(System.String text)
    void WriteString(::Il2CppString* text);
    // public override System.Void WriteChars(System.Char[] buffer, System.Int32 index, System.Int32 count)
    // Offset: 0x14F6A44
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteChars(System.Char[] buffer, System.Int32 index, System.Int32 count)
    void WriteChars(::Array<::Il2CppChar>* buffer, int index, int count);
    // public override System.Void WriteRaw(System.Char[] buffer, System.Int32 index, System.Int32 count)
    // Offset: 0x14F6CAC
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteRaw(System.Char[] buffer, System.Int32 index, System.Int32 count)
    void WriteRaw(::Array<::Il2CppChar>* buffer, int index, int count);
    // public override System.Void WriteRaw(System.String data)
    // Offset: 0x14F6F14
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteRaw(System.String data)
    void WriteRaw(::Il2CppString* data);
    // public override System.Void WriteBase64(System.Byte[] buffer, System.Int32 index, System.Int32 count)
    // Offset: 0x14F7044
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteBase64(System.Byte[] buffer, System.Int32 index, System.Int32 count)
    void WriteBase64(::Array<uint8_t>* buffer, int index, int count);
    // public override System.Void Close()
    // Offset: 0x14F727C
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::Close()
    void Close();
    // public override System.Void Flush()
    // Offset: 0x14F7560
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::Flush()
    void Flush();
    // public override System.String LookupPrefix(System.String ns)
    // Offset: 0x14F764C
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.String XmlWriter::LookupPrefix(System.String ns)
    ::Il2CppString* LookupPrefix(::Il2CppString* ns);
    // public override System.Void WriteValue(System.String value)
    // Offset: 0x14F78FC
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteValue(System.String value)
    void WriteValue(::Il2CppString* value);
    // public override System.Void WriteBinHex(System.Byte[] buffer, System.Int32 index, System.Int32 count)
    // Offset: 0x14F7A38
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteBinHex(System.Byte[] buffer, System.Int32 index, System.Int32 count)
    void WriteBinHex(::Array<uint8_t>* buffer, int index, int count);
  }; // System.Xml.XmlWellFormedWriter
  static check_size<sizeof(XmlWellFormedWriter), 168 + sizeof(System::Xml::SecureStringHasher*)> __System_Xml_XmlWellFormedWriterSizeCheck;
  static_assert(sizeof(XmlWellFormedWriter) == 0xB0);
}
DEFINE_IL2CPP_ARG_TYPE(System::Xml::XmlWellFormedWriter*, "System.Xml", "XmlWellFormedWriter");
DEFINE_IL2CPP_ARG_TYPE(System::Xml::XmlWellFormedWriter::State, "System.Xml", "XmlWellFormedWriter/State");
DEFINE_IL2CPP_ARG_TYPE(System::Xml::XmlWellFormedWriter::SpecialAttribute, "System.Xml", "XmlWellFormedWriter/SpecialAttribute");
#pragma pack(pop)
