// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlWriter
#include "System/Xml/XmlWriter.hpp"
// Including type: System.Xml.ConformanceLevel
#include "System/Xml/ConformanceLevel.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Including type: System.Xml.WriteState
#include "System/Xml/WriteState.hpp"
// Including type: System.Xml.XmlSpace
#include "System/Xml/XmlSpace.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: SecureStringHasher
  class SecureStringHasher;
  // Forward declaring type: XmlStandalone
  struct XmlStandalone;
  // Skipping declaration: NamespaceKind because it is already included!
  // Skipping declaration: SpecialAttribute because it is already included!
  // Forward declaring type: XmlWriterSettings
  class XmlWriterSettings;
  // Forward declaring type: XmlRawWriter
  class XmlRawWriter;
  // Forward declaring type: IXmlNamespaceResolver
  class IXmlNamespaceResolver;
  // Forward declaring type: XmlException
  class XmlException;
  // Skipping declaration: State because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XmlWellFormedWriter
  class XmlWellFormedWriter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::XmlWellFormedWriter);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::XmlWellFormedWriter*, "System.Xml", "XmlWellFormedWriter");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0xB8
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlWellFormedWriter
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlWellFormedWriter : public ::System::Xml::XmlWriter {
    public:
    // Nested type: ::System::Xml::XmlWellFormedWriter::State
    struct State;
    // Nested type: ::System::Xml::XmlWellFormedWriter::Token
    struct Token;
    // Nested type: ::System::Xml::XmlWellFormedWriter::NamespaceResolverProxy
    class NamespaceResolverProxy;
    // Nested type: ::System::Xml::XmlWellFormedWriter::ElementScope
    struct ElementScope;
    // Nested type: ::System::Xml::XmlWellFormedWriter::NamespaceKind
    struct NamespaceKind;
    // Nested type: ::System::Xml::XmlWellFormedWriter::Namespace
    struct Namespace;
    // Nested type: ::System::Xml::XmlWellFormedWriter::AttrName
    struct AttrName;
    // Nested type: ::System::Xml::XmlWellFormedWriter::SpecialAttribute
    struct SpecialAttribute;
    // Nested type: ::System::Xml::XmlWellFormedWriter::AttributeValueCache
    class AttributeValueCache;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlWellFormedWriter/System.Xml.State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State Start
      static constexpr const int Start = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Start
      static ::System::Xml::XmlWellFormedWriter::State _get_Start();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Start
      static void _set_Start(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State TopLevel
      static constexpr const int TopLevel = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State TopLevel
      static ::System::Xml::XmlWellFormedWriter::State _get_TopLevel();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State TopLevel
      static void _set_TopLevel(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State Document
      static constexpr const int Document = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Document
      static ::System::Xml::XmlWellFormedWriter::State _get_Document();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Document
      static void _set_Document(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State Element
      static constexpr const int Element = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Element
      static ::System::Xml::XmlWellFormedWriter::State _get_Element();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Element
      static void _set_Element(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State Content
      static constexpr const int Content = 4;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Content
      static ::System::Xml::XmlWellFormedWriter::State _get_Content();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Content
      static void _set_Content(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State B64Content
      static constexpr const int B64Content = 5;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State B64Content
      static ::System::Xml::XmlWellFormedWriter::State _get_B64Content();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State B64Content
      static void _set_B64Content(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State B64Attribute
      static constexpr const int B64Attribute = 6;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State B64Attribute
      static ::System::Xml::XmlWellFormedWriter::State _get_B64Attribute();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State B64Attribute
      static void _set_B64Attribute(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State AfterRootEle
      static constexpr const int AfterRootEle = 7;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State AfterRootEle
      static ::System::Xml::XmlWellFormedWriter::State _get_AfterRootEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State AfterRootEle
      static void _set_AfterRootEle(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State Attribute
      static constexpr const int Attribute = 8;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Attribute
      static ::System::Xml::XmlWellFormedWriter::State _get_Attribute();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Attribute
      static void _set_Attribute(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State SpecialAttr
      static constexpr const int SpecialAttr = 9;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State SpecialAttr
      static ::System::Xml::XmlWellFormedWriter::State _get_SpecialAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State SpecialAttr
      static void _set_SpecialAttr(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndDocument
      static constexpr const int EndDocument = 10;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndDocument
      static ::System::Xml::XmlWellFormedWriter::State _get_EndDocument();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndDocument
      static void _set_EndDocument(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State RootLevelAttr
      static constexpr const int RootLevelAttr = 11;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State RootLevelAttr
      static ::System::Xml::XmlWellFormedWriter::State _get_RootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State RootLevelAttr
      static void _set_RootLevelAttr(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State RootLevelSpecAttr
      static constexpr const int RootLevelSpecAttr = 12;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State RootLevelSpecAttr
      static ::System::Xml::XmlWellFormedWriter::State _get_RootLevelSpecAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State RootLevelSpecAttr
      static void _set_RootLevelSpecAttr(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State RootLevelB64Attr
      static constexpr const int RootLevelB64Attr = 13;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State RootLevelB64Attr
      static ::System::Xml::XmlWellFormedWriter::State _get_RootLevelB64Attr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State RootLevelB64Attr
      static void _set_RootLevelB64Attr(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State AfterRootLevelAttr
      static constexpr const int AfterRootLevelAttr = 14;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State AfterRootLevelAttr
      static ::System::Xml::XmlWellFormedWriter::State _get_AfterRootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State AfterRootLevelAttr
      static void _set_AfterRootLevelAttr(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State Closed
      static constexpr const int Closed = 15;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Closed
      static ::System::Xml::XmlWellFormedWriter::State _get_Closed();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Closed
      static void _set_Closed(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State Error
      static constexpr const int Error = 16;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Error
      static ::System::Xml::XmlWellFormedWriter::State _get_Error();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State Error
      static void _set_Error(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartContent
      static constexpr const int StartContent = 101;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartContent
      static ::System::Xml::XmlWellFormedWriter::State _get_StartContent();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartContent
      static void _set_StartContent(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartContentEle
      static constexpr const int StartContentEle = 102;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartContentEle
      static ::System::Xml::XmlWellFormedWriter::State _get_StartContentEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartContentEle
      static void _set_StartContentEle(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartContentB64
      static constexpr const int StartContentB64 = 103;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartContentB64
      static ::System::Xml::XmlWellFormedWriter::State _get_StartContentB64();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartContentB64
      static void _set_StartContentB64(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartDoc
      static constexpr const int StartDoc = 104;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartDoc
      static ::System::Xml::XmlWellFormedWriter::State _get_StartDoc();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartDoc
      static void _set_StartDoc(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartDocEle
      static constexpr const int StartDocEle = 106;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartDocEle
      static ::System::Xml::XmlWellFormedWriter::State _get_StartDocEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartDocEle
      static void _set_StartDocEle(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrSEle
      static constexpr const int EndAttrSEle = 107;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrSEle
      static ::System::Xml::XmlWellFormedWriter::State _get_EndAttrSEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrSEle
      static void _set_EndAttrSEle(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrEEle
      static constexpr const int EndAttrEEle = 108;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrEEle
      static ::System::Xml::XmlWellFormedWriter::State _get_EndAttrEEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrEEle
      static void _set_EndAttrEEle(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrSCont
      static constexpr const int EndAttrSCont = 109;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrSCont
      static ::System::Xml::XmlWellFormedWriter::State _get_EndAttrSCont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrSCont
      static void _set_EndAttrSCont(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrSAttr
      static constexpr const int EndAttrSAttr = 111;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrSAttr
      static ::System::Xml::XmlWellFormedWriter::State _get_EndAttrSAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State EndAttrSAttr
      static void _set_EndAttrSAttr(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State PostB64Cont
      static constexpr const int PostB64Cont = 112;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State PostB64Cont
      static ::System::Xml::XmlWellFormedWriter::State _get_PostB64Cont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State PostB64Cont
      static void _set_PostB64Cont(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State PostB64Attr
      static constexpr const int PostB64Attr = 113;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State PostB64Attr
      static ::System::Xml::XmlWellFormedWriter::State _get_PostB64Attr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State PostB64Attr
      static void _set_PostB64Attr(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State PostB64RootAttr
      static constexpr const int PostB64RootAttr = 114;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State PostB64RootAttr
      static ::System::Xml::XmlWellFormedWriter::State _get_PostB64RootAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State PostB64RootAttr
      static void _set_PostB64RootAttr(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartFragEle
      static constexpr const int StartFragEle = 115;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartFragEle
      static ::System::Xml::XmlWellFormedWriter::State _get_StartFragEle();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartFragEle
      static void _set_StartFragEle(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartFragCont
      static constexpr const int StartFragCont = 116;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartFragCont
      static ::System::Xml::XmlWellFormedWriter::State _get_StartFragCont();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartFragCont
      static void _set_StartFragCont(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartFragB64
      static constexpr const int StartFragB64 = 117;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartFragB64
      static ::System::Xml::XmlWellFormedWriter::State _get_StartFragB64();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartFragB64
      static void _set_StartFragB64(::System::Xml::XmlWellFormedWriter::State value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartRootLevelAttr
      static constexpr const int StartRootLevelAttr = 118;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartRootLevelAttr
      static ::System::Xml::XmlWellFormedWriter::State _get_StartRootLevelAttr();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.State StartRootLevelAttr
      static void _set_StartRootLevelAttr(::System::Xml::XmlWellFormedWriter::State value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XmlWellFormedWriter/System.Xml.State
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::State), 0 + sizeof(int)> __System_Xml_XmlWellFormedWriter_StateSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::State) == 0x4);
    // Size: 0x30
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlWellFormedWriter/System.Xml.ElementScope
    // [TokenAttribute] Offset: FFFFFFFF
    struct ElementScope/*, public ::System::ValueType*/ {
      public:
      public:
      // System.Int32 prevNSTop
      // Size: 0x4
      // Offset: 0x0
      int prevNSTop;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: prevNSTop and: prefix
      char __padding0[0x4] = {};
      // System.String prefix
      // Size: 0x8
      // Offset: 0x8
      ::StringW prefix;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.String localName
      // Size: 0x8
      // Offset: 0x10
      ::StringW localName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.String namespaceUri
      // Size: 0x8
      // Offset: 0x18
      ::StringW namespaceUri;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.Xml.XmlSpace xmlSpace
      // Size: 0x4
      // Offset: 0x20
      ::System::Xml::XmlSpace xmlSpace;
      // Field size check
      static_assert(sizeof(::System::Xml::XmlSpace) == 0x4);
      // Padding between fields: xmlSpace and: xmlLang
      char __padding4[0x4] = {};
      // System.String xmlLang
      // Size: 0x8
      // Offset: 0x28
      ::StringW xmlLang;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      public:
      // Creating value type constructor for type: ElementScope
      constexpr ElementScope(int prevNSTop_ = {}, ::StringW prefix_ = {}, ::StringW localName_ = {}, ::StringW namespaceUri_ = {}, ::System::Xml::XmlSpace xmlSpace_ = {}, ::StringW xmlLang_ = {}) noexcept : prevNSTop{prevNSTop_}, prefix{prefix_}, localName{localName_}, namespaceUri{namespaceUri_}, xmlSpace{xmlSpace_}, xmlLang{xmlLang_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: System.Int32 prevNSTop
      int& dyn_prevNSTop();
      // Get instance field reference: System.String prefix
      ::StringW& dyn_prefix();
      // Get instance field reference: System.String localName
      ::StringW& dyn_localName();
      // Get instance field reference: System.String namespaceUri
      ::StringW& dyn_namespaceUri();
      // Get instance field reference: System.Xml.XmlSpace xmlSpace
      ::System::Xml::XmlSpace& dyn_xmlSpace();
      // Get instance field reference: System.String xmlLang
      ::StringW& dyn_xmlLang();
      // System.Void Set(System.String prefix, System.String localName, System.String namespaceUri, System.Int32 prevNSTop)
      // Offset: 0x1BBA1FC
      void Set(::StringW prefix, ::StringW localName, ::StringW namespaceUri, int prevNSTop);
      // System.Void WriteEndElement(System.Xml.XmlRawWriter rawWriter)
      // Offset: 0x1BBBA80
      void WriteEndElement(::System::Xml::XmlRawWriter* rawWriter);
      // System.Void WriteFullEndElement(System.Xml.XmlRawWriter rawWriter)
      // Offset: 0x1BBBDB0
      void WriteFullEndElement(::System::Xml::XmlRawWriter* rawWriter);
    }; // System.Xml.XmlWellFormedWriter/System.Xml.ElementScope
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::ElementScope), 40 + sizeof(::StringW)> __System_Xml_XmlWellFormedWriter_ElementScopeSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::ElementScope) == 0x30);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind
    // [TokenAttribute] Offset: FFFFFFFF
    struct NamespaceKind/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NamespaceKind
      constexpr NamespaceKind(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind Written
      static constexpr const int Written = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind Written
      static ::System::Xml::XmlWellFormedWriter::NamespaceKind _get_Written();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind Written
      static void _set_Written(::System::Xml::XmlWellFormedWriter::NamespaceKind value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind NeedToWrite
      static constexpr const int NeedToWrite = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind NeedToWrite
      static ::System::Xml::XmlWellFormedWriter::NamespaceKind _get_NeedToWrite();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind NeedToWrite
      static void _set_NeedToWrite(::System::Xml::XmlWellFormedWriter::NamespaceKind value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind Implied
      static constexpr const int Implied = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind Implied
      static ::System::Xml::XmlWellFormedWriter::NamespaceKind _get_Implied();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind Implied
      static void _set_Implied(::System::Xml::XmlWellFormedWriter::NamespaceKind value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind Special
      static constexpr const int Special = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind Special
      static ::System::Xml::XmlWellFormedWriter::NamespaceKind _get_Special();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind Special
      static void _set_Special(::System::Xml::XmlWellFormedWriter::NamespaceKind value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::NamespaceKind), 0 + sizeof(int)> __System_Xml_XmlWellFormedWriter_NamespaceKindSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::NamespaceKind) == 0x4);
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlWellFormedWriter/System.Xml.Namespace
    // [TokenAttribute] Offset: FFFFFFFF
    struct Namespace/*, public ::System::ValueType*/ {
      public:
      public:
      // System.String prefix
      // Size: 0x8
      // Offset: 0x0
      ::StringW prefix;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.String namespaceUri
      // Size: 0x8
      // Offset: 0x8
      ::StringW namespaceUri;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind kind
      // Size: 0x4
      // Offset: 0x10
      ::System::Xml::XmlWellFormedWriter::NamespaceKind kind;
      // Field size check
      static_assert(sizeof(::System::Xml::XmlWellFormedWriter::NamespaceKind) == 0x4);
      // System.Int32 prevNsIndex
      // Size: 0x4
      // Offset: 0x14
      int prevNsIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Namespace
      constexpr Namespace(::StringW prefix_ = {}, ::StringW namespaceUri_ = {}, ::System::Xml::XmlWellFormedWriter::NamespaceKind kind_ = {}, int prevNsIndex_ = {}) noexcept : prefix{prefix_}, namespaceUri{namespaceUri_}, kind{kind_}, prevNsIndex{prevNsIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: System.String prefix
      ::StringW& dyn_prefix();
      // Get instance field reference: System.String namespaceUri
      ::StringW& dyn_namespaceUri();
      // Get instance field reference: System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind kind
      ::System::Xml::XmlWellFormedWriter::NamespaceKind& dyn_kind();
      // Get instance field reference: System.Int32 prevNsIndex
      int& dyn_prevNsIndex();
      // System.Void Set(System.String prefix, System.String namespaceUri, System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind kind)
      // Offset: 0x1BBA1EC
      void Set(::StringW prefix, ::StringW namespaceUri, ::System::Xml::XmlWellFormedWriter::NamespaceKind kind);
      // System.Void WriteDecl(System.Xml.XmlWriter writer, System.Xml.XmlRawWriter rawWriter)
      // Offset: 0x1BC0A34
      void WriteDecl(::System::Xml::XmlWriter* writer, ::System::Xml::XmlRawWriter* rawWriter);
    }; // System.Xml.XmlWellFormedWriter/System.Xml.Namespace
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::Namespace), 20 + sizeof(int)> __System_Xml_XmlWellFormedWriter_NamespaceSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::Namespace) == 0x18);
    // Size: 0x1C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlWellFormedWriter/System.Xml.AttrName
    // [TokenAttribute] Offset: FFFFFFFF
    struct AttrName/*, public ::System::ValueType*/ {
      public:
      public:
      // System.String prefix
      // Size: 0x8
      // Offset: 0x0
      ::StringW prefix;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.String namespaceUri
      // Size: 0x8
      // Offset: 0x8
      ::StringW namespaceUri;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.String localName
      // Size: 0x8
      // Offset: 0x10
      ::StringW localName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.Int32 prev
      // Size: 0x4
      // Offset: 0x18
      int prev;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AttrName
      constexpr AttrName(::StringW prefix_ = {}, ::StringW namespaceUri_ = {}, ::StringW localName_ = {}, int prev_ = {}) noexcept : prefix{prefix_}, namespaceUri{namespaceUri_}, localName{localName_}, prev{prev_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: System.String prefix
      ::StringW& dyn_prefix();
      // Get instance field reference: System.String namespaceUri
      ::StringW& dyn_namespaceUri();
      // Get instance field reference: System.String localName
      ::StringW& dyn_localName();
      // Get instance field reference: System.Int32 prev
      int& dyn_prev();
      // System.Void Set(System.String prefix, System.String localName, System.String namespaceUri)
      // Offset: 0x1BC0CD4
      void Set(::StringW prefix, ::StringW localName, ::StringW namespaceUri);
      // System.Boolean IsDuplicate(System.String prefix, System.String localName, System.String namespaceUri)
      // Offset: 0x1BC0CE4
      bool IsDuplicate(::StringW prefix, ::StringW localName, ::StringW namespaceUri);
    }; // System.Xml.XmlWellFormedWriter/System.Xml.AttrName
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::AttrName), 24 + sizeof(int)> __System_Xml_XmlWellFormedWriter_AttrNameSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::AttrName) == 0x1C);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute
    // [TokenAttribute] Offset: FFFFFFFF
    struct SpecialAttribute/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SpecialAttribute
      constexpr SpecialAttribute(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute No
      static constexpr const int No = 0;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute No
      static ::System::Xml::XmlWellFormedWriter::SpecialAttribute _get_No();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute No
      static void _set_No(::System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute DefaultXmlns
      static constexpr const int DefaultXmlns = 1;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute DefaultXmlns
      static ::System::Xml::XmlWellFormedWriter::SpecialAttribute _get_DefaultXmlns();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute DefaultXmlns
      static void _set_DefaultXmlns(::System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute PrefixedXmlns
      static constexpr const int PrefixedXmlns = 2;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute PrefixedXmlns
      static ::System::Xml::XmlWellFormedWriter::SpecialAttribute _get_PrefixedXmlns();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute PrefixedXmlns
      static void _set_PrefixedXmlns(::System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute XmlSpace
      static constexpr const int XmlSpace = 3;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute XmlSpace
      static ::System::Xml::XmlWellFormedWriter::SpecialAttribute _get_XmlSpace();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute XmlSpace
      static void _set_XmlSpace(::System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // static field const value: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute XmlLang
      static constexpr const int XmlLang = 4;
      // Get static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute XmlLang
      static ::System::Xml::XmlWellFormedWriter::SpecialAttribute _get_XmlLang();
      // Set static field: static public System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute XmlLang
      static void _set_XmlLang(::System::Xml::XmlWellFormedWriter::SpecialAttribute value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute
    #pragma pack(pop)
    static check_size<sizeof(XmlWellFormedWriter::SpecialAttribute), 0 + sizeof(int)> __System_Xml_XmlWellFormedWriter_SpecialAttributeSizeCheck;
    static_assert(sizeof(XmlWellFormedWriter::SpecialAttribute) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.XmlWriter writer
    // Size: 0x8
    // Offset: 0x18
    ::System::Xml::XmlWriter* writer;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlWriter*) == 0x8);
    // private System.Xml.XmlRawWriter rawWriter
    // Size: 0x8
    // Offset: 0x20
    ::System::Xml::XmlRawWriter* rawWriter;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlRawWriter*) == 0x8);
    // private System.Xml.IXmlNamespaceResolver predefinedNamespaces
    // Size: 0x8
    // Offset: 0x28
    ::System::Xml::IXmlNamespaceResolver* predefinedNamespaces;
    // Field size check
    static_assert(sizeof(::System::Xml::IXmlNamespaceResolver*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/System.Xml.Namespace[] nsStack
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::System::Xml::XmlWellFormedWriter::Namespace> nsStack;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlWellFormedWriter::Namespace>) == 0x8);
    // private System.Int32 nsTop
    // Size: 0x4
    // Offset: 0x38
    int nsTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: nsTop and: nsHashtable
    char __padding4[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> nsHashtable
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<::StringW, int>* nsHashtable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, int>*) == 0x8);
    // private System.Boolean useNsHashtable
    // Size: 0x1
    // Offset: 0x48
    bool useNsHashtable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useNsHashtable and: elemScopeStack
    char __padding6[0x7] = {};
    // private System.Xml.XmlWellFormedWriter/System.Xml.ElementScope[] elemScopeStack
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::System::Xml::XmlWellFormedWriter::ElementScope> elemScopeStack;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlWellFormedWriter::ElementScope>) == 0x8);
    // private System.Int32 elemTop
    // Size: 0x4
    // Offset: 0x58
    int elemTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: elemTop and: attrStack
    char __padding8[0x4] = {};
    // private System.Xml.XmlWellFormedWriter/System.Xml.AttrName[] attrStack
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::System::Xml::XmlWellFormedWriter::AttrName> attrStack;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlWellFormedWriter::AttrName>) == 0x8);
    // private System.Int32 attrCount
    // Size: 0x4
    // Offset: 0x68
    int attrCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: attrCount and: attrHashTable
    char __padding10[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,System.Int32> attrHashTable
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::Dictionary_2<::StringW, int>* attrHashTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, int>*) == 0x8);
    // private System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute specAttr
    // Size: 0x4
    // Offset: 0x78
    ::System::Xml::XmlWellFormedWriter::SpecialAttribute specAttr;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlWellFormedWriter::SpecialAttribute) == 0x4);
    // Padding between fields: specAttr and: attrValueCache
    char __padding12[0x4] = {};
    // private System.Xml.XmlWellFormedWriter/System.Xml.AttributeValueCache attrValueCache
    // Size: 0x8
    // Offset: 0x80
    ::System::Xml::XmlWellFormedWriter::AttributeValueCache* attrValueCache;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlWellFormedWriter::AttributeValueCache*) == 0x8);
    // private System.String curDeclPrefix
    // Size: 0x8
    // Offset: 0x88
    ::StringW curDeclPrefix;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlWellFormedWriter/System.Xml.State[] stateTable
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::System::Xml::XmlWellFormedWriter::State> stateTable;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlWellFormedWriter::State>) == 0x8);
    // private System.Xml.XmlWellFormedWriter/System.Xml.State currentState
    // Size: 0x4
    // Offset: 0x98
    ::System::Xml::XmlWellFormedWriter::State currentState;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlWellFormedWriter::State) == 0x4);
    // private System.Boolean checkCharacters
    // Size: 0x1
    // Offset: 0x9C
    bool checkCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean omitDuplNamespaces
    // Size: 0x1
    // Offset: 0x9D
    bool omitDuplNamespaces;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean writeEndDocumentOnClose
    // Size: 0x1
    // Offset: 0x9E
    bool writeEndDocumentOnClose;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: writeEndDocumentOnClose and: conformanceLevel
    char __padding19[0x1] = {};
    // private System.Xml.ConformanceLevel conformanceLevel
    // Size: 0x4
    // Offset: 0xA0
    ::System::Xml::ConformanceLevel conformanceLevel;
    // Field size check
    static_assert(sizeof(::System::Xml::ConformanceLevel) == 0x4);
    // private System.Boolean dtdWritten
    // Size: 0x1
    // Offset: 0xA4
    bool dtdWritten;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean xmlDeclFollows
    // Size: 0x1
    // Offset: 0xA5
    bool xmlDeclFollows;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: xmlDeclFollows and: xmlCharType
    char __padding22[0x2] = {};
    // private System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0xA8
    ::System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlCharType) == 0x8);
    // private System.Xml.SecureStringHasher hasher
    // Size: 0x8
    // Offset: 0xB0
    ::System::Xml::SecureStringHasher* hasher;
    // Field size check
    static_assert(sizeof(::System::Xml::SecureStringHasher*) == 0x8);
    public:
    // Deleting conversion operator: operator ::ArrayW<::Il2CppChar>
    // Cannot delete conversion operator because it seems to have a generic type in the definition! This may not be defined!
    // Get static field: static readonly System.String[] stateName
    static ::ArrayW<::StringW> _get_stateName();
    // Set static field: static readonly System.String[] stateName
    static void _set_stateName(::ArrayW<::StringW> value);
    // Get static field: static readonly System.String[] tokenName
    static ::ArrayW<::StringW> _get_tokenName();
    // Set static field: static readonly System.String[] tokenName
    static void _set_tokenName(::ArrayW<::StringW> value);
    // Get static field: static private System.Xml.WriteState[] state2WriteState
    static ::ArrayW<::System::Xml::WriteState> _get_state2WriteState();
    // Set static field: static private System.Xml.WriteState[] state2WriteState
    static void _set_state2WriteState(::ArrayW<::System::Xml::WriteState> value);
    // Get static field: static private readonly System.Xml.XmlWellFormedWriter/System.Xml.State[] StateTableDocument
    static ::ArrayW<::System::Xml::XmlWellFormedWriter::State> _get_StateTableDocument();
    // Set static field: static private readonly System.Xml.XmlWellFormedWriter/System.Xml.State[] StateTableDocument
    static void _set_StateTableDocument(::ArrayW<::System::Xml::XmlWellFormedWriter::State> value);
    // Get static field: static private readonly System.Xml.XmlWellFormedWriter/System.Xml.State[] StateTableAuto
    static ::ArrayW<::System::Xml::XmlWellFormedWriter::State> _get_StateTableAuto();
    // Set static field: static private readonly System.Xml.XmlWellFormedWriter/System.Xml.State[] StateTableAuto
    static void _set_StateTableAuto(::ArrayW<::System::Xml::XmlWellFormedWriter::State> value);
    // Get instance field reference: private System.Xml.XmlWriter writer
    ::System::Xml::XmlWriter*& dyn_writer();
    // Get instance field reference: private System.Xml.XmlRawWriter rawWriter
    ::System::Xml::XmlRawWriter*& dyn_rawWriter();
    // Get instance field reference: private System.Xml.IXmlNamespaceResolver predefinedNamespaces
    ::System::Xml::IXmlNamespaceResolver*& dyn_predefinedNamespaces();
    // Get instance field reference: private System.Xml.XmlWellFormedWriter/System.Xml.Namespace[] nsStack
    ::ArrayW<::System::Xml::XmlWellFormedWriter::Namespace>& dyn_nsStack();
    // Get instance field reference: private System.Int32 nsTop
    int& dyn_nsTop();
    // Get instance field reference: private System.Collections.Generic.Dictionary`2<System.String,System.Int32> nsHashtable
    ::System::Collections::Generic::Dictionary_2<::StringW, int>*& dyn_nsHashtable();
    // Get instance field reference: private System.Boolean useNsHashtable
    bool& dyn_useNsHashtable();
    // Get instance field reference: private System.Xml.XmlWellFormedWriter/System.Xml.ElementScope[] elemScopeStack
    ::ArrayW<::System::Xml::XmlWellFormedWriter::ElementScope>& dyn_elemScopeStack();
    // Get instance field reference: private System.Int32 elemTop
    int& dyn_elemTop();
    // Get instance field reference: private System.Xml.XmlWellFormedWriter/System.Xml.AttrName[] attrStack
    ::ArrayW<::System::Xml::XmlWellFormedWriter::AttrName>& dyn_attrStack();
    // Get instance field reference: private System.Int32 attrCount
    int& dyn_attrCount();
    // Get instance field reference: private System.Collections.Generic.Dictionary`2<System.String,System.Int32> attrHashTable
    ::System::Collections::Generic::Dictionary_2<::StringW, int>*& dyn_attrHashTable();
    // Get instance field reference: private System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute specAttr
    ::System::Xml::XmlWellFormedWriter::SpecialAttribute& dyn_specAttr();
    // Get instance field reference: private System.Xml.XmlWellFormedWriter/System.Xml.AttributeValueCache attrValueCache
    ::System::Xml::XmlWellFormedWriter::AttributeValueCache*& dyn_attrValueCache();
    // Get instance field reference: private System.String curDeclPrefix
    ::StringW& dyn_curDeclPrefix();
    // Get instance field reference: private System.Xml.XmlWellFormedWriter/System.Xml.State[] stateTable
    ::ArrayW<::System::Xml::XmlWellFormedWriter::State>& dyn_stateTable();
    // Get instance field reference: private System.Xml.XmlWellFormedWriter/System.Xml.State currentState
    ::System::Xml::XmlWellFormedWriter::State& dyn_currentState();
    // Get instance field reference: private System.Boolean checkCharacters
    bool& dyn_checkCharacters();
    // Get instance field reference: private System.Boolean omitDuplNamespaces
    bool& dyn_omitDuplNamespaces();
    // Get instance field reference: private System.Boolean writeEndDocumentOnClose
    bool& dyn_writeEndDocumentOnClose();
    // Get instance field reference: private System.Xml.ConformanceLevel conformanceLevel
    ::System::Xml::ConformanceLevel& dyn_conformanceLevel();
    // Get instance field reference: private System.Boolean dtdWritten
    bool& dyn_dtdWritten();
    // Get instance field reference: private System.Boolean xmlDeclFollows
    bool& dyn_xmlDeclFollows();
    // Get instance field reference: private System.Xml.XmlCharType xmlCharType
    ::System::Xml::XmlCharType& dyn_xmlCharType();
    // Get instance field reference: private System.Xml.SecureStringHasher hasher
    ::System::Xml::SecureStringHasher*& dyn_hasher();
    // System.Xml.XmlRawWriter get_RawWriter()
    // Offset: 0x1BC01DC
    ::System::Xml::XmlRawWriter* get_RawWriter();
    // private System.Boolean get_SaveAttrValue()
    // Offset: 0x1BBE494
    bool get_SaveAttrValue();
    // private System.Boolean get_InBase64()
    // Offset: 0x1BBFB04
    bool get_InBase64();
    // private System.Boolean get_IsClosedOrErrorState()
    // Offset: 0x1BC01B0
    bool get_IsClosedOrErrorState();
    // System.Void .ctor(System.Xml.XmlWriter writer, System.Xml.XmlWriterSettings settings)
    // Offset: 0x1BB9DEC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static XmlWellFormedWriter* New_ctor(::System::Xml::XmlWriter* writer, ::System::Xml::XmlWriterSettings* settings) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Xml::XmlWellFormedWriter::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<XmlWellFormedWriter*, creationType>(writer, settings)));
    }
    // static private System.Void .cctor()
    // Offset: 0x1BC0EA8
    static void _cctor();
    // private System.Void SetSpecialAttribute(System.Xml.XmlWellFormedWriter/System.Xml.SpecialAttribute special)
    // Offset: 0x1BBC484
    void SetSpecialAttribute(::System::Xml::XmlWellFormedWriter::SpecialAttribute special);
    // private System.Void WriteStartDocumentImpl(System.Xml.XmlStandalone standalone)
    // Offset: 0x1BBA2CC
    void WriteStartDocumentImpl(::System::Xml::XmlStandalone standalone);
    // private System.Void StartFragment()
    // Offset: 0x1BC0254
    void StartFragment();
    // private System.Void PushNamespaceImplicit(System.String prefix, System.String ns)
    // Offset: 0x1BBB450
    void PushNamespaceImplicit(::StringW prefix, ::StringW ns);
    // private System.Boolean PushNamespaceExplicit(System.String prefix, System.String ns)
    // Offset: 0x1BBD1BC
    bool PushNamespaceExplicit(::StringW prefix, ::StringW ns);
    // private System.Void AddNamespace(System.String prefix, System.String ns, System.Xml.XmlWellFormedWriter/System.Xml.NamespaceKind kind)
    // Offset: 0x1BC0360
    void AddNamespace(::StringW prefix, ::StringW ns, ::System::Xml::XmlWellFormedWriter::NamespaceKind kind);
    // private System.Void AddToNamespaceHashtable(System.Int32 namespaceIndex)
    // Offset: 0x1BC05D0
    void AddToNamespaceHashtable(int namespaceIndex);
    // private System.Int32 LookupNamespaceIndex(System.String prefix)
    // Offset: 0x1BC0260
    int LookupNamespaceIndex(::StringW prefix);
    // private System.Void PopNamespaces(System.Int32 indexFrom, System.Int32 indexTo)
    // Offset: 0x1BBBAB0
    void PopNamespaces(int indexFrom, int indexTo);
    // static private System.Xml.XmlException DupAttrException(System.String prefix, System.String localName)
    // Offset: 0x1BC04D0
    static ::System::Xml::XmlException* DupAttrException(::StringW prefix, ::StringW localName);
    // private System.Void AdvanceState(System.Xml.XmlWellFormedWriter/System.Xml.Token token)
    // Offset: 0x1BBA634
    void AdvanceState(::System::Xml::XmlWellFormedWriter::Token token);
    // private System.Void StartElementContent()
    // Offset: 0x1BC0960
    void StartElementContent();
    // static private System.String GetStateName(System.Xml.XmlWellFormedWriter/System.Xml.State state)
    // Offset: 0x1BC06C4
    static ::StringW GetStateName(::System::Xml::XmlWellFormedWriter::State state);
    // System.String LookupNamespace(System.String prefix)
    // Offset: 0x1BBB2E8
    ::StringW LookupNamespace(::StringW prefix);
    // private System.String LookupLocalNamespace(System.String prefix)
    // Offset: 0x1BBC65C
    ::StringW LookupLocalNamespace(::StringW prefix);
    // private System.String GeneratePrefix()
    // Offset: 0x1BBC51C
    ::StringW GeneratePrefix();
    // private System.Void CheckNCName(System.String ncname)
    // Offset: 0x1BBB194
    void CheckNCName(::StringW ncname);
    // static private System.Exception InvalidCharsException(System.String name, System.Int32 badCharIndex)
    // Offset: 0x1BC0B60
    static ::System::Exception* InvalidCharsException(::StringW name, int badCharIndex);
    // private System.Void ThrowInvalidStateTransition(System.Xml.XmlWellFormedWriter/System.Xml.Token token, System.Xml.XmlWellFormedWriter/System.Xml.State currentState)
    // Offset: 0x1BC0770
    void ThrowInvalidStateTransition(::System::Xml::XmlWellFormedWriter::Token token, ::System::Xml::XmlWellFormedWriter::State currentState);
    // private System.Void AddAttribute(System.String prefix, System.String localName, System.String namespaceName)
    // Offset: 0x1BBC738
    void AddAttribute(::StringW prefix, ::StringW localName, ::StringW namespaceName);
    // private System.Void AddToAttrHashTable(System.Int32 attributeIndex)
    // Offset: 0x1BC0D60
    void AddToAttrHashTable(int attributeIndex);
    // public override System.Xml.WriteState get_WriteState()
    // Offset: 0x1BBA218
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Xml.WriteState XmlWriter::get_WriteState()
    ::System::Xml::WriteState get_WriteState();
    // public override System.Void WriteStartDocument()
    // Offset: 0x1BBA2C4
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteStartDocument()
    void WriteStartDocument();
    // public override System.Void WriteStartDocument(System.Boolean standalone)
    // Offset: 0x1BBA490
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteStartDocument(System.Boolean standalone)
    void WriteStartDocument(bool standalone);
    // public override System.Void WriteEndDocument()
    // Offset: 0x1BBA4B0
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteEndDocument()
    void WriteEndDocument();
    // public override System.Void WriteDocType(System.String name, System.String pubid, System.String sysid, System.String subset)
    // Offset: 0x1BBA970
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteDocType(System.String name, System.String pubid, System.String sysid, System.String subset)
    void WriteDocType(::StringW name, ::StringW pubid, ::StringW sysid, ::StringW subset);
    // public override System.Void WriteStartElement(System.String prefix, System.String localName, System.String ns)
    // Offset: 0x1BBADF4
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteStartElement(System.String prefix, System.String localName, System.String ns)
    void WriteStartElement(::StringW prefix, ::StringW localName, ::StringW ns);
    // public override System.Void WriteEndElement()
    // Offset: 0x1BBB858
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteEndElement()
    void WriteEndElement();
    // public override System.Void WriteFullEndElement()
    // Offset: 0x1BBBB88
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteFullEndElement()
    void WriteFullEndElement();
    // public override System.Void WriteStartAttribute(System.String prefix, System.String localName, System.String namespaceName)
    // Offset: 0x1BBBDE0
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteStartAttribute(System.String prefix, System.String localName, System.String namespaceName)
    void WriteStartAttribute(::StringW prefix, ::StringW localName, ::StringW namespaceName);
    // public override System.Void WriteEndAttribute()
    // Offset: 0x1BBC99C
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteEndAttribute()
    void WriteEndAttribute();
    // public override System.Void WriteCData(System.String text)
    // Offset: 0x1BBDE30
    // Implemented from: System.Xml.XmlWriter
    // Base method: System.Void XmlWriter::WriteCData(System.String text)
    void WriteCData(::StringW text);
    // public override System.Void WriteComment(System.String text)
