// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlReader
#include "System/Xml/XmlReader.hpp"
// Including type: System.Xml.IXmlLineInfo
#include "System/Xml/IXmlLineInfo.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: CachingEventHandler
  class CachingEventHandler;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: ValidatingReaderNodeData
  class ValidatingReaderNodeData;
  // Forward declaring type: XmlNodeType
  struct XmlNodeType;
  // Forward declaring type: XmlReaderSettings
  class XmlReaderSettings;
  // Forward declaring type: XmlSpace
  struct XmlSpace;
  // Forward declaring type: ReadState
  struct ReadState;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XsdCachingReader
  class XsdCachingReader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::XsdCachingReader);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::XsdCachingReader*, "System.Xml", "XsdCachingReader");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XsdCachingReader
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: 11940C0
  class XsdCachingReader : public System::Xml::XmlReader/*, public System::Xml::IXmlLineInfo*/ {
    public:
    // Nested type: System::Xml::XsdCachingReader::CachingReaderState
    struct CachingReaderState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XsdCachingReader/System.Xml.CachingReaderState
    // [TokenAttribute] Offset: FFFFFFFF
    struct CachingReaderState/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CachingReaderState
      constexpr CachingReaderState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState None
      static constexpr const int None = 0;
      // Get static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState None
      static System::Xml::XsdCachingReader::CachingReaderState _get_None();
      // Set static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState None
      static void _set_None(System::Xml::XsdCachingReader::CachingReaderState value);
      // static field const value: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Init
      static constexpr const int Init = 1;
      // Get static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Init
      static System::Xml::XsdCachingReader::CachingReaderState _get_Init();
      // Set static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Init
      static void _set_Init(System::Xml::XsdCachingReader::CachingReaderState value);
      // static field const value: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Record
      static constexpr const int Record = 2;
      // Get static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Record
      static System::Xml::XsdCachingReader::CachingReaderState _get_Record();
      // Set static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Record
      static void _set_Record(System::Xml::XsdCachingReader::CachingReaderState value);
      // static field const value: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Replay
      static constexpr const int Replay = 3;
      // Get static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Replay
      static System::Xml::XsdCachingReader::CachingReaderState _get_Replay();
      // Set static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Replay
      static void _set_Replay(System::Xml::XsdCachingReader::CachingReaderState value);
      // static field const value: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState ReaderClosed
      static constexpr const int ReaderClosed = 4;
      // Get static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState ReaderClosed
      static System::Xml::XsdCachingReader::CachingReaderState _get_ReaderClosed();
      // Set static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState ReaderClosed
      static void _set_ReaderClosed(System::Xml::XsdCachingReader::CachingReaderState value);
      // static field const value: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Error
      static constexpr const int Error = 5;
      // Get static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Error
      static System::Xml::XsdCachingReader::CachingReaderState _get_Error();
      // Set static field: static public System.Xml.XsdCachingReader/System.Xml.CachingReaderState Error
      static void _set_Error(System::Xml::XsdCachingReader::CachingReaderState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XsdCachingReader/System.Xml.CachingReaderState
    #pragma pack(pop)
    static check_size<sizeof(XsdCachingReader::CachingReaderState), 0 + sizeof(int)> __System_Xml_XsdCachingReader_CachingReaderStateSizeCheck;
    static_assert(sizeof(XsdCachingReader::CachingReaderState) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.XmlReader coreReader
    // Size: 0x8
    // Offset: 0x10
    System::Xml::XmlReader* coreReader;
    // Field size check
    static_assert(sizeof(System::Xml::XmlReader*) == 0x8);
    // private System.Xml.XmlNameTable coreReaderNameTable
    // Size: 0x8
    // Offset: 0x18
    System::Xml::XmlNameTable* coreReaderNameTable;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.ValidatingReaderNodeData[] contentEvents
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<System::Xml::ValidatingReaderNodeData*> contentEvents;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Xml::ValidatingReaderNodeData*>) == 0x8);
    // private System.Xml.ValidatingReaderNodeData[] attributeEvents
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<System::Xml::ValidatingReaderNodeData*> attributeEvents;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Xml::ValidatingReaderNodeData*>) == 0x8);
    // private System.Xml.ValidatingReaderNodeData cachedNode
    // Size: 0x8
    // Offset: 0x30
    System::Xml::ValidatingReaderNodeData* cachedNode;
    // Field size check
    static_assert(sizeof(System::Xml::ValidatingReaderNodeData*) == 0x8);
    // private System.Xml.XsdCachingReader/System.Xml.CachingReaderState cacheState
    // Size: 0x4
    // Offset: 0x38
    System::Xml::XsdCachingReader::CachingReaderState cacheState;
    // Field size check
    static_assert(sizeof(System::Xml::XsdCachingReader::CachingReaderState) == 0x4);
    // private System.Int32 contentIndex
    // Size: 0x4
    // Offset: 0x3C
    int contentIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 attributeCount
    // Size: 0x4
    // Offset: 0x40
    int attributeCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean returnOriginalStringValues
    // Size: 0x1
    // Offset: 0x44
    bool returnOriginalStringValues;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: returnOriginalStringValues and: cacheHandler
    char __padding8[0x3] = {};
    // private System.Xml.CachingEventHandler cacheHandler
    // Size: 0x8
    // Offset: 0x48
    System::Xml::CachingEventHandler* cacheHandler;
    // Field size check
    static_assert(sizeof(System::Xml::CachingEventHandler*) == 0x8);
    // private System.Int32 currentAttrIndex
    // Size: 0x4
    // Offset: 0x50
    int currentAttrIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 currentContentIndex
    // Size: 0x4
    // Offset: 0x54
    int currentContentIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean readAhead
    // Size: 0x1
    // Offset: 0x58
    bool readAhead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: readAhead and: lineInfo
    char __padding12[0x7] = {};
    // private System.Xml.IXmlLineInfo lineInfo
    // Size: 0x8
    // Offset: 0x60
    System::Xml::IXmlLineInfo* lineInfo;
    // Field size check
    static_assert(sizeof(System::Xml::IXmlLineInfo*) == 0x8);
    // private System.Xml.ValidatingReaderNodeData textNode
    // Size: 0x8
    // Offset: 0x68
    System::Xml::ValidatingReaderNodeData* textNode;
    // Field size check
    static_assert(sizeof(System::Xml::ValidatingReaderNodeData*) == 0x8);
    public:
    // Creating interface conversion operator: operator System::Xml::IXmlLineInfo
    operator System::Xml::IXmlLineInfo() noexcept {
      return *reinterpret_cast<System::Xml::IXmlLineInfo*>(this);
    }
    // Get instance field reference: private System.Xml.XmlReader coreReader
    System::Xml::XmlReader*& dyn_coreReader();
    // Get instance field reference: private System.Xml.XmlNameTable coreReaderNameTable
    System::Xml::XmlNameTable*& dyn_coreReaderNameTable();
    // Get instance field reference: private System.Xml.ValidatingReaderNodeData[] contentEvents
    ::ArrayW<System::Xml::ValidatingReaderNodeData*>& dyn_contentEvents();
    // Get instance field reference: private System.Xml.ValidatingReaderNodeData[] attributeEvents
