// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlReader
#include "System/Xml/XmlReader.hpp"
// Including type: System.Xml.IXmlLineInfo
#include "System/Xml/IXmlLineInfo.hpp"
// Including type: System.Xml.IXmlNamespaceResolver
#include "System/Xml/IXmlNamespaceResolver.hpp"
// Including type: System.Xml.Schema.IXmlSchemaInfo
#include "System/Xml/Schema/IXmlSchemaInfo.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlValueGetter
  class XmlValueGetter;
  // Forward declaring type: XmlSchemaValidator
  class XmlSchemaValidator;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: Parser
  class Parser;
  // Forward declaring type: XmlSchemaInfo
  class XmlSchemaInfo;
  // Forward declaring type: XmlSchemaValidity
  struct XmlSchemaValidity;
  // Forward declaring type: XmlSchemaSimpleType
  class XmlSchemaSimpleType;
  // Forward declaring type: XmlSchemaType
  class XmlSchemaType;
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
  // Forward declaring type: XmlSchemaAttribute
  class XmlSchemaAttribute;
  // Forward declaring type: XmlSchemaObject
  class XmlSchemaObject;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: XmlNamespaceManager
  class XmlNamespaceManager;
  // Forward declaring type: ValidatingReaderNodeData
  class ValidatingReaderNodeData;
  // Forward declaring type: AttributePSVIInfo
  class AttributePSVIInfo;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XsdCachingReader
  class XsdCachingReader;
  // Forward declaring type: ReadContentAsBinaryHelper
  class ReadContentAsBinaryHelper;
  // Forward declaring type: XmlReaderSettings
  class XmlReaderSettings;
  // Forward declaring type: XmlNamespaceScope
  struct XmlNamespaceScope;
  // Forward declaring type: XmlNodeType
  struct XmlNodeType;
  // Forward declaring type: XmlSpace
  struct XmlSpace;
  // Forward declaring type: ReadState
  struct ReadState;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XsdValidatingReader
  class XsdValidatingReader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::XsdValidatingReader);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::XsdValidatingReader*, "System.Xml", "XsdValidatingReader");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x124
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XsdValidatingReader
  // [TokenAttribute] Offset: FFFFFFFF
  class XsdValidatingReader : public System::Xml::XmlReader/*, public System::Xml::IXmlLineInfo, public System::Xml::IXmlNamespaceResolver, public System::Xml::Schema::IXmlSchemaInfo*/ {
    public:
    // Nested type: System::Xml::XsdValidatingReader::ValidatingReaderState
    struct ValidatingReaderState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ValidatingReaderState/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ValidatingReaderState
      constexpr ValidatingReaderState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState None
      static constexpr const int None = 0;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState None
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_None();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState None
      static void _set_None(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState Init
      static constexpr const int Init = 1;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState Init
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_Init();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState Init
      static void _set_Init(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState Read
      static constexpr const int Read = 2;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState Read
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_Read();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState Read
      static void _set_Read(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnDefaultAttribute
      static constexpr const int OnDefaultAttribute = -1;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnDefaultAttribute
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_OnDefaultAttribute();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnDefaultAttribute
      static void _set_OnDefaultAttribute(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnReadAttributeValue
      static constexpr const int OnReadAttributeValue = -2;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnReadAttributeValue
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_OnReadAttributeValue();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnReadAttributeValue
      static void _set_OnReadAttributeValue(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnAttribute
      static constexpr const int OnAttribute = 3;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnAttribute
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_OnAttribute();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnAttribute
      static void _set_OnAttribute(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ClearAttributes
      static constexpr const int ClearAttributes = 4;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ClearAttributes
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_ClearAttributes();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ClearAttributes
      static void _set_ClearAttributes(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ParseInlineSchema
      static constexpr const int ParseInlineSchema = 5;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ParseInlineSchema
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_ParseInlineSchema();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ParseInlineSchema
      static void _set_ParseInlineSchema(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ReadAhead
      static constexpr const int ReadAhead = 6;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ReadAhead
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_ReadAhead();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ReadAhead
      static void _set_ReadAhead(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnReadBinaryContent
      static constexpr const int OnReadBinaryContent = 7;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnReadBinaryContent
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_OnReadBinaryContent();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState OnReadBinaryContent
      static void _set_OnReadBinaryContent(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ReaderClosed
      static constexpr const int ReaderClosed = 8;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ReaderClosed
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_ReaderClosed();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState ReaderClosed
      static void _set_ReaderClosed(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState EOF
      static constexpr const int _EOF = 9;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState EOF
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_EOF();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState EOF
      static void _set_EOF(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // static field const value: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState Error
      static constexpr const int Error = 10;
      // Get static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState Error
      static System::Xml::XsdValidatingReader::ValidatingReaderState _get_Error();
      // Set static field: static public System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState Error
      static void _set_Error(System::Xml::XsdValidatingReader::ValidatingReaderState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState
    #pragma pack(pop)
    static check_size<sizeof(XsdValidatingReader::ValidatingReaderState), 0 + sizeof(int)> __System_Xml_XsdValidatingReader_ValidatingReaderStateSizeCheck;
    static_assert(sizeof(XsdValidatingReader::ValidatingReaderState) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.XmlReader coreReader
    // Size: 0x8
    // Offset: 0x10
    System::Xml::XmlReader* coreReader;
    // Field size check
    static_assert(sizeof(System::Xml::XmlReader*) == 0x8);
    // private System.Xml.IXmlNamespaceResolver coreReaderNSResolver
    // Size: 0x8
    // Offset: 0x18
    System::Xml::IXmlNamespaceResolver* coreReaderNSResolver;
    // Field size check
    static_assert(sizeof(System::Xml::IXmlNamespaceResolver*) == 0x8);
    // private System.Xml.IXmlNamespaceResolver thisNSResolver
    // Size: 0x8
    // Offset: 0x20
    System::Xml::IXmlNamespaceResolver* thisNSResolver;
    // Field size check
    static_assert(sizeof(System::Xml::IXmlNamespaceResolver*) == 0x8);
    // private System.Xml.Schema.XmlSchemaValidator validator
    // Size: 0x8
    // Offset: 0x28
    System::Xml::Schema::XmlSchemaValidator* validator;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaValidator*) == 0x8);
    // private System.Xml.XmlResolver xmlResolver
    // Size: 0x8
    // Offset: 0x30
    System::Xml::XmlResolver* xmlResolver;
    // Field size check
    static_assert(sizeof(System::Xml::XmlResolver*) == 0x8);
    // private System.Xml.Schema.ValidationEventHandler validationEvent
    // Size: 0x8
    // Offset: 0x38
    System::Xml::Schema::ValidationEventHandler* validationEvent;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::ValidationEventHandler*) == 0x8);
    // private System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState validationState
    // Size: 0x4
    // Offset: 0x40
    System::Xml::XsdValidatingReader::ValidatingReaderState validationState;
    // Field size check
    static_assert(sizeof(System::Xml::XsdValidatingReader::ValidatingReaderState) == 0x4);
    // Padding between fields: validationState and: valueGetter
    char __padding6[0x4] = {};
    // private System.Xml.Schema.XmlValueGetter valueGetter
    // Size: 0x8
    // Offset: 0x48
    System::Xml::Schema::XmlValueGetter* valueGetter;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlValueGetter*) == 0x8);
    // private System.Xml.XmlNamespaceManager nsManager
    // Size: 0x8
    // Offset: 0x50
    System::Xml::XmlNamespaceManager* nsManager;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNamespaceManager*) == 0x8);
    // private System.Boolean manageNamespaces
    // Size: 0x1
    // Offset: 0x58
    bool manageNamespaces;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean processInlineSchema
    // Size: 0x1
    // Offset: 0x59
    bool processInlineSchema;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean replayCache
    // Size: 0x1
    // Offset: 0x5A
    bool replayCache;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: replayCache and: cachedNode
    char __padding11[0x5] = {};
    // private System.Xml.ValidatingReaderNodeData cachedNode
    // Size: 0x8
    // Offset: 0x60
    System::Xml::ValidatingReaderNodeData* cachedNode;
    // Field size check
    static_assert(sizeof(System::Xml::ValidatingReaderNodeData*) == 0x8);
    // private System.Xml.AttributePSVIInfo attributePSVI
    // Size: 0x8
    // Offset: 0x68
    System::Xml::AttributePSVIInfo* attributePSVI;
    // Field size check
    static_assert(sizeof(System::Xml::AttributePSVIInfo*) == 0x8);
    // private System.Int32 attributeCount
    // Size: 0x4
    // Offset: 0x70
    int attributeCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 coreReaderAttributeCount
    // Size: 0x4
    // Offset: 0x74
    int coreReaderAttributeCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 currentAttrIndex
    // Size: 0x4
    // Offset: 0x78
    int currentAttrIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: currentAttrIndex and: attributePSVINodes
    char __padding16[0x4] = {};
    // private System.Xml.AttributePSVIInfo[] attributePSVINodes
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<System::Xml::AttributePSVIInfo*> attributePSVINodes;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Xml::AttributePSVIInfo*>) == 0x8);
    // private System.Collections.ArrayList defaultAttributes
    // Size: 0x8
    // Offset: 0x88
    System::Collections::ArrayList* defaultAttributes;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Xml.Schema.Parser inlineSchemaParser
    // Size: 0x8
    // Offset: 0x90
    System::Xml::Schema::Parser* inlineSchemaParser;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::Parser*) == 0x8);
    // private System.Object atomicValue
    // Size: 0x8
    // Offset: 0x98
    ::Il2CppObject* atomicValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Xml.Schema.XmlSchemaInfo xmlSchemaInfo
    // Size: 0x8
    // Offset: 0xA0
    System::Xml::Schema::XmlSchemaInfo* xmlSchemaInfo;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaInfo*) == 0x8);
    // private System.String originalAtomicValueString
    // Size: 0x8
    // Offset: 0xA8
    ::StringW originalAtomicValueString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlNameTable coreReaderNameTable
    // Size: 0x8
    // Offset: 0xB0
    System::Xml::XmlNameTable* coreReaderNameTable;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.XsdCachingReader cachingReader
    // Size: 0x8
    // Offset: 0xB8
    System::Xml::XsdCachingReader* cachingReader;
    // Field size check
    static_assert(sizeof(System::Xml::XsdCachingReader*) == 0x8);
    // private System.Xml.ValidatingReaderNodeData textNode
    // Size: 0x8
    // Offset: 0xC0
    System::Xml::ValidatingReaderNodeData* textNode;
    // Field size check
    static_assert(sizeof(System::Xml::ValidatingReaderNodeData*) == 0x8);
    // private System.String NsXmlNs
    // Size: 0x8
    // Offset: 0xC8
    ::StringW NsXmlNs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String NsXs
    // Size: 0x8
    // Offset: 0xD0
    ::StringW NsXs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String NsXsi
    // Size: 0x8
    // Offset: 0xD8
    ::StringW NsXsi;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsiType
    // Size: 0x8
    // Offset: 0xE0
    ::StringW XsiType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsiNil
    // Size: 0x8
    // Offset: 0xE8
    ::StringW XsiNil;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsdSchema
    // Size: 0x8
    // Offset: 0xF0
    ::StringW XsdSchema;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsiSchemaLocation
    // Size: 0x8
    // Offset: 0xF8
    ::StringW XsiSchemaLocation;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsiNoNamespaceSchemaLocation
    // Size: 0x8
    // Offset: 0x100
    ::StringW XsiNoNamespaceSchemaLocation;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0x108
    System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(System::Xml::XmlCharType) == 0x8);
    // private System.Xml.IXmlLineInfo lineInfo
    // Size: 0x8
    // Offset: 0x110
    System::Xml::IXmlLineInfo* lineInfo;
    // Field size check
    static_assert(sizeof(System::Xml::IXmlLineInfo*) == 0x8);
    // private System.Xml.ReadContentAsBinaryHelper readBinaryHelper
    // Size: 0x8
    // Offset: 0x118
    System::Xml::ReadContentAsBinaryHelper* readBinaryHelper;
    // Field size check
    static_assert(sizeof(System::Xml::ReadContentAsBinaryHelper*) == 0x8);
    // private System.Xml.XsdValidatingReader/System.Xml.ValidatingReaderState savedState
    // Size: 0x4
    // Offset: 0x120
    System::Xml::XsdValidatingReader::ValidatingReaderState savedState;
    // Field size check
    static_assert(sizeof(System::Xml::XsdValidatingReader::ValidatingReaderState) == 0x4);
    public:
    // Creating interface conversion operator: operator System::Xml::IXmlLineInfo
    operator System::Xml::IXmlLineInfo() noexcept {
      return *reinterpret_cast<System::Xml::IXmlLineInfo*>(this);
    }
    // Creating interface conversion operator: operator System::Xml::IXmlNamespaceResolver
    operator System::Xml::IXmlNamespaceResolver() noexcept {
      return *reinterpret_cast<System::Xml::IXmlNamespaceResolver*>(this);
    }
    // Creating interface conversion operator: operator System::Xml::Schema::IXmlSchemaInfo
    operator System::Xml::Schema::IXmlSchemaInfo() noexcept {
      return *reinterpret_cast<System::Xml::Schema::IXmlSchemaInfo*>(this);
    }
    // Get static field: static private System.Type TypeOfString
