// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.UIElements.StyleSheets.StylePropertyID
#include "UnityEngine/UIElements/StyleSheets/StylePropertyID.hpp"
// Including type: UnityEngine.UIElements.StyleKeyword
#include "UnityEngine/UIElements/StyleKeyword.hpp"
// Including type: UnityEngine.UIElements.Length
#include "UnityEngine/UIElements/Length.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Runtime.InteropServices.GCHandle
#include "System/Runtime/InteropServices/GCHandle.hpp"
// Completed includes
// Type namespace: UnityEngine.UIElements.StyleSheets
namespace UnityEngine::UIElements::StyleSheets {
  // Forward declaring type: StyleValue
  struct StyleValue;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::StyleSheets::StyleValue, "UnityEngine.UIElements.StyleSheets", "StyleValue");
// Type namespace: UnityEngine.UIElements.StyleSheets
namespace UnityEngine::UIElements::StyleSheets {
  // Size: 0xC
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: UnityEngine.UIElements.StyleSheets.StyleValue
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerDisplayAttribute] Offset: 9401BC
  struct StyleValue/*, public ::System::ValueType*/ {
    public:
    public:
    // public UnityEngine.UIElements.StyleSheets.StylePropertyID id
    // Size: 0x4
    // Offset: 0x0
    ::UnityEngine::UIElements::StyleSheets::StylePropertyID id;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleSheets::StylePropertyID) == 0x4);
    // public UnityEngine.UIElements.StyleKeyword keyword
    // Size: 0x4
    // Offset: 0x4
    ::UnityEngine::UIElements::StyleKeyword keyword;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleKeyword) == 0x4);
    // Creating union for fields at offset: 0x8
    union {
      // public System.Single number
      // Size: 0x4
      // Offset: 0x8
      float number;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public UnityEngine.UIElements.Length length
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::UIElements::Length length;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::Length) == 0x8);
      // public UnityEngine.Color color
      // Size: 0x10
      // Offset: 0x8
      ::UnityEngine::Color color;
      // Field size check
      static_assert(sizeof(::UnityEngine::Color) == 0x10);
      // public System.Runtime.InteropServices.GCHandle resource
      // Size: 0x4
      // Offset: 0x8
      ::System::Runtime::InteropServices::GCHandle resource;
      // Field size check
      static_assert(sizeof(::System::Runtime::InteropServices::GCHandle) == 0x4);
    };
    public:
    // Creating value type constructor for type: StyleValue
    constexpr StyleValue(::UnityEngine::UIElements::StyleSheets::StylePropertyID id_ = {}, ::UnityEngine::UIElements::StyleKeyword keyword_ = {}, float number_ = {}) noexcept : id{id_}, keyword{keyword_}, number{number_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public UnityEngine.UIElements.StyleSheets.StylePropertyID id
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::StyleSheets::StylePropertyID& dyn_id();
    // Get instance field reference: public UnityEngine.UIElements.StyleKeyword keyword
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::StyleKeyword& dyn_keyword();
    // Get instance field reference: public System.Single number
    [[deprecated("Use field access instead!")]] float& dyn_number();
    // Get instance field reference: public UnityEngine.UIElements.Length length
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::Length& dyn_length();
    // Get instance field reference: public UnityEngine.Color color
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_color();
    // Get instance field reference: public System.Runtime.InteropServices.GCHandle resource
    [[deprecated("Use field access instead!")]] ::System::Runtime::InteropServices::GCHandle& dyn_resource();
    // static public UnityEngine.UIElements.StyleSheets.StyleValue Create(UnityEngine.UIElements.StyleSheets.StylePropertyID id)
    // Offset: 0xDAEB20
    static ::UnityEngine::UIElements::StyleSheets::StyleValue Create(::UnityEngine::UIElements::StyleSheets::StylePropertyID id);
    // static public UnityEngine.UIElements.StyleSheets.StyleValue Create(UnityEngine.UIElements.StyleSheets.StylePropertyID id, UnityEngine.UIElements.StyleKeyword keyword)
    // Offset: 0xDAEB04
    static ::UnityEngine::UIElements::StyleSheets::StyleValue Create(::UnityEngine::UIElements::StyleSheets::StylePropertyID id, ::UnityEngine::UIElements::StyleKeyword keyword);
    // static public UnityEngine.UIElements.StyleSheets.StyleValue Create(UnityEngine.UIElements.StyleSheets.StylePropertyID id, System.Single number)
    // Offset: 0xDAEAD8
    static ::UnityEngine::UIElements::StyleSheets::StyleValue Create(::UnityEngine::UIElements::StyleSheets::StylePropertyID id, float number);
    // static public UnityEngine.UIElements.StyleSheets.StyleValue Create(UnityEngine.UIElements.StyleSheets.StylePropertyID id, System.Int32 number)
    // Offset: 0xDAEAEC
    static ::UnityEngine::UIElements::StyleSheets::StyleValue Create(::UnityEngine::UIElements::StyleSheets::StylePropertyID id, int number);
    // static public UnityEngine.UIElements.StyleSheets.StyleValue Create(UnityEngine.UIElements.StyleSheets.StylePropertyID id, UnityEngine.Color color)
    // Offset: 0xDAEB10
    static ::UnityEngine::UIElements::StyleSheets::StyleValue Create(::UnityEngine::UIElements::StyleSheets::StylePropertyID id, ::UnityEngine::Color color);
  }; // UnityEngine.UIElements.StyleSheets.StyleValue
  #pragma pack(pop)
  static check_size<sizeof(StyleValue), 8 + sizeof(::System::Runtime::InteropServices::GCHandle)> __UnityEngine_UIElements_StyleSheets_StyleValueSizeCheck;
  static_assert(sizeof(StyleValue) == 0xC);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSheets::StyleValue::Create
// Il2CppName: Create
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::StyleSheets::StyleValue (*)(::UnityEngine::UIElements::StyleSheets::StylePropertyID)>(&UnityEngine::UIElements::StyleSheets::StyleValue::Create)> {
  static const MethodInfo* get() {
    static auto* id = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements.StyleSheets", "StylePropertyID")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSheets::StyleValue), "Create", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{id});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSheets::StyleValue::Create
// Il2CppName: Create
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::StyleSheets::StyleValue (*)(::UnityEngine::UIElements::StyleSheets::StylePropertyID, ::UnityEngine::UIElements::StyleKeyword)>(&UnityEngine::UIElements::StyleSheets::StyleValue::Create)> {
  static const MethodInfo* get() {
    static auto* id = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements.StyleSheets", "StylePropertyID")->byval_arg;
    static auto* keyword = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "StyleKeyword")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSheets::StyleValue), "Create", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{id, keyword});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSheets::StyleValue::Create
// Il2CppName: Create
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::StyleSheets::StyleValue (*)(::UnityEngine::UIElements::StyleSheets::StylePropertyID, float)>(&UnityEngine::UIElements::StyleSheets::StyleValue::Create)> {
  static const MethodInfo* get() {
    static auto* id = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements.StyleSheets", "StylePropertyID")->byval_arg;
    static auto* number = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSheets::StyleValue), "Create", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{id, number});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSheets::StyleValue::Create
// Il2CppName: Create
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::StyleSheets::StyleValue (*)(::UnityEngine::UIElements::StyleSheets::StylePropertyID, int)>(&UnityEngine::UIElements::StyleSheets::StyleValue::Create)> {
  static const MethodInfo* get() {
    static auto* id = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements.StyleSheets", "StylePropertyID")->byval_arg;
    static auto* number = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSheets::StyleValue), "Create", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{id, number});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSheets::StyleValue::Create
// Il2CppName: Create
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::StyleSheets::StyleValue (*)(::UnityEngine::UIElements::StyleSheets::StylePropertyID, ::UnityEngine::Color)>(&UnityEngine::UIElements::StyleSheets::StyleValue::Create)> {
  static const MethodInfo* get() {
    static auto* id = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements.StyleSheets", "StylePropertyID")->byval_arg;
    static auto* color = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSheets::StyleValue), "Create", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{id, color});
  }
};
