// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Reflection.LocalVariableInfo
#include "System/Reflection/LocalVariableInfo.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Reflection::Emit
namespace System::Reflection::Emit {
  // Forward declaring type: ILGenerator
  class ILGenerator;
}
// Completed forward declares
// Type namespace: System.Reflection.Emit
namespace System::Reflection::Emit {
  // Size: 0x38
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Reflection.Emit.LocalBuilder
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: D9B9DC
  // [ClassInterfaceAttribute] Offset: D9B9DC
  class LocalBuilder : public System::Reflection::LocalVariableInfo {
    public:
    // Writing base type padding for base size: 0x1C to desired offset: 0x20
    char ___base_padding[0x4] = {};
    // private System.String name
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.Reflection.Emit.ILGenerator ilgen
    // Size: 0x8
    // Offset: 0x28
    System::Reflection::Emit::ILGenerator* ilgen;
    // Field size check
    static_assert(sizeof(System::Reflection::Emit::ILGenerator*) == 0x8);
    // private System.Int32 startOffset
    // Size: 0x4
    // Offset: 0x30
    int startOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 endOffset
    // Size: 0x4
    // Offset: 0x34
    int endOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: LocalBuilder
    LocalBuilder(::Il2CppString* name_ = {}, System::Reflection::Emit::ILGenerator* ilgen_ = {}, int startOffset_ = {}, int endOffset_ = {}) noexcept : name{name_}, ilgen{ilgen_}, startOffset{startOffset_}, endOffset{endOffset_} {}
    // Get instance field: private System.String name
    ::Il2CppString* _get_name();
    // Set instance field: private System.String name
    void _set_name(::Il2CppString* value);
    // Get instance field: System.Reflection.Emit.ILGenerator ilgen
    System::Reflection::Emit::ILGenerator* _get_ilgen();
    // Set instance field: System.Reflection.Emit.ILGenerator ilgen
    void _set_ilgen(System::Reflection::Emit::ILGenerator* value);
    // Get instance field: private System.Int32 startOffset
    int _get_startOffset();
    // Set instance field: private System.Int32 startOffset
    void _set_startOffset(int value);
    // Get instance field: private System.Int32 endOffset
    int _get_endOffset();
    // Set instance field: private System.Int32 endOffset
    void _set_endOffset(int value);
  }; // System.Reflection.Emit.LocalBuilder
  #pragma pack(pop)
  static check_size<sizeof(LocalBuilder), 52 + sizeof(int)> __System_Reflection_Emit_LocalBuilderSizeCheck;
  static_assert(sizeof(LocalBuilder) == 0x38);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Reflection::Emit::LocalBuilder*, "System.Reflection.Emit", "LocalBuilder");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
