// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: Mono.RuntimeStructs
#include "Mono/RuntimeStructs.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Completed includes
// Type namespace: Mono
namespace Mono {
  // Size: 0x20
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Mono.RuntimeStructs/Mono.GenericParamInfo
  // [TokenAttribute] Offset: FFFFFFFF
  struct RuntimeStructs::GenericParamInfo/*, public System::ValueType*/ {
    public:
    // Mono.RuntimeStructs/Mono.MonoClass* pklass
    // Size: 0x8
    // Offset: 0x0
    Mono::RuntimeStructs::MonoClass* pklass;
    // Field size check
    static_assert(sizeof(Mono::RuntimeStructs::MonoClass*) == 0x8);
    // System.IntPtr name
    // Size: 0x8
    // Offset: 0x8
    System::IntPtr name;
    // Field size check
    static_assert(sizeof(System::IntPtr) == 0x8);
    // System.UInt16 flags
    // Size: 0x2
    // Offset: 0x10
    uint16_t flags;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: flags and: token
    char __padding2[0x2] = {};
    // System.UInt32 token
    // Size: 0x4
    // Offset: 0x14
    uint token;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Mono.RuntimeStructs/Mono.MonoClass** constraints
    // Size: 0x8
    // Offset: 0x18
    Mono::RuntimeStructs::MonoClass** constraints;
    // Field size check
    static_assert(sizeof(Mono::RuntimeStructs::MonoClass**) == 0x8);
    // Creating value type constructor for type: GenericParamInfo
    constexpr GenericParamInfo(Mono::RuntimeStructs::MonoClass* pklass_ = {}, System::IntPtr name_ = {}, uint16_t flags_ = {}, uint token_ = {}, Mono::RuntimeStructs::MonoClass** constraints_ = {}) noexcept : pklass{pklass_}, name{name_}, flags{flags_}, token{token_}, constraints{constraints_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: Mono.RuntimeStructs/Mono.MonoClass* pklass
    Mono::RuntimeStructs::MonoClass* _get_pklass();
    // Set instance field: Mono.RuntimeStructs/Mono.MonoClass* pklass
    void _set_pklass(Mono::RuntimeStructs::MonoClass* value);
    // Get instance field: System.IntPtr name
    System::IntPtr _get_name();
    // Set instance field: System.IntPtr name
    void _set_name(System::IntPtr value);
    // Get instance field: System.UInt16 flags
    uint16_t _get_flags();
    // Set instance field: System.UInt16 flags
    void _set_flags(uint16_t value);
    // Get instance field: System.UInt32 token
    uint _get_token();
    // Set instance field: System.UInt32 token
    void _set_token(uint value);
    // Get instance field: Mono.RuntimeStructs/Mono.MonoClass** constraints
    Mono::RuntimeStructs::MonoClass** _get_constraints();
    // Set instance field: Mono.RuntimeStructs/Mono.MonoClass** constraints
    void _set_constraints(Mono::RuntimeStructs::MonoClass** value);
  }; // Mono.RuntimeStructs/Mono.GenericParamInfo
  #pragma pack(pop)
  static check_size<sizeof(RuntimeStructs::GenericParamInfo), 24 + sizeof(Mono::RuntimeStructs::MonoClass**)> __Mono_RuntimeStructs_GenericParamInfoSizeCheck;
  static_assert(sizeof(RuntimeStructs::GenericParamInfo) == 0x20);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Mono::RuntimeStructs::GenericParamInfo, "Mono", "RuntimeStructs/GenericParamInfo");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
