// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Data.InternalDataCollectionBase
#include "System/Data/InternalDataCollectionBase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: Constraint
  class Constraint;
  // Forward declaring type: DataColumn
  class DataColumn;
  // Forward declaring type: UniqueConstraint
  class UniqueConstraint;
  // Forward declaring type: ForeignKeyConstraint
  class ForeignKeyConstraint;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: CollectionChangeEventHandler
  class CollectionChangeEventHandler;
  // Forward declaring type: CollectionChangeEventArgs
  class CollectionChangeEventArgs;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: ConstraintCollection
  class ConstraintCollection;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Data::ConstraintCollection);
DEFINE_IL2CPP_ARG_TYPE(::System::Data::ConstraintCollection*, "System.Data", "ConstraintCollection");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0x39
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.ConstraintCollection
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultEventAttribute] Offset: 11D0170
  // [DefaultMemberAttribute] Offset: 11D0170
  class ConstraintCollection : public ::System::Data::InternalDataCollectionBase {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly System.Data.DataTable _table
    // Size: 0x8
    // Offset: 0x10
    ::System::Data::DataTable* table;
    // Field size check
    static_assert(sizeof(::System::Data::DataTable*) == 0x8);
    // private readonly System.Collections.ArrayList _list
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::ArrayList* list;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // private System.Int32 _defaultNameIndex
    // Size: 0x4
    // Offset: 0x20
    int defaultNameIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: defaultNameIndex and: onCollectionChanged
    char __padding2[0x4] = {};
    // private System.ComponentModel.CollectionChangeEventHandler _onCollectionChanged
    // Size: 0x8
    // Offset: 0x28
    ::System::ComponentModel::CollectionChangeEventHandler* onCollectionChanged;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::CollectionChangeEventHandler*) == 0x8);
    // private System.Data.Constraint[] _delayLoadingConstraints
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::System::Data::Constraint*> delayLoadingConstraints;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Data::Constraint*>) == 0x8);
    // private System.Boolean _fLoadForeignKeyConstraintsOnly
    // Size: 0x1
    // Offset: 0x38
    bool fLoadForeignKeyConstraintsOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private readonly System.Data.DataTable _table
    ::System::Data::DataTable*& dyn__table();
    // Get instance field reference: private readonly System.Collections.ArrayList _list
    ::System::Collections::ArrayList*& dyn__list();
    // Get instance field reference: private System.Int32 _defaultNameIndex
    int& dyn__defaultNameIndex();
    // Get instance field reference: private System.ComponentModel.CollectionChangeEventHandler _onCollectionChanged
    ::System::ComponentModel::CollectionChangeEventHandler*& dyn__onCollectionChanged();
    // Get instance field reference: private System.Data.Constraint[] _delayLoadingConstraints
    ::ArrayW<::System::Data::Constraint*>& dyn__delayLoadingConstraints();
    // Get instance field reference: private System.Boolean _fLoadForeignKeyConstraintsOnly
    bool& dyn__fLoadForeignKeyConstraintsOnly();
    // public System.Data.Constraint get_Item(System.Int32 index)
    // Offset: 0x1E48AB4
    ::System::Data::Constraint* get_Item(int index);
    // System.Data.DataTable get_Table()
    // Offset: 0x1E48BB4
    ::System::Data::DataTable* get_Table();
    // public System.Data.Constraint get_Item(System.String name)
    // Offset: 0x1E48BBC
    ::System::Data::Constraint* get_Item(::StringW name);
    // System.Void .ctor(System.Data.DataTable table)
    // Offset: 0x1E48A08
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ConstraintCollection* New_ctor(::System::Data::DataTable* table) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Data::ConstraintCollection::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ConstraintCollection*, creationType>(table)));
    }
    // public System.Void Add(System.Data.Constraint constraint)
    // Offset: 0x1E48E20
    void Add(::System::Data::Constraint* constraint);
    // System.Void Add(System.Data.Constraint constraint, System.Boolean addUniqueWhenAddingForeign)
    // Offset: 0x1E48E28
    void Add(::System::Data::Constraint* constraint, bool addUniqueWhenAddingForeign);
    // public System.Data.Constraint Add(System.String name, System.Data.DataColumn[] columns, System.Boolean primaryKey)
    // Offset: 0x1E49848
    ::System::Data::Constraint* Add(::StringW name, ::ArrayW<::System::Data::DataColumn*> columns, bool primaryKey);
    // private System.Void AddUniqueConstraint(System.Data.UniqueConstraint constraint)
    // Offset: 0x1E49418
    void AddUniqueConstraint(::System::Data::UniqueConstraint* constraint);
    // private System.Void AddForeignKeyConstraint(System.Data.ForeignKeyConstraint constraint)
    // Offset: 0x1E49664
    void AddForeignKeyConstraint(::System::Data::ForeignKeyConstraint* constraint);
    // private System.Boolean AutoGenerated(System.Data.Constraint constraint)
    // Offset: 0x1E4934C
    bool AutoGenerated(::System::Data::Constraint* constraint);
    // private System.Void ArrayAdd(System.Data.Constraint constraint)
    // Offset: 0x1E497E4
    void ArrayAdd(::System::Data::Constraint* constraint);
    // private System.Void ArrayRemove(System.Data.Constraint constraint)
    // Offset: 0x1E498F8
    void ArrayRemove(::System::Data::Constraint* constraint);
    // System.String AssignName()
    // Offset: 0x1E49634
    ::StringW AssignName();
    // private System.Void BaseAdd(System.Data.Constraint constraint)
    // Offset: 0x1E496F8
    void BaseAdd(::System::Data::Constraint* constraint);
    // private System.Void BaseGroupSwitch(System.Data.Constraint[] oldArray, System.Int32 oldLength, System.Data.Constraint[] newArray, System.Int32 newLength)
    // Offset: 0x1E499F4
    void BaseGroupSwitch(::ArrayW<::System::Data::Constraint*> oldArray, int oldLength, ::ArrayW<::System::Data::Constraint*> newArray, int newLength);
    // private System.Void BaseRemove(System.Data.Constraint constraint)
    // Offset: 0x1E49BC0
    void BaseRemove(::System::Data::Constraint* constraint);
    // System.Boolean CanRemove(System.Data.Constraint constraint, System.Boolean fThrowException)
    // Offset: 0x1E49E48
    bool CanRemove(::System::Data::Constraint* constraint, bool fThrowException);
    // public System.Void Clear()
    // Offset: 0x1E49E78
    void Clear();
    // public System.Boolean Contains(System.String name)
    // Offset: 0x1E4A244
    bool Contains(::StringW name);
    // System.Boolean Contains(System.String name, System.Boolean caseSensitive)
    // Offset: 0x1E4A260
    bool Contains(::StringW name, bool caseSensitive);
    // System.Data.Constraint FindConstraint(System.Data.Constraint constraint)
    // Offset: 0x1E491B8
    ::System::Data::Constraint* FindConstraint(::System::Data::Constraint* constraint);
    // System.Data.UniqueConstraint FindKeyConstraint(System.Data.DataColumn[] columns)
    // Offset: 0x1E49520
    ::System::Data::UniqueConstraint* FindKeyConstraint(::ArrayW<::System::Data::DataColumn*> columns);
    // System.Data.UniqueConstraint FindKeyConstraint(System.Data.DataColumn column)
    // Offset: 0x1E4A418
    ::System::Data::UniqueConstraint* FindKeyConstraint(::System::Data::DataColumn* column);
    // System.Data.ForeignKeyConstraint FindForeignKeyConstraint(System.Data.DataColumn[] parentColumns, System.Data.DataColumn[] childColumns)
    // Offset: 0x1E4A534
    ::System::Data::ForeignKeyConstraint* FindForeignKeyConstraint(::ArrayW<::System::Data::DataColumn*> parentColumns, ::ArrayW<::System::Data::DataColumn*> childColumns);
    // static private System.Boolean CompareArrays(System.Data.DataColumn[] a1, System.Data.DataColumn[] a2)
    // Offset: 0x1E4A38C
    static bool CompareArrays(::ArrayW<::System::Data::DataColumn*> a1, ::ArrayW<::System::Data::DataColumn*> a2);
    // System.Int32 InternalIndexOf(System.String constraintName)
    // Offset: 0x1E48CAC
    int InternalIndexOf(::StringW constraintName);
    // private System.String MakeName(System.Int32 index)
    // Offset: 0x1E4993C
    ::StringW MakeName(int index);
    // private System.Void OnCollectionChanged(System.ComponentModel.CollectionChangeEventArgs ccevent)
    // Offset: 0x1E49828
    void OnCollectionChanged(::System::ComponentModel::CollectionChangeEventArgs* ccevent);
    // System.Void RegisterName(System.String name)
    // Offset: 0x1E48418
    void RegisterName(::StringW name);
    // public System.Void Remove(System.Data.Constraint constraint)
    // Offset: 0x1E4A674
    void Remove(::System::Data::Constraint* constraint);
    // System.Void UnregisterName(System.String name)
    // Offset: 0x1E48618
    void UnregisterName(::StringW name);
    // protected override System.Collections.ArrayList get_List()
    // Offset: 0x1E48AAC
    // Implemented from: System.Data.InternalDataCollectionBase
    // Base method: System.Collections.ArrayList InternalDataCollectionBase::get_List()
    ::System::Collections::ArrayList* get_List();
  }; // System.Data.ConstraintCollection
  #pragma pack(pop)
  static check_size<sizeof(ConstraintCollection), 56 + sizeof(bool)> __System_Data_ConstraintCollectionSizeCheck;
  static_assert(sizeof(ConstraintCollection) == 0x39);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Data::ConstraintCollection::get_Item
// Il2CppName: get_Item
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Data::Constraint* (System::Data::ConstraintCollection::*)(int)>(&System::Data::ConstraintCollection::get_Item)> {
  static const MethodInfo* get() {
    static auto* index = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Data::ConstraintCollection*), "get_Item", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{index});
  }
};
// Writing MetadataGetter for method: System::Data::ConstraintCollection::get_Table
// Il2CppName: get_Table
template<>
