// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Data.DataRowAction
#include "System/Data/DataRowAction.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: DataColumnCollection
  class DataColumnCollection;
  // Forward declaring type: DataColumn
  class DataColumn;
  // Forward declaring type: DataError
  class DataError;
  // Forward declaring type: DataRowState
  struct DataRowState;
  // Forward declaring type: DataRowVersion
  struct DataRowVersion;
  // Forward declaring type: DataRowBuilder
  class DataRowBuilder;
  // Forward declaring type: DataRelation
  class DataRelation;
  // Forward declaring type: DataKey
  struct DataKey;
  // Forward declaring type: DataViewRowState
  struct DataViewRowState;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: DataRow
  class DataRow;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Data::DataRow);
DEFINE_IL2CPP_ARG_TYPE(System::Data::DataRow*, "System.Data", "DataRow");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.DataRow
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: 11D0434
  class DataRow : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly System.Data.DataTable _table
    // Size: 0x8
    // Offset: 0x10
    System::Data::DataTable* table;
    // Field size check
    static_assert(sizeof(System::Data::DataTable*) == 0x8);
    // private readonly System.Data.DataColumnCollection _columns
    // Size: 0x8
    // Offset: 0x18
    System::Data::DataColumnCollection* columns;
    // Field size check
    static_assert(sizeof(System::Data::DataColumnCollection*) == 0x8);
    // System.Int32 _oldRecord
    // Size: 0x4
    // Offset: 0x20
    int oldRecord;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 _newRecord
    // Size: 0x4
    // Offset: 0x24
    int newRecord;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 _tempRecord
    // Size: 0x4
    // Offset: 0x28
    int tempRecord;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: tempRecord and: rowID
    char __padding4[0x4] = {};
    // System.Int64 _rowID
    // Size: 0x8
    // Offset: 0x30
    int64_t rowID;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Data.DataRowAction _action
    // Size: 0x4
    // Offset: 0x38
    System::Data::DataRowAction action;
    // Field size check
    static_assert(sizeof(System::Data::DataRowAction) == 0x4);
    // System.Boolean _inChangingEvent
    // Size: 0x1
    // Offset: 0x3C
    bool inChangingEvent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean _inDeletingEvent
    // Size: 0x1
    // Offset: 0x3D
    bool inDeletingEvent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean _inCascade
    // Size: 0x1
    // Offset: 0x3E
    bool inCascade;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inCascade and: lastChangedColumn
    char __padding9[0x1] = {};
    // private System.Data.DataColumn _lastChangedColumn
    // Size: 0x8
    // Offset: 0x40
    System::Data::DataColumn* lastChangedColumn;
    // Field size check
    static_assert(sizeof(System::Data::DataColumn*) == 0x8);
    // private System.Int32 _countColumnChange
    // Size: 0x4
    // Offset: 0x48
    int countColumnChange;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: countColumnChange and: error
    char __padding11[0x4] = {};
    // private System.Data.DataError _error
    // Size: 0x8
    // Offset: 0x50
    System::Data::DataError* error;
    // Field size check
    static_assert(sizeof(System::Data::DataError*) == 0x8);
    // private System.Int32 _rbTreeNodeId
    // Size: 0x4
    // Offset: 0x58
    int rbTreeNodeId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // readonly System.Int32 _objectID
    // Size: 0x4
    // Offset: 0x5C
    int objectID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private System.Int32 s_objectTypeCount
    static int _get_s_objectTypeCount();
    // Set static field: static private System.Int32 s_objectTypeCount
    static void _set_s_objectTypeCount(int value);
    // Get instance field reference: private readonly System.Data.DataTable _table
    System::Data::DataTable*& dyn__table();
    // Get instance field reference: private readonly System.Data.DataColumnCollection _columns
    System::Data::DataColumnCollection*& dyn__columns();
    // Get instance field reference: System.Int32 _oldRecord
    int& dyn__oldRecord();
    // Get instance field reference: System.Int32 _newRecord
    int& dyn__newRecord();
    // Get instance field reference: System.Int32 _tempRecord
    int& dyn__tempRecord();
    // Get instance field reference: System.Int64 _rowID
    int64_t& dyn__rowID();
