// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Data.DataKey
#include "System/Data/DataKey.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataSet
  class DataSet;
  // Forward declaring type: PropertyCollection
  class PropertyCollection;
  // Forward declaring type: UniqueConstraint
  class UniqueConstraint;
  // Forward declaring type: ForeignKeyConstraint
  class ForeignKeyConstraint;
  // Forward declaring type: DataColumn
  class DataColumn;
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: DataRow
  class DataRow;
  // Forward declaring type: DataRowVersion
  struct DataRowVersion;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: PropertyChangedEventHandler
  class PropertyChangedEventHandler;
  // Forward declaring type: PropertyChangedEventArgs
  class PropertyChangedEventArgs;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: DataRelation
  class DataRelation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Data::DataRelation);
DEFINE_IL2CPP_ARG_TYPE(::System::Data::DataRelation*, "System.Data", "DataRelation");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.DataRelation
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultPropertyAttribute] Offset: 11D02B8
  // [TypeConverterAttribute] Offset: 11D02B8
  class DataRelation : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Data.DataSet _dataSet
    // Size: 0x8
    // Offset: 0x10
    ::System::Data::DataSet* dataSet;
    // Field size check
    static_assert(sizeof(::System::Data::DataSet*) == 0x8);
    // System.Data.PropertyCollection _extendedProperties
    // Size: 0x8
    // Offset: 0x18
    ::System::Data::PropertyCollection* extendedProperties;
    // Field size check
    static_assert(sizeof(::System::Data::PropertyCollection*) == 0x8);
    // System.String _relationName
    // Size: 0x8
    // Offset: 0x20
    ::StringW relationName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Data.DataKey _childKey
    // Size: 0x8
    // Offset: 0x28
    ::System::Data::DataKey childKey;
    // Field size check
    static_assert(sizeof(::System::Data::DataKey) == 0x8);
    // private System.Data.DataKey _parentKey
    // Size: 0x8
    // Offset: 0x30
    ::System::Data::DataKey parentKey;
    // Field size check
    static_assert(sizeof(::System::Data::DataKey) == 0x8);
    // private System.Data.UniqueConstraint _parentKeyConstraint
    // Size: 0x8
    // Offset: 0x38
    ::System::Data::UniqueConstraint* parentKeyConstraint;
    // Field size check
    static_assert(sizeof(::System::Data::UniqueConstraint*) == 0x8);
    // private System.Data.ForeignKeyConstraint _childKeyConstraint
    // Size: 0x8
    // Offset: 0x40
    ::System::Data::ForeignKeyConstraint* childKeyConstraint;
    // Field size check
    static_assert(sizeof(::System::Data::ForeignKeyConstraint*) == 0x8);
    // System.Boolean _nested
    // Size: 0x1
    // Offset: 0x48
    bool nested;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean _createConstraints
    // Size: 0x1
    // Offset: 0x49
    bool createConstraints;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _checkMultipleNested
    // Size: 0x1
    // Offset: 0x4A
    bool checkMultipleNested;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: checkMultipleNested and: objectID
    char __padding9[0x1] = {};
    // private readonly System.Int32 _objectID
    // Size: 0x4
    // Offset: 0x4C
    int objectID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.ComponentModel.PropertyChangedEventHandler PropertyChanging
    // Size: 0x8
    // Offset: 0x50
    ::System::ComponentModel::PropertyChangedEventHandler* PropertyChanging;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::PropertyChangedEventHandler*) == 0x8);
    public:
    // Get static field: static private System.Int32 s_objectTypeCount
    static int _get_s_objectTypeCount();
    // Set static field: static private System.Int32 s_objectTypeCount
    static void _set_s_objectTypeCount(int value);
    // Get instance field reference: private System.Data.DataSet _dataSet
    ::System::Data::DataSet*& dyn__dataSet();
    // Get instance field reference: System.Data.PropertyCollection _extendedProperties
    ::System::Data::PropertyCollection*& dyn__extendedProperties();
    // Get instance field reference: System.String _relationName
    ::StringW& dyn__relationName();
    // Get instance field reference: private System.Data.DataKey _childKey
    ::System::Data::DataKey& dyn__childKey();
