// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Data.InternalDataCollectionBase
#include "System/Data/InternalDataCollectionBase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: DataColumn
  class DataColumn;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: CollectionChangeEventHandler
  class CollectionChangeEventHandler;
  // Forward declaring type: CollectionChangeEventArgs
  class CollectionChangeEventArgs;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: DataColumnCollection
  class DataColumnCollection;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Data::DataColumnCollection);
DEFINE_IL2CPP_ARG_TYPE(System::Data::DataColumnCollection*, "System.Data", "DataColumnCollection");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.DataColumnCollection
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultEventAttribute] Offset: 11D0258
  // [DefaultMemberAttribute] Offset: 11D0258
  class DataColumnCollection : public System::Data::InternalDataCollectionBase {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly System.Data.DataTable _table
    // Size: 0x8
    // Offset: 0x10
    System::Data::DataTable* table;
    // Field size check
    static_assert(sizeof(System::Data::DataTable*) == 0x8);
    // private readonly System.Collections.ArrayList _list
    // Size: 0x8
    // Offset: 0x18
    System::Collections::ArrayList* list;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Int32 _defaultNameIndex
    // Size: 0x4
    // Offset: 0x20
    int defaultNameIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: defaultNameIndex and: delayedAddRangeColumns
    char __padding2[0x4] = {};
    // private System.Data.DataColumn[] _delayedAddRangeColumns
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<System::Data::DataColumn*> delayedAddRangeColumns;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Data::DataColumn*>) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.String,System.Data.DataColumn> _columnFromName
    // Size: 0x8
    // Offset: 0x30
    System::Collections::Generic::Dictionary_2<::StringW, System::Data::DataColumn*>* columnFromName;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::StringW, System::Data::DataColumn*>*) == 0x8);
    // private System.Boolean _fInClear
    // Size: 0x1
    // Offset: 0x38
    bool fInClear;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fInClear and: columnsImplementingIChangeTracking
    char __padding5[0x7] = {};
    // private System.Data.DataColumn[] _columnsImplementingIChangeTracking
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<System::Data::DataColumn*> columnsImplementingIChangeTracking;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Data::DataColumn*>) == 0x8);
    // private System.Int32 _nColumnsImplementingIChangeTracking
    // Size: 0x4
    // Offset: 0x48
    int nColumnsImplementingIChangeTracking;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _nColumnsImplementingIRevertibleChangeTracking
    // Size: 0x4
    // Offset: 0x4C
    int nColumnsImplementingIRevertibleChangeTracking;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.ComponentModel.CollectionChangeEventHandler CollectionChanged
    // Size: 0x8
    // Offset: 0x50
    System::ComponentModel::CollectionChangeEventHandler* CollectionChanged;
    // Field size check
    static_assert(sizeof(System::ComponentModel::CollectionChangeEventHandler*) == 0x8);
    // private System.ComponentModel.CollectionChangeEventHandler CollectionChanging
    // Size: 0x8
    // Offset: 0x58
    System::ComponentModel::CollectionChangeEventHandler* CollectionChanging;
    // Field size check
    static_assert(sizeof(System::ComponentModel::CollectionChangeEventHandler*) == 0x8);
    // private System.ComponentModel.CollectionChangeEventHandler ColumnPropertyChanged
    // Size: 0x8
    // Offset: 0x60
    System::ComponentModel::CollectionChangeEventHandler* ColumnPropertyChanged;
    // Field size check
    static_assert(sizeof(System::ComponentModel::CollectionChangeEventHandler*) == 0x8);
    public:
    // Get instance field reference: private readonly System.Data.DataTable _table
    System::Data::DataTable*& dyn__table();
    // Get instance field reference: private readonly System.Collections.ArrayList _list
    System::Collections::ArrayList*& dyn__list();
    // Get instance field reference: private System.Int32 _defaultNameIndex
    int& dyn__defaultNameIndex();
    // Get instance field reference: private System.Data.DataColumn[] _delayedAddRangeColumns
    ::ArrayW<System::Data::DataColumn*>& dyn__delayedAddRangeColumns();
    // Get instance field reference: private readonly System.Collections.Generic.Dictionary`2<System.String,System.Data.DataColumn> _columnFromName
