// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ComponentModel.MarshalByValueComponent
#include "System/ComponentModel/MarshalByValueComponent.hpp"
// Including type: System.ComponentModel.IBindingList
#include "System/ComponentModel/IBindingList.hpp"
// Including type: System.Data.DataViewRowState
#include "System/Data/DataViewRowState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataViewManager
  class DataViewManager;
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: Index
  class Index;
  // Forward declaring type: DataRow
  class DataRow;
  // Forward declaring type: IFilter
  class IFilter;
  // Forward declaring type: DataRowView
  class DataRowView;
  // Forward declaring type: DataViewListener
  class DataViewListener;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Comparison`1<T>
  template<typename T>
  class Comparison_1;
  // Forward declaring type: Array
  class Array;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: ListChangedEventArgs
  class ListChangedEventArgs;
  // Forward declaring type: ListChangedEventHandler
  class ListChangedEventHandler;
  // Forward declaring type: ListChangedType
  struct ListChangedType;
  // Forward declaring type: CollectionChangeEventArgs
  class CollectionChangeEventArgs;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: DataView
  class DataView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Data::DataView);
DEFINE_IL2CPP_ARG_TYPE(::System::Data::DataView*, "System.Data", "DataView");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0xAC
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.DataView
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultPropertyAttribute] Offset: 11D06A0
  // [DefaultEventAttribute] Offset: 11D06A0
  // [DefaultMemberAttribute] Offset: 11D06A0
  class DataView : public ::System::ComponentModel::MarshalByValueComponent/*, public ::System::ComponentModel::IBindingList*/ {
    public:
    // Nested type: ::System::Data::DataView::DataRowReferenceComparer
    class DataRowReferenceComparer;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Data.DataViewManager _dataViewManager
    // Size: 0x8
    // Offset: 0x20
    ::System::Data::DataViewManager* dataViewManager;
    // Field size check
    static_assert(sizeof(::System::Data::DataViewManager*) == 0x8);
    // private System.Data.DataTable _table
    // Size: 0x8
    // Offset: 0x28
    ::System::Data::DataTable* table;
    // Field size check
    static_assert(sizeof(::System::Data::DataTable*) == 0x8);
    // private System.Boolean _locked
    // Size: 0x1
    // Offset: 0x30
    bool locked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: locked and: index
    char __padding2[0x7] = {};
    // private System.Data.Index _index
    // Size: 0x8
    // Offset: 0x38
    ::System::Data::Index* index;
    // Field size check
    static_assert(sizeof(::System::Data::Index*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Data.Index> _findIndexes
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Data::Index*>* findIndexes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Data::Index*>*) == 0x8);
    // private System.String _sort
    // Size: 0x8
    // Offset: 0x48
    ::StringW sort;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Comparison`1<System.Data.DataRow> _comparison
    // Size: 0x8
    // Offset: 0x50
    ::System::Comparison_1<::System::Data::DataRow*>* comparison;
    // Field size check
    static_assert(sizeof(::System::Comparison_1<::System::Data::DataRow*>*) == 0x8);
    // private System.Data.IFilter _rowFilter
    // Size: 0x8
    // Offset: 0x58
    ::System::Data::IFilter* rowFilter;
    // Field size check
    static_assert(sizeof(::System::Data::IFilter*) == 0x8);
    // private System.Data.DataViewRowState _recordStates
    // Size: 0x4
    // Offset: 0x60
    ::System::Data::DataViewRowState recordStates;
    // Field size check
    static_assert(sizeof(::System::Data::DataViewRowState) == 0x4);
    // private System.Boolean _shouldOpen
    // Size: 0x1
    // Offset: 0x64
    bool shouldOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _open
    // Size: 0x1
    // Offset: 0x65
    bool open;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _allowNew
    // Size: 0x1
    // Offset: 0x66
    bool allowNew;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _allowEdit
    // Size: 0x1
    // Offset: 0x67
    bool allowEdit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _allowDelete
    // Size: 0x1
    // Offset: 0x68
    bool allowDelete;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _applyDefaultSort
    // Size: 0x1
    // Offset: 0x69
    bool applyDefaultSort;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: applyDefaultSort and: addNewRow
    char __padding14[0x6] = {};
    // System.Data.DataRow _addNewRow
    // Size: 0x8
    // Offset: 0x70
    ::System::Data::DataRow* addNewRow;
    // Field size check
    static_assert(sizeof(::System::Data::DataRow*) == 0x8);
    // private System.ComponentModel.ListChangedEventArgs _addNewMoved
    // Size: 0x8
    // Offset: 0x78
    ::System::ComponentModel::ListChangedEventArgs* addNewMoved;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::ListChangedEventArgs*) == 0x8);
    // private System.ComponentModel.ListChangedEventHandler _onListChanged
    // Size: 0x8
    // Offset: 0x80
    ::System::ComponentModel::ListChangedEventHandler* onListChanged;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::ListChangedEventHandler*) == 0x8);
    // private System.Data.DataViewRowState _delayedRecordStates
    // Size: 0x4
    // Offset: 0x88
    ::System::Data::DataViewRowState delayedRecordStates;
    // Field size check
    static_assert(sizeof(::System::Data::DataViewRowState) == 0x4);
    // private System.Boolean _fEndInitInProgress
    // Size: 0x1
    // Offset: 0x8C
    bool fEndInitInProgress;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fEndInitInProgress and: rowViewCache
    char __padding19[0x3] = {};
    // private System.Collections.Generic.Dictionary`2<System.Data.DataRow,System.Data.DataRowView> _rowViewCache
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::Dictionary_2<::System::Data::DataRow*, ::System::Data::DataRowView*>* rowViewCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::System::Data::DataRow*, ::System::Data::DataRowView*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.Data.DataRow,System.Data.DataRowView> _rowViewBuffer
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::Dictionary_2<::System::Data::DataRow*, ::System::Data::DataRowView*>* rowViewBuffer;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::System::Data::DataRow*, ::System::Data::DataRowView*>*) == 0x8);
    // private System.Data.DataViewListener _dvListener
    // Size: 0x8
    // Offset: 0xA0
    ::System::Data::DataViewListener* dvListener;
    // Field size check
    static_assert(sizeof(::System::Data::DataViewListener*) == 0x8);
    // private readonly System.Int32 _objectID
    // Size: 0x4
    // Offset: 0xA8
    int objectID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::System::ComponentModel::IBindingList
    operator ::System::ComponentModel::IBindingList() noexcept {
      return *reinterpret_cast<::System::ComponentModel::IBindingList*>(this);
    }
    // Get static field: static System.ComponentModel.ListChangedEventArgs s_resetEventArgs
    static ::System::ComponentModel::ListChangedEventArgs* _get_s_resetEventArgs();
    // Set static field: static System.ComponentModel.ListChangedEventArgs s_resetEventArgs
    static void _set_s_resetEventArgs(::System::ComponentModel::ListChangedEventArgs* value);
    // Get static field: static private System.Int32 s_objectTypeCount
    static int _get_s_objectTypeCount();
    // Set static field: static private System.Int32 s_objectTypeCount
    static void _set_s_objectTypeCount(int value);
