// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ComponentModel.MarshalByValueComponent
#include "System/ComponentModel/MarshalByValueComponent.hpp"
// Including type: System.Data.Common.StorageType
#include "System/Data/Common/StorageType.hpp"
// Including type: System.Data.DataSetDateTime
#include "System/Data/DataSetDateTime.hpp"
// Including type: System.Data.MappingType
#include "System/Data/MappingType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: IFormatProvider
  class IFormatProvider;
}
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataExpression
  class DataExpression;
  // Forward declaring type: Index
  class Index;
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: PropertyCollection
  class PropertyCollection;
  // Forward declaring type: AutoIncrementValue
  class AutoIncrementValue;
  // Forward declaring type: SimpleType
  class SimpleType;
  // Forward declaring type: DataRow
  class DataRow;
  // Forward declaring type: DataRowVersion
  struct DataRowVersion;
  // Forward declaring type: DataRowAction
  struct DataRowAction;
  // Forward declaring type: AggregateType
  struct AggregateType;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Data::Common
namespace System::Data::Common {
  // Forward declaring type: DataStorage
  class DataStorage;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: PropertyChangedEventHandler
  class PropertyChangedEventHandler;
  // Forward declaring type: PropertyChangedEventArgs
  class PropertyChangedEventArgs;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: XmlWriter
  class XmlWriter;
}
// Forward declaring namespace: System::Xml::Serialization
namespace System::Xml::Serialization {
  // Forward declaring type: XmlRootAttribute
  class XmlRootAttribute;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: BitArray
  class BitArray;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: DataColumn
  class DataColumn;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Data::DataColumn);
DEFINE_IL2CPP_ARG_TYPE(System::Data::DataColumn*, "System.Data", "DataColumn");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0xF0
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.DataColumn
  // [TokenAttribute] Offset: FFFFFFFF
  // [ToolboxItemAttribute] Offset: 11D01D0
  // [DefaultPropertyAttribute] Offset: 11D01D0
  // [DesignTimeVisibleAttribute] Offset: 11D01D0
  // [DefaultMemberAttribute] Offset: 11D01D0
  class DataColumn : public System::ComponentModel::MarshalByValueComponent {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean _allowNull
    // Size: 0x1
    // Offset: 0x20
    bool allowNull;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allowNull and: caption
    char __padding0[0x7] = {};
    // private System.String _caption
    // Size: 0x8
    // Offset: 0x28
    ::StringW caption;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _columnName
    // Size: 0x8
    // Offset: 0x30
    ::StringW columnName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Type _dataType
    // Size: 0x8
    // Offset: 0x38
    System::Type* dataType;
    // Field size check
    static_assert(sizeof(System::Type*) == 0x8);
    // private System.Data.Common.StorageType _storageType
    // Size: 0x4
    // Offset: 0x40
    System::Data::Common::StorageType storageType;
    // Field size check
    static_assert(sizeof(System::Data::Common::StorageType) == 0x4);
    // Padding between fields: storageType and: defaultValue
    char __padding4[0x4] = {};
    // System.Object _defaultValue
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* defaultValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Data.DataSetDateTime _dateTimeMode
    // Size: 0x4
    // Offset: 0x50
    System::Data::DataSetDateTime dateTimeMode;
    // Field size check
    static_assert(sizeof(System::Data::DataSetDateTime) == 0x4);
    // Padding between fields: dateTimeMode and: expression
    char __padding6[0x4] = {};
    // private System.Data.DataExpression _expression
    // Size: 0x8
    // Offset: 0x58
    System::Data::DataExpression* expression;
    // Field size check
    static_assert(sizeof(System::Data::DataExpression*) == 0x8);
    // private System.Int32 _maxLength
    // Size: 0x4
    // Offset: 0x60
    int maxLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _ordinal
    // Size: 0x4
    // Offset: 0x64
    int ordinal;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _readOnly
    // Size: 0x1
    // Offset: 0x68
    bool readOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: readOnly and: sortIndex
    char __padding10[0x7] = {};
    // System.Data.Index _sortIndex
    // Size: 0x8
    // Offset: 0x70
    System::Data::Index* sortIndex;
    // Field size check
    static_assert(sizeof(System::Data::Index*) == 0x8);
    // System.Data.DataTable _table
    // Size: 0x8
    // Offset: 0x78
    System::Data::DataTable* table;
    // Field size check
    static_assert(sizeof(System::Data::DataTable*) == 0x8);
    // private System.Boolean _unique
    // Size: 0x1
    // Offset: 0x80
    bool unique;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: unique and: columnMapping
    char __padding13[0x3] = {};
    // System.Data.MappingType _columnMapping
    // Size: 0x4
    // Offset: 0x84
    System::Data::MappingType columnMapping;
    // Field size check
    static_assert(sizeof(System::Data::MappingType) == 0x4);
    // System.Int32 _hashCode
    // Size: 0x4
    // Offset: 0x88
    int hashCode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 _errors
    // Size: 0x4
    // Offset: 0x8C
    int errors;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _isSqlType
    // Size: 0x1
    // Offset: 0x90
    bool isSqlType;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _implementsINullable
    // Size: 0x1
    // Offset: 0x91
    bool implementsINullable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _implementsIChangeTracking
    // Size: 0x1
    // Offset: 0x92
    bool implementsIChangeTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _implementsIRevertibleChangeTracking
    // Size: 0x1
    // Offset: 0x93
    bool implementsIRevertibleChangeTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _implementsIXMLSerializable
    // Size: 0x1
    // Offset: 0x94
    bool implementsIXMLSerializable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _defaultValueIsNull
    // Size: 0x1
    // Offset: 0x95
    bool defaultValueIsNull;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: defaultValueIsNull and: dependentColumns
    char __padding22[0x2] = {};
    // System.Collections.Generic.List`1<System.Data.DataColumn> _dependentColumns
    // Size: 0x8
    // Offset: 0x98
    System::Collections::Generic::List_1<System::Data::DataColumn*>* dependentColumns;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<System::Data::DataColumn*>*) == 0x8);
    // System.Data.PropertyCollection _extendedProperties
    // Size: 0x8
    // Offset: 0xA0
    System::Data::PropertyCollection* extendedProperties;
    // Field size check
    static_assert(sizeof(System::Data::PropertyCollection*) == 0x8);
    // private System.Data.Common.DataStorage _storage
    // Size: 0x8
    // Offset: 0xA8
    System::Data::Common::DataStorage* storage;
    // Field size check
    static_assert(sizeof(System::Data::Common::DataStorage*) == 0x8);
    // private System.Data.AutoIncrementValue _autoInc
    // Size: 0x8
    // Offset: 0xB0
    System::Data::AutoIncrementValue* autoInc;
    // Field size check
    static_assert(sizeof(System::Data::AutoIncrementValue*) == 0x8);
    // System.String _columnUri
    // Size: 0x8
    // Offset: 0xB8
    ::StringW columnUri;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _columnPrefix
    // Size: 0x8
    // Offset: 0xC0
    ::StringW columnPrefix;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String _encodedColumnName
    // Size: 0x8
    // Offset: 0xC8
    ::StringW encodedColumnName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Data.SimpleType _simpleType
    // Size: 0x8
    // Offset: 0xD0
    System::Data::SimpleType* simpleType;
    // Field size check
    static_assert(sizeof(System::Data::SimpleType*) == 0x8);
    // private readonly System.Int32 _objectID
    // Size: 0x4
    // Offset: 0xD8
    int objectID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: objectID and: XmlDataType
    char __padding31[0x4] = {};
    // private System.String <XmlDataType>k__BackingField
    // Size: 0x8
    // Offset: 0xE0
    ::StringW XmlDataType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.ComponentModel.PropertyChangedEventHandler PropertyChanging
    // Size: 0x8
    // Offset: 0xE8
    System::ComponentModel::PropertyChangedEventHandler* PropertyChanging;
    // Field size check
    static_assert(sizeof(System::ComponentModel::PropertyChangedEventHandler*) == 0x8);
    public:
    // Get static field: static private System.Int32 s_objectTypeCount
    static int _get_s_objectTypeCount();
    // Set static field: static private System.Int32 s_objectTypeCount
    static void _set_s_objectTypeCount(int value);
    // Get instance field reference: private System.Boolean _allowNull
    bool& dyn__allowNull();
    // Get instance field reference: private System.String _caption
    ::StringW& dyn__caption();
    // Get instance field reference: private System.String _columnName
    ::StringW& dyn__columnName();
    // Get instance field reference: private System.Type _dataType
    System::Type*& dyn__dataType();
    // Get instance field reference: private System.Data.Common.StorageType _storageType
