// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Data.IndexField
#include "System/Data/IndexField.hpp"
// Including type: System.Data.DataViewRowState
#include "System/Data/DataViewRowState.hpp"
// Including type: System.Data.RBTree`1
#include "System/Data/RBTree_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: DataRow
  class DataRow;
  // Forward declaring type: Listeners`1<TElem>
  template<typename TElem>
  class Listeners_1;
  // Forward declaring type: DataViewListener
  class DataViewListener;
  // Forward declaring type: IFilter
  class IFilter;
  // Forward declaring type: DataColumnCollection
  class DataColumnCollection;
  // Forward declaring type: Range
  struct Range;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Comparison`1<T>
  template<typename T>
  class Comparison_1;
  // Forward declaring type: WeakReference
  class WeakReference;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: ListChangedType
  struct ListChangedType;
  // Forward declaring type: ListChangedEventArgs
  class ListChangedEventArgs;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: Index
  class Index;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Data::Index);
DEFINE_IL2CPP_ARG_TYPE(::System::Data::Index*, "System.Data", "Index");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.Index
  // [TokenAttribute] Offset: FFFFFFFF
  class Index : public ::Il2CppObject {
    public:
    // Nested type: ::System::Data::Index::IndexTree
    class IndexTree;
    // Nested type: ::System::Data::Index::$$c
    class $$c;
    // Nested type: ::System::Data::Index::$$c__DisplayClass86_0
    class $$c__DisplayClass86_0;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly System.Data.DataTable _table
    // Size: 0x8
    // Offset: 0x10
    ::System::Data::DataTable* table;
    // Field size check
    static_assert(sizeof(::System::Data::DataTable*) == 0x8);
    // readonly System.Data.IndexField[] _indexFields
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::System::Data::IndexField> indexFields;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Data::IndexField>) == 0x8);
    // private readonly System.Comparison`1<System.Data.DataRow> _comparison
    // Size: 0x8
    // Offset: 0x20
    ::System::Comparison_1<::System::Data::DataRow*>* comparison;
    // Field size check
    static_assert(sizeof(::System::Comparison_1<::System::Data::DataRow*>*) == 0x8);
    // private readonly System.Data.DataViewRowState _recordStates
    // Size: 0x4
    // Offset: 0x28
    ::System::Data::DataViewRowState recordStates;
    // Field size check
    static_assert(sizeof(::System::Data::DataViewRowState) == 0x4);
    // Padding between fields: recordStates and: rowFilter
    char __padding3[0x4] = {};
    // private System.WeakReference _rowFilter
    // Size: 0x8
    // Offset: 0x30
    ::System::WeakReference* rowFilter;
    // Field size check
    static_assert(sizeof(::System::WeakReference*) == 0x8);
    // private System.Data.Index/System.Data.IndexTree _records
    // Size: 0x8
    // Offset: 0x38
    ::System::Data::Index::IndexTree* records;
    // Field size check
    static_assert(sizeof(::System::Data::Index::IndexTree*) == 0x8);
    // private System.Int32 _recordCount
    // Size: 0x4
    // Offset: 0x40
    int recordCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _refCount
    // Size: 0x4
    // Offset: 0x44
    int refCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Data.Listeners`1<System.Data.DataViewListener> _listeners
    // Size: 0x8
    // Offset: 0x48
    ::System::Data::Listeners_1<::System::Data::DataViewListener*>* listeners;
    // Field size check
    static_assert(sizeof(::System::Data::Listeners_1<::System::Data::DataViewListener*>*) == 0x8);
    // private System.Boolean _suspendEvents
    // Size: 0x1
    // Offset: 0x50
    bool suspendEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.Boolean _isSharable
    // Size: 0x1
    // Offset: 0x51
    bool isSharable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.Boolean _hasRemoteAggregate
    // Size: 0x1
    // Offset: 0x52
    bool hasRemoteAggregate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasRemoteAggregate and: objectID
    char __padding11[0x1] = {};
    // private readonly System.Int32 _objectID
    // Size: 0x4
    // Offset: 0x54
    int objectID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private System.Int32 s_objectTypeCount
    static int _get_s_objectTypeCount();
    // Set static field: static private System.Int32 s_objectTypeCount
    static void _set_s_objectTypeCount(int value);
    // Get instance field reference: private readonly System.Data.DataTable _table
    ::System::Data::DataTable*& dyn__table();
    // Get instance field reference: readonly System.Data.IndexField[] _indexFields
    ::ArrayW<::System::Data::IndexField>& dyn__indexFields();
    // Get instance field reference: private readonly System.Comparison`1<System.Data.DataRow> _comparison
    ::System::Comparison_1<::System::Data::DataRow*>*& dyn__comparison();
    // Get instance field reference: private readonly System.Data.DataViewRowState _recordStates
    ::System::Data::DataViewRowState& dyn__recordStates();
