// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Collections.IEnumerable
#include "System/Collections/IEnumerable.hpp"
// Including type: System.Data.TreeAccessMethod
#include "System/Data/TreeAccessMethod.hpp"
// Including type: System.Collections.Generic.IEnumerator`1
#include "System/Collections/Generic/IEnumerator_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Skipping declaration: NodeColor because it is already included!
  // Skipping declaration: Node because it is already included!
  // Skipping declaration: NodePath because it is already included!
  // Skipping declaration: TreePage because it is already included!
  // Skipping declaration: RBTreeEnumerator because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Array
  class Array;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: RBTree`1<K>
  template<typename K>
  class RBTree_1;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(System::Data::RBTree_1, "System.Data", "RBTree`1");
// Type namespace: System.Data
namespace System::Data {
  // WARNING Size may be invalid!
  // Autogenerated type: System.Data.RBTree`1
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: 11D0808
  template<typename K>
  class RBTree_1 : public ::Il2CppObject/*, public System::Collections::IEnumerable*/ {
    public:
    // Nested type: System::Data::RBTree_1::NodeColor<K>
    struct NodeColor;
    // Nested type: System::Data::RBTree_1::Node<K>
    struct Node;
    // Nested type: System::Data::RBTree_1::NodePath<K>
    struct NodePath;
    // Nested type: System::Data::RBTree_1::TreePage<K>
    class TreePage;
    // Nested type: System::Data::RBTree_1::RBTreeEnumerator<K>
    struct RBTreeEnumerator;
    // WARNING Size may be invalid!
    // Autogenerated type: System.Data.RBTree`1/System.Data.NodeColor
    // [TokenAttribute] Offset: FFFFFFFF
    struct NodeColor : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public System::Enum*/ {
      public:
      using declaring_type = RBTree_1<K>*;
      static constexpr std::string_view NESTED_NAME = "NodeColor";
      static constexpr bool IS_VALUE_TYPE = true;
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NodeColor
      constexpr NodeColor(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // Autogenerated static field getter
      // Get static field: static public System.Data.RBTree`1/System.Data.NodeColor<K> red
      static typename System::Data::RBTree_1<K>::NodeColor _get_red() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::NodeColor::_get_red");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename System::Data::RBTree_1<K>::NodeColor>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename RBTree_1<K>::NodeColor>::get(), "red"));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Data.RBTree`1/System.Data.NodeColor<K> red
      static void _set_red(typename System::Data::RBTree_1<K>::NodeColor value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::NodeColor::_set_red");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename RBTree_1<K>::NodeColor>::get(), "red", value));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Data.RBTree`1/System.Data.NodeColor<K> black
      static typename System::Data::RBTree_1<K>::NodeColor _get_black() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::NodeColor::_get_black");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename System::Data::RBTree_1<K>::NodeColor>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename RBTree_1<K>::NodeColor>::get(), "black"));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Data.RBTree`1/System.Data.NodeColor<K> black
      static void _set_black(typename System::Data::RBTree_1<K>::NodeColor value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::NodeColor::_set_black");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename RBTree_1<K>::NodeColor>::get(), "black", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Int32 value__
      int& dyn_value__() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::NodeColor::dyn_value__");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "value__"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
    }; // System.Data.RBTree`1/System.Data.NodeColor
    // Could not write size check! Type: System.Data.RBTree`1/System.Data.NodeColor is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Data.RBTree`1/System.Data.Node
    // [TokenAttribute] Offset: FFFFFFFF
    struct Node : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public System::ValueType*/ {
      public:
      using declaring_type = RBTree_1<K>*;
      static constexpr std::string_view NESTED_NAME = "Node";
      static constexpr bool IS_VALUE_TYPE = true;
      public:
      // System.Int32 _selfId
      // Size: 0x4
      // Offset: 0x0
      int selfId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 _leftId
      // Size: 0x4
      // Offset: 0x0
      int leftId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 _rightId
      // Size: 0x4
      // Offset: 0x0
      int rightId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 _parentId
      // Size: 0x4
      // Offset: 0x0
      int parentId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 _nextId
      // Size: 0x4
      // Offset: 0x0
      int nextId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 _subTreeSize
      // Size: 0x4
      // Offset: 0x0
      int subTreeSize;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // K _keyOfNode
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      K keyOfNode;
      // System.Data.RBTree`1/System.Data.NodeColor<K> _nodeColor
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      typename System::Data::RBTree_1<K>::NodeColor nodeColor;
      public:
      // Creating value type constructor for type: Node
      constexpr Node(int selfId_ = {}, int leftId_ = {}, int rightId_ = {}, int parentId_ = {}, int nextId_ = {}, int subTreeSize_ = {}, K keyOfNode_ = {}, typename System::Data::RBTree_1<K>::NodeColor nodeColor_ = {}) noexcept : selfId{selfId_}, leftId{leftId_}, rightId{rightId_}, parentId{parentId_}, nextId{nextId_}, subTreeSize{subTreeSize_}, keyOfNode{keyOfNode_}, nodeColor{nodeColor_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Int32 _selfId
      int& dyn__selfId() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::Node::dyn__selfId");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_selfId"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Int32 _leftId
      int& dyn__leftId() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::Node::dyn__leftId");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_leftId"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Int32 _rightId
      int& dyn__rightId() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::Node::dyn__rightId");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_rightId"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Int32 _parentId
      int& dyn__parentId() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::Node::dyn__parentId");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_parentId"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Int32 _nextId
      int& dyn__nextId() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::Node::dyn__nextId");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_nextId"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Int32 _subTreeSize
      int& dyn__subTreeSize() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::Node::dyn__subTreeSize");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_subTreeSize"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: K _keyOfNode
      K& dyn__keyOfNode() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::Node::dyn__keyOfNode");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_keyOfNode"))->offset;
        return *reinterpret_cast<K*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Data.RBTree`1/System.Data.NodeColor<K> _nodeColor
      typename System::Data::RBTree_1<K>::NodeColor& dyn__nodeColor() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::Node::dyn__nodeColor");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_nodeColor"))->offset;
        return *reinterpret_cast<typename System::Data::RBTree_1<K>::NodeColor*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
    }; // System.Data.RBTree`1/System.Data.Node
    // Could not write size check! Type: System.Data.RBTree`1/System.Data.Node is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Data.RBTree`1/System.Data.NodePath
    // [TokenAttribute] Offset: FFFFFFFF
    struct NodePath : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public System::ValueType*/ {
      public:
      using declaring_type = RBTree_1<K>*;
      static constexpr std::string_view NESTED_NAME = "NodePath";
      static constexpr bool IS_VALUE_TYPE = true;
      public:
      // readonly System.Int32 _nodeID
      // Size: 0x4
      // Offset: 0x0
      int nodeID;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // readonly System.Int32 _mainTreeNodeID
      // Size: 0x4
      // Offset: 0x0
      int mainTreeNodeID;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NodePath
      constexpr NodePath(int nodeID_ = {}, int mainTreeNodeID_ = {}) noexcept : nodeID{nodeID_}, mainTreeNodeID{mainTreeNodeID_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Autogenerated instance field getter
      // Get instance field: readonly System.Int32 _nodeID
      int& dyn__nodeID() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::NodePath::dyn__nodeID");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_nodeID"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: readonly System.Int32 _mainTreeNodeID
      int& dyn__mainTreeNodeID() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::NodePath::dyn__mainTreeNodeID");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_mainTreeNodeID"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // System.Void .ctor(System.Int32 nodeID, System.Int32 mainTreeNodeID)
      // Offset: 0xFFFFFFFF
      // ABORTED: conflicts with another method.  NodePath(int nodeID, int mainTreeNodeID)
    }; // System.Data.RBTree`1/System.Data.NodePath
    // Could not write size check! Type: System.Data.RBTree`1/System.Data.NodePath is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: System.Data.RBTree`1/System.Data.TreePage
    // [TokenAttribute] Offset: FFFFFFFF
    class TreePage : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = RBTree_1<K>*;
      static constexpr std::string_view NESTED_NAME = "TreePage";
      static constexpr bool IS_VALUE_TYPE = false;
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      #ifdef CODEGEN_FIELD_ACCESSIBILITY
      CODEGEN_FIELD_ACCESSIBILITY:
      #else
      protected:
      #endif
      #endif
      // readonly System.Data.RBTree`1/System.Data.Node<K>[] _slots
      // Size: 0x8
      // Offset: 0x0
      ::ArrayW<typename System::Data::RBTree_1<K>::Node> slots;
      // Field size check
      static_assert(sizeof(::ArrayW<typename System::Data::RBTree_1<K>::Node>) == 0x8);
      // readonly System.Int32[] _slotMap
      // Size: 0x8
      // Offset: 0x0
      ::ArrayW<int> slotMap;
      // Field size check
      static_assert(sizeof(::ArrayW<int>) == 0x8);
      // private System.Int32 _inUseCount
      // Size: 0x4
      // Offset: 0x0
      int inUseCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 _pageId
      // Size: 0x4
      // Offset: 0x0
      int pageId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 _nextFreeSlotLine
      // Size: 0x4
      // Offset: 0x0
      int nextFreeSlotLine;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Autogenerated instance field getter
      // Get instance field: readonly System.Data.RBTree`1/System.Data.Node<K>[] _slots
      ::ArrayW<typename System::Data::RBTree_1<K>::Node>& dyn__slots() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::dyn__slots");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_slots"))->offset;
        return *reinterpret_cast<::ArrayW<typename System::Data::RBTree_1<K>::Node>*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: readonly System.Int32[] _slotMap
      ::ArrayW<int>& dyn__slotMap() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::dyn__slotMap");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_slotMap"))->offset;
        return *reinterpret_cast<::ArrayW<int>*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 _inUseCount
      int& dyn__inUseCount() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::dyn__inUseCount");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_inUseCount"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 _pageId
      int& dyn__pageId() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::dyn__pageId");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_pageId"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 _nextFreeSlotLine
      int& dyn__nextFreeSlotLine() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::dyn__nextFreeSlotLine");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_nextFreeSlotLine"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // System.Int32 get_InUseCount()
      // Offset: 0xFFFFFFFF
      int get_InUseCount() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::get_InUseCount");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "get_InUseCount", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<int, false>(this, ___internal__method);
      }
      // System.Void set_InUseCount(System.Int32 value)
      // Offset: 0xFFFFFFFF
      void set_InUseCount(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::set_InUseCount");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "set_InUseCount", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(value)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, value);
      }
      // System.Int32 get_PageId()
      // Offset: 0xFFFFFFFF
      int get_PageId() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::get_PageId");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "get_PageId", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<int, false>(this, ___internal__method);
      }
      // System.Void set_PageId(System.Int32 value)
      // Offset: 0xFFFFFFFF
      void set_PageId(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::set_PageId");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "set_PageId", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(value)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, value);
      }
      // System.Void .ctor(System.Int32 size)
      // Offset: 0xFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename RBTree_1<K>::TreePage* New_ctor(int size) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename RBTree_1<K>::TreePage*, creationType>(size)));
      }
      // System.Int32 AllocSlot(System.Data.RBTree`1<K> tree)
      // Offset: 0xFFFFFFFF
      int AllocSlot(System::Data::RBTree_1<K>* tree) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::TreePage::AllocSlot");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "AllocSlot", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(tree)})));
        return ::il2cpp_utils::RunMethodRethrow<int, false>(this, ___internal__method, tree);
      }
    }; // System.Data.RBTree`1/System.Data.TreePage
    // Could not write size check! Type: System.Data.RBTree`1/System.Data.TreePage is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Data.RBTree`1/System.Data.RBTreeEnumerator
    // [TokenAttribute] Offset: FFFFFFFF
    struct RBTreeEnumerator : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public System::ValueType, public System::Collections::Generic::IEnumerator_1<K>*/ {
      public:
      using declaring_type = RBTree_1<K>*;
      static constexpr std::string_view NESTED_NAME = "RBTreeEnumerator";
      static constexpr bool IS_VALUE_TYPE = true;
      public:
      // private readonly System.Data.RBTree`1<K> _tree
      // Size: 0x8
      // Offset: 0x0
      System::Data::RBTree_1<K>* tree;
      // Field size check
      static_assert(sizeof(System::Data::RBTree_1<K>*) == 0x8);
      // private readonly System.Int32 _version
      // Size: 0x4
      // Offset: 0x0
      int version;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 _index
      // Size: 0x4
      // Offset: 0x0
      int index;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 _mainTreeNodeId
      // Size: 0x4
      // Offset: 0x0
      int mainTreeNodeId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private K _current
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      K current;
      public:
      // Creating value type constructor for type: RBTreeEnumerator
      constexpr RBTreeEnumerator(System::Data::RBTree_1<K>* tree_ = {}, int version_ = {}, int index_ = {}, int mainTreeNodeId_ = {}, K current_ = {}) noexcept : tree{tree_}, version{version_}, index{index_}, mainTreeNodeId{mainTreeNodeId_}, current{current_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Creating interface conversion operator: operator System::Collections::Generic::IEnumerator_1<K>
      operator System::Collections::Generic::IEnumerator_1<K>() noexcept {
        return *reinterpret_cast<System::Collections::Generic::IEnumerator_1<K>*>(this);
      }
      // Autogenerated instance field getter
      // Get instance field: private readonly System.Data.RBTree`1<K> _tree
      System::Data::RBTree_1<K>*& dyn__tree() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::dyn__tree");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_tree"))->offset;
        return *reinterpret_cast<System::Data::RBTree_1<K>**>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private readonly System.Int32 _version
      int& dyn__version() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::dyn__version");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_version"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 _index
      int& dyn__index() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::dyn__index");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_index"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 _mainTreeNodeId
      int& dyn__mainTreeNodeId() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::dyn__mainTreeNodeId");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_mainTreeNodeId"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private K _current
      K& dyn__current() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::dyn__current");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_current"))->offset;
        return *reinterpret_cast<K*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // public K get_Current()
      // Offset: 0xFFFFFFFF
      K get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::get_Current");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "get_Current", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<K, false>(this, ___internal__method);
      }
      // private System.Object System.Collections.IEnumerator.get_Current()
      // Offset: 0xFFFFFFFF
      ::Il2CppObject* System_Collections_IEnumerator_get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::System.Collections.IEnumerator.get_Current");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "System.Collections.IEnumerator.get_Current", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<::Il2CppObject*, false>(this, ___internal__method);
      }
      // System.Void .ctor(System.Data.RBTree`1<K> tree)
      // Offset: 0xFFFFFFFF
      RBTreeEnumerator(System::Data::RBTree_1<K>* tree) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::.ctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(tree)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, tree);
      }
      // System.Void .ctor(System.Data.RBTree`1<K> tree, System.Int32 position)
      // Offset: 0xFFFFFFFF
      RBTreeEnumerator(System::Data::RBTree_1<K>* tree, int position) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::.ctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(tree), ::il2cpp_utils::ExtractType(position)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, tree, position);
      }
      // public System.Void Dispose()
      // Offset: 0xFFFFFFFF
      void Dispose() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::Dispose");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "Dispose", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method);
      }
      // public System.Boolean MoveNext()
      // Offset: 0xFFFFFFFF
      bool MoveNext() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::MoveNext");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "MoveNext", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<bool, false>(this, ___internal__method);
      }
      // private System.Void System.Collections.IEnumerator.Reset()
      // Offset: 0xFFFFFFFF
      void System_Collections_IEnumerator_Reset() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::RBTreeEnumerator::System.Collections.IEnumerator.Reset");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "System.Collections.IEnumerator.Reset", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method);
      }
    }; // System.Data.RBTree`1/System.Data.RBTreeEnumerator
    // Could not write size check! Type: System.Data.RBTree`1/System.Data.RBTreeEnumerator is generic, or has no fields that are valid for size checks!
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Data.RBTree`1/System.Data.TreePage<K>[] _pageTable
    // Size: 0x8
    // Offset: 0x0
    ::ArrayW<typename System::Data::RBTree_1<K>::TreePage*> pageTable;
    // Field size check
    static_assert(sizeof(::ArrayW<typename System::Data::RBTree_1<K>::TreePage*>) == 0x8);
    // private System.Int32[] _pageTableMap
    // Size: 0x8
    // Offset: 0x0
    ::ArrayW<int> pageTableMap;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Int32 _inUsePageCount
    // Size: 0x4
    // Offset: 0x0
    int inUsePageCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _nextFreePageLine
    // Size: 0x4
    // Offset: 0x0
    int nextFreePageLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 root
    // Size: 0x4
    // Offset: 0x0
    int root;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _version
    // Size: 0x4
    // Offset: 0x0
    int version;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _inUseNodeCount
    // Size: 0x4
    // Offset: 0x0
    int inUseNodeCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _inUseSatelliteTreeCount
    // Size: 0x4
    // Offset: 0x0
    int inUseSatelliteTreeCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Data.TreeAccessMethod _accessMethod
    // Size: 0x4
    // Offset: 0x0
    System::Data::TreeAccessMethod accessMethod;
    // Field size check
    static_assert(sizeof(System::Data::TreeAccessMethod) == 0x4);
    public:
    // Creating interface conversion operator: operator System::Collections::IEnumerable
    operator System::Collections::IEnumerable() noexcept {
      return *reinterpret_cast<System::Collections::IEnumerable*>(this);
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Data.RBTree`1/System.Data.TreePage<K>[] _pageTable
    ::ArrayW<typename System::Data::RBTree_1<K>::TreePage*>& dyn__pageTable() {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Data::RBTree_1::dyn__pageTable");
      auto ___internal__instance = this;
      static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_pageTable"))->offset;
      return *reinterpret_cast<::ArrayW<typename System::Data::RBTree_1<K>::TreePage*>*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
    }
    // Autogenerated instance field getter
