// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataSet
  class DataSet;
  // Forward declaring type: XmlToDatasetMap
  class XmlToDatasetMap;
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: DataRow
  class DataRow;
  // Forward declaring type: DataColumn
  class DataColumn;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: Stack
  class Stack;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlElement
  class XmlElement;
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: XmlNode
  class XmlNode;
  // Forward declaring type: XmlNodeType
  struct XmlNodeType;
  // Forward declaring type: XmlDocument
  class XmlDocument;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: XmlDataLoader
  class XmlDataLoader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Data::XmlDataLoader);
DEFINE_IL2CPP_ARG_TYPE(::System::Data::XmlDataLoader*, "System.Data", "XmlDataLoader");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.XmlDataLoader
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlDataLoader : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Data.DataSet _dataSet
    // Size: 0x8
    // Offset: 0x10
    ::System::Data::DataSet* dataSet;
    // Field size check
    static_assert(sizeof(::System::Data::DataSet*) == 0x8);
    // private System.Data.XmlToDatasetMap _nodeToSchemaMap
    // Size: 0x8
    // Offset: 0x18
    ::System::Data::XmlToDatasetMap* nodeToSchemaMap;
    // Field size check
    static_assert(sizeof(::System::Data::XmlToDatasetMap*) == 0x8);
    // private System.Collections.Hashtable _nodeToRowMap
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Hashtable* nodeToRowMap;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Stack _childRowsStack
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Stack* childRowsStack;
    // Field size check
    static_assert(sizeof(::System::Collections::Stack*) == 0x8);
    // private System.Collections.Hashtable _htableExcludedNS
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Hashtable* htableExcludedNS;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Boolean _fIsXdr
    // Size: 0x1
    // Offset: 0x38
    bool fIsXdr;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean _isDiffgram
    // Size: 0x1
    // Offset: 0x39
    bool isDiffgram;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isDiffgram and: topMostNode
    char __padding6[0x6] = {};
    // private System.Xml.XmlElement _topMostNode
    // Size: 0x8
    // Offset: 0x40
    ::System::Xml::XmlElement* topMostNode;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlElement*) == 0x8);
    // private System.Boolean _ignoreSchema
    // Size: 0x1
    // Offset: 0x48
    bool ignoreSchema;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ignoreSchema and: dataTable
    char __padding8[0x7] = {};
    // private System.Data.DataTable _dataTable
    // Size: 0x8
    // Offset: 0x50
    ::System::Data::DataTable* dataTable;
    // Field size check
    static_assert(sizeof(::System::Data::DataTable*) == 0x8);
    // private System.Boolean _isTableLevel
    // Size: 0x1
    // Offset: 0x58
    bool isTableLevel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _fromInference
    // Size: 0x1
    // Offset: 0x59
    bool fromInference;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fromInference and: dataReader
    char __padding11[0x6] = {};
    // private System.Xml.XmlReader _dataReader
    // Size: 0x8
    // Offset: 0x60
    ::System::Xml::XmlReader* dataReader;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlReader*) == 0x8);
    // private System.Object _XSD_XMLNS_NS
    // Size: 0x8
    // Offset: 0x68
    ::Il2CppObject* XSD_XMLNS_NS;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _XDR_SCHEMA
    // Size: 0x8
    // Offset: 0x70
    ::Il2CppObject* XDR_SCHEMA;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _XDRNS
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppObject* XDRNS;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _SQL_SYNC
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppObject* SQL_SYNC;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _UPDGNS
    // Size: 0x8
    // Offset: 0x88
    ::Il2CppObject* UPDGNS;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _XSD_SCHEMA
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppObject* XSD_SCHEMA;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _XSDNS
    // Size: 0x8
    // Offset: 0x98
    ::Il2CppObject* XSDNS;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _DFFNS
    // Size: 0x8
    // Offset: 0xA0
    ::Il2CppObject* DFFNS;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _MSDNS
    // Size: 0x8
    // Offset: 0xA8
    ::Il2CppObject* MSDNS;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _DIFFID
    // Size: 0x8
    // Offset: 0xB0
    ::Il2CppObject* DIFFID;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _HASCHANGES
    // Size: 0x8
    // Offset: 0xB8
    ::Il2CppObject* HASCHANGES;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _ROWORDER
    // Size: 0x8
    // Offset: 0xC0
    ::Il2CppObject* ROWORDER;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    public:
    // Get instance field reference: private System.Data.DataSet _dataSet
    ::System::Data::DataSet*& dyn__dataSet();
    // Get instance field reference: private System.Data.XmlToDatasetMap _nodeToSchemaMap
    ::System::Data::XmlToDatasetMap*& dyn__nodeToSchemaMap();
    // Get instance field reference: private System.Collections.Hashtable _nodeToRowMap
    ::System::Collections::Hashtable*& dyn__nodeToRowMap();
    // Get instance field reference: private System.Collections.Stack _childRowsStack
    ::System::Collections::Stack*& dyn__childRowsStack();
    // Get instance field reference: private System.Collections.Hashtable _htableExcludedNS
    ::System::Collections::Hashtable*& dyn__htableExcludedNS();
    // Get instance field reference: private System.Boolean _fIsXdr
    bool& dyn__fIsXdr();
