// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Data.SchemaFormat
#include "System/Data/SchemaFormat.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataSet
  class DataSet;
  // Forward declaring type: PropertyCollection
  class PropertyCollection;
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: DataRelation
  class DataRelation;
  // Forward declaring type: DataColumn
  class DataColumn;
  // Forward declaring type: AcceptRejectRule
  struct AcceptRejectRule;
  // Forward declaring type: Rule
  struct Rule;
  // Forward declaring type: UniqueConstraint
  class UniqueConstraint;
  // Forward declaring type: ForeignKeyConstraint
  class ForeignKeyConstraint;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlDocument
  class XmlDocument;
  // Forward declaring type: XmlElement
  class XmlElement;
  // Forward declaring type: XmlWriter
  class XmlWriter;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Converter`2<TInput, TOutput>
  class Converter_2;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: PropertyDescriptor
  class PropertyDescriptor;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: XmlTreeGen
  class XmlTreeGen;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Data::XmlTreeGen);
DEFINE_IL2CPP_ARG_TYPE(System::Data::XmlTreeGen*, "System.Data", "XmlTreeGen");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.XmlTreeGen
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlTreeGen : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Collections.ArrayList _constraintNames
    // Size: 0x8
    // Offset: 0x10
    System::Collections::ArrayList* constraintNames;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Collections.Hashtable _namespaces
    // Size: 0x8
    // Offset: 0x18
    System::Collections::Hashtable* namespaces;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable _autogenerated
    // Size: 0x8
    // Offset: 0x20
    System::Collections::Hashtable* autogenerated;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable _prefixes
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Hashtable* prefixes;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Data.DataSet _ds
    // Size: 0x8
    // Offset: 0x30
    System::Data::DataSet* ds;
    // Field size check
    static_assert(sizeof(System::Data::DataSet*) == 0x8);
    // private System.Collections.ArrayList _tables
    // Size: 0x8
    // Offset: 0x38
    System::Collections::ArrayList* tables;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Collections.ArrayList _relations
    // Size: 0x8
    // Offset: 0x40
    System::Collections::ArrayList* relations;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Xml.XmlDocument _dc
    // Size: 0x8
    // Offset: 0x48
    System::Xml::XmlDocument* dc;
    // Field size check
    static_assert(sizeof(System::Xml::XmlDocument*) == 0x8);
    // private System.Xml.XmlElement _sRoot
    // Size: 0x8
    // Offset: 0x50
    System::Xml::XmlElement* sRoot;
    // Field size check
    static_assert(sizeof(System::Xml::XmlElement*) == 0x8);
    // private System.Int32 _prefixCount
    // Size: 0x4
    // Offset: 0x58
    int prefixCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Data.SchemaFormat _schFormat
    // Size: 0x4
    // Offset: 0x5C
    System::Data::SchemaFormat schFormat;
    // Field size check
    static_assert(sizeof(System::Data::SchemaFormat) == 0x4);
    // private System.String _filePath
    // Size: 0x8
    // Offset: 0x60
    ::StringW filePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _fileName
    // Size: 0x8
    // Offset: 0x68
    ::StringW fileName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _fileExt
    // Size: 0x8
    // Offset: 0x70
    ::StringW fileExt;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlElement _dsElement
    // Size: 0x8
    // Offset: 0x78
    System::Xml::XmlElement* dsElement;
    // Field size check
    static_assert(sizeof(System::Xml::XmlElement*) == 0x8);
    // private System.Xml.XmlElement _constraintSeparator
    // Size: 0x8
    // Offset: 0x80
    System::Xml::XmlElement* constraintSeparator;
    // Field size check
    static_assert(sizeof(System::Xml::XmlElement*) == 0x8);
    // private System.Converter`2<System.Type,System.String> _targetConverter
    // Size: 0x8
    // Offset: 0x88
    System::Converter_2<System::Type*, ::StringW>* targetConverter;
    // Field size check
    static_assert(sizeof(System::Converter_2<System::Type*, ::StringW>*) == 0x8);
    public:
    // Get instance field reference: private System.Collections.ArrayList _constraintNames
    System::Collections::ArrayList*& dyn__constraintNames();
    // Get instance field reference: private System.Collections.Hashtable _namespaces
    System::Collections::Hashtable*& dyn__namespaces();
    // Get instance field reference: private System.Collections.Hashtable _autogenerated
    System::Collections::Hashtable*& dyn__autogenerated();
    // Get instance field reference: private System.Collections.Hashtable _prefixes
    System::Collections::Hashtable*& dyn__prefixes();
    // Get instance field reference: private System.Data.DataSet _ds
    System::Data::DataSet*& dyn__ds();
    // Get instance field reference: private System.Collections.ArrayList _tables
