// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Data.XMLSchema
#include "System/Data/XMLSchema.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Data
namespace System::Data {
  // Forward declaring type: DataSet
  class DataSet;
  // Forward declaring type: DataTable
  class DataTable;
  // Forward declaring type: DataColumn
  class DataColumn;
  // Forward declaring type: AcceptRejectRule
  struct AcceptRejectRule;
  // Forward declaring type: Rule
  struct Rule;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaSet
  class XmlSchemaSet;
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
  // Forward declaring type: XmlSchemaObjectCollection
  class XmlSchemaObjectCollection;
  // Forward declaring type: XmlSchema
  class XmlSchema;
  // Forward declaring type: XmlSchemaAnnotated
  class XmlSchemaAnnotated;
  // Forward declaring type: XmlSchemaParticle
  class XmlSchemaParticle;
  // Forward declaring type: XmlSchemaAnnotation
  class XmlSchemaAnnotation;
  // Forward declaring type: XmlSchemaAttributeGroup
  class XmlSchemaAttributeGroup;
  // Forward declaring type: XmlSchemaComplexType
  class XmlSchemaComplexType;
  // Forward declaring type: XmlSchemaIdentityConstraint
  class XmlSchemaIdentityConstraint;
  // Forward declaring type: XmlSchemaKeyref
  class XmlSchemaKeyref;
  // Forward declaring type: XmlSchemaSimpleType
  class XmlSchemaSimpleType;
  // Forward declaring type: XmlSchemaAttribute
  class XmlSchemaAttribute;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  class List_1;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlAttribute
  class XmlAttribute;
  // Forward declaring type: XmlAttributeCollection
  class XmlAttributeCollection;
  // Forward declaring type: XmlElement
  class XmlElement;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: System.Data
namespace System::Data {
  // Forward declaring type: XSDSchema
  class XSDSchema;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Data::XSDSchema);
DEFINE_IL2CPP_ARG_TYPE(System::Data::XSDSchema*, "System.Data", "XSDSchema");
// Type namespace: System.Data
namespace System::Data {
  // Size: 0xA1
  #pragma pack(push, 1)
  // Autogenerated type: System.Data.XSDSchema
  // [TokenAttribute] Offset: FFFFFFFF
  class XSDSchema : public System::Data::XMLSchema {
    public:
    // Nested type: System::Data::XSDSchema::NameType
    class NameType;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.Schema.XmlSchemaSet _schemaSet
    // Size: 0x8
    // Offset: 0x10
    System::Xml::Schema::XmlSchemaSet* schemaSet;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaSet*) == 0x8);
    // private System.Xml.Schema.XmlSchemaElement _dsElement
    // Size: 0x8
    // Offset: 0x18
    System::Xml::Schema::XmlSchemaElement* dsElement;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaElement*) == 0x8);
    // private System.Data.DataSet _ds
    // Size: 0x8
    // Offset: 0x20
    System::Data::DataSet* ds;
    // Field size check
    static_assert(sizeof(System::Data::DataSet*) == 0x8);
    // private System.String _schemaName
    // Size: 0x8
    // Offset: 0x28
    ::StringW schemaName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.ArrayList _columnExpressions
    // Size: 0x8
    // Offset: 0x30
    System::Collections::ArrayList* columnExpressions;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Collections.Hashtable _constraintNodes
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Hashtable* constraintNodes;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.ArrayList _refTables
    // Size: 0x8
    // Offset: 0x40
    System::Collections::ArrayList* refTables;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Collections.ArrayList _complexTypes
    // Size: 0x8
    // Offset: 0x48
    System::Collections::ArrayList* complexTypes;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectCollection _annotations
    // Size: 0x8
    // Offset: 0x50
    System::Xml::Schema::XmlSchemaObjectCollection* annotations;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectCollection*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectCollection _elements
    // Size: 0x8
    // Offset: 0x58
    System::Xml::Schema::XmlSchemaObjectCollection* elements;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectCollection*) == 0x8);
    // private System.Collections.Hashtable _attributes
    // Size: 0x8
    // Offset: 0x60
    System::Collections::Hashtable* attributes;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable _elementsTable
    // Size: 0x8
    // Offset: 0x68
    System::Collections::Hashtable* elementsTable;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable _attributeGroups
    // Size: 0x8
    // Offset: 0x70
    System::Collections::Hashtable* attributeGroups;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable _schemaTypes
    // Size: 0x8
    // Offset: 0x78
    System::Collections::Hashtable* schemaTypes;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable _expressions
    // Size: 0x8
    // Offset: 0x80
    System::Collections::Hashtable* expressions;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Data.DataTable,System.Collections.Generic.List`1<System.Data.DataTable>> _tableDictionary
    // Size: 0x8
    // Offset: 0x88
    System::Collections::Generic::Dictionary_2<System::Data::DataTable*, System::Collections::Generic::List_1<System::Data::DataTable*>*>* tableDictionary;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<System::Data::DataTable*, System::Collections::Generic::List_1<System::Data::DataTable*>*>*) == 0x8);
    // private System.Collections.Hashtable _udSimpleTypes
    // Size: 0x8
    // Offset: 0x90
    System::Collections::Hashtable* udSimpleTypes;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable _existingSimpleTypeMap
    // Size: 0x8
    // Offset: 0x98
    System::Collections::Hashtable* existingSimpleTypeMap;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Boolean _fromInference
    // Size: 0x1
    // Offset: 0xA0
    bool fromInference;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Data.XSDSchema/System.Data.NameType[] s_mapNameTypeXsd
    static ::ArrayW<System::Data::XSDSchema::NameType*> _get_s_mapNameTypeXsd();
    // Set static field: static private readonly System.Data.XSDSchema/System.Data.NameType[] s_mapNameTypeXsd
    static void _set_s_mapNameTypeXsd(::ArrayW<System::Data::XSDSchema::NameType*> value);
    // Get instance field reference: private System.Xml.Schema.XmlSchemaSet _schemaSet
    System::Xml::Schema::XmlSchemaSet*& dyn__schemaSet();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaElement _dsElement
    System::Xml::Schema::XmlSchemaElement*& dyn__dsElement();
    // Get instance field reference: private System.Data.DataSet _ds
    System::Data::DataSet*& dyn__ds();
    // Get instance field reference: private System.String _schemaName
