// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
#include "UnityEngine/ResourceManagement/AsyncOperations/AsyncOperationBase_1.hpp"
// Including type: UnityEngine.ResourceManagement.AsyncOperations.ICachable
#include "UnityEngine/ResourceManagement/AsyncOperations/ICachable.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::ResourceManagement::AsyncOperations
namespace UnityEngine::ResourceManagement::AsyncOperations {
  // Skipping declaration: GroupOperationSettings because it is already included!
  // Skipping declaration: DownloadStatus because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.ResourceManagement.AsyncOperations
namespace UnityEngine::ResourceManagement::AsyncOperations {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.ResourceManagement.AsyncOperations.GroupOperation
  class GroupOperation : public UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationBase_1<System::Collections::Generic::IList_1<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>*>/*, public UnityEngine::ResourceManagement::AsyncOperations::ICachable*/ {
    public:
    // Nested type: UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings
    struct GroupOperationSettings;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings
    // [FlagsAttribute] Offset: FFFFFFFF
    struct GroupOperationSettings/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: GroupOperationSettings
      constexpr GroupOperationSettings(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings None
      static UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings _get_None();
      // Set static field: static public UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings None
      static void _set_None(UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings value);
      // static field const value: static public UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings ReleaseDependenciesOnFailure
      static constexpr const int ReleaseDependenciesOnFailure = 1;
      // Get static field: static public UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings ReleaseDependenciesOnFailure
      static UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings _get_ReleaseDependenciesOnFailure();
      // Set static field: static public UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings ReleaseDependenciesOnFailure
      static void _set_ReleaseDependenciesOnFailure(UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings value);
      // static field const value: static public UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings AllowFailedDependencies
      static constexpr const int AllowFailedDependencies = 2;
      // Get static field: static public UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings AllowFailedDependencies
      static UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings _get_AllowFailedDependencies();
      // Set static field: static public UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings AllowFailedDependencies
      static void _set_AllowFailedDependencies(UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings value);
    }; // UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings
    #pragma pack(pop)
    static check_size<sizeof(GroupOperation::GroupOperationSettings), 0 + sizeof(int)> __UnityEngine_ResourceManagement_AsyncOperations_GroupOperation_GroupOperationSettingsSizeCheck;
    static_assert(sizeof(GroupOperation::GroupOperationSettings) == 0x4);
    // private System.Action`1<UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle> m_InternalOnComplete
    // Size: 0x8
    // Offset: 0x80
    System::Action_1<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* m_InternalOnComplete;
    // Field size check
    static_assert(sizeof(System::Action_1<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>*) == 0x8);
    // private System.Int32 m_LoadedCount
    // Size: 0x4
    // Offset: 0x88
    int m_LoadedCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings m_Settings
    // Size: 0x4
    // Offset: 0x8C
    UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings m_Settings;
    // Field size check
    static_assert(sizeof(UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings) == 0x4);
    // private System.String debugName
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppString* debugName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDFB270
    // private System.Int32 <UnityEngine.ResourceManagement.AsyncOperations.ICachable.Hash>k__BackingField
    // Size: 0x4
    // Offset: 0x98
    int Hash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.HashSet`1<System.String> m_CachedDependencyLocations
    // Size: 0x8
    // Offset: 0xA0
    System::Collections::Generic::HashSet_1<::Il2CppString*>* m_CachedDependencyLocations;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<::Il2CppString*>*) == 0x8);
    // Creating value type constructor for type: GroupOperation
    GroupOperation(System::Action_1<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* m_InternalOnComplete_ = {}, int m_LoadedCount_ = {}, UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings m_Settings_ = {}, ::Il2CppString* debugName_ = {}, int Hash_ = {}, System::Collections::Generic::HashSet_1<::Il2CppString*>* m_CachedDependencyLocations_ = {}) noexcept : m_InternalOnComplete{m_InternalOnComplete_}, m_LoadedCount{m_LoadedCount_}, m_Settings{m_Settings_}, debugName{debugName_}, Hash{Hash_}, m_CachedDependencyLocations{m_CachedDependencyLocations_} {}
    // Creating interface conversion operator: operator UnityEngine::ResourceManagement::AsyncOperations::ICachable
    operator UnityEngine::ResourceManagement::AsyncOperations::ICachable() noexcept {
      return *reinterpret_cast<UnityEngine::ResourceManagement::AsyncOperations::ICachable*>(this);
    }
    // static field const value: static private System.Int32 k_MaxDisplayedLocationLength
    static constexpr const int k_MaxDisplayedLocationLength = 45;
    // Get static field: static private System.Int32 k_MaxDisplayedLocationLength
    static int _get_k_MaxDisplayedLocationLength();
    // Set static field: static private System.Int32 k_MaxDisplayedLocationLength
    static void _set_k_MaxDisplayedLocationLength(int value);
    // private System.Int32 UnityEngine.ResourceManagement.AsyncOperations.ICachable.get_Hash()
    // Offset: 0x19A9AD0
    int UnityEngine_ResourceManagement_AsyncOperations_ICachable_get_Hash();
    // private System.Void UnityEngine.ResourceManagement.AsyncOperations.ICachable.set_Hash(System.Int32 value)
    // Offset: 0x19A9AD8
    void UnityEngine_ResourceManagement_AsyncOperations_ICachable_set_Hash(int value);
    // System.Collections.Generic.IList`1<UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle> GetDependentOps()
    // Offset: 0x19A9AE0
    System::Collections::Generic::IList_1<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* GetDependentOps();
    // private System.Boolean DependenciesAreUnchanged(System.Collections.Generic.List`1<UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle> deps)
    // Offset: 0x19AA078
    bool DependenciesAreUnchanged(System::Collections::Generic::List_1<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* deps);
    // private System.Void CompleteIfDependenciesComplete()
    // Offset: 0x19AA64C
    void CompleteIfDependenciesComplete();
    // public System.Void Init(System.Collections.Generic.List`1<UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle> operations, System.Boolean releaseDependenciesOnFailure, System.Boolean allowFailedDependencies)
    // Offset: 0x19AAC80
    void Init(System::Collections::Generic::List_1<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* operations, bool releaseDependenciesOnFailure, bool allowFailedDependencies);
    // public System.Void Init(System.Collections.Generic.List`1<UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle> operations, UnityEngine.ResourceManagement.AsyncOperations.GroupOperation/GroupOperationSettings settings)
    // Offset: 0x19AAD28
    void Init(System::Collections::Generic::List_1<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* operations, UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings settings);
    // private System.Void OnOperationCompleted(UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle op)
    // Offset: 0x19AADA8
    void OnOperationCompleted(UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);
    // public System.Void .ctor()
    // Offset: 0x19A947C
    // Implemented from: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
    // Base method: System.Void AsyncOperationBase_1::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GroupOperation* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GroupOperation*, creationType>()));
    }
    // override System.Boolean InvokeWaitForCompletion()
    // Offset: 0x19A9558
    // Implemented from: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
    // Base method: System.Boolean AsyncOperationBase_1::InvokeWaitForCompletion()
    bool InvokeWaitForCompletion();
    // protected override System.Void GetDependencies(System.Collections.Generic.List`1<UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle> deps)
    // Offset: 0x19A9B24
    // Implemented from: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
    // Base method: System.Void AsyncOperationBase_1::GetDependencies(System.Collections.Generic.List`1<UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle> deps)
    void GetDependencies(System::Collections::Generic::List_1<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* deps);
    // override System.Void ReleaseDependencies()
    // Offset: 0x19A9B8C
    // Implemented from: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
    // Base method: System.Void AsyncOperationBase_1::ReleaseDependencies()
    void ReleaseDependencies();
    // override UnityEngine.ResourceManagement.AsyncOperations.DownloadStatus GetDownloadStatus(System.Collections.Generic.HashSet`1<System.Object> visited)
    // Offset: 0x19A9DF8
    // Implemented from: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
    // Base method: UnityEngine.ResourceManagement.AsyncOperations.DownloadStatus AsyncOperationBase_1::GetDownloadStatus(System.Collections.Generic.HashSet`1<System.Object> visited)
    UnityEngine::ResourceManagement::AsyncOperations::DownloadStatus GetDownloadStatus(System::Collections::Generic::HashSet_1<::Il2CppObject*>* visited);
    // protected override System.String get_DebugName()
    // Offset: 0x19AA1D8
    // Implemented from: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
    // Base method: System.String AsyncOperationBase_1::get_DebugName()
    ::Il2CppString* get_DebugName();
    // protected override System.Void Execute()
    // Offset: 0x19AA424
    // Implemented from: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
    // Base method: System.Void AsyncOperationBase_1::Execute()
    void Execute();
    // protected override System.Void Destroy()
    // Offset: 0x19AAA68
    // Implemented from: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
    // Base method: System.Void AsyncOperationBase_1::Destroy()
    void Destroy();
    // protected override System.Single get_Progress()
    // Offset: 0x19AAA78
    // Implemented from: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1
    // Base method: System.Single AsyncOperationBase_1::get_Progress()
    float get_Progress();
  }; // UnityEngine.ResourceManagement.AsyncOperations.GroupOperation
  // WARNING Not writing size check since size may be invalid!
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::ResourceManagement::AsyncOperations::GroupOperation*, "UnityEngine.ResourceManagement.AsyncOperations", "GroupOperation");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::ResourceManagement::AsyncOperations::GroupOperation::GroupOperationSettings, "UnityEngine.ResourceManagement.AsyncOperations", "GroupOperation/GroupOperationSettings");
