// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TestTools::TestRunner::GUI
namespace UnityEngine::TestTools::TestRunner::GUI {
}
// Forward declaring namespace: NUnit::Framework::Interfaces
namespace NUnit::Framework::Interfaces {
  // Forward declaring type: ITestFilter
  class ITestFilter;
}
// Completed forward declares
// Type namespace: UnityEngine.TestTools.TestRunner.GUI
namespace UnityEngine::TestTools::TestRunner::GUI {
  // Size: 0x35
  // Autogenerated type: UnityEngine.TestTools.TestRunner.GUI.TestRunnerFilter
  // [] Offset: FFFFFFFF
  class TestRunnerFilter : public ::Il2CppObject {
    public:
    // Nested type: UnityEngine::TestTools::TestRunner::GUI::TestRunnerFilter::$$c
    class $$c;
    // public System.String[] assemblyNames
    // Size: 0x8
    // Offset: 0x10
    ::Array<::Il2CppString*>* assemblyNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // public System.String[] groupNames
    // Size: 0x8
    // Offset: 0x18
    ::Array<::Il2CppString*>* groupNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // public System.String[] categoryNames
    // Size: 0x8
    // Offset: 0x20
    ::Array<::Il2CppString*>* categoryNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // public System.String[] testNames
    // Size: 0x8
    // Offset: 0x28
    ::Array<::Il2CppString*>* testNames;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // public System.Int32 testRepetitions
    // Size: 0x4
    // Offset: 0x30
    int testRepetitions;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean synchronousOnly
    // Size: 0x1
    // Offset: 0x34
    bool synchronousOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: TestRunnerFilter
    TestRunnerFilter(::Array<::Il2CppString*>* assemblyNames_ = {}, ::Array<::Il2CppString*>* groupNames_ = {}, ::Array<::Il2CppString*>* categoryNames_ = {}, ::Array<::Il2CppString*>* testNames_ = {}, int testRepetitions_ = {}, bool synchronousOnly_ = {}) noexcept : assemblyNames{assemblyNames_}, groupNames{groupNames_}, categoryNames{categoryNames_}, testNames{testNames_}, testRepetitions{testRepetitions_}, synchronousOnly{synchronousOnly_} {}
    // Get static field: static public UnityEngine.TestTools.TestRunner.GUI.TestRunnerFilter empty
    static UnityEngine::TestTools::TestRunner::GUI::TestRunnerFilter* _get_empty();
    // Set static field: static public UnityEngine.TestTools.TestRunner.GUI.TestRunnerFilter empty
    static void _set_empty(UnityEngine::TestTools::TestRunner::GUI::TestRunnerFilter* value);
    // public NUnit.Framework.Interfaces.ITestFilter BuildNUnitFilter()
    // Offset: 0x119607C
    NUnit::Framework::Interfaces::ITestFilter* BuildNUnitFilter();
    // static private System.Void .cctor()
    // Offset: 0x1196614
    static void _cctor();
    // public System.Void .ctor()
    // Offset: 0x1196604
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TestRunnerFilter* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::TestTools::TestRunner::GUI::TestRunnerFilter::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TestRunnerFilter*, creationType>()));
    }
  }; // UnityEngine.TestTools.TestRunner.GUI.TestRunnerFilter
  static check_size<sizeof(TestRunnerFilter), 52 + sizeof(bool)> __UnityEngine_TestTools_TestRunner_GUI_TestRunnerFilterSizeCheck;
  static_assert(sizeof(TestRunnerFilter) == 0x35);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::TestTools::TestRunner::GUI::TestRunnerFilter*, "UnityEngine.TestTools.TestRunner.GUI", "TestRunnerFilter");
#pragma pack(pop)
