// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Ionic.Zlib.CompressionLevel
#include "Ionic/Zlib/CompressionLevel.hpp"
// Including type: Ionic.Zlib.CompressionStrategy
#include "Ionic/Zlib/CompressionStrategy.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Ionic::Zlib
namespace Ionic::Zlib {
  // Forward declaring type: ZlibCodec
  class ZlibCodec;
  // Forward declaring type: ZTree
  class ZTree;
  // Forward declaring type: BlockState
  struct BlockState;
  // Forward declaring type: FlushType
  struct FlushType;
}
// Completed forward declares
// Type namespace: Ionic.Zlib
namespace Ionic::Zlib {
  // Forward declaring type: DeflateManager
  class DeflateManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Ionic::Zlib::DeflateManager);
DEFINE_IL2CPP_ARG_TYPE(::Ionic::Zlib::DeflateManager*, "Ionic.Zlib", "DeflateManager");
// Type namespace: Ionic.Zlib
namespace Ionic::Zlib {
  // Size: 0x132
  #pragma pack(push, 1)
  // Autogenerated type: Ionic.Zlib.DeflateManager
  // [TokenAttribute] Offset: FFFFFFFF
  class DeflateManager : public ::Il2CppObject {
    public:
    // Nested type: ::Ionic::Zlib::DeflateManager::CompressFunc
    class CompressFunc;
    // Nested type: ::Ionic::Zlib::DeflateManager::Config
    class Config;
    public:
    // private Ionic.Zlib.DeflateManager/Ionic.Zlib.CompressFunc DeflateFunction
    // Size: 0x8
    // Offset: 0x10
    ::Ionic::Zlib::DeflateManager::CompressFunc* DeflateFunction;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::DeflateManager::CompressFunc*) == 0x8);
    // Ionic.Zlib.ZlibCodec _codec
    // Size: 0x8
    // Offset: 0x18
    ::Ionic::Zlib::ZlibCodec* codec;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::ZlibCodec*) == 0x8);
    // System.Int32 status
    // Size: 0x4
    // Offset: 0x20
    int status;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: status and: pending
    char __padding2[0x4] = {};
    // System.Byte[] pending
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<uint8_t> pending;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // System.Int32 nextPending
    // Size: 0x4
    // Offset: 0x30
    int nextPending;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 pendingCount
    // Size: 0x4
    // Offset: 0x34
    int pendingCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.SByte data_type
    // Size: 0x1
    // Offset: 0x38
    int8_t data_type;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // Padding between fields: data_type and: last_flush
    char __padding6[0x3] = {};
    // System.Int32 last_flush
    // Size: 0x4
    // Offset: 0x3C
    int last_flush;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 w_size
    // Size: 0x4
    // Offset: 0x40
    int w_size;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 w_bits
    // Size: 0x4
    // Offset: 0x44
    int w_bits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 w_mask
    // Size: 0x4
    // Offset: 0x48
    int w_mask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: w_mask and: window
    char __padding10[0x4] = {};
    // System.Byte[] window
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<uint8_t> window;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // System.Int32 window_size
    // Size: 0x4
    // Offset: 0x58
    int window_size;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: window_size and: prev
    char __padding12[0x4] = {};
    // System.Int16[] prev
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<int16_t> prev;
    // Field size check
    static_assert(sizeof(::ArrayW<int16_t>) == 0x8);
    // System.Int16[] head
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<int16_t> head;
    // Field size check
    static_assert(sizeof(::ArrayW<int16_t>) == 0x8);
    // System.Int32 ins_h
    // Size: 0x4
    // Offset: 0x70
    int ins_h;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 hash_size
    // Size: 0x4
    // Offset: 0x74
    int hash_size;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 hash_bits
    // Size: 0x4
    // Offset: 0x78
    int hash_bits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 hash_mask
    // Size: 0x4
    // Offset: 0x7C
    int hash_mask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 hash_shift
    // Size: 0x4
    // Offset: 0x80
    int hash_shift;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 block_start
    // Size: 0x4
    // Offset: 0x84
    int block_start;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Ionic.Zlib.DeflateManager/Ionic.Zlib.Config config
    // Size: 0x8
    // Offset: 0x88
    ::Ionic::Zlib::DeflateManager::Config* config;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::DeflateManager::Config*) == 0x8);
    // System.Int32 match_length
    // Size: 0x4
    // Offset: 0x90
    int match_length;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 prev_match
    // Size: 0x4
    // Offset: 0x94
    int prev_match;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 match_available
    // Size: 0x4
    // Offset: 0x98
    int match_available;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 strstart
    // Size: 0x4
    // Offset: 0x9C
    int strstart;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 match_start
    // Size: 0x4
    // Offset: 0xA0
    int match_start;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 lookahead
    // Size: 0x4
    // Offset: 0xA4
    int lookahead;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 prev_length
    // Size: 0x4
    // Offset: 0xA8
    int prev_length;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Ionic.Zlib.CompressionLevel compressionLevel
    // Size: 0x4
    // Offset: 0xAC
    ::Ionic::Zlib::CompressionLevel compressionLevel;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::CompressionLevel) == 0x4);
    // Ionic.Zlib.CompressionStrategy compressionStrategy
    // Size: 0x4
    // Offset: 0xB0
    ::Ionic::Zlib::CompressionStrategy compressionStrategy;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::CompressionStrategy) == 0x4);
    // Padding between fields: compressionStrategy and: dyn_ltree
    char __padding30[0x4] = {};
    // System.Int16[] dyn_ltree
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<int16_t> dyn_ltree;
    // Field size check
    static_assert(sizeof(::ArrayW<int16_t>) == 0x8);
    // System.Int16[] dyn_dtree
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<int16_t> dyn_dtree;
    // Field size check
    static_assert(sizeof(::ArrayW<int16_t>) == 0x8);
    // System.Int16[] bl_tree
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<int16_t> bl_tree;
    // Field size check
    static_assert(sizeof(::ArrayW<int16_t>) == 0x8);
    // Ionic.Zlib.ZTree treeLiterals
    // Size: 0x8
    // Offset: 0xD0
    ::Ionic::Zlib::ZTree* treeLiterals;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::ZTree*) == 0x8);
    // Ionic.Zlib.ZTree treeDistances
    // Size: 0x8
    // Offset: 0xD8
    ::Ionic::Zlib::ZTree* treeDistances;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::ZTree*) == 0x8);
    // Ionic.Zlib.ZTree treeBitLengths
    // Size: 0x8
    // Offset: 0xE0
    ::Ionic::Zlib::ZTree* treeBitLengths;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::ZTree*) == 0x8);
    // System.Int16[] bl_count
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<int16_t> bl_count;
    // Field size check
    static_assert(sizeof(::ArrayW<int16_t>) == 0x8);
    // System.Int32[] heap
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<int> heap;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // System.Int32 heap_len
    // Size: 0x4
    // Offset: 0xF8
    int heap_len;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 heap_max
    // Size: 0x4
    // Offset: 0xFC
    int heap_max;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.SByte[] depth
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<int8_t> depth;
    // Field size check
    static_assert(sizeof(::ArrayW<int8_t>) == 0x8);
    // System.Int32 _lengthOffset
    // Size: 0x4
    // Offset: 0x108
    int lengthOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 lit_bufsize
    // Size: 0x4
    // Offset: 0x10C
    int lit_bufsize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 last_lit
    // Size: 0x4
    // Offset: 0x110
    int last_lit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 _distanceOffset
    // Size: 0x4
    // Offset: 0x114
    int distanceOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 opt_len
    // Size: 0x4
    // Offset: 0x118
    int opt_len;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 static_len
    // Size: 0x4
    // Offset: 0x11C
    int static_len;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 matches
    // Size: 0x4
    // Offset: 0x120
    int matches;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 last_eob_len
    // Size: 0x4
    // Offset: 0x124
    int last_eob_len;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int16 bi_buf
    // Size: 0x2
    // Offset: 0x128
    int16_t bi_buf;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // Padding between fields: bi_buf and: bi_valid
    char __padding50[0x2] = {};
    // System.Int32 bi_valid
    // Size: 0x4
    // Offset: 0x12C
    int bi_valid;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean Rfc1950BytesEmitted
    // Size: 0x1
    // Offset: 0x130
    bool Rfc1950BytesEmitted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _WantRfc1950HeaderBytes
    // Size: 0x1
    // Offset: 0x131
    bool WantRfc1950HeaderBytes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Int32 MEM_LEVEL_MAX
    static int _get_MEM_LEVEL_MAX();
    // Set static field: static private readonly System.Int32 MEM_LEVEL_MAX
    static void _set_MEM_LEVEL_MAX(int value);
    // Get static field: static private readonly System.Int32 MEM_LEVEL_DEFAULT
    static int _get_MEM_LEVEL_DEFAULT();
    // Set static field: static private readonly System.Int32 MEM_LEVEL_DEFAULT
    static void _set_MEM_LEVEL_DEFAULT(int value);
    // Get static field: static private readonly System.String[] _ErrorMessage
    static ::ArrayW<::StringW> _get__ErrorMessage();
    // Set static field: static private readonly System.String[] _ErrorMessage
    static void _set__ErrorMessage(::ArrayW<::StringW> value);
    // Get static field: static private readonly System.Int32 PRESET_DICT
