// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
// Including type: Ionic.Zlib.CompressionLevel
#include "Ionic/Zlib/CompressionLevel.hpp"
// Including type: Ionic.Zlib.CompressionStrategy
#include "Ionic/Zlib/CompressionStrategy.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Forward declaring namespace: Ionic::Zlib
namespace Ionic::Zlib {
  // Forward declaring type: WorkItem
  class WorkItem;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: AutoResetEvent
  class AutoResetEvent;
}
// Forward declaring namespace: Ionic::Crc
namespace Ionic::Crc {
  // Forward declaring type: CRC32
  class CRC32;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: Ionic.Zlib
namespace Ionic::Zlib {
  // Forward declaring type: ParallelDeflateOutputStream
  class ParallelDeflateOutputStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Ionic::Zlib::ParallelDeflateOutputStream);
DEFINE_IL2CPP_ARG_TYPE(::Ionic::Zlib::ParallelDeflateOutputStream*, "Ionic.Zlib", "ParallelDeflateOutputStream");
// Type namespace: Ionic.Zlib
namespace Ionic::Zlib {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: Ionic.Zlib.ParallelDeflateOutputStream
  // [TokenAttribute] Offset: FFFFFFFF
  class ParallelDeflateOutputStream : public ::System::IO::Stream {
    public:
    // Nested type: ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits
    struct TraceBits;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct TraceBits/*, public ::System::Enum*/ {
      public:
      public:
      // public System.UInt32 value__
      // Size: 0x4
      // Offset: 0x0
      uint value;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      public:
      // Creating value type constructor for type: TraceBits
      constexpr TraceBits(uint value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator uint
      constexpr operator uint() const noexcept {
        return value;
      }
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits None
      static constexpr const uint None = 0u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits None
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_None();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits None
      static void _set_None(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits NotUsed1
      static constexpr const uint NotUsed1 = 1u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits NotUsed1
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_NotUsed1();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits NotUsed1
      static void _set_NotUsed1(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitLock
      static constexpr const uint EmitLock = 2u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitLock
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_EmitLock();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitLock
      static void _set_EmitLock(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitEnter
      static constexpr const uint EmitEnter = 4u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitEnter
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_EmitEnter();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitEnter
      static void _set_EmitEnter(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitBegin
      static constexpr const uint EmitBegin = 8u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitBegin
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_EmitBegin();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitBegin
      static void _set_EmitBegin(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitDone
      static constexpr const uint EmitDone = 16u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitDone
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_EmitDone();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitDone
      static void _set_EmitDone(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitSkip
      static constexpr const uint EmitSkip = 32u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitSkip
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_EmitSkip();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitSkip
      static void _set_EmitSkip(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitAll
      static constexpr const uint EmitAll = 58u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitAll
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_EmitAll();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits EmitAll
      static void _set_EmitAll(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Flush
      static constexpr const uint Flush = 64u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Flush
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_Flush();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Flush
      static void _set_Flush(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Lifecycle
      static constexpr const uint Lifecycle = 128u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Lifecycle
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_Lifecycle();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Lifecycle
      static void _set_Lifecycle(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Session
      static constexpr const uint Session = 256u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Session
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_Session();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Session
      static void _set_Session(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Synch
      static constexpr const uint Synch = 512u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Synch
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_Synch();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Synch
      static void _set_Synch(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Instance
      static constexpr const uint Instance = 1024u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Instance
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_Instance();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Instance
      static void _set_Instance(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Compress
      static constexpr const uint Compress = 2048u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Compress
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_Compress();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Compress
      static void _set_Compress(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Write
      static constexpr const uint Write = 4096u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Write
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_Write();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits Write
      static void _set_Write(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits WriteEnter
      static constexpr const uint WriteEnter = 8192u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits WriteEnter
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_WriteEnter();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits WriteEnter
      static void _set_WriteEnter(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits WriteTake
      static constexpr const uint WriteTake = 16384u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits WriteTake
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_WriteTake();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits WriteTake
      static void _set_WriteTake(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // static field const value: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits All
      static constexpr const uint All = 4294967295u;
      // Get static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits All
      static ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits _get_All();
      // Set static field: static public Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits All
      static void _set_All(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits value);
      // Get instance field reference: public System.UInt32 value__
      [[deprecated("Use field access instead!")]] uint& dyn_value__();
    }; // Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits
    #pragma pack(pop)
    static check_size<sizeof(ParallelDeflateOutputStream::TraceBits), 0 + sizeof(uint)> __Ionic_Zlib_ParallelDeflateOutputStream_TraceBitsSizeCheck;
    static_assert(sizeof(ParallelDeflateOutputStream::TraceBits) == 0x4);
    public:
    // private System.Collections.Generic.List`1<Ionic.Zlib.WorkItem> _pool
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::Ionic::Zlib::WorkItem*>* pool;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Ionic::Zlib::WorkItem*>*) == 0x8);
    // private System.Boolean _leaveOpen
    // Size: 0x1
    // Offset: 0x30
    bool leaveOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean emitting
    // Size: 0x1
    // Offset: 0x31
    bool emitting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: emitting and: outStream
    char __padding2[0x6] = {};
    // private System.IO.Stream _outStream
    // Size: 0x8
    // Offset: 0x38
    ::System::IO::Stream* outStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.Int32 _maxBufferPairs
    // Size: 0x4
    // Offset: 0x40
    int maxBufferPairs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _bufferSize
    // Size: 0x4
    // Offset: 0x44
    int bufferSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Threading.AutoResetEvent _newlyCompressedBlob
    // Size: 0x8
    // Offset: 0x48
    ::System::Threading::AutoResetEvent* newlyCompressedBlob;
    // Field size check
    static_assert(sizeof(::System::Threading::AutoResetEvent*) == 0x8);
    // private System.Object _outputLock
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppObject* outputLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean _isClosed
    // Size: 0x1
    // Offset: 0x58
    bool isClosed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _firstWriteDone
    // Size: 0x1
    // Offset: 0x59
    bool firstWriteDone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: firstWriteDone and: currentlyFilling
    char __padding9[0x2] = {};
    // private System.Int32 _currentlyFilling
    // Size: 0x4
    // Offset: 0x5C
    int currentlyFilling;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _lastFilled
    // Size: 0x4
    // Offset: 0x60
    int lastFilled;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _lastWritten
    // Size: 0x4
    // Offset: 0x64
    int lastWritten;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _latestCompressed
    // Size: 0x4
    // Offset: 0x68
    int latestCompressed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _Crc32
    // Size: 0x4
    // Offset: 0x6C
    int Crc32;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Ionic.Crc.CRC32 _runningCrc
    // Size: 0x8
    // Offset: 0x70
    ::Ionic::Crc::CRC32* runningCrc;
    // Field size check
    static_assert(sizeof(::Ionic::Crc::CRC32*) == 0x8);
    // private System.Object _latestLock
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppObject* latestLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Collections.Generic.Queue`1<System.Int32> _toWrite
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::Queue_1<int>* toWrite;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<int>*) == 0x8);
    // private System.Collections.Generic.Queue`1<System.Int32> _toFill
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::Queue_1<int>* toFill;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<int>*) == 0x8);
    // private System.Int64 _totalBytesProcessed
    // Size: 0x8
    // Offset: 0x90
    int64_t totalBytesProcessed;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private Ionic.Zlib.CompressionLevel _compressLevel
    // Size: 0x4
    // Offset: 0x98
    ::Ionic::Zlib::CompressionLevel compressLevel;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::CompressionLevel) == 0x4);
    // Padding between fields: compressLevel and: pendingException
    char __padding20[0x4] = {};
    // private System.Exception _pendingException
    // Size: 0x8
    // Offset: 0xA0
    ::System::Exception* pendingException;
    // Field size check
    static_assert(sizeof(::System::Exception*) == 0x8);
    // private System.Boolean _handlingException
    // Size: 0x1
    // Offset: 0xA8
    bool handlingException;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: handlingException and: eLock
    char __padding22[0x7] = {};
    // private System.Object _eLock
    // Size: 0x8
    // Offset: 0xB0
    ::Il2CppObject* eLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private Ionic.Zlib.ParallelDeflateOutputStream/Ionic.Zlib.TraceBits _DesiredTrace
    // Size: 0x4
    // Offset: 0xB8
    ::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits DesiredTrace;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::ParallelDeflateOutputStream::TraceBits) == 0x4);
    // private Ionic.Zlib.CompressionStrategy <Strategy>k__BackingField
    // Size: 0x4
    // Offset: 0xBC
    ::Ionic::Zlib::CompressionStrategy Strategy;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::CompressionStrategy) == 0x4);
    public:
    // Get static field: static private readonly System.Int32 IO_BUFFER_SIZE_DEFAULT
    static int _get_IO_BUFFER_SIZE_DEFAULT();
    // Set static field: static private readonly System.Int32 IO_BUFFER_SIZE_DEFAULT
    static void _set_IO_BUFFER_SIZE_DEFAULT(int value);
    // Get static field: static private readonly System.Int32 BufferPairsPerCore
    static int _get_BufferPairsPerCore();
    // Set static field: static private readonly System.Int32 BufferPairsPerCore
    static void _set_BufferPairsPerCore(int value);
    // Get instance field reference: private System.Collections.Generic.List`1<Ionic.Zlib.WorkItem> _pool
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::Ionic::Zlib::WorkItem*>*& dyn__pool();
