// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
// Including type: Ionic.Zlib.FlushType
#include "Ionic/Zlib/FlushType.hpp"
// Including type: Ionic.Zlib.ZlibStreamFlavor
#include "Ionic/Zlib/ZlibStreamFlavor.hpp"
// Including type: Ionic.Zlib.CompressionMode
#include "Ionic/Zlib/CompressionMode.hpp"
// Including type: Ionic.Zlib.CompressionLevel
#include "Ionic/Zlib/CompressionLevel.hpp"
// Including type: Ionic.Zlib.CompressionStrategy
#include "Ionic/Zlib/CompressionStrategy.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Ionic::Crc
namespace Ionic::Crc {
  // Forward declaring type: CRC32
  class CRC32;
}
// Forward declaring namespace: Ionic::Zlib
namespace Ionic::Zlib {
  // Forward declaring type: ZlibCodec
  class ZlibCodec;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Completed forward declares
// Type namespace: Ionic.Zlib
namespace Ionic::Zlib {
  // Forward declaring type: ZlibBaseStream
  class ZlibBaseStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Ionic::Zlib::ZlibBaseStream);
DEFINE_IL2CPP_ARG_TYPE(::Ionic::Zlib::ZlibBaseStream*, "Ionic.Zlib", "ZlibBaseStream");
// Type namespace: Ionic.Zlib
namespace Ionic::Zlib {
  // Size: 0x95
  #pragma pack(push, 1)
  // Autogenerated type: Ionic.Zlib.ZlibBaseStream
  // [TokenAttribute] Offset: FFFFFFFF
  class ZlibBaseStream : public ::System::IO::Stream {
    public:
    // Nested type: ::Ionic::Zlib::ZlibBaseStream::StreamMode
    struct StreamMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct StreamMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StreamMode
      constexpr StreamMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode Writer
      static constexpr const int Writer = 0;
      // Get static field: static public Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode Writer
      static ::Ionic::Zlib::ZlibBaseStream::StreamMode _get_Writer();
      // Set static field: static public Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode Writer
      static void _set_Writer(::Ionic::Zlib::ZlibBaseStream::StreamMode value);
      // static field const value: static public Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode Reader
      static constexpr const int Reader = 1;
      // Get static field: static public Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode Reader
      static ::Ionic::Zlib::ZlibBaseStream::StreamMode _get_Reader();
      // Set static field: static public Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode Reader
      static void _set_Reader(::Ionic::Zlib::ZlibBaseStream::StreamMode value);
      // static field const value: static public Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode Undefined
      static constexpr const int Undefined = 2;
      // Get static field: static public Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode Undefined
      static ::Ionic::Zlib::ZlibBaseStream::StreamMode _get_Undefined();
      // Set static field: static public Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode Undefined
      static void _set_Undefined(::Ionic::Zlib::ZlibBaseStream::StreamMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode
    #pragma pack(pop)
    static check_size<sizeof(ZlibBaseStream::StreamMode), 0 + sizeof(int)> __Ionic_Zlib_ZlibBaseStream_StreamModeSizeCheck;
    static_assert(sizeof(ZlibBaseStream::StreamMode) == 0x4);
    public:
    // protected internal Ionic.Zlib.ZlibCodec _z
    // Size: 0x8
    // Offset: 0x28
    ::Ionic::Zlib::ZlibCodec* z;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::ZlibCodec*) == 0x8);
    // protected internal Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode _streamMode
    // Size: 0x4
    // Offset: 0x30
    ::Ionic::Zlib::ZlibBaseStream::StreamMode streamMode;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::ZlibBaseStream::StreamMode) == 0x4);
    // protected internal Ionic.Zlib.FlushType _flushMode
    // Size: 0x4
    // Offset: 0x34
    ::Ionic::Zlib::FlushType flushMode;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::FlushType) == 0x4);
    // protected internal Ionic.Zlib.ZlibStreamFlavor _flavor
    // Size: 0x4
    // Offset: 0x38
    ::Ionic::Zlib::ZlibStreamFlavor flavor;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::ZlibStreamFlavor) == 0x4);
    // protected internal Ionic.Zlib.CompressionMode _compressionMode
    // Size: 0x4
    // Offset: 0x3C
    ::Ionic::Zlib::CompressionMode compressionMode;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::CompressionMode) == 0x4);
    // protected internal Ionic.Zlib.CompressionLevel _level
    // Size: 0x4
    // Offset: 0x40
    ::Ionic::Zlib::CompressionLevel level;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::CompressionLevel) == 0x4);
    // protected internal System.Boolean _leaveOpen
    // Size: 0x1
    // Offset: 0x44
    bool leaveOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: leaveOpen and: workingBuffer
    char __padding6[0x3] = {};
    // protected internal System.Byte[] _workingBuffer
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<uint8_t> workingBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // protected internal System.Int32 _bufferSize
    // Size: 0x4
    // Offset: 0x50
    int bufferSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: bufferSize and: buf1
    char __padding8[0x4] = {};
    // protected internal System.Byte[] _buf1
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<uint8_t> buf1;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // protected internal System.IO.Stream _stream
    // Size: 0x8
    // Offset: 0x60
    ::System::IO::Stream* stream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // protected internal Ionic.Zlib.CompressionStrategy Strategy
    // Size: 0x4
    // Offset: 0x68
    ::Ionic::Zlib::CompressionStrategy Strategy;
    // Field size check
    static_assert(sizeof(::Ionic::Zlib::CompressionStrategy) == 0x4);
    // Padding between fields: Strategy and: crc
    char __padding11[0x4] = {};
    // private Ionic.Crc.CRC32 crc
    // Size: 0x8
    // Offset: 0x70
    ::Ionic::Crc::CRC32* crc;
    // Field size check
    static_assert(sizeof(::Ionic::Crc::CRC32*) == 0x8);
    // protected internal System.String _GzipFileName
    // Size: 0x8
    // Offset: 0x78
    ::StringW GzipFileName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected internal System.String _GzipComment
    // Size: 0x8
    // Offset: 0x80
    ::StringW GzipComment;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected internal System.DateTime _GzipMtime
    // Size: 0x8
    // Offset: 0x88
    ::System::DateTime GzipMtime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // protected internal System.Int32 _gzipHeaderByteCount
    // Size: 0x4
    // Offset: 0x90
    int gzipHeaderByteCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean nomoreinput
    // Size: 0x1
    // Offset: 0x94
    bool nomoreinput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: protected internal Ionic.Zlib.ZlibCodec _z
    [[deprecated("Use field access instead!")]] ::Ionic::Zlib::ZlibCodec*& dyn__z();
    // Get instance field reference: protected internal Ionic.Zlib.ZlibBaseStream/Ionic.Zlib.StreamMode _streamMode
    [[deprecated("Use field access instead!")]] ::Ionic::Zlib::ZlibBaseStream::StreamMode& dyn__streamMode();
    // Get instance field reference: protected internal Ionic.Zlib.FlushType _flushMode
    [[deprecated("Use field access instead!")]] ::Ionic::Zlib::FlushType& dyn__flushMode();
    // Get instance field reference: protected internal Ionic.Zlib.ZlibStreamFlavor _flavor
    [[deprecated("Use field access instead!")]] ::Ionic::Zlib::ZlibStreamFlavor& dyn__flavor();
    // Get instance field reference: protected internal Ionic.Zlib.CompressionMode _compressionMode
