// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IEquatable`1
#include "System/IEquatable_1.hpp"
// Including type: System.IConvertible
#include "System/IConvertible.hpp"
// Including type: System.TypeCode
#include "System/TypeCode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IFormatProvider
  class IFormatProvider;
  // Forward declaring type: DateTime
  struct DateTime;
  // Forward declaring type: Decimal
  struct Decimal;
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: PrimitiveValue
  struct PrimitiveValue;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::Utilities::PrimitiveValue, "UnityEngine.InputSystem.Utilities", "PrimitiveValue");
// Type namespace: UnityEngine.InputSystem.Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Size: 0xC
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.Utilities.PrimitiveValue
  // [TokenAttribute] Offset: FFFFFFFF
  struct PrimitiveValue/*, public ::System::ValueType, public ::System::IEquatable_1<::UnityEngine::InputSystem::Utilities::PrimitiveValue>, public ::System::IConvertible*/ {
    public:
    public:
    // private System.TypeCode m_Type
    // Size: 0x4
    // Offset: 0x0
    ::System::TypeCode m_Type;
    // Field size check
    static_assert(sizeof(::System::TypeCode) == 0x4);
    // Creating union for fields at offset: 0x4
    union {
      // private System.Boolean m_BoolValue
      // Size: 0x1
      // Offset: 0x4
      bool m_BoolValue;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // private System.Char m_CharValue
      // Size: 0x2
      // Offset: 0x4
      ::Il2CppChar m_CharValue;
      // Field size check
      static_assert(sizeof(::Il2CppChar) == 0x2);
      // private System.Byte m_ByteValue
      // Size: 0x1
      // Offset: 0x4
      uint8_t m_ByteValue;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      // private System.SByte m_SByteValue
      // Size: 0x1
      // Offset: 0x4
      int8_t m_SByteValue;
      // Field size check
      static_assert(sizeof(int8_t) == 0x1);
      // private System.Int16 m_ShortValue
      // Size: 0x2
      // Offset: 0x4
      int16_t m_ShortValue;
      // Field size check
      static_assert(sizeof(int16_t) == 0x2);
      // private System.UInt16 m_UShortValue
      // Size: 0x2
      // Offset: 0x4
      uint16_t m_UShortValue;
      // Field size check
      static_assert(sizeof(uint16_t) == 0x2);
      // private System.Int32 m_IntValue
      // Size: 0x4
      // Offset: 0x4
      int m_IntValue;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.UInt32 m_UIntValue
      // Size: 0x4
      // Offset: 0x4
      uint m_UIntValue;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // private System.Int64 m_LongValue
      // Size: 0x8
      // Offset: 0x4
      int64_t m_LongValue;
      // Field size check
      static_assert(sizeof(int64_t) == 0x8);
      // private System.UInt64 m_ULongValue
      // Size: 0x8
      // Offset: 0x4
      uint64_t m_ULongValue;
      // Field size check
      static_assert(sizeof(uint64_t) == 0x8);
      // private System.Single m_FloatValue
      // Size: 0x4
      // Offset: 0x4
      float m_FloatValue;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private System.Double m_DoubleValue
      // Size: 0x8
      // Offset: 0x4
      double m_DoubleValue;
      // Field size check
      static_assert(sizeof(double) == 0x8);
    };
    public:
    // Creating value type constructor for type: PrimitiveValue
    constexpr PrimitiveValue(::System::TypeCode m_Type_ = {}, bool m_BoolValue_ = {}) noexcept : m_Type{m_Type_}, m_BoolValue{m_BoolValue_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::System::IEquatable_1<::UnityEngine::InputSystem::Utilities::PrimitiveValue>
    operator ::System::IEquatable_1<::UnityEngine::InputSystem::Utilities::PrimitiveValue>() noexcept {
      return *reinterpret_cast<::System::IEquatable_1<::UnityEngine::InputSystem::Utilities::PrimitiveValue>*>(this);
    }
    // Creating interface conversion operator: operator ::System::IConvertible
