// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.MouseButtonModel
#include "UnityEngine/XR/Interaction/Toolkit/UI/MouseButtonModel.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: MouseModel
  struct MouseModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::MouseModel, "UnityEngine.XR.Interaction.Toolkit.UI", "MouseModel");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x1A0
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.MouseModel
  // [TokenAttribute] Offset: FFFFFFFF
  struct MouseModel/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::MouseModel::InternalData
    struct InternalData;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.MouseModel/UnityEngine.XR.Interaction.Toolkit.UI.InternalData
    // [TokenAttribute] Offset: FFFFFFFF
    struct InternalData/*, public ::System::ValueType*/ {
      public:
      public:
      // private System.Collections.Generic.List`1<UnityEngine.GameObject> <hoverTargets>k__BackingField
      // Size: 0x8
      // Offset: 0x0
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* hoverTargets;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
      // private UnityEngine.GameObject <pointerTarget>k__BackingField
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::GameObject* pointerTarget;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      public:
      // Creating value type constructor for type: InternalData
      constexpr InternalData(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* hoverTargets_ = {}, ::UnityEngine::GameObject* pointerTarget_ = {}) noexcept : hoverTargets{hoverTargets_}, pointerTarget{pointerTarget_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.GameObject> <hoverTargets>k__BackingField
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_$hoverTargets$k__BackingField();
      // Get instance field reference: private UnityEngine.GameObject <pointerTarget>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$pointerTarget$k__BackingField();
      // public System.Collections.Generic.List`1<UnityEngine.GameObject> get_hoverTargets()
      // Offset: 0xA4DC54
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* get_hoverTargets();
      // public System.Void set_hoverTargets(System.Collections.Generic.List`1<UnityEngine.GameObject> value)
      // Offset: 0xA4DC5C
      void set_hoverTargets(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* value);
      // public UnityEngine.GameObject get_pointerTarget()
      // Offset: 0xA4DC64
      ::UnityEngine::GameObject* get_pointerTarget();
      // public System.Void set_pointerTarget(UnityEngine.GameObject value)
      // Offset: 0xA4DC6C
      void set_pointerTarget(::UnityEngine::GameObject* value);
      // public System.Void Reset()
      // Offset: 0xA4DC74
      void Reset();
    }; // UnityEngine.XR.Interaction.Toolkit.UI.MouseModel/UnityEngine.XR.Interaction.Toolkit.UI.InternalData
    #pragma pack(pop)
    static check_size<sizeof(MouseModel::InternalData), 8 + sizeof(::UnityEngine::GameObject*)> __UnityEngine_XR_Interaction_Toolkit_UI_MouseModel_InternalDataSizeCheck;
    static_assert(sizeof(MouseModel::InternalData) == 0x10);
    public:
    // private readonly System.Int32 <pointerId>k__BackingField
    // Size: 0x4
    // Offset: 0x0
    int pointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <changedThisFrame>k__BackingField
    // Size: 0x1
    // Offset: 0x4
    bool changedThisFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: changedThisFrame and: deltaPosition
    char __padding1[0x3] = {};
    // private UnityEngine.Vector2 <deltaPosition>k__BackingField
    // Size: 0x8
    // Offset: 0x8
    ::UnityEngine::Vector2 deltaPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 <scrollDelta>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Vector2 scrollDelta;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_Position
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Vector2 m_Position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_ScrollPosition
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Vector2 m_ScrollPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.UI.MouseButtonModel m_LeftButton
    // Size: 0x78
    // Offset: 0x28
    ::UnityEngine::XR::Interaction::Toolkit::UI::MouseButtonModel m_LeftButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::MouseButtonModel) == 0x78);
    // private UnityEngine.XR.Interaction.Toolkit.UI.MouseButtonModel m_RightButton
    // Size: 0x78
    // Offset: 0xA0
    ::UnityEngine::XR::Interaction::Toolkit::UI::MouseButtonModel m_RightButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::MouseButtonModel) == 0x78);
    // private UnityEngine.XR.Interaction.Toolkit.UI.MouseButtonModel m_MiddleButton
    // Size: 0x78
    // Offset: 0x118
    ::UnityEngine::XR::Interaction::Toolkit::UI::MouseButtonModel m_MiddleButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::MouseButtonModel) == 0x78);
    // private UnityEngine.XR.Interaction.Toolkit.UI.MouseModel/UnityEngine.XR.Interaction.Toolkit.UI.InternalData m_InternalData
    // Size: 0x10
    // Offset: 0x190
    ::UnityEngine::XR::Interaction::Toolkit::UI::MouseModel::InternalData m_InternalData;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::MouseModel::InternalData) == 0x10);
    public:
    // Creating value type constructor for type: MouseModel
