// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.ButtonDeltaState
#include "UnityEngine/XR/Interaction/Toolkit/UI/ButtonDeltaState.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.EventSystems.RaycastResult
#include "UnityEngine/EventSystems/RaycastResult.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Skipping declaration: ImplementationData because it is already included!
  // Forward declaring type: TrackedDeviceEventData
  class TrackedDeviceEventData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: TrackedDeviceModel
  struct TrackedDeviceModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel, "UnityEngine.XR.Interaction.Toolkit.UI", "TrackedDeviceModel");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x10C
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel
  // [TokenAttribute] Offset: FFFFFFFF
  struct TrackedDeviceModel/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel::ImplementationData
    struct ImplementationData;
    // Size: 0xD0
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel/UnityEngine.XR.Interaction.Toolkit.UI.ImplementationData
    // [TokenAttribute] Offset: FFFFFFFF
    struct ImplementationData/*, public ::System::ValueType*/ {
      public:
      public:
      // private System.Collections.Generic.List`1<UnityEngine.GameObject> <hoverTargets>k__BackingField
      // Size: 0x8
      // Offset: 0x0
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* hoverTargets;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
      // private UnityEngine.GameObject <pointerTarget>k__BackingField
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::GameObject* pointerTarget;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // private System.Boolean <isDragging>k__BackingField
      // Size: 0x1
      // Offset: 0x10
      bool isDragging;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isDragging and: pressedTime
      char __padding2[0x3] = {};
      // private System.Single <pressedTime>k__BackingField
      // Size: 0x4
      // Offset: 0x14
      float pressedTime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private UnityEngine.Vector2 <pressedPosition>k__BackingField
      // Size: 0x8
      // Offset: 0x18
      ::UnityEngine::Vector2 pressedPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      // private UnityEngine.EventSystems.RaycastResult <pressedRaycast>k__BackingField
      // Size: 0x48
      // Offset: 0x20
      ::UnityEngine::EventSystems::RaycastResult pressedRaycast;
      // Field size check
      static_assert(sizeof(::UnityEngine::EventSystems::RaycastResult) == 0x48);
      // private UnityEngine.EventSystems.RaycastResult <lastFrameRaycast>k__BackingField
      // Size: 0x48
      // Offset: 0x68
      ::UnityEngine::EventSystems::RaycastResult lastFrameRaycast;
      // Field size check
      static_assert(sizeof(::UnityEngine::EventSystems::RaycastResult) == 0x48);
      // private System.Int32 <lastFrameRaycastResultPositionInLine>k__BackingField
      // Size: 0x4
      // Offset: 0xB0
      int lastFrameRaycastResultPositionInLine;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: lastFrameRaycastResultPositionInLine and: pressedGameObject
      char __padding7[0x4] = {};
      // private UnityEngine.GameObject <pressedGameObject>k__BackingField
      // Size: 0x8
      // Offset: 0xB8
      ::UnityEngine::GameObject* pressedGameObject;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // private UnityEngine.GameObject <pressedGameObjectRaw>k__BackingField
      // Size: 0x8
      // Offset: 0xC0
      ::UnityEngine::GameObject* pressedGameObjectRaw;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // private UnityEngine.GameObject <draggedGameObject>k__BackingField
      // Size: 0x8
      // Offset: 0xC8
      ::UnityEngine::GameObject* draggedGameObject;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      public:
      // Creating value type constructor for type: ImplementationData
      constexpr ImplementationData(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* hoverTargets_ = {}, ::UnityEngine::GameObject* pointerTarget_ = {}, bool isDragging_ = {}, float pressedTime_ = {}, ::UnityEngine::Vector2 pressedPosition_ = {}, ::UnityEngine::EventSystems::RaycastResult pressedRaycast_ = {}, ::UnityEngine::EventSystems::RaycastResult lastFrameRaycast_ = {}, int lastFrameRaycastResultPositionInLine_ = {}, ::UnityEngine::GameObject* pressedGameObject_ = {}, ::UnityEngine::GameObject* pressedGameObjectRaw_ = {}, ::UnityEngine::GameObject* draggedGameObject_ = {}) noexcept : hoverTargets{hoverTargets_}, pointerTarget{pointerTarget_}, isDragging{isDragging_}, pressedTime{pressedTime_}, pressedPosition{pressedPosition_}, pressedRaycast{pressedRaycast_}, lastFrameRaycast{lastFrameRaycast_}, lastFrameRaycastResultPositionInLine{lastFrameRaycastResultPositionInLine_}, pressedGameObject{pressedGameObject_}, pressedGameObjectRaw{pressedGameObjectRaw_}, draggedGameObject{draggedGameObject_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.GameObject> <hoverTargets>k__BackingField
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_$hoverTargets$k__BackingField();
      // Get instance field reference: private UnityEngine.GameObject <pointerTarget>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$pointerTarget$k__BackingField();
      // Get instance field reference: private System.Boolean <isDragging>k__BackingField
      [[deprecated("Use field access instead!")]] bool& dyn_$isDragging$k__BackingField();
      // Get instance field reference: private System.Single <pressedTime>k__BackingField
      [[deprecated("Use field access instead!")]] float& dyn_$pressedTime$k__BackingField();
      // Get instance field reference: private UnityEngine.Vector2 <pressedPosition>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_$pressedPosition$k__BackingField();
      // Get instance field reference: private UnityEngine.EventSystems.RaycastResult <pressedRaycast>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::EventSystems::RaycastResult& dyn_$pressedRaycast$k__BackingField();
      // Get instance field reference: private UnityEngine.EventSystems.RaycastResult <lastFrameRaycast>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::EventSystems::RaycastResult& dyn_$lastFrameRaycast$k__BackingField();
      // Get instance field reference: private System.Int32 <lastFrameRaycastResultPositionInLine>k__BackingField
      [[deprecated("Use field access instead!")]] int& dyn_$lastFrameRaycastResultPositionInLine$k__BackingField();
      // Get instance field reference: private UnityEngine.GameObject <pressedGameObject>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$pressedGameObject$k__BackingField();
      // Get instance field reference: private UnityEngine.GameObject <pressedGameObjectRaw>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$pressedGameObjectRaw$k__BackingField();
      // Get instance field reference: private UnityEngine.GameObject <draggedGameObject>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$draggedGameObject$k__BackingField();
      // public System.Collections.Generic.List`1<UnityEngine.GameObject> get_hoverTargets()
      // Offset: 0xA40F80
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* get_hoverTargets();
      // public System.Void set_hoverTargets(System.Collections.Generic.List`1<UnityEngine.GameObject> value)
      // Offset: 0xA40F88
      void set_hoverTargets(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* value);
      // public UnityEngine.GameObject get_pointerTarget()
      // Offset: 0xA40F90
      ::UnityEngine::GameObject* get_pointerTarget();
      // public System.Void set_pointerTarget(UnityEngine.GameObject value)
      // Offset: 0xA40F98
      void set_pointerTarget(::UnityEngine::GameObject* value);
      // public System.Boolean get_isDragging()
      // Offset: 0xA40FA0
      bool get_isDragging();
      // public System.Void set_isDragging(System.Boolean value)
      // Offset: 0xA40FA8
      void set_isDragging(bool value);
      // public System.Single get_pressedTime()
      // Offset: 0xA40FB4
      float get_pressedTime();
      // public System.Void set_pressedTime(System.Single value)
      // Offset: 0xA40FBC
      void set_pressedTime(float value);
      // public UnityEngine.Vector2 get_pressedPosition()
      // Offset: 0xA40FC4
      ::UnityEngine::Vector2 get_pressedPosition();
      // public System.Void set_pressedPosition(UnityEngine.Vector2 value)
      // Offset: 0xA40FCC
      void set_pressedPosition(::UnityEngine::Vector2 value);
      // public UnityEngine.EventSystems.RaycastResult get_pressedRaycast()
      // Offset: 0xA40FD4
      ::UnityEngine::EventSystems::RaycastResult get_pressedRaycast();
      // public System.Void set_pressedRaycast(UnityEngine.EventSystems.RaycastResult value)
      // Offset: 0xA40FE4
      void set_pressedRaycast(::UnityEngine::EventSystems::RaycastResult value);
      // public UnityEngine.EventSystems.RaycastResult get_lastFrameRaycast()
      // Offset: 0xA41000
      ::UnityEngine::EventSystems::RaycastResult get_lastFrameRaycast();
      // public System.Void set_lastFrameRaycast(UnityEngine.EventSystems.RaycastResult value)
      // Offset: 0xA41010
      void set_lastFrameRaycast(::UnityEngine::EventSystems::RaycastResult value);
      // public System.Int32 get_lastFrameRaycastResultPositionInLine()
      // Offset: 0xA4102C
      int get_lastFrameRaycastResultPositionInLine();
      // public System.Void set_lastFrameRaycastResultPositionInLine(System.Int32 value)
      // Offset: 0xA41034
      void set_lastFrameRaycastResultPositionInLine(int value);
      // public UnityEngine.GameObject get_pressedGameObject()
      // Offset: 0xA4103C
      ::UnityEngine::GameObject* get_pressedGameObject();
      // public System.Void set_pressedGameObject(UnityEngine.GameObject value)
      // Offset: 0xA41044
      void set_pressedGameObject(::UnityEngine::GameObject* value);
      // public UnityEngine.GameObject get_pressedGameObjectRaw()
      // Offset: 0xA4104C
      ::UnityEngine::GameObject* get_pressedGameObjectRaw();
      // public System.Void set_pressedGameObjectRaw(UnityEngine.GameObject value)
      // Offset: 0xA41054
      void set_pressedGameObjectRaw(::UnityEngine::GameObject* value);
      // public UnityEngine.GameObject get_draggedGameObject()
      // Offset: 0xA4105C
      ::UnityEngine::GameObject* get_draggedGameObject();
      // public System.Void set_draggedGameObject(UnityEngine.GameObject value)
      // Offset: 0xA41064
      void set_draggedGameObject(::UnityEngine::GameObject* value);
      // public System.Void Reset()
      // Offset: 0xA4106C
      void Reset();
    }; // UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel/UnityEngine.XR.Interaction.Toolkit.UI.ImplementationData
    #pragma pack(pop)
    static check_size<sizeof(TrackedDeviceModel::ImplementationData), 200 + sizeof(::UnityEngine::GameObject*)> __UnityEngine_XR_Interaction_Toolkit_UI_TrackedDeviceModel_ImplementationDataSizeCheck;
    static_assert(sizeof(TrackedDeviceModel::ImplementationData) == 0xD0);
    public:
    // private UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel/UnityEngine.XR.Interaction.Toolkit.UI.ImplementationData m_ImplementationData
    // Size: 0xD0
    // Offset: 0x0
    ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel::ImplementationData m_ImplementationData;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel::ImplementationData) == 0xD0);
    // private readonly System.Int32 <pointerId>k__BackingField
    // Size: 0x4
    // Offset: 0xD0
    int pointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <maxRaycastDistance>k__BackingField
    // Size: 0x4
    // Offset: 0xD4
    float maxRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_SelectDown
    // Size: 0x1
    // Offset: 0xD8
    bool m_SelectDown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SelectDown and: selectDelta
    char __padding3[0x3] = {};
    // private UnityEngine.XR.Interaction.Toolkit.UI.ButtonDeltaState <selectDelta>k__BackingField
    // Size: 0x4
    // Offset: 0xDC
    ::UnityEngine::XR::Interaction::Toolkit::UI::ButtonDeltaState selectDelta;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::ButtonDeltaState) == 0x4);
    // private System.Boolean <changedThisFrame>k__BackingField
    // Size: 0x1
    // Offset: 0xE0
    bool changedThisFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: changedThisFrame and: m_Position
    char __padding5[0x3] = {};
    // private UnityEngine.Vector3 m_Position
    // Size: 0xC
    // Offset: 0xE4
    ::UnityEngine::Vector3 m_Position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_Orientation
    // Size: 0x10
    // Offset: 0xF0
    ::UnityEngine::Quaternion m_Orientation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> m_RaycastPoints
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* m_RaycastPoints;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.LayerMask m_RaycastLayerMask
    // Size: 0x4
    // Offset: 0x108
    ::UnityEngine::LayerMask m_RaycastLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    public:
    // Creating value type constructor for type: TrackedDeviceModel
