// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.BaseInputModule
#include "UnityEngine/EventSystems/BaseInputModule.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: AxisEventData
  class AxisEventData;
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Skipping declaration: RaycastResult because it is already included!
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: TrackedDeviceEventData
  class TrackedDeviceEventData;
  // Forward declaring type: MouseModel
  struct MouseModel;
  // Forward declaring type: ButtonDeltaState
  struct ButtonDeltaState;
  // Forward declaring type: TouchModel
  struct TouchModel;
  // Forward declaring type: TrackedDeviceModel
  struct TrackedDeviceModel;
  // Forward declaring type: JoystickModel
  struct JoystickModel;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: UIInputModule
  class UIInputModule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::UI::UIInputModule);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::UIInputModule*, "UnityEngine.XR.Interaction.Toolkit.UI", "UIInputModule");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.UIInputModule
  // [TokenAttribute] Offset: FFFFFFFF
  class UIInputModule : public ::UnityEngine::EventSystems::BaseInputModule {
    public:
    public:
    // [FormerlySerializedAsAttribute] Offset: 0x9826C0
    // [TooltipAttribute] Offset: 0x9826C0
    // private System.Single m_ClickSpeed
    // Size: 0x4
    // Offset: 0x48
    float m_ClickSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x982730
    // [TooltipAttribute] Offset: 0x982730
    // private System.Single m_MoveDeadzone
    // Size: 0x4
    // Offset: 0x4C
    float m_MoveDeadzone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x9827A0
    // [TooltipAttribute] Offset: 0x9827A0
    // private System.Single m_RepeatDelay
    // Size: 0x4
    // Offset: 0x50
    float m_RepeatDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x982810
    // [TooltipAttribute] Offset: 0x982810
    // private System.Single m_RepeatRate
    // Size: 0x4
    // Offset: 0x54
    float m_RepeatRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x982880
    // [TooltipAttribute] Offset: 0x982880
    // private System.Single m_TrackedDeviceDragThresholdMultiplier
    // Size: 0x4
    // Offset: 0x58
    float m_TrackedDeviceDragThresholdMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_TrackedDeviceDragThresholdMultiplier and: uiCamera
    char __padding4[0x4] = {};
    // private UnityEngine.Camera <uiCamera>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Camera* uiCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.EventSystems.AxisEventData m_CachedAxisEvent
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::EventSystems::AxisEventData* m_CachedAxisEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::AxisEventData*) == 0x8);
    // private UnityEngine.EventSystems.PointerEventData m_CachedPointerEvent
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::EventSystems::PointerEventData* m_CachedPointerEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::PointerEventData*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceEventData m_CachedTrackedDeviceEventData
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceEventData* m_CachedTrackedDeviceEventData;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceEventData*) == 0x8);
    public:
    // Get instance field reference: private System.Single m_ClickSpeed
    [[deprecated("Use field access instead!")]] float& dyn_m_ClickSpeed();
    // Get instance field reference: private System.Single m_MoveDeadzone
    [[deprecated("Use field access instead!")]] float& dyn_m_MoveDeadzone();
    // Get instance field reference: private System.Single m_RepeatDelay
    [[deprecated("Use field access instead!")]] float& dyn_m_RepeatDelay();
    // Get instance field reference: private System.Single m_RepeatRate
    [[deprecated("Use field access instead!")]] float& dyn_m_RepeatRate();
    // Get instance field reference: private System.Single m_TrackedDeviceDragThresholdMultiplier
