// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaCollection
  class XmlSchemaCollection;
  // Forward declaring type: SchemaNames
  class SchemaNames;
  // Forward declaring type: SchemaInfo
  class SchemaInfo;
  // Forward declaring type: ValidationState
  class ValidationState;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: XmlSchemaException
  class XmlSchemaException;
  // Forward declaring type: XmlSeverityType
  struct XmlSeverityType;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: IValidationEventHandling
  class IValidationEventHandling;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: PositionInfo
  class PositionInfo;
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: XmlValidatingReaderImpl
  class XmlValidatingReaderImpl;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: IDtdInfo
  class IDtdInfo;
  // Forward declaring type: ValidationType
  struct ValidationType;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: BaseValidator
  class BaseValidator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Schema::BaseValidator);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Schema::BaseValidator*, "System.Xml.Schema", "BaseValidator");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x7A
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.BaseValidator
  // [TokenAttribute] Offset: FFFFFFFF
  class BaseValidator : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.Schema.XmlSchemaCollection schemaCollection
    // Size: 0x8
    // Offset: 0x10
    System::Xml::Schema::XmlSchemaCollection* schemaCollection;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaCollection*) == 0x8);
    // private System.Xml.IValidationEventHandling eventHandling
    // Size: 0x8
    // Offset: 0x18
    System::Xml::IValidationEventHandling* eventHandling;
    // Field size check
    static_assert(sizeof(System::Xml::IValidationEventHandling*) == 0x8);
    // private System.Xml.XmlNameTable nameTable
    // Size: 0x8
    // Offset: 0x20
    System::Xml::XmlNameTable* nameTable;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.Schema.SchemaNames schemaNames
    // Size: 0x8
    // Offset: 0x28
    System::Xml::Schema::SchemaNames* schemaNames;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::SchemaNames*) == 0x8);
    // private System.Xml.PositionInfo positionInfo
    // Size: 0x8
    // Offset: 0x30
    System::Xml::PositionInfo* positionInfo;
    // Field size check
    static_assert(sizeof(System::Xml::PositionInfo*) == 0x8);
    // private System.Xml.XmlResolver xmlResolver
    // Size: 0x8
    // Offset: 0x38
    System::Xml::XmlResolver* xmlResolver;
    // Field size check
    static_assert(sizeof(System::Xml::XmlResolver*) == 0x8);
    // private System.Uri baseUri
    // Size: 0x8
    // Offset: 0x40
    System::Uri* baseUri;
    // Field size check
    static_assert(sizeof(System::Uri*) == 0x8);
    // protected System.Xml.Schema.SchemaInfo schemaInfo
    // Size: 0x8
    // Offset: 0x48
    System::Xml::Schema::SchemaInfo* schemaInfo;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::SchemaInfo*) == 0x8);
    // protected System.Xml.XmlValidatingReaderImpl reader
    // Size: 0x8
    // Offset: 0x50
    System::Xml::XmlValidatingReaderImpl* reader;
    // Field size check
    static_assert(sizeof(System::Xml::XmlValidatingReaderImpl*) == 0x8);
    // protected System.Xml.XmlQualifiedName elementName
    // Size: 0x8
    // Offset: 0x58
    System::Xml::XmlQualifiedName* elementName;
    // Field size check
    static_assert(sizeof(System::Xml::XmlQualifiedName*) == 0x8);
    // protected System.Xml.Schema.ValidationState context
    // Size: 0x8
    // Offset: 0x60
    System::Xml::Schema::ValidationState* context;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::ValidationState*) == 0x8);
    // protected System.Text.StringBuilder textValue
    // Size: 0x8
    // Offset: 0x68
    System::Text::StringBuilder* textValue;
    // Field size check
    static_assert(sizeof(System::Text::StringBuilder*) == 0x8);
    // protected System.String textString
    // Size: 0x8
    // Offset: 0x70
    ::StringW textString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected System.Boolean hasSibling
    // Size: 0x1
    // Offset: 0x78
    bool hasSibling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean checkDatatype
    // Size: 0x1
    // Offset: 0x79
    bool checkDatatype;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.Xml.Schema.XmlSchemaCollection schemaCollection
    System::Xml::Schema::XmlSchemaCollection*& dyn_schemaCollection();
    // Get instance field reference: private System.Xml.IValidationEventHandling eventHandling
    System::Xml::IValidationEventHandling*& dyn_eventHandling();
    // Get instance field reference: private System.Xml.XmlNameTable nameTable
    System::Xml::XmlNameTable*& dyn_nameTable();
    // Get instance field reference: private System.Xml.Schema.SchemaNames schemaNames
    System::Xml::Schema::SchemaNames*& dyn_schemaNames();
    // Get instance field reference: private System.Xml.PositionInfo positionInfo
    System::Xml::PositionInfo*& dyn_positionInfo();
    // Get instance field reference: private System.Xml.XmlResolver xmlResolver
    System::Xml::XmlResolver*& dyn_xmlResolver();
