// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.BaseProcessor
#include "System/Xml/Schema/BaseProcessor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaObjectTable
  class XmlSchemaObjectTable;
  // Forward declaring type: XmlSchema
  class XmlSchema;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: XmlSchemaCompilationSettings
  class XmlSchemaCompilationSettings;
  // Forward declaring type: XmlSchemaSet
  class XmlSchemaSet;
  // Forward declaring type: SchemaInfo
  class SchemaInfo;
  // Forward declaring type: XmlSchemaAttribute
  class XmlSchemaAttribute;
  // Forward declaring type: XmlSchemaAttributeGroup
  class XmlSchemaAttributeGroup;

  // Forward declaring type: XmlSchemaParticle
  class XmlSchemaParticle;
  // Forward declaring type: XmlSchemaSubstitutionGroup
  class XmlSchemaSubstitutionGroup;
  // Forward declaring type: XmlSchemaSimpleContentExtension
  class XmlSchemaSimpleContentExtension;
  // Forward declaring type: XmlSchemaSimpleContentRestriction
  class XmlSchemaSimpleContentRestriction;
  // Forward declaring type: XmlSchemaComplexContent
  class XmlSchemaComplexContent;
  // Forward declaring type: XmlSchemaComplexContentExtension
  class XmlSchemaComplexContentExtension;
  // Forward declaring type: XmlSchemaComplexContentRestriction
  class XmlSchemaComplexContentRestriction;
  // Forward declaring type: XmlSchemaGroupRef
  class XmlSchemaGroupRef;
  // Forward declaring type: XmlSchemaAll
  class XmlSchemaAll;
  // Forward declaring type: XmlSchemaChoice
  class XmlSchemaChoice;
  // Forward declaring type: XmlSchemaSequence
  class XmlSchemaSequence;
  // Forward declaring type: XmlSchemaAny
  class XmlSchemaAny;
  // Forward declaring type: XmlSchemaGroupBase
  class XmlSchemaGroupBase;
  // Forward declaring type: XmlSchemaContentType
  struct XmlSchemaContentType;
  // Forward declaring type: XmlSchemaAnyAttribute
  class XmlSchemaAnyAttribute;
  // Forward declaring type: XmlSchemaDerivationMethod
  struct XmlSchemaDerivationMethod;
  // Forward declaring type: SchemaAttDef
  class SchemaAttDef;
  // Forward declaring type: XmlSchemaIdentityConstraint
  class XmlSchemaIdentityConstraint;
  // Forward declaring type: ContentValidator
  class ContentValidator;
  // Forward declaring type: ParticleContentValidator
  class ParticleContentValidator;
  // Forward declaring type: XmlSchemaType
  class XmlSchemaType;
  // Forward declaring type: XmlSchemaAnnotated
  class XmlSchemaAnnotated;
  // Forward declaring type: SchemaDeclBase
  class SchemaDeclBase;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Stack
  class Stack;
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Decimal
  struct Decimal;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: Compiler
  class Compiler;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Schema::Compiler);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Schema::Compiler*, "System.Xml.Schema", "Compiler");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.Compiler
  // [TokenAttribute] Offset: FFFFFFFF
  class Compiler : public System::Xml::Schema::BaseProcessor {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.String restrictionErrorMsg
    // Size: 0x8
    // Offset: 0x40
    ::StringW restrictionErrorMsg;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable attributes
    // Size: 0x8
    // Offset: 0x48
    System::Xml::Schema::XmlSchemaObjectTable* attributes;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable attributeGroups
    // Size: 0x8
    // Offset: 0x50
    System::Xml::Schema::XmlSchemaObjectTable* attributeGroups;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable elements
    // Size: 0x8
    // Offset: 0x58
    System::Xml::Schema::XmlSchemaObjectTable* elements;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable schemaTypes
    // Size: 0x8
    // Offset: 0x60
    System::Xml::Schema::XmlSchemaObjectTable* schemaTypes;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable groups
    // Size: 0x8
    // Offset: 0x68
    System::Xml::Schema::XmlSchemaObjectTable* groups;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable notations
    // Size: 0x8
    // Offset: 0x70
    System::Xml::Schema::XmlSchemaObjectTable* notations;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable examplars
    // Size: 0x8
    // Offset: 0x78
    System::Xml::Schema::XmlSchemaObjectTable* examplars;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable identityConstraints
    // Size: 0x8
    // Offset: 0x80
    System::Xml::Schema::XmlSchemaObjectTable* identityConstraints;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Collections.Stack complexTypeStack
    // Size: 0x8
    // Offset: 0x88
    System::Collections::Stack* complexTypeStack;
    // Field size check
    static_assert(sizeof(System::Collections::Stack*) == 0x8);
    // private System.Collections.Hashtable schemasToCompile
    // Size: 0x8
    // Offset: 0x90
    System::Collections::Hashtable* schemasToCompile;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable importedSchemas
    // Size: 0x8
    // Offset: 0x98
    System::Collections::Hashtable* importedSchemas;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Xml.Schema.XmlSchema schemaForSchema
    // Size: 0x8
    // Offset: 0xA0
    System::Xml::Schema::XmlSchema* schemaForSchema;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchema*) == 0x8);
    public:
    // Get instance field reference: private System.String restrictionErrorMsg
    ::StringW& dyn_restrictionErrorMsg();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaObjectTable attributes
    System::Xml::Schema::XmlSchemaObjectTable*& dyn_attributes();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaObjectTable attributeGroups
    System::Xml::Schema::XmlSchemaObjectTable*& dyn_attributeGroups();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaObjectTable elements
    System::Xml::Schema::XmlSchemaObjectTable*& dyn_elements();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaObjectTable schemaTypes
    System::Xml::Schema::XmlSchemaObjectTable*& dyn_schemaTypes();
