// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.FacetsChecker
#include "System/Xml/Schema/FacetsChecker.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Xml.Schema.RestrictionFlags
#include "System/Xml/Schema/RestrictionFlags.hpp"
// Including type: System.Xml.Schema.XmlTypeCode
#include "System/Xml/Schema/XmlTypeCode.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaFacet
  class XmlSchemaFacet;
  // Forward declaring type: DatatypeImplementation
  class DatatypeImplementation;
  // Forward declaring type: RestrictionFacets
  class RestrictionFacets;
  // Forward declaring type: XmlSchemaDatatype
  class XmlSchemaDatatype;
  // Forward declaring type: XmlSchemaPatternFacet
  class XmlSchemaPatternFacet;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: IXmlNamespaceResolver
  class IXmlNamespaceResolver;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::FacetsChecker::FacetsCompiler, "System.Xml.Schema", "FacetsChecker/FacetsCompiler");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x48
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Xml.Schema.FacetsChecker/System.Xml.Schema.FacetsCompiler
  // [TokenAttribute] Offset: FFFFFFFF
  struct FacetsChecker::FacetsCompiler/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::System::Xml::Schema::FacetsChecker::FacetsCompiler::Map
    struct Map;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.Schema.FacetsChecker/System.Xml.Schema.FacetsCompiler/System.Xml.Schema.Map
    // [TokenAttribute] Offset: FFFFFFFF
    struct Map/*, public ::System::ValueType*/ {
      public:
      public:
      // System.Char match
      // Size: 0x2
      // Offset: 0x0
      ::Il2CppChar match;
      // Field size check
      static_assert(sizeof(::Il2CppChar) == 0x2);
      // Padding between fields: match and: replacement
      char __padding0[0x6] = {};
      // System.String replacement
      // Size: 0x8
      // Offset: 0x8
      ::StringW replacement;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      public:
      // Creating value type constructor for type: Map
      constexpr Map(::Il2CppChar match_ = {}, ::StringW replacement_ = {}) noexcept : match{match_}, replacement{replacement_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: System.Char match
      ::Il2CppChar& dyn_match();
      // Get instance field reference: System.String replacement
      ::StringW& dyn_replacement();
      // System.Void .ctor(System.Char m, System.String r)
      // Offset: 0x1499DBC
      // ABORTED: conflicts with another method.  Map(::Il2CppChar m, ::StringW r);
    }; // System.Xml.Schema.FacetsChecker/System.Xml.Schema.FacetsCompiler/System.Xml.Schema.Map
    #pragma pack(pop)
    static check_size<sizeof(FacetsChecker::FacetsCompiler::Map), 8 + sizeof(::StringW)> __System_Xml_Schema_FacetsChecker_FacetsCompiler_MapSizeCheck;
    static_assert(sizeof(FacetsChecker::FacetsCompiler::Map) == 0x10);
    public:
    // private System.Xml.Schema.DatatypeImplementation datatype
    // Size: 0x8
    // Offset: 0x0
    ::System::Xml::Schema::DatatypeImplementation* datatype;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::DatatypeImplementation*) == 0x8);
    // private System.Xml.Schema.RestrictionFacets derivedRestriction
    // Size: 0x8
    // Offset: 0x8
    ::System::Xml::Schema::RestrictionFacets* derivedRestriction;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::RestrictionFacets*) == 0x8);
    // private System.Xml.Schema.RestrictionFlags baseFlags
    // Size: 0x4
    // Offset: 0x10
    ::System::Xml::Schema::RestrictionFlags baseFlags;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::RestrictionFlags) == 0x4);
    // private System.Xml.Schema.RestrictionFlags baseFixedFlags
    // Size: 0x4
    // Offset: 0x14
    ::System::Xml::Schema::RestrictionFlags baseFixedFlags;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::RestrictionFlags) == 0x4);
    // private System.Xml.Schema.RestrictionFlags validRestrictionFlags
    // Size: 0x4
    // Offset: 0x18
    ::System::Xml::Schema::RestrictionFlags validRestrictionFlags;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::RestrictionFlags) == 0x4);
    // Padding between fields: validRestrictionFlags and: nonNegativeInt
    char __padding4[0x4] = {};
    // private System.Xml.Schema.XmlSchemaDatatype nonNegativeInt
    // Size: 0x8
    // Offset: 0x20
    ::System::Xml::Schema::XmlSchemaDatatype* nonNegativeInt;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDatatype*) == 0x8);
    // private System.Xml.Schema.XmlSchemaDatatype builtInType
    // Size: 0x8
    // Offset: 0x28
    ::System::Xml::Schema::XmlSchemaDatatype* builtInType;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDatatype*) == 0x8);
    // private System.Xml.Schema.XmlTypeCode builtInEnum
    // Size: 0x4
    // Offset: 0x30
    ::System::Xml::Schema::XmlTypeCode builtInEnum;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlTypeCode) == 0x4);
    // private System.Boolean firstPattern
    // Size: 0x1
    // Offset: 0x34
    bool firstPattern;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: firstPattern and: regStr
    char __padding8[0x3] = {};
    // private System.Text.StringBuilder regStr
    // Size: 0x8
    // Offset: 0x38
    ::System::Text::StringBuilder* regStr;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Xml.Schema.XmlSchemaPatternFacet pattern_facet
    // Size: 0x8
    // Offset: 0x40
    ::System::Xml::Schema::XmlSchemaPatternFacet* pattern_facet;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaPatternFacet*) == 0x8);
    public:
    // Creating value type constructor for type: FacetsCompiler
