// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.BaseProcessor
#include "System/Xml/Schema/BaseProcessor.hpp"
// Including type: System.Xml.Schema.XmlSchemaForm
#include "System/Xml/Schema/XmlSchemaForm.hpp"
// Including type: System.Xml.Schema.XmlSchemaDerivationMethod
#include "System/Xml/Schema/XmlSchemaDerivationMethod.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchema
  class XmlSchema;
  // Forward declaring type: XmlSchemaExternal
  class XmlSchemaExternal;
  // Forward declaring type: XmlSchemaObject
  class XmlSchemaObject;
  // Forward declaring type: RedefineEntry
  class RedefineEntry;
  // Forward declaring type: XmlSchemaObjectCollection
  class XmlSchemaObjectCollection;
  // Forward declaring type: XmlSchemaGroup
  class XmlSchemaGroup;
  // Forward declaring type: XmlSchemaAttributeGroup
  class XmlSchemaAttributeGroup;
  // Forward declaring type: XmlSchemaSimpleType
  class XmlSchemaSimpleType;
  // Forward declaring type: XmlSchemaComplexType
  class XmlSchemaComplexType;
  // Forward declaring type: XmlSchemaAttribute
  class XmlSchemaAttribute;
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
  // Forward declaring type: XmlSchemaIdentityConstraint
  class XmlSchemaIdentityConstraint;
  // Forward declaring type: XmlSchemaNotation
  class XmlSchemaNotation;
  // Forward declaring type: XmlSchemaParticle
  class XmlSchemaParticle;
  // Forward declaring type: XmlSchemaAnyAttribute
  class XmlSchemaAnyAttribute;
  // Forward declaring type: XmlSchemaAnnotation
  class XmlSchemaAnnotation;
  // Forward declaring type: SchemaNames
  class SchemaNames;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: XmlSchemaCompilationSettings
  class XmlSchemaCompilationSettings;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: SortedList
  class SortedList;
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlReaderSettings
  class XmlReaderSettings;
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: Preprocessor
  class Preprocessor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Schema::Preprocessor);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Schema::Preprocessor*, "System.Xml.Schema", "Preprocessor");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.Preprocessor
  // [TokenAttribute] Offset: FFFFFFFF
  class Preprocessor : public System::Xml::Schema::BaseProcessor {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.String Xmlns
    // Size: 0x8
    // Offset: 0x40
    ::StringW Xmlns;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String NsXsi
    // Size: 0x8
    // Offset: 0x48
    ::StringW NsXsi;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String targetNamespace
    // Size: 0x8
    // Offset: 0x50
    ::StringW targetNamespace;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.Schema.XmlSchema rootSchema
    // Size: 0x8
    // Offset: 0x58
    System::Xml::Schema::XmlSchema* rootSchema;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchema*) == 0x8);
    // private System.Xml.Schema.XmlSchema currentSchema
    // Size: 0x8
    // Offset: 0x60
    System::Xml::Schema::XmlSchema* currentSchema;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchema*) == 0x8);
    // private System.Xml.Schema.XmlSchemaForm elementFormDefault
    // Size: 0x4
    // Offset: 0x68
    System::Xml::Schema::XmlSchemaForm elementFormDefault;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaForm) == 0x4);
    // private System.Xml.Schema.XmlSchemaForm attributeFormDefault
    // Size: 0x4
    // Offset: 0x6C
    System::Xml::Schema::XmlSchemaForm attributeFormDefault;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaForm) == 0x4);
    // private System.Xml.Schema.XmlSchemaDerivationMethod blockDefault
    // Size: 0x4
    // Offset: 0x70
    System::Xml::Schema::XmlSchemaDerivationMethod blockDefault;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaDerivationMethod finalDefault
    // Size: 0x4
    // Offset: 0x74
    System::Xml::Schema::XmlSchemaDerivationMethod finalDefault;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Collections.Hashtable schemaLocations
    // Size: 0x8
    // Offset: 0x78
    System::Collections::Hashtable* schemaLocations;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable chameleonSchemas
    // Size: 0x8
    // Offset: 0x80
    System::Collections::Hashtable* chameleonSchemas;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable referenceNamespaces
    // Size: 0x8
    // Offset: 0x88
    System::Collections::Hashtable* referenceNamespaces;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable processedExternals
    // Size: 0x8
    // Offset: 0x90
    System::Collections::Hashtable* processedExternals;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.SortedList lockList
    // Size: 0x8
    // Offset: 0x98
    System::Collections::SortedList* lockList;
    // Field size check
    static_assert(sizeof(System::Collections::SortedList*) == 0x8);
    // private System.Xml.XmlReaderSettings readerSettings
    // Size: 0x8
    // Offset: 0xA0
    System::Xml::XmlReaderSettings* readerSettings;
    // Field size check
    static_assert(sizeof(System::Xml::XmlReaderSettings*) == 0x8);
    // private System.Xml.Schema.XmlSchema rootSchemaForRedefine
    // Size: 0x8
    // Offset: 0xA8
    System::Xml::Schema::XmlSchema* rootSchemaForRedefine;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchema*) == 0x8);
    // private System.Collections.ArrayList redefinedList
    // Size: 0x8
    // Offset: 0xB0
    System::Collections::ArrayList* redefinedList;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Xml.XmlResolver xmlResolver
    // Size: 0x8
    // Offset: 0xB8
    System::Xml::XmlResolver* xmlResolver;
    // Field size check
    static_assert(sizeof(System::Xml::XmlResolver*) == 0x8);
    public:
    // Get static field: static private System.Xml.Schema.XmlSchema builtInSchemaForXmlNS
    static System::Xml::Schema::XmlSchema* _get_builtInSchemaForXmlNS();
    // Set static field: static private System.Xml.Schema.XmlSchema builtInSchemaForXmlNS
    static void _set_builtInSchemaForXmlNS(System::Xml::Schema::XmlSchema* value);
    // Get instance field reference: private System.String Xmlns
    ::StringW& dyn_Xmlns();
    // Get instance field reference: private System.String NsXsi
    ::StringW& dyn_NsXsi();
    // Get instance field reference: private System.String targetNamespace
    ::StringW& dyn_targetNamespace();
    // Get instance field reference: private System.Xml.Schema.XmlSchema rootSchema
    System::Xml::Schema::XmlSchema*& dyn_rootSchema();
