// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.XmlSchemaWhiteSpace
#include "System/Xml/Schema/XmlSchemaWhiteSpace.hpp"
// Including type: System.Xml.Schema.RestrictionFlags
#include "System/Xml/Schema/RestrictionFlags.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: RestrictionFacets
  class RestrictionFacets;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Schema::RestrictionFacets);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::RestrictionFacets*, "System.Xml.Schema", "RestrictionFacets");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x64
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.RestrictionFacets
  // [TokenAttribute] Offset: FFFFFFFF
  class RestrictionFacets : public ::Il2CppObject {
    public:
    public:
    // System.Int32 Length
    // Size: 0x4
    // Offset: 0x10
    int Length;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 MinLength
    // Size: 0x4
    // Offset: 0x14
    int MinLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 MaxLength
    // Size: 0x4
    // Offset: 0x18
    int MaxLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: MaxLength and: Patterns
    char __padding2[0x4] = {};
    // System.Collections.ArrayList Patterns
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::ArrayList* Patterns;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // System.Collections.ArrayList Enumeration
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::ArrayList* Enumeration;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // System.Xml.Schema.XmlSchemaWhiteSpace WhiteSpace
    // Size: 0x4
    // Offset: 0x30
    ::System::Xml::Schema::XmlSchemaWhiteSpace WhiteSpace;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaWhiteSpace) == 0x4);
    // Padding between fields: WhiteSpace and: MaxInclusive
    char __padding5[0x4] = {};
    // System.Object MaxInclusive
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppObject* MaxInclusive;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Object MaxExclusive
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppObject* MaxExclusive;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Object MinInclusive
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* MinInclusive;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Object MinExclusive
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppObject* MinExclusive;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Int32 TotalDigits
    // Size: 0x4
    // Offset: 0x58
    int TotalDigits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 FractionDigits
    // Size: 0x4
    // Offset: 0x5C
    int FractionDigits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Xml.Schema.RestrictionFlags Flags
    // Size: 0x4
    // Offset: 0x60
    ::System::Xml::Schema::RestrictionFlags Flags;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::RestrictionFlags) == 0x4);
    public:
    // Get instance field reference: System.Int32 Length
    [[deprecated("Use field access instead!")]] int& dyn_Length();
    // Get instance field reference: System.Int32 MinLength
    [[deprecated("Use field access instead!")]] int& dyn_MinLength();
    // Get instance field reference: System.Int32 MaxLength
    [[deprecated("Use field access instead!")]] int& dyn_MaxLength();
    // Get instance field reference: System.Collections.ArrayList Patterns
    [[deprecated("Use field access instead!")]] ::System::Collections::ArrayList*& dyn_Patterns();
    // Get instance field reference: System.Collections.ArrayList Enumeration
    [[deprecated("Use field access instead!")]] ::System::Collections::ArrayList*& dyn_Enumeration();
    // Get instance field reference: System.Xml.Schema.XmlSchemaWhiteSpace WhiteSpace
    [[deprecated("Use field access instead!")]] ::System::Xml::Schema::XmlSchemaWhiteSpace& dyn_WhiteSpace();
    // Get instance field reference: System.Object MaxInclusive
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_MaxInclusive();
    // Get instance field reference: System.Object MaxExclusive
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_MaxExclusive();
    // Get instance field reference: System.Object MinInclusive
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_MinInclusive();
    // Get instance field reference: System.Object MinExclusive
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_MinExclusive();
    // Get instance field reference: System.Int32 TotalDigits
    [[deprecated("Use field access instead!")]] int& dyn_TotalDigits();
    // Get instance field reference: System.Int32 FractionDigits
    [[deprecated("Use field access instead!")]] int& dyn_FractionDigits();
    // Get instance field reference: System.Xml.Schema.RestrictionFlags Flags
    [[deprecated("Use field access instead!")]] ::System::Xml::Schema::RestrictionFlags& dyn_Flags();
  }; // System.Xml.Schema.RestrictionFacets
  #pragma pack(pop)
  static check_size<sizeof(RestrictionFacets), 96 + sizeof(::System::Xml::Schema::RestrictionFlags)> __System_Xml_Schema_RestrictionFacetsSizeCheck;
  static_assert(sizeof(RestrictionFacets) == 0x64);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
