// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.BaseProcessor
#include "System/Xml/Schema/BaseProcessor.hpp"
// Including type: System.Xml.Schema.XmlSchemaForm
#include "System/Xml/Schema/XmlSchemaForm.hpp"
// Including type: System.Xml.Schema.XmlSchemaDerivationMethod
#include "System/Xml/Schema/XmlSchemaDerivationMethod.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchema
  class XmlSchema;
  // Forward declaring type: XmlSchemaCollection
  class XmlSchemaCollection;
  // Forward declaring type: XmlSchemaRedefine
  class XmlSchemaRedefine;
  // Forward declaring type: XmlSchemaObjectCollection
  class XmlSchemaObjectCollection;
  // Forward declaring type: XmlSchemaGroup
  class XmlSchemaGroup;
  // Forward declaring type: XmlSchemaAttributeGroup
  class XmlSchemaAttributeGroup;
  // Forward declaring type: XmlSchemaSimpleType
  class XmlSchemaSimpleType;
  // Forward declaring type: XmlSchemaComplexType
  class XmlSchemaComplexType;
  // Forward declaring type: XmlSchemaAttribute
  class XmlSchemaAttribute;
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
  // Forward declaring type: XmlSchemaIdentityConstraint
  class XmlSchemaIdentityConstraint;
  // Forward declaring type: XmlSchemaNotation
  class XmlSchemaNotation;
  // Forward declaring type: XmlSchemaParticle
  class XmlSchemaParticle;
  // Forward declaring type: XmlSchemaAnyAttribute
  class XmlSchemaAnyAttribute;
  // Forward declaring type: XmlSchemaObject
  class XmlSchemaObject;
  // Forward declaring type: SchemaNames
  class SchemaNames;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: SchemaCollectionPreprocessor
  class SchemaCollectionPreprocessor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Schema::SchemaCollectionPreprocessor);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Schema::SchemaCollectionPreprocessor*, "System.Xml.Schema", "SchemaCollectionPreprocessor");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.SchemaCollectionPreprocessor
  // [TokenAttribute] Offset: FFFFFFFF
  class SchemaCollectionPreprocessor : public System::Xml::Schema::BaseProcessor {
    public:
    // Nested type: System::Xml::Schema::SchemaCollectionPreprocessor::Compositor
    struct Compositor;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.Schema.XmlSchema schema
    // Size: 0x8
    // Offset: 0x40
    System::Xml::Schema::XmlSchema* schema;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchema*) == 0x8);
    // private System.String targetNamespace
    // Size: 0x8
    // Offset: 0x48
    ::StringW targetNamespace;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean buildinIncluded
    // Size: 0x1
    // Offset: 0x50
    bool buildinIncluded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: buildinIncluded and: elementFormDefault
    char __padding2[0x3] = {};
    // private System.Xml.Schema.XmlSchemaForm elementFormDefault
    // Size: 0x4
    // Offset: 0x54
    System::Xml::Schema::XmlSchemaForm elementFormDefault;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaForm) == 0x4);
    // private System.Xml.Schema.XmlSchemaForm attributeFormDefault
    // Size: 0x4
    // Offset: 0x58
    System::Xml::Schema::XmlSchemaForm attributeFormDefault;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaForm) == 0x4);
    // private System.Xml.Schema.XmlSchemaDerivationMethod blockDefault
    // Size: 0x4
    // Offset: 0x5C
    System::Xml::Schema::XmlSchemaDerivationMethod blockDefault;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaDerivationMethod finalDefault
    // Size: 0x4
    // Offset: 0x60
    System::Xml::Schema::XmlSchemaDerivationMethod finalDefault;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // Padding between fields: finalDefault and: schemaLocations
    char __padding6[0x4] = {};
    // private System.Collections.Hashtable schemaLocations
    // Size: 0x8
    // Offset: 0x68
    System::Collections::Hashtable* schemaLocations;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable referenceNamespaces
    // Size: 0x8
    // Offset: 0x70
    System::Collections::Hashtable* referenceNamespaces;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.String Xmlns
    // Size: 0x8
    // Offset: 0x78
    ::StringW Xmlns;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlResolver xmlResolver
    // Size: 0x8
    // Offset: 0x80
    System::Xml::XmlResolver* xmlResolver;
    // Field size check
    static_assert(sizeof(System::Xml::XmlResolver*) == 0x8);
    public:
    // Get instance field reference: private System.Xml.Schema.XmlSchema schema
    System::Xml::Schema::XmlSchema*& dyn_schema();
    // Get instance field reference: private System.String targetNamespace
    ::StringW& dyn_targetNamespace();
    // Get instance field reference: private System.Boolean buildinIncluded
    bool& dyn_buildinIncluded();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaForm elementFormDefault
    System::Xml::Schema::XmlSchemaForm& dyn_elementFormDefault();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaForm attributeFormDefault
    System::Xml::Schema::XmlSchemaForm& dyn_attributeFormDefault();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaDerivationMethod blockDefault
