// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.IDtdEntityInfo
#include "System/Xml/IDtdEntityInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: SchemaEntity
  class SchemaEntity;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Schema::SchemaEntity);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::SchemaEntity*, "System.Xml.Schema", "SchemaEntity");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.SchemaEntity
  // [TokenAttribute] Offset: FFFFFFFF
  class SchemaEntity : public ::Il2CppObject/*, public ::System::Xml::IDtdEntityInfo*/ {
    public:
    public:
    // private System.Xml.XmlQualifiedName qname
    // Size: 0x8
    // Offset: 0x10
    ::System::Xml::XmlQualifiedName* qname;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlQualifiedName*) == 0x8);
    // private System.String url
    // Size: 0x8
    // Offset: 0x18
    ::StringW url;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String pubid
    // Size: 0x8
    // Offset: 0x20
    ::StringW pubid;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String text
    // Size: 0x8
    // Offset: 0x28
    ::StringW text;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlQualifiedName ndata
    // Size: 0x8
    // Offset: 0x30
    ::System::Xml::XmlQualifiedName* ndata;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlQualifiedName*) == 0x8);
    // private System.Int32 lineNumber
    // Size: 0x4
    // Offset: 0x38
    int lineNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 linePosition
    // Size: 0x4
    // Offset: 0x3C
    int linePosition;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean isParameter
    // Size: 0x1
    // Offset: 0x40
    bool isParameter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isExternal
    // Size: 0x1
    // Offset: 0x41
    bool isExternal;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean parsingInProgress
    // Size: 0x1
    // Offset: 0x42
    bool parsingInProgress;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isDeclaredInExternal
    // Size: 0x1
    // Offset: 0x43
    bool isDeclaredInExternal;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isDeclaredInExternal and: baseURI
    char __padding10[0x4] = {};
    // private System.String baseURI
    // Size: 0x8
    // Offset: 0x48
    ::StringW baseURI;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String declaredURI
    // Size: 0x8
    // Offset: 0x50
    ::StringW declaredURI;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::Xml::IDtdEntityInfo
    operator ::System::Xml::IDtdEntityInfo() noexcept {
      return *reinterpret_cast<::System::Xml::IDtdEntityInfo*>(this);
    }
    // Creating interface conversion operator: i_IDtdEntityInfo
    inline ::System::Xml::IDtdEntityInfo* i_IDtdEntityInfo() noexcept {
      return reinterpret_cast<::System::Xml::IDtdEntityInfo*>(this);
    }
    // Get instance field reference: private System.Xml.XmlQualifiedName qname
    [[deprecated("Use field access instead!")]] ::System::Xml::XmlQualifiedName*& dyn_qname();
    // Get instance field reference: private System.String url
    [[deprecated("Use field access instead!")]] ::StringW& dyn_url();
    // Get instance field reference: private System.String pubid
