// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.SchemaDeclBase
#include "System/Xml/Schema/SchemaDeclBase.hpp"
// Including type: System.Xml.IDtdAttributeListInfo
#include "System/Xml/IDtdAttributeListInfo.hpp"
// Including type: System.Xml.Schema.XmlSchemaDerivationMethod
#include "System/Xml/Schema/XmlSchemaDerivationMethod.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: IDtdDefaultAttributeInfo
  class IDtdDefaultAttributeInfo;
  // Forward declaring type: IDtdAttributeInfo
  class IDtdAttributeInfo;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: SchemaAttDef
  class SchemaAttDef;
  // Forward declaring type: ContentValidator
  class ContentValidator;
  // Forward declaring type: XmlSchemaAnyAttribute
  class XmlSchemaAnyAttribute;
  // Forward declaring type: CompiledIdentityConstraint
  class CompiledIdentityConstraint;
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
  // Forward declaring type: XmlSchemaDatatype
  class XmlSchemaDatatype;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: SchemaElementDecl
  class SchemaElementDecl;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Schema::SchemaElementDecl);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Schema::SchemaElementDecl*, "System.Xml.Schema", "SchemaElementDecl");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.SchemaElementDecl
  // [TokenAttribute] Offset: FFFFFFFF
  class SchemaElementDecl : public System::Xml::Schema::SchemaDeclBase/*, public System::Xml::IDtdAttributeListInfo*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Collections.Generic.Dictionary`2<System.Xml.XmlQualifiedName,System.Xml.Schema.SchemaAttDef> attdefs
    // Size: 0x8
    // Offset: 0x60
    System::Collections::Generic::Dictionary_2<System::Xml::XmlQualifiedName*, System::Xml::Schema::SchemaAttDef*>* attdefs;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<System::Xml::XmlQualifiedName*, System::Xml::Schema::SchemaAttDef*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Xml.IDtdDefaultAttributeInfo> defaultAttdefs
    // Size: 0x8
    // Offset: 0x68
    System::Collections::Generic::List_1<System::Xml::IDtdDefaultAttributeInfo*>* defaultAttdefs;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<System::Xml::IDtdDefaultAttributeInfo*>*) == 0x8);
    // private System.Boolean isIdDeclared
    // Size: 0x1
    // Offset: 0x70
    bool isIdDeclared;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasNonCDataAttribute
    // Size: 0x1
    // Offset: 0x71
    bool hasNonCDataAttribute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isAbstract
    // Size: 0x1
    // Offset: 0x72
    bool isAbstract;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isNillable
    // Size: 0x1
    // Offset: 0x73
    bool isNillable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasRequiredAttribute
    // Size: 0x1
    // Offset: 0x74
    bool hasRequiredAttribute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isNotationDeclared
    // Size: 0x1
    // Offset: 0x75
    bool isNotationDeclared;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isNotationDeclared and: prohibitedAttributes
    char __padding7[0x2] = {};
    // private System.Collections.Generic.Dictionary`2<System.Xml.XmlQualifiedName,System.Xml.XmlQualifiedName> prohibitedAttributes
    // Size: 0x8
    // Offset: 0x78
    System::Collections::Generic::Dictionary_2<System::Xml::XmlQualifiedName*, System::Xml::XmlQualifiedName*>* prohibitedAttributes;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<System::Xml::XmlQualifiedName*, System::Xml::XmlQualifiedName*>*) == 0x8);
    // private System.Xml.Schema.ContentValidator contentValidator
    // Size: 0x8
    // Offset: 0x80
    System::Xml::Schema::ContentValidator* contentValidator;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::ContentValidator*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAnyAttribute anyAttribute
    // Size: 0x8
    // Offset: 0x88
    System::Xml::Schema::XmlSchemaAnyAttribute* anyAttribute;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaAnyAttribute*) == 0x8);
    // private System.Xml.Schema.XmlSchemaDerivationMethod block
    // Size: 0x4
    // Offset: 0x90
    System::Xml::Schema::XmlSchemaDerivationMethod block;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // Padding between fields: block and: constraints
    char __padding11[0x4] = {};
    // private System.Xml.Schema.CompiledIdentityConstraint[] constraints
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<System::Xml::Schema::CompiledIdentityConstraint*> constraints;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Xml::Schema::CompiledIdentityConstraint*>) == 0x8);
    // private System.Xml.Schema.XmlSchemaElement schemaElement
    // Size: 0x8
    // Offset: 0xA0
    System::Xml::Schema::XmlSchemaElement* schemaElement;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaElement*) == 0x8);
    public:
    // Creating interface conversion operator: operator System::Xml::IDtdAttributeListInfo
    operator System::Xml::IDtdAttributeListInfo() noexcept {
      return *reinterpret_cast<System::Xml::IDtdAttributeListInfo*>(this);
    }
    // Get static field: static readonly System.Xml.Schema.SchemaElementDecl Empty
    static System::Xml::Schema::SchemaElementDecl* _get_Empty();
    // Set static field: static readonly System.Xml.Schema.SchemaElementDecl Empty
    static void _set_Empty(System::Xml::Schema::SchemaElementDecl* value);
    // Get instance field reference: private System.Collections.Generic.Dictionary`2<System.Xml.XmlQualifiedName,System.Xml.Schema.SchemaAttDef> attdefs
