// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.SchemaBuilder
#include "System/Xml/Schema/SchemaBuilder.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: SchemaInfo
  class SchemaInfo;
  // Forward declaring type: ParticleContentValidator
  class ParticleContentValidator;
  // Forward declaring type: SchemaNames
  class SchemaNames;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: SchemaAttDef
  class SchemaAttDef;
  // Forward declaring type: XmlSchemaDatatype
  class XmlSchemaDatatype;
  // Forward declaring type: XmlSeverityType
  struct XmlSeverityType;
  // Forward declaring type: XmlSchemaException
  class XmlSchemaException;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: PositionInfo
  class PositionInfo;
  // Forward declaring type: HWStack
  class HWStack;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XmlNamespaceManager
  class XmlNamespaceManager;
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: XmlNode
  class XmlNode;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XdrBuilder
  class XdrBuilder;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Schema::XdrBuilder);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Schema::XdrBuilder*, "System.Xml.Schema", "XdrBuilder");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XdrBuilder
  // [TokenAttribute] Offset: FFFFFFFF
  class XdrBuilder : public System::Xml::Schema::SchemaBuilder {
    public:
    // Nested type: System::Xml::Schema::XdrBuilder::DeclBaseInfo
    class DeclBaseInfo;
    // Nested type: System::Xml::Schema::XdrBuilder::GroupContent
    class GroupContent;
    // Nested type: System::Xml::Schema::XdrBuilder::ElementContent
    class ElementContent;
    // Nested type: System::Xml::Schema::XdrBuilder::AttributeContent
    class AttributeContent;
    // Nested type: System::Xml::Schema::XdrBuilder::XdrBuildFunction
    class XdrBuildFunction;
    // Nested type: System::Xml::Schema::XdrBuilder::XdrInitFunction
    class XdrInitFunction;
    // Nested type: System::Xml::Schema::XdrBuilder::XdrBeginChildFunction
    class XdrBeginChildFunction;
    // Nested type: System::Xml::Schema::XdrBuilder::XdrEndChildFunction
    class XdrEndChildFunction;
    // Nested type: System::Xml::Schema::XdrBuilder::XdrAttributeEntry
    class XdrAttributeEntry;
    // Nested type: System::Xml::Schema::XdrBuilder::XdrEntry
    class XdrEntry;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.Schema.SchemaInfo _SchemaInfo
    // Size: 0x8
    // Offset: 0x10
    System::Xml::Schema::SchemaInfo* SchemaInfo;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::SchemaInfo*) == 0x8);
    // private System.String _TargetNamespace
    // Size: 0x8
    // Offset: 0x18
    ::StringW TargetNamespace;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlReader _reader
    // Size: 0x8
    // Offset: 0x20
    System::Xml::XmlReader* reader;
    // Field size check
    static_assert(sizeof(System::Xml::XmlReader*) == 0x8);
    // private System.Xml.PositionInfo positionInfo
    // Size: 0x8
    // Offset: 0x28
    System::Xml::PositionInfo* positionInfo;
    // Field size check
    static_assert(sizeof(System::Xml::PositionInfo*) == 0x8);
    // private System.Xml.Schema.ParticleContentValidator _contentValidator
    // Size: 0x8
    // Offset: 0x30
    System::Xml::Schema::ParticleContentValidator* contentValidator;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::ParticleContentValidator*) == 0x8);
    // private System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrEntry _CurState
    // Size: 0x8
    // Offset: 0x38
    System::Xml::Schema::XdrBuilder::XdrEntry* CurState;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XdrBuilder::XdrEntry*) == 0x8);
    // private System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrEntry _NextState
    // Size: 0x8
    // Offset: 0x40
    System::Xml::Schema::XdrBuilder::XdrEntry* NextState;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XdrBuilder::XdrEntry*) == 0x8);
    // private System.Xml.HWStack _StateHistory
    // Size: 0x8
    // Offset: 0x48
    System::Xml::HWStack* StateHistory;
    // Field size check
    static_assert(sizeof(System::Xml::HWStack*) == 0x8);
    // private System.Xml.HWStack _GroupStack
    // Size: 0x8
    // Offset: 0x50
    System::Xml::HWStack* GroupStack;
    // Field size check
    static_assert(sizeof(System::Xml::HWStack*) == 0x8);
    // private System.String _XdrName
    // Size: 0x8
    // Offset: 0x58
    ::StringW XdrName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _XdrPrefix
    // Size: 0x8
    // Offset: 0x60
    ::StringW XdrPrefix;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.Schema.XdrBuilder/System.Xml.Schema.ElementContent _ElementDef
    // Size: 0x8
    // Offset: 0x68
    System::Xml::Schema::XdrBuilder::ElementContent* ElementDef;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XdrBuilder::ElementContent*) == 0x8);
    // private System.Xml.Schema.XdrBuilder/System.Xml.Schema.GroupContent _GroupDef
    // Size: 0x8
    // Offset: 0x70
    System::Xml::Schema::XdrBuilder::GroupContent* GroupDef;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XdrBuilder::GroupContent*) == 0x8);
    // private System.Xml.Schema.XdrBuilder/System.Xml.Schema.AttributeContent _AttributeDef
    // Size: 0x8
    // Offset: 0x78
    System::Xml::Schema::XdrBuilder::AttributeContent* AttributeDef;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XdrBuilder::AttributeContent*) == 0x8);
    // private System.Xml.Schema.XdrBuilder/System.Xml.Schema.DeclBaseInfo _UndefinedAttributeTypes
    // Size: 0x8
    // Offset: 0x80
    System::Xml::Schema::XdrBuilder::DeclBaseInfo* UndefinedAttributeTypes;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XdrBuilder::DeclBaseInfo*) == 0x8);
    // private System.Xml.Schema.XdrBuilder/System.Xml.Schema.DeclBaseInfo _BaseDecl
    // Size: 0x8
    // Offset: 0x88
    System::Xml::Schema::XdrBuilder::DeclBaseInfo* BaseDecl;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XdrBuilder::DeclBaseInfo*) == 0x8);
    // private System.Xml.XmlNameTable _NameTable
    // Size: 0x8
    // Offset: 0x90
    System::Xml::XmlNameTable* NameTable;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.Schema.SchemaNames _SchemaNames
    // Size: 0x8
    // Offset: 0x98
    System::Xml::Schema::SchemaNames* SchemaNames;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::SchemaNames*) == 0x8);
    // private System.Xml.XmlNamespaceManager _CurNsMgr
    // Size: 0x8
    // Offset: 0xA0
    System::Xml::XmlNamespaceManager* CurNsMgr;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNamespaceManager*) == 0x8);
    // private System.String _Text
    // Size: 0x8
    // Offset: 0xA8
    ::StringW Text;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.Schema.ValidationEventHandler validationEventHandler
    // Size: 0x8
    // Offset: 0xB0
    System::Xml::Schema::ValidationEventHandler* validationEventHandler;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::ValidationEventHandler*) == 0x8);
    // private System.Collections.Hashtable _UndeclaredElements
    // Size: 0x8
    // Offset: 0xB8
    System::Collections::Hashtable* UndeclaredElements;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Xml.XmlResolver xmlResolver
    // Size: 0x8
    // Offset: 0xC0
    System::Xml::XmlResolver* xmlResolver;
    // Field size check
    static_assert(sizeof(System::Xml::XmlResolver*) == 0x8);
    public:
    // Get static field: static private readonly System.Int32[] S_XDR_Root_Element
    static ::ArrayW<int> _get_S_XDR_Root_Element();
    // Set static field: static private readonly System.Int32[] S_XDR_Root_Element
    static void _set_S_XDR_Root_Element(::ArrayW<int> value);
    // Get static field: static private readonly System.Int32[] S_XDR_Root_SubElements
    static ::ArrayW<int> _get_S_XDR_Root_SubElements();
    // Set static field: static private readonly System.Int32[] S_XDR_Root_SubElements
    static void _set_S_XDR_Root_SubElements(::ArrayW<int> value);
    // Get static field: static private readonly System.Int32[] S_XDR_ElementType_SubElements
    static ::ArrayW<int> _get_S_XDR_ElementType_SubElements();
    // Set static field: static private readonly System.Int32[] S_XDR_ElementType_SubElements
