// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.XdrBuilder
#include "System/Xml/Schema/XdrBuilder.hpp"
// Including type: System.Xml.Schema.SchemaNames/System.Xml.Schema.Token
#include "System/Xml/Schema/SchemaNames_Token.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Schema::XdrBuilder::XdrEntry);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::XdrBuilder::XdrEntry*, "System.Xml.Schema", "XdrBuilder/XdrEntry");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x41
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrEntry
  // [TokenAttribute] Offset: FFFFFFFF
  class XdrBuilder::XdrEntry : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // System.Xml.Schema.SchemaNames/System.Xml.Schema.Token _Name
    // Size: 0x4
    // Offset: 0x10
    ::System::Xml::Schema::SchemaNames::Token Name;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::SchemaNames::Token) == 0x4);
    // Padding between fields: Name and: NextStates
    char __padding0[0x4] = {};
    // System.Int32[] _NextStates
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<int> NextStates;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrAttributeEntry[] _Attributes
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::System::Xml::Schema::XdrBuilder::XdrAttributeEntry*> Attributes;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::Schema::XdrBuilder::XdrAttributeEntry*>) == 0x8);
    // System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrInitFunction _InitFunc
    // Size: 0x8
    // Offset: 0x28
    ::System::Xml::Schema::XdrBuilder::XdrInitFunction* InitFunc;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XdrBuilder::XdrInitFunction*) == 0x8);
    // System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrBeginChildFunction _BeginChildFunc
    // Size: 0x8
    // Offset: 0x30
    ::System::Xml::Schema::XdrBuilder::XdrBeginChildFunction* BeginChildFunc;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XdrBuilder::XdrBeginChildFunction*) == 0x8);
    // System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrEndChildFunction _EndChildFunc
    // Size: 0x8
    // Offset: 0x38
    ::System::Xml::Schema::XdrBuilder::XdrEndChildFunction* EndChildFunc;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XdrBuilder::XdrEndChildFunction*) == 0x8);
    // System.Boolean _AllowText
    // Size: 0x1
    // Offset: 0x40
    bool AllowText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: System.Xml.Schema.SchemaNames/System.Xml.Schema.Token _Name
    ::System::Xml::Schema::SchemaNames::Token& dyn__Name();
    // Get instance field reference: System.Int32[] _NextStates
    ::ArrayW<int>& dyn__NextStates();
    // Get instance field reference: System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrAttributeEntry[] _Attributes
    ::ArrayW<::System::Xml::Schema::XdrBuilder::XdrAttributeEntry*>& dyn__Attributes();
    // Get instance field reference: System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrInitFunction _InitFunc
    ::System::Xml::Schema::XdrBuilder::XdrInitFunction*& dyn__InitFunc();
    // Get instance field reference: System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrBeginChildFunction _BeginChildFunc
    ::System::Xml::Schema::XdrBuilder::XdrBeginChildFunction*& dyn__BeginChildFunc();
    // Get instance field reference: System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrEndChildFunction _EndChildFunc
    ::System::Xml::Schema::XdrBuilder::XdrEndChildFunction*& dyn__EndChildFunc();
    // Get instance field reference: System.Boolean _AllowText
    bool& dyn__AllowText();
    // System.Void .ctor(System.Xml.Schema.SchemaNames/System.Xml.Schema.Token n, System.Int32[] states, System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrAttributeEntry[] attributes, System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrInitFunction init, System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrBeginChildFunction begin, System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrEndChildFunction end, System.Boolean fText)
    // Offset: 0x1C72280
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static XdrBuilder::XdrEntry* New_ctor(::System::Xml::Schema::SchemaNames::Token n, ::ArrayW<int> states, ::ArrayW<::System::Xml::Schema::XdrBuilder::XdrAttributeEntry*> attributes, ::System::Xml::Schema::XdrBuilder::XdrInitFunction* init, ::System::Xml::Schema::XdrBuilder::XdrBeginChildFunction* begin, ::System::Xml::Schema::XdrBuilder::XdrEndChildFunction* end, bool fText) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Xml::Schema::XdrBuilder::XdrEntry::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<XdrBuilder::XdrEntry*, creationType>(n, states, attributes, init, begin, end, fText)));
    }
  }; // System.Xml.Schema.XdrBuilder/System.Xml.Schema.XdrEntry
  #pragma pack(pop)
  static check_size<sizeof(XdrBuilder::XdrEntry), 64 + sizeof(bool)> __System_Xml_Schema_XdrBuilder_XdrEntrySizeCheck;
  static_assert(sizeof(XdrBuilder::XdrEntry) == 0x41);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Xml::Schema::XdrBuilder::XdrEntry::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
