// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.XmlSchemaParticle
#include "System/Xml/Schema/XmlSchemaParticle.hpp"
// Including type: System.Xml.Schema.XmlSchemaDerivationMethod
#include "System/Xml/Schema/XmlSchemaDerivationMethod.hpp"
// Including type: System.Xml.Schema.XmlSchemaForm
#include "System/Xml/Schema/XmlSchemaForm.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaType
  class XmlSchemaType;
  // Forward declaring type: XmlSchemaObjectCollection
  class XmlSchemaObjectCollection;
  // Forward declaring type: SchemaElementDecl
  class SchemaElementDecl;
  // Skipping declaration: XmlSchemaObject because it is already included!
  // Forward declaring type: XmlSchema
  class XmlSchema;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Schema::XmlSchemaElement);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::XmlSchemaElement*, "System.Xml.Schema", "XmlSchemaElement");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0xE8
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XmlSchemaElement
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlSchemaElement : public ::System::Xml::Schema::XmlSchemaParticle {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean isAbstract
    // Size: 0x1
    // Offset: 0x74
    bool isAbstract;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasAbstractAttribute
    // Size: 0x1
    // Offset: 0x75
    bool hasAbstractAttribute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isNillable
    // Size: 0x1
    // Offset: 0x76
    bool isNillable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasNillableAttribute
    // Size: 0x1
    // Offset: 0x77
    bool hasNillableAttribute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isLocalTypeDerivationChecked
    // Size: 0x1
    // Offset: 0x78
    bool isLocalTypeDerivationChecked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isLocalTypeDerivationChecked and: block
    char __padding4[0x3] = {};
    // private System.Xml.Schema.XmlSchemaDerivationMethod block
    // Size: 0x4
    // Offset: 0x7C
    ::System::Xml::Schema::XmlSchemaDerivationMethod block;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaDerivationMethod final
    // Size: 0x4
    // Offset: 0x80
    ::System::Xml::Schema::XmlSchemaDerivationMethod final;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaForm form
    // Size: 0x4
    // Offset: 0x84
    ::System::Xml::Schema::XmlSchemaForm form;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaForm) == 0x4);
    // private System.String defaultValue
    // Size: 0x8
    // Offset: 0x88
    ::StringW defaultValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String fixedValue
    // Size: 0x8
    // Offset: 0x90
    ::StringW fixedValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String name
    // Size: 0x8
    // Offset: 0x98
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlQualifiedName refName
    // Size: 0x8
    // Offset: 0xA0
    ::System::Xml::XmlQualifiedName* refName;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlQualifiedName*) == 0x8);
    // private System.Xml.XmlQualifiedName substitutionGroup
    // Size: 0x8
    // Offset: 0xA8
    ::System::Xml::XmlQualifiedName* substitutionGroup;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlQualifiedName*) == 0x8);
    // private System.Xml.XmlQualifiedName typeName
    // Size: 0x8
    // Offset: 0xB0
    ::System::Xml::XmlQualifiedName* typeName;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlQualifiedName*) == 0x8);
    // private System.Xml.Schema.XmlSchemaType type
    // Size: 0x8
    // Offset: 0xB8
    ::System::Xml::Schema::XmlSchemaType* type;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaType*) == 0x8);
    // private System.Xml.XmlQualifiedName qualifiedName
    // Size: 0x8
    // Offset: 0xC0
    ::System::Xml::XmlQualifiedName* qualifiedName;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlQualifiedName*) == 0x8);
    // private System.Xml.Schema.XmlSchemaType elementType
    // Size: 0x8
    // Offset: 0xC8
    ::System::Xml::Schema::XmlSchemaType* elementType;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaType*) == 0x8);
    // private System.Xml.Schema.XmlSchemaDerivationMethod blockResolved
    // Size: 0x4
    // Offset: 0xD0
    ::System::Xml::Schema::XmlSchemaDerivationMethod blockResolved;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaDerivationMethod finalResolved
    // Size: 0x4
    // Offset: 0xD4
    ::System::Xml::Schema::XmlSchemaDerivationMethod finalResolved;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaObjectCollection constraints
    // Size: 0x8
    // Offset: 0xD8
    ::System::Xml::Schema::XmlSchemaObjectCollection* constraints;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectCollection*) == 0x8);
    // private System.Xml.Schema.SchemaElementDecl elementDecl
    // Size: 0x8
    // Offset: 0xE0
    ::System::Xml::Schema::SchemaElementDecl* elementDecl;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::SchemaElementDecl*) == 0x8);
    public:
    // Get instance field reference: private System.Boolean isAbstract
    bool& dyn_isAbstract();
    // Get instance field reference: private System.Boolean hasAbstractAttribute
    bool& dyn_hasAbstractAttribute();
    // Get instance field reference: private System.Boolean isNillable
    bool& dyn_isNillable();
    // Get instance field reference: private System.Boolean hasNillableAttribute
    bool& dyn_hasNillableAttribute();
    // Get instance field reference: private System.Boolean isLocalTypeDerivationChecked
    bool& dyn_isLocalTypeDerivationChecked();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaDerivationMethod block
    ::System::Xml::Schema::XmlSchemaDerivationMethod& dyn_block();
