// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: NameTable
  class NameTable;
  // Forward declaring type: XmlNamespaceManager
  class XmlNamespaceManager;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchema
  class XmlSchema;
  // Forward declaring type: XmlSchemaSet
  class XmlSchemaSet;
  // Skipping declaration: InferenceOption because it is already included!
  // Forward declaring type: XmlSchemaAttribute
  class XmlSchemaAttribute;
  // Forward declaring type: XmlSchemaObjectCollection
  class XmlSchemaObjectCollection;
  // Forward declaring type: XmlSchemaObjectTable
  class XmlSchemaObjectTable;
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
  // Forward declaring type: XmlSchemaSimpleContentExtension
  class XmlSchemaSimpleContentExtension;
  // Forward declaring type: XmlSchemaComplexType
  class XmlSchemaComplexType;
  // Forward declaring type: XmlSchemaType
  class XmlSchemaType;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: ICollection
  class ICollection;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaInference
  class XmlSchemaInference;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Schema::XmlSchemaInference);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Schema::XmlSchemaInference*, "System.Xml.Schema", "XmlSchemaInference");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XmlSchemaInference
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlSchemaInference : public ::Il2CppObject {
    public:
    // Nested type: System::Xml::Schema::XmlSchemaInference::InferenceOption
    struct InferenceOption;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption
    // [TokenAttribute] Offset: FFFFFFFF
    struct InferenceOption/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InferenceOption
      constexpr InferenceOption(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption Restricted
      static constexpr const int Restricted = 0;
      // Get static field: static public System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption Restricted
      static System::Xml::Schema::XmlSchemaInference::InferenceOption _get_Restricted();
      // Set static field: static public System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption Restricted
      static void _set_Restricted(System::Xml::Schema::XmlSchemaInference::InferenceOption value);
      // static field const value: static public System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption Relaxed
      static constexpr const int Relaxed = 1;
      // Get static field: static public System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption Relaxed
      static System::Xml::Schema::XmlSchemaInference::InferenceOption _get_Relaxed();
      // Set static field: static public System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption Relaxed
      static void _set_Relaxed(System::Xml::Schema::XmlSchemaInference::InferenceOption value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption
    #pragma pack(pop)
    static check_size<sizeof(XmlSchemaInference::InferenceOption), 0 + sizeof(int)> __System_Xml_Schema_XmlSchemaInference_InferenceOptionSizeCheck;
    static_assert(sizeof(XmlSchemaInference::InferenceOption) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.Schema.XmlSchema rootSchema
    // Size: 0x8
    // Offset: 0x10
    System::Xml::Schema::XmlSchema* rootSchema;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchema*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSet schemaSet
    // Size: 0x8
    // Offset: 0x18
    System::Xml::Schema::XmlSchemaSet* schemaSet;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaSet*) == 0x8);
    // private System.Xml.XmlReader xtr
    // Size: 0x8
    // Offset: 0x20
    System::Xml::XmlReader* xtr;
    // Field size check
    static_assert(sizeof(System::Xml::XmlReader*) == 0x8);
    // private System.Xml.NameTable nametable
    // Size: 0x8
    // Offset: 0x28
    System::Xml::NameTable* nametable;
    // Field size check
    static_assert(sizeof(System::Xml::NameTable*) == 0x8);
    // private System.String TargetNamespace
    // Size: 0x8
    // Offset: 0x30
    ::StringW TargetNamespace;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlNamespaceManager NamespaceManager
    // Size: 0x8
    // Offset: 0x38
    System::Xml::XmlNamespaceManager* NamespaceManager;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNamespaceManager*) == 0x8);
    // private System.Collections.ArrayList schemaList
    // Size: 0x8
    // Offset: 0x40
    System::Collections::ArrayList* schemaList;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption occurrence
    // Size: 0x4
    // Offset: 0x48
    System::Xml::Schema::XmlSchemaInference::InferenceOption occurrence;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaInference::InferenceOption) == 0x4);
    // private System.Xml.Schema.XmlSchemaInference/System.Xml.Schema.InferenceOption typeInference
    // Size: 0x4
    // Offset: 0x4C
    System::Xml::Schema::XmlSchemaInference::InferenceOption typeInference;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaInference::InferenceOption) == 0x4);
    public:
    // Get static field: static System.Xml.XmlQualifiedName ST_boolean
    static System::Xml::XmlQualifiedName* _get_ST_boolean();
    // Set static field: static System.Xml.XmlQualifiedName ST_boolean
    static void _set_ST_boolean(System::Xml::XmlQualifiedName* value);
    // Get static field: static System.Xml.XmlQualifiedName ST_byte
    static System::Xml::XmlQualifiedName* _get_ST_byte();
    // Set static field: static System.Xml.XmlQualifiedName ST_byte
    static void _set_ST_byte(System::Xml::XmlQualifiedName* value);
    // Get static field: static System.Xml.XmlQualifiedName ST_unsignedByte
    static System::Xml::XmlQualifiedName* _get_ST_unsignedByte();
    // Set static field: static System.Xml.XmlQualifiedName ST_unsignedByte
