// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.XmlSchemaValidationFlags
#include "System/Xml/Schema/XmlSchemaValidationFlags.hpp"
// Including type: System.Xml.Schema.ValidatorState
#include "System/Xml/Schema/ValidatorState.hpp"
// Including type: System.Xml.Schema.XmlSchemaContentProcessing
#include "System/Xml/Schema/XmlSchemaContentProcessing.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaSet
  class XmlSchemaSet;
  // Forward declaring type: SchemaInfo
  class SchemaInfo;
  // Forward declaring type: ValidationState
  class ValidationState;
  // Forward declaring type: SchemaAttDef
  class SchemaAttDef;
  // Forward declaring type: IdRefNode
  class IdRefNode;
  // Forward declaring type: XmlSchemaObject
  class XmlSchemaObject;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: XmlSchemaDatatype
  class XmlSchemaDatatype;
  // Forward declaring type: XmlSchemaParticle
  class XmlSchemaParticle;
  // Forward declaring type: XmlSchemaAttribute
  class XmlSchemaAttribute;
  // Forward declaring type: XmlSchemaContentType
  struct XmlSchemaContentType;
  // Forward declaring type: XmlSchema
  class XmlSchema;
  // Forward declaring type: XmlSchemaInfo
  class XmlSchemaInfo;
  // Forward declaring type: XmlValueGetter
  class XmlValueGetter;
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
  // Forward declaring type: XmlSchemaSimpleType
  class XmlSchemaSimpleType;
  // Forward declaring type: SchemaDeclBase
  class SchemaDeclBase;
  // Forward declaring type: SchemaElementDecl
  class SchemaElementDecl;
  // Forward declaring type: XmlSeverityType
  struct XmlSeverityType;
  // Forward declaring type: XmlSchemaValidationException
  class XmlSchemaValidationException;
  // Forward declaring type: XmlSchemaException
  class XmlSchemaException;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: IDtdInfo
  class IDtdInfo;
  // Forward declaring type: HWStack
  class HWStack;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: IXmlLineInfo
  class IXmlLineInfo;
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: IXmlNamespaceResolver
  class IXmlNamespaceResolver;
  // Forward declaring type: XmlTokenizedType
  struct XmlTokenizedType;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaValidator
  class XmlSchemaValidator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Schema::XmlSchemaValidator);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Schema::XmlSchemaValidator*, "System.Xml.Schema", "XmlSchemaValidator");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x128
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XmlSchemaValidator
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlSchemaValidator : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.Schema.XmlSchemaSet schemaSet
    // Size: 0x8
    // Offset: 0x10
    System::Xml::Schema::XmlSchemaSet* schemaSet;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaSet*) == 0x8);
    // private System.Xml.Schema.XmlSchemaValidationFlags validationFlags
    // Size: 0x4
    // Offset: 0x18
    System::Xml::Schema::XmlSchemaValidationFlags validationFlags;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaValidationFlags) == 0x4);
    // private System.Int32 startIDConstraint
    // Size: 0x4
    // Offset: 0x1C
    int startIDConstraint;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean isRoot
    // Size: 0x1
    // Offset: 0x20
    bool isRoot;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean rootHasSchema
    // Size: 0x1
    // Offset: 0x21
    bool rootHasSchema;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean attrValid
    // Size: 0x1
    // Offset: 0x22
    bool attrValid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean checkEntity
    // Size: 0x1
    // Offset: 0x23
    bool checkEntity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: checkEntity and: compiledSchemaInfo
    char __padding6[0x4] = {};
    // private System.Xml.Schema.SchemaInfo compiledSchemaInfo
    // Size: 0x8
    // Offset: 0x28
    System::Xml::Schema::SchemaInfo* compiledSchemaInfo;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::SchemaInfo*) == 0x8);
    // private System.Xml.IDtdInfo dtdSchemaInfo
    // Size: 0x8
    // Offset: 0x30
    System::Xml::IDtdInfo* dtdSchemaInfo;
    // Field size check
    static_assert(sizeof(System::Xml::IDtdInfo*) == 0x8);
    // private System.Collections.Hashtable validatedNamespaces
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Hashtable* validatedNamespaces;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Xml.HWStack validationStack
    // Size: 0x8
    // Offset: 0x40
    System::Xml::HWStack* validationStack;
    // Field size check
    static_assert(sizeof(System::Xml::HWStack*) == 0x8);
    // private System.Xml.Schema.ValidationState context
    // Size: 0x8
    // Offset: 0x48
    System::Xml::Schema::ValidationState* context;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::ValidationState*) == 0x8);
    // private System.Xml.Schema.ValidatorState currentState
    // Size: 0x4
    // Offset: 0x50
    System::Xml::Schema::ValidatorState currentState;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::ValidatorState) == 0x4);
    // Padding between fields: currentState and: attPresence
    char __padding12[0x4] = {};
    // private System.Collections.Hashtable attPresence
    // Size: 0x8
    // Offset: 0x58
    System::Collections::Hashtable* attPresence;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Xml.Schema.SchemaAttDef wildID
    // Size: 0x8
    // Offset: 0x60
    System::Xml::Schema::SchemaAttDef* wildID;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::SchemaAttDef*) == 0x8);
    // private System.Collections.Hashtable IDs
    // Size: 0x8
    // Offset: 0x68
    System::Collections::Hashtable* IDs;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Xml.Schema.IdRefNode idRefListHead
    // Size: 0x8
    // Offset: 0x70
    System::Xml::Schema::IdRefNode* idRefListHead;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::IdRefNode*) == 0x8);
    // private System.Xml.XmlQualifiedName contextQName
    // Size: 0x8
    // Offset: 0x78
    System::Xml::XmlQualifiedName* contextQName;
    // Field size check
    static_assert(sizeof(System::Xml::XmlQualifiedName*) == 0x8);
    // private System.String NsXs
    // Size: 0x8
    // Offset: 0x80
    ::StringW NsXs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String NsXsi
    // Size: 0x8
    // Offset: 0x88
    ::StringW NsXsi;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String NsXmlNs
    // Size: 0x8
    // Offset: 0x90
    ::StringW NsXmlNs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String NsXml
    // Size: 0x8
    // Offset: 0x98
    ::StringW NsXml;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.Schema.XmlSchemaObject partialValidationType
    // Size: 0x8
    // Offset: 0xA0
    System::Xml::Schema::XmlSchemaObject* partialValidationType;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaObject*) == 0x8);
    // private System.Text.StringBuilder textValue
    // Size: 0x8
    // Offset: 0xA8
    System::Text::StringBuilder* textValue;
    // Field size check
    static_assert(sizeof(System::Text::StringBuilder*) == 0x8);
    // private System.Xml.Schema.ValidationEventHandler eventHandler
    // Size: 0x8
    // Offset: 0xB0
    System::Xml::Schema::ValidationEventHandler* eventHandler;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::ValidationEventHandler*) == 0x8);
    // private System.Object validationEventSender
    // Size: 0x8
    // Offset: 0xB8
    ::Il2CppObject* validationEventSender;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Xml.XmlNameTable nameTable
    // Size: 0x8
    // Offset: 0xC0
    System::Xml::XmlNameTable* nameTable;
    // Field size check
    static_assert(sizeof(System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.IXmlLineInfo positionInfo
    // Size: 0x8
    // Offset: 0xC8
    System::Xml::IXmlLineInfo* positionInfo;
    // Field size check
    static_assert(sizeof(System::Xml::IXmlLineInfo*) == 0x8);
    // private System.Xml.IXmlLineInfo dummyPositionInfo
    // Size: 0x8
    // Offset: 0xD0
    System::Xml::IXmlLineInfo* dummyPositionInfo;
    // Field size check
    static_assert(sizeof(System::Xml::IXmlLineInfo*) == 0x8);
    // private System.Xml.XmlResolver xmlResolver
    // Size: 0x8
    // Offset: 0xD8
    System::Xml::XmlResolver* xmlResolver;
    // Field size check
    static_assert(sizeof(System::Xml::XmlResolver*) == 0x8);
    // private System.Uri sourceUri
    // Size: 0x8
    // Offset: 0xE0
    System::Uri* sourceUri;
    // Field size check
    static_assert(sizeof(System::Uri*) == 0x8);
    // private System.String sourceUriString
    // Size: 0x8
    // Offset: 0xE8
    ::StringW sourceUriString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.IXmlNamespaceResolver nsResolver
    // Size: 0x8
    // Offset: 0xF0
    System::Xml::IXmlNamespaceResolver* nsResolver;
    // Field size check
    static_assert(sizeof(System::Xml::IXmlNamespaceResolver*) == 0x8);
    // private System.Xml.Schema.XmlSchemaContentProcessing processContents
    // Size: 0x4
    // Offset: 0xF8
    System::Xml::Schema::XmlSchemaContentProcessing processContents;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaContentProcessing) == 0x4);
    // Padding between fields: processContents and: xsiTypeString
    char __padding33[0x4] = {};
    // private System.String xsiTypeString
    // Size: 0x8
    // Offset: 0x100
    ::StringW xsiTypeString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String xsiNilString
    // Size: 0x8
    // Offset: 0x108
    ::StringW xsiNilString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String xsiSchemaLocationString
    // Size: 0x8
    // Offset: 0x110
    ::StringW xsiSchemaLocationString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String xsiNoNamespaceSchemaLocationString
    // Size: 0x8
    // Offset: 0x118
    ::StringW xsiNoNamespaceSchemaLocationString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0x120
    System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(System::Xml::XmlCharType) == 0x8);
    public:
    // Get static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtQName
    static System::Xml::Schema::XmlSchemaDatatype* _get_dtQName();
    // Set static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtQName
    static void _set_dtQName(System::Xml::Schema::XmlSchemaDatatype* value);
    // Get static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtCDATA
    static System::Xml::Schema::XmlSchemaDatatype* _get_dtCDATA();
    // Set static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtCDATA
    static void _set_dtCDATA(System::Xml::Schema::XmlSchemaDatatype* value);
    // Get static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtStringArray
    static System::Xml::Schema::XmlSchemaDatatype* _get_dtStringArray();
