// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.XmlSchemaAnnotated
#include "System/Xml/Schema/XmlSchemaAnnotated.hpp"
// Including type: System.Xml.Schema.XmlSchemaDerivationMethod
#include "System/Xml/Schema/XmlSchemaDerivationMethod.hpp"
// Including type: System.Xml.Schema.XmlSchemaContentType
#include "System/Xml/Schema/XmlSchemaContentType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaDatatype
  class XmlSchemaDatatype;
  // Forward declaring type: SchemaElementDecl
  class SchemaElementDecl;
  // Forward declaring type: XmlTypeCode
  struct XmlTypeCode;
  // Forward declaring type: XmlValueConverter
  class XmlValueConverter;
  // Forward declaring type: XmlSchemaSimpleType
  class XmlSchemaSimpleType;
  // Forward declaring type: XmlSchemaComplexType
  class XmlSchemaComplexType;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaType
  class XmlSchemaType;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Schema::XmlSchemaType);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Schema::XmlSchemaType*, "System.Xml.Schema", "XmlSchemaType");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x94
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XmlSchemaType
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlSchemaType : public System::Xml::Schema::XmlSchemaAnnotated {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.String name
    // Size: 0x8
    // Offset: 0x50
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.Schema.XmlSchemaDerivationMethod final
    // Size: 0x4
    // Offset: 0x58
    System::Xml::Schema::XmlSchemaDerivationMethod final;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaDerivationMethod derivedBy
    // Size: 0x4
    // Offset: 0x5C
    System::Xml::Schema::XmlSchemaDerivationMethod derivedBy;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaType baseSchemaType
    // Size: 0x8
    // Offset: 0x60
    System::Xml::Schema::XmlSchemaType* baseSchemaType;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaType*) == 0x8);
    // private System.Xml.Schema.XmlSchemaDatatype datatype
    // Size: 0x8
    // Offset: 0x68
    System::Xml::Schema::XmlSchemaDatatype* datatype;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaDatatype*) == 0x8);
    // private System.Xml.Schema.XmlSchemaDerivationMethod finalResolved
    // Size: 0x4
    // Offset: 0x70
    System::Xml::Schema::XmlSchemaDerivationMethod finalResolved;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // Padding between fields: finalResolved and: elementDecl
    char __padding5[0x4] = {};
    // private System.Xml.Schema.SchemaElementDecl elementDecl
    // Size: 0x8
    // Offset: 0x78
    System::Xml::Schema::SchemaElementDecl* elementDecl;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::SchemaElementDecl*) == 0x8);
    // private System.Xml.XmlQualifiedName qname
    // Size: 0x8
    // Offset: 0x80
    System::Xml::XmlQualifiedName* qname;
    // Field size check
    static_assert(sizeof(System::Xml::XmlQualifiedName*) == 0x8);
    // private System.Xml.Schema.XmlSchemaType redefined
    // Size: 0x8
    // Offset: 0x88
    System::Xml::Schema::XmlSchemaType* redefined;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaType*) == 0x8);
    // private System.Xml.Schema.XmlSchemaContentType contentType
    // Size: 0x4
    // Offset: 0x90
    System::Xml::Schema::XmlSchemaContentType contentType;
    // Field size check
    static_assert(sizeof(System::Xml::Schema::XmlSchemaContentType) == 0x4);
    public:
    // Get instance field reference: private System.String name
    ::StringW& dyn_name();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaDerivationMethod final
    System::Xml::Schema::XmlSchemaDerivationMethod& dyn_final();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaDerivationMethod derivedBy
    System::Xml::Schema::XmlSchemaDerivationMethod& dyn_derivedBy();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaType baseSchemaType
    System::Xml::Schema::XmlSchemaType*& dyn_baseSchemaType();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaDatatype datatype
    System::Xml::Schema::XmlSchemaDatatype*& dyn_datatype();
