// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.XmlSchemaObject
#include "System/Xml/Schema/XmlSchemaObject.hpp"
// Including type: System.Xml.Schema.XmlSchemaForm
#include "System/Xml/Schema/XmlSchemaForm.hpp"
// Including type: System.Xml.Schema.XmlSchemaDerivationMethod
#include "System/Xml/Schema/XmlSchemaDerivationMethod.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaObjectCollection
  class XmlSchemaObjectCollection;
  // Forward declaring type: XmlSchemaObjectTable
  class XmlSchemaObjectTable;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: XmlSchemaCollection
  class XmlSchemaCollection;
  // Forward declaring type: SchemaInfo
  class SchemaInfo;
  // Forward declaring type: XmlSchemaCompilationSettings
  class XmlSchemaCompilationSettings;
  // Forward declaring type: XmlSchemaAnnotation
  class XmlSchemaAnnotation;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlAttribute
  class XmlAttribute;
  // Forward declaring type: XmlDocument
  class XmlDocument;
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: IList
  class IList;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchema
  class XmlSchema;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Schema::XmlSchema);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::XmlSchema*, "System.Xml.Schema", "XmlSchema");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0xF0
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XmlSchema
  // [TokenAttribute] Offset: FFFFFFFF
  // [XmlRootAttribute] Offset: 11946B8
  class XmlSchema : public ::System::Xml::Schema::XmlSchemaObject {
    public:
    // Writing base type padding for base size: 0x31 to desired offset: 0x34
    char ___base_padding[0x3] = {};
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.Schema.XmlSchemaForm attributeFormDefault
    // Size: 0x4
    // Offset: 0x34
    ::System::Xml::Schema::XmlSchemaForm attributeFormDefault;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaForm) == 0x4);
    // private System.Xml.Schema.XmlSchemaForm elementFormDefault
    // Size: 0x4
    // Offset: 0x38
    ::System::Xml::Schema::XmlSchemaForm elementFormDefault;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaForm) == 0x4);
    // private System.Xml.Schema.XmlSchemaDerivationMethod blockDefault
    // Size: 0x4
    // Offset: 0x3C
    ::System::Xml::Schema::XmlSchemaDerivationMethod blockDefault;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaDerivationMethod finalDefault
    // Size: 0x4
    // Offset: 0x40
    ::System::Xml::Schema::XmlSchemaDerivationMethod finalDefault;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // Padding between fields: finalDefault and: targetNs
    char __padding3[0x4] = {};
    // private System.String targetNs
    // Size: 0x8
    // Offset: 0x48
    ::StringW targetNs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String version
    // Size: 0x8
    // Offset: 0x50
    ::StringW version;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectCollection includes
    // Size: 0x8
    // Offset: 0x58
    ::System::Xml::Schema::XmlSchemaObjectCollection* includes;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectCollection*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectCollection items
    // Size: 0x8
    // Offset: 0x60
    ::System::Xml::Schema::XmlSchemaObjectCollection* items;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectCollection*) == 0x8);
    // private System.String id
    // Size: 0x8
    // Offset: 0x68
    ::StringW id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlAttribute[] moreAttributes
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::System::Xml::XmlAttribute*> moreAttributes;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlAttribute*>) == 0x8);
    // private System.Boolean isCompiled
    // Size: 0x1
    // Offset: 0x78
    bool isCompiled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isCompiledBySet
    // Size: 0x1
    // Offset: 0x79
    bool isCompiledBySet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isPreprocessed
    // Size: 0x1
    // Offset: 0x7A
    bool isPreprocessed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isRedefined
    // Size: 0x1
    // Offset: 0x7B
    bool isRedefined;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 errorCount
    // Size: 0x4
    // Offset: 0x7C
    int errorCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.Schema.XmlSchemaObjectTable attributes
    // Size: 0x8
    // Offset: 0x80
    ::System::Xml::Schema::XmlSchemaObjectTable* attributes;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable attributeGroups
    // Size: 0x8
    // Offset: 0x88
    ::System::Xml::Schema::XmlSchemaObjectTable* attributeGroups;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable elements
    // Size: 0x8
    // Offset: 0x90
    ::System::Xml::Schema::XmlSchemaObjectTable* elements;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable types
    // Size: 0x8
    // Offset: 0x98
    ::System::Xml::Schema::XmlSchemaObjectTable* types;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable groups
    // Size: 0x8
    // Offset: 0xA0
    ::System::Xml::Schema::XmlSchemaObjectTable* groups;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable notations
    // Size: 0x8
    // Offset: 0xA8
    ::System::Xml::Schema::XmlSchemaObjectTable* notations;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable identityConstraints
    // Size: 0x8
    // Offset: 0xB0
    ::System::Xml::Schema::XmlSchemaObjectTable* identityConstraints;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Collections.ArrayList importedSchemas
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::ArrayList* importedSchemas;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // private System.Collections.ArrayList importedNamespaces
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::ArrayList* importedNamespaces;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // private System.Int32 schemaId
    // Size: 0x4
    // Offset: 0xC8
    int schemaId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: schemaId and: baseUri
    char __padding24[0x4] = {};
    // private System.Uri baseUri
    // Size: 0x8
    // Offset: 0xD0
    ::System::Uri* baseUri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Boolean isChameleon
    // Size: 0x1
    // Offset: 0xD8
    bool isChameleon;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isChameleon and: ids
    char __padding26[0x7] = {};
    // private System.Collections.Hashtable ids
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Hashtable* ids;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Xml.XmlDocument document
    // Size: 0x8
    // Offset: 0xE8
    ::System::Xml::XmlDocument* document;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlDocument*) == 0x8);
    public:
    // Get static field: static private System.Int32 globalIdCounter
    static int _get_globalIdCounter();
    // Set static field: static private System.Int32 globalIdCounter
    static void _set_globalIdCounter(int value);
    // Get instance field reference: private System.Xml.Schema.XmlSchemaForm attributeFormDefault
    ::System::Xml::Schema::XmlSchemaForm& dyn_attributeFormDefault();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaForm elementFormDefault
    ::System::Xml::Schema::XmlSchemaForm& dyn_elementFormDefault();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaDerivationMethod blockDefault
    ::System::Xml::Schema::XmlSchemaDerivationMethod& dyn_blockDefault();
    // Get instance field reference: private System.Xml.Schema.XmlSchemaDerivationMethod finalDefault
