// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.XmlSchemaType
#include "System/Xml/Schema/XmlSchemaType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaContentModel
  class XmlSchemaContentModel;
  // Forward declaring type: XmlSchemaParticle
  class XmlSchemaParticle;
  // Forward declaring type: XmlSchemaObjectCollection
  class XmlSchemaObjectCollection;
  // Forward declaring type: XmlSchemaAnyAttribute
  class XmlSchemaAnyAttribute;
  // Forward declaring type: XmlSchemaObjectTable
  class XmlSchemaObjectTable;
  // Forward declaring type: ContentValidator
  class ContentValidator;
  // Skipping declaration: XmlSchemaContentType because it is already included!
  // Forward declaring type: XmlSchemaContentProcessing
  struct XmlSchemaContentProcessing;
  // Skipping declaration: XmlSchemaObject because it is already included!
  // Forward declaring type: XmlSchema
  class XmlSchema;
  // Forward declaring type: XmlSchemaForm
  struct XmlSchemaForm;
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaComplexType
  class XmlSchemaComplexType;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Schema::XmlSchemaComplexType);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::XmlSchemaComplexType*, "System.Xml.Schema", "XmlSchemaComplexType");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0xE1
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XmlSchemaComplexType
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlSchemaComplexType : public ::System::Xml::Schema::XmlSchemaType {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.Schema.XmlSchemaDerivationMethod block
    // Size: 0x4
    // Offset: 0x94
    ::System::Xml::Schema::XmlSchemaDerivationMethod block;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // private System.Xml.Schema.XmlSchemaContentModel contentModel
    // Size: 0x8
    // Offset: 0x98
    ::System::Xml::Schema::XmlSchemaContentModel* contentModel;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaContentModel*) == 0x8);
    // private System.Xml.Schema.XmlSchemaParticle particle
    // Size: 0x8
    // Offset: 0xA0
    ::System::Xml::Schema::XmlSchemaParticle* particle;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaParticle*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectCollection attributes
    // Size: 0x8
    // Offset: 0xA8
    ::System::Xml::Schema::XmlSchemaObjectCollection* attributes;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectCollection*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAnyAttribute anyAttribute
    // Size: 0x8
    // Offset: 0xB0
    ::System::Xml::Schema::XmlSchemaAnyAttribute* anyAttribute;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAnyAttribute*) == 0x8);
    // private System.Xml.Schema.XmlSchemaParticle contentTypeParticle
    // Size: 0x8
    // Offset: 0xB8
    ::System::Xml::Schema::XmlSchemaParticle* contentTypeParticle;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaParticle*) == 0x8);
    // private System.Xml.Schema.XmlSchemaDerivationMethod blockResolved
    // Size: 0x4
    // Offset: 0xC0
    ::System::Xml::Schema::XmlSchemaDerivationMethod blockResolved;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDerivationMethod) == 0x4);
    // Padding between fields: blockResolved and: localElements
    char __padding6[0x4] = {};
    // private System.Xml.Schema.XmlSchemaObjectTable localElements
    // Size: 0x8
    // Offset: 0xC8
    ::System::Xml::Schema::XmlSchemaObjectTable* localElements;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable attributeUses
    // Size: 0x8
    // Offset: 0xD0
    ::System::Xml::Schema::XmlSchemaObjectTable* attributeUses;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAnyAttribute attributeWildcard
    // Size: 0x8
    // Offset: 0xD8
    ::System::Xml::Schema::XmlSchemaAnyAttribute* attributeWildcard;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAnyAttribute*) == 0x8);
    // private System.Byte pvFlags
    // Size: 0x1
    // Offset: 0xE0
    uint8_t pvFlags;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    public:
    // Get static field: static private System.Xml.Schema.XmlSchemaComplexType anyTypeLax
    static ::System::Xml::Schema::XmlSchemaComplexType* _get_anyTypeLax();
    // Set static field: static private System.Xml.Schema.XmlSchemaComplexType anyTypeLax
    static void _set_anyTypeLax(::System::Xml::Schema::XmlSchemaComplexType* value);
    // Get static field: static private System.Xml.Schema.XmlSchemaComplexType anyTypeSkip
    static ::System::Xml::Schema::XmlSchemaComplexType* _get_anyTypeSkip();
    // Set static field: static private System.Xml.Schema.XmlSchemaComplexType anyTypeSkip
    static void _set_anyTypeSkip(::System::Xml::Schema::XmlSchemaComplexType* value);
    // Get static field: static private System.Xml.Schema.XmlSchemaComplexType untypedAnyType
    static ::System::Xml::Schema::XmlSchemaComplexType* _get_untypedAnyType();
