// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.SchemaBuilder
#include "System/Xml/Schema/SchemaBuilder.hpp"
// Including type: System.Xml.Schema.SchemaNames
#include "System/Xml/Schema/SchemaNames.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Skipping declaration: State because it is already included!
  // Forward declaring type: XmlSchema
  class XmlSchema;
  // Forward declaring type: XmlSchemaObject
  class XmlSchemaObject;
  // Forward declaring type: XmlSchemaElement
  class XmlSchemaElement;
  // Forward declaring type: XmlSchemaAny
  class XmlSchemaAny;
  // Forward declaring type: XmlSchemaAttribute
  class XmlSchemaAttribute;
  // Forward declaring type: XmlSchemaAnyAttribute
  class XmlSchemaAnyAttribute;

  // Forward declaring type: XmlSchemaSimpleTypeRestriction
  class XmlSchemaSimpleTypeRestriction;
  // Forward declaring type: XmlSchemaGroup
  class XmlSchemaGroup;
  // Forward declaring type: XmlSchemaGroupRef
  class XmlSchemaGroupRef;
  // Forward declaring type: XmlSchemaAll
  class XmlSchemaAll;
  // Forward declaring type: XmlSchemaChoice
  class XmlSchemaChoice;
  // Forward declaring type: XmlSchemaSequence
  class XmlSchemaSequence;
  // Forward declaring type: XmlSchemaParticle
  class XmlSchemaParticle;
  // Forward declaring type: XmlSchemaAttributeGroup
  class XmlSchemaAttributeGroup;
  // Forward declaring type: XmlSchemaAttributeGroupRef
  class XmlSchemaAttributeGroupRef;
  // Forward declaring type: XmlSchemaNotation
  class XmlSchemaNotation;
  // Forward declaring type: XmlSchemaIdentityConstraint
  class XmlSchemaIdentityConstraint;
  // Forward declaring type: XmlSchemaXPath
  class XmlSchemaXPath;
  // Forward declaring type: XmlSchemaInclude
  class XmlSchemaInclude;
  // Forward declaring type: XmlSchemaImport
  class XmlSchemaImport;
  // Forward declaring type: XmlSchemaAnnotation
  class XmlSchemaAnnotation;
  // Forward declaring type: XmlSchemaAppInfo
  class XmlSchemaAppInfo;
  // Forward declaring type: XmlSchemaDocumentation
  class XmlSchemaDocumentation;
  // Forward declaring type: XmlSchemaFacet
  class XmlSchemaFacet;
  // Forward declaring type: XmlSchemaRedefine
  class XmlSchemaRedefine;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: XmlSeverityType
  struct XmlSeverityType;
  // Forward declaring type: XmlSchemaException
  class XmlSchemaException;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: PositionInfo
  class PositionInfo;
  // Forward declaring type: HWStack
  class HWStack;
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XmlNamespaceManager
  class XmlNamespaceManager;
  // Forward declaring type: XmlNode
  class XmlNode;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Stack
  class Stack;
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XsdBuilder
  class XsdBuilder;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Schema::XsdBuilder);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::XsdBuilder*, "System.Xml.Schema", "XsdBuilder");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x1A0
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XsdBuilder
  // [TokenAttribute] Offset: FFFFFFFF
  class XsdBuilder : public ::System::Xml::Schema::SchemaBuilder {
    public:
    // Nested type: ::System::Xml::Schema::XsdBuilder::State
    struct State;
    // Nested type: ::System::Xml::Schema::XsdBuilder::XsdBuildFunction
    class XsdBuildFunction;
    // Nested type: ::System::Xml::Schema::XsdBuilder::XsdInitFunction
    class XsdInitFunction;
    // Nested type: ::System::Xml::Schema::XsdBuilder::XsdEndChildFunction
    class XsdEndChildFunction;
    // Nested type: ::System::Xml::Schema::XsdBuilder::XsdAttributeEntry
    class XsdAttributeEntry;
    // Nested type: ::System::Xml::Schema::XsdBuilder::XsdEntry
    class XsdEntry;
    // Nested type: ::System::Xml::Schema::XsdBuilder::BuilderNamespaceManager
    class BuilderNamespaceManager;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.Schema.XsdBuilder/System.Xml.Schema.State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Root
      static constexpr const int Root = 0;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Root
      static ::System::Xml::Schema::XsdBuilder::State _get_Root();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Root
      static void _set_Root(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Schema
      static constexpr const int Schema = 1;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Schema
      static ::System::Xml::Schema::XsdBuilder::State _get_Schema();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Schema
      static void _set_Schema(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Annotation
      static constexpr const int Annotation = 2;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Annotation
      static ::System::Xml::Schema::XsdBuilder::State _get_Annotation();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Annotation
      static void _set_Annotation(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Include
      static constexpr const int Include = 3;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Include
      static ::System::Xml::Schema::XsdBuilder::State _get_Include();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Include
      static void _set_Include(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Import
      static constexpr const int Import = 4;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Import
      static ::System::Xml::Schema::XsdBuilder::State _get_Import();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Import
      static void _set_Import(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Element
      static constexpr const int Element = 5;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Element
      static ::System::Xml::Schema::XsdBuilder::State _get_Element();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Element
      static void _set_Element(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Attribute
      static constexpr const int Attribute = 6;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Attribute
      static ::System::Xml::Schema::XsdBuilder::State _get_Attribute();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Attribute
      static void _set_Attribute(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AttributeGroup
      static constexpr const int AttributeGroup = 7;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AttributeGroup
      static ::System::Xml::Schema::XsdBuilder::State _get_AttributeGroup();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AttributeGroup
      static void _set_AttributeGroup(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AttributeGroupRef
      static constexpr const int AttributeGroupRef = 8;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AttributeGroupRef
      static ::System::Xml::Schema::XsdBuilder::State _get_AttributeGroupRef();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AttributeGroupRef
      static void _set_AttributeGroupRef(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AnyAttribute
      static constexpr const int AnyAttribute = 9;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AnyAttribute
      static ::System::Xml::Schema::XsdBuilder::State _get_AnyAttribute();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AnyAttribute
      static void _set_AnyAttribute(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Group
      static constexpr const int Group = 10;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Group
      static ::System::Xml::Schema::XsdBuilder::State _get_Group();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Group
      static void _set_Group(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State GroupRef
      static constexpr const int GroupRef = 11;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State GroupRef
      static ::System::Xml::Schema::XsdBuilder::State _get_GroupRef();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State GroupRef
      static void _set_GroupRef(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State All
      static constexpr const int All = 12;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State All
      static ::System::Xml::Schema::XsdBuilder::State _get_All();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State All
      static void _set_All(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Choice
      static constexpr const int Choice = 13;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Choice
      static ::System::Xml::Schema::XsdBuilder::State _get_Choice();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Choice
      static void _set_Choice(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Sequence
      static constexpr const int Sequence = 14;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Sequence
      static ::System::Xml::Schema::XsdBuilder::State _get_Sequence();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Sequence
      static void _set_Sequence(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Any
      static constexpr const int Any = 15;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Any
      static ::System::Xml::Schema::XsdBuilder::State _get_Any();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Any
      static void _set_Any(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Notation
      static constexpr const int Notation = 16;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Notation
      static ::System::Xml::Schema::XsdBuilder::State _get_Notation();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Notation
      static void _set_Notation(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleType
      static constexpr const int SimpleType = 17;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleType
      static ::System::Xml::Schema::XsdBuilder::State _get_SimpleType();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleType
      static void _set_SimpleType(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexType
      static constexpr const int ComplexType = 18;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexType
      static ::System::Xml::Schema::XsdBuilder::State _get_ComplexType();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexType
      static void _set_ComplexType(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexContent
      static constexpr const int ComplexContent = 19;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexContent
      static ::System::Xml::Schema::XsdBuilder::State _get_ComplexContent();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexContent
      static void _set_ComplexContent(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexContentRestriction
      static constexpr const int ComplexContentRestriction = 20;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexContentRestriction
      static ::System::Xml::Schema::XsdBuilder::State _get_ComplexContentRestriction();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexContentRestriction
      static void _set_ComplexContentRestriction(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexContentExtension
      static constexpr const int ComplexContentExtension = 21;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexContentExtension
      static ::System::Xml::Schema::XsdBuilder::State _get_ComplexContentExtension();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State ComplexContentExtension
      static void _set_ComplexContentExtension(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleContent
      static constexpr const int SimpleContent = 22;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleContent
      static ::System::Xml::Schema::XsdBuilder::State _get_SimpleContent();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleContent
      static void _set_SimpleContent(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleContentExtension
      static constexpr const int SimpleContentExtension = 23;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleContentExtension
      static ::System::Xml::Schema::XsdBuilder::State _get_SimpleContentExtension();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleContentExtension
      static void _set_SimpleContentExtension(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleContentRestriction
      static constexpr const int SimpleContentRestriction = 24;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleContentRestriction
      static ::System::Xml::Schema::XsdBuilder::State _get_SimpleContentRestriction();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleContentRestriction
      static void _set_SimpleContentRestriction(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleTypeUnion
      static constexpr const int SimpleTypeUnion = 25;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleTypeUnion
      static ::System::Xml::Schema::XsdBuilder::State _get_SimpleTypeUnion();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleTypeUnion
      static void _set_SimpleTypeUnion(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleTypeList
      static constexpr const int SimpleTypeList = 26;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleTypeList
      static ::System::Xml::Schema::XsdBuilder::State _get_SimpleTypeList();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleTypeList
      static void _set_SimpleTypeList(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleTypeRestriction
      static constexpr const int SimpleTypeRestriction = 27;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleTypeRestriction
      static ::System::Xml::Schema::XsdBuilder::State _get_SimpleTypeRestriction();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State SimpleTypeRestriction
      static void _set_SimpleTypeRestriction(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Unique
      static constexpr const int Unique = 28;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Unique
      static ::System::Xml::Schema::XsdBuilder::State _get_Unique();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Unique
      static void _set_Unique(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Key
      static constexpr const int Key = 29;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Key
      static ::System::Xml::Schema::XsdBuilder::State _get_Key();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Key
      static void _set_Key(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State KeyRef
      static constexpr const int KeyRef = 30;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State KeyRef
      static ::System::Xml::Schema::XsdBuilder::State _get_KeyRef();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State KeyRef
      static void _set_KeyRef(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Selector
      static constexpr const int Selector = 31;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Selector
      static ::System::Xml::Schema::XsdBuilder::State _get_Selector();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Selector
      static void _set_Selector(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Field
      static constexpr const int Field = 32;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Field
      static ::System::Xml::Schema::XsdBuilder::State _get_Field();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Field
      static void _set_Field(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MinExclusive
      static constexpr const int MinExclusive = 33;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MinExclusive
      static ::System::Xml::Schema::XsdBuilder::State _get_MinExclusive();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MinExclusive
      static void _set_MinExclusive(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MinInclusive
      static constexpr const int MinInclusive = 34;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MinInclusive
      static ::System::Xml::Schema::XsdBuilder::State _get_MinInclusive();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MinInclusive
      static void _set_MinInclusive(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MaxExclusive
      static constexpr const int MaxExclusive = 35;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MaxExclusive
      static ::System::Xml::Schema::XsdBuilder::State _get_MaxExclusive();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MaxExclusive
      static void _set_MaxExclusive(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MaxInclusive
      static constexpr const int MaxInclusive = 36;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MaxInclusive
      static ::System::Xml::Schema::XsdBuilder::State _get_MaxInclusive();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MaxInclusive
      static void _set_MaxInclusive(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State TotalDigits
      static constexpr const int TotalDigits = 37;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State TotalDigits
      static ::System::Xml::Schema::XsdBuilder::State _get_TotalDigits();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State TotalDigits
      static void _set_TotalDigits(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State FractionDigits
      static constexpr const int FractionDigits = 38;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State FractionDigits
      static ::System::Xml::Schema::XsdBuilder::State _get_FractionDigits();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State FractionDigits
      static void _set_FractionDigits(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Length
      static constexpr const int Length = 39;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Length
      static ::System::Xml::Schema::XsdBuilder::State _get_Length();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Length
      static void _set_Length(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MinLength
      static constexpr const int MinLength = 40;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MinLength
      static ::System::Xml::Schema::XsdBuilder::State _get_MinLength();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MinLength
      static void _set_MinLength(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MaxLength
      static constexpr const int MaxLength = 41;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MaxLength
      static ::System::Xml::Schema::XsdBuilder::State _get_MaxLength();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State MaxLength
      static void _set_MaxLength(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Enumeration
      static constexpr const int Enumeration = 42;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Enumeration
      static ::System::Xml::Schema::XsdBuilder::State _get_Enumeration();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Enumeration
      static void _set_Enumeration(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Pattern
      static constexpr const int Pattern = 43;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Pattern
      static ::System::Xml::Schema::XsdBuilder::State _get_Pattern();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Pattern
      static void _set_Pattern(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State WhiteSpace
      static constexpr const int WhiteSpace = 44;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State WhiteSpace
      static ::System::Xml::Schema::XsdBuilder::State _get_WhiteSpace();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State WhiteSpace
      static void _set_WhiteSpace(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AppInfo
      static constexpr const int AppInfo = 45;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AppInfo
      static ::System::Xml::Schema::XsdBuilder::State _get_AppInfo();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State AppInfo
      static void _set_AppInfo(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Documentation
      static constexpr const int Documentation = 46;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Documentation
      static ::System::Xml::Schema::XsdBuilder::State _get_Documentation();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Documentation
      static void _set_Documentation(::System::Xml::Schema::XsdBuilder::State value);
      // static field const value: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Redefine
      static constexpr const int Redefine = 47;
      // Get static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Redefine
      static ::System::Xml::Schema::XsdBuilder::State _get_Redefine();
      // Set static field: static public System.Xml.Schema.XsdBuilder/System.Xml.Schema.State Redefine
      static void _set_Redefine(::System::Xml::Schema::XsdBuilder::State value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Xml.Schema.XsdBuilder/System.Xml.Schema.State
    #pragma pack(pop)
    static check_size<sizeof(XsdBuilder::State), 0 + sizeof(int)> __System_Xml_Schema_XsdBuilder_StateSizeCheck;
    static_assert(sizeof(XsdBuilder::State) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.XmlReader reader
    // Size: 0x8
    // Offset: 0x10
    ::System::Xml::XmlReader* reader;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlReader*) == 0x8);
    // private System.Xml.PositionInfo positionInfo
    // Size: 0x8
    // Offset: 0x18
    ::System::Xml::PositionInfo* positionInfo;
    // Field size check
    static_assert(sizeof(::System::Xml::PositionInfo*) == 0x8);
    // private System.Xml.Schema.XsdBuilder/System.Xml.Schema.XsdEntry currentEntry
    // Size: 0x8
    // Offset: 0x20
    ::System::Xml::Schema::XsdBuilder::XsdEntry* currentEntry;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XsdBuilder::XsdEntry*) == 0x8);
    // private System.Xml.Schema.XsdBuilder/System.Xml.Schema.XsdEntry nextEntry
    // Size: 0x8
    // Offset: 0x28
    ::System::Xml::Schema::XsdBuilder::XsdEntry* nextEntry;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XsdBuilder::XsdEntry*) == 0x8);
    // private System.Boolean hasChild
    // Size: 0x1
    // Offset: 0x30
    bool hasChild;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasChild and: stateHistory
    char __padding4[0x7] = {};
    // private System.Xml.HWStack stateHistory
    // Size: 0x8
    // Offset: 0x38
    ::System::Xml::HWStack* stateHistory;
    // Field size check
    static_assert(sizeof(::System::Xml::HWStack*) == 0x8);
    // private System.Collections.Stack containerStack
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Stack* containerStack;
    // Field size check
    static_assert(sizeof(::System::Collections::Stack*) == 0x8);
    // private System.Xml.XmlNameTable nameTable
    // Size: 0x8
    // Offset: 0x48
    ::System::Xml::XmlNameTable* nameTable;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.Schema.SchemaNames schemaNames
    // Size: 0x8
    // Offset: 0x50
    ::System::Xml::Schema::SchemaNames* schemaNames;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::SchemaNames*) == 0x8);
    // private System.Xml.XmlNamespaceManager namespaceManager
    // Size: 0x8
    // Offset: 0x58
    ::System::Xml::XmlNamespaceManager* namespaceManager;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNamespaceManager*) == 0x8);
    // private System.Boolean canIncludeImport
    // Size: 0x1
    // Offset: 0x60
    bool canIncludeImport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canIncludeImport and: schema
    char __padding10[0x7] = {};
    // private System.Xml.Schema.XmlSchema schema
    // Size: 0x8
    // Offset: 0x68
    ::System::Xml::Schema::XmlSchema* schema;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchema*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObject xso
    // Size: 0x8
    // Offset: 0x70
    ::System::Xml::Schema::XmlSchemaObject* xso;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObject*) == 0x8);
    // private System.Xml.Schema.XmlSchemaElement element
    // Size: 0x8
    // Offset: 0x78
    ::System::Xml::Schema::XmlSchemaElement* element;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaElement*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAny anyElement
    // Size: 0x8
    // Offset: 0x80
    ::System::Xml::Schema::XmlSchemaAny* anyElement;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAny*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAttribute attribute
    // Size: 0x8
    // Offset: 0x88
    ::System::Xml::Schema::XmlSchemaAttribute* attribute;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAttribute*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAnyAttribute anyAttribute
    // Size: 0x8
    // Offset: 0x90
    ::System::Xml::Schema::XmlSchemaAnyAttribute* anyAttribute;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAnyAttribute*) == 0x8);
    // private System.Xml.Schema.XmlSchemaComplexType complexType
    // Size: 0x8
    // Offset: 0x98
    ::System::Xml::Schema::XmlSchemaComplexType* complexType;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaComplexType*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSimpleType simpleType
    // Size: 0x8
    // Offset: 0xA0
    ::System::Xml::Schema::XmlSchemaSimpleType* simpleType;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaSimpleType*) == 0x8);
    // private System.Xml.Schema.XmlSchemaComplexContent complexContent
    // Size: 0x8
    // Offset: 0xA8
    ::System::Xml::Schema::XmlSchemaComplexContent* complexContent;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaComplexContent*) == 0x8);
    // private System.Xml.Schema.XmlSchemaComplexContentExtension complexContentExtension
    // Size: 0x8
    // Offset: 0xB0
    ::System::Xml::Schema::XmlSchemaComplexContentExtension* complexContentExtension;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaComplexContentExtension*) == 0x8);
    // private System.Xml.Schema.XmlSchemaComplexContentRestriction complexContentRestriction
    // Size: 0x8
    // Offset: 0xB8
    ::System::Xml::Schema::XmlSchemaComplexContentRestriction* complexContentRestriction;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaComplexContentRestriction*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSimpleContent simpleContent
    // Size: 0x8
    // Offset: 0xC0
    ::System::Xml::Schema::XmlSchemaSimpleContent* simpleContent;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaSimpleContent*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSimpleContentExtension simpleContentExtension
    // Size: 0x8
    // Offset: 0xC8
    ::System::Xml::Schema::XmlSchemaSimpleContentExtension* simpleContentExtension;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaSimpleContentExtension*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSimpleContentRestriction simpleContentRestriction
    // Size: 0x8
    // Offset: 0xD0
    ::System::Xml::Schema::XmlSchemaSimpleContentRestriction* simpleContentRestriction;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaSimpleContentRestriction*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSimpleTypeUnion simpleTypeUnion
    // Size: 0x8
    // Offset: 0xD8
    ::System::Xml::Schema::XmlSchemaSimpleTypeUnion* simpleTypeUnion;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaSimpleTypeUnion*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSimpleTypeList simpleTypeList
    // Size: 0x8
    // Offset: 0xE0
    ::System::Xml::Schema::XmlSchemaSimpleTypeList* simpleTypeList;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaSimpleTypeList*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSimpleTypeRestriction simpleTypeRestriction
    // Size: 0x8
    // Offset: 0xE8
    ::System::Xml::Schema::XmlSchemaSimpleTypeRestriction* simpleTypeRestriction;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaSimpleTypeRestriction*) == 0x8);
    // private System.Xml.Schema.XmlSchemaGroup group
    // Size: 0x8
    // Offset: 0xF0
    ::System::Xml::Schema::XmlSchemaGroup* group;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaGroup*) == 0x8);
    // private System.Xml.Schema.XmlSchemaGroupRef groupRef
    // Size: 0x8
    // Offset: 0xF8
    ::System::Xml::Schema::XmlSchemaGroupRef* groupRef;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaGroupRef*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAll all
    // Size: 0x8
    // Offset: 0x100
    ::System::Xml::Schema::XmlSchemaAll* all;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAll*) == 0x8);
    // private System.Xml.Schema.XmlSchemaChoice choice
    // Size: 0x8
    // Offset: 0x108
    ::System::Xml::Schema::XmlSchemaChoice* choice;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaChoice*) == 0x8);
    // private System.Xml.Schema.XmlSchemaSequence sequence
    // Size: 0x8
    // Offset: 0x110
    ::System::Xml::Schema::XmlSchemaSequence* sequence;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaSequence*) == 0x8);
    // private System.Xml.Schema.XmlSchemaParticle particle
    // Size: 0x8
    // Offset: 0x118
    ::System::Xml::Schema::XmlSchemaParticle* particle;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaParticle*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAttributeGroup attributeGroup
    // Size: 0x8
    // Offset: 0x120
    ::System::Xml::Schema::XmlSchemaAttributeGroup* attributeGroup;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAttributeGroup*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAttributeGroupRef attributeGroupRef
    // Size: 0x8
    // Offset: 0x128
    ::System::Xml::Schema::XmlSchemaAttributeGroupRef* attributeGroupRef;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAttributeGroupRef*) == 0x8);
    // private System.Xml.Schema.XmlSchemaNotation notation
    // Size: 0x8
    // Offset: 0x130
    ::System::Xml::Schema::XmlSchemaNotation* notation;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaNotation*) == 0x8);
    // private System.Xml.Schema.XmlSchemaIdentityConstraint identityConstraint
    // Size: 0x8
    // Offset: 0x138
    ::System::Xml::Schema::XmlSchemaIdentityConstraint* identityConstraint;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaIdentityConstraint*) == 0x8);
    // private System.Xml.Schema.XmlSchemaXPath xpath
    // Size: 0x8
    // Offset: 0x140
    ::System::Xml::Schema::XmlSchemaXPath* xpath;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaXPath*) == 0x8);
    // private System.Xml.Schema.XmlSchemaInclude include
    // Size: 0x8
    // Offset: 0x148
    ::System::Xml::Schema::XmlSchemaInclude* include;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaInclude*) == 0x8);
    // private System.Xml.Schema.XmlSchemaImport import
    // Size: 0x8
    // Offset: 0x150
    ::System::Xml::Schema::XmlSchemaImport* import;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaImport*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAnnotation annotation
    // Size: 0x8
    // Offset: 0x158
    ::System::Xml::Schema::XmlSchemaAnnotation* annotation;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAnnotation*) == 0x8);
    // private System.Xml.Schema.XmlSchemaAppInfo appInfo
    // Size: 0x8
    // Offset: 0x160
    ::System::Xml::Schema::XmlSchemaAppInfo* appInfo;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaAppInfo*) == 0x8);
    // private System.Xml.Schema.XmlSchemaDocumentation documentation
    // Size: 0x8
    // Offset: 0x168
    ::System::Xml::Schema::XmlSchemaDocumentation* documentation;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaDocumentation*) == 0x8);
    // private System.Xml.Schema.XmlSchemaFacet facet
    // Size: 0x8
    // Offset: 0x170
    ::System::Xml::Schema::XmlSchemaFacet* facet;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaFacet*) == 0x8);
    // private System.Xml.XmlNode[] markup
    // Size: 0x8
    // Offset: 0x178
    ::ArrayW<::System::Xml::XmlNode*> markup;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlNode*>) == 0x8);
    // private System.Xml.Schema.XmlSchemaRedefine redefine
    // Size: 0x8
    // Offset: 0x180
    ::System::Xml::Schema::XmlSchemaRedefine* redefine;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaRedefine*) == 0x8);
    // private System.Xml.Schema.ValidationEventHandler validationEventHandler
    // Size: 0x8
    // Offset: 0x188
    ::System::Xml::Schema::ValidationEventHandler* validationEventHandler;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::ValidationEventHandler*) == 0x8);
    // private System.Collections.ArrayList unhandledAttributes
    // Size: 0x8
    // Offset: 0x190
    ::System::Collections::ArrayList* unhandledAttributes;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // private System.Collections.Hashtable namespaces
    // Size: 0x8
    // Offset: 0x198
    ::System::Collections::Hashtable* namespaces;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    public:
    // Get static field: static private readonly System.Xml.Schema.XsdBuilder/System.Xml.Schema.State[] SchemaElement
    static ::ArrayW<::System::Xml::Schema::XsdBuilder::State> _get_SchemaElement();
    // Set static field: static private readonly System.Xml.Schema.XsdBuilder/System.Xml.Schema.State[] SchemaElement
    static void _set_SchemaElement(::ArrayW<::System::Xml::Schema::XsdBuilder::State> value);
    // Get static field: static private readonly System.Xml.Schema.XsdBuilder/System.Xml.Schema.State[] SchemaSubelements
    static ::ArrayW<::System::Xml::Schema::XsdBuilder::State> _get_SchemaSubelements();
    // Set static field: static private readonly System.Xml.Schema.XsdBuilder/System.Xml.Schema.State[] SchemaSubelements
