// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Schema.BaseValidator
#include "System/Xml/Schema/BaseValidator.hpp"
// Including type: System.Xml.Schema.XmlSchemaContentProcessing
#include "System/Xml/Schema/XmlSchemaContentProcessing.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: HWStack
  class HWStack;
  // Forward declaring type: XmlNamespaceManager
  class XmlNamespaceManager;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: XmlTokenizedType
  struct XmlTokenizedType;
  // Forward declaring type: XmlValidatingReaderImpl
  class XmlValidatingReaderImpl;
  // Forward declaring type: IValidationEventHandling
  class IValidationEventHandling;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: IdRefNode
  class IdRefNode;
  // Forward declaring type: Parser
  class Parser;
  // Forward declaring type: XmlSchemaDatatype
  class XmlSchemaDatatype;
  // Forward declaring type: SchemaElementDecl
  class SchemaElementDecl;
  // Forward declaring type: SchemaAttDef
  class SchemaAttDef;
  // Forward declaring type: XmlSchemaCollection
  class XmlSchemaCollection;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XsdValidator
  class XsdValidator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Schema::XsdValidator);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::XsdValidator*, "System.Xml.Schema", "XsdValidator");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0x100
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XsdValidator
  // [TokenAttribute] Offset: FFFFFFFF
  class XsdValidator : public ::System::Xml::Schema::BaseValidator {
    public:
    // Writing base type padding for base size: 0x7A to desired offset: 0x7C
    char ___base_padding[0x2] = {};
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Int32 startIDConstraint
    // Size: 0x4
    // Offset: 0x7C
    int startIDConstraint;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.HWStack validationStack
    // Size: 0x8
    // Offset: 0x80
    ::System::Xml::HWStack* validationStack;
    // Field size check
    static_assert(sizeof(::System::Xml::HWStack*) == 0x8);
    // private System.Collections.Hashtable attPresence
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Hashtable* attPresence;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Xml.XmlNamespaceManager nsManager
    // Size: 0x8
    // Offset: 0x90
    ::System::Xml::XmlNamespaceManager* nsManager;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNamespaceManager*) == 0x8);
    // private System.Boolean bManageNamespaces
    // Size: 0x1
    // Offset: 0x98
    bool bManageNamespaces;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bManageNamespaces and: IDs
    char __padding4[0x7] = {};
    // private System.Collections.Hashtable IDs
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Hashtable* IDs;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Xml.Schema.IdRefNode idRefListHead
    // Size: 0x8
    // Offset: 0xA8
    ::System::Xml::Schema::IdRefNode* idRefListHead;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::IdRefNode*) == 0x8);
    // private System.Xml.Schema.Parser inlineSchemaParser
    // Size: 0x8
    // Offset: 0xB0
    ::System::Xml::Schema::Parser* inlineSchemaParser;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::Parser*) == 0x8);
    // private System.Xml.Schema.XmlSchemaContentProcessing processContents
    // Size: 0x4
    // Offset: 0xB8
    ::System::Xml::Schema::XmlSchemaContentProcessing processContents;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaContentProcessing) == 0x4);
    // Padding between fields: processContents and: NsXmlNs
    char __padding8[0x4] = {};
    // private System.String NsXmlNs
    // Size: 0x8
    // Offset: 0xC0
    ::StringW NsXmlNs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String NsXs
    // Size: 0x8
    // Offset: 0xC8
    ::StringW NsXs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String NsXsi
    // Size: 0x8
    // Offset: 0xD0
    ::StringW NsXsi;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsiType
    // Size: 0x8
    // Offset: 0xD8
    ::StringW XsiType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsiNil
    // Size: 0x8
    // Offset: 0xE0
    ::StringW XsiNil;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsiSchemaLocation
    // Size: 0x8
    // Offset: 0xE8
    ::StringW XsiSchemaLocation;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsiNoNamespaceSchemaLocation
    // Size: 0x8
    // Offset: 0xF0
    ::StringW XsiNoNamespaceSchemaLocation;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XsdSchema
    // Size: 0x8
    // Offset: 0xF8
    ::StringW XsdSchema;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtCDATA
    static ::System::Xml::Schema::XmlSchemaDatatype* _get_dtCDATA();
    // Set static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtCDATA
    static void _set_dtCDATA(::System::Xml::Schema::XmlSchemaDatatype* value);
    // Get static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtQName
    static ::System::Xml::Schema::XmlSchemaDatatype* _get_dtQName();
    // Set static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtQName
    static void _set_dtQName(::System::Xml::Schema::XmlSchemaDatatype* value);
    // Get static field: static private readonly System.Xml.Schema.XmlSchemaDatatype dtStringArray
    static ::System::Xml::Schema::XmlSchemaDatatype* _get_dtStringArray();
