// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.Object
#include "System/Object.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: RegexCode
  class RegexCode;
  // Forward declaring type: RegexRunnerFactory
  class RegexRunnerFactory;
  // Forward declaring type: ExclusiveReference
  class ExclusiveReference;
  // Forward declaring type: SharedReference
  class SharedReference;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
struct CsObject;
struct CsString;
template<class T>
struct Array;
// Completed il2cpp-utils forward declares
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Autogenerated type: System.Text.RegularExpressions.CachedCodeEntry
  class CachedCodeEntry : public ::CsObject {
    public:
    // System.String _key
    // Offset: 0x10
    ::CsString* key;
    // System.Text.RegularExpressions.RegexCode _code
    // Offset: 0x18
    System::Text::RegularExpressions::RegexCode* code;
    // System.Collections.Hashtable _caps
    // Offset: 0x20
    System::Collections::Hashtable* caps;
    // System.Collections.Hashtable _capnames
    // Offset: 0x28
    System::Collections::Hashtable* capnames;
    // System.String[] _capslist
    // Offset: 0x30
    ::Array<::CsString*>* capslist;
    // System.Int32 _capsize
    // Offset: 0x38
    int capsize;
    // System.Text.RegularExpressions.RegexRunnerFactory _factory
    // Offset: 0x40
    System::Text::RegularExpressions::RegexRunnerFactory* factory;
    // System.Text.RegularExpressions.ExclusiveReference _runnerref
    // Offset: 0x48
    System::Text::RegularExpressions::ExclusiveReference* runnerref;
    // System.Text.RegularExpressions.SharedReference _replref
    // Offset: 0x50
    System::Text::RegularExpressions::SharedReference* replref;
    // System.Void .ctor(System.String key, System.Collections.Hashtable capnames, System.String[] capslist, System.Text.RegularExpressions.RegexCode code, System.Collections.Hashtable caps, System.Int32 capsize, System.Text.RegularExpressions.ExclusiveReference runner, System.Text.RegularExpressions.SharedReference repl)
    // Offset: 0x1206B4C
    static CachedCodeEntry* New_ctor(::CsString* key, System::Collections::Hashtable* capnames, ::Array<::CsString*>* capslist, System::Text::RegularExpressions::RegexCode* code, System::Collections::Hashtable* caps, int capsize, System::Text::RegularExpressions::ExclusiveReference* runner, System::Text::RegularExpressions::SharedReference* repl);
  }; // System.Text.RegularExpressions.CachedCodeEntry
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Text::RegularExpressions::CachedCodeEntry*, "System.Text.RegularExpressions", "CachedCodeEntry");
#pragma pack(pop)
