// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: RegexPrefix
  class RegexPrefix;
  // Forward declaring type: RegexBoyerMoore
  class RegexBoyerMoore;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Autogenerated type: System.Text.RegularExpressions.RegexCode
  class RegexCode : public ::Il2CppObject {
    public:
    // System.Int32[] _codes
    // Offset: 0x10
    ::Array<int>* codes;
    // System.String[] _strings
    // Offset: 0x18
    ::Array<::Il2CppString*>* strings;
    // System.Int32 _trackcount
    // Offset: 0x20
    int trackcount;
    // System.Collections.Hashtable _caps
    // Offset: 0x28
    System::Collections::Hashtable* caps;
    // System.Int32 _capsize
    // Offset: 0x30
    int capsize;
    // System.Text.RegularExpressions.RegexPrefix _fcPrefix
    // Offset: 0x38
    System::Text::RegularExpressions::RegexPrefix* fcPrefix;
    // System.Text.RegularExpressions.RegexBoyerMoore _bmPrefix
    // Offset: 0x40
    System::Text::RegularExpressions::RegexBoyerMoore* bmPrefix;
    // System.Int32 _anchors
    // Offset: 0x48
    int anchors;
    // System.Boolean _rightToLeft
    // Offset: 0x4C
    bool rightToLeft;
    // System.Void .ctor(System.Int32[] codes, System.Collections.Generic.List`1<System.String> stringlist, System.Int32 trackcount, System.Collections.Hashtable caps, System.Int32 capsize, System.Text.RegularExpressions.RegexBoyerMoore bmPrefix, System.Text.RegularExpressions.RegexPrefix fcPrefix, System.Int32 anchors, System.Boolean rightToLeft)
    // Offset: 0x122AFD0
    static RegexCode* New_ctor(::Array<int>* codes, System::Collections::Generic::List_1<::Il2CppString*>* stringlist, int trackcount, System::Collections::Hashtable* caps, int capsize, System::Text::RegularExpressions::RegexBoyerMoore* bmPrefix, System::Text::RegularExpressions::RegexPrefix* fcPrefix, int anchors, bool rightToLeft);
    // static System.Boolean OpcodeBacktracks(System.Int32 Op)
    // Offset: 0x122B114
    static bool OpcodeBacktracks(int Op);
  }; // System.Text.RegularExpressions.RegexCode
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Text::RegularExpressions::RegexCode*, "System.Text.RegularExpressions", "RegexCode");
#pragma pack(pop)
