// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Text.RegularExpressions.RegexRunner
#include "System/Text/RegularExpressions/RegexRunner.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: RegexCode
  class RegexCode;
  // Forward declaring type: RegexPrefix
  class RegexPrefix;
  // Forward declaring type: RegexBoyerMoore
  class RegexBoyerMoore;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Completed forward declares
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: System.Text.RegularExpressions.RegexInterpreter
  class RegexInterpreter : public System::Text::RegularExpressions::RegexRunner {
    public:
    // System.Int32 runoperator
    // Size: 0x4
    // Offset: 0x80
    int runoperator;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: runoperator and: runcodes
    char __padding0[0x4] = {};
    // System.Int32[] runcodes
    // Size: 0x8
    // Offset: 0x88
    ::Array<int>* runcodes;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // System.Int32 runcodepos
    // Size: 0x4
    // Offset: 0x90
    int runcodepos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: runcodepos and: runstrings
    char __padding2[0x4] = {};
    // System.String[] runstrings
    // Size: 0x8
    // Offset: 0x98
    ::Array<::Il2CppString*>* runstrings;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // System.Text.RegularExpressions.RegexCode runcode
    // Size: 0x8
    // Offset: 0xA0
    System::Text::RegularExpressions::RegexCode* runcode;
    // Field size check
    static_assert(sizeof(System::Text::RegularExpressions::RegexCode*) == 0x8);
    // System.Text.RegularExpressions.RegexPrefix runfcPrefix
    // Size: 0x8
    // Offset: 0xA8
    System::Text::RegularExpressions::RegexPrefix* runfcPrefix;
    // Field size check
    static_assert(sizeof(System::Text::RegularExpressions::RegexPrefix*) == 0x8);
    // System.Text.RegularExpressions.RegexBoyerMoore runbmPrefix
    // Size: 0x8
    // Offset: 0xB0
    System::Text::RegularExpressions::RegexBoyerMoore* runbmPrefix;
    // Field size check
    static_assert(sizeof(System::Text::RegularExpressions::RegexBoyerMoore*) == 0x8);
    // System.Int32 runanchors
    // Size: 0x4
    // Offset: 0xB8
    int runanchors;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean runrtl
    // Size: 0x1
    // Offset: 0xBC
    bool runrtl;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean runci
    // Size: 0x1
    // Offset: 0xBD
    bool runci;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: runci and: runculture
    char __padding9[0x2] = {};
    // System.Globalization.CultureInfo runculture
    // Size: 0x8
    // Offset: 0xC0
    System::Globalization::CultureInfo* runculture;
    // Field size check
    static_assert(sizeof(System::Globalization::CultureInfo*) == 0x8);
    // Creating value type constructor for type: RegexInterpreter
    RegexInterpreter(int runoperator_ = {}, ::Array<int>* runcodes_ = {}, int runcodepos_ = {}, ::Array<::Il2CppString*>* runstrings_ = {}, System::Text::RegularExpressions::RegexCode* runcode_ = {}, System::Text::RegularExpressions::RegexPrefix* runfcPrefix_ = {}, System::Text::RegularExpressions::RegexBoyerMoore* runbmPrefix_ = {}, int runanchors_ = {}, bool runrtl_ = {}, bool runci_ = {}, System::Globalization::CultureInfo* runculture_ = {}) noexcept : runoperator{runoperator_}, runcodes{runcodes_}, runcodepos{runcodepos_}, runstrings{runstrings_}, runcode{runcode_}, runfcPrefix{runfcPrefix_}, runbmPrefix{runbmPrefix_}, runanchors{runanchors_}, runrtl{runrtl_}, runci{runci_}, runculture{runculture_} {}
