// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
  // Forward declaring type: UnicodeCategory
  struct UnicodeCategory;
}
// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.Text.RegularExpressions.RegexCharClass
  // [TokenAttribute] Offset: FFFFFFFF
  class RegexCharClass : public ::Il2CppObject {
    public:
    // Nested type: System::Text::RegularExpressions::RegexCharClass::LowerCaseMapping
    struct LowerCaseMapping;
    // Nested type: System::Text::RegularExpressions::RegexCharClass::SingleRangeComparer
    class SingleRangeComparer;
    // Nested type: System::Text::RegularExpressions::RegexCharClass::SingleRange
    class SingleRange;
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Text.RegularExpressions.RegexCharClass/System.Text.RegularExpressions.LowerCaseMapping
    // [TokenAttribute] Offset: FFFFFFFF
    struct LowerCaseMapping/*, public System::ValueType*/ {
      public:
      // System.Char _chMin
      // Size: 0x2
      // Offset: 0x0
      ::Il2CppChar chMin;
      // Field size check
      static_assert(sizeof(::Il2CppChar) == 0x2);
      // System.Char _chMax
      // Size: 0x2
      // Offset: 0x2
      ::Il2CppChar chMax;
      // Field size check
      static_assert(sizeof(::Il2CppChar) == 0x2);
      // System.Int32 _lcOp
      // Size: 0x4
      // Offset: 0x4
      int lcOp;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 _data
      // Size: 0x4
      // Offset: 0x8
      int data;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: LowerCaseMapping
      constexpr LowerCaseMapping(::Il2CppChar chMin_ = {}, ::Il2CppChar chMax_ = {}, int lcOp_ = {}, int data_ = {}) noexcept : chMin{chMin_}, chMax{chMax_}, lcOp{lcOp_}, data{data_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get instance field reference: System.Char _chMin
      ::Il2CppChar& dyn__chMin();
      // Get instance field reference: System.Char _chMax
      ::Il2CppChar& dyn__chMax();
      // Get instance field reference: System.Int32 _lcOp
      int& dyn__lcOp();
      // Get instance field reference: System.Int32 _data
      int& dyn__data();
      // System.Void .ctor(System.Char chMin, System.Char chMax, System.Int32 lcOp, System.Int32 data)
      // Offset: 0x1A39254
      // template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      // ABORTED: conflicts with another method.  LowerCaseMapping(::Il2CppChar chMin, ::Il2CppChar chMax, int lcOp, int data)
    }; // System.Text.RegularExpressions.RegexCharClass/System.Text.RegularExpressions.LowerCaseMapping
    #pragma pack(pop)
    static check_size<sizeof(RegexCharClass::LowerCaseMapping), 8 + sizeof(int)> __System_Text_RegularExpressions_RegexCharClass_LowerCaseMappingSizeCheck;
    static_assert(sizeof(RegexCharClass::LowerCaseMapping) == 0xC);
    // private System.Collections.Generic.List`1<System.Text.RegularExpressions.RegexCharClass/System.Text.RegularExpressions.SingleRange> _rangelist
    // Size: 0x8
    // Offset: 0x10
    System::Collections::Generic::List_1<System::Text::RegularExpressions::RegexCharClass::SingleRange*>* rangelist;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<System::Text::RegularExpressions::RegexCharClass::SingleRange*>*) == 0x8);
    // private System.Text.StringBuilder _categories
    // Size: 0x8
    // Offset: 0x18
    System::Text::StringBuilder* categories;
    // Field size check
    static_assert(sizeof(System::Text::StringBuilder*) == 0x8);
    // private System.Boolean _canonical
    // Size: 0x1
    // Offset: 0x20
    bool canonical;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _negate
    // Size: 0x1
    // Offset: 0x21
    bool negate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: negate and: subtractor
    char __padding3[0x6] = {};
    // private System.Text.RegularExpressions.RegexCharClass _subtractor
    // Size: 0x8
    // Offset: 0x28
    System::Text::RegularExpressions::RegexCharClass* subtractor;
    // Field size check
    static_assert(sizeof(System::Text::RegularExpressions::RegexCharClass*) == 0x8);
    // Creating value type constructor for type: RegexCharClass
    RegexCharClass(System::Collections::Generic::List_1<System::Text::RegularExpressions::RegexCharClass::SingleRange*>* rangelist_ = {}, System::Text::StringBuilder* categories_ = {}, bool canonical_ = {}, bool negate_ = {}, System::Text::RegularExpressions::RegexCharClass* subtractor_ = {}) noexcept : rangelist{rangelist_}, categories{categories_}, canonical{canonical_}, negate{negate_}, subtractor{subtractor_} {}
    // Get static field: static private readonly System.String InternalRegexIgnoreCase
    static ::Il2CppString* _get_InternalRegexIgnoreCase();
    // Set static field: static private readonly System.String InternalRegexIgnoreCase
    static void _set_InternalRegexIgnoreCase(::Il2CppString* value);
