// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshCollider
  class MeshCollider;
  // Forward declaring type: SphereCollider
  class SphereCollider;
  // Forward declaring type: CapsuleCollider
  class CapsuleCollider;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GorillaSurfaceOverride
  class GorillaSurfaceOverride;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GorillaLocomotion
namespace GorillaLocomotion {
  // Skipping declaration: MaterialData because it is already included!
}
// Completed forward declares
// Type namespace: GorillaLocomotion
namespace GorillaLocomotion {
  // Forward declaring type: Player
  class Player;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaLocomotion::Player);
DEFINE_IL2CPP_ARG_TYPE(::GorillaLocomotion::Player*, "GorillaLocomotion", "Player");
// Type namespace: GorillaLocomotion
namespace GorillaLocomotion {
  // Size: 0x4E0
  #pragma pack(push, 1)
  // Autogenerated type: GorillaLocomotion.Player
  // [TokenAttribute] Offset: FFFFFFFF
  class Player : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GorillaLocomotion::Player::MaterialData
    struct MaterialData;
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaLocomotion.Player/GorillaLocomotion.MaterialData
    // [TokenAttribute] Offset: FFFFFFFF
    struct MaterialData/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String matName
      // Size: 0x8
      // Offset: 0x0
      ::StringW matName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Boolean overrideAudio
      // Size: 0x1
      // Offset: 0x8
      bool overrideAudio;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: overrideAudio and: audio
      char __padding1[0x7] = {};
      // public UnityEngine.AudioClip audio
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::AudioClip* audio;
      // Field size check
      static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
      // public System.Boolean overrideSlidePercent
      // Size: 0x1
      // Offset: 0x18
      bool overrideSlidePercent;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: overrideSlidePercent and: slidePercent
      char __padding3[0x3] = {};
      // public System.Single slidePercent
      // Size: 0x4
      // Offset: 0x1C
      float slidePercent;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: MaterialData
      constexpr MaterialData(::StringW matName_ = {}, bool overrideAudio_ = {}, ::UnityEngine::AudioClip* audio_ = {}, bool overrideSlidePercent_ = {}, float slidePercent_ = {}) noexcept : matName{matName_}, overrideAudio{overrideAudio_}, audio{audio_}, overrideSlidePercent{overrideSlidePercent_}, slidePercent{slidePercent_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.String matName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_matName();
      // Get instance field reference: public System.Boolean overrideAudio
      [[deprecated("Use field access instead!")]] bool& dyn_overrideAudio();
      // Get instance field reference: public UnityEngine.AudioClip audio
      [[deprecated("Use field access instead!")]] ::UnityEngine::AudioClip*& dyn_audio();
      // Get instance field reference: public System.Boolean overrideSlidePercent
      [[deprecated("Use field access instead!")]] bool& dyn_overrideSlidePercent();
      // Get instance field reference: public System.Single slidePercent
      [[deprecated("Use field access instead!")]] float& dyn_slidePercent();
    }; // GorillaLocomotion.Player/GorillaLocomotion.MaterialData
    #pragma pack(pop)
    static check_size<sizeof(Player::MaterialData), 28 + sizeof(float)> __GorillaLocomotion_Player_MaterialDataSizeCheck;
    static_assert(sizeof(Player::MaterialData) == 0x20);
    public:
    // public UnityEngine.SphereCollider headCollider
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::SphereCollider* headCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::SphereCollider*) == 0x8);
    // public UnityEngine.CapsuleCollider bodyCollider
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::CapsuleCollider* bodyCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::CapsuleCollider*) == 0x8);
    // private System.Single bodyInitialRadius
    // Size: 0x4
    // Offset: 0x28
    float bodyInitialRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single bodyInitialHeight
    // Size: 0x4
    // Offset: 0x2C
    float bodyInitialHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.RaycastHit bodyHitInfo
    // Size: 0x2C
    // Offset: 0x30
    ::UnityEngine::RaycastHit bodyHitInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // Padding between fields: bodyHitInfo and: leftHandFollower
    char __padding4[0x4] = {};
    // public UnityEngine.Transform leftHandFollower
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* leftHandFollower;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightHandFollower
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* rightHandFollower;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightHandTransform
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* rightHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform leftHandTransform
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Transform* leftHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 lastLeftHandPosition
    // Size: 0xC
    // Offset: 0x80
    ::UnityEngine::Vector3 lastLeftHandPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastRightHandPosition
    // Size: 0xC
    // Offset: 0x8C
    ::UnityEngine::Vector3 lastRightHandPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 lastHeadPosition
    // Size: 0xC
    // Offset: 0x98
    ::UnityEngine::Vector3 lastHeadPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: lastHeadPosition and: playerRigidBody
    char __padding11[0x4] = {};
    // private UnityEngine.Rigidbody playerRigidBody
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Rigidbody* playerRigidBody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // public System.Int32 velocityHistorySize
    // Size: 0x4
    // Offset: 0xB0
    int velocityHistorySize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single maxArmLength
    // Size: 0x4
    // Offset: 0xB4
    float maxArmLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single unStickDistance
    // Size: 0x4
    // Offset: 0xB8
    float unStickDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single velocityLimit
    // Size: 0x4
    // Offset: 0xBC
    float velocityLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slideVelocityLimit
    // Size: 0x4
    // Offset: 0xC0
    float slideVelocityLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxJumpSpeed
    // Size: 0x4
    // Offset: 0xC4
    float maxJumpSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single jumpMultiplier
    // Size: 0x4
    // Offset: 0xC8
    float jumpMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minimumRaycastDistance
    // Size: 0x4
    // Offset: 0xCC
    float minimumRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single defaultSlideFactor
    // Size: 0x4
    // Offset: 0xD0
    float defaultSlideFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slidingMinimum
    // Size: 0x4
    // Offset: 0xD4
    float slidingMinimum;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single defaultPrecision
    // Size: 0x4
    // Offset: 0xD8
    float defaultPrecision;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single teleportThresholdNoVel
    // Size: 0x4
    // Offset: 0xDC
    float teleportThresholdNoVel;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single frictionConstant
    // Size: 0x4
    // Offset: 0xE0
    float frictionConstant;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slideControl
    // Size: 0x4
    // Offset: 0xE4
    float slideControl;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single stickDepth
    // Size: 0x4
    // Offset: 0xE8
    float stickDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: stickDepth and: velocityHistory
    char __padding27[0x4] = {};
    // private UnityEngine.Vector3[] velocityHistory
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<::UnityEngine::Vector3> velocityHistory;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector3[] slideAverageHistory
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::UnityEngine::Vector3> slideAverageHistory;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Int32 velocityIndex
    // Size: 0x4
    // Offset: 0x100
    int velocityIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 currentVelocity
    // Size: 0xC
    // Offset: 0x104
    ::UnityEngine::Vector3 currentVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 denormalizedVelocityAverage
    // Size: 0xC
    // Offset: 0x110
    ::UnityEngine::Vector3 denormalizedVelocityAverage;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastPosition
    // Size: 0xC
    // Offset: 0x11C
    ::UnityEngine::Vector3 lastPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 rightHandOffset
    // Size: 0xC
    // Offset: 0x128
    ::UnityEngine::Vector3 rightHandOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 leftHandOffset
    // Size: 0xC
    // Offset: 0x134
    ::UnityEngine::Vector3 leftHandOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 bodyOffset
    // Size: 0xC
    // Offset: 0x140
    ::UnityEngine::Vector3 bodyOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.LayerMask locomotionEnabledLayers
    // Size: 0x4
    // Offset: 0x14C
    ::UnityEngine::LayerMask locomotionEnabledLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Boolean wasLeftHandTouching
    // Size: 0x1
    // Offset: 0x150
    bool wasLeftHandTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean wasRightHandTouching
    // Size: 0x1
    // Offset: 0x151
    bool wasRightHandTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean wasHeadTouching
    // Size: 0x1
    // Offset: 0x152
    bool wasHeadTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasHeadTouching and: currentMaterialIndex
    char __padding40[0x1] = {};
    // public System.Int32 currentMaterialIndex
    // Size: 0x4
    // Offset: 0x154
    int currentMaterialIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean leftHandSlide
    // Size: 0x1
    // Offset: 0x158
    bool leftHandSlide;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: leftHandSlide and: leftHandSlideNormal
    char __padding42[0x3] = {};
    // public UnityEngine.Vector3 leftHandSlideNormal
    // Size: 0xC
    // Offset: 0x15C
    ::UnityEngine::Vector3 leftHandSlideNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean rightHandSlide
    // Size: 0x1
    // Offset: 0x168
    bool rightHandSlide;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: rightHandSlide and: rightHandSlideNormal
    char __padding44[0x3] = {};
    // public UnityEngine.Vector3 rightHandSlideNormal
    // Size: 0xC
    // Offset: 0x16C
    ::UnityEngine::Vector3 rightHandSlideNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 headSlideNormal
    // Size: 0xC
    // Offset: 0x178
    ::UnityEngine::Vector3 headSlideNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single rightHandSlipPercentage
    // Size: 0x4
    // Offset: 0x184
    float rightHandSlipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single leftHandSlipPercentage
    // Size: 0x4
    // Offset: 0x188
    float leftHandSlipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single headSlipPercentage
    // Size: 0x4
    // Offset: 0x18C
    float headSlipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean wasLeftHandSlide
    // Size: 0x1
    // Offset: 0x190
    bool wasLeftHandSlide;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean wasRightHandSlide
    // Size: 0x1
    // Offset: 0x191
    bool wasRightHandSlide;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasRightHandSlide and: rightHandHitPoint
    char __padding51[0x2] = {};
    // public UnityEngine.Vector3 rightHandHitPoint
    // Size: 0xC
    // Offset: 0x194
    ::UnityEngine::Vector3 rightHandHitPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 leftHandHitPoint
    // Size: 0xC
    // Offset: 0x1A0
    ::UnityEngine::Vector3 leftHandHitPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean debugMovement
    // Size: 0x1
    // Offset: 0x1AC
    bool debugMovement;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disableMovement
    // Size: 0x1
    // Offset: 0x1AD
    bool disableMovement;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean inOverlay
    // Size: 0x1
    // Offset: 0x1AE
    bool inOverlay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean didATurn
    // Size: 0x1
    // Offset: 0x1AF
    bool didATurn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.GameObject turnParent
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::GameObject* turnParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Int32 leftHandMaterialTouchIndex
    // Size: 0x4
    // Offset: 0x1B8
    int leftHandMaterialTouchIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: leftHandMaterialTouchIndex and: leftHandSurfaceOverride
    char __padding59[0x4] = {};
    // public GorillaSurfaceOverride leftHandSurfaceOverride
    // Size: 0x8
    // Offset: 0x1C0
    ::GlobalNamespace::GorillaSurfaceOverride* leftHandSurfaceOverride;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaSurfaceOverride*) == 0x8);
    // public System.Int32 rightHandMaterialTouchIndex
    // Size: 0x4
    // Offset: 0x1C8
    int rightHandMaterialTouchIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: rightHandMaterialTouchIndex and: rightHandSurfaceOverride
    char __padding61[0x4] = {};
    // public GorillaSurfaceOverride rightHandSurfaceOverride
    // Size: 0x8
    // Offset: 0x1D0
    ::GlobalNamespace::GorillaSurfaceOverride* rightHandSurfaceOverride;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaSurfaceOverride*) == 0x8);
    // public GorillaSurfaceOverride currentOverride
    // Size: 0x8
    // Offset: 0x1D8
    ::GlobalNamespace::GorillaSurfaceOverride* currentOverride;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaSurfaceOverride*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaLocomotion.Player/GorillaLocomotion.MaterialData> materialData
    // Size: 0x8
    // Offset: 0x1E0
    ::System::Collections::Generic::List_1<::GorillaLocomotion::Player::MaterialData>* materialData;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaLocomotion::Player::MaterialData>*) == 0x8);
    // private System.Boolean leftHandColliding
    // Size: 0x1
    // Offset: 0x1E8
    bool leftHandColliding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean rightHandColliding
    // Size: 0x1
    // Offset: 0x1E9
    bool rightHandColliding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean headColliding
    // Size: 0x1
    // Offset: 0x1EA
    bool headColliding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: headColliding and: finalPosition
    char __padding67[0x1] = {};
    // private UnityEngine.Vector3 finalPosition
    // Size: 0xC
    // Offset: 0x1EC
    ::UnityEngine::Vector3 finalPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 rigidBodyMovement
    // Size: 0xC
    // Offset: 0x1F8
    ::UnityEngine::Vector3 rigidBodyMovement;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 firstIterationLeftHand
    // Size: 0xC
    // Offset: 0x204
    ::UnityEngine::Vector3 firstIterationLeftHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 firstIterationRightHand
    // Size: 0xC
    // Offset: 0x210
    ::UnityEngine::Vector3 firstIterationRightHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 firstIterationHead
    // Size: 0xC
    // Offset: 0x21C
    ::UnityEngine::Vector3 firstIterationHead;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.RaycastHit hitInfo
    // Size: 0x2C
    // Offset: 0x228
    ::UnityEngine::RaycastHit hitInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.RaycastHit iterativeHitInfo
    // Size: 0x2C
    // Offset: 0x254
    ::UnityEngine::RaycastHit iterativeHitInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.RaycastHit collisionsInnerHit
    // Size: 0x2C
    // Offset: 0x280
    ::UnityEngine::RaycastHit collisionsInnerHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private System.Single slipPercentage
    // Size: 0x4
    // Offset: 0x2AC
    float slipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 bodyOffsetVector
    // Size: 0xC
    // Offset: 0x2B0
    ::UnityEngine::Vector3 bodyOffsetVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 distanceTraveled
    // Size: 0xC
    // Offset: 0x2BC
    ::UnityEngine::Vector3 distanceTraveled;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 movementToProjectedAboveCollisionPlane
    // Size: 0xC
    // Offset: 0x2C8
    ::UnityEngine::Vector3 movementToProjectedAboveCollisionPlane;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: movementToProjectedAboveCollisionPlane and: meshCollider
    char __padding79[0x4] = {};
    // private UnityEngine.MeshCollider meshCollider
    // Size: 0x8
    // Offset: 0x2D8
    ::UnityEngine::MeshCollider* meshCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshCollider*) == 0x8);
    // private UnityEngine.Mesh collidedMesh
    // Size: 0x8
    // Offset: 0x2E0
    ::UnityEngine::Mesh* collidedMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private GorillaLocomotion.Player/GorillaLocomotion.MaterialData foundMatData
    // Size: 0x20
    // Offset: 0x2E8
    ::GorillaLocomotion::Player::MaterialData foundMatData;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Player::MaterialData) == 0x20);
    // private System.String findMatName
    // Size: 0x8
    // Offset: 0x308
    ::StringW findMatName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 vertex1
    // Size: 0x4
    // Offset: 0x310
    int vertex1;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 vertex2
    // Size: 0x4
    // Offset: 0x314
    int vertex2;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 vertex3
    // Size: 0x4
    // Offset: 0x318
    int vertex3;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: vertex3 and: trianglesList
    char __padding86[0x4] = {};
    // private System.Collections.Generic.List`1<System.Int32> trianglesList
    // Size: 0x8
    // Offset: 0x320
    ::System::Collections::Generic::List_1<int>* trianglesList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Material> materialsList
    // Size: 0x8
    // Offset: 0x328
    ::System::Collections::Generic::List_1<::UnityEngine::Material*>* materialsList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Material*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Mesh,System.Int32[]> meshTrianglesDict
    // Size: 0x8
    // Offset: 0x330
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Mesh*, ::ArrayW<int>>* meshTrianglesDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Mesh*, ::ArrayW<int>>*) == 0x8);
    // private System.Int32[] sharedMeshTris
    // Size: 0x8
    // Offset: 0x338
    ::ArrayW<int> sharedMeshTris;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Single lastRealTime
    // Size: 0x4
    // Offset: 0x340
    float lastRealTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single calcDeltaTime
    // Size: 0x4
    // Offset: 0x344
    float calcDeltaTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single tempRealTime
    // Size: 0x4
    // Offset: 0x348
    float tempRealTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 junkNormal
    // Size: 0xC
    // Offset: 0x34C
    ::UnityEngine::Vector3 junkNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 slideAverage
    // Size: 0xC
    // Offset: 0x358
    ::UnityEngine::Vector3 slideAverage;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 slideAverageNormal
    // Size: 0xC
    // Offset: 0x364
    ::UnityEngine::Vector3 slideAverageNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 tempVector3
    // Size: 0xC
    // Offset: 0x370
    ::UnityEngine::Vector3 tempVector3;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.RaycastHit tempHitInfo
    // Size: 0x2C
    // Offset: 0x37C
    ::UnityEngine::RaycastHit tempHitInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.RaycastHit junkHit
    // Size: 0x2C
    // Offset: 0x3A8
    ::UnityEngine::RaycastHit junkHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.Vector3 firstPosition
    // Size: 0xC
    // Offset: 0x3D4
    ::UnityEngine::Vector3 firstPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.RaycastHit tempIterativeHit
    // Size: 0x2C
    // Offset: 0x3E0
    ::UnityEngine::RaycastHit tempIterativeHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private System.Boolean collisionsReturnBool
    // Size: 0x1
    // Offset: 0x40C
    bool collisionsReturnBool;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: collisionsReturnBool and: overlapRadiusFunction
    char __padding102[0x3] = {};
    // private System.Single overlapRadiusFunction
    // Size: 0x4
    // Offset: 0x410
    float overlapRadiusFunction;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxSphereSize1
    // Size: 0x4
    // Offset: 0x414
    float maxSphereSize1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxSphereSize2
    // Size: 0x4
    // Offset: 0x418
    float maxSphereSize2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: maxSphereSize2 and: overlapColliders
    char __padding105[0x4] = {};
    // private UnityEngine.Collider[] overlapColliders
    // Size: 0x8
    // Offset: 0x420
    ::ArrayW<::UnityEngine::Collider*> overlapColliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private System.Int32 overlapAttempts
    // Size: 0x4
    // Offset: 0x428
    int overlapAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 touchPoints
    // Size: 0x4
    // Offset: 0x42C
    int touchPoints;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single averageSlipPercentage
    // Size: 0x4
    // Offset: 0x430
    float averageSlipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 surfaceDirection
    // Size: 0xC
    // Offset: 0x434
    ::UnityEngine::Vector3 surfaceDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single debugMagnitude
    // Size: 0x4
    // Offset: 0x440
    float debugMagnitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single iceThreshold
    // Size: 0x4
    // Offset: 0x444
    float iceThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single bodyMaxRadius
    // Size: 0x4
    // Offset: 0x448
    float bodyMaxRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bodyLerp
    // Size: 0x4
    // Offset: 0x44C
    float bodyLerp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean areBothTouching
    // Size: 0x1
    // Offset: 0x450
    bool areBothTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: areBothTouching and: slideFactor
    char __padding115[0x3] = {};
    // private System.Single slideFactor
    // Size: 0x4
    // Offset: 0x454
    float slideFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean didAJump
    // Size: 0x1
    // Offset: 0x458
    bool didAJump;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: didAJump and: slideRenderer
    char __padding117[0x7] = {};
    // private UnityEngine.Renderer slideRenderer
    // Size: 0x8
    // Offset: 0x460
    ::UnityEngine::Renderer* slideRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private System.Boolean iterativeIsRoom
    // Size: 0x1
    // Offset: 0x468
    bool iterativeIsRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean finalIsRoom
    // Size: 0x1
    // Offset: 0x469
    bool finalIsRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean firstIsRoom
    // Size: 0x1
    // Offset: 0x46A
    bool firstIsRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean mainIsRoom
    // Size: 0x1
    // Offset: 0x46B
    bool mainIsRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single iterativeSphereRadius
    // Size: 0x4
    // Offset: 0x46C
    float iterativeSphereRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.RaycastHit[] rayCastNonAllocColliders
    // Size: 0x8
    // Offset: 0x470
    ::ArrayW<::UnityEngine::RaycastHit> rayCastNonAllocColliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.Collider[] rayCastNonAllocActuallyColliders
    // Size: 0x8
    // Offset: 0x478
    ::ArrayW<::UnityEngine::Collider*> rayCastNonAllocActuallyColliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.Vector3 tempVel
    // Size: 0xC
    // Offset: 0x480
    ::UnityEngine::Vector3 tempVel;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: tempVel and: crazyCheckVectors
    char __padding126[0x4] = {};
    // private UnityEngine.Vector3[] crazyCheckVectors
    // Size: 0x8
    // Offset: 0x490
    ::ArrayW<::UnityEngine::Vector3> crazyCheckVectors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.RaycastHit emptyHit
    // Size: 0x2C
    // Offset: 0x498
    ::UnityEngine::RaycastHit emptyHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private System.Int32 bufferCount
    // Size: 0x4
    // Offset: 0x4C4
    int bufferCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 lastOpenHeadPosition
    // Size: 0xC
    // Offset: 0x4C8
    ::UnityEngine::Vector3 lastOpenHeadPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: lastOpenHeadPosition and: tempMaterialArray
    char __padding130[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.Material> tempMaterialArray
    // Size: 0x8
    // Offset: 0x4D8
    ::System::Collections::Generic::List_1<::UnityEngine::Material*>* tempMaterialArray;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Material*>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private GorillaLocomotion.Player _instance
    static ::GorillaLocomotion::Player* _get__instance();
    // Set static field: static private GorillaLocomotion.Player _instance
    static void _set__instance(::GorillaLocomotion::Player* value);
    // Get instance field reference: public UnityEngine.SphereCollider headCollider
    [[deprecated("Use field access instead!")]] ::UnityEngine::SphereCollider*& dyn_headCollider();
    // Get instance field reference: public UnityEngine.CapsuleCollider bodyCollider
