// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Viveport.IAPurchase
#include "Viveport/IAPurchase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Viveport::IAPurchase::QueryResponse);
DEFINE_IL2CPP_ARG_TYPE(::Viveport::IAPurchase::QueryResponse*, "Viveport", "IAPurchase/QueryResponse");
// Type namespace: Viveport
namespace Viveport {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: Viveport.IAPurchase/Viveport.QueryResponse
  // [TokenAttribute] Offset: FFFFFFFF
  class IAPurchase::QueryResponse : public ::Il2CppObject {
    public:
    public:
    // private System.String <order_id>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::StringW order_id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <purchase_id>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::StringW purchase_id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <status>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::StringW status;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <price>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::StringW price;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <currency>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::StringW currency;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int64 <paid_timestamp>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    int64_t paid_timestamp;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    public:
    // Get instance field reference: private System.String <order_id>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$order_id$k__BackingField();
    // Get instance field reference: private System.String <purchase_id>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$purchase_id$k__BackingField();
    // Get instance field reference: private System.String <status>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$status$k__BackingField();
    // Get instance field reference: private System.String <price>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$price$k__BackingField();
    // Get instance field reference: private System.String <currency>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$currency$k__BackingField();
    // Get instance field reference: private System.Int64 <paid_timestamp>k__BackingField
    [[deprecated("Use field access instead!")]] int64_t& dyn_$paid_timestamp$k__BackingField();
    // public System.String get_order_id()
    // Offset: 0x1BAC7F8
    ::StringW get_order_id();
    // public System.Void set_order_id(System.String value)
    // Offset: 0x1BAC800
    void set_order_id(::StringW value);
    // public System.String get_purchase_id()
    // Offset: 0x1BAC808
    ::StringW get_purchase_id();
    // public System.Void set_purchase_id(System.String value)
    // Offset: 0x1BAC810
    void set_purchase_id(::StringW value);
    // public System.String get_status()
    // Offset: 0x1BAC818
    ::StringW get_status();
    // public System.Void set_status(System.String value)
    // Offset: 0x1BAC820
    void set_status(::StringW value);
    // public System.String get_price()
    // Offset: 0x1BAC828
    ::StringW get_price();
    // public System.Void set_price(System.String value)
    // Offset: 0x1BAC830
    void set_price(::StringW value);
    // public System.String get_currency()
    // Offset: 0x1BAC838
    ::StringW get_currency();
    // public System.Void set_currency(System.String value)
    // Offset: 0x1BAC840
    void set_currency(::StringW value);
    // public System.Int64 get_paid_timestamp()
    // Offset: 0x1BAC848
    int64_t get_paid_timestamp();
    // public System.Void set_paid_timestamp(System.Int64 value)
    // Offset: 0x1BAC850
    void set_paid_timestamp(int64_t value);
    // public System.Void .ctor()
    // Offset: 0x1BAC858
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static IAPurchase::QueryResponse* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Viveport::IAPurchase::QueryResponse::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<IAPurchase::QueryResponse*, creationType>()));
    }
  }; // Viveport.IAPurchase/Viveport.QueryResponse
  #pragma pack(pop)
  static check_size<sizeof(IAPurchase::QueryResponse), 56 + sizeof(int64_t)> __Viveport_IAPurchase_QueryResponseSizeCheck;
  static_assert(sizeof(IAPurchase::QueryResponse) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::get_order_id
// Il2CppName: get_order_id
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Viveport::IAPurchase::QueryResponse::*)()>(&Viveport::IAPurchase::QueryResponse::get_order_id)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "get_order_id", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::set_order_id
// Il2CppName: set_order_id
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Viveport::IAPurchase::QueryResponse::*)(::StringW)>(&Viveport::IAPurchase::QueryResponse::set_order_id)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "set_order_id", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::get_purchase_id
// Il2CppName: get_purchase_id
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Viveport::IAPurchase::QueryResponse::*)()>(&Viveport::IAPurchase::QueryResponse::get_purchase_id)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "get_purchase_id", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::set_purchase_id
// Il2CppName: set_purchase_id
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Viveport::IAPurchase::QueryResponse::*)(::StringW)>(&Viveport::IAPurchase::QueryResponse::set_purchase_id)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "set_purchase_id", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::get_status
// Il2CppName: get_status
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Viveport::IAPurchase::QueryResponse::*)()>(&Viveport::IAPurchase::QueryResponse::get_status)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "get_status", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::set_status
// Il2CppName: set_status
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Viveport::IAPurchase::QueryResponse::*)(::StringW)>(&Viveport::IAPurchase::QueryResponse::set_status)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "set_status", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::get_price
// Il2CppName: get_price
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Viveport::IAPurchase::QueryResponse::*)()>(&Viveport::IAPurchase::QueryResponse::get_price)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "get_price", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::set_price
// Il2CppName: set_price
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Viveport::IAPurchase::QueryResponse::*)(::StringW)>(&Viveport::IAPurchase::QueryResponse::set_price)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "set_price", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::get_currency
// Il2CppName: get_currency
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Viveport::IAPurchase::QueryResponse::*)()>(&Viveport::IAPurchase::QueryResponse::get_currency)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "get_currency", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::set_currency
// Il2CppName: set_currency
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Viveport::IAPurchase::QueryResponse::*)(::StringW)>(&Viveport::IAPurchase::QueryResponse::set_currency)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "set_currency", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::get_paid_timestamp
// Il2CppName: get_paid_timestamp
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int64_t (Viveport::IAPurchase::QueryResponse::*)()>(&Viveport::IAPurchase::QueryResponse::get_paid_timestamp)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "get_paid_timestamp", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::set_paid_timestamp
// Il2CppName: set_paid_timestamp
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Viveport::IAPurchase::QueryResponse::*)(int64_t)>(&Viveport::IAPurchase::QueryResponse::set_paid_timestamp)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Int64")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Viveport::IAPurchase::QueryResponse*), "set_paid_timestamp", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Viveport::IAPurchase::QueryResponse::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
