// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: NUnit.Framework.Interfaces.TestStatus
#include "NUnit/Framework/Interfaces/TestStatus.hpp"
// Including type: NUnit.Framework.Interfaces.FailureSite
#include "NUnit/Framework/Interfaces/FailureSite.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: NUnit::Framework::Internal
namespace NUnit::Framework::Internal {
  // Forward declaring type: TestResult
  class TestResult;
}
// Completed forward declares
// Type namespace: UnityEngine.TestTools
namespace UnityEngine::TestTools {
  // Autogenerated type: UnityEngine.TestTools.BeforeAfterTestCommandState
  class BeforeAfterTestCommandState : public UnityEngine::ScriptableObject {
    public:
    // public System.Int32 NextBeforeStepIndex
    // Offset: 0x18
    int NextBeforeStepIndex;
    // public System.Int32 NextBeforeStepPc
    // Offset: 0x1C
    int NextBeforeStepPc;
    // public System.Int32 NextAfterStepIndex
    // Offset: 0x20
    int NextAfterStepIndex;
    // public System.Int32 NextAfterStepPc
    // Offset: 0x24
    int NextAfterStepPc;
    // public System.Boolean TestHasRun
    // Offset: 0x28
    bool TestHasRun;
    // public NUnit.Framework.Interfaces.TestStatus CurrentTestResultStatus
    // Offset: 0x2C
    NUnit::Framework::Interfaces::TestStatus CurrentTestResultStatus;
    // public System.String CurrentTestResultLabel
    // Offset: 0x30
    ::Il2CppString* CurrentTestResultLabel;
    // public NUnit.Framework.Interfaces.FailureSite CurrentTestResultSite
    // Offset: 0x38
    NUnit::Framework::Interfaces::FailureSite CurrentTestResultSite;
    // public System.String CurrentTestMessage
    // Offset: 0x40
    ::Il2CppString* CurrentTestMessage;
    // public System.String CurrentTestStrackTrace
    // Offset: 0x48
    ::Il2CppString* CurrentTestStrackTrace;
    // public System.Boolean TestAfterStarted
    // Offset: 0x50
    bool TestAfterStarted;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void Reset()
    // Offset: 0xE3F404
    void Reset();
    // public System.Void StoreTestResult(NUnit.Framework.Internal.TestResult result)
    // Offset: 0xE3F460
    void StoreTestResult(NUnit::Framework::Internal::TestResult* result);
    // public System.Void ApplyTestResult(NUnit.Framework.Internal.TestResult result)
    // Offset: 0xE3F524
    void ApplyTestResult(NUnit::Framework::Internal::TestResult* result);
    // public System.Void .ctor()
    // Offset: 0xE3F5C4
    // Implemented from: UnityEngine.ScriptableObject
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static BeforeAfterTestCommandState* New_ctor();
  }; // UnityEngine.TestTools.BeforeAfterTestCommandState
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::TestTools::BeforeAfterTestCommandState*, "UnityEngine.TestTools", "BeforeAfterTestCommandState");
#pragma pack(pop)
