// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Newtonsoft.Json.TypeNameHandling
#include "Newtonsoft/Json/TypeNameHandling.hpp"
// Including type: Newtonsoft.Json.TypeNameAssemblyFormatHandling
#include "Newtonsoft/Json/TypeNameAssemblyFormatHandling.hpp"
// Including type: Newtonsoft.Json.PreserveReferencesHandling
#include "Newtonsoft/Json/PreserveReferencesHandling.hpp"
// Including type: Newtonsoft.Json.ReferenceLoopHandling
#include "Newtonsoft/Json/ReferenceLoopHandling.hpp"
// Including type: Newtonsoft.Json.MissingMemberHandling
#include "Newtonsoft/Json/MissingMemberHandling.hpp"
// Including type: Newtonsoft.Json.ObjectCreationHandling
#include "Newtonsoft/Json/ObjectCreationHandling.hpp"
// Including type: Newtonsoft.Json.NullValueHandling
#include "Newtonsoft/Json/NullValueHandling.hpp"
// Including type: Newtonsoft.Json.DefaultValueHandling
#include "Newtonsoft/Json/DefaultValueHandling.hpp"
// Including type: Newtonsoft.Json.ConstructorHandling
#include "Newtonsoft/Json/ConstructorHandling.hpp"
// Including type: Newtonsoft.Json.MetadataPropertyHandling
#include "Newtonsoft/Json/MetadataPropertyHandling.hpp"
// Including type: System.Runtime.Serialization.StreamingContext

// Including type: Newtonsoft.Json.FloatFormatHandling
#include "Newtonsoft/Json/FloatFormatHandling.hpp"
// Including type: Newtonsoft.Json.FloatParseHandling
#include "Newtonsoft/Json/FloatParseHandling.hpp"
// Including type: Newtonsoft.Json.StringEscapeHandling
#include "Newtonsoft/Json/StringEscapeHandling.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Newtonsoft::Json
namespace Newtonsoft::Json {
  // Forward declaring type: JsonConverterCollection
  class JsonConverterCollection;
  // Forward declaring type: JsonSerializerSettings
  class JsonSerializerSettings;
  // Forward declaring type: JsonReader
  class JsonReader;
  // Forward declaring type: JsonWriter
  class JsonWriter;
  // Forward declaring type: JsonConverter
  class JsonConverter;
}
// Forward declaring namespace: Newtonsoft::Json::Serialization
namespace Newtonsoft::Json::Serialization {
  // Forward declaring type: IContractResolver
  class IContractResolver;
  // Forward declaring type: ITraceWriter
  class ITraceWriter;
  // Forward declaring type: ISerializationBinder
  class ISerializationBinder;
  // Forward declaring type: IReferenceResolver
  class IReferenceResolver;
  // Forward declaring type: ErrorEventArgs
  class ErrorEventArgs;
  // Forward declaring type: TraceJsonReader
  class TraceJsonReader;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEqualityComparer
  class IEqualityComparer;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // Forward declaring type: JsonSerializer
  class JsonSerializer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(Newtonsoft::Json::JsonSerializer);
DEFINE_IL2CPP_ARG_TYPE(Newtonsoft::Json::JsonSerializer*, "Newtonsoft.Json", "JsonSerializer");
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // WARNING Size may be invalid!
  // Autogenerated type: Newtonsoft.Json.JsonSerializer
  // [TokenAttribute] Offset: FFFFFFFF
  // [NullableContextAttribute] Offset: 1201880
  // [NullableAttribute] Offset: 1201880
  class JsonSerializer : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // Newtonsoft.Json.TypeNameHandling _typeNameHandling
    // Size: 0x4
    // Offset: 0x10
    Newtonsoft::Json::TypeNameHandling typeNameHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::TypeNameHandling) == 0x4);
    // Newtonsoft.Json.TypeNameAssemblyFormatHandling _typeNameAssemblyFormatHandling
    // Size: 0x4
    // Offset: 0x14
    Newtonsoft::Json::TypeNameAssemblyFormatHandling typeNameAssemblyFormatHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::TypeNameAssemblyFormatHandling) == 0x4);
    // Newtonsoft.Json.PreserveReferencesHandling _preserveReferencesHandling
    // Size: 0x4
    // Offset: 0x18
    Newtonsoft::Json::PreserveReferencesHandling preserveReferencesHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::PreserveReferencesHandling) == 0x4);
    // Newtonsoft.Json.ReferenceLoopHandling _referenceLoopHandling
    // Size: 0x4
    // Offset: 0x1C
    Newtonsoft::Json::ReferenceLoopHandling referenceLoopHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::ReferenceLoopHandling) == 0x4);
    // Newtonsoft.Json.MissingMemberHandling _missingMemberHandling
    // Size: 0x4
    // Offset: 0x20
    Newtonsoft::Json::MissingMemberHandling missingMemberHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::MissingMemberHandling) == 0x4);
    // Newtonsoft.Json.ObjectCreationHandling _objectCreationHandling
    // Size: 0x4
    // Offset: 0x24
    Newtonsoft::Json::ObjectCreationHandling objectCreationHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::ObjectCreationHandling) == 0x4);
    // Newtonsoft.Json.NullValueHandling _nullValueHandling
    // Size: 0x4
    // Offset: 0x28
    Newtonsoft::Json::NullValueHandling nullValueHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::NullValueHandling) == 0x4);
    // Newtonsoft.Json.DefaultValueHandling _defaultValueHandling
    // Size: 0x4
    // Offset: 0x2C
    Newtonsoft::Json::DefaultValueHandling defaultValueHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::DefaultValueHandling) == 0x4);
    // Newtonsoft.Json.ConstructorHandling _constructorHandling
    // Size: 0x4
    // Offset: 0x30
    Newtonsoft::Json::ConstructorHandling constructorHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::ConstructorHandling) == 0x4);
    // Newtonsoft.Json.MetadataPropertyHandling _metadataPropertyHandling
    // Size: 0x4
    // Offset: 0x34
    Newtonsoft::Json::MetadataPropertyHandling metadataPropertyHandling;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::MetadataPropertyHandling) == 0x4);
    // [NullableAttribute] Offset: 0x1204048
    // Newtonsoft.Json.JsonConverterCollection _converters
    // Size: 0x8
    // Offset: 0x38
    Newtonsoft::Json::JsonConverterCollection* converters;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::JsonConverterCollection*) == 0x8);
    // Newtonsoft.Json.Serialization.IContractResolver _contractResolver
    // Size: 0x8
    // Offset: 0x40
    Newtonsoft::Json::Serialization::IContractResolver* contractResolver;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::IContractResolver*) == 0x8);
    // [NullableAttribute] Offset: 0x120405C
    // Newtonsoft.Json.Serialization.ITraceWriter _traceWriter
    // Size: 0x8
    // Offset: 0x48
    Newtonsoft::Json::Serialization::ITraceWriter* traceWriter;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::ITraceWriter*) == 0x8);
    // [NullableAttribute] Offset: 0x1204070
    // System.Collections.IEqualityComparer _equalityComparer
    // Size: 0x8
    // Offset: 0x50
    System::Collections::IEqualityComparer* equalityComparer;
    // Field size check
    static_assert(sizeof(System::Collections::IEqualityComparer*) == 0x8);
    // Newtonsoft.Json.Serialization.ISerializationBinder _serializationBinder
    // Size: 0x8
    // Offset: 0x58
    Newtonsoft::Json::Serialization::ISerializationBinder* serializationBinder;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::ISerializationBinder*) == 0x8);
    // System.Runtime.Serialization.StreamingContext _context
    // Size: 0xC
    // Offset: 0x60
    System::Runtime::Serialization::StreamingContext context;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::StreamingContext) == 0xC);
    // [NullableAttribute] Offset: 0x1204084
    // private Newtonsoft.Json.Serialization.IReferenceResolver _referenceResolver
    // Size: 0x8
    // Offset: 0x70
    Newtonsoft::Json::Serialization::IReferenceResolver* referenceResolver;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Serialization::IReferenceResolver*) == 0x8);
    // private System.Nullable`1<Newtonsoft.Json.Formatting> _formatting
    // Size: 0xFFFFFFFF
    // Offset: 0x78
    System::Nullable_1<Newtonsoft::Json::Formatting> formatting;
    // private System.Nullable`1<Newtonsoft.Json.DateFormatHandling> _dateFormatHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x80
    System::Nullable_1<Newtonsoft::Json::DateFormatHandling> dateFormatHandling;
    // private System.Nullable`1<Newtonsoft.Json.DateTimeZoneHandling> _dateTimeZoneHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x88
    System::Nullable_1<Newtonsoft::Json::DateTimeZoneHandling> dateTimeZoneHandling;
    // private System.Nullable`1<Newtonsoft.Json.DateParseHandling> _dateParseHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x90
    System::Nullable_1<Newtonsoft::Json::DateParseHandling> dateParseHandling;
    // private System.Nullable`1<Newtonsoft.Json.FloatFormatHandling> _floatFormatHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x98
    System::Nullable_1<Newtonsoft::Json::FloatFormatHandling> floatFormatHandling;
    // private System.Nullable`1<Newtonsoft.Json.FloatParseHandling> _floatParseHandling
    // Size: 0xFFFFFFFF
    // Offset: 0xA0
    System::Nullable_1<Newtonsoft::Json::FloatParseHandling> floatParseHandling;
    // private System.Nullable`1<Newtonsoft.Json.StringEscapeHandling> _stringEscapeHandling
    // Size: 0xFFFFFFFF
    // Offset: 0xA8
    System::Nullable_1<Newtonsoft::Json::StringEscapeHandling> stringEscapeHandling;
    // private System.Globalization.CultureInfo _culture
    // Size: 0x8
    // Offset: 0xB0
    System::Globalization::CultureInfo* culture;
    // Field size check
    static_assert(sizeof(System::Globalization::CultureInfo*) == 0x8);
    // private System.Nullable`1<System.Int32> _maxDepth
    // Size: 0xFFFFFFFF
    // Offset: 0xB8
    System::Nullable_1<int> maxDepth;
    // private System.Boolean _maxDepthSet
    // Size: 0x1
    // Offset: 0xC0
    bool maxDepthSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Boolean> _checkAdditionalContent
    // Size: 0xFFFFFFFF
    // Offset: 0xC1
    System::Nullable_1<bool> checkAdditionalContent;
    // [NullableAttribute] Offset: 0x1204098
    // private System.String _dateFormatString
    // Size: 0x8
    // Offset: 0xC8
    ::StringW dateFormatString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _dateFormatStringSet
    // Size: 0x1
    // Offset: 0xD0
    bool dateFormatStringSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [NullableAttribute] Offset: 0x12040AC
    // private System.EventHandler`1<Newtonsoft.Json.Serialization.ErrorEventArgs> Error
    // Size: 0x8
    // Offset: 0xD8
    System::EventHandler_1<Newtonsoft::Json::Serialization::ErrorEventArgs*>* Error;
    // Field size check
    static_assert(sizeof(System::EventHandler_1<Newtonsoft::Json::Serialization::ErrorEventArgs*>*) == 0x8);
    public:
    // Get instance field reference: Newtonsoft.Json.TypeNameHandling _typeNameHandling
    Newtonsoft::Json::TypeNameHandling& dyn__typeNameHandling();
    // Get instance field reference: Newtonsoft.Json.TypeNameAssemblyFormatHandling _typeNameAssemblyFormatHandling
    Newtonsoft::Json::TypeNameAssemblyFormatHandling& dyn__typeNameAssemblyFormatHandling();
    // Get instance field reference: Newtonsoft.Json.PreserveReferencesHandling _preserveReferencesHandling
    Newtonsoft::Json::PreserveReferencesHandling& dyn__preserveReferencesHandling();
    // Get instance field reference: Newtonsoft.Json.ReferenceLoopHandling _referenceLoopHandling
    Newtonsoft::Json::ReferenceLoopHandling& dyn__referenceLoopHandling();
