// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Newtonsoft.Json.JsonWriter
#include "Newtonsoft/Json/JsonWriter.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: TextWriter
  class TextWriter;
}
// Forward declaring namespace: Newtonsoft::Json::Utilities
namespace Newtonsoft::Json::Utilities {
  // Forward declaring type: Base64Encoder
  class Base64Encoder;
}
// Forward declaring namespace: Newtonsoft::Json
namespace Newtonsoft::Json {
  // Forward declaring type: IArrayPool`1<T>
  template<typename T>
  class IArrayPool_1;
  // Forward declaring type: JsonToken
  struct JsonToken;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
  // Skipping declaration: Decimal because it is already included!
  // Skipping declaration: DateTime because it is already included!
  // Skipping declaration: DateTimeOffset because it is already included!
  // Skipping declaration: Guid because it is already included!
  // Skipping declaration: TimeSpan because it is already included!
  // Forward declaring type: Uri
  class Uri;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // Forward declaring type: JsonTextWriter
  class JsonTextWriter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Newtonsoft::Json::JsonTextWriter);
DEFINE_IL2CPP_ARG_TYPE(::Newtonsoft::Json::JsonTextWriter*, "Newtonsoft.Json", "JsonTextWriter");
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: Newtonsoft.Json.JsonTextWriter
  // [TokenAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: 10C0E2C
  class JsonTextWriter : public ::Newtonsoft::Json::JsonWriter {
    public:
    public:
    // private readonly System.IO.TextWriter _writer
    // Size: 0x8
    // Offset: 0x60
    ::System::IO::TextWriter* writer;
    // Field size check
    static_assert(sizeof(::System::IO::TextWriter*) == 0x8);
    // private Newtonsoft.Json.Utilities.Base64Encoder _base64Encoder
    // Size: 0x8
    // Offset: 0x68
    ::Newtonsoft::Json::Utilities::Base64Encoder* base64Encoder;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Utilities::Base64Encoder*) == 0x8);
    // private System.Char _indentChar
    // Size: 0x2
    // Offset: 0x70
    ::Il2CppChar indentChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // Padding between fields: indentChar and: indentation
    char __padding2[0x2] = {};
    // private System.Int32 _indentation
    // Size: 0x4
    // Offset: 0x74
    int indentation;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Char _quoteChar
    // Size: 0x2
    // Offset: 0x78
    ::Il2CppChar quoteChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // private System.Boolean _quoteName
    // Size: 0x1
    // Offset: 0x7A
    bool quoteName;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: quoteName and: charEscapeFlags
    char __padding5[0x5] = {};
    // private System.Boolean[] _charEscapeFlags
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<bool> charEscapeFlags;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // private System.Char[] _writeBuffer
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::Il2CppChar> writeBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
    // private Newtonsoft.Json.IArrayPool`1<System.Char> _arrayPool
    // Size: 0x8
    // Offset: 0x90
    ::Newtonsoft::Json::IArrayPool_1<::Il2CppChar>* arrayPool;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::IArrayPool_1<::Il2CppChar>*) == 0x8);
    // private System.Char[] _indentChars
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::Il2CppChar> indentChars;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
    public:
    // Get instance field reference: private readonly System.IO.TextWriter _writer
    [[deprecated("Use field access instead!")]] ::System::IO::TextWriter*& dyn__writer();
    // Get instance field reference: private Newtonsoft.Json.Utilities.Base64Encoder _base64Encoder
    [[deprecated("Use field access instead!")]] ::Newtonsoft::Json::Utilities::Base64Encoder*& dyn__base64Encoder();
    // Get instance field reference: private System.Char _indentChar
    [[deprecated("Use field access instead!")]] ::Il2CppChar& dyn__indentChar();
    // Get instance field reference: private System.Int32 _indentation
    [[deprecated("Use field access instead!")]] int& dyn__indentation();
    // Get instance field reference: private System.Char _quoteChar
    [[deprecated("Use field access instead!")]] ::Il2CppChar& dyn__quoteChar();
