// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: Newtonsoft.Json.JsonToken
#include "Newtonsoft/Json/JsonToken.hpp"
// Including type: Newtonsoft.Json.JsonPosition
#include "Newtonsoft/Json/JsonPosition.hpp"
// Including type: Newtonsoft.Json.DateTimeZoneHandling
#include "Newtonsoft/Json/DateTimeZoneHandling.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: Newtonsoft.Json.DateParseHandling
#include "Newtonsoft/Json/DateParseHandling.hpp"
// Including type: Newtonsoft.Json.FloatParseHandling
#include "Newtonsoft/Json/FloatParseHandling.hpp"
// Including type: System.Decimal
#include "System/Decimal.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.DateTimeOffset
#include "System/DateTimeOffset.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Newtonsoft::Json
namespace Newtonsoft::Json {
  // Skipping declaration: State because it is already included!
  // Skipping declaration: JsonContainerType because it is already included!
  // Forward declaring type: JsonReaderException
  class JsonReaderException;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // Forward declaring type: JsonReader
  class JsonReader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Newtonsoft::Json::JsonReader);
DEFINE_IL2CPP_ARG_TYPE(::Newtonsoft::Json::JsonReader*, "Newtonsoft.Json", "JsonReader");
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // WARNING Size may be invalid!
  // Autogenerated type: Newtonsoft.Json.JsonReader
  // [TokenAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: 10AEBF4
  class JsonReader : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::Newtonsoft::Json::JsonReader::State
    struct State;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Newtonsoft.Json.JsonReader/Newtonsoft.Json.State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Start
      static constexpr const int Start = 0;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Start
      static ::Newtonsoft::Json::JsonReader::State _get_Start();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Start
      static void _set_Start(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Complete
      static constexpr const int Complete = 1;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Complete
      static ::Newtonsoft::Json::JsonReader::State _get_Complete();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Complete
      static void _set_Complete(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Property
      static constexpr const int Property = 2;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Property
      static ::Newtonsoft::Json::JsonReader::State _get_Property();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Property
      static void _set_Property(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State ObjectStart
      static constexpr const int ObjectStart = 3;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State ObjectStart
      static ::Newtonsoft::Json::JsonReader::State _get_ObjectStart();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State ObjectStart
      static void _set_ObjectStart(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Object
      static constexpr const int Object = 4;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Object
      static ::Newtonsoft::Json::JsonReader::State _get_Object();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Object
      static void _set_Object(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State ArrayStart
      static constexpr const int ArrayStart = 5;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State ArrayStart
      static ::Newtonsoft::Json::JsonReader::State _get_ArrayStart();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State ArrayStart
      static void _set_ArrayStart(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Array
      static constexpr const int Array = 6;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Array
      static ::Newtonsoft::Json::JsonReader::State _get_Array();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Array
      static void _set_Array(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Closed
      static constexpr const int Closed = 7;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Closed
      static ::Newtonsoft::Json::JsonReader::State _get_Closed();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Closed
      static void _set_Closed(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State PostValue
      static constexpr const int PostValue = 8;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State PostValue
      static ::Newtonsoft::Json::JsonReader::State _get_PostValue();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State PostValue
      static void _set_PostValue(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State ConstructorStart
      static constexpr const int ConstructorStart = 9;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State ConstructorStart
      static ::Newtonsoft::Json::JsonReader::State _get_ConstructorStart();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State ConstructorStart
      static void _set_ConstructorStart(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Constructor
      static constexpr const int Constructor = 10;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Constructor
      static ::Newtonsoft::Json::JsonReader::State _get_Constructor();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Constructor
      static void _set_Constructor(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Error
      static constexpr const int Error = 11;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Error
      static ::Newtonsoft::Json::JsonReader::State _get_Error();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Error
      static void _set_Error(::Newtonsoft::Json::JsonReader::State value);
      // static field const value: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Finished
      static constexpr const int Finished = 12;
      // Get static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Finished
      static ::Newtonsoft::Json::JsonReader::State _get_Finished();
      // Set static field: static public Newtonsoft.Json.JsonReader/Newtonsoft.Json.State Finished
      static void _set_Finished(::Newtonsoft::Json::JsonReader::State value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Newtonsoft.Json.JsonReader/Newtonsoft.Json.State
    #pragma pack(pop)
    static check_size<sizeof(JsonReader::State), 0 + sizeof(int)> __Newtonsoft_Json_JsonReader_StateSizeCheck;
    static_assert(sizeof(JsonReader::State) == 0x4);
    public:
    // private Newtonsoft.Json.JsonToken _tokenType
    // Size: 0x4
    // Offset: 0x10
    ::Newtonsoft::Json::JsonToken tokenType;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::JsonToken) == 0x4);
    // private System.Object _value
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppObject* value;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Char _quoteChar
    // Size: 0x2
    // Offset: 0x20
    ::Il2CppChar quoteChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // Newtonsoft.Json.JsonReader/Newtonsoft.Json.State _currentState
    // Size: 0x4
    // Offset: 0x24
    ::Newtonsoft::Json::JsonReader::State currentState;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::JsonReader::State) == 0x4);
    // private Newtonsoft.Json.JsonPosition _currentPosition
    // Size: 0x11
    // Offset: 0x28
    ::Newtonsoft::Json::JsonPosition currentPosition;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::JsonPosition) == 0x11);
    // private System.Globalization.CultureInfo _culture
    // Size: 0x8
    // Offset: 0x40
    ::System::Globalization::CultureInfo* culture;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureInfo*) == 0x8);
    // private Newtonsoft.Json.DateTimeZoneHandling _dateTimeZoneHandling
    // Size: 0x4
    // Offset: 0x48
    ::Newtonsoft::Json::DateTimeZoneHandling dateTimeZoneHandling;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::DateTimeZoneHandling) == 0x4);
    // private System.Nullable`1<System.Int32> _maxDepth
    // Size: 0xFFFFFFFF
    // Offset: 0x4C
    ::System::Nullable_1<int> maxDepth;
    // private System.Boolean _hasExceededMaxDepth
    // Size: 0x1
    // Offset: 0x54
    bool hasExceededMaxDepth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Newtonsoft.Json.DateParseHandling _dateParseHandling
    // Size: 0x4
    // Offset: 0x58
    ::Newtonsoft::Json::DateParseHandling dateParseHandling;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::DateParseHandling) == 0x4);
    // Newtonsoft.Json.FloatParseHandling _floatParseHandling
    // Size: 0x4
    // Offset: 0x5C
    ::Newtonsoft::Json::FloatParseHandling floatParseHandling;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::FloatParseHandling) == 0x4);
    // private System.String _dateFormatString
    // Size: 0x8
    // Offset: 0x60
    ::StringW dateFormatString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.List`1<Newtonsoft.Json.JsonPosition> _stack
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::Newtonsoft::Json::JsonPosition>* stack;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Newtonsoft::Json::JsonPosition>*) == 0x8);
    // private System.Boolean <CloseInput>k__BackingField
    // Size: 0x1
    // Offset: 0x70
    bool CloseInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <SupportMultipleContent>k__BackingField
    // Size: 0x1
    // Offset: 0x71
    bool SupportMultipleContent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: private Newtonsoft.Json.JsonToken _tokenType
    [[deprecated("Use field access instead!")]] ::Newtonsoft::Json::JsonToken& dyn__tokenType();
    // Get instance field reference: private System.Object _value
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn__value();
    // Get instance field reference: System.Char _quoteChar
    [[deprecated("Use field access instead!")]] ::Il2CppChar& dyn__quoteChar();
    // Get instance field reference: Newtonsoft.Json.JsonReader/Newtonsoft.Json.State _currentState
    [[deprecated("Use field access instead!")]] ::Newtonsoft::Json::JsonReader::State& dyn__currentState();
