// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Newtonsoft.Json.JsonReader
#include "Newtonsoft/Json/JsonReader.hpp"
// Including type: Newtonsoft.Json.IJsonLineInfo
#include "Newtonsoft/Json/IJsonLineInfo.hpp"
// Including type: Newtonsoft.Json.Utilities.StringBuffer
#include "Newtonsoft/Json/Utilities/StringBuffer.hpp"
// Including type: Newtonsoft.Json.Utilities.StringReference
#include "Newtonsoft/Json/Utilities/StringReference.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: TextReader
  class TextReader;
}
// Forward declaring namespace: Newtonsoft::Json
namespace Newtonsoft::Json {
  // Forward declaring type: IArrayPool`1<T>
  class IArrayPool_1;
  // Forward declaring type: JsonNameTable
  class JsonNameTable;
  // Forward declaring type: ReadType
  struct ReadType;
  // Forward declaring type: JsonReaderException
  class JsonReaderException;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
  // Skipping declaration: Nullable`1 because it is already included!
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // Forward declaring type: JsonTextReader
  class JsonTextReader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(Newtonsoft::Json::JsonTextReader);
DEFINE_IL2CPP_ARG_TYPE(Newtonsoft::Json::JsonTextReader*, "Newtonsoft.Json", "JsonTextReader");
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // WARNING Size may be invalid!
  // Autogenerated type: Newtonsoft.Json.JsonTextReader
  // [TokenAttribute] Offset: FFFFFFFF
  // [NullableContextAttribute] Offset: 1201900
  // [NullableAttribute] Offset: 1201900
  class JsonTextReader : public Newtonsoft::Json::JsonReader/*, public Newtonsoft::Json::IJsonLineInfo*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly System.Boolean _safeAsync
    // Size: 0x1
    // Offset: 0x72
    bool safeAsync;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.IO.TextReader _reader
    // Size: 0x8
    // Offset: 0x78
    System::IO::TextReader* reader;
    // Field size check
    static_assert(sizeof(System::IO::TextReader*) == 0x8);
    // [NullableAttribute] Offset: 0x1204244
    // private System.Char[] _chars
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::Il2CppChar> chars;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
    // private System.Int32 _charsUsed
    // Size: 0x4
    // Offset: 0x88
    int charsUsed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _charPos
    // Size: 0x4
    // Offset: 0x8C
    int charPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _lineStartPos
    // Size: 0x4
    // Offset: 0x90
    int lineStartPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _lineNumber
    // Size: 0x4
    // Offset: 0x94
    int lineNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _isEndOfFile
    // Size: 0x1
    // Offset: 0x98
    bool isEndOfFile;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Newtonsoft.Json.Utilities.StringBuffer _stringBuffer
    // Size: 0xC
    // Offset: 0xA0
    Newtonsoft::Json::Utilities::StringBuffer stringBuffer;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Utilities::StringBuffer) == 0xC);
    // private Newtonsoft.Json.Utilities.StringReference _stringReference
    // Size: 0x10
    // Offset: 0xB0
    Newtonsoft::Json::Utilities::StringReference stringReference;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::Utilities::StringReference) == 0x10);
    // [NullableAttribute] Offset: 0x1204258
    // private Newtonsoft.Json.IArrayPool`1<System.Char> _arrayPool
    // Size: 0x8
    // Offset: 0xC0
    Newtonsoft::Json::IArrayPool_1<::Il2CppChar>* arrayPool;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::IArrayPool_1<::Il2CppChar>*) == 0x8);
    // [NullableAttribute] Offset: 0x120426C
    // private Newtonsoft.Json.JsonNameTable <PropertyNameTable>k__BackingField
    // Size: 0x8
    // Offset: 0xC8
    Newtonsoft::Json::JsonNameTable* PropertyNameTable;
    // Field size check
    static_assert(sizeof(Newtonsoft::Json::JsonNameTable*) == 0x8);
    public:
    // Creating interface conversion operator: operator Newtonsoft::Json::IJsonLineInfo
    operator Newtonsoft::Json::IJsonLineInfo() noexcept {
      return *reinterpret_cast<Newtonsoft::Json::IJsonLineInfo*>(this);
    }
    // Get instance field reference: private readonly System.Boolean _safeAsync
    bool& dyn__safeAsync();
    // Get instance field reference: private readonly System.IO.TextReader _reader
    System::IO::TextReader*& dyn__reader();
    // Get instance field reference: private System.Char[] _chars
    ::ArrayW<::Il2CppChar>& dyn__chars();
    // Get instance field reference: private System.Int32 _charsUsed
    int& dyn__charsUsed();
    // Get instance field reference: private System.Int32 _charPos
    int& dyn__charPos();
