// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: Newtonsoft.Json.Formatting
#include "Newtonsoft/Json/Formatting.hpp"
// Including type: Newtonsoft.Json.DateFormatHandling
#include "Newtonsoft/Json/DateFormatHandling.hpp"
// Including type: Newtonsoft.Json.DateTimeZoneHandling
#include "Newtonsoft/Json/DateTimeZoneHandling.hpp"
// Including type: Newtonsoft.Json.DateParseHandling
#include "Newtonsoft/Json/DateParseHandling.hpp"
// Including type: Newtonsoft.Json.FloatFormatHandling
#include "Newtonsoft/Json/FloatFormatHandling.hpp"
// Including type: Newtonsoft.Json.FloatParseHandling
#include "Newtonsoft/Json/FloatParseHandling.hpp"
// Including type: Newtonsoft.Json.StringEscapeHandling
#include "Newtonsoft/Json/StringEscapeHandling.hpp"
// Including type: System.Runtime.Serialization.Formatters.FormatterAssemblyStyle
#include "System/Runtime/Serialization/Formatters/FormatterAssemblyStyle.hpp"
// Including type: Newtonsoft.Json.DefaultValueHandling
#include "Newtonsoft/Json/DefaultValueHandling.hpp"
// Including type: Newtonsoft.Json.PreserveReferencesHandling
#include "Newtonsoft/Json/PreserveReferencesHandling.hpp"
// Including type: Newtonsoft.Json.NullValueHandling

// Including type: Newtonsoft.Json.ReferenceLoopHandling
#include "Newtonsoft/Json/ReferenceLoopHandling.hpp"
// Including type: System.Runtime.Serialization.StreamingContext
#include "System/Runtime/Serialization/StreamingContext.hpp"
// Including type: Newtonsoft.Json.ConstructorHandling
#include "Newtonsoft/Json/ConstructorHandling.hpp"
// Including type: Newtonsoft.Json.TypeNameHandling
#include "Newtonsoft/Json/TypeNameHandling.hpp"
// Including type: Newtonsoft.Json.MetadataPropertyHandling
#include "Newtonsoft/Json/MetadataPropertyHandling.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Newtonsoft::Json
namespace Newtonsoft::Json {
  // Forward declaring type: JsonConverter
  class JsonConverter;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Forward declaring namespace: Newtonsoft::Json::Serialization
namespace Newtonsoft::Json::Serialization {
  // Forward declaring type: IContractResolver
  class IContractResolver;
  // Forward declaring type: IReferenceResolver
  class IReferenceResolver;
  // Forward declaring type: ITraceWriter
  class ITraceWriter;
  // Forward declaring type: ErrorEventArgs
  class ErrorEventArgs;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEqualityComparer
  class IEqualityComparer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationBinder
  class SerializationBinder;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // Forward declaring type: JsonSerializerSettings
  class JsonSerializerSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Newtonsoft::Json::JsonSerializerSettings);
DEFINE_IL2CPP_ARG_TYPE(::Newtonsoft::Json::JsonSerializerSettings*, "Newtonsoft.Json", "JsonSerializerSettings");
// Type namespace: Newtonsoft.Json
namespace Newtonsoft::Json {
  // WARNING Size may be invalid!
  // Autogenerated type: Newtonsoft.Json.JsonSerializerSettings
  // [TokenAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: 10B15D4
  class JsonSerializerSettings : public ::Il2CppObject {
    public:
    // Nested type: ::Newtonsoft::Json::JsonSerializerSettings::$$c__DisplayClass90_0
    class $$c__DisplayClass90_0;
    public:
    // System.Nullable`1<Newtonsoft.Json.Formatting> _formatting
    // Size: 0xFFFFFFFF
    // Offset: 0x10
    ::System::Nullable_1<::Newtonsoft::Json::Formatting> formatting;
    // System.Nullable`1<Newtonsoft.Json.DateFormatHandling> _dateFormatHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x18
    ::System::Nullable_1<::Newtonsoft::Json::DateFormatHandling> dateFormatHandling;
    // System.Nullable`1<Newtonsoft.Json.DateTimeZoneHandling> _dateTimeZoneHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x20
    ::System::Nullable_1<::Newtonsoft::Json::DateTimeZoneHandling> dateTimeZoneHandling;
    // System.Nullable`1<Newtonsoft.Json.DateParseHandling> _dateParseHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x28
    ::System::Nullable_1<::Newtonsoft::Json::DateParseHandling> dateParseHandling;
    // System.Nullable`1<Newtonsoft.Json.FloatFormatHandling> _floatFormatHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x30
    ::System::Nullable_1<::Newtonsoft::Json::FloatFormatHandling> floatFormatHandling;
    // System.Nullable`1<Newtonsoft.Json.FloatParseHandling> _floatParseHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x38
    ::System::Nullable_1<::Newtonsoft::Json::FloatParseHandling> floatParseHandling;
    // System.Nullable`1<Newtonsoft.Json.StringEscapeHandling> _stringEscapeHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x40
    ::System::Nullable_1<::Newtonsoft::Json::StringEscapeHandling> stringEscapeHandling;
    // System.Globalization.CultureInfo _culture
    // Size: 0x8
    // Offset: 0x48
    ::System::Globalization::CultureInfo* culture;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureInfo*) == 0x8);
    // System.Nullable`1<System.Boolean> _checkAdditionalContent
    // Size: 0xFFFFFFFF
    // Offset: 0x50
    ::System::Nullable_1<bool> checkAdditionalContent;
    // System.Nullable`1<System.Int32> _maxDepth
    // Size: 0xFFFFFFFF
    // Offset: 0x54
    ::System::Nullable_1<int> maxDepth;
    // System.Boolean _maxDepthSet
    // Size: 0x1
    // Offset: 0x5C
    bool maxDepthSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.String _dateFormatString
    // Size: 0x8
    // Offset: 0x60
    ::StringW dateFormatString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Boolean _dateFormatStringSet
    // Size: 0x1
    // Offset: 0x68
    bool dateFormatStringSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Nullable`1<System.Runtime.Serialization.Formatters.FormatterAssemblyStyle> _typeNameAssemblyFormat
    // Size: 0xFFFFFFFF
    // Offset: 0x6C
    ::System::Nullable_1<::System::Runtime::Serialization::Formatters::FormatterAssemblyStyle> typeNameAssemblyFormat;
    // System.Nullable`1<Newtonsoft.Json.DefaultValueHandling> _defaultValueHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x74
    ::System::Nullable_1<::Newtonsoft::Json::DefaultValueHandling> defaultValueHandling;
    // System.Nullable`1<Newtonsoft.Json.PreserveReferencesHandling> _preserveReferencesHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x7C
    ::System::Nullable_1<::Newtonsoft::Json::PreserveReferencesHandling> preserveReferencesHandling;
    // System.Nullable`1<Newtonsoft.Json.NullValueHandling> _nullValueHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x84
    ::System::Nullable_1<::Newtonsoft::Json::NullValueHandling> nullValueHandling;
    // System.Nullable`1<Newtonsoft.Json.ObjectCreationHandling> _objectCreationHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x8C
    ::System::Nullable_1<::Newtonsoft::Json::ObjectCreationHandling> objectCreationHandling;
    // System.Nullable`1<Newtonsoft.Json.MissingMemberHandling> _missingMemberHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x94
    ::System::Nullable_1<::Newtonsoft::Json::MissingMemberHandling> missingMemberHandling;
    // System.Nullable`1<Newtonsoft.Json.ReferenceLoopHandling> _referenceLoopHandling
    // Size: 0xFFFFFFFF
    // Offset: 0x9C
    ::System::Nullable_1<::Newtonsoft::Json::ReferenceLoopHandling> referenceLoopHandling;
    // System.Nullable`1<System.Runtime.Serialization.StreamingContext> _context
    // Size: 0xFFFFFFFF
    // Offset: 0xA8
    ::System::Nullable_1<::System::Runtime::Serialization::StreamingContext> context;
    // System.Nullable`1<Newtonsoft.Json.ConstructorHandling> _constructorHandling
    // Size: 0xFFFFFFFF
    // Offset: 0xC0
    ::System::Nullable_1<::Newtonsoft::Json::ConstructorHandling> constructorHandling;
    // System.Nullable`1<Newtonsoft.Json.TypeNameHandling> _typeNameHandling
    // Size: 0xFFFFFFFF
    // Offset: 0xC8
    ::System::Nullable_1<::Newtonsoft::Json::TypeNameHandling> typeNameHandling;
    // System.Nullable`1<Newtonsoft.Json.MetadataPropertyHandling> _metadataPropertyHandling
    // Size: 0xFFFFFFFF
    // Offset: 0xD0
    ::System::Nullable_1<::Newtonsoft::Json::MetadataPropertyHandling> metadataPropertyHandling;
    // private System.Collections.Generic.IList`1<Newtonsoft.Json.JsonConverter> <Converters>k__BackingField
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::IList_1<::Newtonsoft::Json::JsonConverter*>* Converters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::Newtonsoft::Json::JsonConverter*>*) == 0x8);
    // private Newtonsoft.Json.Serialization.IContractResolver <ContractResolver>k__BackingField
    // Size: 0x8
    // Offset: 0xE0
    ::Newtonsoft::Json::Serialization::IContractResolver* ContractResolver;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Serialization::IContractResolver*) == 0x8);
    // private System.Collections.IEqualityComparer <EqualityComparer>k__BackingField
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::IEqualityComparer* EqualityComparer;
    // Field size check
    static_assert(sizeof(::System::Collections::IEqualityComparer*) == 0x8);
    // private System.Func`1<Newtonsoft.Json.Serialization.IReferenceResolver> <ReferenceResolverProvider>k__BackingField
    // Size: 0x8
    // Offset: 0xF0
    ::System::Func_1<::Newtonsoft::Json::Serialization::IReferenceResolver*>* ReferenceResolverProvider;
    // Field size check
    static_assert(sizeof(::System::Func_1<::Newtonsoft::Json::Serialization::IReferenceResolver*>*) == 0x8);
    // private Newtonsoft.Json.Serialization.ITraceWriter <TraceWriter>k__BackingField
    // Size: 0x8
    // Offset: 0xF8
    ::Newtonsoft::Json::Serialization::ITraceWriter* TraceWriter;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Serialization::ITraceWriter*) == 0x8);
    // private System.Runtime.Serialization.SerializationBinder <Binder>k__BackingField
    // Size: 0x8
    // Offset: 0x100
    ::System::Runtime::Serialization::SerializationBinder* Binder;
    // Field size check
    static_assert(sizeof(::System::Runtime::Serialization::SerializationBinder*) == 0x8);
    // private System.EventHandler`1<Newtonsoft.Json.Serialization.ErrorEventArgs> <Error>k__BackingField
    // Size: 0x8
    // Offset: 0x108
    ::System::EventHandler_1<::Newtonsoft::Json::Serialization::ErrorEventArgs*>* Error;
    // Field size check
    static_assert(sizeof(::System::EventHandler_1<::Newtonsoft::Json::Serialization::ErrorEventArgs*>*) == 0x8);
    public:
    // Get static field: static readonly System.Runtime.Serialization.StreamingContext DefaultContext
    static ::System::Runtime::Serialization::StreamingContext _get_DefaultContext();
    // Set static field: static readonly System.Runtime.Serialization.StreamingContext DefaultContext
    static void _set_DefaultContext(::System::Runtime::Serialization::StreamingContext value);
    // Get static field: static readonly System.Globalization.CultureInfo DefaultCulture
    static ::System::Globalization::CultureInfo* _get_DefaultCulture();
    // Set static field: static readonly System.Globalization.CultureInfo DefaultCulture
    static void _set_DefaultCulture(::System::Globalization::CultureInfo* value);
