// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net::Http::Headers
namespace System::Net::Http::Headers {
  // Forward declaring type: HttpRequestHeaders
  class HttpRequestHeaders;
}
// Forward declaring namespace: System::Net::Http
namespace System::Net::Http {
  // Forward declaring type: HttpMethod
  class HttpMethod;
  // Forward declaring type: HttpContent
  class HttpContent;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: Uri
  class Uri;
}
// Completed forward declares
// Type namespace: System.Net.Http
namespace System::Net::Http {
  // Size: 0x40
  // Autogenerated type: System.Net.Http.HttpRequestMessage
  // [] Offset: FFFFFFFF
  class HttpRequestMessage : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // private System.Net.Http.Headers.HttpRequestHeaders headers
    // Size: 0x8
    // Offset: 0x10
    System::Net::Http::Headers::HttpRequestHeaders* headers;
    // Field size check
    static_assert(sizeof(System::Net::Http::Headers::HttpRequestHeaders*) == 0x8);
    // private System.Net.Http.HttpMethod method
    // Size: 0x8
    // Offset: 0x18
    System::Net::Http::HttpMethod* method;
    // Field size check
    static_assert(sizeof(System::Net::Http::HttpMethod*) == 0x8);
    // private System.Version version
    // Size: 0x8
    // Offset: 0x20
    System::Version* version;
    // Field size check
    static_assert(sizeof(System::Version*) == 0x8);
    // private System.Uri uri
    // Size: 0x8
    // Offset: 0x28
    System::Uri* uri;
    // Field size check
    static_assert(sizeof(System::Uri*) == 0x8);
    // private System.Boolean is_used
    // Size: 0x1
    // Offset: 0x30
    bool is_used;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean disposed
    // Size: 0x1
    // Offset: 0x31
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disposed and: Content
    private: char __padding5[0x6] = {};
    public:
    // [CompilerGeneratedAttribute] Offset: 0xD9BF08
    // private System.Net.Http.HttpContent <Content>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    System::Net::Http::HttpContent* Content;
    // Field size check
    static_assert(sizeof(System::Net::Http::HttpContent*) == 0x8);
    // Creating value type constructor for type: HttpRequestMessage
    HttpRequestMessage(System::Net::Http::Headers::HttpRequestHeaders* headers_ = {}, System::Net::Http::HttpMethod* method_ = {}, System::Version* version_ = {}, System::Uri* uri_ = {}, bool is_used_ = {}, bool disposed_ = {}, System::Net::Http::HttpContent* Content_ = {}) noexcept : headers{headers_}, method{method_}, version{version_}, uri{uri_}, is_used{is_used_}, disposed{disposed_}, Content{Content_} {}
    // Creating interface conversion operator: operator System::IDisposable
    operator System::IDisposable() noexcept {
      return *reinterpret_cast<System::IDisposable*>(this);
    }
    // public System.Void .ctor(System.Net.Http.HttpMethod method, System.String requestUri)
    // Offset: 0x120BBB4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static HttpRequestMessage* New_ctor(System::Net::Http::HttpMethod* method, ::Il2CppString* requestUri) {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Net::Http").WithContext("HttpRequestMessage").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<HttpRequestMessage*, creationType>(method, requestUri)));
    }
    // public System.Void .ctor(System.Net.Http.HttpMethod method, System.Uri requestUri)
    // Offset: 0x12104FC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static HttpRequestMessage* New_ctor(System::Net::Http::HttpMethod* method, System::Uri* requestUri) {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Net::Http").WithContext("HttpRequestMessage").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<HttpRequestMessage*, creationType>(method, requestUri)));
    }
    // public System.Net.Http.HttpContent get_Content()
    // Offset: 0x12105FC
    System::Net::Http::HttpContent* get_Content();
    // public System.Net.Http.Headers.HttpRequestHeaders get_Headers()
    // Offset: 0x120C074
    System::Net::Http::Headers::HttpRequestHeaders* get_Headers();
    // public System.Net.Http.HttpMethod get_Method()
    // Offset: 0x1210604
    System::Net::Http::HttpMethod* get_Method();
    // public System.Void set_Method(System.Net.Http.HttpMethod value)
    // Offset: 0x1210544
    void set_Method(System::Net::Http::HttpMethod* value);
    // public System.Uri get_RequestUri()
    // Offset: 0x121060C
    System::Uri* get_RequestUri();
    // public System.Void set_RequestUri(System.Uri value)
    // Offset: 0x120BF88
    void set_RequestUri(System::Uri* value);
    // static private System.Boolean IsAllowedAbsoluteUri(System.Uri uri)
    // Offset: 0x1210614
    static bool IsAllowedAbsoluteUri(System::Uri* uri);
    // public System.Version get_Version()
    // Offset: 0x120D900
    System::Version* get_Version();
    // protected System.Void Dispose(System.Boolean disposing)
    // Offset: 0x121078C
    void Dispose(bool disposing);
    // System.Boolean SetIsUsed()
    // Offset: 0x120BF68
    bool SetIsUsed();
    // public System.Void Dispose()
    // Offset: 0x121077C
    // Implemented from: System.IDisposable
    // Base method: System.Void IDisposable::Dispose()
    void Dispose();
    // Creating proxy method: System_IDisposable_Dispose
    // Maps to method: Dispose
    void System_IDisposable_Dispose();
    // public override System.String ToString()
    // Offset: 0x12107C0
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::Il2CppString* ToString();
  }; // System.Net.Http.HttpRequestMessage
  static check_size<sizeof(HttpRequestMessage), 56 + sizeof(System::Net::Http::HttpContent*)> __System_Net_Http_HttpRequestMessageSizeCheck;
  static_assert(sizeof(HttpRequestMessage) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(System::Net::Http::HttpRequestMessage*, "System.Net.Http", "HttpRequestMessage");
#pragma pack(pop)
