// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TestTools::Logging
namespace UnityEngine::TestTools::Logging {
  // Forward declaring type: LogMatch
  class LogMatch;
  // Forward declaring type: LogEvent
  class LogEvent;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: LogType
  struct LogType;
}
// Completed forward declares
// Type namespace: UnityEngine.TestTools.Logging
namespace UnityEngine::TestTools::Logging {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.TestTools.Logging.LogScope
  // [TokenAttribute] Offset: FFFFFFFF
  class LogScope : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // Nested type: UnityEngine::TestTools::Logging::LogScope::$$c
    class $$c;
    // private readonly System.Object m_Lock
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppObject* m_Lock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean m_Disposed
    // Size: 0x1
    // Offset: 0x18
    bool m_Disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_NeedToProcessLogs
    // Size: 0x1
    // Offset: 0x19
    bool m_NeedToProcessLogs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_NeedToProcessLogs and: ExpectedLogs
    char __padding2[0x6] = {};
    // private System.Collections.Generic.Queue`1<UnityEngine.TestTools.Logging.LogMatch> <ExpectedLogs>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    System::Collections::Generic::Queue_1<UnityEngine::TestTools::Logging::LogMatch*>* ExpectedLogs;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Queue_1<UnityEngine::TestTools::Logging::LogMatch*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.TestTools.Logging.LogEvent> <AllLogs>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Generic::List_1<UnityEngine::TestTools::Logging::LogEvent*>* AllLogs;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::TestTools::Logging::LogEvent*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.TestTools.Logging.LogEvent> <FailingLogs>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    System::Collections::Generic::List_1<UnityEngine::TestTools::Logging::LogEvent*>* FailingLogs;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::TestTools::Logging::LogEvent*>*) == 0x8);
    // private System.Boolean <IgnoreFailingMessages>k__BackingField
    // Size: 0x1
    // Offset: 0x38
    bool IgnoreFailingMessages;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsNUnitException>k__BackingField
    // Size: 0x1
    // Offset: 0x39
    bool IsNUnitException;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsNUnitSuccessException>k__BackingField
    // Size: 0x1
    // Offset: 0x3A
    bool IsNUnitSuccessException;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsNUnitInconclusiveException>k__BackingField
    // Size: 0x1
    // Offset: 0x3B
    bool IsNUnitInconclusiveException;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsNUnitIgnoreException>k__BackingField
    // Size: 0x1
    // Offset: 0x3C
    bool IsNUnitIgnoreException;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsNUnitIgnoreException and: NUnitExceptionMessage
    char __padding10[0x3] = {};
    // private System.String <NUnitExceptionMessage>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* NUnitExceptionMessage;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: LogScope
