// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Net.Sockets.AddressFamily
#include "System/Net/Sockets/AddressFamily.hpp"
// Including type: System.Net.Sockets.SocketType
#include "System/Net/Sockets/SocketType.hpp"
// Including type: System.Net.Sockets.ProtocolType
#include "System/Net/Sockets/ProtocolType.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.ArraySegment`1
#include "System/ArraySegment_1.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: SafeSocketHandle
  class SafeSocketHandle;
  // Forward declaring type: SocketFlags
  struct SocketFlags;
  // Forward declaring type: IPProtectionLevel
  struct IPProtectionLevel;
  // Forward declaring type: SocketShutdown
  struct SocketShutdown;
  // Forward declaring type: SelectMode
  struct SelectMode;
  // Forward declaring type: SocketAsyncResult
  class SocketAsyncResult;
  // Forward declaring type: SocketError
  struct SocketError;
  // Forward declaring type: SocketOptionLevel
  struct SocketOptionLevel;
  // Forward declaring type: SocketOptionName
  struct SocketOptionName;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: EndPoint
  class EndPoint;
  // Forward declaring type: SocketAddress
  class SocketAddress;
  // Forward declaring type: IPAddress
  class IPAddress;
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: SemaphoreSlim
  class SemaphoreSlim;
  // Forward declaring type: Thread
  class Thread;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: IOAsyncCallback
  class IOAsyncCallback;
  // Forward declaring type: IntPtr
  struct IntPtr;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: IOSelectorJob
  class IOSelectorJob;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Skipping declaration: IList`1 because it is already included!
}
// Forward declaring namespace: System::Net::NetworkInformation
namespace System::Net::NetworkInformation {
  // Forward declaring type: NetworkInterfaceComponent
  struct NetworkInterfaceComponent;
}
// Completed forward declares
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Autogenerated type: System.Net.Sockets.Socket
  class Socket : public ::Il2CppObject, public System::IDisposable {
    public:
    // Nested type: System::Net::Sockets::Socket::WSABUF
    struct WSABUF;
    // Nested type: System::Net::Sockets::Socket::$$c
    class $$c;
    // Nested type: System::Net::Sockets::Socket::$$c__DisplayClass242_0
    class $$c__DisplayClass242_0;
    // Nested type: System::Net::Sockets::Socket::$$c__DisplayClass298_0
    class $$c__DisplayClass298_0;
    // private System.Boolean is_closed
    // Offset: 0x10
    bool is_closed;
    // private System.Boolean is_listening
    // Offset: 0x11
    bool is_listening;
    // private System.Boolean useOverlappedIO
    // Offset: 0x12
    bool useOverlappedIO;
    // private System.Int32 linger_timeout
    // Offset: 0x14
    int linger_timeout;
    // private System.Net.Sockets.AddressFamily addressFamily
    // Offset: 0x18
    System::Net::Sockets::AddressFamily addressFamily;
    // private System.Net.Sockets.SocketType socketType
    // Offset: 0x1C
    System::Net::Sockets::SocketType socketType;
    // private System.Net.Sockets.ProtocolType protocolType
    // Offset: 0x20
    System::Net::Sockets::ProtocolType protocolType;
    // System.Net.Sockets.SafeSocketHandle m_Handle
    // Offset: 0x28
    System::Net::Sockets::SafeSocketHandle* m_Handle;
    // System.Net.EndPoint seed_endpoint
    // Offset: 0x30
    System::Net::EndPoint* seed_endpoint;
    // System.Threading.SemaphoreSlim ReadSem
    // Offset: 0x38
    System::Threading::SemaphoreSlim* ReadSem;
    // System.Threading.SemaphoreSlim WriteSem
    // Offset: 0x40
    System::Threading::SemaphoreSlim* WriteSem;
    // System.Boolean is_blocking
    // Offset: 0x48
    bool is_blocking;
    // System.Boolean is_bound
    // Offset: 0x49
    bool is_bound;
    // System.Boolean is_connected
    // Offset: 0x4A
    bool is_connected;
    // private System.Int32 m_IntCleanedUp
    // Offset: 0x4C
    int m_IntCleanedUp;
    // System.Boolean connect_in_progress
    // Offset: 0x50
    bool connect_in_progress;
    // Get static field: static private System.Object s_InternalSyncObject
    static ::Il2CppObject* _get_s_InternalSyncObject();
    // Set static field: static private System.Object s_InternalSyncObject
    static void _set_s_InternalSyncObject(::Il2CppObject* value);
    // Get static field: static System.Boolean s_SupportsIPv4
    static bool _get_s_SupportsIPv4();
    // Set static field: static System.Boolean s_SupportsIPv4
    static void _set_s_SupportsIPv4(bool value);
    // Get static field: static System.Boolean s_SupportsIPv6
    static bool _get_s_SupportsIPv6();
    // Set static field: static System.Boolean s_SupportsIPv6
    static void _set_s_SupportsIPv6(bool value);
    // Get static field: static System.Boolean s_OSSupportsIPv6
    static bool _get_s_OSSupportsIPv6();
    // Set static field: static System.Boolean s_OSSupportsIPv6
    static void _set_s_OSSupportsIPv6(bool value);
