// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Net.Sockets.AddressFamily
#include "System/Net/Sockets/AddressFamily.hpp"
// Including type: System.Net.Sockets.SocketType
#include "System/Net/Sockets/SocketType.hpp"
// Including type: System.Net.Sockets.ProtocolType
#include "System/Net/Sockets/ProtocolType.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.ArraySegment`1
#include "System/ArraySegment_1.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: SafeSocketHandle
  class SafeSocketHandle;
  // Forward declaring type: SocketFlags
  struct SocketFlags;
  // Forward declaring type: IOControlCode
  struct IOControlCode;
  // Forward declaring type: IPProtectionLevel
  struct IPProtectionLevel;
  // Forward declaring type: SocketShutdown
  struct SocketShutdown;
  // Forward declaring type: SelectMode
  struct SelectMode;
  // Forward declaring type: SocketAsyncEventArgs
  class SocketAsyncEventArgs;
  // Forward declaring type: SocketAsyncResult
  class SocketAsyncResult;
  // Forward declaring type: SocketError
  struct SocketError;
  // Forward declaring type: SocketOptionLevel
  struct SocketOptionLevel;
  // Forward declaring type: SocketOptionName
  struct SocketOptionName;
  // Forward declaring type: SocketOperation
  struct SocketOperation;
  // Forward declaring type: SocketAsyncOperation
  struct SocketAsyncOperation;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: EndPoint
  class EndPoint;
  // Forward declaring type: SocketAddress
  class SocketAddress;
  // Forward declaring type: IPAddress
  class IPAddress;
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: SemaphoreSlim
  class SemaphoreSlim;
  // Forward declaring type: Thread
  class Thread;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: IOAsyncCallback
  class IOAsyncCallback;
  // Forward declaring type: IntPtr
  struct IntPtr;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: IOSelectorJob
  class IOSelectorJob;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Skipping declaration: IList`1 because it is already included!
}
// Forward declaring namespace: System::Net::NetworkInformation
namespace System::Net::NetworkInformation {
  // Forward declaring type: NetworkInterfaceComponent
  struct NetworkInterfaceComponent;
}
// Completed forward declares
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Size: 0x51
  // Autogenerated type: System.Net.Sockets.Socket
  // [] Offset: FFFFFFFF
  class Socket : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // Nested type: System::Net::Sockets::Socket::WSABUF
    struct WSABUF;
    // Nested type: System::Net::Sockets::Socket::$$c
    class $$c;
    // Nested type: System::Net::Sockets::Socket::$$c__DisplayClass242_0
    class $$c__DisplayClass242_0;
    // Nested type: System::Net::Sockets::Socket::$$c__DisplayClass298_0
    class $$c__DisplayClass298_0;
    // private System.Boolean is_closed
    // Size: 0x1
    // Offset: 0x10
    bool is_closed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean is_listening
    // Size: 0x1
    // Offset: 0x11
    bool is_listening;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean useOverlappedIO
    // Size: 0x1
    // Offset: 0x12
    bool useOverlappedIO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useOverlappedIO and: linger_timeout
    char __padding2[0x1] = {};
    // private System.Int32 linger_timeout
    // Size: 0x4
    // Offset: 0x14
    int linger_timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Net.Sockets.AddressFamily addressFamily
    // Size: 0x4
    // Offset: 0x18
    System::Net::Sockets::AddressFamily addressFamily;
    // Field size check
    static_assert(sizeof(System::Net::Sockets::AddressFamily) == 0x4);
    // private System.Net.Sockets.SocketType socketType
    // Size: 0x4
    // Offset: 0x1C
    System::Net::Sockets::SocketType socketType;
    // Field size check
    static_assert(sizeof(System::Net::Sockets::SocketType) == 0x4);
    // private System.Net.Sockets.ProtocolType protocolType
    // Size: 0x4
    // Offset: 0x20
    System::Net::Sockets::ProtocolType protocolType;
    // Field size check
    static_assert(sizeof(System::Net::Sockets::ProtocolType) == 0x4);
    // Padding between fields: protocolType and: m_Handle
    char __padding6[0x4] = {};
    // System.Net.Sockets.SafeSocketHandle m_Handle
    // Size: 0x8
    // Offset: 0x28
    System::Net::Sockets::SafeSocketHandle* m_Handle;
    // Field size check
    static_assert(sizeof(System::Net::Sockets::SafeSocketHandle*) == 0x8);
    // System.Net.EndPoint seed_endpoint
    // Size: 0x8
    // Offset: 0x30
    System::Net::EndPoint* seed_endpoint;
    // Field size check
    static_assert(sizeof(System::Net::EndPoint*) == 0x8);
    // System.Threading.SemaphoreSlim ReadSem
    // Size: 0x8
    // Offset: 0x38
    System::Threading::SemaphoreSlim* ReadSem;
    // Field size check
    static_assert(sizeof(System::Threading::SemaphoreSlim*) == 0x8);
    // System.Threading.SemaphoreSlim WriteSem
    // Size: 0x8
    // Offset: 0x40
    System::Threading::SemaphoreSlim* WriteSem;
    // Field size check
    static_assert(sizeof(System::Threading::SemaphoreSlim*) == 0x8);
    // System.Boolean is_blocking
    // Size: 0x1
    // Offset: 0x48
    bool is_blocking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean is_bound
    // Size: 0x1
    // Offset: 0x49
    bool is_bound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean is_connected
    // Size: 0x1
    // Offset: 0x4A
    bool is_connected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: is_connected and: m_IntCleanedUp
    char __padding13[0x1] = {};
    // private System.Int32 m_IntCleanedUp
    // Size: 0x4
    // Offset: 0x4C
    int m_IntCleanedUp;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean connect_in_progress
    // Size: 0x1
    // Offset: 0x50
    bool connect_in_progress;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: Socket
