// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Mono.Security.Protocol.Tls.CipherAlgorithmType
#include "Mono/Security/Protocol/Tls/CipherAlgorithmType.hpp"
// Including type: Mono.Security.Protocol.Tls.HashAlgorithmType
#include "Mono/Security/Protocol/Tls/HashAlgorithmType.hpp"
// Including type: Mono.Security.Protocol.Tls.ExchangeAlgorithmType
#include "Mono/Security/Protocol/Tls/ExchangeAlgorithmType.hpp"
// Including type: System.Security.Cryptography.CipherMode
#include "System/Security/Cryptography/CipherMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Security::Protocol::Tls
namespace Mono::Security::Protocol::Tls {
  // Forward declaring type: Context
  class Context;
  // Forward declaring type: ContentType
  struct ContentType;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: SymmetricAlgorithm
  class SymmetricAlgorithm;
  // Forward declaring type: ICryptoTransform
  class ICryptoTransform;
  // Forward declaring type: KeyedHashAlgorithm
  class KeyedHashAlgorithm;
  // Forward declaring type: HashAlgorithm
  class HashAlgorithm;
}
// Completed forward declares
// Type namespace: Mono.Security.Protocol.Tls
namespace Mono::Security::Protocol::Tls {
  // Forward declaring type: CipherSuite
  class CipherSuite;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Mono::Security::Protocol::Tls::CipherSuite);
DEFINE_IL2CPP_ARG_TYPE(::Mono::Security::Protocol::Tls::CipherSuite*, "Mono.Security.Protocol.Tls", "CipherSuite");
// Type namespace: Mono.Security.Protocol.Tls
namespace Mono::Security::Protocol::Tls {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: Mono.Security.Protocol.Tls.CipherSuite
  // [TokenAttribute] Offset: FFFFFFFF
  class CipherSuite : public ::Il2CppObject {
    public:
    public:
    // private System.Int16 code
    // Size: 0x2
    // Offset: 0x10
    int16_t code;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // Padding between fields: code and: name
    char __padding0[0x6] = {};
    // private System.String name
    // Size: 0x8
    // Offset: 0x18
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Mono.Security.Protocol.Tls.CipherAlgorithmType cipherAlgorithmType
    // Size: 0x4
    // Offset: 0x20
    ::Mono::Security::Protocol::Tls::CipherAlgorithmType cipherAlgorithmType;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::CipherAlgorithmType) == 0x4);
    // private Mono.Security.Protocol.Tls.HashAlgorithmType hashAlgorithmType
    // Size: 0x4
    // Offset: 0x24
    ::Mono::Security::Protocol::Tls::HashAlgorithmType hashAlgorithmType;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::HashAlgorithmType) == 0x4);
    // private Mono.Security.Protocol.Tls.ExchangeAlgorithmType exchangeAlgorithmType
    // Size: 0x4
    // Offset: 0x28
    ::Mono::Security::Protocol::Tls::ExchangeAlgorithmType exchangeAlgorithmType;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::ExchangeAlgorithmType) == 0x4);
    // private System.Boolean isExportable
    // Size: 0x1
    // Offset: 0x2C
    bool isExportable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isExportable and: cipherMode
    char __padding5[0x3] = {};
    // private System.Security.Cryptography.CipherMode cipherMode
    // Size: 0x4
    // Offset: 0x30
    ::System::Security::Cryptography::CipherMode cipherMode;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::CipherMode) == 0x4);
    // private System.Byte keyMaterialSize
    // Size: 0x1
    // Offset: 0x34
    uint8_t keyMaterialSize;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: keyMaterialSize and: keyBlockSize
    char __padding7[0x3] = {};
    // private System.Int32 keyBlockSize
    // Size: 0x4
    // Offset: 0x38
    int keyBlockSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Byte expandedKeyMaterialSize
    // Size: 0x1
    // Offset: 0x3C
    uint8_t expandedKeyMaterialSize;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: expandedKeyMaterialSize and: effectiveKeyBits
    char __padding9[0x1] = {};
    // private System.Int16 effectiveKeyBits
    // Size: 0x2
    // Offset: 0x3E
    int16_t effectiveKeyBits;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // private System.Byte ivSize
    // Size: 0x1
    // Offset: 0x40
    uint8_t ivSize;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte blockSize
    // Size: 0x1
    // Offset: 0x41
    uint8_t blockSize;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: blockSize and: context
    char __padding12[0x6] = {};
    // private Mono.Security.Protocol.Tls.Context context
    // Size: 0x8
    // Offset: 0x48
    ::Mono::Security::Protocol::Tls::Context* context;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::Context*) == 0x8);
    // private System.Security.Cryptography.SymmetricAlgorithm encryptionAlgorithm
    // Size: 0x8
    // Offset: 0x50
    ::System::Security::Cryptography::SymmetricAlgorithm* encryptionAlgorithm;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::SymmetricAlgorithm*) == 0x8);
    // private System.Security.Cryptography.ICryptoTransform encryptionCipher
    // Size: 0x8
    // Offset: 0x58
    ::System::Security::Cryptography::ICryptoTransform* encryptionCipher;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::ICryptoTransform*) == 0x8);
    // private System.Security.Cryptography.SymmetricAlgorithm decryptionAlgorithm
    // Size: 0x8
    // Offset: 0x60
    ::System::Security::Cryptography::SymmetricAlgorithm* decryptionAlgorithm;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::SymmetricAlgorithm*) == 0x8);
    // private System.Security.Cryptography.ICryptoTransform decryptionCipher
    // Size: 0x8
    // Offset: 0x68
    ::System::Security::Cryptography::ICryptoTransform* decryptionCipher;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::ICryptoTransform*) == 0x8);
    // private System.Security.Cryptography.KeyedHashAlgorithm clientHMAC
    // Size: 0x8
    // Offset: 0x70
    ::System::Security::Cryptography::KeyedHashAlgorithm* clientHMAC;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::KeyedHashAlgorithm*) == 0x8);
    // private System.Security.Cryptography.KeyedHashAlgorithm serverHMAC
    // Size: 0x8
    // Offset: 0x78
    ::System::Security::Cryptography::KeyedHashAlgorithm* serverHMAC;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::KeyedHashAlgorithm*) == 0x8);
    public:
    // Get static field: static public System.Byte[] EmptyArray
    static ::ArrayW<uint8_t> _get_EmptyArray();
    // Set static field: static public System.Byte[] EmptyArray
    static void _set_EmptyArray(::ArrayW<uint8_t> value);
    // Get instance field reference: private System.Int16 code
    [[deprecated("Use field access instead!")]] int16_t& dyn_code();
    // Get instance field reference: private System.String name
    [[deprecated("Use field access instead!")]] ::StringW& dyn_name();
    // Get instance field reference: private Mono.Security.Protocol.Tls.CipherAlgorithmType cipherAlgorithmType
    [[deprecated("Use field access instead!")]] ::Mono::Security::Protocol::Tls::CipherAlgorithmType& dyn_cipherAlgorithmType();
