// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Mono.Security.Protocol.Tls.SecurityProtocolType
#include "Mono/Security/Protocol/Tls/SecurityProtocolType.hpp"
// Including type: Mono.Security.Protocol.Tls.SecurityCompressionType
#include "Mono/Security/Protocol/Tls/SecurityCompressionType.hpp"
// Including type: Mono.Security.Protocol.Tls.Handshake.HandshakeType
#include "Mono/Security/Protocol/Tls/Handshake/HandshakeType.hpp"
// Including type: Mono.Security.Protocol.Tls.HandshakeState
#include "Mono/Security/Protocol/Tls/HandshakeState.hpp"
// Including type: System.Int16
#include "System/Int16.hpp"
// Including type: System.Int64
#include "System/Int64.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Security::Protocol::Tls
namespace Mono::Security::Protocol::Tls {
  // Forward declaring type: TlsServerSettings
  class TlsServerSettings;
  // Forward declaring type: TlsClientSettings
  class TlsClientSettings;
  // Forward declaring type: SecurityParameters
  class SecurityParameters;
  // Forward declaring type: CipherSuiteCollection
  class CipherSuiteCollection;
  // Forward declaring type: TlsStream
  class TlsStream;
  // Forward declaring type: RecordProtocol
  class RecordProtocol;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: RandomNumberGenerator
  class RandomNumberGenerator;
}
// Completed forward declares
// Type namespace: Mono.Security.Protocol.Tls
namespace Mono::Security::Protocol::Tls {
  // Forward declaring type: Context
  class Context;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Mono::Security::Protocol::Tls::Context);
DEFINE_IL2CPP_ARG_TYPE(::Mono::Security::Protocol::Tls::Context*, "Mono.Security.Protocol.Tls", "Context");
// Type namespace: Mono.Security.Protocol.Tls
namespace Mono::Security::Protocol::Tls {
  // Size: 0xE1
  #pragma pack(push, 1)
  // Autogenerated type: Mono.Security.Protocol.Tls.Context
  // [TokenAttribute] Offset: FFFFFFFF
  class Context : public ::Il2CppObject {
    public:
    public:
    // private Mono.Security.Protocol.Tls.SecurityProtocolType securityProtocol
    // Size: 0x4
    // Offset: 0x10
    ::Mono::Security::Protocol::Tls::SecurityProtocolType securityProtocol;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::SecurityProtocolType) == 0x4);
    // Padding between fields: securityProtocol and: sessionId
    char __padding0[0x4] = {};
    // private System.Byte[] sessionId
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<uint8_t> sessionId;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private Mono.Security.Protocol.Tls.SecurityCompressionType compressionMethod
    // Size: 0x4
    // Offset: 0x20
    ::Mono::Security::Protocol::Tls::SecurityCompressionType compressionMethod;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::SecurityCompressionType) == 0x4);
    // Padding between fields: compressionMethod and: serverSettings
    char __padding2[0x4] = {};
    // private Mono.Security.Protocol.Tls.TlsServerSettings serverSettings
    // Size: 0x8
    // Offset: 0x28
    ::Mono::Security::Protocol::Tls::TlsServerSettings* serverSettings;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::TlsServerSettings*) == 0x8);
    // private Mono.Security.Protocol.Tls.TlsClientSettings clientSettings
    // Size: 0x8
    // Offset: 0x30
    ::Mono::Security::Protocol::Tls::TlsClientSettings* clientSettings;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::TlsClientSettings*) == 0x8);
    // private Mono.Security.Protocol.Tls.SecurityParameters current
    // Size: 0x8
    // Offset: 0x38
    ::Mono::Security::Protocol::Tls::SecurityParameters* current;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::SecurityParameters*) == 0x8);
    // private Mono.Security.Protocol.Tls.SecurityParameters negotiating
    // Size: 0x8
    // Offset: 0x40
    ::Mono::Security::Protocol::Tls::SecurityParameters* negotiating;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::SecurityParameters*) == 0x8);
    // private Mono.Security.Protocol.Tls.SecurityParameters read
    // Size: 0x8
    // Offset: 0x48
    ::Mono::Security::Protocol::Tls::SecurityParameters* read;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::SecurityParameters*) == 0x8);
    // private Mono.Security.Protocol.Tls.SecurityParameters write
    // Size: 0x8
    // Offset: 0x50
    ::Mono::Security::Protocol::Tls::SecurityParameters* write;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::SecurityParameters*) == 0x8);
    // private Mono.Security.Protocol.Tls.CipherSuiteCollection supportedCiphers
    // Size: 0x8
    // Offset: 0x58
    ::Mono::Security::Protocol::Tls::CipherSuiteCollection* supportedCiphers;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::CipherSuiteCollection*) == 0x8);
    // private Mono.Security.Protocol.Tls.Handshake.HandshakeType lastHandshakeMsg
    // Size: 0x1
    // Offset: 0x60
    ::Mono::Security::Protocol::Tls::Handshake::HandshakeType lastHandshakeMsg;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::Handshake::HandshakeType) == 0x1);
    // Padding between fields: lastHandshakeMsg and: handshakeState
    char __padding10[0x3] = {};
    // private Mono.Security.Protocol.Tls.HandshakeState handshakeState
    // Size: 0x4
    // Offset: 0x64
    ::Mono::Security::Protocol::Tls::HandshakeState handshakeState;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::HandshakeState) == 0x4);
    // private System.Boolean abbreviatedHandshake
    // Size: 0x1
    // Offset: 0x68
    bool abbreviatedHandshake;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean receivedConnectionEnd
    // Size: 0x1
    // Offset: 0x69
    bool receivedConnectionEnd;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean sentConnectionEnd
    // Size: 0x1
    // Offset: 0x6A
    bool sentConnectionEnd;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean protocolNegotiated
    // Size: 0x1
    // Offset: 0x6B
    bool protocolNegotiated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: protocolNegotiated and: writeSequenceNumber
    char __padding15[0x4] = {};
    // private System.UInt64 writeSequenceNumber
    // Size: 0x8
    // Offset: 0x70
    uint64_t writeSequenceNumber;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.UInt64 readSequenceNumber
    // Size: 0x8
    // Offset: 0x78
    uint64_t readSequenceNumber;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.Byte[] clientRandom
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<uint8_t> clientRandom;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Byte[] serverRandom
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<uint8_t> serverRandom;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Byte[] randomCS
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<uint8_t> randomCS;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Byte[] randomSC
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<uint8_t> randomSC;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Byte[] masterSecret
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<uint8_t> masterSecret;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Byte[] clientWriteKey
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<uint8_t> clientWriteKey;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Byte[] serverWriteKey
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<uint8_t> serverWriteKey;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Byte[] clientWriteIV
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<uint8_t> clientWriteIV;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Byte[] serverWriteIV
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<uint8_t> serverWriteIV;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private Mono.Security.Protocol.Tls.TlsStream handshakeMessages
    // Size: 0x8
    // Offset: 0xC8
    ::Mono::Security::Protocol::Tls::TlsStream* handshakeMessages;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::TlsStream*) == 0x8);
    // private System.Security.Cryptography.RandomNumberGenerator random
    // Size: 0x8
    // Offset: 0xD0
    ::System::Security::Cryptography::RandomNumberGenerator* random;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::RandomNumberGenerator*) == 0x8);
    // private Mono.Security.Protocol.Tls.RecordProtocol recordProtocol
    // Size: 0x8
    // Offset: 0xD8
    ::Mono::Security::Protocol::Tls::RecordProtocol* recordProtocol;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::RecordProtocol*) == 0x8);
    // private System.Boolean <ChangeCipherSpecDone>k__BackingField
    // Size: 0x1
    // Offset: 0xE0
    bool ChangeCipherSpecDone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static System.Int16 MAX_FRAGMENT_SIZE
    static constexpr const int16_t MAX_FRAGMENT_SIZE = 16384;
    // Get static field: static System.Int16 MAX_FRAGMENT_SIZE
    static int16_t _get_MAX_FRAGMENT_SIZE();
    // Set static field: static System.Int16 MAX_FRAGMENT_SIZE
    static void _set_MAX_FRAGMENT_SIZE(int16_t value);
    // static field const value: static System.Int16 TLS1_PROTOCOL_CODE
    static constexpr const int16_t TLS1_PROTOCOL_CODE = 769;
    // Get static field: static System.Int16 TLS1_PROTOCOL_CODE
    static int16_t _get_TLS1_PROTOCOL_CODE();
    // Set static field: static System.Int16 TLS1_PROTOCOL_CODE
    static void _set_TLS1_PROTOCOL_CODE(int16_t value);
    // static field const value: static System.Int16 SSL3_PROTOCOL_CODE
    static constexpr const int16_t SSL3_PROTOCOL_CODE = 768;
