// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Mono.Security.Protocol.Tls.RecordProtocol
#include "Mono/Security/Protocol/Tls/RecordProtocol.hpp"
// Including type: System.IAsyncResult
#include "System/IAsyncResult.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
  // Forward declaring type: WaitHandle
  class WaitHandle;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult);
DEFINE_IL2CPP_ARG_TYPE(::Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*, "Mono.Security.Protocol.Tls", "RecordProtocol/ReceiveRecordAsyncResult");
// Type namespace: Mono.Security.Protocol.Tls
namespace Mono::Security::Protocol::Tls {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: Mono.Security.Protocol.Tls.RecordProtocol/Mono.Security.Protocol.Tls.ReceiveRecordAsyncResult
  // [TokenAttribute] Offset: FFFFFFFF
  class RecordProtocol::ReceiveRecordAsyncResult : public ::Il2CppObject/*, public ::System::IAsyncResult*/ {
    public:
    public:
    // private System.Object locker
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppObject* locker;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.AsyncCallback _userCallback
    // Size: 0x8
    // Offset: 0x18
    ::System::AsyncCallback* userCallback;
    // Field size check
    static_assert(sizeof(::System::AsyncCallback*) == 0x8);
    // private System.Object _userState
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* userState;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Exception _asyncException
    // Size: 0x8
    // Offset: 0x28
    ::System::Exception* asyncException;
    // Field size check
    static_assert(sizeof(::System::Exception*) == 0x8);
    // private System.Threading.ManualResetEvent handle
    // Size: 0x8
    // Offset: 0x30
    ::System::Threading::ManualResetEvent* handle;
    // Field size check
    static_assert(sizeof(::System::Threading::ManualResetEvent*) == 0x8);
    // private System.Byte[] _resultingBuffer
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<uint8_t> resultingBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.IO.Stream _record
    // Size: 0x8
    // Offset: 0x40
    ::System::IO::Stream* record;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.Boolean completed
    // Size: 0x1
    // Offset: 0x48
    bool completed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: completed and: initialBuffer
    char __padding7[0x7] = {};
    // private System.Byte[] _initialBuffer
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<uint8_t> initialBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IAsyncResult
    operator ::System::IAsyncResult() noexcept {
      return *reinterpret_cast<::System::IAsyncResult*>(this);
    }
    // Get instance field reference: private System.Object locker
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_locker();
    // Get instance field reference: private System.AsyncCallback _userCallback
    [[deprecated("Use field access instead!")]] ::System::AsyncCallback*& dyn__userCallback();
    // Get instance field reference: private System.Object _userState
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn__userState();
    // Get instance field reference: private System.Exception _asyncException
    [[deprecated("Use field access instead!")]] ::System::Exception*& dyn__asyncException();
    // Get instance field reference: private System.Threading.ManualResetEvent handle
    [[deprecated("Use field access instead!")]] ::System::Threading::ManualResetEvent*& dyn_handle();
    // Get instance field reference: private System.Byte[] _resultingBuffer
    [[deprecated("Use field access instead!")]] ::ArrayW<uint8_t>& dyn__resultingBuffer();
    // Get instance field reference: private System.IO.Stream _record
    [[deprecated("Use field access instead!")]] ::System::IO::Stream*& dyn__record();
    // Get instance field reference: private System.Boolean completed
    [[deprecated("Use field access instead!")]] bool& dyn_completed();
    // Get instance field reference: private System.Byte[] _initialBuffer
    [[deprecated("Use field access instead!")]] ::ArrayW<uint8_t>& dyn__initialBuffer();
    // public System.IO.Stream get_Record()
    // Offset: 0x110FF2C
    ::System::IO::Stream* get_Record();
    // public System.Byte[] get_ResultingBuffer()
    // Offset: 0x110FF34
    ::ArrayW<uint8_t> get_ResultingBuffer();
    // public System.Byte[] get_InitialBuffer()
    // Offset: 0x110FF3C
    ::ArrayW<uint8_t> get_InitialBuffer();
    // public System.Object get_AsyncState()
    // Offset: 0x110FF44
    ::Il2CppObject* get_AsyncState();
    // public System.Exception get_AsyncException()
    // Offset: 0x110FF4C
    ::System::Exception* get_AsyncException();
    // public System.Boolean get_CompletedWithError()
    // Offset: 0x110EA5C
    bool get_CompletedWithError();
    // public System.Threading.WaitHandle get_AsyncWaitHandle()
    // Offset: 0x110E958
    ::System::Threading::WaitHandle* get_AsyncWaitHandle();
    // public System.Boolean get_CompletedSynchronously()
    // Offset: 0x110FF54
    bool get_CompletedSynchronously();
    // public System.Boolean get_IsCompleted()
    // Offset: 0x110E8AC
    bool get_IsCompleted();
    // public System.Void .ctor(System.AsyncCallback userCallback, System.Object userState, System.Byte[] initialBuffer, System.IO.Stream record)
    // Offset: 0x110DCA4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RecordProtocol::ReceiveRecordAsyncResult* New_ctor(::System::AsyncCallback* userCallback, ::Il2CppObject* userState, ::ArrayW<uint8_t> initialBuffer, ::System::IO::Stream* record) {
      static auto ___internal__logger = ::Logger::get().WithContext("::Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RecordProtocol::ReceiveRecordAsyncResult*, creationType>(userCallback, userState, initialBuffer, record)));
    }
    // private System.Void SetComplete(System.Exception ex, System.Byte[] resultingBuffer)
    // Offset: 0x110FF5C
    void SetComplete(::System::Exception* ex, ::ArrayW<uint8_t> resultingBuffer);
    // public System.Void SetComplete(System.Exception ex)
    // Offset: 0x110E764
    void SetComplete(::System::Exception* ex);
    // public System.Void SetComplete(System.Byte[] resultingBuffer)
    // Offset: 0x110E174
    void SetComplete(::ArrayW<uint8_t> resultingBuffer);
    // public System.Void SetComplete()
    // Offset: 0x1110064
    void SetComplete();
  }; // Mono.Security.Protocol.Tls.RecordProtocol/Mono.Security.Protocol.Tls.ReceiveRecordAsyncResult
  #pragma pack(pop)
  static check_size<sizeof(RecordProtocol::ReceiveRecordAsyncResult), 80 + sizeof(::ArrayW<uint8_t>)> __Mono_Security_Protocol_Tls_RecordProtocol_ReceiveRecordAsyncResultSizeCheck;
  static_assert(sizeof(RecordProtocol::ReceiveRecordAsyncResult) == 0x58);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_Record
// Il2CppName: get_Record
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::IO::Stream* (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_Record)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "get_Record", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_ResultingBuffer
// Il2CppName: get_ResultingBuffer
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::ArrayW<uint8_t> (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_ResultingBuffer)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "get_ResultingBuffer", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_InitialBuffer
// Il2CppName: get_InitialBuffer
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::ArrayW<uint8_t> (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_InitialBuffer)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "get_InitialBuffer", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_AsyncState
// Il2CppName: get_AsyncState
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Il2CppObject* (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_AsyncState)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "get_AsyncState", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_AsyncException
// Il2CppName: get_AsyncException
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Exception* (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_AsyncException)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "get_AsyncException", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_CompletedWithError
// Il2CppName: get_CompletedWithError
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_CompletedWithError)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "get_CompletedWithError", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_AsyncWaitHandle
// Il2CppName: get_AsyncWaitHandle
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Threading::WaitHandle* (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_AsyncWaitHandle)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "get_AsyncWaitHandle", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_CompletedSynchronously
// Il2CppName: get_CompletedSynchronously
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_CompletedSynchronously)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "get_CompletedSynchronously", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_IsCompleted
// Il2CppName: get_IsCompleted
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::get_IsCompleted)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "get_IsCompleted", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::SetComplete
// Il2CppName: SetComplete
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)(::System::Exception*, ::ArrayW<uint8_t>)>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::SetComplete)> {
  static const MethodInfo* get() {
    static auto* ex = &::il2cpp_utils::GetClassFromName("System", "Exception")->byval_arg;
    static auto* resultingBuffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "SetComplete", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ex, resultingBuffer});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::SetComplete
// Il2CppName: SetComplete
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)(::System::Exception*)>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::SetComplete)> {
  static const MethodInfo* get() {
    static auto* ex = &::il2cpp_utils::GetClassFromName("System", "Exception")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "SetComplete", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ex});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::SetComplete
// Il2CppName: SetComplete
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)(::ArrayW<uint8_t>)>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::SetComplete)> {
  static const MethodInfo* get() {
    static auto* resultingBuffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "SetComplete", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{resultingBuffer});
  }
};
// Writing MetadataGetter for method: Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::SetComplete
// Il2CppName: SetComplete
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::*)()>(&Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult::SetComplete)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::Protocol::Tls::RecordProtocol::ReceiveRecordAsyncResult*), "SetComplete", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
