// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Security::Protocol::Tls
namespace Mono::Security::Protocol::Tls {
  // Forward declaring type: Context
  class Context;
  // Forward declaring type: RecordProtocol
  class RecordProtocol;
  // Forward declaring type: CipherAlgorithmType
  struct CipherAlgorithmType;
  // Forward declaring type: HashAlgorithmType
  struct HashAlgorithmType;
  // Forward declaring type: ExchangeAlgorithmType
  struct ExchangeAlgorithmType;
  // Forward declaring type: SecurityProtocolType
  struct SecurityProtocolType;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: MemoryStream
  class MemoryStream;
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509Certificate
  class X509Certificate;
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
}
// Forward declaring namespace: Mono::Security::X509
namespace Mono::Security::X509 {
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: Mono::Security::Interface
namespace Mono::Security::Interface {
  // Forward declaring type: ValidationResult
  class ValidationResult;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: AsymmetricAlgorithm
  class AsymmetricAlgorithm;
}
// Completed forward declares
// Type namespace: Mono.Security.Protocol.Tls
namespace Mono::Security::Protocol::Tls {
  // Forward declaring type: SslStreamBase
  class SslStreamBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Mono::Security::Protocol::Tls::SslStreamBase);
DEFINE_IL2CPP_ARG_TYPE(::Mono::Security::Protocol::Tls::SslStreamBase*, "Mono.Security.Protocol.Tls", "SslStreamBase");
// Type namespace: Mono.Security.Protocol.Tls
namespace Mono::Security::Protocol::Tls {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: Mono.Security.Protocol.Tls.SslStreamBase
  // [TokenAttribute] Offset: FFFFFFFF
  class SslStreamBase : public ::System::IO::Stream {
    public:
    // Nested type: ::Mono::Security::Protocol::Tls::SslStreamBase::AsyncHandshakeDelegate
    class AsyncHandshakeDelegate;
    // Nested type: ::Mono::Security::Protocol::Tls::SslStreamBase::InternalAsyncResult
    class InternalAsyncResult;
    public:
    // System.IO.Stream innerStream
    // Size: 0x8
    // Offset: 0x28
    ::System::IO::Stream* innerStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // System.IO.MemoryStream inputBuffer
    // Size: 0x8
    // Offset: 0x30
    ::System::IO::MemoryStream* inputBuffer;
    // Field size check
    static_assert(sizeof(::System::IO::MemoryStream*) == 0x8);
    // Mono.Security.Protocol.Tls.Context context
    // Size: 0x8
    // Offset: 0x38
    ::Mono::Security::Protocol::Tls::Context* context;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::Context*) == 0x8);
    // Mono.Security.Protocol.Tls.RecordProtocol protocol
    // Size: 0x8
    // Offset: 0x40
    ::Mono::Security::Protocol::Tls::RecordProtocol* protocol;
    // Field size check
    static_assert(sizeof(::Mono::Security::Protocol::Tls::RecordProtocol*) == 0x8);
    // System.Boolean ownsStream
    // Size: 0x1
    // Offset: 0x48
    bool ownsStream;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean disposed
    // Size: 0x1
    // Offset: 0x49
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean checkCertRevocationStatus
    // Size: 0x1
    // Offset: 0x4A
    bool checkCertRevocationStatus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: checkCertRevocationStatus and: negotiate
    char __padding6[0x5] = {};
    // private System.Object negotiate
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppObject* negotiate;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object read
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppObject* read;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object write
    // Size: 0x8
    // Offset: 0x60
    ::Il2CppObject* write;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Threading.ManualResetEvent negotiationComplete
    // Size: 0x8
    // Offset: 0x68
    ::System::Threading::ManualResetEvent* negotiationComplete;
    // Field size check
    static_assert(sizeof(::System::Threading::ManualResetEvent*) == 0x8);
    // private System.Byte[] recbuf
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<uint8_t> recbuf;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.IO.MemoryStream recordStream
    // Size: 0x8
    // Offset: 0x78
    ::System::IO::MemoryStream* recordStream;
    // Field size check
    static_assert(sizeof(::System::IO::MemoryStream*) == 0x8);
    public:
    // Get static field: static private System.Threading.ManualResetEvent record_processing
    static ::System::Threading::ManualResetEvent* _get_record_processing();
    // Set static field: static private System.Threading.ManualResetEvent record_processing
    static void _set_record_processing(::System::Threading::ManualResetEvent* value);
    // Get instance field reference: System.IO.Stream innerStream
    [[deprecated("Use field access instead!")]] ::System::IO::Stream*& dyn_innerStream();
    // Get instance field reference: System.IO.MemoryStream inputBuffer
    [[deprecated("Use field access instead!")]] ::System::IO::MemoryStream*& dyn_inputBuffer();
    // Get instance field reference: Mono.Security.Protocol.Tls.Context context
