// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Zenject.MonoInstaller
#include "Zenject/MonoInstaller.hpp"
// Including type: AppInitScenesTransitionSetupDataSO
#include "GlobalNamespace/AppInitScenesTransitionSetupDataSO.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerMockSettings
  class MultiplayerMockSettings;
  // Forward declaring type: GameScenesManager
  class GameScenesManager;
  // Forward declaring type: MockPlayersModel
  class MockPlayersModel;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: AppInit
  class AppInit : public Zenject::MonoInstaller {
    public:
    // Nested type: GlobalNamespace::AppInit::AppStartType
    struct AppStartType;
    // Nested type: GlobalNamespace::AppInit::$$c
    class $$c;
    // Nested type: GlobalNamespace::AppInit::$StartCoroutine$d__8
    class $StartCoroutine$d__8;
    // private UnityEngine.GameObject _cameraGO
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::GameObject* cameraGO;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private MultiplayerMockSettings _multiplayerMockSettings
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::MultiplayerMockSettings* multiplayerMockSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerMockSettings*) == 0x8);
    // [InjectOptionalAttribute] Offset: 0xE143D4
    // private AppInitScenesTransitionSetupDataSO/AppInitSceneSetupData _sceneSetupData
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::AppInitScenesTransitionSetupDataSO::AppInitSceneSetupData* sceneSetupData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AppInitScenesTransitionSetupDataSO::AppInitSceneSetupData*) == 0x8);
    // [InjectAttribute] Offset: 0xE143E4
    // private GameScenesManager _gameScenesManager
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::GameScenesManager* gameScenesManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameScenesManager*) == 0x8);
    // Creating value type constructor for type: AppInit
    AppInit(UnityEngine::GameObject* cameraGO_ = {}, GlobalNamespace::MultiplayerMockSettings* multiplayerMockSettings_ = {}, GlobalNamespace::AppInitScenesTransitionSetupDataSO::AppInitSceneSetupData* sceneSetupData_ = {}, GlobalNamespace::GameScenesManager* gameScenesManager_ = {}) noexcept : cameraGO{cameraGO_}, multiplayerMockSettings{multiplayerMockSettings_}, sceneSetupData{sceneSetupData_}, gameScenesManager{gameScenesManager_} {}
    // protected GameScenesManager get_gameScenesManager()
    // Offset: 0x112A0DC
    GlobalNamespace::GameScenesManager* get_gameScenesManager();
    // private System.Collections.IEnumerator StartCoroutine()
    // Offset: 0x112A25C
    System::Collections::IEnumerator* StartCoroutine();
    // protected System.Void OnDestroy()
    // Offset: 0x112A2F8
    void OnDestroy();
    // private System.Void HandleBeforeDismissingScenes()
    // Offset: 0x112A3CC
    void HandleBeforeDismissingScenes();
    // protected MockPlayersModel GetMockPlayersModel()
    // Offset: 0x112A46C
    GlobalNamespace::MockPlayersModel* GetMockPlayersModel();
    // protected AppInit/AppStartType GetAppStartType()
    // Offset: 0x112A1B8
    GlobalNamespace::AppInit::AppStartType GetAppStartType();
    // protected System.Void AppStartAndMultiSceneEditorSetup()
    // Offset: 0xFFFFFFFF
    void AppStartAndMultiSceneEditorSetup();
    // protected System.Void RepeatableSetup()
    // Offset: 0xFFFFFFFF
    void RepeatableSetup();
    // protected System.Void TransitionToNextScene()
    // Offset: 0xFFFFFFFF
    void TransitionToNextScene();
    // public override System.Void Start()
    // Offset: 0x112A0E4
    // Implemented from: Zenject.MonoInstallerBase
    // Base method: System.Void MonoInstallerBase::Start()
    void Start();
    // protected System.Void .ctor()
    // Offset: 0x112A52C
    // Implemented from: Zenject.MonoInstaller
    // Base method: System.Void MonoInstaller::.ctor()
    // Base method: System.Void MonoInstallerBase::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AppInit* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::AppInit::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AppInit*, creationType>()));
    }
  }; // AppInit
  #pragma pack(pop)
  static check_size<sizeof(AppInit), 56 + sizeof(GlobalNamespace::GameScenesManager*)> __GlobalNamespace_AppInitSizeCheck;
  static_assert(sizeof(AppInit) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AppInit*, "", "AppInit");
