// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PersistentScriptableObject
#include "GlobalNamespace/PersistentScriptableObject.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Audio
namespace UnityEngine::Audio {
  // Forward declaring type: AudioMixer
  class AudioMixer;
  // Forward declaring type: AudioMixerGroup
  class AudioMixerGroup;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: AudioManagerSO
  class AudioManagerSO : public GlobalNamespace::PersistentScriptableObject {
    public:
    // private UnityEngine.Audio.AudioMixer _audioMixer
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Audio::AudioMixer* audioMixer;
    // Field size check
    static_assert(sizeof(UnityEngine::Audio::AudioMixer*) == 0x8);
    // private System.Single _spatializerPluginLatancy
    // Size: 0x4
    // Offset: 0x20
    float spatializerPluginLatancy;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _spatializerSFXVolumeOffset
    // Size: 0x4
    // Offset: 0x24
    float spatializerSFXVolumeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _musicVolumeOffset
    // Size: 0x4
    // Offset: 0x28
    float musicVolumeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _sfxVolumeOffset
    // Size: 0x4
    // Offset: 0x2C
    float sfxVolumeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _sfxVolume
    // Size: 0x4
    // Offset: 0x30
    float sfxVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _sfxEnabled
    // Size: 0x1
    // Offset: 0x34
    bool sfxEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sfxEnabled and: masterMixerGroup
    char __padding6[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xE14C44
    // private UnityEngine.Audio.AudioMixerGroup <masterMixerGroup>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::Audio::AudioMixerGroup* masterMixerGroup;
    // Field size check
    static_assert(sizeof(UnityEngine::Audio::AudioMixerGroup*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE14C54
    // private UnityEngine.Audio.AudioMixerGroup <musicMixerGroup>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::Audio::AudioMixerGroup* musicMixerGroup;
    // Field size check
    static_assert(sizeof(UnityEngine::Audio::AudioMixerGroup*) == 0x8);
    // Creating value type constructor for type: AudioManagerSO
    AudioManagerSO(UnityEngine::Audio::AudioMixer* audioMixer_ = {}, float spatializerPluginLatancy_ = {}, float spatializerSFXVolumeOffset_ = {}, float musicVolumeOffset_ = {}, float sfxVolumeOffset_ = {}, float sfxVolume_ = {}, bool sfxEnabled_ = {}, UnityEngine::Audio::AudioMixerGroup* masterMixerGroup_ = {}, UnityEngine::Audio::AudioMixerGroup* musicMixerGroup_ = {}) noexcept : audioMixer{audioMixer_}, spatializerPluginLatancy{spatializerPluginLatancy_}, spatializerSFXVolumeOffset{spatializerSFXVolumeOffset_}, musicVolumeOffset{musicVolumeOffset_}, sfxVolumeOffset{sfxVolumeOffset_}, sfxVolume{sfxVolume_}, sfxEnabled{sfxEnabled_}, masterMixerGroup{masterMixerGroup_}, musicMixerGroup{musicMixerGroup_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.String kMSHRTFSpatializerPluginName
    static constexpr const char* kMSHRTFSpatializerPluginName = "MS HRTF Spatializer";
    // Get static field: static private System.String kMSHRTFSpatializerPluginName
    static ::Il2CppString* _get_kMSHRTFSpatializerPluginName();
    // Set static field: static private System.String kMSHRTFSpatializerPluginName
    static void _set_kMSHRTFSpatializerPluginName(::Il2CppString* value);
    // static field const value: static private System.String kMasterGroup
    static constexpr const char* kMasterGroup = "Master";
    // Get static field: static private System.String kMasterGroup
    static ::Il2CppString* _get_kMasterGroup();
    // Set static field: static private System.String kMasterGroup
    static void _set_kMasterGroup(::Il2CppString* value);
    // static field const value: static private System.String kMusicGroup
    static constexpr const char* kMusicGroup = "Music";
    // Get static field: static private System.String kMusicGroup
    static ::Il2CppString* _get_kMusicGroup();
    // Set static field: static private System.String kMusicGroup
    static void _set_kMusicGroup(::Il2CppString* value);
    // static field const value: static private System.String kSFXVolume
    static constexpr const char* kSFXVolume = "SFXVolume";
    // Get static field: static private System.String kSFXVolume
    static ::Il2CppString* _get_kSFXVolume();
    // Set static field: static private System.String kSFXVolume
    static void _set_kSFXVolume(::Il2CppString* value);
    // static field const value: static private System.String kMainVolume
    static constexpr const char* kMainVolume = "MainVolume";
    // Get static field: static private System.String kMainVolume
    static ::Il2CppString* _get_kMainVolume();
    // Set static field: static private System.String kMainVolume
    static void _set_kMainVolume(::Il2CppString* value);
    // static field const value: static private System.String kMusicVolume
    static constexpr const char* kMusicVolume = "MusicVolume";
    // Get static field: static private System.String kMusicVolume
    static ::Il2CppString* _get_kMusicVolume();
    // Set static field: static private System.String kMusicVolume
    static void _set_kMusicVolume(::Il2CppString* value);
    // static field const value: static private System.String kMusicPitch
    static constexpr const char* kMusicPitch = "MusicPitch";
    // Get static field: static private System.String kMusicPitch
    static ::Il2CppString* _get_kMusicPitch();
    // Set static field: static private System.String kMusicPitch
    static void _set_kMusicPitch(::Il2CppString* value);
    // static field const value: static private System.String kMusicPitchShifterWet
    static constexpr const char* kMusicPitchShifterWet = "MusicPitchShifterWet";
    // Get static field: static private System.String kMusicPitchShifterWet
    static ::Il2CppString* _get_kMusicPitchShifterWet();
    // Set static field: static private System.String kMusicPitchShifterWet
    static void _set_kMusicPitchShifterWet(::Il2CppString* value);
    // public System.Single get_sfxLatency()
    // Offset: 0x112C5F4
    float get_sfxLatency();
    // public System.Void Init()
    // Offset: 0x112C65C
    void Init();
    // public UnityEngine.Audio.AudioMixerGroup get_masterMixerGroup()
    // Offset: 0x112C760
    UnityEngine::Audio::AudioMixerGroup* get_masterMixerGroup();
    // private System.Void set_masterMixerGroup(UnityEngine.Audio.AudioMixerGroup value)
    // Offset: 0x112C768
    void set_masterMixerGroup(UnityEngine::Audio::AudioMixerGroup* value);
    // public UnityEngine.Audio.AudioMixerGroup get_musicMixerGroup()
    // Offset: 0x112C770
    UnityEngine::Audio::AudioMixerGroup* get_musicMixerGroup();
    // private System.Void set_musicMixerGroup(UnityEngine.Audio.AudioMixerGroup value)
    // Offset: 0x112C778
    void set_musicMixerGroup(UnityEngine::Audio::AudioMixerGroup* value);
    // public System.Void set_mainVolume(System.Single value)
    // Offset: 0x112C780
    void set_mainVolume(float value);
    // public System.Void set_musicVolume(System.Single value)
    // Offset: 0x112C7EC
    void set_musicVolume(float value);
    // public System.Void set_sfxVolume(System.Single value)
    // Offset: 0x112C85C
    void set_sfxVolume(float value);
    // public System.Boolean get_sfxEnabled()
    // Offset: 0x112C8E8
    bool get_sfxEnabled();
    // public System.Void set_sfxEnabled(System.Boolean value)
    // Offset: 0x112C8F0
    void set_sfxEnabled(bool value);
    // public System.Void set_musicPitch(System.Single value)
    // Offset: 0x112C910
    void set_musicPitch(float value);
    // public System.Void .ctor()
    // Offset: 0x112C9E0
    // Implemented from: PersistentScriptableObject
    // Base method: System.Void PersistentScriptableObject::.ctor()
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AudioManagerSO* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::AudioManagerSO::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AudioManagerSO*, creationType>()));
    }
  }; // AudioManagerSO
  #pragma pack(pop)
  static check_size<sizeof(AudioManagerSO), 64 + sizeof(UnityEngine::Audio::AudioMixerGroup*)> __GlobalNamespace_AudioManagerSOSizeCheck;
  static_assert(sizeof(AudioManagerSO) == 0x48);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AudioManagerSO*, "", "AudioManagerSO");
