// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PersistentScriptableObject
#include "GlobalNamespace/PersistentScriptableObject.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Audio
namespace UnityEngine::Audio {
  // Forward declaring type: AudioMixer
  class AudioMixer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AudioManagerSO
  class AudioManagerSO;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::AudioManagerSO);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AudioManagerSO*, "", "AudioManagerSO");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x35
  #pragma pack(push, 1)
  // Autogenerated type: AudioManagerSO
  // [TokenAttribute] Offset: FFFFFFFF
  class AudioManagerSO : public ::GlobalNamespace::PersistentScriptableObject {
    public:
    public:
    // private UnityEngine.Audio.AudioMixer _audioMixer
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Audio::AudioMixer* audioMixer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Audio::AudioMixer*) == 0x8);
    // private System.Single _spatializerPluginLatency
    // Size: 0x4
    // Offset: 0x20
    float spatializerPluginLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _spatializerSfxVolumeOffset
    // Size: 0x4
    // Offset: 0x24
    float spatializerSfxVolumeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _musicVolumeOffset
    // Size: 0x4
    // Offset: 0x28
    float musicVolumeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _sfxVolumeOffset
    // Size: 0x4
    // Offset: 0x2C
    float sfxVolumeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _sfxVolume
    // Size: 0x4
    // Offset: 0x30
    float sfxVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _sfxEnabled
    // Size: 0x1
    // Offset: 0x34
    bool sfxEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.Single kDefaultMusicVolume
    static constexpr const float kDefaultMusicVolume = -4;
    // Get static field: static public System.Single kDefaultMusicVolume
    static float _get_kDefaultMusicVolume();
    // Set static field: static public System.Single kDefaultMusicVolume
    static void _set_kDefaultMusicVolume(float value);
    // static field const value: static private System.String kMsHrtfSpatializerPluginName
    static constexpr const char* kMsHrtfSpatializerPluginName = "MS HRTF Spatializer";
    // Get static field: static private System.String kMsHrtfSpatializerPluginName
    static ::StringW _get_kMsHrtfSpatializerPluginName();
    // Set static field: static private System.String kMsHrtfSpatializerPluginName
    static void _set_kMsHrtfSpatializerPluginName(::StringW value);
    // static field const value: static private System.String kSfxVolume
    static constexpr const char* kSfxVolume = "SFXVolume";
    // Get static field: static private System.String kSfxVolume
    static ::StringW _get_kSfxVolume();
    // Set static field: static private System.String kSfxVolume
    static void _set_kSfxVolume(::StringW value);
    // static field const value: static private System.String kMainVolume
    static constexpr const char* kMainVolume = "MainVolume";
    // Get static field: static private System.String kMainVolume
    static ::StringW _get_kMainVolume();
    // Set static field: static private System.String kMainVolume
    static void _set_kMainVolume(::StringW value);
    // static field const value: static private System.String kMusicVolume
    static constexpr const char* kMusicVolume = "MusicVolume";
    // Get static field: static private System.String kMusicVolume
    static ::StringW _get_kMusicVolume();
    // Set static field: static private System.String kMusicVolume
    static void _set_kMusicVolume(::StringW value);
    // static field const value: static private System.String kMusicPitch
    static constexpr const char* kMusicPitch = "MusicPitch";
    // Get static field: static private System.String kMusicPitch
    static ::StringW _get_kMusicPitch();
    // Set static field: static private System.String kMusicPitch
    static void _set_kMusicPitch(::StringW value);
    // static field const value: static private System.String kMusicSpeed
    static constexpr const char* kMusicSpeed = "MusicSpeed";
    // Get static field: static private System.String kMusicSpeed
    static ::StringW _get_kMusicSpeed();
    // Set static field: static private System.String kMusicSpeed
    static void _set_kMusicSpeed(::StringW value);
    // static field const value: static private System.String kMusicPitchShifterWet
    static constexpr const char* kMusicPitchShifterWet = "MusicPitchShifterWet";
    // Get static field: static private System.String kMusicPitchShifterWet
    static ::StringW _get_kMusicPitchShifterWet();
    // Set static field: static private System.String kMusicPitchShifterWet
    static void _set_kMusicPitchShifterWet(::StringW value);
    // Get instance field reference: private UnityEngine.Audio.AudioMixer _audioMixer
    [[deprecated("Use field access instead!")]] ::UnityEngine::Audio::AudioMixer*& dyn__audioMixer();
    // Get instance field reference: private System.Single _spatializerPluginLatency
    [[deprecated("Use field access instead!")]] float& dyn__spatializerPluginLatency();
    // Get instance field reference: private System.Single _spatializerSfxVolumeOffset
    [[deprecated("Use field access instead!")]] float& dyn__spatializerSfxVolumeOffset();
    // Get instance field reference: private System.Single _musicVolumeOffset
    [[deprecated("Use field access instead!")]] float& dyn__musicVolumeOffset();
    // Get instance field reference: private System.Single _sfxVolumeOffset
    [[deprecated("Use field access instead!")]] float& dyn__sfxVolumeOffset();
    // Get instance field reference: private System.Single _sfxVolume
    [[deprecated("Use field access instead!")]] float& dyn__sfxVolume();
    // Get instance field reference: private System.Boolean _sfxEnabled
    [[deprecated("Use field access instead!")]] bool& dyn__sfxEnabled();
    // public System.Single get_sfxLatency()
    // Offset: 0x153A41C
    float get_sfxLatency();
    // public System.Void set_mainVolume(System.Single value)
    // Offset: 0x153A528
    void set_mainVolume(float value);
    // public System.Void set_musicVolume(System.Single value)
    // Offset: 0x153A594
    void set_musicVolume(float value);
    // public System.Single get_sfxVolume()
    // Offset: 0x153A604
    float get_sfxVolume();
    // public System.Void set_sfxVolume(System.Single value)
    // Offset: 0x153A61C
    void set_sfxVolume(float value);
    // public System.Boolean get_sfxEnabled()
    // Offset: 0x153A6A8
    bool get_sfxEnabled();
    // public System.Void set_sfxEnabled(System.Boolean value)
    // Offset: 0x153A6B0
    void set_sfxEnabled(bool value);
    // public System.Void set_musicPitch(System.Single value)
    // Offset: 0x153A6D0
    void set_musicPitch(float value);
    // public System.Void set_musicSpeed(System.Single value)
    // Offset: 0x153A7A0
    void set_musicSpeed(float value);
    // public System.Void .ctor()
    // Offset: 0x153A80C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AudioManagerSO* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::AudioManagerSO::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AudioManagerSO*, creationType>()));
    }
    // public System.Void Init()
    // Offset: 0x153A484
    void Init();
  }; // AudioManagerSO
  #pragma pack(pop)
  static check_size<sizeof(AudioManagerSO), 52 + sizeof(bool)> __GlobalNamespace_AudioManagerSOSizeCheck;
  static_assert(sizeof(AudioManagerSO) == 0x35);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::get_sfxLatency
// Il2CppName: get_sfxLatency
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (GlobalNamespace::AudioManagerSO::*)()>(&GlobalNamespace::AudioManagerSO::get_sfxLatency)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "get_sfxLatency", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::set_mainVolume
// Il2CppName: set_mainVolume
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AudioManagerSO::*)(float)>(&GlobalNamespace::AudioManagerSO::set_mainVolume)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "set_mainVolume", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::set_musicVolume
// Il2CppName: set_musicVolume
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AudioManagerSO::*)(float)>(&GlobalNamespace::AudioManagerSO::set_musicVolume)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "set_musicVolume", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::get_sfxVolume
// Il2CppName: get_sfxVolume
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (GlobalNamespace::AudioManagerSO::*)()>(&GlobalNamespace::AudioManagerSO::get_sfxVolume)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "get_sfxVolume", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::set_sfxVolume
// Il2CppName: set_sfxVolume
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AudioManagerSO::*)(float)>(&GlobalNamespace::AudioManagerSO::set_sfxVolume)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "set_sfxVolume", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::get_sfxEnabled
// Il2CppName: get_sfxEnabled
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (GlobalNamespace::AudioManagerSO::*)()>(&GlobalNamespace::AudioManagerSO::get_sfxEnabled)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "get_sfxEnabled", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::set_sfxEnabled
// Il2CppName: set_sfxEnabled
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AudioManagerSO::*)(bool)>(&GlobalNamespace::AudioManagerSO::set_sfxEnabled)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "set_sfxEnabled", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::set_musicPitch
// Il2CppName: set_musicPitch
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AudioManagerSO::*)(float)>(&GlobalNamespace::AudioManagerSO::set_musicPitch)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "set_musicPitch", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::set_musicSpeed
// Il2CppName: set_musicSpeed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AudioManagerSO::*)(float)>(&GlobalNamespace::AudioManagerSO::set_musicSpeed)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "set_musicSpeed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::AudioManagerSO::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AudioManagerSO::*)()>(&GlobalNamespace::AudioManagerSO::Init)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AudioManagerSO*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
