// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AutomaticSFXVolumeParamsSO
  class AutomaticSFXVolumeParamsSO;
  // Forward declaring type: AudioManagerSO
  class AudioManagerSO;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: AutomaticSFXVolume
  class AutomaticSFXVolume : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::AutomaticSFXVolume::InitData
    class InitData;
    // private AutomaticSFXVolumeParamsSO _params
    // Offset: 0x18
    GlobalNamespace::AutomaticSFXVolumeParamsSO* params;
    // private AudioManagerSO _audioManager
    // Offset: 0x20
    GlobalNamespace::AudioManagerSO* audioManager;
    // private AutomaticSFXVolume/InitData _initData
    // Offset: 0x28
    GlobalNamespace::AutomaticSFXVolume::InitData* initData;
    // private System.Single _sampleRate
    // Offset: 0x30
    float sampleRate;
    // private System.Single _volume
    // Offset: 0x34
    float volume;
    // private System.Single _envelope
    // Offset: 0x38
    float envelope;
    // private System.Single _attackSamples
    // Offset: 0x3C
    float attackSamples;
    // private System.Single _releaseSamples
    // Offset: 0x40
    float releaseSamples;
    // private System.Single _attackCoef
    // Offset: 0x44
    float attackCoef;
    // private System.Single _releaseCoef
    // Offset: 0x48
    float releaseCoef;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single kBaseVolume
    static constexpr const float kBaseVolume = 0.4;
    // Get static field: static private System.Single kBaseVolume
    static float _get_kBaseVolume();
    // Set static field: static private System.Single kBaseVolume
    static void _set_kBaseVolume(float value);
    // protected System.Void Start()
    // Offset: 0x1A42F5C
    void Start();
    // protected System.Void OnDisable()
    // Offset: 0x1A4303C
    void OnDisable();
    // protected System.Void OnValidate()
    // Offset: 0x1A430D0
    void OnValidate();
    // private System.Void RecalculateParams()
    // Offset: 0x1A42F60
    void RecalculateParams();
    // protected System.Void OnAudioFilterRead(System.Single[] data, System.Int32 channels)
    // Offset: 0x1A430D4
    void OnAudioFilterRead(::Array<float>* data, int channels);
    // protected System.Void Update()
    // Offset: 0x1A432E4
    void Update();
    // public System.Void .ctor()
    // Offset: 0x1A43334
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static AutomaticSFXVolume* New_ctor();
  }; // AutomaticSFXVolume
  check_size<sizeof(AutomaticSFXVolume), 72 + sizeof(float) + ((72 + sizeof(float)) % 8 != 0 ? (8 - (72 + sizeof(float)) % 8) : 0)> __GlobalNamespace_AutomaticSFXVolumeSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AutomaticSFXVolume*, "", "AutomaticSFXVolume");
#pragma pack(pop)
