// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: AutomaticSFXVolumeParamsSO
  class AutomaticSFXVolumeParamsSO : public UnityEngine::ScriptableObject {
    public:
    // private System.Single _musicVolumeMultiplier
    // Offset: 0x18
    float musicVolumeMultiplier;
    // private System.Single _threshold
    // Offset: 0x1C
    float threshold;
    // private System.Single _impact
    // Offset: 0x20
    float impact;
    // private System.Single _attackTime
    // Offset: 0x24
    float attackTime;
    // private System.Single _releaseTime
    // Offset: 0x28
    float releaseTime;
    // private System.Single _minVolume
    // Offset: 0x2C
    float minVolume;
    // private System.Single _maxVolume
    // Offset: 0x30
    float maxVolume;
    // private System.Single _volumeSmooth
    // Offset: 0x34
    float volumeSmooth;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Single get_musicVolumeMultiplier()
    // Offset: 0x1A43388
    float get_musicVolumeMultiplier();
    // public System.Single get_threshold()
    // Offset: 0x1A43390
    float get_threshold();
    // public System.Single get_impact()
    // Offset: 0x1A43398
    float get_impact();
    // public System.Single get_attackTime()
    // Offset: 0x1A433A0
    float get_attackTime();
    // public System.Single get_releaseTime()
    // Offset: 0x1A433A8
    float get_releaseTime();
    // public System.Single get_minVolume()
    // Offset: 0x1A433B0
    float get_minVolume();
    // public System.Single get_maxVolume()
    // Offset: 0x1A433B8
    float get_maxVolume();
    // public System.Single get_volumeSmooth()
    // Offset: 0x1A433C0
    float get_volumeSmooth();
    // public System.Void .ctor()
    // Offset: 0x1A433C8
    // Implemented from: UnityEngine.ScriptableObject
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static AutomaticSFXVolumeParamsSO* New_ctor();
  }; // AutomaticSFXVolumeParamsSO
  check_size<sizeof(AutomaticSFXVolumeParamsSO), 52 + sizeof(float) + ((52 + sizeof(float)) % 8 != 0 ? (8 - (52 + sizeof(float)) % 8) : 0)> __GlobalNamespace_AutomaticSFXVolumeParamsSOSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AutomaticSFXVolumeParamsSO*, "", "AutomaticSFXVolumeParamsSO");
#pragma pack(pop)
