// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AvatarData
  class AvatarData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::AvatarData);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AvatarData*, "", "AvatarData");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: AvatarData
  // [TokenAttribute] Offset: FFFFFFFF
  class AvatarData : public ::Il2CppObject {
    public:
    public:
    // private System.String <headTopId>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::StringW headTopId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <glassesId>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::StringW glassesId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <facialHairId>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::StringW facialHairId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <handsId>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::StringW handsId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <clothesId>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::StringW clothesId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <eyesId>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::StringW eyesId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <mouthId>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::StringW mouthId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Color <headTopPrimaryColor>k__BackingField
    // Size: 0x10
    // Offset: 0x48
    ::UnityEngine::Color headTopPrimaryColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color <headTopSecondaryColor>k__BackingField
    // Size: 0x10
    // Offset: 0x58
    ::UnityEngine::Color headTopSecondaryColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color <glassesColor>k__BackingField
    // Size: 0x10
    // Offset: 0x68
    ::UnityEngine::Color glassesColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color <facialHairColor>k__BackingField
    // Size: 0x10
    // Offset: 0x78
    ::UnityEngine::Color facialHairColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color <handsColor>k__BackingField
    // Size: 0x10
    // Offset: 0x88
    ::UnityEngine::Color handsColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color <clothesPrimaryColor>k__BackingField
    // Size: 0x10
    // Offset: 0x98
    ::UnityEngine::Color clothesPrimaryColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color <clothesSecondaryColor>k__BackingField
    // Size: 0x10
    // Offset: 0xA8
    ::UnityEngine::Color clothesSecondaryColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color <clothesDetailColor>k__BackingField
    // Size: 0x10
    // Offset: 0xB8
    ::UnityEngine::Color clothesDetailColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.String <skinColorId>k__BackingField
    // Size: 0x8
    // Offset: 0xC8
    ::StringW skinColorId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: private System.String <headTopId>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$headTopId$k__BackingField();
    // Get instance field reference: private System.String <glassesId>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$glassesId$k__BackingField();
    // Get instance field reference: private System.String <facialHairId>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$facialHairId$k__BackingField();
    // Get instance field reference: private System.String <handsId>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$handsId$k__BackingField();
    // Get instance field reference: private System.String <clothesId>k__BackingField
