// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: AvatarSaveData
  // [TokenAttribute] Offset: FFFFFFFF
  class AvatarSaveData : public ::Il2CppObject {
    public:
    // public System.String headTopId
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* headTopId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String glassesId
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* glassesId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String facialHairId
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* facialHairId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String handsId
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* handsId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String clothesId
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppString* clothesId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String skinColorId
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* skinColorId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String mouthId
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* mouthId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String eyesId
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* eyesId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public UnityEngine.Color headTopPrimaryColor
    // Size: 0x10
    // Offset: 0x50
    UnityEngine::Color headTopPrimaryColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // public UnityEngine.Color headTopSecondaryColor
    // Size: 0x10
    // Offset: 0x60
    UnityEngine::Color headTopSecondaryColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // public UnityEngine.Color glassesColor
    // Size: 0x10
    // Offset: 0x70
    UnityEngine::Color glassesColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // public UnityEngine.Color facialHairColor
    // Size: 0x10
    // Offset: 0x80
    UnityEngine::Color facialHairColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // public UnityEngine.Color handsColor
    // Size: 0x10
    // Offset: 0x90
    UnityEngine::Color handsColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // public UnityEngine.Color clothesPrimaryColor
    // Size: 0x10
    // Offset: 0xA0
    UnityEngine::Color clothesPrimaryColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // public UnityEngine.Color clothesSecondaryColor
    // Size: 0x10
    // Offset: 0xB0
    UnityEngine::Color clothesSecondaryColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // public UnityEngine.Color clothesDetailColor
    // Size: 0x10
    // Offset: 0xC0
    UnityEngine::Color clothesDetailColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // Creating value type constructor for type: AvatarSaveData
    AvatarSaveData(::Il2CppString* headTopId_ = {}, ::Il2CppString* glassesId_ = {}, ::Il2CppString* facialHairId_ = {}, ::Il2CppString* handsId_ = {}, ::Il2CppString* clothesId_ = {}, ::Il2CppString* skinColorId_ = {}, ::Il2CppString* mouthId_ = {}, ::Il2CppString* eyesId_ = {}, UnityEngine::Color headTopPrimaryColor_ = {}, UnityEngine::Color headTopSecondaryColor_ = {}, UnityEngine::Color glassesColor_ = {}, UnityEngine::Color facialHairColor_ = {}, UnityEngine::Color handsColor_ = {}, UnityEngine::Color clothesPrimaryColor_ = {}, UnityEngine::Color clothesSecondaryColor_ = {}, UnityEngine::Color clothesDetailColor_ = {}) noexcept : headTopId{headTopId_}, glassesId{glassesId_}, facialHairId{facialHairId_}, handsId{handsId_}, clothesId{clothesId_}, skinColorId{skinColorId_}, mouthId{mouthId_}, eyesId{eyesId_}, headTopPrimaryColor{headTopPrimaryColor_}, headTopSecondaryColor{headTopSecondaryColor_}, glassesColor{glassesColor_}, facialHairColor{facialHairColor_}, handsColor{handsColor_}, clothesPrimaryColor{clothesPrimaryColor_}, clothesSecondaryColor{clothesSecondaryColor_}, clothesDetailColor{clothesDetailColor_} {}
    // Get instance field: public System.String headTopId
    ::Il2CppString* _get_headTopId();
    // Set instance field: public System.String headTopId
    void _set_headTopId(::Il2CppString* value);
    // Get instance field: public System.String glassesId
    ::Il2CppString* _get_glassesId();
    // Set instance field: public System.String glassesId
    void _set_glassesId(::Il2CppString* value);
    // Get instance field: public System.String facialHairId
    ::Il2CppString* _get_facialHairId();
    // Set instance field: public System.String facialHairId
    void _set_facialHairId(::Il2CppString* value);
    // Get instance field: public System.String handsId
    ::Il2CppString* _get_handsId();
    // Set instance field: public System.String handsId
    void _set_handsId(::Il2CppString* value);
    // Get instance field: public System.String clothesId
    ::Il2CppString* _get_clothesId();
    // Set instance field: public System.String clothesId
    void _set_clothesId(::Il2CppString* value);
    // Get instance field: public System.String skinColorId
    ::Il2CppString* _get_skinColorId();
    // Set instance field: public System.String skinColorId
    void _set_skinColorId(::Il2CppString* value);
    // Get instance field: public System.String mouthId
    ::Il2CppString* _get_mouthId();
    // Set instance field: public System.String mouthId
    void _set_mouthId(::Il2CppString* value);
    // Get instance field: public System.String eyesId
    ::Il2CppString* _get_eyesId();
    // Set instance field: public System.String eyesId
    void _set_eyesId(::Il2CppString* value);
    // Get instance field: public UnityEngine.Color headTopPrimaryColor
    UnityEngine::Color _get_headTopPrimaryColor();
    // Set instance field: public UnityEngine.Color headTopPrimaryColor
    void _set_headTopPrimaryColor(UnityEngine::Color value);
    // Get instance field: public UnityEngine.Color headTopSecondaryColor
    UnityEngine::Color _get_headTopSecondaryColor();
    // Set instance field: public UnityEngine.Color headTopSecondaryColor
    void _set_headTopSecondaryColor(UnityEngine::Color value);
    // Get instance field: public UnityEngine.Color glassesColor
    UnityEngine::Color _get_glassesColor();
    // Set instance field: public UnityEngine.Color glassesColor
    void _set_glassesColor(UnityEngine::Color value);
    // Get instance field: public UnityEngine.Color facialHairColor
    UnityEngine::Color _get_facialHairColor();
    // Set instance field: public UnityEngine.Color facialHairColor
    void _set_facialHairColor(UnityEngine::Color value);
    // Get instance field: public UnityEngine.Color handsColor
    UnityEngine::Color _get_handsColor();
    // Set instance field: public UnityEngine.Color handsColor
    void _set_handsColor(UnityEngine::Color value);
    // Get instance field: public UnityEngine.Color clothesPrimaryColor
    UnityEngine::Color _get_clothesPrimaryColor();
    // Set instance field: public UnityEngine.Color clothesPrimaryColor
    void _set_clothesPrimaryColor(UnityEngine::Color value);
    // Get instance field: public UnityEngine.Color clothesSecondaryColor
    UnityEngine::Color _get_clothesSecondaryColor();
    // Set instance field: public UnityEngine.Color clothesSecondaryColor
    void _set_clothesSecondaryColor(UnityEngine::Color value);
    // Get instance field: public UnityEngine.Color clothesDetailColor
    UnityEngine::Color _get_clothesDetailColor();
    // Set instance field: public UnityEngine.Color clothesDetailColor
    void _set_clothesDetailColor(UnityEngine::Color value);
    // public System.Void .ctor()
    // Offset: 0x10DE578
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AvatarSaveData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::AvatarSaveData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AvatarSaveData*, creationType>()));
    }
  }; // AvatarSaveData
  #pragma pack(pop)
  static check_size<sizeof(AvatarSaveData), 192 + sizeof(UnityEngine::Color)> __GlobalNamespace_AvatarSaveDataSizeCheck;
  static_assert(sizeof(AvatarSaveData) == 0xD0);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AvatarSaveData*, "", "AvatarSaveData");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::AvatarSaveData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
