// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: AvatarPropertyBlockColorSetter
  class AvatarPropertyBlockColorSetter : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.Color _defaultColor
    // Offset: 0x18
    UnityEngine::Color defaultColor;
    // private System.Single _darkerColorMultiplier
    // Offset: 0x28
    float darkerColorMultiplier;
    // private System.Single _whiteBoost
    // Offset: 0x2C
    float whiteBoost;
    // private System.Boolean _editInPlayMode
    // Offset: 0x30
    bool editInPlayMode;
    // private UnityEngine.Renderer _renderer
    // Offset: 0x38
    UnityEngine::Renderer* renderer;
    // private UnityEngine.Color _rimLightColor
    // Offset: 0x40
    UnityEngine::Color rimLightColor;
    // private UnityEngine.Color _mainColor
    // Offset: 0x50
    UnityEngine::Color mainColor;
    // private UnityEngine.Color _boostColor
    // Offset: 0x60
    UnityEngine::Color boostColor;
    // private System.Boolean _highlighted
    // Offset: 0x70
    bool highlighted;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get static field: static private UnityEngine.MaterialPropertyBlock _materialPropertyBlock
    static UnityEngine::MaterialPropertyBlock* _get__materialPropertyBlock();
    // Set static field: static private UnityEngine.MaterialPropertyBlock _materialPropertyBlock
    static void _set__materialPropertyBlock(UnityEngine::MaterialPropertyBlock* value);
    // protected System.Void Awake()
    // Offset: 0x1A46A1C
    void Awake();
    // protected System.Void OnValidate()
    // Offset: 0x1A46A54
    void OnValidate();
    // public System.Void SetColor(UnityEngine.Color color)
    // Offset: 0x1A46B24
    void SetColor(UnityEngine::Color color);
    // private System.Void SetColors(UnityEngine.Color mainColor, UnityEngine.Color rimLightColor)
    // Offset: 0x1A46BC4
    void SetColors(UnityEngine::Color mainColor, UnityEngine::Color rimLightColor);
    // public System.Void SetHighlight(System.Boolean highlighted, System.Int32 uvSegment)
    // Offset: 0x1A46D44
    void SetHighlight(bool highlighted, int uvSegment);
    // private System.Void UpdateRenderer()
    // Offset: 0x1A46BD8
    void UpdateRenderer();
    // public System.Void .ctor()
    // Offset: 0x1A46D50
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static AvatarPropertyBlockColorSetter* New_ctor();
  }; // AvatarPropertyBlockColorSetter
  check_size<sizeof(AvatarPropertyBlockColorSetter), 112 + sizeof(bool) + ((112 + sizeof(bool)) % 8 != 0 ? (8 - (112 + sizeof(bool)) % 8) : 0)> __GlobalNamespace_AvatarPropertyBlockColorSetterSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AvatarPropertyBlockColorSetter*, "", "AvatarPropertyBlockColorSetter");
#pragma pack(pop)
