// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: EditAvatarViewController/AvatarEditPart
#include "GlobalNamespace/EditAvatarViewController.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MulticolorAvatarPartPropertyBlockSetter
  class MulticolorAvatarPartPropertyBlockSetter;
  // Forward declaring type: AvatarPropertyBlockColorSetter
  class AvatarPropertyBlockColorSetter;
  // Forward declaring type: AvatarPartsModel
  class AvatarPartsModel;
  // Forward declaring type: AvatarData
  class AvatarData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: AvatarVisualController
  class AvatarVisualController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::AvatarVisualController::HighlighterDelegate
    class HighlighterDelegate;
    // private UnityEngine.MeshFilter _headTopMeshFilter
    // Offset: 0x18
    UnityEngine::MeshFilter* headTopMeshFilter;
    // private UnityEngine.MeshFilter _glassesMeshFilter
    // Offset: 0x20
    UnityEngine::MeshFilter* glassesMeshFilter;
    // private UnityEngine.MeshFilter _facialHairMeshFilter
    // Offset: 0x28
    UnityEngine::MeshFilter* facialHairMeshFilter;
    // private UnityEngine.MeshFilter _leftHandsHairMeshFilter
    // Offset: 0x30
    UnityEngine::MeshFilter* leftHandsHairMeshFilter;
    // private UnityEngine.MeshFilter _rightHandsHairMeshFilter
    // Offset: 0x38
    UnityEngine::MeshFilter* rightHandsHairMeshFilter;
    // private UnityEngine.SpriteRenderer _eyesSprite
    // Offset: 0x40
    UnityEngine::SpriteRenderer* eyesSprite;
    // private UnityEngine.SpriteRenderer _mouthSprite
    // Offset: 0x48
    UnityEngine::SpriteRenderer* mouthSprite;
    // private UnityEngine.MeshFilter _bodyMeshFilter
    // Offset: 0x50
    UnityEngine::MeshFilter* bodyMeshFilter;
    // private MulticolorAvatarPartPropertyBlockSetter _headTopPropertyBlockColorSetter
    // Offset: 0x58
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter* headTopPropertyBlockColorSetter;
    // private AvatarPropertyBlockColorSetter _glassesPropertyBlockColorSetter
    // Offset: 0x60
    GlobalNamespace::AvatarPropertyBlockColorSetter* glassesPropertyBlockColorSetter;
    // private AvatarPropertyBlockColorSetter _facialHairPropertyBlockColorSetter
    // Offset: 0x68
    GlobalNamespace::AvatarPropertyBlockColorSetter* facialHairPropertyBlockColorSetter;
    // private AvatarPropertyBlockColorSetter _skinPropertyBlockColorSetter
    // Offset: 0x70
    GlobalNamespace::AvatarPropertyBlockColorSetter* skinPropertyBlockColorSetter;
    // private MulticolorAvatarPartPropertyBlockSetter _clothesPropertyBlockSetter
    // Offset: 0x78
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter* clothesPropertyBlockSetter;
    // private MulticolorAvatarPartPropertyBlockSetter _leftHandPropertyBlockSetter
    // Offset: 0x80
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter* leftHandPropertyBlockSetter;
    // private MulticolorAvatarPartPropertyBlockSetter _rightHandPropertyBlockSetter
    // Offset: 0x88
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter* rightHandPropertyBlockSetter;
    // private readonly AvatarPartsModel _avatarPartsModel
    // Offset: 0x90
    GlobalNamespace::AvatarPartsModel* avatarPartsModel;
    // private System.Collections.Generic.Dictionary`2<EditAvatarViewController/AvatarEditPart,AvatarVisualController/HighlighterDelegate> _avatarPartHighlightSetters
    // Offset: 0x98
    System::Collections::Generic::Dictionary_2<GlobalNamespace::EditAvatarViewController::AvatarEditPart, GlobalNamespace::AvatarVisualController::HighlighterDelegate*>* avatarPartHighlightSetters;
    // private UnityEngine.Color _lightColor
    // Offset: 0xA0
    UnityEngine::Color lightColor;
    // private AvatarData _avatarData
    // Offset: 0xB0
    GlobalNamespace::AvatarData* avatarData;
    // private AvatarVisualController/HighlighterDelegate _currentHighlighter
    // Offset: 0xB8
    GlobalNamespace::AvatarVisualController::HighlighterDelegate* currentHighlighter;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public UnityEngine.Color get_lightColor()
    // Offset: 0x2036C24
    UnityEngine::Color get_lightColor();
    // protected System.Void Awake()
    // Offset: 0x2036C30
    void Awake();
    // public System.Void UpdateAvatarVisual(AvatarData avatarData)
    // Offset: 0x2036EF8
    void UpdateAvatarVisual(GlobalNamespace::AvatarData* avatarData);
    // public System.Void SetLightColor(UnityEngine.Color color)
    // Offset: 0x20376C4
    void SetLightColor(UnityEngine::Color color);
    // private System.Void UpdateAvatarColors()
    // Offset: 0x2037354
    void UpdateAvatarColors();
    // public System.Void HighlightEditedPart(EditAvatarViewController/AvatarEditPart editPart, System.Int32 uvSegment)
    // Offset: 0x20376D0
    void HighlightEditedPart(GlobalNamespace::EditAvatarViewController::AvatarEditPart editPart, int uvSegment);
    // public System.Void DisableEditedPartHighlight()
    // Offset: 0x2037A10
    void DisableEditedPartHighlight();
    // private System.Void SetHandsHighlight(System.Boolean highlighted, System.Int32 uvSegment)
    // Offset: 0x2037A4C
    void SetHandsHighlight(bool highlighted, int uvSegment);
    // public System.Void .ctor()
    // Offset: 0x2037A98
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static AvatarVisualController* New_ctor();
  }; // AvatarVisualController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AvatarVisualController*, "", "AvatarVisualController");
#pragma pack(pop)
