// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: EditAvatarViewController/AvatarEditPart
#include "GlobalNamespace/EditAvatarViewController.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MulticolorAvatarPartPropertyBlockSetter
  class MulticolorAvatarPartPropertyBlockSetter;
  // Forward declaring type: AvatarPropertyBlockColorSetter
  class AvatarPropertyBlockColorSetter;
  // Forward declaring type: AvatarPartsModel
  class AvatarPartsModel;
  // Forward declaring type: AvatarData
  class AvatarData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AvatarVisualController
  class AvatarVisualController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(GlobalNamespace::AvatarVisualController);
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AvatarVisualController*, "", "AvatarVisualController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: AvatarVisualController
  // [TokenAttribute] Offset: FFFFFFFF
  class AvatarVisualController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::AvatarVisualController::HighlighterDelegate
    class HighlighterDelegate;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private UnityEngine.MeshFilter _headTopMeshFilter
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::MeshFilter* headTopMeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshFilter _glassesMeshFilter
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::MeshFilter* glassesMeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshFilter _facialHairMeshFilter
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::MeshFilter* facialHairMeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshFilter _leftHandsHairMeshFilter
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::MeshFilter* leftHandsHairMeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshFilter _rightHandsHairMeshFilter
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::MeshFilter* rightHandsHairMeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.SpriteRenderer _eyesSprite
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::SpriteRenderer* eyesSprite;
    // Field size check
    static_assert(sizeof(UnityEngine::SpriteRenderer*) == 0x8);
    // private UnityEngine.SpriteRenderer _mouthSprite
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::SpriteRenderer* mouthSprite;
    // Field size check
    static_assert(sizeof(UnityEngine::SpriteRenderer*) == 0x8);
    // private UnityEngine.MeshFilter _bodyMeshFilter
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::MeshFilter* bodyMeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // [SpaceAttribute] Offset: 0x123C49C
    // private MulticolorAvatarPartPropertyBlockSetter _headTopPropertyBlockColorSetter
    // Size: 0x8
    // Offset: 0x58
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter* headTopPropertyBlockColorSetter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter*) == 0x8);
    // private AvatarPropertyBlockColorSetter _glassesPropertyBlockColorSetter
    // Size: 0x8
    // Offset: 0x60
    GlobalNamespace::AvatarPropertyBlockColorSetter* glassesPropertyBlockColorSetter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarPropertyBlockColorSetter*) == 0x8);
    // private AvatarPropertyBlockColorSetter _facialHairPropertyBlockColorSetter
    // Size: 0x8
    // Offset: 0x68
    GlobalNamespace::AvatarPropertyBlockColorSetter* facialHairPropertyBlockColorSetter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarPropertyBlockColorSetter*) == 0x8);
    // private AvatarPropertyBlockColorSetter _skinPropertyBlockColorSetter
    // Size: 0x8
    // Offset: 0x70
    GlobalNamespace::AvatarPropertyBlockColorSetter* skinPropertyBlockColorSetter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarPropertyBlockColorSetter*) == 0x8);
    // private MulticolorAvatarPartPropertyBlockSetter _clothesPropertyBlockSetter
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter* clothesPropertyBlockSetter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter*) == 0x8);
    // private MulticolorAvatarPartPropertyBlockSetter _leftHandPropertyBlockSetter
    // Size: 0x8
    // Offset: 0x80
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter* leftHandPropertyBlockSetter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter*) == 0x8);
    // private MulticolorAvatarPartPropertyBlockSetter _rightHandPropertyBlockSetter
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter* rightHandPropertyBlockSetter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter*) == 0x8);
    // [InjectAttribute] Offset: 0x123C534
    // private readonly AvatarPartsModel _avatarPartsModel
    // Size: 0x8
    // Offset: 0x90
    GlobalNamespace::AvatarPartsModel* avatarPartsModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarPartsModel*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<EditAvatarViewController/AvatarEditPart,AvatarVisualController/HighlighterDelegate> _avatarPartHighlightSetters
    // Size: 0x8
    // Offset: 0x98
    System::Collections::Generic::Dictionary_2<GlobalNamespace::EditAvatarViewController::AvatarEditPart, GlobalNamespace::AvatarVisualController::HighlighterDelegate*>* avatarPartHighlightSetters;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<GlobalNamespace::EditAvatarViewController::AvatarEditPart, GlobalNamespace::AvatarVisualController::HighlighterDelegate*>*) == 0x8);
    // private UnityEngine.Color _lightColor
    // Size: 0x10
    // Offset: 0xA0
    UnityEngine::Color lightColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // private AvatarData _avatarData
    // Size: 0x8
    // Offset: 0xB0
    GlobalNamespace::AvatarData* avatarData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarData*) == 0x8);
    // private AvatarVisualController/HighlighterDelegate _currentHighlighter
    // Size: 0x8
    // Offset: 0xB8
    GlobalNamespace::AvatarVisualController::HighlighterDelegate* currentHighlighter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarVisualController::HighlighterDelegate*) == 0x8);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.MeshFilter _headTopMeshFilter
    UnityEngine::MeshFilter*& dyn__headTopMeshFilter();
    // Get instance field reference: private UnityEngine.MeshFilter _glassesMeshFilter
    UnityEngine::MeshFilter*& dyn__glassesMeshFilter();
    // Get instance field reference: private UnityEngine.MeshFilter _facialHairMeshFilter
    UnityEngine::MeshFilter*& dyn__facialHairMeshFilter();
    // Get instance field reference: private UnityEngine.MeshFilter _leftHandsHairMeshFilter
    UnityEngine::MeshFilter*& dyn__leftHandsHairMeshFilter();
    // Get instance field reference: private UnityEngine.MeshFilter _rightHandsHairMeshFilter
    UnityEngine::MeshFilter*& dyn__rightHandsHairMeshFilter();
    // Get instance field reference: private UnityEngine.SpriteRenderer _eyesSprite
    UnityEngine::SpriteRenderer*& dyn__eyesSprite();
    // Get instance field reference: private UnityEngine.SpriteRenderer _mouthSprite
    UnityEngine::SpriteRenderer*& dyn__mouthSprite();
    // Get instance field reference: private UnityEngine.MeshFilter _bodyMeshFilter
    UnityEngine::MeshFilter*& dyn__bodyMeshFilter();
    // Get instance field reference: private MulticolorAvatarPartPropertyBlockSetter _headTopPropertyBlockColorSetter
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter*& dyn__headTopPropertyBlockColorSetter();
    // Get instance field reference: private AvatarPropertyBlockColorSetter _glassesPropertyBlockColorSetter
    GlobalNamespace::AvatarPropertyBlockColorSetter*& dyn__glassesPropertyBlockColorSetter();
    // Get instance field reference: private AvatarPropertyBlockColorSetter _facialHairPropertyBlockColorSetter
    GlobalNamespace::AvatarPropertyBlockColorSetter*& dyn__facialHairPropertyBlockColorSetter();
    // Get instance field reference: private AvatarPropertyBlockColorSetter _skinPropertyBlockColorSetter
    GlobalNamespace::AvatarPropertyBlockColorSetter*& dyn__skinPropertyBlockColorSetter();
    // Get instance field reference: private MulticolorAvatarPartPropertyBlockSetter _clothesPropertyBlockSetter
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter*& dyn__clothesPropertyBlockSetter();
    // Get instance field reference: private MulticolorAvatarPartPropertyBlockSetter _leftHandPropertyBlockSetter
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter*& dyn__leftHandPropertyBlockSetter();
    // Get instance field reference: private MulticolorAvatarPartPropertyBlockSetter _rightHandPropertyBlockSetter
    GlobalNamespace::MulticolorAvatarPartPropertyBlockSetter*& dyn__rightHandPropertyBlockSetter();
    // Get instance field reference: private readonly AvatarPartsModel _avatarPartsModel
    GlobalNamespace::AvatarPartsModel*& dyn__avatarPartsModel();
    // Get instance field reference: private System.Collections.Generic.Dictionary`2<EditAvatarViewController/AvatarEditPart,AvatarVisualController/HighlighterDelegate> _avatarPartHighlightSetters
    System::Collections::Generic::Dictionary_2<GlobalNamespace::EditAvatarViewController::AvatarEditPart, GlobalNamespace::AvatarVisualController::HighlighterDelegate*>*& dyn__avatarPartHighlightSetters();
    // Get instance field reference: private UnityEngine.Color _lightColor
    UnityEngine::Color& dyn__lightColor();
    // Get instance field reference: private AvatarData _avatarData
    GlobalNamespace::AvatarData*& dyn__avatarData();
    // Get instance field reference: private AvatarVisualController/HighlighterDelegate _currentHighlighter
    GlobalNamespace::AvatarVisualController::HighlighterDelegate*& dyn__currentHighlighter();
    // public UnityEngine.Color get_lightColor()
    // Offset: 0x14979A8
    UnityEngine::Color get_lightColor();
    // protected System.Void Awake()
    // Offset: 0x14979B4
    void Awake();
    // public System.Void UpdateAvatarVisual(AvatarData avatarData)
    // Offset: 0x1497BF0
    void UpdateAvatarVisual(GlobalNamespace::AvatarData* avatarData);
    // public System.Void SetLightColor(UnityEngine.Color color)
    // Offset: 0x1492498
    void SetLightColor(UnityEngine::Color color);
    // private System.Void UpdateAvatarColors()
    // Offset: 0x1498040
    void UpdateAvatarColors();
    // public System.Void HighlightEditedPart(EditAvatarViewController/AvatarEditPart editPart, System.Int32 uvSegment)
    // Offset: 0x14983B0
    void HighlightEditedPart(GlobalNamespace::EditAvatarViewController::AvatarEditPart editPart, int uvSegment);
    // public System.Void DisableEditedPartHighlight()
    // Offset: 0x14986DC
    void DisableEditedPartHighlight();
    // private System.Void SetHandsHighlight(System.Boolean highlighted, System.Int32 uvSegment)
    // Offset: 0x1498710
    void SetHandsHighlight(bool highlighted, int uvSegment);
    // public System.Void .ctor()
    // Offset: 0x149875C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AvatarVisualController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::AvatarVisualController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AvatarVisualController*, creationType>()));
    }
  }; // AvatarVisualController
  #pragma pack(pop)
  static check_size<sizeof(AvatarVisualController), 184 + sizeof(GlobalNamespace::AvatarVisualController::HighlighterDelegate*)> __GlobalNamespace_AvatarVisualControllerSizeCheck;
  static_assert(sizeof(AvatarVisualController) == 0xC0);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::AvatarVisualController::get_lightColor
// Il2CppName: get_lightColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<UnityEngine::Color (GlobalNamespace::AvatarVisualController::*)()>(&GlobalNamespace::AvatarVisualController::get_lightColor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AvatarVisualController*), "get_lightColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AvatarVisualController::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AvatarVisualController::*)()>(&GlobalNamespace::AvatarVisualController::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AvatarVisualController*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AvatarVisualController::UpdateAvatarVisual
// Il2CppName: UpdateAvatarVisual
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AvatarVisualController::*)(GlobalNamespace::AvatarData*)>(&GlobalNamespace::AvatarVisualController::UpdateAvatarVisual)> {
  static const MethodInfo* get() {
    static auto* avatarData = &::il2cpp_utils::GetClassFromName("", "AvatarData")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AvatarVisualController*), "UpdateAvatarVisual", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{avatarData});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AvatarVisualController::SetLightColor
// Il2CppName: SetLightColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AvatarVisualController::*)(UnityEngine::Color)>(&GlobalNamespace::AvatarVisualController::SetLightColor)> {
  static const MethodInfo* get() {
    static auto* color = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AvatarVisualController*), "SetLightColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{color});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AvatarVisualController::UpdateAvatarColors
// Il2CppName: UpdateAvatarColors
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AvatarVisualController::*)()>(&GlobalNamespace::AvatarVisualController::UpdateAvatarColors)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AvatarVisualController*), "UpdateAvatarColors", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AvatarVisualController::HighlightEditedPart
// Il2CppName: HighlightEditedPart
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AvatarVisualController::*)(GlobalNamespace::EditAvatarViewController::AvatarEditPart, int)>(&GlobalNamespace::AvatarVisualController::HighlightEditedPart)> {
  static const MethodInfo* get() {
    static auto* editPart = &::il2cpp_utils::GetClassFromName("", "EditAvatarViewController/AvatarEditPart")->byval_arg;
    static auto* uvSegment = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AvatarVisualController*), "HighlightEditedPart", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{editPart, uvSegment});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AvatarVisualController::DisableEditedPartHighlight
// Il2CppName: DisableEditedPartHighlight
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AvatarVisualController::*)()>(&GlobalNamespace::AvatarVisualController::DisableEditedPartHighlight)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AvatarVisualController*), "DisableEditedPartHighlight", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AvatarVisualController::SetHandsHighlight
// Il2CppName: SetHandsHighlight
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AvatarVisualController::*)(bool, int)>(&GlobalNamespace::AvatarVisualController::SetHandsHighlight)> {
  static const MethodInfo* get() {
    static auto* highlighted = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    static auto* uvSegment = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AvatarVisualController*), "SetHandsHighlight", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{highlighted, uvSegment});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AvatarVisualController::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
