// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: EaseType
#include "GlobalNamespace/EaseType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Tweening
namespace Tweening {
  // Forward declaring type: TimeTweeningManager
  class TimeTweeningManager;
  // Forward declaring type: Tween`1<T>
  template<typename T>
  class Tween_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AvatarTweenController
  class AvatarTweenController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::AvatarTweenController);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AvatarTweenController*, "", "AvatarTweenController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x140
  #pragma pack(push, 1)
  // Autogenerated type: AvatarTweenController
  // [TokenAttribute] Offset: FFFFFFFF
  class AvatarTweenController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::AvatarTweenController::$$c__DisplayClass52_0
    class $$c__DisplayClass52_0;
    // Nested type: ::GlobalNamespace::AvatarTweenController::$AppearAnimation$d__53
    class $AppearAnimation$d__53;
    // Nested type: ::GlobalNamespace::AvatarTweenController::$DisappearAnimation$d__58
    class $DisappearAnimation$d__58;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [HeaderAttribute] Offset: 0x124AEDC
    // private UnityEngine.Transform _avatarTransform
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Transform* avatarTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _headParent
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* headParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _leftHandTransform
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* leftHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _rightHandTransform
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* rightHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _bodyTransform
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* bodyTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [HeaderAttribute] Offset: 0x124AF68
    // private UnityEngine.Transform _headInnerTransform
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* headInnerTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _leftHandInnerTransform
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* leftHandInnerTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _rightHandInnerTransform
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* rightHandInnerTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _bodyInnerTransform
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* bodyInnerTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [HeaderAttribute] Offset: 0x124AFE4
    // [RangeAttribute] Offset: 0x124AFE4
    // private System.Single _popDuration
    // Size: 0x4
    // Offset: 0x60
    float popDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private EaseType _popEaseType
    // Size: 0x4
    // Offset: 0x64
    ::GlobalNamespace::EaseType popEaseType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EaseType) == 0x4);
    // private System.Single _headPopAmount
    // Size: 0x4
    // Offset: 0x68
    float headPopAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _handsPopAmount
    // Size: 0x4
    // Offset: 0x6C
    float handsPopAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _clothesPopAmount
    // Size: 0x4
    // Offset: 0x70
    float clothesPopAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _allPopAmount
    // Size: 0x4
    // Offset: 0x74
    float allPopAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0x124B098
    // [RangeAttribute] Offset: 0x124B098
    // private System.Single _appearDuration
    // Size: 0x4
    // Offset: 0x78
    float appearDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x124B0FC
    // private System.Single _appearSpacing
    // Size: 0x4
    // Offset: 0x7C
    float appearSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _appearHeight
    // Size: 0x4
    // Offset: 0x80
    float appearHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [MinAttribute] Offset: 0x124B14C
    // private UnityEngine.Vector3 _squashFactor
    // Size: 0xC
    // Offset: 0x84
    ::UnityEngine::Vector3 squashFactor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [HeaderAttribute] Offset: 0x124B188
    // [RangeAttribute] Offset: 0x124B188
    // private System.Single _disappearDuration
    // Size: 0x4
    // Offset: 0x90
    float disappearDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _disappearHeight
    // Size: 0x4
    // Offset: 0x94
    float disappearHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _disappearSquash
    // Size: 0xC
    // Offset: 0x98
    ::UnityEngine::Vector3 disappearSquash;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private EaseType _disappearScaleEase
    // Size: 0x4
    // Offset: 0xA4
    ::GlobalNamespace::EaseType disappearScaleEase;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EaseType) == 0x4);
    // private EaseType _disappearPositionEase
    // Size: 0x4
    // Offset: 0xA8
    ::GlobalNamespace::EaseType disappearPositionEase;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EaseType) == 0x4);
    // Padding between fields: disappearPositionEase and: tweeningManager
    char __padding23[0x4] = {};
    // [InjectAttribute] Offset: 0x124B230
    // private readonly Tweening.TimeTweeningManager _tweeningManager
    // Size: 0x8
    // Offset: 0xB0
    ::Tweening::TimeTweeningManager* tweeningManager;
    // Field size check
    static_assert(sizeof(::Tweening::TimeTweeningManager*) == 0x8);
    // private Tweening.Tween`1<System.Single> _popHeadTween
    // Size: 0x8
    // Offset: 0xB8
    ::Tweening::Tween_1<float>* popHeadTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<float>*) == 0x8);
    // private Tweening.Tween`1<System.Single> _popLeftHandTween
    // Size: 0x8
    // Offset: 0xC0
    ::Tweening::Tween_1<float>* popLeftHandTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<float>*) == 0x8);
    // private Tweening.Tween`1<System.Single> _popRightHandTween
    // Size: 0x8
    // Offset: 0xC8
    ::Tweening::Tween_1<float>* popRightHandTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<float>*) == 0x8);
    // private Tweening.Tween`1<System.Single> _popClothesTween
    // Size: 0x8
    // Offset: 0xD0
    ::Tweening::Tween_1<float>* popClothesTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<float>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _appearHeadPositionTween
    // Size: 0x8
    // Offset: 0xD8
    ::Tweening::Tween_1<::UnityEngine::Vector3>* appearHeadPositionTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _appearHeadScaleTween
    // Size: 0x8
    // Offset: 0xE0
    ::Tweening::Tween_1<::UnityEngine::Vector3>* appearHeadScaleTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _appearBodyPositionTween
    // Size: 0x8
    // Offset: 0xE8
    ::Tweening::Tween_1<::UnityEngine::Vector3>* appearBodyPositionTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _appearBodyScaleTween
    // Size: 0x8
    // Offset: 0xF0
    ::Tweening::Tween_1<::UnityEngine::Vector3>* appearBodyScaleTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _appearRightHandPositionTween
    // Size: 0x8
    // Offset: 0xF8
    ::Tweening::Tween_1<::UnityEngine::Vector3>* appearRightHandPositionTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _appearRightHandScaleTween
    // Size: 0x8
    // Offset: 0x100
    ::Tweening::Tween_1<::UnityEngine::Vector3>* appearRightHandScaleTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _appearLeftHandPositionTween
    // Size: 0x8
    // Offset: 0x108
    ::Tweening::Tween_1<::UnityEngine::Vector3>* appearLeftHandPositionTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _appearLeftHandScaleTween
    // Size: 0x8
    // Offset: 0x110
    ::Tweening::Tween_1<::UnityEngine::Vector3>* appearLeftHandScaleTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _disappearScaleTween
    // Size: 0x8
    // Offset: 0x118
    ::Tweening::Tween_1<::UnityEngine::Vector3>* disappearScaleTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private Tweening.Tween`1<UnityEngine.Vector3> _disappearPositionTween
    // Size: 0x8
    // Offset: 0x120
    ::Tweening::Tween_1<::UnityEngine::Vector3>* disappearPositionTween;
    // Field size check
    static_assert(sizeof(::Tweening::Tween_1<::UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.Vector3 _avatarLocalPosition
    // Size: 0xC
    // Offset: 0x128
    ::UnityEngine::Vector3 avatarLocalPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _avatarLocalScale
    // Size: 0xC
    // Offset: 0x134
    ::UnityEngine::Vector3 avatarLocalScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Transform _avatarTransform
    ::UnityEngine::Transform*& dyn__avatarTransform();
    // Get instance field reference: private UnityEngine.Transform _headParent
    ::UnityEngine::Transform*& dyn__headParent();
    // Get instance field reference: private UnityEngine.Transform _leftHandTransform
    ::UnityEngine::Transform*& dyn__leftHandTransform();
    // Get instance field reference: private UnityEngine.Transform _rightHandTransform
    ::UnityEngine::Transform*& dyn__rightHandTransform();
    // Get instance field reference: private UnityEngine.Transform _bodyTransform
    ::UnityEngine::Transform*& dyn__bodyTransform();
