// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: HeadBodyOffsetSO
  class HeadBodyOffsetSO;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: AvatarPoseController
  class AvatarPoseController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::AvatarPoseController::PositionsWillBeSetDelegate
    class PositionsWillBeSetDelegate;
    // Nested type: GlobalNamespace::AvatarPoseController::LatePositionsWillBeSetDelegate
    class LatePositionsWillBeSetDelegate;
    // Nested type: GlobalNamespace::AvatarPoseController::RotationsWillBeSetDelegate
    class RotationsWillBeSetDelegate;
    // protected UnityEngine.Transform _headTransform
    // Offset: 0x18
    UnityEngine::Transform* headTransform;
    // protected UnityEngine.Transform _leftHandTransform
    // Offset: 0x20
    UnityEngine::Transform* leftHandTransform;
    // protected UnityEngine.Transform _rightHandTransform
    // Offset: 0x28
    UnityEngine::Transform* rightHandTransform;
    // protected UnityEngine.Transform _bodyTransform
    // Offset: 0x30
    UnityEngine::Transform* bodyTransform;
    // protected HeadBodyOffsetSO _headBodyOffset
    // Offset: 0x38
    GlobalNamespace::HeadBodyOffsetSO* headBodyOffset;
    // private AvatarPoseController/PositionsWillBeSetDelegate <earlyPositionsWillBeSetCallback>k__BackingField
    // Offset: 0x40
    GlobalNamespace::AvatarPoseController::PositionsWillBeSetDelegate* earlyPositionsWillBeSetCallback;
    // private AvatarPoseController/LatePositionsWillBeSetDelegate <latePositionsWillBeSetCallback>k__BackingField
    // Offset: 0x48
    GlobalNamespace::AvatarPoseController::LatePositionsWillBeSetDelegate* latePositionsWillBeSetCallback;
    // private AvatarPoseController/RotationsWillBeSetDelegate <earlyRotationsWillBeSetCallback>k__BackingField
    // Offset: 0x50
    GlobalNamespace::AvatarPoseController::RotationsWillBeSetDelegate* earlyRotationsWillBeSetCallback;
    // private System.Action`1<UnityEngine.Vector3> didUpdatePoseEvent
    // Offset: 0x58
    System::Action_1<UnityEngine::Vector3>* didUpdatePoseEvent;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public AvatarPoseController/PositionsWillBeSetDelegate get_earlyPositionsWillBeSetCallback()
    // Offset: 0x2033204
    GlobalNamespace::AvatarPoseController::PositionsWillBeSetDelegate* get_earlyPositionsWillBeSetCallback();
    // public System.Void set_earlyPositionsWillBeSetCallback(AvatarPoseController/PositionsWillBeSetDelegate value)
    // Offset: 0x203320C
    void set_earlyPositionsWillBeSetCallback(GlobalNamespace::AvatarPoseController::PositionsWillBeSetDelegate* value);
    // public AvatarPoseController/LatePositionsWillBeSetDelegate get_latePositionsWillBeSetCallback()
    // Offset: 0x2033214
    GlobalNamespace::AvatarPoseController::LatePositionsWillBeSetDelegate* get_latePositionsWillBeSetCallback();
    // public System.Void set_latePositionsWillBeSetCallback(AvatarPoseController/LatePositionsWillBeSetDelegate value)
    // Offset: 0x203321C
    void set_latePositionsWillBeSetCallback(GlobalNamespace::AvatarPoseController::LatePositionsWillBeSetDelegate* value);
    // public AvatarPoseController/RotationsWillBeSetDelegate get_earlyRotationsWillBeSetCallback()
    // Offset: 0x2033224
    GlobalNamespace::AvatarPoseController::RotationsWillBeSetDelegate* get_earlyRotationsWillBeSetCallback();
    // public System.Void set_earlyRotationsWillBeSetCallback(AvatarPoseController/RotationsWillBeSetDelegate value)
    // Offset: 0x203322C
    void set_earlyRotationsWillBeSetCallback(GlobalNamespace::AvatarPoseController::RotationsWillBeSetDelegate* value);
    // public System.Void add_didUpdatePoseEvent(System.Action`1<UnityEngine.Vector3> value)
    // Offset: 0x2032A3C
    void add_didUpdatePoseEvent(System::Action_1<UnityEngine::Vector3>* value);
    // public System.Void remove_didUpdatePoseEvent(System.Action`1<UnityEngine.Vector3> value)
    // Offset: 0x2032BB8
    void remove_didUpdatePoseEvent(System::Action_1<UnityEngine::Vector3>* value);
    // public System.Void UpdateTransforms(UnityEngine.Vector3 headPosition, UnityEngine.Vector3 leftHandPosition, UnityEngine.Vector3 rightHandPosition, UnityEngine.Quaternion headRotation, UnityEngine.Quaternion leftHandRotation, UnityEngine.Quaternion rightHandRotation)
    // Offset: 0x2033234
    void UpdateTransforms(UnityEngine::Vector3 headPosition, UnityEngine::Vector3 leftHandPosition, UnityEngine::Vector3 rightHandPosition, UnityEngine::Quaternion headRotation, UnityEngine::Quaternion leftHandRotation, UnityEngine::Quaternion rightHandRotation);
    // public System.Void UpdateBodyPosition()
    // Offset: 0x202AFC4
    void UpdateBodyPosition();
    // public System.Void .ctor()
    // Offset: 0x2033F38
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static AvatarPoseController* New_ctor();
  }; // AvatarPoseController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AvatarPoseController*, "", "AvatarPoseController");
#pragma pack(pop)
