// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: AvatarSaveData
  class AvatarSaveData : public ::Il2CppObject {
    public:
    // public System.String headTopId
    // Offset: 0x10
    ::Il2CppString* headTopId;
    // public System.String glassesId
    // Offset: 0x18
    ::Il2CppString* glassesId;
    // public System.String facialHairId
    // Offset: 0x20
    ::Il2CppString* facialHairId;
    // public System.String handsId
    // Offset: 0x28
    ::Il2CppString* handsId;
    // public System.String clothesId
    // Offset: 0x30
    ::Il2CppString* clothesId;
    // public System.String skinColorId
    // Offset: 0x38
    ::Il2CppString* skinColorId;
    // public System.String mouthId
    // Offset: 0x40
    ::Il2CppString* mouthId;
    // public System.String eyesId
    // Offset: 0x48
    ::Il2CppString* eyesId;
    // public UnityEngine.Color headTopPrimaryColor
    // Offset: 0x50
    UnityEngine::Color headTopPrimaryColor;
    // public UnityEngine.Color headTopSecondaryColor
    // Offset: 0x60
    UnityEngine::Color headTopSecondaryColor;
    // public UnityEngine.Color glassesColor
    // Offset: 0x70
    UnityEngine::Color glassesColor;
    // public UnityEngine.Color facialHairColor
    // Offset: 0x80
    UnityEngine::Color facialHairColor;
    // public UnityEngine.Color handsColor
    // Offset: 0x90
    UnityEngine::Color handsColor;
    // public UnityEngine.Color clothesPrimaryColor
    // Offset: 0xA0
    UnityEngine::Color clothesPrimaryColor;
    // public UnityEngine.Color clothesSecondaryColor
    // Offset: 0xB0
    UnityEngine::Color clothesSecondaryColor;
    // public UnityEngine.Color clothesDetailColor
    // Offset: 0xC0
    UnityEngine::Color clothesDetailColor;
    // public System.Void .ctor()
    // Offset: 0x1A43B18
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static AvatarSaveData* New_ctor();
  }; // AvatarSaveData
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::AvatarSaveData*, "", "AvatarSaveData");
#pragma pack(pop)
