// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Cubemap
  class Cubemap;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BakerySkyLight
  class BakerySkyLight;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BakerySkyLight);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BakerySkyLight*, "", "BakerySkyLight");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x5C
  #pragma pack(push, 1)
  // Autogenerated type: BakerySkyLight
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class BakerySkyLight : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String texName
    // Size: 0x8
    // Offset: 0x18
    ::StringW texName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.Color color
    // Size: 0x10
    // Offset: 0x20
    ::UnityEngine::Color color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Single intensity
    // Size: 0x4
    // Offset: 0x30
    float intensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 samples
    // Size: 0x4
    // Offset: 0x34
    int samples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean hemispherical
    // Size: 0x1
    // Offset: 0x38
    bool hemispherical;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hemispherical and: bitmask
    char __padding4[0x3] = {};
    // public System.Int32 bitmask
    // Size: 0x4
    // Offset: 0x3C
    int bitmask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean bakeToIndirect
    // Size: 0x1
    // Offset: 0x40
    bool bakeToIndirect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bakeToIndirect and: indirectIntensity
    char __padding6[0x3] = {};
    // public System.Single indirectIntensity
    // Size: 0x4
    // Offset: 0x44
    float indirectIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean tangentSH
    // Size: 0x1
    // Offset: 0x48
    bool tangentSH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean correctRotation
    // Size: 0x1
    // Offset: 0x49
    bool correctRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: correctRotation and: cubemap
    char __padding9[0x6] = {};
    // public UnityEngine.Cubemap cubemap
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Cubemap* cubemap;
    // Field size check
    static_assert(sizeof(::UnityEngine::Cubemap*) == 0x8);
    // public System.Int32 UID
    // Size: 0x4
    // Offset: 0x58
    int UID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static public System.Int32 lightsChanged
    static int _get_lightsChanged();
    // Set static field: static public System.Int32 lightsChanged
    static void _set_lightsChanged(int value);
    // Get instance field reference: public System.String texName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_texName();
    // Get instance field reference: public UnityEngine.Color color
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_color();
    // Get instance field reference: public System.Single intensity
    [[deprecated("Use field access instead!")]] float& dyn_intensity();
    // Get instance field reference: public System.Int32 samples
    [[deprecated("Use field access instead!")]] int& dyn_samples();
    // Get instance field reference: public System.Boolean hemispherical
    [[deprecated("Use field access instead!")]] bool& dyn_hemispherical();
    // Get instance field reference: public System.Int32 bitmask
    [[deprecated("Use field access instead!")]] int& dyn_bitmask();
    // Get instance field reference: public System.Boolean bakeToIndirect
    [[deprecated("Use field access instead!")]] bool& dyn_bakeToIndirect();
    // Get instance field reference: public System.Single indirectIntensity
    [[deprecated("Use field access instead!")]] float& dyn_indirectIntensity();
    // Get instance field reference: public System.Boolean tangentSH
    [[deprecated("Use field access instead!")]] bool& dyn_tangentSH();
    // Get instance field reference: public System.Boolean correctRotation
    [[deprecated("Use field access instead!")]] bool& dyn_correctRotation();
    // Get instance field reference: public UnityEngine.Cubemap cubemap
    [[deprecated("Use field access instead!")]] ::UnityEngine::Cubemap*& dyn_cubemap();
    // Get instance field reference: public System.Int32 UID
    [[deprecated("Use field access instead!")]] int& dyn_UID();
    // public System.Void .ctor()
    // Offset: 0x1BD5E30
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BakerySkyLight* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::BakerySkyLight::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BakerySkyLight*, creationType>()));
    }
    // static private System.Void .cctor()
    // Offset: 0x1BD5EB8
    static void _cctor();
  }; // BakerySkyLight
  #pragma pack(pop)
  static check_size<sizeof(BakerySkyLight), 88 + sizeof(int)> __GlobalNamespace_BakerySkyLightSizeCheck;
  static_assert(sizeof(BakerySkyLight) == 0x5C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::BakerySkyLight::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::BakerySkyLight::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&GlobalNamespace::BakerySkyLight::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::BakerySkyLight*), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
