// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Zenject.MonoInstaller
#include "Zenject/MonoInstaller.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MirroredCubeNoteController
  class MirroredCubeNoteController;
  // Forward declaring type: MirroredBombNoteController
  class MirroredBombNoteController;
  // Forward declaring type: MirroredObstacleController
  class MirroredObstacleController;
  // Forward declaring type: MainSettingsModelSO
  class MainSettingsModelSO;
  // Forward declaring type: MirrorRendererGraphicsSettingsPresets
  class MirrorRendererGraphicsSettingsPresets;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: BakedReflectionProbeInstaller
  class BakedReflectionProbeInstaller : public Zenject::MonoInstaller {
    public:
    // Nested type: GlobalNamespace::BakedReflectionProbeInstaller::$$c
    class $$c;
    // [SpaceAttribute] Offset: 0xE207B0
    // private MirroredCubeNoteController _mirroredGameNoteControllerPrefab
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::MirroredCubeNoteController* mirroredGameNoteControllerPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MirroredCubeNoteController*) == 0x8);
    // private MirroredBombNoteController _mirroredBombNoteControllerPrefab
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::MirroredBombNoteController* mirroredBombNoteControllerPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MirroredBombNoteController*) == 0x8);
    // private MirroredObstacleController _mirroredObstacleControllerPrefab
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::MirroredObstacleController* mirroredObstacleControllerPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MirroredObstacleController*) == 0x8);
    // [SpaceAttribute] Offset: 0xE20808
    // private MainSettingsModelSO _mainSettingsModel
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::MainSettingsModelSO* mainSettingsModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MainSettingsModelSO*) == 0x8);
    // private MirrorRendererGraphicsSettingsPresets _mirrorRendererGraphicsSettingsPresets
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::MirrorRendererGraphicsSettingsPresets* mirrorRendererGraphicsSettingsPresets;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MirrorRendererGraphicsSettingsPresets*) == 0x8);
    // Creating value type constructor for type: BakedReflectionProbeInstaller
    BakedReflectionProbeInstaller(GlobalNamespace::MirroredCubeNoteController* mirroredGameNoteControllerPrefab_ = {}, GlobalNamespace::MirroredBombNoteController* mirroredBombNoteControllerPrefab_ = {}, GlobalNamespace::MirroredObstacleController* mirroredObstacleControllerPrefab_ = {}, GlobalNamespace::MainSettingsModelSO* mainSettingsModel_ = {}, GlobalNamespace::MirrorRendererGraphicsSettingsPresets* mirrorRendererGraphicsSettingsPresets_ = {}) noexcept : mirroredGameNoteControllerPrefab{mirroredGameNoteControllerPrefab_}, mirroredBombNoteControllerPrefab{mirroredBombNoteControllerPrefab_}, mirroredObstacleControllerPrefab{mirroredObstacleControllerPrefab_}, mainSettingsModel{mainSettingsModel_}, mirrorRendererGraphicsSettingsPresets{mirrorRendererGraphicsSettingsPresets_} {}
    // public MirroredCubeNoteController get_mirroredGameNoteControllerPrefab()
    // Offset: 0x119D950
    GlobalNamespace::MirroredCubeNoteController* get_mirroredGameNoteControllerPrefab();
    // public override System.Void InstallBindings()
    // Offset: 0x119D958
    // Implemented from: Zenject.MonoInstallerBase
    // Base method: System.Void MonoInstallerBase::InstallBindings()
    void InstallBindings();
    // public System.Void .ctor()
    // Offset: 0x119DC98
    // Implemented from: Zenject.MonoInstaller
    // Base method: System.Void MonoInstaller::.ctor()
    // Base method: System.Void MonoInstallerBase::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BakedReflectionProbeInstaller* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::BakedReflectionProbeInstaller::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BakedReflectionProbeInstaller*, creationType>()));
    }
  }; // BakedReflectionProbeInstaller
  #pragma pack(pop)
  static check_size<sizeof(BakedReflectionProbeInstaller), 64 + sizeof(GlobalNamespace::MirrorRendererGraphicsSettingsPresets*)> __GlobalNamespace_BakedReflectionProbeInstallerSizeCheck;
  static_assert(sizeof(BakedReflectionProbeInstaller) == 0x48);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::BakedReflectionProbeInstaller*, "", "BakedReflectionProbeInstaller");
