// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: BeatmapObjectSpawnController
#include "GlobalNamespace/BeatmapObjectSpawnController.hpp"
// Including type: BeatmapObjectSpawnMovementData/NoteJumpValueType
#include "GlobalNamespace/BeatmapObjectSpawnMovementData.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x28
  #pragma pack(push, 1)
  // Autogenerated type: BeatmapObjectSpawnController/InitData
  // [TokenAttribute] Offset: FFFFFFFF
  class BeatmapObjectSpawnController::InitData : public ::Il2CppObject {
    public:
    // public readonly System.Single beatsPerMinute
    // Size: 0x4
    // Offset: 0x10
    float beatsPerMinute;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public readonly System.Int32 noteLinesCount
    // Size: 0x4
    // Offset: 0x14
    int noteLinesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public readonly System.Single noteJumpMovementSpeed
    // Size: 0x4
    // Offset: 0x18
    float noteJumpMovementSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public readonly BeatmapObjectSpawnMovementData/NoteJumpValueType noteJumpValueType
    // Size: 0x4
    // Offset: 0x1C
    GlobalNamespace::BeatmapObjectSpawnMovementData::NoteJumpValueType noteJumpValueType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapObjectSpawnMovementData::NoteJumpValueType) == 0x4);
    // public readonly System.Single noteJumpValue
    // Size: 0x4
    // Offset: 0x20
    float noteJumpValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public readonly System.Single jumpOffsetY
    // Size: 0x4
    // Offset: 0x24
    float jumpOffsetY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: InitData
    InitData(float beatsPerMinute_ = {}, int noteLinesCount_ = {}, float noteJumpMovementSpeed_ = {}, GlobalNamespace::BeatmapObjectSpawnMovementData::NoteJumpValueType noteJumpValueType_ = {}, float noteJumpValue_ = {}, float jumpOffsetY_ = {}) noexcept : beatsPerMinute{beatsPerMinute_}, noteLinesCount{noteLinesCount_}, noteJumpMovementSpeed{noteJumpMovementSpeed_}, noteJumpValueType{noteJumpValueType_}, noteJumpValue{noteJumpValue_}, jumpOffsetY{jumpOffsetY_} {}
    // Get instance field reference: public readonly System.Single beatsPerMinute
    float& dyn_beatsPerMinute();
    // Get instance field reference: public readonly System.Int32 noteLinesCount
    int& dyn_noteLinesCount();
    // Get instance field reference: public readonly System.Single noteJumpMovementSpeed
    float& dyn_noteJumpMovementSpeed();
    // Get instance field reference: public readonly BeatmapObjectSpawnMovementData/NoteJumpValueType noteJumpValueType
    GlobalNamespace::BeatmapObjectSpawnMovementData::NoteJumpValueType& dyn_noteJumpValueType();
    // Get instance field reference: public readonly System.Single noteJumpValue
    float& dyn_noteJumpValue();
    // Get instance field reference: public readonly System.Single jumpOffsetY
    float& dyn_jumpOffsetY();
    // public System.Void .ctor(System.Single beatsPerMinute, System.Int32 noteLinesCount, System.Single noteJumpMovementSpeed, BeatmapObjectSpawnMovementData/NoteJumpValueType noteJumpValueType, System.Single noteJumpValue, System.Single jumpOffsetY)
    // Offset: 0x132F5A0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BeatmapObjectSpawnController::InitData* New_ctor(float beatsPerMinute, int noteLinesCount, float noteJumpMovementSpeed, GlobalNamespace::BeatmapObjectSpawnMovementData::NoteJumpValueType noteJumpValueType, float noteJumpValue, float jumpOffsetY) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::BeatmapObjectSpawnController::InitData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BeatmapObjectSpawnController::InitData*, creationType>(beatsPerMinute, noteLinesCount, noteJumpMovementSpeed, noteJumpValueType, noteJumpValue, jumpOffsetY)));
    }
  }; // BeatmapObjectSpawnController/InitData
  #pragma pack(pop)
  static check_size<sizeof(BeatmapObjectSpawnController::InitData), 36 + sizeof(float)> __GlobalNamespace_BeatmapObjectSpawnController_InitDataSizeCheck;
  static_assert(sizeof(BeatmapObjectSpawnController::InitData) == 0x28);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::BeatmapObjectSpawnController::InitData*, "", "BeatmapObjectSpawnController/InitData");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::BeatmapObjectSpawnController::InitData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
