// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PreviewBeatmapLevelSO
  class PreviewBeatmapLevelSO;
  // Forward declaring type: IPreviewBeatmapLevel
  class IPreviewBeatmapLevel;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BeatmapLevelsPromoDataSO
  class BeatmapLevelsPromoDataSO;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BeatmapLevelsPromoDataSO);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BeatmapLevelsPromoDataSO*, "", "BeatmapLevelsPromoDataSO");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: BeatmapLevelsPromoDataSO
  // [TokenAttribute] Offset: FFFFFFFF
  class BeatmapLevelsPromoDataSO : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::GlobalNamespace::BeatmapLevelsPromoDataSO::$$c
    class $$c;
    public:
    // private System.Collections.Generic.List`1<PreviewBeatmapLevelSO> _promotedBeatmapLevels
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::GlobalNamespace::PreviewBeatmapLevelSO*>* promotedBeatmapLevels;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::PreviewBeatmapLevelSO*>*) == 0x8);
    // private System.Collections.Generic.List`1<PreviewBeatmapLevelSO> _updatedBeatmapLevels
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::GlobalNamespace::PreviewBeatmapLevelSO*>* updatedBeatmapLevels;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::PreviewBeatmapLevelSO*>*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.String> _promotedBeatmapLevelsSet
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::HashSet_1<::StringW>* promotedBeatmapLevelsSet;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::StringW>*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.String> _updatedBeatmapLevelsSet
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::HashSet_1<::StringW>* updatedBeatmapLevelsSet;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::StringW>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Collections.Generic.List`1<PreviewBeatmapLevelSO> _promotedBeatmapLevels
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GlobalNamespace::PreviewBeatmapLevelSO*>*& dyn__promotedBeatmapLevels();
    // Get instance field reference: private System.Collections.Generic.List`1<PreviewBeatmapLevelSO> _updatedBeatmapLevels
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GlobalNamespace::PreviewBeatmapLevelSO*>*& dyn__updatedBeatmapLevels();
    // Get instance field reference: private System.Collections.Generic.HashSet`1<System.String> _promotedBeatmapLevelsSet
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::HashSet_1<::StringW>*& dyn__promotedBeatmapLevelsSet();
    // Get instance field reference: private System.Collections.Generic.HashSet`1<System.String> _updatedBeatmapLevelsSet
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::HashSet_1<::StringW>*& dyn__updatedBeatmapLevelsSet();
    // public System.Void .ctor()
    // Offset: 0x156C660
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BeatmapLevelsPromoDataSO* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::BeatmapLevelsPromoDataSO::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BeatmapLevelsPromoDataSO*, creationType>()));
    }
    // public System.Boolean IsBeatmapLevelPromoted(IPreviewBeatmapLevel beatmapLevel)
    // Offset: 0x156C2D8
    bool IsBeatmapLevelPromoted(::GlobalNamespace::IPreviewBeatmapLevel* beatmapLevel);
    // public System.Boolean IsBeatmapLevelUpdated(IPreviewBeatmapLevel beatmapLevel)
    // Offset: 0x156C49C
    bool IsBeatmapLevelUpdated(::GlobalNamespace::IPreviewBeatmapLevel* beatmapLevel);
  }; // BeatmapLevelsPromoDataSO
  #pragma pack(pop)
  static check_size<sizeof(BeatmapLevelsPromoDataSO), 48 + sizeof(::System::Collections::Generic::HashSet_1<::StringW>*)> __GlobalNamespace_BeatmapLevelsPromoDataSOSizeCheck;
  static_assert(sizeof(BeatmapLevelsPromoDataSO) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::BeatmapLevelsPromoDataSO::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::BeatmapLevelsPromoDataSO::IsBeatmapLevelPromoted
// Il2CppName: IsBeatmapLevelPromoted
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (GlobalNamespace::BeatmapLevelsPromoDataSO::*)(::GlobalNamespace::IPreviewBeatmapLevel*)>(&GlobalNamespace::BeatmapLevelsPromoDataSO::IsBeatmapLevelPromoted)> {
  static const MethodInfo* get() {
    static auto* beatmapLevel = &::il2cpp_utils::GetClassFromName("", "IPreviewBeatmapLevel")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::BeatmapLevelsPromoDataSO*), "IsBeatmapLevelPromoted", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{beatmapLevel});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::BeatmapLevelsPromoDataSO::IsBeatmapLevelUpdated
// Il2CppName: IsBeatmapLevelUpdated
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (GlobalNamespace::BeatmapLevelsPromoDataSO::*)(::GlobalNamespace::IPreviewBeatmapLevel*)>(&GlobalNamespace::BeatmapLevelsPromoDataSO::IsBeatmapLevelUpdated)> {
  static const MethodInfo* get() {
    static auto* beatmapLevel = &::il2cpp_utils::GetClassFromName("", "IPreviewBeatmapLevel")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::BeatmapLevelsPromoDataSO*), "IsBeatmapLevelUpdated", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{beatmapLevel});
  }
};
