// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BezierSplineEvaluator
  class BezierSplineEvaluator;
  // Forward declaring type: IAudioTimeSource
  class IAudioTimeSource;
  // Forward declaring type: PlayerTransforms
  class PlayerTransforms;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector3
  struct Vector3;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: BeatmapObjectAvoidancePathEvaluator
  class BeatmapObjectAvoidancePathEvaluator : public ::Il2CppObject {
    public:
    // private readonly System.Single _jumpStartZ
    // Offset: 0x10
    float jumpStartZ;
    // private readonly System.Single _jumpEndZ
    // Offset: 0x14
    float jumpEndZ;
    // private readonly System.Single _zOffset
    // Offset: 0x18
    float zOffset;
    // private readonly System.Single _yOffset
    // Offset: 0x1C
    float yOffset;
    // private readonly System.Single _noteJumpSpeed
    // Offset: 0x20
    float noteJumpSpeed;
    // private readonly System.Single _moveToPlayerHeadTParam
    // Offset: 0x24
    float moveToPlayerHeadTParam;
    // private readonly BezierSplineEvaluator _pathBezierCurveEvaluator
    // Offset: 0x28
    GlobalNamespace::BezierSplineEvaluator* pathBezierCurveEvaluator;
    // private readonly IAudioTimeSource _audioTimeSource
    // Offset: 0x30
    GlobalNamespace::IAudioTimeSource* audioTimeSource;
    // private readonly PlayerTransforms _playerTransforms
    // Offset: 0x38
    GlobalNamespace::PlayerTransforms* playerTransforms;
    // public System.Void .ctor(IAudioTimeSource audioTimeSource, PlayerTransforms playerTransforms, BezierSplineEvaluator pathBezierCurveEvaluator, System.Single jumpStartZ, System.Single jumpEndZ, System.Single yOffset, System.Single zOffset, System.Single noteJumpSeed, System.Single moveToPlayerHeadTParam)
    // Offset: 0x1A24288
    static BeatmapObjectAvoidancePathEvaluator* New_ctor(GlobalNamespace::IAudioTimeSource* audioTimeSource, GlobalNamespace::PlayerTransforms* playerTransforms, GlobalNamespace::BezierSplineEvaluator* pathBezierCurveEvaluator, float jumpStartZ, float jumpEndZ, float yOffset, float zOffset, float noteJumpSeed, float moveToPlayerHeadTParam);
    // public UnityEngine.Vector3 GetCurrentPathPosition()
    // Offset: 0x1A2432C
    UnityEngine::Vector3 GetCurrentPathPosition();
  }; // BeatmapObjectAvoidancePathEvaluator
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::BeatmapObjectAvoidancePathEvaluator*, "", "BeatmapObjectAvoidancePathEvaluator");
#pragma pack(pop)
