// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: IReadonlyBeatmapData
#include "GlobalNamespace/IReadonlyBeatmapData.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatmapEventData
  class BeatmapEventData;
  // Forward declaring type: BeatmapDataItem
  class BeatmapDataItem;
  // Forward declaring type: ISortedList`1<T>
  template<typename T>
  class ISortedList_1;
  // Forward declaring type: BeatmapDataSortedListForTypeAndIds`1<TBase>
  template<typename TBase>
  class BeatmapDataSortedListForTypeAndIds_1;
  // Forward declaring type: BeatmapObjectsInTimeRowProcessor
  class BeatmapObjectsInTimeRowProcessor;
  // Forward declaring type: BeatmapObjectData
  class BeatmapObjectData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: LinkedListNode`1<T>
  template<typename T>
  class LinkedListNode_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: LinkedList`1<T>
  template<typename T>
  class LinkedList_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BeatmapData
  class BeatmapData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BeatmapData);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BeatmapData*, "", "BeatmapData");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x6D
  #pragma pack(push, 1)
  // Autogenerated type: BeatmapData
  // [TokenAttribute] Offset: FFFFFFFF
  class BeatmapData : public ::Il2CppObject/*, public ::GlobalNamespace::IReadonlyBeatmapData*/ {
    public:
    // Nested type: ::GlobalNamespace::BeatmapData::BeatmapDataBinaryHeapItem
    class BeatmapDataBinaryHeapItem;
    // Nested type: ::GlobalNamespace::BeatmapData::$$c__DisplayClass45_0_1<T>
    template<typename T>
    class $$c__DisplayClass45_0_1;
    public:
    // private System.Boolean <updateAllBeatmapDataOnInsert>k__BackingField
    // Size: 0x1
    // Offset: 0x10
    bool updateAllBeatmapDataOnInsert;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: updateAllBeatmapDataOnInsert and: cuttableNotesCount
    char __padding0[0x3] = {};
    // private System.Int32 <cuttableNotesCount>k__BackingField
    // Size: 0x4
    // Offset: 0x14
    int cuttableNotesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <obstaclesCount>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    int obstaclesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <bombsCount>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    int bombsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Action`2<BeatmapEventData,System.Collections.Generic.LinkedListNode`1<BeatmapDataItem>> beatmapEventDataWasInsertedEvent
    // Size: 0x8
    // Offset: 0x20
    ::System::Action_2<::GlobalNamespace::BeatmapEventData*, ::System::Collections::Generic::LinkedListNode_1<::GlobalNamespace::BeatmapDataItem*>*>* beatmapEventDataWasInsertedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::BeatmapEventData*, ::System::Collections::Generic::LinkedListNode_1<::GlobalNamespace::BeatmapDataItem*>*>*) == 0x8);
    // private System.Action`2<BeatmapEventData,System.Collections.Generic.LinkedListNode`1<BeatmapDataItem>> beatmapEventDataWillBeRemovedEvent
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_2<::GlobalNamespace::BeatmapEventData*, ::System::Collections::Generic::LinkedListNode_1<::GlobalNamespace::BeatmapDataItem*>*>* beatmapEventDataWillBeRemovedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::BeatmapEventData*, ::System::Collections::Generic::LinkedListNode_1<::GlobalNamespace::BeatmapDataItem*>*>*) == 0x8);
    // private System.Action`1<BeatmapEventData> beatmapEventDataWasRemovedEvent
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_1<::GlobalNamespace::BeatmapEventData*>* beatmapEventDataWasRemovedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::BeatmapEventData*>*) == 0x8);
    // private readonly ISortedList`1<BeatmapDataItem> _allBeatmapData
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::ISortedList_1<::GlobalNamespace::BeatmapDataItem*>* allBeatmapData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ISortedList_1<::GlobalNamespace::BeatmapDataItem*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<BeatmapDataItem,System.Collections.Generic.LinkedListNode`1<BeatmapDataItem>> _allBeatmapDataItemToNodeMap
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::BeatmapDataItem*, ::System::Collections::Generic::LinkedListNode_1<::GlobalNamespace::BeatmapDataItem*>*>* allBeatmapDataItemToNodeMap;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::GlobalNamespace::BeatmapDataItem*, ::System::Collections::Generic::LinkedListNode_1<::GlobalNamespace::BeatmapDataItem*>*>*) == 0x8);
    // private readonly BeatmapDataSortedListForTypeAndIds`1<BeatmapDataItem> _beatmapDataItemsPerTypeAndId
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::BeatmapDataSortedListForTypeAndIds_1<::GlobalNamespace::BeatmapDataItem*>* beatmapDataItemsPerTypeAndId;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapDataSortedListForTypeAndIds_1<::GlobalNamespace::BeatmapDataItem*>*) == 0x8);
    // private readonly System.Int32 _numberOfLines
    // Size: 0x4
    // Offset: 0x50
    int numberOfLines;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: numberOfLines and: specialBasicBeatmapEventKeywords
    char __padding10[0x4] = {};
    // private readonly System.Collections.Generic.HashSet`1<System.String> _specialBasicBeatmapEventKeywords
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::HashSet_1<::StringW>* specialBasicBeatmapEventKeywords;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::StringW>*) == 0x8);
    // private readonly BeatmapObjectsInTimeRowProcessor _beatmapObjectsInTimeRowProcessor
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::BeatmapObjectsInTimeRowProcessor* beatmapObjectsInTimeRowProcessor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapObjectsInTimeRowProcessor*) == 0x8);
    // private System.Single _prevAddedBeatmapObjectDataTime
    // Size: 0x4
    // Offset: 0x68
    float prevAddedBeatmapObjectDataTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _isCreatingFilteredCopy
    // Size: 0x1
    // Offset: 0x6C
    bool isCreatingFilteredCopy;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IReadonlyBeatmapData
    operator ::GlobalNamespace::IReadonlyBeatmapData() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IReadonlyBeatmapData*>(this);
    }
    // Creating interface conversion operator: i_IReadonlyBeatmapData
    inline ::GlobalNamespace::IReadonlyBeatmapData* i_IReadonlyBeatmapData() noexcept {
      return reinterpret_cast<::GlobalNamespace::IReadonlyBeatmapData*>(this);
    }
    // Get instance field reference: private System.Boolean <updateAllBeatmapDataOnInsert>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$updateAllBeatmapDataOnInsert$k__BackingField();
    // Get instance field reference: private System.Int32 <cuttableNotesCount>k__BackingField
