// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: IReadonlyBeatmapData
#include "GlobalNamespace/IReadonlyBeatmapData.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatmapLineData
  class BeatmapLineData;
  // Forward declaring type: BeatmapEventData
  class BeatmapEventData;
  // Forward declaring type: BeatmapObjectsInTimeRowProcessor
  class BeatmapObjectsInTimeRowProcessor;
  // Forward declaring type: BeatmapEventDataProcessor
  class BeatmapEventDataProcessor;
  // Forward declaring type: IReadonlyBeatmapLineData
  class IReadonlyBeatmapLineData;
  // Forward declaring type: BeatmapObjectData
  class BeatmapObjectData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
  // Forward declaring type: IReadOnlyDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IReadOnlyDictionary_2;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BeatmapData
  class BeatmapData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BeatmapData);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BeatmapData*, "", "BeatmapData");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: BeatmapData
  // [TokenAttribute] Offset: FFFFFFFF
  class BeatmapData : public ::Il2CppObject/*, public ::GlobalNamespace::IReadonlyBeatmapData*/ {
    public:
    // Nested type: ::GlobalNamespace::BeatmapData::$get_beatmapObjectsData$d__32
    class $get_beatmapObjectsData$d__32;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Int32 <cuttableNotesCount>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    int cuttableNotesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <obstaclesCount>k__BackingField
    // Size: 0x4
    // Offset: 0x14
    int obstaclesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <bombsCount>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    int bombsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <spawnRotationEventsCount>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    int spawnRotationEventsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly BeatmapLineData[] _beatmapLinesData
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::GlobalNamespace::BeatmapLineData*> beatmapLinesData;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::BeatmapLineData*>) == 0x8);
    // private readonly System.Collections.Generic.List`1<BeatmapEventData> _beatmapEventsData
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::GlobalNamespace::BeatmapEventData*>* beatmapEventsData;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BeatmapEventData*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.HashSet`1<BeatmapEventType>> _availableSpecialEventsPerKeywordDictionary
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::HashSet_1<::GlobalNamespace::BeatmapEventType>*>* availableSpecialEventsPerKeywordDictionary;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::HashSet_1<::GlobalNamespace::BeatmapEventType>*>*) == 0x8);
    // private readonly BeatmapObjectsInTimeRowProcessor _beatmapObjectsInTimeRowProcessor
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::BeatmapObjectsInTimeRowProcessor* beatmapObjectsInTimeRowProcessor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapObjectsInTimeRowProcessor*) == 0x8);
    // private readonly BeatmapEventDataProcessor _beatmapEventDataProcessor
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::BeatmapEventDataProcessor* beatmapEventDataProcessor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapEventDataProcessor*) == 0x8);
    // private System.Single _prevAddedBeatmapObjectDataTime
    // Size: 0x4
    // Offset: 0x48
    float prevAddedBeatmapObjectDataTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _prevAddedBeatmapEventDataTime
    // Size: 0x4
    // Offset: 0x4C
    float prevAddedBeatmapEventDataTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IReadonlyBeatmapData
    operator ::GlobalNamespace::IReadonlyBeatmapData() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IReadonlyBeatmapData*>(this);
    }
    // Get instance field reference: private System.Int32 <cuttableNotesCount>k__BackingField
    int& dyn_$cuttableNotesCount$k__BackingField();
    // Get instance field reference: private System.Int32 <obstaclesCount>k__BackingField
    int& dyn_$obstaclesCount$k__BackingField();
    // Get instance field reference: private System.Int32 <bombsCount>k__BackingField
    int& dyn_$bombsCount$k__BackingField();
    // Get instance field reference: private System.Int32 <spawnRotationEventsCount>k__BackingField
    int& dyn_$spawnRotationEventsCount$k__BackingField();
