// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: BeatmapDataStrobeFilterTransform
#include "GlobalNamespace/BeatmapDataStrobeFilterTransform.hpp"
// Including type: ColorType
#include "GlobalNamespace/ColorType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BasicBeatmapEventData
  class BasicBeatmapEventData;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData*, "", "BeatmapDataStrobeFilterTransform/StrobeStreakData");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x31
  #pragma pack(push, 1)
  // Autogenerated type: BeatmapDataStrobeFilterTransform/StrobeStreakData
  // [TokenAttribute] Offset: FFFFFFFF
  class BeatmapDataStrobeFilterTransform::StrobeStreakData : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.Boolean isActive
    // Size: 0x1
    // Offset: 0x10
    bool isActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isActive and: strobeStartTime
    char __padding0[0x3] = {};
    // public System.Single strobeStartTime
    // Size: 0x4
    // Offset: 0x14
    float strobeStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public ColorType startColorType
    // Size: 0x4
    // Offset: 0x18
    ::GlobalNamespace::ColorType startColorType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ColorType) == 0x4);
    // public System.Single lastSwitchTime
    // Size: 0x4
    // Offset: 0x1C
    float lastSwitchTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public ColorType lastColorType
    // Size: 0x4
    // Offset: 0x20
    ::GlobalNamespace::ColorType lastColorType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ColorType) == 0x4);
    // public System.Boolean lastIsOn
    // Size: 0x1
    // Offset: 0x24
    bool lastIsOn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lastIsOn and: originalBasicBeatmapEventData
    char __padding5[0x3] = {};
    // public BasicBeatmapEventData originalBasicBeatmapEventData
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::BasicBeatmapEventData* originalBasicBeatmapEventData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BasicBeatmapEventData*) == 0x8);
    // private System.Boolean _foundFirstColoredEventData
    // Size: 0x1
    // Offset: 0x30
    bool foundFirstColoredEventData;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public System.Boolean isActive
    bool& dyn_isActive();
    // Get instance field reference: public System.Single strobeStartTime
    float& dyn_strobeStartTime();
    // Get instance field reference: public ColorType startColorType
    ::GlobalNamespace::ColorType& dyn_startColorType();
    // Get instance field reference: public System.Single lastSwitchTime
    float& dyn_lastSwitchTime();
    // Get instance field reference: public ColorType lastColorType
    ::GlobalNamespace::ColorType& dyn_lastColorType();
    // Get instance field reference: public System.Boolean lastIsOn
    bool& dyn_lastIsOn();
    // Get instance field reference: public BasicBeatmapEventData originalBasicBeatmapEventData
    ::GlobalNamespace::BasicBeatmapEventData*& dyn_originalBasicBeatmapEventData();
    // Get instance field reference: private System.Boolean _foundFirstColoredEventData
    bool& dyn__foundFirstColoredEventData();
    // public System.Void StartPotentialStrobe(BasicBeatmapEventData startBasicBeatmapEventData)
    // Offset: 0x14C47E0
    void StartPotentialStrobe(::GlobalNamespace::BasicBeatmapEventData* startBasicBeatmapEventData);
    // public System.Void AddStrobeData(BasicBeatmapEventData basicBeatmapEventData)
    // Offset: 0x14C474C
    void AddStrobeData(::GlobalNamespace::BasicBeatmapEventData* basicBeatmapEventData);
    // public System.Void .ctor()
    // Offset: 0x14C4744
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BeatmapDataStrobeFilterTransform::StrobeStreakData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BeatmapDataStrobeFilterTransform::StrobeStreakData*, creationType>()));
    }
  }; // BeatmapDataStrobeFilterTransform/StrobeStreakData
  #pragma pack(pop)
  static check_size<sizeof(BeatmapDataStrobeFilterTransform::StrobeStreakData), 48 + sizeof(bool)> __GlobalNamespace_BeatmapDataStrobeFilterTransform_StrobeStreakDataSizeCheck;
  static_assert(sizeof(BeatmapDataStrobeFilterTransform::StrobeStreakData) == 0x31);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData::StartPotentialStrobe
// Il2CppName: StartPotentialStrobe
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData::*)(::GlobalNamespace::BasicBeatmapEventData*)>(&GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData::StartPotentialStrobe)> {
  static const MethodInfo* get() {
    static auto* startBasicBeatmapEventData = &::il2cpp_utils::GetClassFromName("", "BasicBeatmapEventData")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData*), "StartPotentialStrobe", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{startBasicBeatmapEventData});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData::AddStrobeData
// Il2CppName: AddStrobeData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData::*)(::GlobalNamespace::BasicBeatmapEventData*)>(&GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData::AddStrobeData)> {
  static const MethodInfo* get() {
    static auto* basicBeatmapEventData = &::il2cpp_utils::GetClassFromName("", "BasicBeatmapEventData")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData*), "AddStrobeData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{basicBeatmapEventData});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::BeatmapDataStrobeFilterTransform::StrobeStreakData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
