// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Single
#include "System/Single.hpp"
// Including type: BeatmapObjectSpawnMovementData/NoteSpawnData
#include "GlobalNamespace/BeatmapObjectSpawnMovementData_NoteSpawnData.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IAudioTimeSource
  class IAudioTimeSource;
  // Forward declaring type: BeatmapObjectSpawnController
  class BeatmapObjectSpawnController;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: BeatmapObjectAvoidanceYOffsetEvaluator
  // [] Offset: FFFFFFFF
  class BeatmapObjectAvoidanceYOffsetEvaluator : public ::Il2CppObject {
    public:
    // Nested type: GlobalNamespace::BeatmapObjectAvoidanceYOffsetEvaluator::BufferData
    struct BufferData;
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: BeatmapObjectAvoidanceYOffsetEvaluator/BufferData
    // [] Offset: FFFFFFFF
    // [IsReadOnlyAttribute] Offset: FFFFFFFF
    struct BufferData/*, public System::ValueType*/ {
      public:
      // public readonly System.Single songTime
      // Size: 0x4
      // Offset: 0x0
      float songTime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public readonly System.Single yOffset
      // Size: 0x4
      // Offset: 0x4
      float yOffset;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // Creating value type constructor for type: BufferData
      constexpr BufferData(float songTime_ = {}, float yOffset_ = {}) noexcept : songTime{songTime_}, yOffset{yOffset_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // public System.Void .ctor(System.Single songTime, System.Single yOffset)
      // Offset: 0xE7F184
      // template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      // ABORTED: conflicts with another method.  BufferData(float songTime, float yOffset)
    }; // BeatmapObjectAvoidanceYOffsetEvaluator/BufferData
    static check_size<sizeof(BeatmapObjectAvoidanceYOffsetEvaluator::BufferData), 4 + sizeof(float)> __GlobalNamespace_BeatmapObjectAvoidanceYOffsetEvaluator_BufferDataSizeCheck;
    static_assert(sizeof(BeatmapObjectAvoidanceYOffsetEvaluator::BufferData) == 0x8);
    // private System.Int32 _currentYJumpOffsetBufferEndIndex
    // Size: 0x4
    // Offset: 0x10
    int currentYJumpOffsetBufferEndIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Single _jumpDurationToDesiredZPosition
    // Size: 0x4
    // Offset: 0x14
    float jumpDurationToDesiredZPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly BeatmapObjectAvoidanceYOffsetEvaluator/BufferData[] _yJumpOffsetBuffer
    // Size: 0x8
    // Offset: 0x18
    ::Array<GlobalNamespace::BeatmapObjectAvoidanceYOffsetEvaluator::BufferData>* yJumpOffsetBuffer;
    // Field size check
    static_assert(sizeof(::Array<GlobalNamespace::BeatmapObjectAvoidanceYOffsetEvaluator::BufferData>*) == 0x8);
    // private readonly IAudioTimeSource _audioTimeSource
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::IAudioTimeSource* audioTimeSource;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IAudioTimeSource*) == 0x8);
    // private readonly BeatmapObjectSpawnController _beatmapObjectSpawnController
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::BeatmapObjectSpawnController* beatmapObjectSpawnController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapObjectSpawnController*) == 0x8);
    // Creating value type constructor for type: BeatmapObjectAvoidanceYOffsetEvaluator
    BeatmapObjectAvoidanceYOffsetEvaluator(int currentYJumpOffsetBufferEndIndex_ = {}, float jumpDurationToDesiredZPosition_ = {}, ::Array<GlobalNamespace::BeatmapObjectAvoidanceYOffsetEvaluator::BufferData>* yJumpOffsetBuffer_ = {}, GlobalNamespace::IAudioTimeSource* audioTimeSource_ = {}, GlobalNamespace::BeatmapObjectSpawnController* beatmapObjectSpawnController_ = {}) noexcept : currentYJumpOffsetBufferEndIndex{currentYJumpOffsetBufferEndIndex_}, jumpDurationToDesiredZPosition{jumpDurationToDesiredZPosition_}, yJumpOffsetBuffer{yJumpOffsetBuffer_}, audioTimeSource{audioTimeSource_}, beatmapObjectSpawnController{beatmapObjectSpawnController_} {}
    // static field const value: static private System.Int32 kYJumpOffsetBufferLength
    static constexpr const int kYJumpOffsetBufferLength = 2000;
    // Get static field: static private System.Int32 kYJumpOffsetBufferLength
    static int _get_kYJumpOffsetBufferLength();
    // Set static field: static private System.Int32 kYJumpOffsetBufferLength
    static void _set_kYJumpOffsetBufferLength(int value);
    // static field const value: static private System.Single kYJumpOffsetBufferSongTimeInitValue
    static constexpr const float kYJumpOffsetBufferSongTimeInitValue = -1000;
    // Get static field: static private System.Single kYJumpOffsetBufferSongTimeInitValue
    static float _get_kYJumpOffsetBufferSongTimeInitValue();
    // Set static field: static private System.Single kYJumpOffsetBufferSongTimeInitValue
    static void _set_kYJumpOffsetBufferSongTimeInitValue(float value);
    // public System.Void .ctor(IAudioTimeSource audioTimeSource, BeatmapObjectSpawnController beatmapObjectSpawnController, System.Single moveToPlayerHeadTParam, BeatmapObjectSpawnMovementData/NoteSpawnData noteSpawnData)
    // Offset: 0x1A24770
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BeatmapObjectAvoidanceYOffsetEvaluator* New_ctor(GlobalNamespace::IAudioTimeSource* audioTimeSource, GlobalNamespace::BeatmapObjectSpawnController* beatmapObjectSpawnController, float moveToPlayerHeadTParam, GlobalNamespace::BeatmapObjectSpawnMovementData::NoteSpawnData noteSpawnData) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::BeatmapObjectAvoidanceYOffsetEvaluator::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BeatmapObjectAvoidanceYOffsetEvaluator*, creationType>(audioTimeSource, beatmapObjectSpawnController, moveToPlayerHeadTParam, noteSpawnData)));
    }
    // public System.Void ManualUpdate()
    // Offset: 0x1A2489C
    void ManualUpdate();
    // public System.Single GetJumpOffsetYAtJumpStartSongTime(System.Single lastDeltaTime)
    // Offset: 0x1A249B8
    float GetJumpOffsetYAtJumpStartSongTime(float lastDeltaTime);
  }; // BeatmapObjectAvoidanceYOffsetEvaluator
  static check_size<sizeof(BeatmapObjectAvoidanceYOffsetEvaluator), 40 + sizeof(GlobalNamespace::BeatmapObjectSpawnController*)> __GlobalNamespace_BeatmapObjectAvoidanceYOffsetEvaluatorSizeCheck;
  static_assert(sizeof(BeatmapObjectAvoidanceYOffsetEvaluator) == 0x30);
}
#pragma pack(pop)
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::BeatmapObjectAvoidanceYOffsetEvaluator*, "", "BeatmapObjectAvoidanceYOffsetEvaluator");
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::BeatmapObjectAvoidanceYOffsetEvaluator::BufferData, "", "BeatmapObjectAvoidanceYOffsetEvaluator/BufferData");
