// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: BezierSplineEvaluator
#include "GlobalNamespace/BezierSplineEvaluator.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x10
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: BezierSplineEvaluator/CubicSolveResult
  struct BezierSplineEvaluator::CubicSolveResult/*, public System::ValueType*/ {
    public:
    // public readonly System.Int32 numberOfSolutions
    // Size: 0x4
    // Offset: 0x0
    int numberOfSolutions;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single solution1
    // Size: 0x4
    // Offset: 0x4
    float solution1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single solution2
    // Size: 0x4
    // Offset: 0x8
    float solution2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single solution3
    // Size: 0x4
    // Offset: 0xC
    float solution3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: CubicSolveResult
    constexpr CubicSolveResult(int numberOfSolutions_ = {}, float solution1_ = {}, float solution2_ = {}, float solution3_ = {}) noexcept : numberOfSolutions{numberOfSolutions_}, solution1{solution1_}, solution2{solution2_}, solution3{solution3_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // public System.Void .ctor(System.Single solution1)
    // Offset: 0xEE3EDC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    CubicSolveResult(float solution1) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::BezierSplineEvaluator::CubicSolveResult::.ctor");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(solution1)})));
      ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, solution1);
    }
    // public System.Void .ctor(System.Single solution1, System.Single solution2)
    // Offset: 0xEE3EF0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    CubicSolveResult(float solution1, float solution2) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::BezierSplineEvaluator::CubicSolveResult::.ctor");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(solution1), ::il2cpp_utils::ExtractType(solution2)})));
      ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, solution1, solution2);
    }
    // public System.Void .ctor(System.Single solution1, System.Single solution2, System.Single solution3)
    // Offset: 0xEE3F04
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    CubicSolveResult(float solution1, float solution2, float solution3) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::BezierSplineEvaluator::CubicSolveResult::.ctor");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(solution1), ::il2cpp_utils::ExtractType(solution2), ::il2cpp_utils::ExtractType(solution3)})));
      ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, solution1, solution2, solution3);
    }
  }; // BezierSplineEvaluator/CubicSolveResult
  #pragma pack(pop)
  static check_size<sizeof(BezierSplineEvaluator::CubicSolveResult), 12 + sizeof(float)> __GlobalNamespace_BezierSplineEvaluator_CubicSolveResultSizeCheck;
  static_assert(sizeof(BezierSplineEvaluator::CubicSolveResult) == 0x10);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::BezierSplineEvaluator::CubicSolveResult, "", "BezierSplineEvaluator/CubicSolveResult");
