// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Playables
namespace UnityEngine::Playables {
  // Forward declaring type: PlayableDirector
  class PlayableDirector;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: JumpReceiver
  class JumpReceiver;
  // Forward declaring type: MaterialPropertyBlockColorSetter
  class MaterialPropertyBlockColorSetter;
  // Forward declaring type: MaterialPropertyBlockFloatAnimator
  class MaterialPropertyBlockFloatAnimator;
  // Forward declaring type: SongSpeedData
  class SongSpeedData;
  // Forward declaring type: BTSCharacter
  class BTSCharacter;
}
// Forward declaring namespace: UnityEngine::Timeline
namespace UnityEngine::Timeline {
  // Forward declaring type: ActivationTrack
  class ActivationTrack;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: BTSCharacterSpawnAnimationController
  class BTSCharacterSpawnAnimationController : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.Playables.PlayableDirector _spawnCharacterPlayableDirector
    // Offset: 0x18
    UnityEngine::Playables::PlayableDirector* spawnCharacterPlayableDirector;
    // private JumpReceiver _jumpReceiver
    // Offset: 0x20
    GlobalNamespace::JumpReceiver* jumpReceiver;
    // private System.Single _appearAnimationEndTime
    // Offset: 0x28
    float appearAnimationEndTime;
    // private System.Single _disappearAnimationStartTime
    // Offset: 0x2C
    float disappearAnimationStartTime;
    // private MaterialPropertyBlockColorSetter _rimLightColorSetter
    // Offset: 0x30
    GlobalNamespace::MaterialPropertyBlockColorSetter* rimLightColorSetter;
    // private MaterialPropertyBlockFloatAnimator _rimLightIntensityAnimator
    // Offset: 0x38
    GlobalNamespace::MaterialPropertyBlockFloatAnimator* rimLightIntensityAnimator;
    // private MaterialPropertyBlockFloatAnimator _rimLightEdgeStartAnimator
    // Offset: 0x40
    GlobalNamespace::MaterialPropertyBlockFloatAnimator* rimLightEdgeStartAnimator;
    // private readonly SongSpeedData _songSpeedData
    // Offset: 0x48
    GlobalNamespace::SongSpeedData* songSpeedData;
    // private UnityEngine.Timeline.ActivationTrack _characterActivationTrack
    // Offset: 0x50
    UnityEngine::Timeline::ActivationTrack* characterActivationTrack;
    // private BTSCharacter _currentBtsCharacter
    // Offset: 0x58
    GlobalNamespace::BTSCharacter* currentBtsCharacter;
    // private System.Single _defaultSpawnCharacterDuration
    // Offset: 0x60
    float defaultSpawnCharacterDuration;
    // private System.Double _playableDirectorTimeBeforePause
    // Offset: 0x68
    double playableDirectorTimeBeforePause;
    // private System.Single _animatorNormalizedTimeBeforePause
    // Offset: 0x70
    float animatorNormalizedTimeBeforePause;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.String kCharacterActivationStreamName
    static constexpr const char* kCharacterActivationStreamName = "CharacterActivationTrack";
    // Get static field: static private System.String kCharacterActivationStreamName
    static ::Il2CppString* _get_kCharacterActivationStreamName();
    // Set static field: static private System.String kCharacterActivationStreamName
    static void _set_kCharacterActivationStreamName(::Il2CppString* value);
    // public System.Single get_duration()
    // Offset: 0x1A4A22C
    float get_duration();
    // private UnityEngine.Timeline.ActivationTrack get_characterActivationTrack()
    // Offset: 0x1A4A270
    UnityEngine::Timeline::ActivationTrack* get_characterActivationTrack();
    // public System.Void PlayAnimation()
    // Offset: 0x1A4A5E8
    void PlayAnimation();
    // public System.Void EndEarlyAnimation()
    // Offset: 0x1A4A6BC
    void EndEarlyAnimation();
    // public System.Void StopAnimation()
    // Offset: 0x1A4A740
    void StopAnimation();
    // public System.Void SetCharacter(BTSCharacter btsCharacter)
    // Offset: 0x1A4A75C
    void SetCharacter(GlobalNamespace::BTSCharacter* btsCharacter);
    // public System.Void WillResumeAnimation()
    // Offset: 0x1A4A810
    void WillResumeAnimation();
    // public System.Void ResumeAnimation()
    // Offset: 0x1A4A87C
    void ResumeAnimation();
    // public System.Void PauseAnimation()
    // Offset: 0x1A4A8E8
    void PauseAnimation();
    // public System.Void .ctor()
    // Offset: 0x1A4A990
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static BTSCharacterSpawnAnimationController* New_ctor();
  }; // BTSCharacterSpawnAnimationController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::BTSCharacterSpawnAnimationController*, "", "BTSCharacterSpawnAnimationController");
#pragma pack(pop)
