// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HMUI.FlowCoordinator
#include "HMUI/FlowCoordinator.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MenuLightsPresetSO
  class MenuLightsPresetSO;
  // Forward declaring type: MenuTransitionsHelper
  class MenuTransitionsHelper;
  // Forward declaring type: MenuLightsManager
  class MenuLightsManager;
  // Forward declaring type: MissionSelectionNavigationController
  class MissionSelectionNavigationController;
  // Forward declaring type: MissionResultsViewController
  class MissionResultsViewController;
  // Forward declaring type: GameplaySetupViewController
  class GameplaySetupViewController;
  // Forward declaring type: MissionHelpViewController
  class MissionHelpViewController;
  // Forward declaring type: PlayerDataModel
  class PlayerDataModel;
  // Forward declaring type: CampaignProgressModel
  class CampaignProgressModel;
  // Forward declaring type: MissionLevelScenesTransitionSetupDataSO
  class MissionLevelScenesTransitionSetupDataSO;
  // Forward declaring type: MissionCompletionResults
  class MissionCompletionResults;
  // Forward declaring type: MissionNode
  class MissionNode;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: CampaignFlowCoordinator
  class CampaignFlowCoordinator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::CampaignFlowCoordinator);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::CampaignFlowCoordinator*, "", "CampaignFlowCoordinator");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x111
  #pragma pack(push, 1)
  // Autogenerated type: CampaignFlowCoordinator
  // [TokenAttribute] Offset: FFFFFFFF
  class CampaignFlowCoordinator : public ::HMUI::FlowCoordinator {
    public:
    // Nested type: ::GlobalNamespace::CampaignFlowCoordinator::$$c__DisplayClass20_0
    class $$c__DisplayClass20_0;
    // Nested type: ::GlobalNamespace::CampaignFlowCoordinator::$$c__DisplayClass22_0
    class $$c__DisplayClass22_0;
    public:
    // private MenuLightsPresetSO _defaultLightsPreset
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::MenuLightsPresetSO* defaultLightsPreset;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MenuLightsPresetSO*) == 0x8);
    // private MenuLightsPresetSO _resultsClearedLightsPreset
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::MenuLightsPresetSO* resultsClearedLightsPreset;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MenuLightsPresetSO*) == 0x8);
    // private MenuLightsPresetSO _resultsFailedLightsPreset
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::MenuLightsPresetSO* resultsFailedLightsPreset;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MenuLightsPresetSO*) == 0x8);
    // private MenuLightsPresetSO _newObjectiveLightsPreset
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::MenuLightsPresetSO* newObjectiveLightsPreset;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MenuLightsPresetSO*) == 0x8);
    // [InjectAttribute] Offset: 0x1129B5C
    // private readonly MenuTransitionsHelper _menuTransitionsHelper
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::MenuTransitionsHelper* menuTransitionsHelper;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MenuTransitionsHelper*) == 0x8);
    // [InjectAttribute] Offset: 0x1129B6C
    // private readonly MenuLightsManager _menuLightsManager
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::MenuLightsManager* menuLightsManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MenuLightsManager*) == 0x8);
    // [InjectAttribute] Offset: 0x1129B7C
    // private readonly MissionSelectionNavigationController _missionSelectionNavigationController
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::MissionSelectionNavigationController* missionSelectionNavigationController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MissionSelectionNavigationController*) == 0x8);
    // [InjectAttribute] Offset: 0x1129B8C
    // private readonly MissionResultsViewController _missionResultsViewController
    // Size: 0x8
    // Offset: 0xE0
    ::GlobalNamespace::MissionResultsViewController* missionResultsViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MissionResultsViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x1129B9C
    // private readonly GameplaySetupViewController _gameplaySetupViewController
    // Size: 0x8
    // Offset: 0xE8
    ::GlobalNamespace::GameplaySetupViewController* gameplaySetupViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameplaySetupViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x1129BAC
    // private readonly MissionHelpViewController _missionHelpViewController
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::MissionHelpViewController* missionHelpViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MissionHelpViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x1129BBC
    // private readonly PlayerDataModel _playerDataModel
    // Size: 0x8
    // Offset: 0xF8
    ::GlobalNamespace::PlayerDataModel* playerDataModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerDataModel*) == 0x8);
    // [InjectAttribute] Offset: 0x1129BCC
    // private readonly CampaignProgressModel _campaignProgressModel
    // Size: 0x8
    // Offset: 0x100
    ::GlobalNamespace::CampaignProgressModel* campaignProgressModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::CampaignProgressModel*) == 0x8);
    // private System.Action`1<CampaignFlowCoordinator> didFinishEvent
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_1<::GlobalNamespace::CampaignFlowCoordinator*>* didFinishEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::CampaignFlowCoordinator*>*) == 0x8);
    // private System.Boolean _showCredits
    // Size: 0x1
    // Offset: 0x110
    bool showCredits;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private MenuLightsPresetSO _defaultLightsPreset
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::MenuLightsPresetSO*& dyn__defaultLightsPreset();
    // Get instance field reference: private MenuLightsPresetSO _resultsClearedLightsPreset
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::MenuLightsPresetSO*& dyn__resultsClearedLightsPreset();
    // Get instance field reference: private MenuLightsPresetSO _resultsFailedLightsPreset
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::MenuLightsPresetSO*& dyn__resultsFailedLightsPreset();
    // Get instance field reference: private MenuLightsPresetSO _newObjectiveLightsPreset
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::MenuLightsPresetSO*& dyn__newObjectiveLightsPreset();
