// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: CloudsMeshGenerator
#include "GlobalNamespace/CloudsMeshGenerator.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: CloudsMeshGenerator/Cloud
  struct CloudsMeshGenerator::Cloud : public System::ValueType {
    public:
    // public UnityEngine.Mesh precisionOpaqueMesh
    // Offset: 0x0
    UnityEngine::Mesh* precisionOpaqueMesh;
    // public UnityEngine.Mesh lowPolyMesh
    // Offset: 0x8
    UnityEngine::Mesh* lowPolyMesh;
    // public System.Single sizeModifier
    // Offset: 0x10
    float sizeModifier;
    // public System.Single bottomThreshold
    // Offset: 0x14
    float bottomThreshold;
    // public System.Int32 weight
    // Offset: 0x18
    int weight;
    // public System.Int32 precisionVertexCount
    // Offset: 0x1C
    int precisionVertexCount;
    // public System.Int32 lowPolyVertexCount
    // Offset: 0x20
    int lowPolyVertexCount;
    // public System.Int32 generatedCount
    // Offset: 0x24
    int generatedCount;
    // Creating value type constructor for type: Cloud
    constexpr Cloud(UnityEngine::Mesh* precisionOpaqueMesh_ = {}, UnityEngine::Mesh* lowPolyMesh_ = {}, float sizeModifier_ = {}, float bottomThreshold_ = {}, int weight_ = {}, int precisionVertexCount_ = {}, int lowPolyVertexCount_ = {}, int generatedCount_ = {}) noexcept : precisionOpaqueMesh{precisionOpaqueMesh_}, lowPolyMesh{lowPolyMesh_}, sizeModifier{sizeModifier_}, bottomThreshold{bottomThreshold_}, weight{weight_}, precisionVertexCount{precisionVertexCount_}, lowPolyVertexCount{lowPolyVertexCount_}, generatedCount{generatedCount_} {}
  }; // CloudsMeshGenerator/Cloud
  check_size<sizeof(CloudsMeshGenerator::Cloud), 36 + sizeof(int) + 8 - (36 + sizeof(int)) % 8> __GlobalNamespace_CloudsMeshGenerator_CloudSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::CloudsMeshGenerator::Cloud, "", "CloudsMeshGenerator/Cloud");
#pragma pack(pop)
