// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: LiteNetLib.Utils.INetSerializable
#include "LiteNetLib/Utils/INetSerializable.hpp"
// Including type: ColorNoAlphaSerializable
#include "GlobalNamespace/ColorNoAlphaSerializable.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
  // Forward declaring type: NetDataReader
  class NetDataReader;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x70
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: ColorSchemeNetSerializable
  struct ColorSchemeNetSerializable/*, public System::ValueType, public LiteNetLib::Utils::INetSerializable*/ {
    public:
    // public ColorNoAlphaSerializable saberAColor
    // Size: 0x10
    // Offset: 0x0
    GlobalNamespace::ColorNoAlphaSerializable saberAColor;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable saberBColor
    // Size: 0x10
    // Offset: 0x10
    GlobalNamespace::ColorNoAlphaSerializable saberBColor;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable obstaclesColor
    // Size: 0x10
    // Offset: 0x20
    GlobalNamespace::ColorNoAlphaSerializable obstaclesColor;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable environmentColor0
    // Size: 0x10
    // Offset: 0x30
    GlobalNamespace::ColorNoAlphaSerializable environmentColor0;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable environmentColor1
    // Size: 0x10
    // Offset: 0x40
    GlobalNamespace::ColorNoAlphaSerializable environmentColor1;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable environmentColor0Boost
    // Size: 0x10
    // Offset: 0x50
    GlobalNamespace::ColorNoAlphaSerializable environmentColor0Boost;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable environmentColor1Boost
    // Size: 0x10
    // Offset: 0x60
    GlobalNamespace::ColorNoAlphaSerializable environmentColor1Boost;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // Creating value type constructor for type: ColorSchemeNetSerializable
    constexpr ColorSchemeNetSerializable(GlobalNamespace::ColorNoAlphaSerializable saberAColor_ = {}, GlobalNamespace::ColorNoAlphaSerializable saberBColor_ = {}, GlobalNamespace::ColorNoAlphaSerializable obstaclesColor_ = {}, GlobalNamespace::ColorNoAlphaSerializable environmentColor0_ = {}, GlobalNamespace::ColorNoAlphaSerializable environmentColor1_ = {}, GlobalNamespace::ColorNoAlphaSerializable environmentColor0Boost_ = {}, GlobalNamespace::ColorNoAlphaSerializable environmentColor1Boost_ = {}) noexcept : saberAColor{saberAColor_}, saberBColor{saberBColor_}, obstaclesColor{obstaclesColor_}, environmentColor0{environmentColor0_}, environmentColor1{environmentColor1_}, environmentColor0Boost{environmentColor0Boost_}, environmentColor1Boost{environmentColor1Boost_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator LiteNetLib::Utils::INetSerializable
    operator LiteNetLib::Utils::INetSerializable() noexcept {
      return *reinterpret_cast<LiteNetLib::Utils::INetSerializable*>(this);
    }
    // public System.Void .ctor(UnityEngine.Color saberAColor, UnityEngine.Color saberBColor, UnityEngine.Color obstaclesColor, UnityEngine.Color environmentColor0, UnityEngine.Color environmentColor1, UnityEngine.Color environmentColor0Boost, UnityEngine.Color environmentColor1Boost)
    // Offset: 0xEE7B18
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    ColorSchemeNetSerializable(UnityEngine::Color saberAColor, UnityEngine::Color saberBColor, UnityEngine::Color obstaclesColor, UnityEngine::Color environmentColor0, UnityEngine::Color environmentColor1, UnityEngine::Color environmentColor0Boost, UnityEngine::Color environmentColor1Boost) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::ColorSchemeNetSerializable::.ctor");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(saberAColor), ::il2cpp_utils::ExtractType(saberBColor), ::il2cpp_utils::ExtractType(obstaclesColor), ::il2cpp_utils::ExtractType(environmentColor0), ::il2cpp_utils::ExtractType(environmentColor1), ::il2cpp_utils::ExtractType(environmentColor0Boost), ::il2cpp_utils::ExtractType(environmentColor1Boost)})));
      ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, saberAColor, saberBColor, obstaclesColor, environmentColor0, environmentColor1, environmentColor0Boost, environmentColor1Boost);
    }
    // public System.Void Serialize(LiteNetLib.Utils.NetDataWriter writer)
    // Offset: 0xEE7B40
    void Serialize(LiteNetLib::Utils::NetDataWriter* writer);
    // public System.Void Deserialize(LiteNetLib.Utils.NetDataReader reader)
    // Offset: 0xEE7B48
    void Deserialize(LiteNetLib::Utils::NetDataReader* reader);
  }; // ColorSchemeNetSerializable
  #pragma pack(pop)
  static check_size<sizeof(ColorSchemeNetSerializable), 96 + sizeof(GlobalNamespace::ColorNoAlphaSerializable)> __GlobalNamespace_ColorSchemeNetSerializableSizeCheck;
  static_assert(sizeof(ColorSchemeNetSerializable) == 0x70);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ColorSchemeNetSerializable, "", "ColorSchemeNetSerializable");
