// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: LiteNetLib.Utils.INetSerializable
#include "LiteNetLib/Utils/INetSerializable.hpp"
// Including type: ColorNoAlphaSerializable
#include "GlobalNamespace/ColorNoAlphaSerializable.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
  // Forward declaring type: NetDataReader
  class NetDataReader;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x70
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: ColorSchemeNetSerializable
  // [TokenAttribute] Offset: FFFFFFFF
  struct ColorSchemeNetSerializable/*, public System::ValueType, public LiteNetLib::Utils::INetSerializable*/ {
    public:
    // public ColorNoAlphaSerializable saberAColor
    // Size: 0x10
    // Offset: 0x0
    GlobalNamespace::ColorNoAlphaSerializable saberAColor;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable saberBColor
    // Size: 0x10
    // Offset: 0x10
    GlobalNamespace::ColorNoAlphaSerializable saberBColor;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable obstaclesColor
    // Size: 0x10
    // Offset: 0x20
    GlobalNamespace::ColorNoAlphaSerializable obstaclesColor;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable environmentColor0
    // Size: 0x10
    // Offset: 0x30
    GlobalNamespace::ColorNoAlphaSerializable environmentColor0;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable environmentColor1
    // Size: 0x10
    // Offset: 0x40
    GlobalNamespace::ColorNoAlphaSerializable environmentColor1;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable environmentColor0Boost
    // Size: 0x10
    // Offset: 0x50
    GlobalNamespace::ColorNoAlphaSerializable environmentColor0Boost;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // public ColorNoAlphaSerializable environmentColor1Boost
    // Size: 0x10
    // Offset: 0x60
    GlobalNamespace::ColorNoAlphaSerializable environmentColor1Boost;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorNoAlphaSerializable) == 0x10);
    // Creating value type constructor for type: ColorSchemeNetSerializable
    constexpr ColorSchemeNetSerializable(GlobalNamespace::ColorNoAlphaSerializable saberAColor_ = {}, GlobalNamespace::ColorNoAlphaSerializable saberBColor_ = {}, GlobalNamespace::ColorNoAlphaSerializable obstaclesColor_ = {}, GlobalNamespace::ColorNoAlphaSerializable environmentColor0_ = {}, GlobalNamespace::ColorNoAlphaSerializable environmentColor1_ = {}, GlobalNamespace::ColorNoAlphaSerializable environmentColor0Boost_ = {}, GlobalNamespace::ColorNoAlphaSerializable environmentColor1Boost_ = {}) noexcept : saberAColor{saberAColor_}, saberBColor{saberBColor_}, obstaclesColor{obstaclesColor_}, environmentColor0{environmentColor0_}, environmentColor1{environmentColor1_}, environmentColor0Boost{environmentColor0Boost_}, environmentColor1Boost{environmentColor1Boost_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator LiteNetLib::Utils::INetSerializable
    operator LiteNetLib::Utils::INetSerializable() noexcept {
      return *reinterpret_cast<LiteNetLib::Utils::INetSerializable*>(this);
    }
    // Get instance field: public ColorNoAlphaSerializable saberAColor
    GlobalNamespace::ColorNoAlphaSerializable _get_saberAColor();
    // Set instance field: public ColorNoAlphaSerializable saberAColor
    void _set_saberAColor(GlobalNamespace::ColorNoAlphaSerializable value);
    // Get instance field: public ColorNoAlphaSerializable saberBColor
    GlobalNamespace::ColorNoAlphaSerializable _get_saberBColor();
    // Set instance field: public ColorNoAlphaSerializable saberBColor
    void _set_saberBColor(GlobalNamespace::ColorNoAlphaSerializable value);
    // Get instance field: public ColorNoAlphaSerializable obstaclesColor
    GlobalNamespace::ColorNoAlphaSerializable _get_obstaclesColor();
    // Set instance field: public ColorNoAlphaSerializable obstaclesColor
    void _set_obstaclesColor(GlobalNamespace::ColorNoAlphaSerializable value);
    // Get instance field: public ColorNoAlphaSerializable environmentColor0
    GlobalNamespace::ColorNoAlphaSerializable _get_environmentColor0();
    // Set instance field: public ColorNoAlphaSerializable environmentColor0
    void _set_environmentColor0(GlobalNamespace::ColorNoAlphaSerializable value);
    // Get instance field: public ColorNoAlphaSerializable environmentColor1
    GlobalNamespace::ColorNoAlphaSerializable _get_environmentColor1();
    // Set instance field: public ColorNoAlphaSerializable environmentColor1
    void _set_environmentColor1(GlobalNamespace::ColorNoAlphaSerializable value);
    // Get instance field: public ColorNoAlphaSerializable environmentColor0Boost
    GlobalNamespace::ColorNoAlphaSerializable _get_environmentColor0Boost();
    // Set instance field: public ColorNoAlphaSerializable environmentColor0Boost
    void _set_environmentColor0Boost(GlobalNamespace::ColorNoAlphaSerializable value);
    // Get instance field: public ColorNoAlphaSerializable environmentColor1Boost
    GlobalNamespace::ColorNoAlphaSerializable _get_environmentColor1Boost();
    // Set instance field: public ColorNoAlphaSerializable environmentColor1Boost
    void _set_environmentColor1Boost(GlobalNamespace::ColorNoAlphaSerializable value);
    // public System.Void .ctor(UnityEngine.Color saberAColor, UnityEngine.Color saberBColor, UnityEngine.Color obstaclesColor, UnityEngine.Color environmentColor0, UnityEngine.Color environmentColor1, UnityEngine.Color environmentColor0Boost, UnityEngine.Color environmentColor1Boost)
    // Offset: 0xD6978C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    ColorSchemeNetSerializable(UnityEngine::Color saberAColor, UnityEngine::Color saberBColor, UnityEngine::Color obstaclesColor, UnityEngine::Color environmentColor0, UnityEngine::Color environmentColor1, UnityEngine::Color environmentColor0Boost, UnityEngine::Color environmentColor1Boost) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::ColorSchemeNetSerializable::.ctor");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(saberAColor), ::il2cpp_utils::ExtractType(saberBColor), ::il2cpp_utils::ExtractType(obstaclesColor), ::il2cpp_utils::ExtractType(environmentColor0), ::il2cpp_utils::ExtractType(environmentColor1), ::il2cpp_utils::ExtractType(environmentColor0Boost), ::il2cpp_utils::ExtractType(environmentColor1Boost)})));
      ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, saberAColor, saberBColor, obstaclesColor, environmentColor0, environmentColor1, environmentColor0Boost, environmentColor1Boost);
    }
    // public System.Void Serialize(LiteNetLib.Utils.NetDataWriter writer)
    // Offset: 0xD697B4
    void Serialize(LiteNetLib::Utils::NetDataWriter* writer);
    // public System.Void Deserialize(LiteNetLib.Utils.NetDataReader reader)
    // Offset: 0xD697BC
    void Deserialize(LiteNetLib::Utils::NetDataReader* reader);
  }; // ColorSchemeNetSerializable
  #pragma pack(pop)
  static check_size<sizeof(ColorSchemeNetSerializable), 96 + sizeof(GlobalNamespace::ColorNoAlphaSerializable)> __GlobalNamespace_ColorSchemeNetSerializableSizeCheck;
  static_assert(sizeof(ColorSchemeNetSerializable) == 0x70);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ColorSchemeNetSerializable, "", "ColorSchemeNetSerializable");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::ColorSchemeNetSerializable::ColorSchemeNetSerializable
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::ColorSchemeNetSerializable::Serialize
// Il2CppName: Serialize
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ColorSchemeNetSerializable::*)(LiteNetLib::Utils::NetDataWriter*)>(&GlobalNamespace::ColorSchemeNetSerializable::Serialize)> {
  static const MethodInfo* get() {
    static auto* writer = &::il2cpp_utils::GetClassFromName("LiteNetLib.Utils", "NetDataWriter")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ColorSchemeNetSerializable), "Serialize", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{writer});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::ColorSchemeNetSerializable::Deserialize
// Il2CppName: Deserialize
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ColorSchemeNetSerializable::*)(LiteNetLib::Utils::NetDataReader*)>(&GlobalNamespace::ColorSchemeNetSerializable::Deserialize)> {
  static const MethodInfo* get() {
    static auto* reader = &::il2cpp_utils::GetClassFromName("LiteNetLib.Utils", "NetDataReader")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ColorSchemeNetSerializable), "Deserialize", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{reader});
  }
};
