// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ColorSchemeSO
  class ColorSchemeSO;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: ColorScheme
  class ColorScheme : public ::CsObject {
    public:
    // private System.String _colorSchemeId
    // Offset: 0x10
    ::CsString* colorSchemeId;
    // private System.String _colorSchemeName
    // Offset: 0x18
    ::CsString* colorSchemeName;
    // private System.Boolean _isEditable
    // Offset: 0x20
    bool isEditable;
    // private UnityEngine.Color _saberAColor
    // Offset: 0x24
    UnityEngine::Color saberAColor;
    // private UnityEngine.Color _saberBColor
    // Offset: 0x34
    UnityEngine::Color saberBColor;
    // private UnityEngine.Color _environmentColor0
    // Offset: 0x44
    UnityEngine::Color environmentColor0;
    // private UnityEngine.Color _environmentColor1
    // Offset: 0x54
    UnityEngine::Color environmentColor1;
    // private UnityEngine.Color _obstaclesColor
    // Offset: 0x64
    UnityEngine::Color obstaclesColor;
    // public System.String get_colorSchemeId()
    // Offset: 0x1976980
    ::CsString* get_colorSchemeId();
    // public System.String get_colorSchemeName()
    // Offset: 0x1976988
    ::CsString* get_colorSchemeName();
    // public System.Boolean get_isEditable()
    // Offset: 0x1976990
    bool get_isEditable();
    // public UnityEngine.Color get_saberAColor()
    // Offset: 0x1976998
    UnityEngine::Color get_saberAColor();
    // public UnityEngine.Color get_saberBColor()
    // Offset: 0x19769A4
    UnityEngine::Color get_saberBColor();
    // public UnityEngine.Color get_environmentColor0()
    // Offset: 0x19769B0
    UnityEngine::Color get_environmentColor0();
    // public UnityEngine.Color get_environmentColor1()
    // Offset: 0x19769BC
    UnityEngine::Color get_environmentColor1();
    // public UnityEngine.Color get_obstaclesColor()
    // Offset: 0x19769C8
    UnityEngine::Color get_obstaclesColor();
    // public System.Void .ctor(System.String colorSchemeId, System.String colorSchemeName, System.Boolean isEditable, UnityEngine.Color saberAColor, UnityEngine.Color saberBColor, UnityEngine.Color environmentColor0, UnityEngine.Color environmentColor1, UnityEngine.Color obstaclesColor)
    // Offset: 0x19769D4
    static ColorScheme* New_ctor(::CsString* colorSchemeId, ::CsString* colorSchemeName, bool isEditable, UnityEngine::Color saberAColor, UnityEngine::Color saberBColor, UnityEngine::Color environmentColor0, UnityEngine::Color environmentColor1, UnityEngine::Color obstaclesColor);
    // public System.Void .ctor(ColorScheme colorScheme, UnityEngine.Color saberAColor, UnityEngine.Color saberBColor, UnityEngine.Color environmentColor0, UnityEngine.Color environmentColor1, UnityEngine.Color obstaclesColor)
    // Offset: 0x1976ABC
    static ColorScheme* New_ctor(GlobalNamespace::ColorScheme* colorScheme, UnityEngine::Color saberAColor, UnityEngine::Color saberBColor, UnityEngine::Color environmentColor0, UnityEngine::Color environmentColor1, UnityEngine::Color obstaclesColor);
    // public System.Void .ctor(ColorScheme colorScheme)
    // Offset: 0x1976B10
    static ColorScheme* New_ctor(GlobalNamespace::ColorScheme* colorScheme);
    // public System.Void .ctor(ColorSchemeSO colorScheme)
    // Offset: 0x1976B90
    static ColorScheme* New_ctor(GlobalNamespace::ColorSchemeSO* colorScheme);
  }; // ColorScheme
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ColorScheme*, "", "ColorScheme");
#pragma pack(pop)
