// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ImageView
  class ImageView;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x40
  // Autogenerated type: ColorStepValuePicker
  // [] Offset: FFFFFFFF
  class ColorStepValuePicker : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.UI.Button _decButton
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::UI::Button* decButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _incButton
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::UI::Button* incButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private HMUI.ImageView _valueImage
    // Size: 0x8
    // Offset: 0x28
    HMUI::ImageView* valueImage;
    // Field size check
    static_assert(sizeof(HMUI::ImageView*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDCCA20
    // private System.Action decButtonWasPressedEvent
    // Size: 0x8
    // Offset: 0x30
    System::Action* decButtonWasPressedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDCCA30
    // private System.Action incButtonWasPressedEvent
    // Size: 0x8
    // Offset: 0x38
    System::Action* incButtonWasPressedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // Creating value type constructor for type: ColorStepValuePicker
    ColorStepValuePicker(UnityEngine::UI::Button* decButton_ = {}, UnityEngine::UI::Button* incButton_ = {}, HMUI::ImageView* valueImage_ = {}, System::Action* decButtonWasPressedEvent_ = {}, System::Action* incButtonWasPressedEvent_ = {}) noexcept : decButton{decButton_}, incButton{incButton_}, valueImage{valueImage_}, decButtonWasPressedEvent{decButtonWasPressedEvent_}, incButtonWasPressedEvent{incButtonWasPressedEvent_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_decButtonWasPressedEvent(System.Action value)
    // Offset: 0x1A5217C
    void add_decButtonWasPressedEvent(System::Action* value);
    // public System.Void remove_decButtonWasPressedEvent(System.Action value)
    // Offset: 0x1A52220
    void remove_decButtonWasPressedEvent(System::Action* value);
    // public System.Void add_incButtonWasPressedEvent(System.Action value)
    // Offset: 0x1A522C4
    void add_incButtonWasPressedEvent(System::Action* value);
    // public System.Void remove_incButtonWasPressedEvent(System.Action value)
    // Offset: 0x1A52368
    void remove_incButtonWasPressedEvent(System::Action* value);
    // public UnityEngine.Color get_color()
    // Offset: 0x1A5240C
    UnityEngine::Color get_color();
    // public System.Void set_color(UnityEngine.Color value)
    // Offset: 0x1A52430
    void set_color(UnityEngine::Color value);
    // public System.Void set_decButtonInteractable(System.Boolean value)
    // Offset: 0x1A52454
    void set_decButtonInteractable(bool value);
    // public System.Void set_incButtonInteractable(System.Boolean value)
    // Offset: 0x1A52474
    void set_incButtonInteractable(bool value);
    // protected System.Void OnEnable()
    // Offset: 0x1A52494
    void OnEnable();
    // protected System.Void OnDisable()
    // Offset: 0x1A5256C
    void OnDisable();
    // private System.Void IncButtonPressed()
    // Offset: 0x1A52644
    void IncButtonPressed();
    // private System.Void DecButtonPressed()
    // Offset: 0x1A52658
    void DecButtonPressed();
    // public System.Void .ctor()
    // Offset: 0x1A5266C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ColorStepValuePicker* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("GlobalNamespace").WithContext("ColorStepValuePicker").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ColorStepValuePicker*, creationType>()));
    }
  }; // ColorStepValuePicker
  static check_size<sizeof(ColorStepValuePicker), 56 + sizeof(System::Action*)> __GlobalNamespace_ColorStepValuePickerSizeCheck;
  static_assert(sizeof(ColorStepValuePicker) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ColorStepValuePicker*, "", "ColorStepValuePicker");
#pragma pack(pop)
