// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: DisconnectedReason
#include "GlobalNamespace/DisconnectedReason.hpp"
// Including type: ConnectionFailedReason
#include "GlobalNamespace/ConnectionFailedReason.hpp"
// Including type: MultiplayerAvatarData
#include "GlobalNamespace/MultiplayerAvatarData.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
// Including type: System.Single
#include "System/Single.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IConnection
  class IConnection;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: RollingAverage
  class RollingAverage;
  // Forward declaring type: IConnectionManager
  class IConnectionManager;
  // Forward declaring type: NetworkPacketSerializer`2<TType, TData>
  template<typename TType, typename TData>
  class NetworkPacketSerializer_2;
  // Forward declaring type: IConnectionInitParams`1<T>
  template<typename T>
  class IConnectionInitParams_1;
  // Forward declaring type: INetworkPacketSubSerializer`1<TData>
  template<typename TData>
  class INetworkPacketSubSerializer_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
  // Forward declaring type: NetDataReader
  class NetDataReader;
  // Forward declaring type: INetSerializable
  class INetSerializable;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: LiteNetLib
namespace LiteNetLib {
  // Forward declaring type: DeliveryMethod
  struct DeliveryMethod;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x138
  #pragma pack(push, 1)
  // Autogenerated type: ConnectedPlayerManager
  // [TokenAttribute] Offset: FFFFFFFF
  class ConnectedPlayerManager : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // Nested type: GlobalNamespace::ConnectedPlayerManager::ConnectedPlayer
    class ConnectedPlayer;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::InternalMessageType
    struct InternalMessageType;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::MessageType
    struct MessageType;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerConnectedPacket
    class PlayerConnectedPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerIdentityPacket
    class PlayerIdentityPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerAvatarPacket
    class PlayerAvatarPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerStatePacket
    class PlayerStatePacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerSortOrderPacket
    class PlayerSortOrderPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerDisconnectedPacket
    class PlayerDisconnectedPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::KickPlayerPacket
    class KickPlayerPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::SyncTimePacket
    class SyncTimePacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerLatencyPacket
    class PlayerLatencyPacket;
    // Size: 0x1
    #pragma pack(push, 1)
    // Autogenerated type: ConnectedPlayerManager/InternalMessageType
    // [TokenAttribute] Offset: FFFFFFFF
    struct InternalMessageType/*, public System::Enum*/ {
      public:
      // public System.Byte value__
      // Size: 0x1
      // Offset: 0x0
      uint8_t value;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      // Creating value type constructor for type: InternalMessageType
      constexpr InternalMessageType(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public ConnectedPlayerManager/InternalMessageType SyncTime
      static constexpr const uint8_t SyncTime = 0u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType SyncTime
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_SyncTime();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType SyncTime
      static void _set_SyncTime(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerConnected
      static constexpr const uint8_t PlayerConnected = 1u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerConnected
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerConnected();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerConnected
      static void _set_PlayerConnected(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerIdentity
      static constexpr const uint8_t PlayerIdentity = 2u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerIdentity
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerIdentity();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerIdentity
      static void _set_PlayerIdentity(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerLatencyUpdate
      static constexpr const uint8_t PlayerLatencyUpdate = 3u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerLatencyUpdate
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerLatencyUpdate();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerLatencyUpdate
      static void _set_PlayerLatencyUpdate(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerDisconnected
      static constexpr const uint8_t PlayerDisconnected = 4u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerDisconnected
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerDisconnected();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerDisconnected
      static void _set_PlayerDisconnected(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerSortOrderUpdate
      static constexpr const uint8_t PlayerSortOrderUpdate = 5u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerSortOrderUpdate
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerSortOrderUpdate();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerSortOrderUpdate
      static void _set_PlayerSortOrderUpdate(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType Party
      static constexpr const uint8_t Party = 6u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType Party
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_Party();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType Party
      static void _set_Party(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType MultiplayerSession
      static constexpr const uint8_t MultiplayerSession = 7u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType MultiplayerSession
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_MultiplayerSession();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType MultiplayerSession
      static void _set_MultiplayerSession(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType KickPlayer
      static constexpr const uint8_t KickPlayer = 8u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType KickPlayer
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_KickPlayer();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType KickPlayer
      static void _set_KickPlayer(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerStateUpdate
      static constexpr const uint8_t PlayerStateUpdate = 9u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerStateUpdate
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerStateUpdate();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerStateUpdate
      static void _set_PlayerStateUpdate(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerAvatarUpdate
      static constexpr const uint8_t PlayerAvatarUpdate = 10u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerAvatarUpdate
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerAvatarUpdate();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerAvatarUpdate
      static void _set_PlayerAvatarUpdate(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
    }; // ConnectedPlayerManager/InternalMessageType
    #pragma pack(pop)
    static check_size<sizeof(ConnectedPlayerManager::InternalMessageType), 0 + sizeof(uint8_t)> __GlobalNamespace_ConnectedPlayerManager_InternalMessageTypeSizeCheck;
    static_assert(sizeof(ConnectedPlayerManager::InternalMessageType) == 0x1);
    // private System.Action connectedEvent
    // Size: 0x8
    // Offset: 0x10
    System::Action* connectedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Action reinitializedEvent
    // Size: 0x8
    // Offset: 0x18
    System::Action* reinitializedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Action`1<DisconnectedReason> disconnectedEvent
    // Size: 0x8
    // Offset: 0x20
    System::Action_1<GlobalNamespace::DisconnectedReason>* disconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::DisconnectedReason>*) == 0x8);
    // private System.Action`1<ConnectionFailedReason> connectionFailedEvent
    // Size: 0x8
    // Offset: 0x28
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* connectionFailedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::ConnectionFailedReason>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> playerConnectedEvent
    // Size: 0x8
    // Offset: 0x30
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerConnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> playerDisconnectedEvent
    // Size: 0x8
    // Offset: 0x38
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerDisconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> playerStateChangedEvent
    // Size: 0x8
    // Offset: 0x40
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerStateChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> playerAvatarChangedEvent
    // Size: 0x8
    // Offset: 0x48
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerAvatarChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> playerOrderChangedEvent
    // Size: 0x8
    // Offset: 0x50
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerOrderChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action syncTimeInitializedEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action* syncTimeInitializedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private readonly System.Int64 _startTicks
    // Size: 0x8
    // Offset: 0x60
    int64_t startTicks;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private readonly RollingAverage _syncTimeOffset
    // Size: 0x8
    // Offset: 0x68
    GlobalNamespace::RollingAverage* syncTimeOffset;
    // Field size check
    static_assert(sizeof(GlobalNamespace::RollingAverage*) == 0x8);
    // private System.Single _syncTimeDelay
    // Size: 0x4
    // Offset: 0x70
    float syncTimeDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: syncTimeDelay and: connectionManager
    char __padding12[0x4] = {};
    // private readonly IConnectionManager _connectionManager
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::IConnectionManager* connectionManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IConnectionManager*) == 0x8);
    // private readonly LiteNetLib.Utils.NetDataWriter _temporaryDataWriter
    // Size: 0x8
    // Offset: 0x80
    LiteNetLib::Utils::NetDataWriter* temporaryDataWriter;
    // Field size check
    static_assert(sizeof(LiteNetLib::Utils::NetDataWriter*) == 0x8);
    // private readonly LiteNetLib.Utils.NetDataWriter _reliableDataWriter
    // Size: 0x8
    // Offset: 0x88
    LiteNetLib::Utils::NetDataWriter* reliableDataWriter;
    // Field size check
    static_assert(sizeof(LiteNetLib::Utils::NetDataWriter*) == 0x8);
    // private readonly LiteNetLib.Utils.NetDataWriter _unreliableDataWriter
    // Size: 0x8
    // Offset: 0x90
    LiteNetLib::Utils::NetDataWriter* unreliableDataWriter;
    // Field size check
    static_assert(sizeof(LiteNetLib::Utils::NetDataWriter*) == 0x8);
    // private readonly System.Collections.Generic.List`1<ConnectedPlayerManager/ConnectedPlayer> _players
    // Size: 0x8
    // Offset: 0x98
    System::Collections::Generic::List_1<GlobalNamespace::ConnectedPlayerManager::ConnectedPlayer*>* players;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::ConnectedPlayerManager::ConnectedPlayer*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<System.String> _localPlayerState
    // Size: 0x8
    // Offset: 0xA0
    System::Collections::Generic::HashSet_1<::Il2CppString*>* localPlayerState;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<::Il2CppString*>*) == 0x8);
    // private MultiplayerAvatarData _localPlayerAvatar
    // Size: 0x70
    // Offset: 0xA8
    GlobalNamespace::MultiplayerAvatarData localPlayerAvatar;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerAvatarData) == 0x70);
    // private ConnectedPlayerManager/ConnectedPlayer _localPlayer
    // Size: 0x8
    // Offset: 0x118
    GlobalNamespace::ConnectedPlayerManager::ConnectedPlayer* localPlayer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ConnectedPlayerManager::ConnectedPlayer*) == 0x8);
    // private System.Byte _lastConnectionId
    // Size: 0x1
    // Offset: 0x120
    uint8_t lastConnectionId;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: lastConnectionId and: lastSyncTimeUpdate
    char __padding21[0x3] = {};
    // private System.Single _lastSyncTimeUpdate
    // Size: 0x4
    // Offset: 0x124
    float lastSyncTimeUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _lastPollTime
    // Size: 0x4
    // Offset: 0x128
    float lastPollTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastPollTime and: messageSerializer
    char __padding23[0x4] = {};
    // private readonly NetworkPacketSerializer`2<ConnectedPlayerManager/InternalMessageType,IConnectedPlayer> _messageSerializer
    // Size: 0x8
    // Offset: 0x130
    GlobalNamespace::NetworkPacketSerializer_2<GlobalNamespace::ConnectedPlayerManager::InternalMessageType, GlobalNamespace::IConnectedPlayer*>* messageSerializer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NetworkPacketSerializer_2<GlobalNamespace::ConnectedPlayerManager::InternalMessageType, GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // Creating value type constructor for type: ConnectedPlayerManager
