// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: DisconnectedReason
#include "GlobalNamespace/DisconnectedReason.hpp"
// Including type: ConnectionFailedReason
#include "GlobalNamespace/ConnectionFailedReason.hpp"
// Including type: MultiplayerAvatarData
#include "GlobalNamespace/MultiplayerAvatarData.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
// Including type: System.Single
#include "System/Single.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IConnection
  class IConnection;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: RollingAverage
  class RollingAverage;
  // Forward declaring type: IConnectionManager
  class IConnectionManager;
  // Forward declaring type: NetworkPacketSerializer`2<TType, TData>
  template<typename TType, typename TData>
  class NetworkPacketSerializer_2;
  // Forward declaring type: IConnectionInitParams`1<T>
  template<typename T>
  class IConnectionInitParams_1;
  // Forward declaring type: INetworkPacketSubSerializer`1<TData>
  template<typename TData>
  class INetworkPacketSubSerializer_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
  // Forward declaring type: NetDataReader
  class NetDataReader;
  // Forward declaring type: INetSerializable
  class INetSerializable;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: LiteNetLib
namespace LiteNetLib {
  // Forward declaring type: DeliveryMethod
  struct DeliveryMethod;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: ConnectedPlayerManager
  class ConnectedPlayerManager : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // Nested type: GlobalNamespace::ConnectedPlayerManager::ConnectedPlayer
    class ConnectedPlayer;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::InternalMessageType
    struct InternalMessageType;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::MessageType
    struct MessageType;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerConnectedPacket
    class PlayerConnectedPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerStatePacket
    class PlayerStatePacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerSortOrderPacket
    class PlayerSortOrderPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerDisconnectedPacket
    class PlayerDisconnectedPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::KickPlayerPacket
    class KickPlayerPacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::SyncTimePacket
    class SyncTimePacket;
    // Nested type: GlobalNamespace::ConnectedPlayerManager::PlayerLatencyPacket
    class PlayerLatencyPacket;
    // Autogenerated type: ConnectedPlayerManager/InternalMessageType
    struct InternalMessageType : public System::Enum {
      public:
      // public System.Byte value__
      // Offset: 0x0
      uint8_t value;
      // Creating value type constructor for type: InternalMessageType
      constexpr InternalMessageType(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public ConnectedPlayerManager/InternalMessageType SyncTime
      static constexpr const uint8_t SyncTime = 0u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType SyncTime
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_SyncTime();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType SyncTime
      static void _set_SyncTime(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerConnected
      static constexpr const uint8_t PlayerConnected = 1u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerConnected
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerConnected();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerConnected
      static void _set_PlayerConnected(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerStateUpdate
      static constexpr const uint8_t PlayerStateUpdate = 2u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerStateUpdate
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerStateUpdate();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerStateUpdate
      static void _set_PlayerStateUpdate(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerLatencyUpdate
      static constexpr const uint8_t PlayerLatencyUpdate = 3u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerLatencyUpdate
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerLatencyUpdate();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerLatencyUpdate
      static void _set_PlayerLatencyUpdate(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerDisconnected
      static constexpr const uint8_t PlayerDisconnected = 4u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerDisconnected
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerDisconnected();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerDisconnected
      static void _set_PlayerDisconnected(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType PlayerSortOrderUpdate
      static constexpr const uint8_t PlayerSortOrderUpdate = 5u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType PlayerSortOrderUpdate
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_PlayerSortOrderUpdate();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType PlayerSortOrderUpdate
      static void _set_PlayerSortOrderUpdate(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType Party
      static constexpr const uint8_t Party = 6u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType Party
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_Party();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType Party
      static void _set_Party(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType MultiplayerSession
      static constexpr const uint8_t MultiplayerSession = 7u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType MultiplayerSession
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_MultiplayerSession();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType MultiplayerSession
      static void _set_MultiplayerSession(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
      // static field const value: static public ConnectedPlayerManager/InternalMessageType KickPlayer
      static constexpr const uint8_t KickPlayer = 8u;
      // Get static field: static public ConnectedPlayerManager/InternalMessageType KickPlayer
      static GlobalNamespace::ConnectedPlayerManager::InternalMessageType _get_KickPlayer();
      // Set static field: static public ConnectedPlayerManager/InternalMessageType KickPlayer
      static void _set_KickPlayer(GlobalNamespace::ConnectedPlayerManager::InternalMessageType value);
    }; // ConnectedPlayerManager/InternalMessageType
    check_size<sizeof(ConnectedPlayerManager::InternalMessageType), 0 + sizeof(uint8_t) + ((0 + sizeof(uint8_t)) % 8 != 0 ? (8 - (0 + sizeof(uint8_t)) % 8) : 0)> __GlobalNamespace_ConnectedPlayerManager_InternalMessageTypeSizeCheck;
    // private System.Action connectedEvent
    // Offset: 0x10
    System::Action* connectedEvent;
    // private System.Action reinitializedEvent
    // Offset: 0x18
    System::Action* reinitializedEvent;
    // private System.Action`1<DisconnectedReason> disconnectedEvent
    // Offset: 0x20
    System::Action_1<GlobalNamespace::DisconnectedReason>* disconnectedEvent;
    // private System.Action`1<ConnectionFailedReason> connectionFailedEvent
    // Offset: 0x28
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* connectionFailedEvent;
    // private System.Action`1<IConnectedPlayer> playerConnectedEvent
    // Offset: 0x30
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerConnectedEvent;
    // private System.Action`1<IConnectedPlayer> playerDisconnectedEvent
    // Offset: 0x38
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerDisconnectedEvent;
    // private System.Action`1<IConnectedPlayer> playerStateChangedEvent
    // Offset: 0x40
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerStateChangedEvent;
    // private System.Action`1<IConnectedPlayer> playerOrderChangedEvent
    // Offset: 0x48
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerOrderChangedEvent;
    // private System.Action syncTimeInitializedEvent
    // Offset: 0x50
    System::Action* syncTimeInitializedEvent;
    // private readonly System.Int64 _startTicks
    // Offset: 0x58
    int64_t startTicks;
    // private readonly RollingAverage _syncTimeOffset
    // Offset: 0x60
    GlobalNamespace::RollingAverage* syncTimeOffset;
    // private System.Single _syncTimeDelay
    // Offset: 0x68
    float syncTimeDelay;
    // private readonly IConnectionManager _connectionManager
    // Offset: 0x70
    GlobalNamespace::IConnectionManager* connectionManager;
    // private readonly LiteNetLib.Utils.NetDataWriter _temporaryDataWriter
    // Offset: 0x78
    LiteNetLib::Utils::NetDataWriter* temporaryDataWriter;
    // private readonly LiteNetLib.Utils.NetDataWriter _reliableDataWriter
    // Offset: 0x80
    LiteNetLib::Utils::NetDataWriter* reliableDataWriter;
    // private readonly LiteNetLib.Utils.NetDataWriter _unreliableDataWriter
    // Offset: 0x88
    LiteNetLib::Utils::NetDataWriter* unreliableDataWriter;
    // private readonly System.Collections.Generic.List`1<ConnectedPlayerManager/ConnectedPlayer> _players
    // Offset: 0x90
    System::Collections::Generic::List_1<GlobalNamespace::ConnectedPlayerManager::ConnectedPlayer*>* players;
    // private readonly System.Collections.Generic.HashSet`1<System.String> _localPlayerState
    // Offset: 0x98
    System::Collections::Generic::HashSet_1<::Il2CppString*>* localPlayerState;
    // private MultiplayerAvatarData _localPlayerAvatar
    // Offset: 0xA0
    GlobalNamespace::MultiplayerAvatarData localPlayerAvatar;
    // private ConnectedPlayerManager/ConnectedPlayer _localPlayer
    // Offset: 0x110
    GlobalNamespace::ConnectedPlayerManager::ConnectedPlayer* localPlayer;
    // private System.Byte _lastConnectionId
    // Offset: 0x118
    uint8_t lastConnectionId;
    // private System.Single _lastSyncTimeUpdate
    // Offset: 0x11C
    float lastSyncTimeUpdate;
    // private System.Single _lastPollTime
    // Offset: 0x120
    float lastPollTime;
    // private readonly NetworkPacketSerializer`2<ConnectedPlayerManager/InternalMessageType,IConnectedPlayer> _messageSerializer
    // Offset: 0x128
    GlobalNamespace::NetworkPacketSerializer_2<GlobalNamespace::ConnectedPlayerManager::InternalMessageType, GlobalNamespace::IConnectedPlayer*>* messageSerializer;
    // Creating interface conversion operator: operator System::IDisposable
    operator System::IDisposable() noexcept {
      return *reinterpret_cast<System::IDisposable*>(this);
    }
    // static field const value: static public System.Int32 invalidSortIndex
    static constexpr const int invalidSortIndex = -1;
    // Get static field: static public System.Int32 invalidSortIndex
    static int _get_invalidSortIndex();
    // Set static field: static public System.Int32 invalidSortIndex
    static void _set_invalidSortIndex(int value);
    // static field const value: static private System.Byte kAllConnectionsId
    static constexpr const uint8_t kAllConnectionsId = 255u;
    // Get static field: static private System.Byte kAllConnectionsId
    static uint8_t _get_kAllConnectionsId();
