// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: Vector3SO
  class Vector3SO;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: RangeValuesTextSlider
  class RangeValuesTextSlider;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: ControllersTransformSettingsViewController
  class ControllersTransformSettingsViewController : public HMUI::ViewController {
    public:
    // private Vector3SO _controllerPosition
    // Size: 0x8
    // Offset: 0x70
    GlobalNamespace::Vector3SO* controllerPosition;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // private Vector3SO _controllerRotation
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::Vector3SO* controllerRotation;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SpaceAttribute] Offset: 0xE24510
    // private HMUI.RangeValuesTextSlider _posXSlider
    // Size: 0x8
    // Offset: 0x80
    HMUI::RangeValuesTextSlider* posXSlider;
    // Field size check
    static_assert(sizeof(HMUI::RangeValuesTextSlider*) == 0x8);
    // private HMUI.RangeValuesTextSlider _posYSlider
    // Size: 0x8
    // Offset: 0x88
    HMUI::RangeValuesTextSlider* posYSlider;
    // Field size check
    static_assert(sizeof(HMUI::RangeValuesTextSlider*) == 0x8);
    // private HMUI.RangeValuesTextSlider _posZSlider
    // Size: 0x8
    // Offset: 0x90
    HMUI::RangeValuesTextSlider* posZSlider;
    // Field size check
    static_assert(sizeof(HMUI::RangeValuesTextSlider*) == 0x8);
    // private HMUI.RangeValuesTextSlider _rotXSlider
    // Size: 0x8
    // Offset: 0x98
    HMUI::RangeValuesTextSlider* rotXSlider;
    // Field size check
    static_assert(sizeof(HMUI::RangeValuesTextSlider*) == 0x8);
    // private HMUI.RangeValuesTextSlider _rotYSlider
    // Size: 0x8
    // Offset: 0xA0
    HMUI::RangeValuesTextSlider* rotYSlider;
    // Field size check
    static_assert(sizeof(HMUI::RangeValuesTextSlider*) == 0x8);
    // private HMUI.RangeValuesTextSlider _rotZSlider
    // Size: 0x8
    // Offset: 0xA8
    HMUI::RangeValuesTextSlider* rotZSlider;
    // Field size check
    static_assert(sizeof(HMUI::RangeValuesTextSlider*) == 0x8);
    // Creating value type constructor for type: ControllersTransformSettingsViewController
    ControllersTransformSettingsViewController(GlobalNamespace::Vector3SO* controllerPosition_ = {}, GlobalNamespace::Vector3SO* controllerRotation_ = {}, HMUI::RangeValuesTextSlider* posXSlider_ = {}, HMUI::RangeValuesTextSlider* posYSlider_ = {}, HMUI::RangeValuesTextSlider* posZSlider_ = {}, HMUI::RangeValuesTextSlider* rotXSlider_ = {}, HMUI::RangeValuesTextSlider* rotYSlider_ = {}, HMUI::RangeValuesTextSlider* rotZSlider_ = {}) noexcept : controllerPosition{controllerPosition_}, controllerRotation{controllerRotation_}, posXSlider{posXSlider_}, posYSlider{posYSlider_}, posZSlider{posZSlider_}, rotXSlider{rotXSlider_}, rotYSlider{rotYSlider_}, rotZSlider{rotZSlider_} {}
    // static field const value: static private System.Single kPositionStep
    static constexpr const float kPositionStep = 0.1;
    // Get static field: static private System.Single kPositionStep
    static float _get_kPositionStep();
    // Set static field: static private System.Single kPositionStep
    static void _set_kPositionStep(float value);
    // static field const value: static private System.Single kPositionMul
    static constexpr const float kPositionMul = 100;
    // Get static field: static private System.Single kPositionMul
    static float _get_kPositionMul();
    // Set static field: static private System.Single kPositionMul
    static void _set_kPositionMul(float value);
    // static field const value: static private System.Single kRotationStep
    static constexpr const float kRotationStep = 1;
    // Get static field: static private System.Single kRotationStep
    static float _get_kRotationStep();
    // Set static field: static private System.Single kRotationStep
    static void _set_kRotationStep(float value);
    // private System.Void HandlePositionSliderValueDidChange(HMUI.RangeValuesTextSlider slider, System.Single value)
    // Offset: 0x10981E4
    void HandlePositionSliderValueDidChange(HMUI::RangeValuesTextSlider* slider, float value);
    // private System.Void HandleRotationSliderValueDidChange(HMUI.RangeValuesTextSlider slider, System.Single value)
    // Offset: 0x10982C0
    void HandleRotationSliderValueDidChange(HMUI::RangeValuesTextSlider* slider, float value);
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0x1097A48
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // protected override System.Void OnDestroy()
    // Offset: 0x1097EB8
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::OnDestroy()
    void OnDestroy();
    // public System.Void .ctor()
    // Offset: 0x1098390
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ControllersTransformSettingsViewController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::ControllersTransformSettingsViewController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ControllersTransformSettingsViewController*, creationType>()));
    }
  }; // ControllersTransformSettingsViewController
  #pragma pack(pop)
  static check_size<sizeof(ControllersTransformSettingsViewController), 168 + sizeof(HMUI::RangeValuesTextSlider*)> __GlobalNamespace_ControllersTransformSettingsViewControllerSizeCheck;
  static_assert(sizeof(ControllersTransformSettingsViewController) == 0xB0);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ControllersTransformSettingsViewController*, "", "ControllersTransformSettingsViewController");
