// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: Vector3SO
  class Vector3SO;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: RangeValuesTextSlider
  class RangeValuesTextSlider;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: ControllersTransformSettingsViewController
  class ControllersTransformSettingsViewController : public HMUI::ViewController {
    public:
    // private Vector3SO _controllerPosition
    // Offset: 0x70
    GlobalNamespace::Vector3SO* controllerPosition;
    // private Vector3SO _controllerRotation
    // Offset: 0x78
    GlobalNamespace::Vector3SO* controllerRotation;
    // private HMUI.RangeValuesTextSlider _posXSlider
    // Offset: 0x80
    HMUI::RangeValuesTextSlider* posXSlider;
    // private HMUI.RangeValuesTextSlider _posYSlider
    // Offset: 0x88
    HMUI::RangeValuesTextSlider* posYSlider;
    // private HMUI.RangeValuesTextSlider _posZSlider
    // Offset: 0x90
    HMUI::RangeValuesTextSlider* posZSlider;
    // private HMUI.RangeValuesTextSlider _rotXSlider
    // Offset: 0x98
    HMUI::RangeValuesTextSlider* rotXSlider;
    // private HMUI.RangeValuesTextSlider _rotYSlider
    // Offset: 0xA0
    HMUI::RangeValuesTextSlider* rotYSlider;
    // private HMUI.RangeValuesTextSlider _rotZSlider
    // Offset: 0xA8
    HMUI::RangeValuesTextSlider* rotZSlider;
    // static field const value: static private System.Single kPositionStep
    static constexpr const float kPositionStep = 0.1;
    // Get static field: static private System.Single kPositionStep
    static float _get_kPositionStep();
    // Set static field: static private System.Single kPositionStep
    static void _set_kPositionStep(float value);
    // static field const value: static private System.Single kPositionMul
    static constexpr const float kPositionMul = 100;
    // Get static field: static private System.Single kPositionMul
    static float _get_kPositionMul();
    // Set static field: static private System.Single kPositionMul
    static void _set_kPositionMul(float value);
    // static field const value: static private System.Single kRotationStep
    static constexpr const float kRotationStep = 1;
    // Get static field: static private System.Single kRotationStep
    static float _get_kRotationStep();
    // Set static field: static private System.Single kRotationStep
    static void _set_kRotationStep(float value);
    // private System.Void HandlePositionSliderValueDidChange(HMUI.RangeValuesTextSlider slider, System.Single value)
    // Offset: 0xF28724
    void HandlePositionSliderValueDidChange(HMUI::RangeValuesTextSlider* slider, float value);
    // private System.Void HandleRotationSliderValueDidChange(HMUI.RangeValuesTextSlider slider, System.Single value)
    // Offset: 0xF28800
    void HandleRotationSliderValueDidChange(HMUI::RangeValuesTextSlider* slider, float value);
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0xF27F88
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // protected override System.Void OnDestroy()
    // Offset: 0xF283F8
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::OnDestroy()
    void OnDestroy();
    // public System.Void .ctor()
    // Offset: 0xF288D0
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static ControllersTransformSettingsViewController* New_ctor();
  }; // ControllersTransformSettingsViewController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ControllersTransformSettingsViewController*, "", "ControllersTransformSettingsViewController");
#pragma pack(pop)
