// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: CountdownElementController
  class CountdownElementController;
  // Forward declaring type: ITimeProvider
  class ITimeProvider;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: CountdownController
  // [] Offset: FFFFFFFF
  class CountdownController : public UnityEngine::MonoBehaviour {
    public:
    // private CountdownElementController[] _countdownElementControllers
    // Size: 0x8
    // Offset: 0x18
    ::Array<GlobalNamespace::CountdownElementController*>* countdownElementControllers;
    // Field size check
    static_assert(sizeof(::Array<GlobalNamespace::CountdownElementController*>*) == 0x8);
    // [InjectAttribute] Offset: 0xDCEA38
    // private readonly ITimeProvider _timeProvider
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::ITimeProvider* timeProvider;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ITimeProvider*) == 0x8);
    // private System.Single _countdownEndTime
    // Size: 0x4
    // Offset: 0x28
    float countdownEndTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 _currentRemainingSecond
    // Size: 0x4
    // Offset: 0x2C
    int currentRemainingSecond;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Collections.Generic.Queue`1<CountdownElementController> _countdownElementControllerQueue
    // Size: 0x8
    // Offset: 0x30
    System::Collections::Generic::Queue_1<GlobalNamespace::CountdownElementController*>* countdownElementControllerQueue;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Queue_1<GlobalNamespace::CountdownElementController*>*) == 0x8);
    // Creating value type constructor for type: CountdownController
    CountdownController(::Array<GlobalNamespace::CountdownElementController*>* countdownElementControllers_ = {}, GlobalNamespace::ITimeProvider* timeProvider_ = {}, float countdownEndTime_ = {}, int currentRemainingSecond_ = {}, System::Collections::Generic::Queue_1<GlobalNamespace::CountdownElementController*>* countdownElementControllerQueue_ = {}) noexcept : countdownElementControllers{countdownElementControllers_}, timeProvider{timeProvider_}, countdownEndTime{countdownEndTime_}, currentRemainingSecond{currentRemainingSecond_}, countdownElementControllerQueue{countdownElementControllerQueue_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Awake()
    // Offset: 0x1A54944
    void Awake();
    // protected System.Void Update()
    // Offset: 0x1A54950
    void Update();
    // public System.Void StartCountdown(System.Single countdownEndTime)
    // Offset: 0x1A54B20
    void StartCountdown(float countdownEndTime);
    // public System.Void UpdateCountdown(System.Single countdownEndTime)
    // Offset: 0x1A54C3C
    void UpdateCountdown(float countdownEndTime);
    // public System.Void StopCountdown()
    // Offset: 0x1A54CA8
    void StopCountdown();
    // public System.Void .ctor()
    // Offset: 0x1A54D28
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CountdownController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::CountdownController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CountdownController*, creationType>()));
    }
  }; // CountdownController
  #pragma pack(pop)
  static check_size<sizeof(CountdownController), 48 + sizeof(System::Collections::Generic::Queue_1<GlobalNamespace::CountdownElementController*>*)> __GlobalNamespace_CountdownControllerSizeCheck;
  static_assert(sizeof(CountdownController) == 0x38);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::CountdownController*, "", "CountdownController");
