// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: CreditsScenesTransitionSetupDataSO
  class CreditsScenesTransitionSetupDataSO;
  // Forward declaring type: SongPreviewPlayer
  class SongPreviewPlayer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ButtonBinder
  class ButtonBinder;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: CreditsController
  class CreditsController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::CreditsController::$ScrollCoroutine$d__13
    class $ScrollCoroutine$d__13;
    // private CreditsScenesTransitionSetupDataSO _creditsSceneSetupDataSO
    // Offset: 0x18
    GlobalNamespace::CreditsScenesTransitionSetupDataSO* creditsSceneSetupDataSO;
    // private SongPreviewPlayer _songPreviewPlayer
    // Offset: 0x20
    GlobalNamespace::SongPreviewPlayer* songPreviewPlayer;
    // private UnityEngine.AudioClip _creditsAudioClip
    // Offset: 0x28
    UnityEngine::AudioClip* creditsAudioClip;
    // private UnityEngine.UI.Button _continueButton
    // Offset: 0x30
    UnityEngine::UI::Button* continueButton;
    // private UnityEngine.RectTransform _contentRectTransform
    // Offset: 0x38
    UnityEngine::RectTransform* contentRectTransform;
    // private UnityEngine.RectTransform _textRectTransform
    // Offset: 0x40
    UnityEngine::RectTransform* textRectTransform;
    // private System.Single _scrollingSpeed
    // Offset: 0x48
    float scrollingSpeed;
    // private System.Single _overflowHeight
    // Offset: 0x4C
    float overflowHeight;
    // private HMUI.ButtonBinder _buttonBinder
    // Offset: 0x50
    HMUI::ButtonBinder* buttonBinder;
    // private System.Boolean _didFinish
    // Offset: 0x58
    bool didFinish;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0xBE2F10
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0xBE3088
    void OnDestroy();
    // private System.Void Finish()
    // Offset: 0xBE309C
    void Finish();
    // private System.Collections.IEnumerator ScrollCoroutine()
    // Offset: 0xBE300C
    System::Collections::IEnumerator* ScrollCoroutine();
    // public System.Void .ctor()
    // Offset: 0xBE315C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static CreditsController* New_ctor();
  }; // CreditsController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::CreditsController*, "", "CreditsController");
#pragma pack(pop)
