// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatmapCharacteristicCollectionSO
  class BeatmapCharacteristicCollectionSO;
  // Forward declaring type: EnvironmentInfoSO
  class EnvironmentInfoSO;
  // Forward declaring type: EnvironmentsListSO
  class EnvironmentsListSO;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: CustomLevelLoader
  // [TokenAttribute] Offset: FFFFFFFF
  class CustomLevelLoader : public UnityEngine::MonoBehaviour {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    private:
    #endif
    // private BeatmapCharacteristicCollectionSO _beatmapCharacteristicCollection
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::BeatmapCharacteristicCollectionSO* beatmapCharacteristicCollection;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapCharacteristicCollectionSO*) == 0x8);
    // private EnvironmentInfoSO _defaultEnvironmentInfo
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::EnvironmentInfoSO* defaultEnvironmentInfo;
    // Field size check
    static_assert(sizeof(GlobalNamespace::EnvironmentInfoSO*) == 0x8);
    // private EnvironmentInfoSO _defaultAllDirectionsEnvironmentInfo
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::EnvironmentInfoSO* defaultAllDirectionsEnvironmentInfo;
    // Field size check
    static_assert(sizeof(GlobalNamespace::EnvironmentInfoSO*) == 0x8);
    // private EnvironmentsListSO _environmentSceneInfoCollection
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::EnvironmentsListSO* environmentSceneInfoCollection;
    // Field size check
    static_assert(sizeof(GlobalNamespace::EnvironmentsListSO*) == 0x8);
    // private UnityEngine.Sprite _defaultPackCover
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::Sprite* defaultPackCover;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // private UnityEngine.Sprite _smallDefaultPackCover
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::Sprite* smallDefaultPackCover;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: private BeatmapCharacteristicCollectionSO _beatmapCharacteristicCollection
    GlobalNamespace::BeatmapCharacteristicCollectionSO*& dyn__beatmapCharacteristicCollection();
    // Get instance field reference: private EnvironmentInfoSO _defaultEnvironmentInfo
    GlobalNamespace::EnvironmentInfoSO*& dyn__defaultEnvironmentInfo();
    // Get instance field reference: private EnvironmentInfoSO _defaultAllDirectionsEnvironmentInfo
    GlobalNamespace::EnvironmentInfoSO*& dyn__defaultAllDirectionsEnvironmentInfo();
    // Get instance field reference: private EnvironmentsListSO _environmentSceneInfoCollection
    GlobalNamespace::EnvironmentsListSO*& dyn__environmentSceneInfoCollection();
    // Get instance field reference: private UnityEngine.Sprite _defaultPackCover
    UnityEngine::Sprite*& dyn__defaultPackCover();
    // Get instance field reference: private UnityEngine.Sprite _smallDefaultPackCover
    UnityEngine::Sprite*& dyn__smallDefaultPackCover();
    // public System.Void .ctor()
    // Offset: 0x11A19DC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CustomLevelLoader* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::CustomLevelLoader::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CustomLevelLoader*, creationType>()));
    }
  }; // CustomLevelLoader
  #pragma pack(pop)
  static check_size<sizeof(CustomLevelLoader), 64 + sizeof(UnityEngine::Sprite*)> __GlobalNamespace_CustomLevelLoaderSizeCheck;
  static_assert(sizeof(CustomLevelLoader) == 0x48);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::CustomLevelLoader*, "", "CustomLevelLoader");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::CustomLevelLoader::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
