// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMAutoincrementedRequestId
#include "GlobalNamespace/HMAutoincrementedRequestId.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: NoteCutInfo
  class NoteCutInfo;
  // Forward declaring type: ISaberSwingRatingCounter
  class ISaberSwingRatingCounter;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: CutScoreBuffer
  // [] Offset: FFFFFFFF
  class CutScoreBuffer : public GlobalNamespace::HMAutoincrementedRequestId {
    public:
    // public System.Action`1<CutScoreBuffer> didFinishEvent
    // Size: 0x8
    // Offset: 0x18
    System::Action_1<GlobalNamespace::CutScoreBuffer*>* didFinishEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::CutScoreBuffer*>*) == 0x8);
    // private System.Int32 _afterCutScoreWithMultiplier
    // Size: 0x4
    // Offset: 0x20
    int afterCutScoreWithMultiplier;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _beforeCutScoreWithMultiplier
    // Size: 0x4
    // Offset: 0x24
    int beforeCutScoreWithMultiplier;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _cutDistanceScoreWithMultiplier
    // Size: 0x4
    // Offset: 0x28
    int cutDistanceScoreWithMultiplier;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _multiplier
    // Size: 0x4
    // Offset: 0x2C
    int multiplier;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private NoteCutInfo _noteCutInfo
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::NoteCutInfo* noteCutInfo;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NoteCutInfo*) == 0x8);
    // Creating value type constructor for type: CutScoreBuffer
    CutScoreBuffer(System::Action_1<GlobalNamespace::CutScoreBuffer*>* didFinishEvent_ = {}, int afterCutScoreWithMultiplier_ = {}, int beforeCutScoreWithMultiplier_ = {}, int cutDistanceScoreWithMultiplier_ = {}, int multiplier_ = {}, GlobalNamespace::NoteCutInfo* noteCutInfo_ = {}) noexcept : didFinishEvent{didFinishEvent_}, afterCutScoreWithMultiplier{afterCutScoreWithMultiplier_}, beforeCutScoreWithMultiplier{beforeCutScoreWithMultiplier_}, cutDistanceScoreWithMultiplier{cutDistanceScoreWithMultiplier_}, multiplier{multiplier_}, noteCutInfo{noteCutInfo_} {}
    // Deleting conversion operator: operator uint64_t
    constexpr operator uint64_t() const noexcept = delete;
    // public System.Int32 get_scoreWithMultiplier()
    // Offset: 0x1046BF0
    int get_scoreWithMultiplier();
    // public System.Int32 get_multiplier()
    // Offset: 0x1046C04
    int get_multiplier();
    // public System.Void .ctor(NoteCutInfo noteCutInfo, System.Int32 multiplier)
    // Offset: 0x1046C0C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CutScoreBuffer* New_ctor(GlobalNamespace::NoteCutInfo* noteCutInfo, int multiplier) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::CutScoreBuffer::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CutScoreBuffer*, creationType>(noteCutInfo, multiplier)));
    }
    // private System.Void HandleSwingRatingCounterDidChangeEvent(ISaberSwingRatingCounter swingRatingCounter, System.Single rating)
    // Offset: 0x1046E58
    void HandleSwingRatingCounterDidChangeEvent(GlobalNamespace::ISaberSwingRatingCounter* swingRatingCounter, float rating);
    // private System.Void RefreshScores()
    // Offset: 0x1046DEC
    void RefreshScores();
    // private System.Void HandleSwingRatingCounterDidFinishEvent(ISaberSwingRatingCounter swingRatingCounter)
    // Offset: 0x1046E5C
    void HandleSwingRatingCounterDidFinishEvent(GlobalNamespace::ISaberSwingRatingCounter* swingRatingCounter);
  }; // CutScoreBuffer
  #pragma pack(pop)
  static check_size<sizeof(CutScoreBuffer), 48 + sizeof(GlobalNamespace::NoteCutInfo*)> __GlobalNamespace_CutScoreBufferSizeCheck;
  static_assert(sizeof(CutScoreBuffer) == 0x38);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::CutScoreBuffer*, "", "CutScoreBuffer");
