// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: Deeplink
  // [TokenAttribute] Offset: FFFFFFFF
  class Deeplink : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // public System.String Destination
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* Destination;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String LevelID
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* LevelID;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String PackID
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* PackID;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String Difficulty
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* Difficulty;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String Characteristic
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppString* Characteristic;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String MultiplayerLobbyCode
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* MultiplayerLobbyCode;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String MultiplayerSecret
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* MultiplayerSecret;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.UInt64 MultiplayerRoomId
    // Size: 0x8
    // Offset: 0x48
    uint64_t MultiplayerRoomId;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    public:
    // Get instance field reference: public System.String Destination
    ::Il2CppString*& dyn_Destination();
    // Get instance field reference: public System.String LevelID
    ::Il2CppString*& dyn_LevelID();
    // Get instance field reference: public System.String PackID
    ::Il2CppString*& dyn_PackID();
    // Get instance field reference: public System.String Difficulty
    ::Il2CppString*& dyn_Difficulty();
    // Get instance field reference: public System.String Characteristic
    ::Il2CppString*& dyn_Characteristic();
    // Get instance field reference: public System.String MultiplayerLobbyCode
    ::Il2CppString*& dyn_MultiplayerLobbyCode();
    // Get instance field reference: public System.String MultiplayerSecret
    ::Il2CppString*& dyn_MultiplayerSecret();
    // Get instance field reference: public System.UInt64 MultiplayerRoomId
    uint64_t& dyn_MultiplayerRoomId();
    // public System.Void .ctor()
    // Offset: 0x1139AB4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Deeplink* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::Deeplink::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Deeplink*, creationType>()));
    }
  }; // Deeplink
  #pragma pack(pop)
  static check_size<sizeof(Deeplink), 72 + sizeof(uint64_t)> __GlobalNamespace_DeeplinkSizeCheck;
  static_assert(sizeof(Deeplink) == 0x50);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::Deeplink*, "", "Deeplink");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::Deeplink::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
