// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: DirectionalLightWithIds
  class DirectionalLightWithIds;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: DirectionalLightWithIdsGroupEntry
  class DirectionalLightWithIdsGroupEntry;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::DirectionalLightWithIdsGroupEntry);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::DirectionalLightWithIdsGroupEntry*, "", "DirectionalLightWithIdsGroupEntry");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x3C
  #pragma pack(push, 1)
  // Autogenerated type: DirectionalLightWithIdsGroupEntry
  // [TokenAttribute] Offset: FFFFFFFF
  class DirectionalLightWithIdsGroupEntry : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting
    struct GroupLightsWeighting;
    // Nested type: ::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightData
    class GroupLightData;
    // Nested type: ::GlobalNamespace::DirectionalLightWithIdsGroupEntry::LightIntensitiesWithId
    class LightIntensitiesWithId;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: DirectionalLightWithIdsGroupEntry/GroupLightsWeighting
    // [TokenAttribute] Offset: FFFFFFFF
    struct GroupLightsWeighting/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GroupLightsWeighting
      constexpr GroupLightsWeighting(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public DirectionalLightWithIdsGroupEntry/GroupLightsWeighting Maximum
      static constexpr const int Maximum = 0;
      // Get static field: static public DirectionalLightWithIdsGroupEntry/GroupLightsWeighting Maximum
      static ::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting _get_Maximum();
      // Set static field: static public DirectionalLightWithIdsGroupEntry/GroupLightsWeighting Maximum
      static void _set_Maximum(::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting value);
      // static field const value: static public DirectionalLightWithIdsGroupEntry/GroupLightsWeighting LinearFraction
      static constexpr const int LinearFraction = 1;
      // Get static field: static public DirectionalLightWithIdsGroupEntry/GroupLightsWeighting LinearFraction
      static ::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting _get_LinearFraction();
      // Set static field: static public DirectionalLightWithIdsGroupEntry/GroupLightsWeighting LinearFraction
      static void _set_LinearFraction(::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // DirectionalLightWithIdsGroupEntry/GroupLightsWeighting
    #pragma pack(pop)
    static check_size<sizeof(DirectionalLightWithIdsGroupEntry::GroupLightsWeighting), 0 + sizeof(int)> __GlobalNamespace_DirectionalLightWithIdsGroupEntry_GroupLightsWeightingSizeCheck;
    static_assert(sizeof(DirectionalLightWithIdsGroupEntry::GroupLightsWeighting) == 0x4);
    public:
    // private DirectionalLightWithIds _directionalLightWithIds
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::DirectionalLightWithIds* directionalLightWithIds;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::DirectionalLightWithIds*) == 0x8);
    // [SpaceAttribute] Offset: 0x10BEB4C
    // private DirectionalLightWithIdsGroupEntry/GroupLightData[] _groupLightData
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightData*> groupLightData;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightData*>) == 0x8);
    // private DirectionalLightWithIdsGroupEntry/LightIntensitiesWithId[] _individualLightData
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::GlobalNamespace::DirectionalLightWithIdsGroupEntry::LightIntensitiesWithId*> individualLightData;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::DirectionalLightWithIdsGroupEntry::LightIntensitiesWithId*>) == 0x8);
    // private System.Int32[] _excludedLightIds
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<int> excludedLightIds;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // [SpaceAttribute] Offset: 0x10BEBA4
    // private DirectionalLightWithIdsGroupEntry/GroupLightsWeighting _groupLightsWeighting
    // Size: 0x4
    // Offset: 0x38
    ::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting groupLightsWeighting;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private DirectionalLightWithIds _directionalLightWithIds
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::DirectionalLightWithIds*& dyn__directionalLightWithIds();
    // Get instance field reference: private DirectionalLightWithIdsGroupEntry/GroupLightData[] _groupLightData
    [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightData*>& dyn__groupLightData();
    // Get instance field reference: private DirectionalLightWithIdsGroupEntry/LightIntensitiesWithId[] _individualLightData
    [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::DirectionalLightWithIdsGroupEntry::LightIntensitiesWithId*>& dyn__individualLightData();
    // Get instance field reference: private System.Int32[] _excludedLightIds
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn__excludedLightIds();
    // Get instance field reference: private DirectionalLightWithIdsGroupEntry/GroupLightsWeighting _groupLightsWeighting
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting& dyn__groupLightsWeighting();
    // public System.Void .ctor()
    // Offset: 0x1E6F860
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DirectionalLightWithIdsGroupEntry* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::DirectionalLightWithIdsGroupEntry::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DirectionalLightWithIdsGroupEntry*, creationType>()));
    }
  }; // DirectionalLightWithIdsGroupEntry
  #pragma pack(pop)
  static check_size<sizeof(DirectionalLightWithIdsGroupEntry), 56 + sizeof(::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting)> __GlobalNamespace_DirectionalLightWithIdsGroupEntrySizeCheck;
  static_assert(sizeof(DirectionalLightWithIdsGroupEntry) == 0x3C);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::DirectionalLightWithIdsGroupEntry::GroupLightsWeighting, "", "DirectionalLightWithIdsGroupEntry/GroupLightsWeighting");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::DirectionalLightWithIdsGroupEntry::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
