// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ICubeNoteControllerInitializable`1<T>
  template<typename T>
  class ICubeNoteControllerInitializable_1;
  // Forward declaring type: ICubeNoteTypeProvider
  class ICubeNoteTypeProvider;
  // Forward declaring type: INoteMovementProvider
  class INoteMovementProvider;
  // Forward declaring type: MaterialPropertyBlockController
  class MaterialPropertyBlockController;
  // Forward declaring type: CutoutEffect
  class CutoutEffect;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: DisappearingArrowControllerBase`1
  // [TokenAttribute] Offset: FFFFFFFF
  template<typename T>
  class DisappearingArrowControllerBase_1 : public UnityEngine::MonoBehaviour {
    public:
    // private MaterialPropertyBlockController[] _transparentObjectMaterialPropertyBlocks
    // Size: 0x8
    // Offset: 0x0
    ::Array<GlobalNamespace::MaterialPropertyBlockController*>* transparentObjectMaterialPropertyBlocks;
    // Field size check
    static_assert(sizeof(::Array<GlobalNamespace::MaterialPropertyBlockController*>*) == 0x8);
    // private UnityEngine.MeshRenderer _cubeMeshRenderer
    // Size: 0x8
    // Offset: 0x0
    UnityEngine::MeshRenderer* cubeMeshRenderer;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshRenderer*) == 0x8);
    // private CutoutEffect _arrowCutoutEffect
    // Size: 0x8
    // Offset: 0x0
    GlobalNamespace::CutoutEffect* arrowCutoutEffect;
    // Field size check
    static_assert(sizeof(GlobalNamespace::CutoutEffect*) == 0x8);
    // [SpaceAttribute] Offset: 0xEB03B4
    // private System.Single _disappearingNormalStart
    // Size: 0x4
    // Offset: 0x0
    float disappearingNormalStart;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _disappearingNormalEnd
    // Size: 0x4
    // Offset: 0x0
    float disappearingNormalEnd;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _disappearingGhostStart
    // Size: 0x4
    // Offset: 0x0
    float disappearingGhostStart;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _disappearingGhostEnd
    // Size: 0x4
    // Offset: 0x0
    float disappearingGhostEnd;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _prevArrowTransparency
    // Size: 0x4
    // Offset: 0x0
    float prevArrowTransparency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _minDistance
    // Size: 0x4
    // Offset: 0x0
    float minDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _maxDistance
    // Size: 0x4
    // Offset: 0x0
    float maxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _hideMesh
    // Size: 0x1
    // Offset: 0x0
    bool hideMesh;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _fadeArrow
    // Size: 0x1
    // Offset: 0x0
    bool fadeArrow;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: DisappearingArrowControllerBase_1
    DisappearingArrowControllerBase_1(::Array<GlobalNamespace::MaterialPropertyBlockController*>* transparentObjectMaterialPropertyBlocks_ = {}, UnityEngine::MeshRenderer* cubeMeshRenderer_ = {}, GlobalNamespace::CutoutEffect* arrowCutoutEffect_ = {}, float disappearingNormalStart_ = {}, float disappearingNormalEnd_ = {}, float disappearingGhostStart_ = {}, float disappearingGhostEnd_ = {}, float prevArrowTransparency_ = {}, float minDistance_ = {}, float maxDistance_ = {}, bool hideMesh_ = {}, bool fadeArrow_ = {}) noexcept : transparentObjectMaterialPropertyBlocks{transparentObjectMaterialPropertyBlocks_}, cubeMeshRenderer{cubeMeshRenderer_}, arrowCutoutEffect{arrowCutoutEffect_}, disappearingNormalStart{disappearingNormalStart_}, disappearingNormalEnd{disappearingNormalEnd_}, disappearingGhostStart{disappearingGhostStart_}, disappearingGhostEnd{disappearingGhostEnd_}, prevArrowTransparency{prevArrowTransparency_}, minDistance{minDistance_}, maxDistance{maxDistance_}, hideMesh{hideMesh_}, fadeArrow{fadeArrow_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // [DoesNotRequireDomainReloadInitAttribute] Offset: 0xEB041C
    // Autogenerated static field getter
    // Get static field: static private readonly System.Int32 _colorId
    static int _get__colorId() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__colorId");
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<DisappearingArrowControllerBase_1<T>*>::get(), "_colorId"));
    }
    // Autogenerated static field setter
    // Set static field: static private readonly System.Int32 _colorId
    static void _set__colorId(int value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__colorId");
      THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<DisappearingArrowControllerBase_1<T>*>::get(), "_colorId", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private MaterialPropertyBlockController[] _transparentObjectMaterialPropertyBlocks
    ::Array<GlobalNamespace::MaterialPropertyBlockController*>* _get__transparentObjectMaterialPropertyBlocks() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__transparentObjectMaterialPropertyBlocks");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<::Array<GlobalNamespace::MaterialPropertyBlockController*>*>(___internal__instance, "_transparentObjectMaterialPropertyBlocks"));
    }
    // Autogenerated instance field setter
    // Set instance field: private MaterialPropertyBlockController[] _transparentObjectMaterialPropertyBlocks
    void _set__transparentObjectMaterialPropertyBlocks(::Array<GlobalNamespace::MaterialPropertyBlockController*>* value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__transparentObjectMaterialPropertyBlocks");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_transparentObjectMaterialPropertyBlocks", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private UnityEngine.MeshRenderer _cubeMeshRenderer
    UnityEngine::MeshRenderer* _get__cubeMeshRenderer() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__cubeMeshRenderer");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<UnityEngine::MeshRenderer*>(___internal__instance, "_cubeMeshRenderer"));
    }
    // Autogenerated instance field setter
    // Set instance field: private UnityEngine.MeshRenderer _cubeMeshRenderer
    void _set__cubeMeshRenderer(UnityEngine::MeshRenderer* value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__cubeMeshRenderer");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_cubeMeshRenderer", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private CutoutEffect _arrowCutoutEffect
    GlobalNamespace::CutoutEffect* _get__arrowCutoutEffect() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__arrowCutoutEffect");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<GlobalNamespace::CutoutEffect*>(___internal__instance, "_arrowCutoutEffect"));
    }
    // Autogenerated instance field setter
    // Set instance field: private CutoutEffect _arrowCutoutEffect
    void _set__arrowCutoutEffect(GlobalNamespace::CutoutEffect* value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__arrowCutoutEffect");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_arrowCutoutEffect", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Single _disappearingNormalStart
    float _get__disappearingNormalStart() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__disappearingNormalStart");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<float>(___internal__instance, "_disappearingNormalStart"));
    }
    // Autogenerated instance field setter
    // Set instance field: private System.Single _disappearingNormalStart
    void _set__disappearingNormalStart(float value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__disappearingNormalStart");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_disappearingNormalStart", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Single _disappearingNormalEnd
    float _get__disappearingNormalEnd() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__disappearingNormalEnd");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<float>(___internal__instance, "_disappearingNormalEnd"));
    }
    // Autogenerated instance field setter
    // Set instance field: private System.Single _disappearingNormalEnd
    void _set__disappearingNormalEnd(float value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__disappearingNormalEnd");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_disappearingNormalEnd", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Single _disappearingGhostStart
    float _get__disappearingGhostStart() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__disappearingGhostStart");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<float>(___internal__instance, "_disappearingGhostStart"));
    }
    // Autogenerated instance field setter
    // Set instance field: private System.Single _disappearingGhostStart
    void _set__disappearingGhostStart(float value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__disappearingGhostStart");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_disappearingGhostStart", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Single _disappearingGhostEnd
    float _get__disappearingGhostEnd() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__disappearingGhostEnd");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<float>(___internal__instance, "_disappearingGhostEnd"));
    }
    // Autogenerated instance field setter
    // Set instance field: private System.Single _disappearingGhostEnd
    void _set__disappearingGhostEnd(float value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__disappearingGhostEnd");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_disappearingGhostEnd", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Single _prevArrowTransparency
    float _get__prevArrowTransparency() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__prevArrowTransparency");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<float>(___internal__instance, "_prevArrowTransparency"));
    }
    // Autogenerated instance field setter
    // Set instance field: private System.Single _prevArrowTransparency
    void _set__prevArrowTransparency(float value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__prevArrowTransparency");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_prevArrowTransparency", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Single _minDistance
    float _get__minDistance() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__minDistance");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<float>(___internal__instance, "_minDistance"));
    }
    // Autogenerated instance field setter
    // Set instance field: private System.Single _minDistance
    void _set__minDistance(float value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__minDistance");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_minDistance", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Single _maxDistance
    float _get__maxDistance() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__maxDistance");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<float>(___internal__instance, "_maxDistance"));
    }
    // Autogenerated instance field setter
    // Set instance field: private System.Single _maxDistance
    void _set__maxDistance(float value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__maxDistance");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_maxDistance", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Boolean _hideMesh
    bool _get__hideMesh() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__hideMesh");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<bool>(___internal__instance, "_hideMesh"));
    }
    // Autogenerated instance field setter
    // Set instance field: private System.Boolean _hideMesh
    void _set__hideMesh(bool value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__hideMesh");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_hideMesh", value));
    }
    // Autogenerated instance field getter
    // Get instance field: private System.Boolean _fadeArrow
    bool _get__fadeArrow() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_get__fadeArrow");
      static auto ___internal__instance = this;
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<bool>(___internal__instance, "_fadeArrow"));
    }
    // Autogenerated instance field setter
    // Set instance field: private System.Boolean _fadeArrow
    void _set__fadeArrow(bool value) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::_set__fadeArrow");
      static auto ___internal__instance = this;
      THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_fadeArrow", value));
    }
    // protected T get_gameNoteController()
    // Offset: 0xFFFFFFFF
    T get_gameNoteController() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::get_gameNoteController");
      auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "get_gameNoteController", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
      return ::il2cpp_utils::RunMethodThrow<T, false>(this, ___internal__method);
    }
    // protected System.Void Awake()
    // Offset: 0xFFFFFFFF
    void Awake() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::Awake");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "Awake", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
      ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
    }
    // protected System.Void OnDestroy()
    // Offset: 0xFFFFFFFF
    void OnDestroy() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::OnDestroy");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "OnDestroy", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
      ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
    }
    // private System.Void CalculateMinMaxDistance()
    // Offset: 0xFFFFFFFF
    void CalculateMinMaxDistance() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::CalculateMinMaxDistance");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "CalculateMinMaxDistance", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
      ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
    }
    // private System.Void HandleNoteMovementNoteDidMoveInJumpPhase()
    // Offset: 0xFFFFFFFF
    void HandleNoteMovementNoteDidMoveInJumpPhase() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::HandleNoteMovementNoteDidMoveInJumpPhase");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "HandleNoteMovementNoteDidMoveInJumpPhase", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
      ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
    }
    // private System.Void HandleCubeNoteControllerDidInit(T gameNoteController)
    // Offset: 0xFFFFFFFF
    void HandleCubeNoteControllerDidInit(T gameNoteController) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::HandleCubeNoteControllerDidInit");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "HandleCubeNoteControllerDidInit", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(gameNoteController)})));
      ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method, gameNoteController);
    }
    // private System.Void SetArrowTransparency(System.Single arrowTransparency)
    // Offset: 0xFFFFFFFF
    void SetArrowTransparency(float arrowTransparency) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::SetArrowTransparency");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "SetArrowTransparency", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(arrowTransparency)})));
      ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method, arrowTransparency);
    }
    // protected System.Void .ctor()
    // Offset: 0xFFFFFFFF
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DisappearingArrowControllerBase_1<T>* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DisappearingArrowControllerBase_1<T>*, creationType>()));
    }
    // static private System.Void .cctor()
    // Offset: 0xFFFFFFFF
    // Implemented from: UnityEngine.Object
    // Base method: System.Void Object::.cctor()
    static void _cctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::DisappearingArrowControllerBase_1::.cctor");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<DisappearingArrowControllerBase_1<T>*>::get(), ".cctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
      ::il2cpp_utils::RunMethodThrow<void, false>(static_cast<Il2CppClass*>(nullptr), ___internal__method);
    }
  }; // DisappearingArrowControllerBase`1
  // Could not write size check! Type: DisappearingArrowControllerBase`1 is generic, or has no fields that are valid for size checks!
}
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(GlobalNamespace::DisappearingArrowControllerBase_1, "", "DisappearingArrowControllerBase`1");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
