// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: DroppedFramesLabel
  class DroppedFramesLabel : public UnityEngine::MonoBehaviour {
    public:
    // private TMPro.TextMeshProUGUI _text
    // Offset: 0x18
    TMPro::TextMeshProUGUI* text;
    // private System.Int32 _expectedFrameRate
    // Offset: 0x20
    int expectedFrameRate;
    // private System.Int32 _resetInterval
    // Offset: 0x24
    int resetInterval;
    // private System.Int32 _totalNumberOfDroppedFrames
    // Offset: 0x28
    int totalNumberOfDroppedFrames;
    // private System.Single _syncedFrameTime
    // Offset: 0x2C
    float syncedFrameTime;
    // private System.Single _intervalTime
    // Offset: 0x30
    float intervalTime;
    // private System.Single _maxFrameTimeInInterval
    // Offset: 0x34
    float maxFrameTimeInInterval;
    // private System.Int32 _frameCountInInterval
    // Offset: 0x38
    int frameCountInInterval;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0xCAFA38
    void Start();
    // protected System.Void Update()
    // Offset: 0xCAFAAC
    void Update();
    // private System.Void RefreshText()
    // Offset: 0xCAFB98
    void RefreshText();
    // public System.Void .ctor()
    // Offset: 0xCAFCBC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static DroppedFramesLabel* New_ctor();
  }; // DroppedFramesLabel
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::DroppedFramesLabel*, "", "DroppedFramesLabel");
#pragma pack(pop)
