// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: NamedIntListController
#include "GlobalNamespace/NamedIntListController.hpp"
// Including type: NamedColorListController
#include "GlobalNamespace/NamedColorListController.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AvatarEditHistory
  class AvatarEditHistory;
  // Forward declaring type: SkinColorSO
  class SkinColorSO;
  // Forward declaring type: AvatarPartCollection`1<T>
  template<typename T>
  class AvatarPartCollection_1;
  // Forward declaring type: ColorPickerButtonController
  class ColorPickerButtonController;
  // Forward declaring type: AvatarPartsModel
  class AvatarPartsModel;
  // Forward declaring type: AvatarDataModel
  class AvatarDataModel;
  // Forward declaring type: PlayerDataModel
  class PlayerDataModel;
  // Forward declaring type: IAvatarPart
  class IAvatarPart;
  // Skipping declaration: AvatarEditPart because it is already included!
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: CurvedTextMeshPro
  class CurvedTextMeshPro;
  // Forward declaring type: ValueChangedBinder`1<T>
  template<typename T>
  class ValueChangedBinder_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Action_4;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: EditAvatarViewController
  class EditAvatarViewController;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(GlobalNamespace::EditAvatarViewController);
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::EditAvatarViewController*, "", "EditAvatarViewController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x144
  #pragma pack(push, 1)
  // Autogenerated type: EditAvatarViewController
  // [TokenAttribute] Offset: FFFFFFFF
  class EditAvatarViewController : public HMUI::ViewController {
    public:
    // Nested type: GlobalNamespace::EditAvatarViewController::AvatarEditPart
    struct AvatarEditPart;
    // Nested type: GlobalNamespace::EditAvatarViewController::$$c__DisplayClass56_0
    class $$c__DisplayClass56_0;
    // Nested type: GlobalNamespace::EditAvatarViewController::$$c__DisplayClass57_0_1<T>
    template<typename T>
    class $$c__DisplayClass57_0_1;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: EditAvatarViewController/AvatarEditPart
    // [TokenAttribute] Offset: FFFFFFFF
    struct AvatarEditPart/*, public System::Enum*/ {
      public:
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      protected:
      #endif
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AvatarEditPart
      constexpr AvatarEditPart(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public EditAvatarViewController/AvatarEditPart Unknown
      static constexpr const int Unknown = 0;
      // Get static field: static public EditAvatarViewController/AvatarEditPart Unknown
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_Unknown();
      // Set static field: static public EditAvatarViewController/AvatarEditPart Unknown
      static void _set_Unknown(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart All
      static constexpr const int All = 1;
      // Get static field: static public EditAvatarViewController/AvatarEditPart All
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_All();
      // Set static field: static public EditAvatarViewController/AvatarEditPart All
      static void _set_All(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart SkinColor
      static constexpr const int SkinColor = 2;
      // Get static field: static public EditAvatarViewController/AvatarEditPart SkinColor
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_SkinColor();
      // Set static field: static public EditAvatarViewController/AvatarEditPart SkinColor
      static void _set_SkinColor(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart HeadTopModel
      static constexpr const int HeadTopModel = 3;
      // Get static field: static public EditAvatarViewController/AvatarEditPart HeadTopModel
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_HeadTopModel();
      // Set static field: static public EditAvatarViewController/AvatarEditPart HeadTopModel
      static void _set_HeadTopModel(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart HeadTopPrimaryColor
      static constexpr const int HeadTopPrimaryColor = 4;
      // Get static field: static public EditAvatarViewController/AvatarEditPart HeadTopPrimaryColor
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_HeadTopPrimaryColor();
      // Set static field: static public EditAvatarViewController/AvatarEditPart HeadTopPrimaryColor
      static void _set_HeadTopPrimaryColor(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart HeadTopSecondaryColor
      static constexpr const int HeadTopSecondaryColor = 5;
      // Get static field: static public EditAvatarViewController/AvatarEditPart HeadTopSecondaryColor
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_HeadTopSecondaryColor();
      // Set static field: static public EditAvatarViewController/AvatarEditPart HeadTopSecondaryColor
      static void _set_HeadTopSecondaryColor(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart GlassesModel
      static constexpr const int GlassesModel = 6;
      // Get static field: static public EditAvatarViewController/AvatarEditPart GlassesModel
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_GlassesModel();
      // Set static field: static public EditAvatarViewController/AvatarEditPart GlassesModel
      static void _set_GlassesModel(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart GlassesColor
      static constexpr const int GlassesColor = 7;
      // Get static field: static public EditAvatarViewController/AvatarEditPart GlassesColor
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_GlassesColor();
      // Set static field: static public EditAvatarViewController/AvatarEditPart GlassesColor
      static void _set_GlassesColor(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart FacialHairModel
      static constexpr const int FacialHairModel = 8;
      // Get static field: static public EditAvatarViewController/AvatarEditPart FacialHairModel
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_FacialHairModel();
      // Set static field: static public EditAvatarViewController/AvatarEditPart FacialHairModel
      static void _set_FacialHairModel(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart FacialHairColor
      static constexpr const int FacialHairColor = 9;
      // Get static field: static public EditAvatarViewController/AvatarEditPart FacialHairColor
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_FacialHairColor();
      // Set static field: static public EditAvatarViewController/AvatarEditPart FacialHairColor
      static void _set_FacialHairColor(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart HandsModel
      static constexpr const int HandsModel = 10;
      // Get static field: static public EditAvatarViewController/AvatarEditPart HandsModel
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_HandsModel();
      // Set static field: static public EditAvatarViewController/AvatarEditPart HandsModel
      static void _set_HandsModel(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart HandsColor
      static constexpr const int HandsColor = 11;
      // Get static field: static public EditAvatarViewController/AvatarEditPart HandsColor
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_HandsColor();
      // Set static field: static public EditAvatarViewController/AvatarEditPart HandsColor
      static void _set_HandsColor(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart ClothesModel
      static constexpr const int ClothesModel = 12;
      // Get static field: static public EditAvatarViewController/AvatarEditPart ClothesModel
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_ClothesModel();
      // Set static field: static public EditAvatarViewController/AvatarEditPart ClothesModel
      static void _set_ClothesModel(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart ClothesModelPrimaryColor
      static constexpr const int ClothesModelPrimaryColor = 13;
      // Get static field: static public EditAvatarViewController/AvatarEditPart ClothesModelPrimaryColor
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_ClothesModelPrimaryColor();
      // Set static field: static public EditAvatarViewController/AvatarEditPart ClothesModelPrimaryColor
      static void _set_ClothesModelPrimaryColor(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart ClothesModelSecondaryColor
      static constexpr const int ClothesModelSecondaryColor = 14;
      // Get static field: static public EditAvatarViewController/AvatarEditPart ClothesModelSecondaryColor
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_ClothesModelSecondaryColor();
      // Set static field: static public EditAvatarViewController/AvatarEditPart ClothesModelSecondaryColor
      static void _set_ClothesModelSecondaryColor(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // static field const value: static public EditAvatarViewController/AvatarEditPart ClothesModelDetailColor
      static constexpr const int ClothesModelDetailColor = 15;
      // Get static field: static public EditAvatarViewController/AvatarEditPart ClothesModelDetailColor
      static GlobalNamespace::EditAvatarViewController::AvatarEditPart _get_ClothesModelDetailColor();
      // Set static field: static public EditAvatarViewController/AvatarEditPart ClothesModelDetailColor
      static void _set_ClothesModelDetailColor(GlobalNamespace::EditAvatarViewController::AvatarEditPart value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // EditAvatarViewController/AvatarEditPart
    #pragma pack(pop)
    static check_size<sizeof(EditAvatarViewController::AvatarEditPart), 0 + sizeof(int)> __GlobalNamespace_EditAvatarViewController_AvatarEditPartSizeCheck;
    static_assert(sizeof(EditAvatarViewController::AvatarEditPart) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private NamedColorListController _skinColorValuePicker
    // Size: 0x8
    // Offset: 0x70
    GlobalNamespace::NamedColorListController* skinColorValuePicker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NamedColorListController*) == 0x8);
    // private NamedIntListController _headTopValuePicker
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::NamedIntListController* headTopValuePicker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NamedIntListController*) == 0x8);
    // private NamedIntListController _eyesValuePicker
    // Size: 0x8
    // Offset: 0x80
    GlobalNamespace::NamedIntListController* eyesValuePicker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NamedIntListController*) == 0x8);
    // private NamedIntListController _handsValuePicker
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::NamedIntListController* handsValuePicker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NamedIntListController*) == 0x8);
    // private NamedIntListController _clothesValuePicker
    // Size: 0x8
    // Offset: 0x90
    GlobalNamespace::NamedIntListController* clothesValuePicker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NamedIntListController*) == 0x8);
    // [SpaceAttribute] Offset: 0xF0F6D0
    // private ColorPickerButtonController _headTopPrimaryColorButtonController
    // Size: 0x8
    // Offset: 0x98
    GlobalNamespace::ColorPickerButtonController* headTopPrimaryColorButtonController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorPickerButtonController*) == 0x8);
    // private ColorPickerButtonController _headTopSecondaryColorButtonController
    // Size: 0x8
    // Offset: 0xA0
    GlobalNamespace::ColorPickerButtonController* headTopSecondaryColorButtonController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorPickerButtonController*) == 0x8);
    // private ColorPickerButtonController _handsColorButtonController
    // Size: 0x8
    // Offset: 0xA8
    GlobalNamespace::ColorPickerButtonController* handsColorButtonController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorPickerButtonController*) == 0x8);
    // private ColorPickerButtonController _clothesColorButtonControllerPrimary
    // Size: 0x8
    // Offset: 0xB0
    GlobalNamespace::ColorPickerButtonController* clothesColorButtonControllerPrimary;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorPickerButtonController*) == 0x8);
    // private ColorPickerButtonController _clothesColorButtonControllerSecondary
    // Size: 0x8
    // Offset: 0xB8
    GlobalNamespace::ColorPickerButtonController* clothesColorButtonControllerSecondary;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorPickerButtonController*) == 0x8);
    // private ColorPickerButtonController _clothesColorButtonControllerDetail
    // Size: 0x8
    // Offset: 0xC0
    GlobalNamespace::ColorPickerButtonController* clothesColorButtonControllerDetail;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorPickerButtonController*) == 0x8);
    // [SpaceAttribute] Offset: 0xF0F758
    // private UnityEngine.UI.Button _randomizeAllButton
    // Size: 0x8
    // Offset: 0xC8
    UnityEngine::UI::Button* randomizeAllButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _undoButton
    // Size: 0x8
    // Offset: 0xD0
    UnityEngine::UI::Button* undoButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _redoButton
    // Size: 0x8
    // Offset: 0xD8
    UnityEngine::UI::Button* redoButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _applyButton
    // Size: 0x8
    // Offset: 0xE0
    UnityEngine::UI::Button* applyButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _cancelButton
    // Size: 0x8
    // Offset: 0xE8
    UnityEngine::UI::Button* cancelButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // [SpaceAttribute] Offset: 0xF0F7D0
    // private HMUI.CurvedTextMeshPro _applyButtonText
    // Size: 0x8
    // Offset: 0xF0
    HMUI::CurvedTextMeshPro* applyButtonText;
    // Field size check
    static_assert(sizeof(HMUI::CurvedTextMeshPro*) == 0x8);
    // private UnityEngine.UI.Image _eyesPreviewImage
    // Size: 0x8
    // Offset: 0xF8
    UnityEngine::UI::Image* eyesPreviewImage;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Image*) == 0x8);
    // [InjectAttribute] Offset: 0xF0F818
    // private readonly AvatarPartsModel _avatarPartsModel
    // Size: 0x8
    // Offset: 0x100
    GlobalNamespace::AvatarPartsModel* avatarPartsModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarPartsModel*) == 0x8);
    // [InjectAttribute] Offset: 0xF0F828
    // private readonly AvatarDataModel _avatarDataModel
    // Size: 0x8
    // Offset: 0x108
    GlobalNamespace::AvatarDataModel* avatarDataModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarDataModel*) == 0x8);
    // [InjectAttribute] Offset: 0xF0F838
    // private readonly PlayerDataModel _playerDataModel
    // Size: 0x8
    // Offset: 0x110
    GlobalNamespace::PlayerDataModel* playerDataModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::PlayerDataModel*) == 0x8);
    // private System.Action didFinishEvent
    // Size: 0x8
    // Offset: 0x118
    System::Action* didFinishEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Action`4<System.Action`1<UnityEngine.Color>,UnityEngine.Color,EditAvatarViewController/AvatarEditPart,System.Int32> didRequestColorChangeEvent
    // Size: 0x8
    // Offset: 0x120
    System::Action_4<System::Action_1<UnityEngine::Color>*, UnityEngine::Color, GlobalNamespace::EditAvatarViewController::AvatarEditPart, int>* didRequestColorChangeEvent;
    // Field size check
    static_assert(sizeof(System::Action_4<System::Action_1<UnityEngine::Color>*, UnityEngine::Color, GlobalNamespace::EditAvatarViewController::AvatarEditPart, int>*) == 0x8);
    // private System.Action`1<EditAvatarViewController/AvatarEditPart> didChangedAvatarPartEvent
    // Size: 0x8
    // Offset: 0x128
    System::Action_1<GlobalNamespace::EditAvatarViewController::AvatarEditPart>* didChangedAvatarPartEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::EditAvatarViewController::AvatarEditPart>*) == 0x8);
    // private readonly AvatarEditHistory _avatarEditHistory
    // Size: 0x8
    // Offset: 0x130
    GlobalNamespace::AvatarEditHistory* avatarEditHistory;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarEditHistory*) == 0x8);
    // private HMUI.ValueChangedBinder`1<System.Int32> _intPickerBinder
    // Size: 0x8
    // Offset: 0x138
    HMUI::ValueChangedBinder_1<int>* intPickerBinder;
    // Field size check
    static_assert(sizeof(HMUI::ValueChangedBinder_1<int>*) == 0x8);
    // private EditAvatarViewController/AvatarEditPart _lastEditedPart
    // Size: 0x4
    // Offset: 0x140
    GlobalNamespace::EditAvatarViewController::AvatarEditPart lastEditedPart;
    // Field size check
    static_assert(sizeof(GlobalNamespace::EditAvatarViewController::AvatarEditPart) == 0x4);
    public:
    // [LocalizationKeyAttribute] Offset: 0xF0F848
    // static field const value: static private System.String kEditApplyButtonLocalizationKey
    static constexpr const char* kEditApplyButtonLocalizationKey = "BUTTON_APPLY";
    // Get static field: static private System.String kEditApplyButtonLocalizationKey
    static ::Il2CppString* _get_kEditApplyButtonLocalizationKey();
    // Set static field: static private System.String kEditApplyButtonLocalizationKey
    static void _set_kEditApplyButtonLocalizationKey(::Il2CppString* value);
    // [LocalizationKeyAttribute] Offset: 0xF0F858
    // static field const value: static private System.String kCreateApplyButtonLocalizationKey
