// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: IRefreshable
#include "GlobalNamespace/IRefreshable.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: EnvironmentsListSO
  class EnvironmentsListSO;
  // Forward declaring type: EnvironmentsTableViewDataSource
  class EnvironmentsTableViewDataSource;
  // Forward declaring type: OverrideEnvironmentSettings
  class OverrideEnvironmentSettings;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Toggle
  class Toggle;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: PanelAnimationSO
  class PanelAnimationSO;
  // Forward declaring type: DropdownWithTableView
  class DropdownWithTableView;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: EnvironmentOverrideSettingsPanelController
  class EnvironmentOverrideSettingsPanelController : public GlobalNamespace::IRefreshable, public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::EnvironmentOverrideSettingsPanelController::Elements
    class Elements;
    // private UnityEngine.UI.Toggle _overrideEnvironmentsToggle
    // Offset: 0x18
    UnityEngine::UI::Toggle* overrideEnvironmentsToggle;
    // private UnityEngine.GameObject _elementsGO
    // Offset: 0x20
    UnityEngine::GameObject* elementsGO;
    // private EnvironmentOverrideSettingsPanelController/Elements[] _elements
    // Offset: 0x28
    ::Array<GlobalNamespace::EnvironmentOverrideSettingsPanelController::Elements*>* elements;
    // private HMUI.PanelAnimationSO _presentPanelAnimation
    // Offset: 0x30
    HMUI::PanelAnimationSO* presentPanelAnimation;
    // private HMUI.PanelAnimationSO _dismissPanelAnimation
    // Offset: 0x38
    HMUI::PanelAnimationSO* dismissPanelAnimation;
    // private EnvironmentsListSO _allEnvironments
    // Offset: 0x40
    GlobalNamespace::EnvironmentsListSO* allEnvironments;
    // private EnvironmentsTableViewDataSource _environmentsTableViewDataSourceTemplate
    // Offset: 0x48
    GlobalNamespace::EnvironmentsTableViewDataSource* environmentsTableViewDataSourceTemplate;
    // private OverrideEnvironmentSettings _overrideEnvironmentSettings
    // Offset: 0x50
    GlobalNamespace::OverrideEnvironmentSettings* overrideEnvironmentSettings;
    // private System.Boolean _initialized
    // Offset: 0x58
    bool initialized;
    // public OverrideEnvironmentSettings get_overrideEnvironmentSettings()
    // Offset: 0x192EE84
    GlobalNamespace::OverrideEnvironmentSettings* get_overrideEnvironmentSettings();
    // public System.Void SetData(OverrideEnvironmentSettings overrideEnvironmentSettings)
    // Offset: 0x192EE8C
    void SetData(GlobalNamespace::OverrideEnvironmentSettings* overrideEnvironmentSettings);
    // protected System.Void OnDestroy()
    // Offset: 0x192F244
    void OnDestroy();
    // private System.Void HandleDropDownDidSelectCellWithIdx(HMUI.DropdownWithTableView dropDownWithTableView, System.Int32 idx)
    // Offset: 0x192F5C0
    void HandleDropDownDidSelectCellWithIdx(HMUI::DropdownWithTableView* dropDownWithTableView, int idx);
    // private System.Void HandleOverrideEnvironmentsToggleValueChanged(System.Boolean isOn)
    // Offset: 0x192F788
    void HandleOverrideEnvironmentsToggleValueChanged(bool isOn);
    // private System.Void <HandleOverrideEnvironmentsToggleValueChanged>b__16_0()
    // Offset: 0x192F8A4
    void $HandleOverrideEnvironmentsToggleValueChanged$b__16_0();
    // public System.Void Refresh()
    // Offset: 0x192F3CC
    // Implemented from: IRefreshable
    // Base method: System.Void IRefreshable::Refresh()
    void Refresh();
    // public System.Void .ctor()
    // Offset: 0x192F89C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static EnvironmentOverrideSettingsPanelController* New_ctor();
  }; // EnvironmentOverrideSettingsPanelController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::EnvironmentOverrideSettingsPanelController*, "", "EnvironmentOverrideSettingsPanelController");
#pragma pack(pop)
