// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HMUI.TableView/IDataSource
#include "HMUI/TableView_IDataSource.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Skipping declaration: TableView because it is already included!
  // Forward declaring type: TableCell
  class TableCell;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: FileBrowserTableCell
  class FileBrowserTableCell;
  // Forward declaring type: FileBrowserItem
  class FileBrowserItem;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: FileBrowserTableView
  // [] Offset: FFFFFFFF
  class FileBrowserTableView : public UnityEngine::MonoBehaviour/*, public HMUI::TableView::IDataSource*/ {
    public:
    // private HMUI.TableView _tableView
    // Size: 0x8
    // Offset: 0x18
    HMUI::TableView* tableView;
    // Field size check
    static_assert(sizeof(HMUI::TableView*) == 0x8);
    // private FileBrowserTableCell _cellPrefab
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::FileBrowserTableCell* cellPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FileBrowserTableCell*) == 0x8);
    // private System.Single _cellHeight
    // Size: 0x4
    // Offset: 0x28
    float cellHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: cellHeight and: didSelectRow
    char __padding2[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xDCD5A4
    // private System.Action`2<FileBrowserTableView,FileBrowserItem> didSelectRow
    // Size: 0x8
    // Offset: 0x30
    System::Action_2<GlobalNamespace::FileBrowserTableView*, GlobalNamespace::FileBrowserItem*>* didSelectRow;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::FileBrowserTableView*, GlobalNamespace::FileBrowserItem*>*) == 0x8);
    // private FileBrowserItem[] _items
    // Size: 0x8
    // Offset: 0x38
    ::Array<GlobalNamespace::FileBrowserItem*>* items;
    // Field size check
    static_assert(sizeof(::Array<GlobalNamespace::FileBrowserItem*>*) == 0x8);
    // Creating value type constructor for type: FileBrowserTableView
    FileBrowserTableView(HMUI::TableView* tableView_ = {}, GlobalNamespace::FileBrowserTableCell* cellPrefab_ = {}, float cellHeight_ = {}, System::Action_2<GlobalNamespace::FileBrowserTableView*, GlobalNamespace::FileBrowserItem*>* didSelectRow_ = {}, ::Array<GlobalNamespace::FileBrowserItem*>* items_ = {}) noexcept : tableView{tableView_}, cellPrefab{cellPrefab_}, cellHeight{cellHeight_}, didSelectRow{didSelectRow_}, items{items_} {}
    // Creating interface conversion operator: operator HMUI::TableView::IDataSource
    operator HMUI::TableView::IDataSource() noexcept {
      return *reinterpret_cast<HMUI::TableView::IDataSource*>(this);
    }
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.String kCellIdentifier
    static constexpr const char* kCellIdentifier = "Cell";
    // Get static field: static private System.String kCellIdentifier
    static ::Il2CppString* _get_kCellIdentifier();
    // Set static field: static private System.String kCellIdentifier
    static void _set_kCellIdentifier(::Il2CppString* value);
    // public System.Void add_didSelectRow(System.Action`2<FileBrowserTableView,FileBrowserItem> value)
    // Offset: 0x1A10EFC
    void add_didSelectRow(System::Action_2<GlobalNamespace::FileBrowserTableView*, GlobalNamespace::FileBrowserItem*>* value);
    // public System.Void remove_didSelectRow(System.Action`2<FileBrowserTableView,FileBrowserItem> value)
    // Offset: 0x1A10FA0
    void remove_didSelectRow(System::Action_2<GlobalNamespace::FileBrowserTableView*, GlobalNamespace::FileBrowserItem*>* value);
    // public System.Void Init(FileBrowserItem[] items)
    // Offset: 0x1A11044
    void Init(::Array<GlobalNamespace::FileBrowserItem*>* items);
    // public System.Void SetItems(FileBrowserItem[] items)
    // Offset: 0x1A11160
    void SetItems(::Array<GlobalNamespace::FileBrowserItem*>* items);
    // public System.Boolean SelectAndScrollRowToItemWithPath(System.String folderPath)
    // Offset: 0x1A111BC
    bool SelectAndScrollRowToItemWithPath(::Il2CppString* folderPath);
    // private System.Void HandleDidSelectRowEvent(HMUI.TableView tableView, System.Int32 row)
    // Offset: 0x1A11444
    void HandleDidSelectRowEvent(HMUI::TableView* tableView, int row);
    // public System.Void SelectAndScrollRow(System.Int32 row)
    // Offset: 0x1A1125C
    void SelectAndScrollRow(int row);
    // public System.Void ClearSelection(System.Boolean animated, System.Boolean scrollToRow0)
    // Offset: 0x1A114E4
    void ClearSelection(bool animated, bool scrollToRow0);
    // public System.Single CellSize()
    // Offset: 0x1A112AC
    // Implemented from: HMUI.TableView/IDataSource
    // Base method: System.Single IDataSource::CellSize()
    float CellSize();
    // public System.Int32 NumberOfCells()
    // Offset: 0x1A112B4
    // Implemented from: HMUI.TableView/IDataSource
    // Base method: System.Int32 IDataSource::NumberOfCells()
    int NumberOfCells();
    // public HMUI.TableCell CellForIdx(HMUI.TableView tableView, System.Int32 row)
    // Offset: 0x1A112CC
    // Implemented from: HMUI.TableView/IDataSource
    // Base method: HMUI.TableCell IDataSource::CellForIdx(HMUI.TableView tableView, System.Int32 row)
    HMUI::TableCell* CellForIdx(HMUI::TableView* tableView, int row);
    // public System.Void .ctor()
    // Offset: 0x1A11550
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FileBrowserTableView* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::FileBrowserTableView::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FileBrowserTableView*, creationType>()));
    }
  }; // FileBrowserTableView
  static check_size<sizeof(FileBrowserTableView), 56 + sizeof(::Array<GlobalNamespace::FileBrowserItem*>*)> __GlobalNamespace_FileBrowserTableViewSizeCheck;
  static_assert(sizeof(FileBrowserTableView) == 0x40);
}
#pragma pack(pop)
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::FileBrowserTableView*, "", "FileBrowserTableView");
