// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRCenterAdjust
  class VRCenterAdjust;
  // Forward declaring type: VRController
  class VRController;
  // Forward declaring type: MouseLook
  class MouseLook;
}
// Forward declaring namespace: VRUIControls
namespace VRUIControls {
  // Forward declaring type: VRInputModule
  class VRInputModule;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: FirstPersonFlyingController
  class FirstPersonFlyingController : public UnityEngine::MonoBehaviour {
    public:
    // private System.Single _moveSensitivity
    // Offset: 0x18
    float moveSensitivity;
    // private UnityEngine.Camera _camera
    // Offset: 0x20
    UnityEngine::Camera* camera;
    // private System.Single _cameraFov
    // Offset: 0x28
    float cameraFov;
    // private VRCenterAdjust _centerAdjust
    // Offset: 0x30
    GlobalNamespace::VRCenterAdjust* centerAdjust;
    // private VRController _controller0
    // Offset: 0x38
    GlobalNamespace::VRController* controller0;
    // private VRController _controller1
    // Offset: 0x40
    GlobalNamespace::VRController* controller1;
    // private VRUIControls.VRInputModule _vrInputModule
    // Offset: 0x48
    VRUIControls::VRInputModule* vrInputModule;
    // private UnityEngine.GameObject[] _controllerModels
    // Offset: 0x50
    ::Array<UnityEngine::GameObject*>* controllerModels;
    // private MouseLook _mouseLook
    // Offset: 0x58
    GlobalNamespace::MouseLook* mouseLook;
    // private UnityEngine.Transform _cameraTransform
    // Offset: 0x60
    UnityEngine::Transform* cameraTransform;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0xBEECF8
    void Start();
    // protected System.Void OnEnable()
    // Offset: 0xBEEF20
    void OnEnable();
    // protected System.Void OnDisable()
    // Offset: 0xBEEF54
    void OnDisable();
    // protected System.Void Update()
    // Offset: 0xBEEF84
    void Update();
    // public System.Void .ctor()
    // Offset: 0xBEF350
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static FirstPersonFlyingController* New_ctor();
  }; // FirstPersonFlyingController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::FirstPersonFlyingController*, "", "FirstPersonFlyingController");
#pragma pack(pop)
