// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: TubeBloomPrePassLight
  class TubeBloomPrePassLight;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: FlickeringNeonSign
  class FlickeringNeonSign : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::FlickeringNeonSign::$FlickeringCoroutine$d__12
    class $FlickeringCoroutine$d__12;
    // private UnityEngine.SpriteRenderer _flickeringSprite
    // Offset: 0x18
    UnityEngine::SpriteRenderer* flickeringSprite;
    // private TubeBloomPrePassLight _light
    // Offset: 0x20
    GlobalNamespace::TubeBloomPrePassLight* light;
    // private System.Single _minOnDelay
    // Offset: 0x28
    float minOnDelay;
    // private System.Single _maxOnDelay
    // Offset: 0x2C
    float maxOnDelay;
    // private System.Single _minOffDelay
    // Offset: 0x30
    float minOffDelay;
    // private System.Single _maxOffDelay
    // Offset: 0x34
    float maxOffDelay;
    // private UnityEngine.Color _spriteOnColor
    // Offset: 0x38
    UnityEngine::Color spriteOnColor;
    // private UnityEngine.Color _lightOnColor
    // Offset: 0x48
    UnityEngine::Color lightOnColor;
    // private UnityEngine.Material _onMaterial
    // Offset: 0x58
    UnityEngine::Material* onMaterial;
    // private UnityEngine.Material _offMaterial
    // Offset: 0x60
    UnityEngine::Material* offMaterial;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0xBEF3D8
    void Start();
    // protected System.Void OnEnable()
    // Offset: 0xBEF420
    void OnEnable();
    // private System.Collections.IEnumerator FlickeringCoroutine()
    // Offset: 0xBEF44C
    System::Collections::IEnumerator* FlickeringCoroutine();
    // private System.Void SetOn(System.Boolean on)
    // Offset: 0xBEF4F4
    void SetOn(bool on);
    // public System.Void .ctor()
    // Offset: 0xBEF5A0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static FlickeringNeonSign* New_ctor();
  }; // FlickeringNeonSign
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::FlickeringNeonSign*, "", "FlickeringNeonSign");
#pragma pack(pop)
