// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: FlyingSpriteEffect
#include "GlobalNamespace/FlyingSpriteEffect.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
  // Forward declaring type: Material
  class Material;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: FlyingObjectEffect because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: FlyingSpriteSpawner
  class FlyingSpriteSpawner : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.Sprite _sprite
    // Offset: 0x18
    UnityEngine::Sprite* sprite;
    // private UnityEngine.Material _material
    // Offset: 0x20
    UnityEngine::Material* material;
    // private System.Single _duration
    // Offset: 0x28
    float duration;
    // private System.Single _xSpread
    // Offset: 0x2C
    float xSpread;
    // private System.Single _targetYPos
    // Offset: 0x30
    float targetYPos;
    // private System.Single _targetZPos
    // Offset: 0x34
    float targetZPos;
    // private UnityEngine.Color _color
    // Offset: 0x38
    UnityEngine::Color color;
    // private System.Boolean _shake
    // Offset: 0x48
    bool shake;
    // private FlyingSpriteEffect/Pool _flyingSpriteEffectPool
    // Offset: 0x50
    GlobalNamespace::FlyingSpriteEffect::Pool* flyingSpriteEffectPool;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void SpawnFlyingSprite(UnityEngine.Vector3 pos, UnityEngine.Quaternion rotation, UnityEngine.Quaternion inverseRotation)
    // Offset: 0xBF0F48
    void SpawnFlyingSprite(UnityEngine::Vector3 pos, UnityEngine::Quaternion rotation, UnityEngine::Quaternion inverseRotation);
    // private System.Void HandleFlyingSpriteEffectDidFinish(FlyingObjectEffect flyingObjectEffect)
    // Offset: 0xBF1180
    void HandleFlyingSpriteEffectDidFinish(GlobalNamespace::FlyingObjectEffect* flyingObjectEffect);
    // public System.Void .ctor()
    // Offset: 0xBF1264
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static FlyingSpriteSpawner* New_ctor();
  }; // FlyingSpriteSpawner
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::FlyingSpriteSpawner*, "", "FlyingSpriteSpawner");
#pragma pack(pop)
