// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x34
  #pragma pack(push, 1)
  // Autogenerated type: FlyingCar
  // [TokenAttribute] Offset: FFFFFFFF
  class FlyingCar : public UnityEngine::MonoBehaviour {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private System.Single _startZ
    // Size: 0x4
    // Offset: 0x18
    float startZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _endZ
    // Size: 0x4
    // Offset: 0x1C
    float endZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _speed
    // Size: 0x4
    // Offset: 0x20
    float speed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _progress
    // Size: 0x4
    // Offset: 0x24
    float progress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _pos
    // Size: 0xC
    // Offset: 0x28
    UnityEngine::Vector3 pos;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Single _startZ
    float& dyn__startZ();
    // Get instance field reference: private System.Single _endZ
    float& dyn__endZ();
    // Get instance field reference: private System.Single _speed
    float& dyn__speed();
    // Get instance field reference: private System.Single _progress
    float& dyn__progress();
    // Get instance field reference: private UnityEngine.Vector3 _pos
    UnityEngine::Vector3& dyn__pos();
    // protected System.Void Start()
    // Offset: 0x1173D7C
    void Start();
    // protected System.Void Update()
    // Offset: 0x1173EDC
    void Update();
    // protected System.Void UpdatePos()
    // Offset: 0x1173E2C
    void UpdatePos();
    // public System.Void .ctor()
    // Offset: 0x1173FA0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FlyingCar* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::FlyingCar::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FlyingCar*, creationType>()));
    }
  }; // FlyingCar
  #pragma pack(pop)
  static check_size<sizeof(FlyingCar), 40 + sizeof(UnityEngine::Vector3)> __GlobalNamespace_FlyingCarSizeCheck;
  static_assert(sizeof(FlyingCar) == 0x34);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::FlyingCar*, "", "FlyingCar");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::FlyingCar::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FlyingCar::*)()>(&GlobalNamespace::FlyingCar::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FlyingCar*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FlyingCar::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FlyingCar::*)()>(&GlobalNamespace::FlyingCar::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FlyingCar*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FlyingCar::UpdatePos
// Il2CppName: UpdatePos
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FlyingCar::*)()>(&GlobalNamespace::FlyingCar::UpdatePos)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FlyingCar*), "UpdatePos", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FlyingCar::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
