// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x34
  // Autogenerated type: FlyingCar
  // [] Offset: FFFFFFFF
  class FlyingCar : public UnityEngine::MonoBehaviour {
    public:
    // private System.Single _startZ
    // Size: 0x4
    // Offset: 0x18
    float startZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _endZ
    // Size: 0x4
    // Offset: 0x1C
    float endZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _speed
    // Size: 0x4
    // Offset: 0x20
    float speed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _progress
    // Size: 0x4
    // Offset: 0x24
    float progress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _pos
    // Size: 0xC
    // Offset: 0x28
    UnityEngine::Vector3 pos;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // Creating value type constructor for type: FlyingCar
    FlyingCar(float startZ_ = {}, float endZ_ = {}, float speed_ = {}, float progress_ = {}, UnityEngine::Vector3 pos_ = {}) noexcept : startZ{startZ_}, endZ{endZ_}, speed{speed_}, progress{progress_}, pos{pos_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0x1A14534
    void Start();
    // protected System.Void Update()
    // Offset: 0x1A14694
    void Update();
    // protected System.Void UpdatePos()
    // Offset: 0x1A145E4
    void UpdatePos();
    // public System.Void .ctor()
    // Offset: 0x1A14758
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FlyingCar* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("GlobalNamespace").WithContext("FlyingCar").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FlyingCar*, creationType>()));
    }
  }; // FlyingCar
  static check_size<sizeof(FlyingCar), 40 + sizeof(UnityEngine::Vector3)> __GlobalNamespace_FlyingCarSizeCheck;
  static_assert(sizeof(FlyingCar) == 0x34);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::FlyingCar*, "", "FlyingCar");
#pragma pack(pop)
