// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: FPSCounter
  // [] Offset: FFFFFFFF
  class FPSCounter : public UnityEngine::MonoBehaviour {
    public:
    // [CompilerGeneratedAttribute] Offset: 0xD3E044
    // private System.Int32 <currentFPS>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    int currentFPS;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xD3E054
    // private System.Int32 <lowestFPS>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    int lowestFPS;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xD3E064
    // private System.Int32 <highestFPS>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    int highestFPS;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _timeBuffer
    // Size: 0x4
    // Offset: 0x24
    float timeBuffer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 _frameCounter
    // Size: 0x4
    // Offset: 0x28
    int frameCounter;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: FPSCounter
    FPSCounter(int currentFPS_ = {}, int lowestFPS_ = {}, int highestFPS_ = {}, float timeBuffer_ = {}, int frameCounter_ = {}) noexcept : currentFPS{currentFPS_}, lowestFPS{lowestFPS_}, highestFPS{highestFPS_}, timeBuffer{timeBuffer_}, frameCounter{frameCounter_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Int32 get_currentFPS()
    // Offset: 0xF29C28
    int get_currentFPS();
    // private System.Void set_currentFPS(System.Int32 value)
    // Offset: 0xF29C30
    void set_currentFPS(int value);
    // public System.Int32 get_lowestFPS()
    // Offset: 0xF29C38
    int get_lowestFPS();
    // private System.Void set_lowestFPS(System.Int32 value)
    // Offset: 0xF29C40
    void set_lowestFPS(int value);
    // public System.Int32 get_highestFPS()
    // Offset: 0xF29C48
    int get_highestFPS();
    // private System.Void set_highestFPS(System.Int32 value)
    // Offset: 0xF29C50
    void set_highestFPS(int value);
    // protected System.Void Awake()
    // Offset: 0xF29C58
    void Awake();
    // protected System.Void Update()
    // Offset: 0xF29C68
    void Update();
    // public System.Void .ctor()
    // Offset: 0xF29D4C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FPSCounter* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::FPSCounter::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FPSCounter*, creationType>()));
    }
  }; // FPSCounter
  #pragma pack(pop)
  static check_size<sizeof(FPSCounter), 40 + sizeof(int)> __GlobalNamespace_FPSCounterSizeCheck;
  static_assert(sizeof(FPSCounter) == 0x2C);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::FPSCounter*, "", "FPSCounter");
