// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: IGameplayRpcManager
#include "GlobalNamespace/IGameplayRpcManager.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Action`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Action_4;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: RpcHandler`1<TType>
  template<typename TType>
  class RpcHandler_1;
  // Forward declaring type: PlayersAtGameStartNetSerializable
  class PlayersAtGameStartNetSerializable;
  // Forward declaring type: NoteCutInfoNetSerializable
  class NoteCutInfoNetSerializable;
  // Forward declaring type: NoteMissInfoNetSerializable
  class NoteMissInfoNetSerializable;
  // Forward declaring type: LevelCompletionResults
  class LevelCompletionResults;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: GameplayRpcManager
  class GameplayRpcManager : public ::Il2CppObject, public System::IDisposable, public GlobalNamespace::IGameplayRpcManager {
    public:
    // Nested type: GlobalNamespace::GameplayRpcManager::RpcType
    struct RpcType;
    // Nested type: GlobalNamespace::GameplayRpcManager::SetGameplaySceneSyncFinishedRpc
    class SetGameplaySceneSyncFinishedRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::SetGameplaySceneReadyRpc
    class SetGameplaySceneReadyRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::GetGameplaySceneReadyRpc
    class GetGameplaySceneReadyRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::SetPlayerDidConnectLateRpc
    class SetPlayerDidConnectLateRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::SetGameplaySongReadyRpc
    class SetGameplaySongReadyRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::GetGameplaySongReadyRpc
    class GetGameplaySongReadyRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::SetSongStartTimeRpc
    class SetSongStartTimeRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::NoteCutRpc
    class NoteCutRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::NoteMissedRpc
    class NoteMissedRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::LevelFinishedRpc
    class LevelFinishedRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::ReturnToMenuRpc
    class ReturnToMenuRpc;
    // Nested type: GlobalNamespace::GameplayRpcManager::EndLevelEarlyRpc
    class EndLevelEarlyRpc;
    // Autogenerated type: GameplayRpcManager/RpcType
    struct RpcType : public System::Enum {
      public:
      // public System.Byte value__
      // Offset: 0x0
      uint8_t value;
      // Creating value type constructor for type: RpcType
      constexpr RpcType(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public GameplayRpcManager/RpcType SetGameplaySceneSyncFinish
      static constexpr const uint8_t SetGameplaySceneSyncFinish = 0u;
      // Get static field: static public GameplayRpcManager/RpcType SetGameplaySceneSyncFinish
      static GlobalNamespace::GameplayRpcManager::RpcType _get_SetGameplaySceneSyncFinish();
      // Set static field: static public GameplayRpcManager/RpcType SetGameplaySceneSyncFinish
      static void _set_SetGameplaySceneSyncFinish(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType SetGameplaySceneReady
      static constexpr const uint8_t SetGameplaySceneReady = 1u;
      // Get static field: static public GameplayRpcManager/RpcType SetGameplaySceneReady
      static GlobalNamespace::GameplayRpcManager::RpcType _get_SetGameplaySceneReady();
      // Set static field: static public GameplayRpcManager/RpcType SetGameplaySceneReady
      static void _set_SetGameplaySceneReady(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType GetGameplaySceneReady
      static constexpr const uint8_t GetGameplaySceneReady = 2u;
      // Get static field: static public GameplayRpcManager/RpcType GetGameplaySceneReady
      static GlobalNamespace::GameplayRpcManager::RpcType _get_GetGameplaySceneReady();
      // Set static field: static public GameplayRpcManager/RpcType GetGameplaySceneReady
      static void _set_GetGameplaySceneReady(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType SetActivePlayerFailedToConnect
      static constexpr const uint8_t SetActivePlayerFailedToConnect = 3u;
      // Get static field: static public GameplayRpcManager/RpcType SetActivePlayerFailedToConnect
      static GlobalNamespace::GameplayRpcManager::RpcType _get_SetActivePlayerFailedToConnect();
      // Set static field: static public GameplayRpcManager/RpcType SetActivePlayerFailedToConnect
      static void _set_SetActivePlayerFailedToConnect(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType SetGameplaySongReady
      static constexpr const uint8_t SetGameplaySongReady = 4u;
      // Get static field: static public GameplayRpcManager/RpcType SetGameplaySongReady
      static GlobalNamespace::GameplayRpcManager::RpcType _get_SetGameplaySongReady();
      // Set static field: static public GameplayRpcManager/RpcType SetGameplaySongReady
      static void _set_SetGameplaySongReady(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType GetGameplaySongReady
      static constexpr const uint8_t GetGameplaySongReady = 5u;
      // Get static field: static public GameplayRpcManager/RpcType GetGameplaySongReady
      static GlobalNamespace::GameplayRpcManager::RpcType _get_GetGameplaySongReady();
      // Set static field: static public GameplayRpcManager/RpcType GetGameplaySongReady
      static void _set_GetGameplaySongReady(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType SetSongStartTime
      static constexpr const uint8_t SetSongStartTime = 6u;
      // Get static field: static public GameplayRpcManager/RpcType SetSongStartTime
      static GlobalNamespace::GameplayRpcManager::RpcType _get_SetSongStartTime();
      // Set static field: static public GameplayRpcManager/RpcType SetSongStartTime
      static void _set_SetSongStartTime(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType NoteCut
      static constexpr const uint8_t NoteCut = 7u;
      // Get static field: static public GameplayRpcManager/RpcType NoteCut
      static GlobalNamespace::GameplayRpcManager::RpcType _get_NoteCut();
      // Set static field: static public GameplayRpcManager/RpcType NoteCut
      static void _set_NoteCut(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType NoteMissed
      static constexpr const uint8_t NoteMissed = 8u;
      // Get static field: static public GameplayRpcManager/RpcType NoteMissed
      static GlobalNamespace::GameplayRpcManager::RpcType _get_NoteMissed();
      // Set static field: static public GameplayRpcManager/RpcType NoteMissed
      static void _set_NoteMissed(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType LevelFinished
      static constexpr const uint8_t LevelFinished = 9u;
      // Get static field: static public GameplayRpcManager/RpcType LevelFinished
      static GlobalNamespace::GameplayRpcManager::RpcType _get_LevelFinished();
      // Set static field: static public GameplayRpcManager/RpcType LevelFinished
      static void _set_LevelFinished(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType ReturnToMenu
      static constexpr const uint8_t ReturnToMenu = 10u;
      // Get static field: static public GameplayRpcManager/RpcType ReturnToMenu
      static GlobalNamespace::GameplayRpcManager::RpcType _get_ReturnToMenu();
      // Set static field: static public GameplayRpcManager/RpcType ReturnToMenu
      static void _set_ReturnToMenu(GlobalNamespace::GameplayRpcManager::RpcType value);
      // static field const value: static public GameplayRpcManager/RpcType EndLevelEarly
      static constexpr const uint8_t EndLevelEarly = 11u;
      // Get static field: static public GameplayRpcManager/RpcType EndLevelEarly
      static GlobalNamespace::GameplayRpcManager::RpcType _get_EndLevelEarly();
      // Set static field: static public GameplayRpcManager/RpcType EndLevelEarly
      static void _set_EndLevelEarly(GlobalNamespace::GameplayRpcManager::RpcType value);
    }; // GameplayRpcManager/RpcType
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Offset: 0x10
    GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // private readonly RpcHandler`1<GameplayRpcManager/RpcType> _rpcHandler
    // Offset: 0x18
    GlobalNamespace::RpcHandler_1<GlobalNamespace::GameplayRpcManager::RpcType>* rpcHandler;
    // private System.Action`2<System.String,PlayersAtGameStartNetSerializable> setGameplaySceneSyncFinishedEvent
    // Offset: 0x20
    System::Action_2<::Il2CppString*, GlobalNamespace::PlayersAtGameStartNetSerializable*>* setGameplaySceneSyncFinishedEvent;
    // private System.Action`1<System.String> setGameplaySceneReadyEvent
    // Offset: 0x28
    System::Action_1<::Il2CppString*>* setGameplaySceneReadyEvent;
    // private System.Action`1<System.String> getGameplaySceneReadyEvent
    // Offset: 0x30
    System::Action_1<::Il2CppString*>* getGameplaySceneReadyEvent;
    // private System.Action`3<System.String,System.String,PlayersAtGameStartNetSerializable> setPlayerDidConnectLateEvent
    // Offset: 0x38
    System::Action_3<::Il2CppString*, ::Il2CppString*, GlobalNamespace::PlayersAtGameStartNetSerializable*>* setPlayerDidConnectLateEvent;
    // private System.Action`1<System.String> setGameplaySongReadyEvent
    // Offset: 0x40
    System::Action_1<::Il2CppString*>* setGameplaySongReadyEvent;
    // private System.Action`1<System.String> getGameplaySongReadyEvent
    // Offset: 0x48
    System::Action_1<::Il2CppString*>* getGameplaySongReadyEvent;
    // private System.Action`2<System.String,System.Single> setSongStartTimeEvent
    // Offset: 0x50
    System::Action_2<::Il2CppString*, float>* setSongStartTimeEvent;
    // private System.Action`4<System.String,System.Single,System.Single,NoteCutInfoNetSerializable> noteWasCutEvent
    // Offset: 0x58
    System::Action_4<::Il2CppString*, float, float, GlobalNamespace::NoteCutInfoNetSerializable*>* noteWasCutEvent;
    // private System.Action`4<System.String,System.Single,System.Single,NoteMissInfoNetSerializable> noteWasMissedEvent
    // Offset: 0x60
    System::Action_4<::Il2CppString*, float, float, GlobalNamespace::NoteMissInfoNetSerializable*>* noteWasMissedEvent;
    // private System.Action`2<System.String,LevelCompletionResults> levelFinishedEvent
    // Offset: 0x68
    System::Action_2<::Il2CppString*, GlobalNamespace::LevelCompletionResults*>* levelFinishedEvent;
    // private System.Action`1<System.String> returnToMenuEvent
    // Offset: 0x70
    System::Action_1<::Il2CppString*>* returnToMenuEvent;
    // private System.Action`1<System.String> levelEndedEarlyEvent
    // Offset: 0x78
    System::Action_1<::Il2CppString*>* levelEndedEarlyEvent;
    // static field const value: static private System.String kGameplayState
    static constexpr const char* kGameplayState = "in_gameplay";
    // Get static field: static private System.String kGameplayState
    static ::Il2CppString* _get_kGameplayState();
    // Set static field: static private System.String kGameplayState
    static void _set_kGameplayState(::Il2CppString* value);
    // public System.Boolean get_enabled()
    // Offset: 0x1162994
    bool get_enabled();
    // public System.Void set_enabled(System.Boolean value)
    // Offset: 0x1162A58
    void set_enabled(bool value);
    // public System.Void .ctor(IMultiplayerSessionManager multiplayerSessionManager)
    // Offset: 0x1162B2C
    static GameplayRpcManager* New_ctor(GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager);
    // public System.Boolean EnabledForPlayer(IConnectedPlayer player)
