// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PersistentScriptableObject
#include "GlobalNamespace/PersistentScriptableObject.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameplayModifierParamsSO
  class GameplayModifierParamsSO;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: GameplayModifierMask
  struct GameplayModifierMask;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: GameplayModifiersModelSO
  class GameplayModifiersModelSO : public GlobalNamespace::PersistentScriptableObject {
    public:
    // Nested type: GlobalNamespace::GameplayModifiersModelSO::GameplayModifierBoolGetter
    class GameplayModifierBoolGetter;
    // Nested type: GlobalNamespace::GameplayModifiersModelSO::$$c
    class $$c;
    // private GameplayModifierParamsSO _batteryEnergy
    // Offset: 0x18
    GlobalNamespace::GameplayModifierParamsSO* batteryEnergy;
    // private GameplayModifierParamsSO _noFail
    // Offset: 0x20
    GlobalNamespace::GameplayModifierParamsSO* noFail;
    // private GameplayModifierParamsSO _instaFail
    // Offset: 0x28
    GlobalNamespace::GameplayModifierParamsSO* instaFail;
    // private GameplayModifierParamsSO _noObstacles
    // Offset: 0x30
    GlobalNamespace::GameplayModifierParamsSO* noObstacles;
    // private GameplayModifierParamsSO _noBombs
    // Offset: 0x38
    GlobalNamespace::GameplayModifierParamsSO* noBombs;
    // private GameplayModifierParamsSO _fastNotes
    // Offset: 0x40
    GlobalNamespace::GameplayModifierParamsSO* fastNotes;
    // private GameplayModifierParamsSO _strictAngles
    // Offset: 0x48
    GlobalNamespace::GameplayModifierParamsSO* strictAngles;
    // private GameplayModifierParamsSO _disappearingArrows
    // Offset: 0x50
    GlobalNamespace::GameplayModifierParamsSO* disappearingArrows;
    // private GameplayModifierParamsSO _fasterSong
    // Offset: 0x58
    GlobalNamespace::GameplayModifierParamsSO* fasterSong;
    // private GameplayModifierParamsSO _slowerSong
    // Offset: 0x60
    GlobalNamespace::GameplayModifierParamsSO* slowerSong;
    // private GameplayModifierParamsSO _noArrows
    // Offset: 0x68
    GlobalNamespace::GameplayModifierParamsSO* noArrows;
    // private GameplayModifierParamsSO _ghostNotes
    // Offset: 0x70
    GlobalNamespace::GameplayModifierParamsSO* ghostNotes;
    // private GameplayModifierParamsSO _demoNoObstacles
    // Offset: 0x78
    GlobalNamespace::GameplayModifierParamsSO* demoNoObstacles;
    // private GameplayModifierParamsSO _demoNoFail
    // Offset: 0x80
    GlobalNamespace::GameplayModifierParamsSO* demoNoFail;
    // private System.Collections.Generic.Dictionary`2<GameplayModifierParamsSO,GameplayModifiersModelSO/GameplayModifierBoolGetter> _gameplayModifierGetters
    // Offset: 0x88
    System::Collections::Generic::Dictionary_2<GlobalNamespace::GameplayModifierParamsSO*, GlobalNamespace::GameplayModifiersModelSO::GameplayModifierBoolGetter*>* gameplayModifierGetters;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public GameplayModifiers CreateGameplayModifiers(System.Func`2<GameplayModifierParamsSO,System.Boolean> valueGetter)
    // Offset: 0xF0EADC
    GlobalNamespace::GameplayModifiers* CreateGameplayModifiers(System::Func_2<GlobalNamespace::GameplayModifierParamsSO*, bool>* valueGetter);
    // public System.Boolean GetModifierBoolValue(GameplayModifiers gameplayModifiers, GameplayModifierParamsSO gameplayModifierParams)
    // Offset: 0xF0ED14
    bool GetModifierBoolValue(GlobalNamespace::GameplayModifiers* gameplayModifiers, GlobalNamespace::GameplayModifierParamsSO* gameplayModifierParams);
    // public System.Collections.Generic.List`1<GameplayModifierParamsSO> GetModifierParams(GameplayModifiers gameplayModifiers)
    // Offset: 0xF0F178
    System::Collections::Generic::List_1<GlobalNamespace::GameplayModifierParamsSO*>* GetModifierParams(GlobalNamespace::GameplayModifiers* gameplayModifiers);
    // public System.Single GetTotalMultiplier(GameplayModifiers gameplayModifiers)
    // Offset: 0xF0F324
    float GetTotalMultiplier(GlobalNamespace::GameplayModifiers* gameplayModifiers);
    // public System.Int32 MaxModifiedScoreForMaxRawScore(System.Int32 maxRawScore, GameplayModifiers gameplayModifiers)
    // Offset: 0xF0F440
    int MaxModifiedScoreForMaxRawScore(int maxRawScore, GlobalNamespace::GameplayModifiers* gameplayModifiers);
    // public System.Int32 MaxModifiedScoreForMaxRawScore(System.Int32 maxRawScore, GameplayModifiers gameplayModifiers, GameplayModifiersModelSO gameplayModifiersModel)
    // Offset: 0xF0F498
    int MaxModifiedScoreForMaxRawScore(int maxRawScore, GlobalNamespace::GameplayModifiers* gameplayModifiers, GlobalNamespace::GameplayModifiersModelSO* gameplayModifiersModel);
    // private System.Int32 GetModifiedScoreForGameplayModifiers(System.Int32 rawScore, GameplayModifiers gameplayModifiers)
    // Offset: 0xF0F46C
    int GetModifiedScoreForGameplayModifiers(int rawScore, GlobalNamespace::GameplayModifiers* gameplayModifiers);
    // public GameplayModifierParamsSO GetGameplayModifierParams(GameplayModifierMask modifier)
    // Offset: 0xF0F4C4
    GlobalNamespace::GameplayModifierParamsSO* GetGameplayModifierParams(GlobalNamespace::GameplayModifierMask modifier);
    // protected override System.Void OnEnable()
    // Offset: 0xF0E0B4
    // Implemented from: PersistentScriptableObject
    // Base method: System.Void PersistentScriptableObject::OnEnable()
    void OnEnable();
    // public System.Void .ctor()
    // Offset: 0xF0F5C0
    // Implemented from: PersistentScriptableObject
    // Base method: System.Void PersistentScriptableObject::.ctor()
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static GameplayModifiersModelSO* New_ctor();
  }; // GameplayModifiersModelSO
  check_size<sizeof(GameplayModifiersModelSO), 136 + sizeof(void*) + 8 - (136 + sizeof(void*)) % 8> __GlobalNamespace_GameplayModifiersModelSOSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::GameplayModifiersModelSO*, "", "GameplayModifiersModelSO");
#pragma pack(pop)
