// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: IConnectionManager
#include "GlobalNamespace/IConnectionManager.hpp"
// Including type: BeatmapLevelSelectionMask
#include "GlobalNamespace/BeatmapLevelSelectionMask.hpp"
// Including type: GameplayServerConfiguration
#include "GlobalNamespace/GameplayServerConfiguration.hpp"
// Including type: PublicServerInfo
#include "GlobalNamespace/PublicServerInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LiteNetLibConnectionManager
  class LiteNetLibConnectionManager;
  // Forward declaring type: GameLiftClientMessageHandler
  class GameLiftClientMessageHandler;
  // Forward declaring type: IAuthenticationTokenProvider
  class IAuthenticationTokenProvider;
  // Forward declaring type: GameLiftClientConnectionRequestHandler
  class GameLiftClientConnectionRequestHandler;
  // Forward declaring type: IConnection
  class IConnection;
  // Forward declaring type: IConnectionInitParams`1<T>
  template<typename T>
  class IConnectionInitParams_1;
}
// Forward declaring namespace: BGNet::Core
namespace BGNet::Core {
  // Forward declaring type: ITimeProvider
  class ITimeProvider;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
}
// Forward declaring namespace: BGNet::Core::GameLift
namespace BGNet::Core::GameLift {
  // Forward declaring type: IGameLiftPlayerSessionProvider
  class IGameLiftPlayerSessionProvider;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataReader
  class NetDataReader;
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GameLiftConnectionManager
  class GameLiftConnectionManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GameLiftConnectionManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GameLiftConnectionManager*, "", "GameLiftConnectionManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: GameLiftConnectionManager
  // [TokenAttribute] Offset: FFFFFFFF
  class GameLiftConnectionManager : public ::Il2CppObject/*, public ::GlobalNamespace::IConnectionManager*/ {
    public:
    // Nested type: ::GlobalNamespace::GameLiftConnectionManager::ConnectionState
    struct ConnectionState;
    // Nested type: ::GlobalNamespace::GameLiftConnectionManager::GameLiftConnectionManagerParamsBase
    class GameLiftConnectionManagerParamsBase;
    // Nested type: ::GlobalNamespace::GameLiftConnectionManager::ConnectToServerParams
    class ConnectToServerParams;
    // Nested type: ::GlobalNamespace::GameLiftConnectionManager::StartClientParams
    class StartClientParams;
    // Nested type: ::GlobalNamespace::GameLiftConnectionManager::$GameLiftConnectToServer$d__81
    struct $GameLiftConnectToServer$d__81;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GameLiftConnectionManager/ConnectionState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ConnectionState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ConnectionState
      constexpr ConnectionState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GameLiftConnectionManager/ConnectionState Unconnected
      static constexpr const int Unconnected = 0;
      // Get static field: static public GameLiftConnectionManager/ConnectionState Unconnected
      static ::GlobalNamespace::GameLiftConnectionManager::ConnectionState _get_Unconnected();
      // Set static field: static public GameLiftConnectionManager/ConnectionState Unconnected
      static void _set_Unconnected(::GlobalNamespace::GameLiftConnectionManager::ConnectionState value);
      // static field const value: static public GameLiftConnectionManager/ConnectionState Connecting
      static constexpr const int Connecting = 1;
      // Get static field: static public GameLiftConnectionManager/ConnectionState Connecting
      static ::GlobalNamespace::GameLiftConnectionManager::ConnectionState _get_Connecting();
      // Set static field: static public GameLiftConnectionManager/ConnectionState Connecting
      static void _set_Connecting(::GlobalNamespace::GameLiftConnectionManager::ConnectionState value);
      // static field const value: static public GameLiftConnectionManager/ConnectionState Connected
      static constexpr const int Connected = 2;
      // Get static field: static public GameLiftConnectionManager/ConnectionState Connected
      static ::GlobalNamespace::GameLiftConnectionManager::ConnectionState _get_Connected();
      // Set static field: static public GameLiftConnectionManager/ConnectionState Connected
      static void _set_Connected(::GlobalNamespace::GameLiftConnectionManager::ConnectionState value);
      // static field const value: static public GameLiftConnectionManager/ConnectionState Disconnecting
      static constexpr const int Disconnecting = 3;
      // Get static field: static public GameLiftConnectionManager/ConnectionState Disconnecting
      static ::GlobalNamespace::GameLiftConnectionManager::ConnectionState _get_Disconnecting();
      // Set static field: static public GameLiftConnectionManager/ConnectionState Disconnecting
      static void _set_Disconnecting(::GlobalNamespace::GameLiftConnectionManager::ConnectionState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // GameLiftConnectionManager/ConnectionState
    #pragma pack(pop)
    static check_size<sizeof(GameLiftConnectionManager::ConnectionState), 0 + sizeof(int)> __GlobalNamespace_GameLiftConnectionManager_ConnectionStateSizeCheck;
    static_assert(sizeof(GameLiftConnectionManager::ConnectionState) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly BGNet.Core.ITimeProvider _timeProvider
    // Size: 0x8
    // Offset: 0x10
    ::BGNet::Core::ITimeProvider* timeProvider;
    // Field size check
    static_assert(sizeof(::BGNet::Core::ITimeProvider*) == 0x8);
    // private readonly LiteNetLibConnectionManager _liteNetLibConnectionManager
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::LiteNetLibConnectionManager* liteNetLibConnectionManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LiteNetLibConnectionManager*) == 0x8);
    // private System.String _code
    // Size: 0x8
    // Offset: 0x20
    ::StringW code;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _secret
    // Size: 0x8
    // Offset: 0x28
    ::StringW secret;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private BeatmapLevelSelectionMask _selectionMask
    // Size: 0x18
    // Offset: 0x30
    ::GlobalNamespace::BeatmapLevelSelectionMask selectionMask;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapLevelSelectionMask) == 0x18);
    // private GameplayServerConfiguration _configuration
    // Size: 0x18
    // Offset: 0x48
    ::GlobalNamespace::GameplayServerConfiguration configuration;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameplayServerConfiguration) == 0x18);
    // private GameLiftClientMessageHandler _messageHandler
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::GameLiftClientMessageHandler* messageHandler;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameLiftClientMessageHandler*) == 0x8);
    // private GameLiftConnectionManager/ConnectionState _connectionState
    // Size: 0x4
    // Offset: 0x68
    ::GlobalNamespace::GameLiftConnectionManager::ConnectionState connectionState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameLiftConnectionManager::ConnectionState) == 0x4);
    // Padding between fields: connectionState and: connectionCancellationTokenSource
    char __padding7[0x4] = {};
    // private System.Threading.CancellationTokenSource _connectionCancellationTokenSource
    // Size: 0x8
    // Offset: 0x70
    ::System::Threading::CancellationTokenSource* connectionCancellationTokenSource;
    // Field size check
    static_assert(sizeof(::System::Threading::CancellationTokenSource*) == 0x8);
    // private System.Threading.Tasks.Task`1<IAuthenticationTokenProvider> _authenticationTokenProviderTask
    // Size: 0x8
    // Offset: 0x78
    ::System::Threading::Tasks::Task_1<::GlobalNamespace::IAuthenticationTokenProvider*>* authenticationTokenProviderTask;
    // Field size check
    static_assert(sizeof(::System::Threading::Tasks::Task_1<::GlobalNamespace::IAuthenticationTokenProvider*>*) == 0x8);
    // private BGNet.Core.GameLift.IGameLiftPlayerSessionProvider _gameLiftPlayerSessionProvider
    // Size: 0x8
    // Offset: 0x80
    ::BGNet::Core::GameLift::IGameLiftPlayerSessionProvider* gameLiftPlayerSessionProvider;
    // Field size check
    static_assert(sizeof(::BGNet::Core::GameLift::IGameLiftPlayerSessionProvider*) == 0x8);
    // private readonly GameLiftClientConnectionRequestHandler _connectionRequestHandler
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::GameLiftClientConnectionRequestHandler* connectionRequestHandler;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameLiftClientConnectionRequestHandler*) == 0x8);
    // private System.Action onInitializedEvent
    // Size: 0x8
    // Offset: 0x90
    ::System::Action* onInitializedEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action onConnectedEvent
    // Size: 0x8
    // Offset: 0x98
    ::System::Action* onConnectedEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<DisconnectedReason> onDisconnectedEvent
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_1<::GlobalNamespace::DisconnectedReason>* onDisconnectedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::DisconnectedReason>*) == 0x8);
    // private System.Action`1<ConnectionFailedReason> onConnectionFailedEvent
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action_1<::GlobalNamespace::ConnectionFailedReason>* onConnectionFailedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::ConnectionFailedReason>*) == 0x8);
    // private System.Action`1<IConnection> onConnectionConnectedEvent
    // Size: 0x8
    // Offset: 0xB0
    ::System::Action_1<::GlobalNamespace::IConnection*>* onConnectionConnectedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::IConnection*>*) == 0x8);
    // private System.Action`2<IConnection,DisconnectedReason> onConnectionDisconnectedEvent
    // Size: 0x8
    // Offset: 0xB8
    ::System::Action_2<::GlobalNamespace::IConnection*, ::GlobalNamespace::DisconnectedReason>* onConnectionDisconnectedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::IConnection*, ::GlobalNamespace::DisconnectedReason>*) == 0x8);
    // private System.Action`3<IConnection,LiteNetLib.Utils.NetDataReader,LiteNetLib.DeliveryMethod> onReceivedDataEvent
    // Size: 0x8
    // Offset: 0xC0
    ::System::Action_3<::GlobalNamespace::IConnection*, ::LiteNetLib::Utils::NetDataReader*, ::LiteNetLib::DeliveryMethod>* onReceivedDataEvent;
    // Field size check
    static_assert(sizeof(::System::Action_3<::GlobalNamespace::IConnection*, ::LiteNetLib::Utils::NetDataReader*, ::LiteNetLib::DeliveryMethod>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IConnectionManager
    operator ::GlobalNamespace::IConnectionManager() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IConnectionManager*>(this);
    }
    // Get instance field reference: private readonly BGNet.Core.ITimeProvider _timeProvider
    ::BGNet::Core::ITimeProvider*& dyn__timeProvider();
    // Get instance field reference: private readonly LiteNetLibConnectionManager _liteNetLibConnectionManager
    ::GlobalNamespace::LiteNetLibConnectionManager*& dyn__liteNetLibConnectionManager();
