// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HMUI.TableView/HMUI.IDataSource
#include "HMUI/TableView_IDataSource.hpp"
// Including type: BeatmapDifficulty
#include "GlobalNamespace/BeatmapDifficulty.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Skipping declaration: TableView because it is already included!
  // Forward declaring type: TableCell
  class TableCell;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameServerPlayerTableCell
  class GameServerPlayerTableCell;
  // Forward declaring type: AdditionalContentModel
  class AdditionalContentModel;
  // Forward declaring type: BeatmapCharacteristicSO
  class BeatmapCharacteristicSO;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: ILobbyPlayersDataModel
  class ILobbyPlayersDataModel;
  // Forward declaring type: ILobbyPlayerData
  class ILobbyPlayerData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: DiContainer
  class DiContainer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: GameServerPlayersTableView
  // [TokenAttribute] Offset: FFFFFFFF
  class GameServerPlayersTableView : public UnityEngine::MonoBehaviour/*, public HMUI::TableView::IDataSource*/ {
    public:
    // private HMUI.TableView _tableView
    // Size: 0x8
    // Offset: 0x18
    HMUI::TableView* tableView;
    // Field size check
    static_assert(sizeof(HMUI::TableView*) == 0x8);
    // private GameServerPlayerTableCell _gameServerPlayerCellPrefab
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::GameServerPlayerTableCell* gameServerPlayerCellPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameServerPlayerTableCell*) == 0x8);
    // private GameServerPlayerTableCell _gameServerPlayerCellWithoutSongsPrefab
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::GameServerPlayerTableCell* gameServerPlayerCellWithoutSongsPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameServerPlayerTableCell*) == 0x8);
    // private GameServerPlayerTableCell _gameServerPlayerCellWithoutModifiersPrefab
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::GameServerPlayerTableCell* gameServerPlayerCellWithoutModifiersPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameServerPlayerTableCell*) == 0x8);
    // private UnityEngine.GameObject _tableHeaderSongGo
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::GameObject* tableHeaderSongGo;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject _tableHeaderModifiersGo
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::GameObject* tableHeaderModifiersGo;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // [InjectAttribute] Offset: 0xF12560
    // private readonly Zenject.DiContainer _container
    // Size: 0x8
    // Offset: 0x48
    Zenject::DiContainer* container;
    // Field size check
    static_assert(sizeof(Zenject::DiContainer*) == 0x8);
    // [InjectAttribute] Offset: 0xF12570
    // private readonly AdditionalContentModel _additionalContentModel
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::AdditionalContentModel* additionalContentModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AdditionalContentModel*) == 0x8);
    // private System.Action`3<System.String,BeatmapCharacteristicSO,BeatmapDifficulty> selectSuggestedLevelEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action_3<::Il2CppString*, GlobalNamespace::BeatmapCharacteristicSO*, GlobalNamespace::BeatmapDifficulty>* selectSuggestedLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_3<::Il2CppString*, GlobalNamespace::BeatmapCharacteristicSO*, GlobalNamespace::BeatmapDifficulty>*) == 0x8);
    // private System.Action`1<GameplayModifiers> selectSuggestedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x60
    System::Action_1<GlobalNamespace::GameplayModifiers*>* selectSuggestedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::GameplayModifiers*>*) == 0x8);
    // private System.Action`1<System.String> kickPlayerEvent
    // Size: 0x8
    // Offset: 0x68
    System::Action_1<::Il2CppString*>* kickPlayerEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // private System.Boolean _initialized
    // Size: 0x1
    // Offset: 0x70
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _hasKickPermissions
    // Size: 0x1
    // Offset: 0x71
    bool hasKickPermissions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _allowSelection
    // Size: 0x1
    // Offset: 0x72
    bool allowSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showSongSelection
    // Size: 0x1
    // Offset: 0x73
    bool showSongSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showModifierSelection
    // Size: 0x1
    // Offset: 0x74
    bool showModifierSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showModifierSelection and: selectedPlayer
    char __padding15[0x3] = {};
    // private IConnectedPlayer _selectedPlayer
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::IConnectedPlayer* selectedPlayer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IConnectedPlayer*) == 0x8);
    // private System.Collections.Generic.List`1<IConnectedPlayer> _sortedConnectedPlayers
    // Size: 0x8
    // Offset: 0x80
    System::Collections::Generic::List_1<GlobalNamespace::IConnectedPlayer*>* sortedConnectedPlayers;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private ILobbyPlayersDataModel _lobbyPlayersDataModel
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::ILobbyPlayersDataModel* lobbyPlayersDataModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ILobbyPlayersDataModel*) == 0x8);
    // Creating value type constructor for type: GameServerPlayersTableView
