// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Zenject.MonoInstaller
#include "Zenject/MonoInstaller.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatLineManager
  class BeatLineManager;
  // Forward declaring type: AudioManagerSO
  class AudioManagerSO;
  // Forward declaring type: BeatmapObjectSpawnControllerPlayerHeightSetter
  class BeatmapObjectSpawnControllerPlayerHeightSetter;
  // Forward declaring type: PlayerHeightDetector
  class PlayerHeightDetector;
  // Forward declaring type: NoteCutScoreSpawner
  class NoteCutScoreSpawner;
  // Forward declaring type: BadNoteCutEffectSpawner
  class BadNoteCutEffectSpawner;
  // Forward declaring type: MissedNoteEffectSpawner
  class MissedNoteEffectSpawner;
  // Forward declaring type: EffectPoolsManualInstaller
  class EffectPoolsManualInstaller;
  // Forward declaring type: GameplayCoreSceneSetupData
  class GameplayCoreSceneSetupData;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: GameplayCoreInstaller
  class GameplayCoreInstaller : public Zenject::MonoInstaller {
    public:
    // private BeatLineManager _beatLineManagerPrefab
    // Offset: 0x20
    GlobalNamespace::BeatLineManager* beatLineManagerPrefab;
    // private AudioManagerSO _audioMixer
    // Offset: 0x28
    GlobalNamespace::AudioManagerSO* audioMixer;
    // private BeatmapObjectSpawnControllerPlayerHeightSetter _beatmapObjectSpawnControllerPlayerHeightSetterPrefab
    // Offset: 0x30
    GlobalNamespace::BeatmapObjectSpawnControllerPlayerHeightSetter* beatmapObjectSpawnControllerPlayerHeightSetterPrefab;
    // private PlayerHeightDetector _playerHeightDetectorPrefab
    // Offset: 0x38
    GlobalNamespace::PlayerHeightDetector* playerHeightDetectorPrefab;
    // private NoteCutScoreSpawner _noteCutScoreSpawnerPrefab
    // Offset: 0x40
    GlobalNamespace::NoteCutScoreSpawner* noteCutScoreSpawnerPrefab;
    // private BadNoteCutEffectSpawner _badNoteCutEffectSpawnerPrefab
    // Offset: 0x48
    GlobalNamespace::BadNoteCutEffectSpawner* badNoteCutEffectSpawnerPrefab;
    // private MissedNoteEffectSpawner _missedNoteEffectSpawnerPrefab
    // Offset: 0x50
    GlobalNamespace::MissedNoteEffectSpawner* missedNoteEffectSpawnerPrefab;
    // private EffectPoolsManualInstaller _effectPoolsManualInstaller
    // Offset: 0x58
    GlobalNamespace::EffectPoolsManualInstaller* effectPoolsManualInstaller;
    // private readonly GameplayCoreSceneSetupData _sceneSetupData
    // Offset: 0x60
    GlobalNamespace::GameplayCoreSceneSetupData* sceneSetupData;
    // public override System.Void InstallBindings()
    // Offset: 0xEC71FC
    // Implemented from: Zenject.MonoInstallerBase
    // Base method: System.Void MonoInstallerBase::InstallBindings()
    void InstallBindings();
    // public System.Void .ctor()
    // Offset: 0xEC833C
    // Implemented from: Zenject.MonoInstaller
    // Base method: System.Void MonoInstaller::.ctor()
    // Base method: System.Void MonoInstallerBase::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static GameplayCoreInstaller* New_ctor();
  }; // GameplayCoreInstaller
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::GameplayCoreInstaller*, "", "GameplayCoreInstaller");
#pragma pack(pop)
