// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Zenject.MonoInstaller
#include "Zenject/MonoInstaller.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatLineManager
  class BeatLineManager;
  // Forward declaring type: AudioManagerSO
  class AudioManagerSO;
  // Forward declaring type: BeatmapObjectSpawnControllerPlayerHeightSetter
  class BeatmapObjectSpawnControllerPlayerHeightSetter;
  // Forward declaring type: PlayerHeightDetector
  class PlayerHeightDetector;
  // Forward declaring type: NoteCutScoreSpawner
  class NoteCutScoreSpawner;
  // Forward declaring type: BadNoteCutEffectSpawner
  class BadNoteCutEffectSpawner;
  // Forward declaring type: MissedNoteEffectSpawner
  class MissedNoteEffectSpawner;
  // Forward declaring type: EffectPoolsManualInstaller
  class EffectPoolsManualInstaller;
  // Forward declaring type: GameplayCoreSceneSetupData
  class GameplayCoreSceneSetupData;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: GameplayCoreInstaller
  class GameplayCoreInstaller : public Zenject::MonoInstaller {
    public:
    // private BeatLineManager _beatLineManagerPrefab
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::BeatLineManager* beatLineManagerPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatLineManager*) == 0x8);
    // [SpaceAttribute] Offset: 0xD40364
    // private AudioManagerSO _audioMixer
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::AudioManagerSO* audioMixer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AudioManagerSO*) == 0x8);
    // private BeatmapObjectSpawnControllerPlayerHeightSetter _beatmapObjectSpawnControllerPlayerHeightSetterPrefab
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::BeatmapObjectSpawnControllerPlayerHeightSetter* beatmapObjectSpawnControllerPlayerHeightSetterPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapObjectSpawnControllerPlayerHeightSetter*) == 0x8);
    // private PlayerHeightDetector _playerHeightDetectorPrefab
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::PlayerHeightDetector* playerHeightDetectorPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::PlayerHeightDetector*) == 0x8);
    // private NoteCutScoreSpawner _noteCutScoreSpawnerPrefab
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::NoteCutScoreSpawner* noteCutScoreSpawnerPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NoteCutScoreSpawner*) == 0x8);
    // private BadNoteCutEffectSpawner _badNoteCutEffectSpawnerPrefab
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::BadNoteCutEffectSpawner* badNoteCutEffectSpawnerPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BadNoteCutEffectSpawner*) == 0x8);
    // private MissedNoteEffectSpawner _missedNoteEffectSpawnerPrefab
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::MissedNoteEffectSpawner* missedNoteEffectSpawnerPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MissedNoteEffectSpawner*) == 0x8);
    // [SpaceAttribute] Offset: 0xD403EC
    // private EffectPoolsManualInstaller _effectPoolsManualInstaller
    // Size: 0x8
    // Offset: 0x58
    GlobalNamespace::EffectPoolsManualInstaller* effectPoolsManualInstaller;
    // Field size check
    static_assert(sizeof(GlobalNamespace::EffectPoolsManualInstaller*) == 0x8);
    // [InjectAttribute] Offset: 0xD40424
    // private readonly GameplayCoreSceneSetupData _sceneSetupData
    // Size: 0x8
    // Offset: 0x60
    GlobalNamespace::GameplayCoreSceneSetupData* sceneSetupData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameplayCoreSceneSetupData*) == 0x8);
    // Creating value type constructor for type: GameplayCoreInstaller
    GameplayCoreInstaller(GlobalNamespace::BeatLineManager* beatLineManagerPrefab_ = {}, GlobalNamespace::AudioManagerSO* audioMixer_ = {}, GlobalNamespace::BeatmapObjectSpawnControllerPlayerHeightSetter* beatmapObjectSpawnControllerPlayerHeightSetterPrefab_ = {}, GlobalNamespace::PlayerHeightDetector* playerHeightDetectorPrefab_ = {}, GlobalNamespace::NoteCutScoreSpawner* noteCutScoreSpawnerPrefab_ = {}, GlobalNamespace::BadNoteCutEffectSpawner* badNoteCutEffectSpawnerPrefab_ = {}, GlobalNamespace::MissedNoteEffectSpawner* missedNoteEffectSpawnerPrefab_ = {}, GlobalNamespace::EffectPoolsManualInstaller* effectPoolsManualInstaller_ = {}, GlobalNamespace::GameplayCoreSceneSetupData* sceneSetupData_ = {}) noexcept : beatLineManagerPrefab{beatLineManagerPrefab_}, audioMixer{audioMixer_}, beatmapObjectSpawnControllerPlayerHeightSetterPrefab{beatmapObjectSpawnControllerPlayerHeightSetterPrefab_}, playerHeightDetectorPrefab{playerHeightDetectorPrefab_}, noteCutScoreSpawnerPrefab{noteCutScoreSpawnerPrefab_}, badNoteCutEffectSpawnerPrefab{badNoteCutEffectSpawnerPrefab_}, missedNoteEffectSpawnerPrefab{missedNoteEffectSpawnerPrefab_}, effectPoolsManualInstaller{effectPoolsManualInstaller_}, sceneSetupData{sceneSetupData_} {}
    // public override System.Void InstallBindings()
    // Offset: 0xF64844
    // Implemented from: Zenject.MonoInstallerBase
    // Base method: System.Void MonoInstallerBase::InstallBindings()
    void InstallBindings();
    // public System.Void .ctor()
    // Offset: 0xF65E18
    // Implemented from: Zenject.MonoInstaller
    // Base method: System.Void MonoInstaller::.ctor()
    // Base method: System.Void MonoInstallerBase::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GameplayCoreInstaller* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::GameplayCoreInstaller::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GameplayCoreInstaller*, creationType>()));
    }
  }; // GameplayCoreInstaller
  #pragma pack(pop)
  static check_size<sizeof(GameplayCoreInstaller), 96 + sizeof(GlobalNamespace::GameplayCoreSceneSetupData*)> __GlobalNamespace_GameplayCoreInstallerSizeCheck;
  static_assert(sizeof(GameplayCoreInstaller) == 0x68);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::GameplayCoreInstaller*, "", "GameplayCoreInstaller");
