// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SceneInfo
  class SceneInfo;
  // Forward declaring type: ScenesTransitionSetupDataSO
  class ScenesTransitionSetupDataSO;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: ZenjectSceneLoader
  class ZenjectSceneLoader;
  // Forward declaring type: DiContainer
  class DiContainer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: WaitUntil
  class WaitUntil;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: GameScenesManager
  // [TokenAttribute] Offset: FFFFFFFF
  class GameScenesManager : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::GameScenesManager::ScenesStackData
    class ScenesStackData;
    // Nested type: GlobalNamespace::GameScenesManager::ScenePresentType
    struct ScenePresentType;
    // Nested type: GlobalNamespace::GameScenesManager::SceneDismissType
    struct SceneDismissType;
    // Nested type: GlobalNamespace::GameScenesManager::$$c__DisplayClass30_0
    class $$c__DisplayClass30_0;
    // Nested type: GlobalNamespace::GameScenesManager::$$c__DisplayClass31_0
    class $$c__DisplayClass31_0;
    // Nested type: GlobalNamespace::GameScenesManager::$$c__DisplayClass32_0
    class $$c__DisplayClass32_0;
    // Nested type: GlobalNamespace::GameScenesManager::$$c__DisplayClass33_0
    class $$c__DisplayClass33_0;
    // Nested type: GlobalNamespace::GameScenesManager::$ScenesTransitionCoroutine$d__36
    class $ScenesTransitionCoroutine$d__36;
    // private SceneInfo _emptyTransitionSceneInfo
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::SceneInfo* emptyTransitionSceneInfo;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SceneInfo*) == 0x8);
    // [InjectAttribute] Offset: 0xF093B0
    // private readonly Zenject.ZenjectSceneLoader _zenjectSceneLoader
    // Size: 0x8
    // Offset: 0x20
    Zenject::ZenjectSceneLoader* zenjectSceneLoader;
    // Field size check
    static_assert(sizeof(Zenject::ZenjectSceneLoader*) == 0x8);
    // private System.Action`1<System.Single> transitionDidStartEvent
    // Size: 0x8
    // Offset: 0x28
    System::Action_1<float>* transitionDidStartEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<float>*) == 0x8);
    // private System.Action beforeDismissingScenesEvent
    // Size: 0x8
    // Offset: 0x30
    System::Action* beforeDismissingScenesEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Action`2<ScenesTransitionSetupDataSO,Zenject.DiContainer> transitionDidFinishEvent
    // Size: 0x8
    // Offset: 0x38
    System::Action_2<GlobalNamespace::ScenesTransitionSetupDataSO*, Zenject::DiContainer*>* transitionDidFinishEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::ScenesTransitionSetupDataSO*, Zenject::DiContainer*>*) == 0x8);
    // private System.Action`2<ScenesTransitionSetupDataSO,Zenject.DiContainer> installEarlyBindingsEvent
    // Size: 0x8
    // Offset: 0x40
    System::Action_2<GlobalNamespace::ScenesTransitionSetupDataSO*, Zenject::DiContainer*>* installEarlyBindingsEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::ScenesTransitionSetupDataSO*, Zenject::DiContainer*>*) == 0x8);
    // private System.Boolean _inTransition
    // Size: 0x1
    // Offset: 0x48
    bool inTransition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inTransition and: scenesStack
    char __padding6[0x7] = {};
    // private readonly System.Collections.Generic.List`1<GameScenesManager/ScenesStackData> _scenesStack
    // Size: 0x8
    // Offset: 0x50
    System::Collections::Generic::List_1<GlobalNamespace::GameScenesManager::ScenesStackData*>* scenesStack;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::GameScenesManager::ScenesStackData*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<System.String> _neverUnloadScenes
    // Size: 0x8
    // Offset: 0x58
    System::Collections::Generic::HashSet_1<::Il2CppString*>* neverUnloadScenes;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<::Il2CppString*>*) == 0x8);
    // Creating value type constructor for type: GameScenesManager
