// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HMUI.FlowCoordinator
#include "HMUI/FlowCoordinator.hpp"
// Including type: LevelSelectionFlowCoordinator
#include "GlobalNamespace/LevelSelectionFlowCoordinator.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ServerPlayerListViewController
  class ServerPlayerListViewController;
  // Forward declaring type: SelectModifiersViewController
  class SelectModifiersViewController;
  // Forward declaring type: MultiplayerLevelSelectionFlowCoordinator
  class MultiplayerLevelSelectionFlowCoordinator;
  // Forward declaring type: MultiplayerResultsViewController
  class MultiplayerResultsViewController;
  // Forward declaring type: SimpleDialogPromptViewController
  class SimpleDialogPromptViewController;
  // Forward declaring type: ConnectionErrorDialogViewController

  class ILobbyPlayersDataModel;
  // Forward declaring type: ILobbyGameStateController
  class ILobbyGameStateController;
  // Forward declaring type: LobbyPlayerPermissionsModel
  class LobbyPlayerPermissionsModel;
  // Forward declaring type: LobbySetupViewController
  class LobbySetupViewController;
  // Forward declaring type: IUnifiedNetworkPlayerModel
  class IUnifiedNetworkPlayerModel;
  // Forward declaring type: PlayerDataModel
  class PlayerDataModel;
  // Forward declaring type: PlatformLeaderboardsModel
  class PlatformLeaderboardsModel;
  // Forward declaring type: SongPreviewPlayer
  class SongPreviewPlayer;
  // Forward declaring type: IAnalyticsModel
  class IAnalyticsModel;
  // Forward declaring type: MultiplayerLobbyState
  struct MultiplayerLobbyState;
  // Forward declaring type: PreviewDifficultyBeatmap
  class PreviewDifficultyBeatmap;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: ILevelGameplaySetupData
  class ILevelGameplaySetupData;
  // Forward declaring type: MultiplayerLevelScenesTransitionSetupDataSO
  class MultiplayerLevelScenesTransitionSetupDataSO;
  // Forward declaring type: MultiplayerResultsData
  class MultiplayerResultsData;
  // Forward declaring type: DisconnectedReason
  struct DisconnectedReason;
  // Forward declaring type: CannotStartGameReason
  struct CannotStartGameReason;
  // Forward declaring type: PlayersMissingEntitlementsNetSerializable
  class PlayersMissingEntitlementsNetSerializable;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ScreenModeSO
  class ScreenModeSO;
  // Forward declaring type: ScreenModeController
  class ScreenModeController;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GameServerLobbyFlowCoordinator
  class GameServerLobbyFlowCoordinator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GameServerLobbyFlowCoordinator);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GameServerLobbyFlowCoordinator*, "", "GameServerLobbyFlowCoordinator");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x1B9
  #pragma pack(push, 1)
  // Autogenerated type: GameServerLobbyFlowCoordinator
  // [TokenAttribute] Offset: FFFFFFFF
  class GameServerLobbyFlowCoordinator : public ::HMUI::FlowCoordinator {
    public:
    // Nested type: ::GlobalNamespace::GameServerLobbyFlowCoordinator::LobbyType
    struct LobbyType;
    // Nested type: ::GlobalNamespace::GameServerLobbyFlowCoordinator::$$c__DisplayClass70_0
    class $$c__DisplayClass70_0;
    // Nested type: ::GlobalNamespace::GameServerLobbyFlowCoordinator::$$c__DisplayClass70_1
    class $$c__DisplayClass70_1;
    // Nested type: ::GlobalNamespace::GameServerLobbyFlowCoordinator::$$c__DisplayClass85_0
    class $$c__DisplayClass85_0;
    public:
    // private HMUI.ScreenModeSO _screenMode
    // Size: 0x8
    // Offset: 0xA8
    ::HMUI::ScreenModeSO* screenMode;
    // Field size check
    static_assert(sizeof(::HMUI::ScreenModeSO*) == 0x8);
    // private UnityEngine.AudioClip _ambienceAudioClip
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::AudioClip* ambienceAudioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // [InjectAttribute] Offset: 0x112D198
    // private readonly ServerPlayerListViewController _serverPlayerListViewController
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::ServerPlayerListViewController* serverPlayerListViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ServerPlayerListViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D1A8
    // private readonly SelectModifiersViewController _selectModifiersViewController
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::SelectModifiersViewController* selectModifiersViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SelectModifiersViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D1B8
    // private readonly MultiplayerLevelSelectionFlowCoordinator _multiplayerLevelSelectionFlowCoordinator
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::MultiplayerLevelSelectionFlowCoordinator* multiplayerLevelSelectionFlowCoordinator;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerLevelSelectionFlowCoordinator*) == 0x8);
    // [InjectAttribute] Offset: 0x112D1C8
    // private readonly MultiplayerResultsViewController _multiplayerResultsViewController
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::MultiplayerResultsViewController* multiplayerResultsViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerResultsViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D1D8
    // private readonly SimpleDialogPromptViewController _simpleDialogPromptViewController
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::SimpleDialogPromptViewController* simpleDialogPromptViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SimpleDialogPromptViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D1E8
    // private readonly ConnectionErrorDialogViewController _connectionErrorDialogViewController
    // Size: 0x8
    // Offset: 0xE0
    ::GlobalNamespace::ConnectionErrorDialogViewController* connectionErrorDialogViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ConnectionErrorDialogViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D1F8
    // private readonly MultiplayerSettingsPanelController _multiplayerSettingsPanelController
    // Size: 0x8
    // Offset: 0xE8
    ::GlobalNamespace::MultiplayerSettingsPanelController* multiplayerSettingsPanelController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerSettingsPanelController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D208
    // private readonly GameplaySetupViewController _gameplaySetupViewController
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::GameplaySetupViewController* gameplaySetupViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameplaySetupViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D218
    // private readonly MultiplayerLobbyController _multiplayerLobbyController
    // Size: 0x8
    // Offset: 0xF8
    ::GlobalNamespace::MultiplayerLobbyController* multiplayerLobbyController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerLobbyController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D228
    // private readonly FadeInOutController _fadeInOutController
    // Size: 0x8
    // Offset: 0x100
    ::GlobalNamespace::FadeInOutController* fadeInOutController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FadeInOutController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D238
    // private readonly CenterStageScreenController _centerStageScreenController
    // Size: 0x8
    // Offset: 0x108
    ::GlobalNamespace::CenterStageScreenController* centerStageScreenController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::CenterStageScreenController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D248
    // private readonly ILobbyStateDataModel _lobbyStateDataModel
    // Size: 0x8
    // Offset: 0x110
    ::GlobalNamespace::ILobbyStateDataModel* lobbyStateDataModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ILobbyStateDataModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112D258
    // private readonly LobbyGameStateModel _lobbyGameStateModel
    // Size: 0x8
    // Offset: 0x118
    ::GlobalNamespace::LobbyGameStateModel* lobbyGameStateModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LobbyGameStateModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112D268
    // private readonly ILobbyPlayersDataModel _lobbyPlayersDataModel
    // Size: 0x8
    // Offset: 0x120
    ::GlobalNamespace::ILobbyPlayersDataModel* lobbyPlayersDataModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ILobbyPlayersDataModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112D278
    // private readonly ILobbyGameStateController _lobbyGameStateController
    // Size: 0x8
    // Offset: 0x128
    ::GlobalNamespace::ILobbyGameStateController* lobbyGameStateController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ILobbyGameStateController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D288
    // private readonly LobbyPlayerPermissionsModel _lobbyPlayerPermissionsModel
    // Size: 0x8
    // Offset: 0x130
    ::GlobalNamespace::LobbyPlayerPermissionsModel* lobbyPlayerPermissionsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LobbyPlayerPermissionsModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112D298
    // private readonly LobbySetupViewController _lobbySetupViewController
    // Size: 0x8
    // Offset: 0x138
    ::GlobalNamespace::LobbySetupViewController* lobbySetupViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LobbySetupViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D2A8
    // private readonly IUnifiedNetworkPlayerModel _unifiedNetworkPlayerModel
    // Size: 0x8
    // Offset: 0x140
    ::GlobalNamespace::IUnifiedNetworkPlayerModel* unifiedNetworkPlayerModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IUnifiedNetworkPlayerModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112D2B8
    // private readonly HMUI.ScreenModeController _screenModeController
    // Size: 0x8
    // Offset: 0x148
    ::HMUI::ScreenModeController* screenModeController;
    // Field size check
    static_assert(sizeof(::HMUI::ScreenModeController*) == 0x8);
    // [InjectAttribute] Offset: 0x112D2C8
    // private readonly PlayerDataModel _playerDataModel
    // Size: 0x8
    // Offset: 0x150
    ::GlobalNamespace::PlayerDataModel* playerDataModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerDataModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112D2D8
    // private readonly PlatformLeaderboardsModel _platformLeaderboardsModel
    // Size: 0x8
    // Offset: 0x158
    ::GlobalNamespace::PlatformLeaderboardsModel* platformLeaderboardsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlatformLeaderboardsModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112D2E8
    // private readonly SongPreviewPlayer _songPreviewPlayer
    // Size: 0x8
    // Offset: 0x160
    ::GlobalNamespace::SongPreviewPlayer* songPreviewPlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SongPreviewPlayer*) == 0x8);
    // [InjectAttribute] Offset: 0x112D2F8
    // private readonly IAnalyticsModel _analyticsModel
    // Size: 0x8
    // Offset: 0x168
    ::GlobalNamespace::IAnalyticsModel* analyticsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IAnalyticsModel*) == 0x8);
    // private LevelSelectionFlowCoordinator/State _lastSimpleLevelSelectionFlowCoordinatorState
    // Size: 0x8
    // Offset: 0x170
    ::GlobalNamespace::LevelSelectionFlowCoordinator::State* lastSimpleLevelSelectionFlowCoordinatorState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LevelSelectionFlowCoordinator::State*) == 0x8);
    // private System.Boolean _isAlreadyFinishing
    // Size: 0x1
    // Offset: 0x178
    bool isAlreadyFinishing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isAlreadyFinishing and: stringBuilder
    char __padding26[0x7] = {};
    // private readonly System.Text.StringBuilder _stringBuilder
    // Size: 0x8
    // Offset: 0x180
    ::System::Text::StringBuilder* stringBuilder;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Threading.CancellationTokenSource _canStartGameCts
    // Size: 0x8
    // Offset: 0x188
    ::System::Threading::CancellationTokenSource* canStartGameCts;
    // Field size check
    static_assert(sizeof(::System::Threading::CancellationTokenSource*) == 0x8);
    // private System.Action willFinishEvent
    // Size: 0x8
    // Offset: 0x190
    ::System::Action* willFinishEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action didFinishEvent
    // Size: 0x8
    // Offset: 0x198
    ::System::Action* didFinishEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action startGameOrReadyEvent
    // Size: 0x8
    // Offset: 0x1A0
    ::System::Action* startGameOrReadyEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action didSetupEvent
    // Size: 0x8
    // Offset: 0x1A8
    ::System::Action* didSetupEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action didOpenInvitePanelEvent
    // Size: 0x8
    // Offset: 0x1B0
    ::System::Action* didOpenInvitePanelEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Boolean <rejoinQuickPlay>k__BackingField
    // Size: 0x1
    // Offset: 0x1B8
    bool rejoinQuickPlay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // [LocalizationKeyAttribute] Offset: 0x112D168
    // static field const value: static private System.String kPlayersMissingEntitlementKey
    static constexpr const char* kPlayersMissingEntitlementKey = "LABEL_PLAYERS_MISSING_ENTITLEMENT";
    // Get static field: static private System.String kPlayersMissingEntitlementKey
    static ::StringW _get_kPlayersMissingEntitlementKey();
    // Set static field: static private System.String kPlayersMissingEntitlementKey
    static void _set_kPlayersMissingEntitlementKey(::StringW value);
    // static field const value: static private System.Single kMaxPredictedStartTimeDifference
    static constexpr const float kMaxPredictedStartTimeDifference = 1.5;
    // Get static field: static private System.Single kMaxPredictedStartTimeDifference
    static float _get_kMaxPredictedStartTimeDifference();
