// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: IGamePause
#include "GlobalNamespace/IGamePause.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameEnergyCounter
  class GameEnergyCounter;
  // Forward declaring type: ScoreController
  class ScoreController;
  // Forward declaring type: BeatmapObjectExecutionRatingsRecorder
  class BeatmapObjectExecutionRatingsRecorder;
  // Forward declaring type: SongController
  class SongController;
  // Forward declaring type: NoteCutSoundEffectManager
  class NoteCutSoundEffectManager;
  // Forward declaring type: SaberManager
  class SaberManager;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x59
  // Autogenerated type: GamePause
  // [] Offset: FFFFFFFF
  class GamePause : public ::Il2CppObject/*, public GlobalNamespace::IGamePause*/ {
    public:
    // [CompilerGeneratedAttribute] Offset: 0xDC7E00
    // private System.Action didPauseEvent
    // Size: 0x8
    // Offset: 0x10
    System::Action* didPauseEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDC7E10
    // private System.Action willResumeEvent
    // Size: 0x8
    // Offset: 0x18
    System::Action* willResumeEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDC7E20
    // private System.Action didResumeEvent
    // Size: 0x8
    // Offset: 0x20
    System::Action* didResumeEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [InjectAttribute] Offset: 0xDC7E30
    // private GameEnergyCounter _gameEnergyCounter
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::GameEnergyCounter* gameEnergyCounter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameEnergyCounter*) == 0x8);
    // [InjectAttribute] Offset: 0xDC7E40
    // private ScoreController _scoreController
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::ScoreController* scoreController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ScoreController*) == 0x8);
    // [InjectAttribute] Offset: 0xDC7E50
    // private BeatmapObjectExecutionRatingsRecorder _beatmapObjectExecutionRatingsRecorder
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::BeatmapObjectExecutionRatingsRecorder* beatmapObjectExecutionRatingsRecorder;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapObjectExecutionRatingsRecorder*) == 0x8);
    // [InjectAttribute] Offset: 0xDC7E60
    // private SongController _songController
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::SongController* songController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SongController*) == 0x8);
    // [InjectAttribute] Offset: 0xDC7E70
    // private NoteCutSoundEffectManager _noteCutSoundEffectManager
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::NoteCutSoundEffectManager* noteCutSoundEffectManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NoteCutSoundEffectManager*) == 0x8);
    // [InjectAttribute] Offset: 0xDC7E80
    // private SaberManager saberManager
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::SaberManager* saberManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SaberManager*) == 0x8);
    // private System.Boolean _pause
    // Size: 0x1
    // Offset: 0x58
    bool pause;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: GamePause
    GamePause(System::Action* didPauseEvent_ = {}, System::Action* willResumeEvent_ = {}, System::Action* didResumeEvent_ = {}, GlobalNamespace::GameEnergyCounter* gameEnergyCounter_ = {}, GlobalNamespace::ScoreController* scoreController_ = {}, GlobalNamespace::BeatmapObjectExecutionRatingsRecorder* beatmapObjectExecutionRatingsRecorder_ = {}, GlobalNamespace::SongController* songController_ = {}, GlobalNamespace::NoteCutSoundEffectManager* noteCutSoundEffectManager_ = {}, GlobalNamespace::SaberManager* saberManager_ = {}, bool pause_ = {}) noexcept : didPauseEvent{didPauseEvent_}, willResumeEvent{willResumeEvent_}, didResumeEvent{didResumeEvent_}, gameEnergyCounter{gameEnergyCounter_}, scoreController{scoreController_}, beatmapObjectExecutionRatingsRecorder{beatmapObjectExecutionRatingsRecorder_}, songController{songController_}, noteCutSoundEffectManager{noteCutSoundEffectManager_}, saberManager{saberManager_}, pause{pause_} {}
    // Creating interface conversion operator: operator GlobalNamespace::IGamePause
    operator GlobalNamespace::IGamePause() noexcept {
      return *reinterpret_cast<GlobalNamespace::IGamePause*>(this);
    }
    // public System.Void add_didPauseEvent(System.Action value)
    // Offset: 0x1A1A30C
    // Implemented from: IGamePause
    // Base method: System.Void IGamePause::add_didPauseEvent(System.Action value)
    void add_didPauseEvent(System::Action* value);
    // public System.Void remove_didPauseEvent(System.Action value)
    // Offset: 0x1A1A3B0
    // Implemented from: IGamePause
    // Base method: System.Void IGamePause::remove_didPauseEvent(System.Action value)
    void remove_didPauseEvent(System::Action* value);
    // public System.Void add_willResumeEvent(System.Action value)
    // Offset: 0x1A1A454
    // Implemented from: IGamePause
    // Base method: System.Void IGamePause::add_willResumeEvent(System.Action value)
    void add_willResumeEvent(System::Action* value);
    // public System.Void remove_willResumeEvent(System.Action value)
    // Offset: 0x1A1A4F8
    // Implemented from: IGamePause
    // Base method: System.Void IGamePause::remove_willResumeEvent(System.Action value)
    void remove_willResumeEvent(System::Action* value);
    // public System.Void add_didResumeEvent(System.Action value)
    // Offset: 0x1A1A59C
    // Implemented from: IGamePause
    // Base method: System.Void IGamePause::add_didResumeEvent(System.Action value)
    void add_didResumeEvent(System::Action* value);
    // public System.Void remove_didResumeEvent(System.Action value)
    // Offset: 0x1A1A640
    // Implemented from: IGamePause
    // Base method: System.Void IGamePause::remove_didResumeEvent(System.Action value)
    void remove_didResumeEvent(System::Action* value);
    // public System.Void Pause()
    // Offset: 0x1A1A6E4
    // Implemented from: IGamePause
    // Base method: System.Void IGamePause::Pause()
    void Pause();
    // public System.Void WillResume()
    // Offset: 0x1A1A7A0
    // Implemented from: IGamePause
    // Base method: System.Void IGamePause::WillResume()
    void WillResume();
    // public System.Void Resume()
    // Offset: 0x1A1A7BC
    // Implemented from: IGamePause
    // Base method: System.Void IGamePause::Resume()
    void Resume();
    // public System.Void .ctor()
    // Offset: 0x1A1A874
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GamePause* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::GamePause::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GamePause*, creationType>()));
    }
  }; // GamePause
  static check_size<sizeof(GamePause), 88 + sizeof(bool)> __GlobalNamespace_GamePauseSizeCheck;
  static_assert(sizeof(GamePause) == 0x59);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::GamePause*, "", "GamePause");
#pragma pack(pop)
