// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: TableCellWithSeparator
#include "GlobalNamespace/TableCellWithSeparator.hpp"
// Including type: AdditionalContentModel/EntitlementStatus
#include "GlobalNamespace/AdditionalContentModel.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameplayModifierInfoListItemsList
  class GameplayModifierInfoListItemsList;
  // Forward declaring type: GameplayModifiersModelSO
  class GameplayModifiersModelSO;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: ILobbyPlayerDataModel
  class ILobbyPlayerDataModel;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: CurvedTextMeshPro
  class CurvedTextMeshPro;
  // Forward declaring type: ImageView
  class ImageView;
  // Forward declaring type: HoverHint
  class HoverHint;
  // Forward declaring type: ButtonBinder
  class ButtonBinder;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: GameServerPlayerTableCell
  class GameServerPlayerTableCell : public GlobalNamespace::TableCellWithSeparator {
    public:
    // Nested type: GlobalNamespace::GameServerPlayerTableCell::$$c__DisplayClass26_0
    class $$c__DisplayClass26_0;
    // Nested type: GlobalNamespace::GameServerPlayerTableCell::$SetBeatmapUseButtonEnabledAsync$d__32
    struct $SetBeatmapUseButtonEnabledAsync$d__32;
    // private HMUI.CurvedTextMeshPro _playerNameText
    // Offset: 0x58
    HMUI::CurvedTextMeshPro* playerNameText;
    // private UnityEngine.UI.Image _localPlayerBackgroundImage
    // Offset: 0x60
    UnityEngine::UI::Image* localPlayerBackgroundImage;
    // private HMUI.CurvedTextMeshPro _suggestedLevelText
    // Offset: 0x68
    HMUI::CurvedTextMeshPro* suggestedLevelText;
    // private HMUI.ImageView _suggestedCharacteristicIcon
    // Offset: 0x70
    HMUI::ImageView* suggestedCharacteristicIcon;
    // private TMPro.TextMeshProUGUI _suggestedDifficultyText
    // Offset: 0x78
    TMPro::TextMeshProUGUI* suggestedDifficultyText;
    // private HMUI.CurvedTextMeshPro _emptySuggestedLevelText
    // Offset: 0x80
    HMUI::CurvedTextMeshPro* emptySuggestedLevelText;
    // private GameplayModifierInfoListItemsList _suggestedModifiersList
    // Offset: 0x88
    GlobalNamespace::GameplayModifierInfoListItemsList* suggestedModifiersList;
    // private HMUI.CurvedTextMeshPro _emptySuggestedModifiersText
    // Offset: 0x90
    HMUI::CurvedTextMeshPro* emptySuggestedModifiersText;
    // private UnityEngine.UI.Button _kickPlayerButton
    // Offset: 0x98
    UnityEngine::UI::Button* kickPlayerButton;
    // private UnityEngine.UI.Button _useBeatmapButton
    // Offset: 0xA0
    UnityEngine::UI::Button* useBeatmapButton;
    // private UnityEngine.UI.Button _useModifiersButton
    // Offset: 0xA8
    UnityEngine::UI::Button* useModifiersButton;
    // private HMUI.HoverHint _useBeatmapButtonHoverHint
    // Offset: 0xB0
    HMUI::HoverHint* useBeatmapButtonHoverHint;
    // private HMUI.ImageView _statusImageView
    // Offset: 0xB8
    HMUI::ImageView* statusImageView;
    // private UnityEngine.Sprite _readyIcon
    // Offset: 0xC0
    UnityEngine::Sprite* readyIcon;
    // private UnityEngine.Sprite _spectatingIcon
    // Offset: 0xC8
    UnityEngine::Sprite* spectatingIcon;
    // private GameplayModifiersModelSO _gameplayModifiers
    // Offset: 0xD0
    GlobalNamespace::GameplayModifiersModelSO* gameplayModifiers;
    // private System.Action`1<System.Int32> kickPlayerEvent
    // Offset: 0xD8
    System::Action_1<int>* kickPlayerEvent;
    // private System.Action`1<System.Int32> useBeatmapEvent
    // Offset: 0xE0
    System::Action_1<int>* useBeatmapEvent;
    // private System.Action`1<System.Int32> useModifiersEvent
    // Offset: 0xE8
    System::Action_1<int>* useModifiersEvent;
    // private readonly HMUI.ButtonBinder _buttonBinder
    // Offset: 0xF0
    HMUI::ButtonBinder* buttonBinder;
    // private System.Threading.CancellationTokenSource _getLevelEntitlementCancellationTokenSource
    // Offset: 0xF8
    System::Threading::CancellationTokenSource* getLevelEntitlementCancellationTokenSource;
    // public System.Void add_kickPlayerEvent(System.Action`1<System.Int32> value)
    // Offset: 0x1A1C6D8
    void add_kickPlayerEvent(System::Action_1<int>* value);
    // public System.Void remove_kickPlayerEvent(System.Action`1<System.Int32> value)
    // Offset: 0x1A1C77C
    void remove_kickPlayerEvent(System::Action_1<int>* value);
    // public System.Void add_useBeatmapEvent(System.Action`1<System.Int32> value)
    // Offset: 0x1A1C820
    void add_useBeatmapEvent(System::Action_1<int>* value);
    // public System.Void remove_useBeatmapEvent(System.Action`1<System.Int32> value)
    // Offset: 0x1A1C8C4
    void remove_useBeatmapEvent(System::Action_1<int>* value);
    // public System.Void add_useModifiersEvent(System.Action`1<System.Int32> value)
    // Offset: 0x1A1C968
    void add_useModifiersEvent(System::Action_1<int>* value);
    // public System.Void remove_useModifiersEvent(System.Action`1<System.Int32> value)
    // Offset: 0x1A1CA0C
    void remove_useModifiersEvent(System::Action_1<int>* value);
    // public System.Void SetData(IConnectedPlayer connectedPlayer, ILobbyPlayerDataModel playerDataModel, System.Boolean isHost, System.Threading.Tasks.Task`1<AdditionalContentModel/EntitlementStatus> getLevelEntitlementTask)
    // Offset: 0x1A1CAB0
    void SetData(GlobalNamespace::IConnectedPlayer* connectedPlayer, GlobalNamespace::ILobbyPlayerDataModel* playerDataModel, bool isHost, System::Threading::Tasks::Task_1<GlobalNamespace::AdditionalContentModel::EntitlementStatus>* getLevelEntitlementTask);
    // protected System.Void Awake()
    // Offset: 0x1A1D5E4
    void Awake();
    // private System.Void HandleKickPlayerButtonPressed()
    // Offset: 0x1A1D708
    void HandleKickPlayerButtonPressed();
    // private System.Void HandleUseBeatmapButtonPressed()
    // Offset: 0x1A1D76C
    void HandleUseBeatmapButtonPressed();
    // private System.Void HandleUseModifiersButtonPressed()
    // Offset: 0x1A1D7D0
    void HandleUseModifiersButtonPressed();
    // private System.Void SetBeatmapUseButtonEnabledAsync(System.Threading.Tasks.Task`1<AdditionalContentModel/EntitlementStatus> getLevelEntitlementTask)
    // Offset: 0x1A1D4F8
    void SetBeatmapUseButtonEnabledAsync(System::Threading::Tasks::Task_1<GlobalNamespace::AdditionalContentModel::EntitlementStatus>* getLevelEntitlementTask);
    // public System.Void .ctor()
    // Offset: 0x1A1D834
    // Implemented from: TableCellWithSeparator
    // Base method: System.Void TableCellWithSeparator::.ctor()
    // Base method: System.Void TableCell::.ctor()
    // Base method: System.Void SelectableCell::.ctor()
    // Base method: System.Void Interactable::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static GameServerPlayerTableCell* New_ctor();
  }; // GameServerPlayerTableCell
  check_size<sizeof(GameServerPlayerTableCell), 248 + sizeof(void*) + ((248 + sizeof(void*)) % 8 != 0 ? (8 - (248 + sizeof(void*)) % 8) : 0)> __GlobalNamespace_GameServerPlayerTableCellSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::GameServerPlayerTableCell*, "", "GameServerPlayerTableCell");
#pragma pack(pop)
