// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PersistentScriptableObject
#include "GlobalNamespace/PersistentScriptableObject.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameplayModifierParamsSO
  class GameplayModifierParamsSO;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: GameplayModifiersModelSO
  class GameplayModifiersModelSO : public GlobalNamespace::PersistentScriptableObject {
    public:
    // private GameplayModifierParamsSO _batteryEnergy
    // Offset: 0x18
    GlobalNamespace::GameplayModifierParamsSO* batteryEnergy;
    // private GameplayModifierParamsSO _noFail
    // Offset: 0x20
    GlobalNamespace::GameplayModifierParamsSO* noFail;
    // private GameplayModifierParamsSO _instaFail
    // Offset: 0x28
    GlobalNamespace::GameplayModifierParamsSO* instaFail;
    // private GameplayModifierParamsSO _noObstacles
    // Offset: 0x30
    GlobalNamespace::GameplayModifierParamsSO* noObstacles;
    // private GameplayModifierParamsSO _noBombs
    // Offset: 0x38
    GlobalNamespace::GameplayModifierParamsSO* noBombs;
    // private GameplayModifierParamsSO _fastNotes
    // Offset: 0x40
    GlobalNamespace::GameplayModifierParamsSO* fastNotes;
    // private GameplayModifierParamsSO _strictAngles
    // Offset: 0x48
    GlobalNamespace::GameplayModifierParamsSO* strictAngles;
    // private GameplayModifierParamsSO _disappearingArrows
    // Offset: 0x50
    GlobalNamespace::GameplayModifierParamsSO* disappearingArrows;
    // private GameplayModifierParamsSO _fasterSong
    // Offset: 0x58
    GlobalNamespace::GameplayModifierParamsSO* fasterSong;
    // private GameplayModifierParamsSO _slowerSong
    // Offset: 0x60
    GlobalNamespace::GameplayModifierParamsSO* slowerSong;
    // private GameplayModifierParamsSO _noArrows
    // Offset: 0x68
    GlobalNamespace::GameplayModifierParamsSO* noArrows;
    // private GameplayModifierParamsSO _ghostNotes
    // Offset: 0x70
    GlobalNamespace::GameplayModifierParamsSO* ghostNotes;
    // private GameplayModifierParamsSO _demoNoObstacles
    // Offset: 0x78
    GlobalNamespace::GameplayModifierParamsSO* demoNoObstacles;
    // private GameplayModifierParamsSO _demoNoFail
    // Offset: 0x80
    GlobalNamespace::GameplayModifierParamsSO* demoNoFail;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Boolean GetModifierBoolValue(GameplayModifiers gameplayModifiers, GameplayModifierParamsSO gameplayModifierParams)
    // Offset: 0xB3FAD4
    bool GetModifierBoolValue(GlobalNamespace::GameplayModifiers* gameplayModifiers, GlobalNamespace::GameplayModifierParamsSO* gameplayModifierParams);
    // public System.Void SetModifierBoolValue(GameplayModifiers gameplayModifiers, GameplayModifierParamsSO gameplayModifierParams, System.Boolean value)
    // Offset: 0xB3FE98
    void SetModifierBoolValue(GlobalNamespace::GameplayModifiers* gameplayModifiers, GlobalNamespace::GameplayModifierParamsSO* gameplayModifierParams, bool value);
    // public System.Collections.Generic.List`1<GameplayModifierParamsSO> GetModifierParams(GameplayModifiers gameplayModifiers)
    // Offset: 0xB40340
    System::Collections::Generic::List_1<GlobalNamespace::GameplayModifierParamsSO*>* GetModifierParams(GlobalNamespace::GameplayModifiers* gameplayModifiers);
    // public System.Single GetTotalMultiplier(GameplayModifiers gameplayModifiers)
    // Offset: 0xB405C4
    float GetTotalMultiplier(GlobalNamespace::GameplayModifiers* gameplayModifiers);
    // public System.Int32 MaxModifiedScoreForMaxRawScore(System.Int32 maxRawScore, GameplayModifiers gameplayModifiers)
    // Offset: 0xB406E0
    int MaxModifiedScoreForMaxRawScore(int maxRawScore, GlobalNamespace::GameplayModifiers* gameplayModifiers);
    // public System.Int32 MaxModifiedScoreForMaxRawScore(System.Int32 maxRawScore, GameplayModifiers gameplayModifiers, GameplayModifiersModelSO gameplayModifiersModel)
    // Offset: 0xB40738
    int MaxModifiedScoreForMaxRawScore(int maxRawScore, GlobalNamespace::GameplayModifiers* gameplayModifiers, GlobalNamespace::GameplayModifiersModelSO* gameplayModifiersModel);
    // private System.Int32 GetModifiedScoreForGameplayModifiers(System.Int32 rawScore, GameplayModifiers gameplayModifiers)
    // Offset: 0xB4070C
    int GetModifiedScoreForGameplayModifiers(int rawScore, GlobalNamespace::GameplayModifiers* gameplayModifiers);
    // public System.Void .ctor()
    // Offset: 0xB40764
    // Implemented from: PersistentScriptableObject
    // Base method: System.Void PersistentScriptableObject::.ctor()
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static GameplayModifiersModelSO* New_ctor();
  }; // GameplayModifiersModelSO
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::GameplayModifiersModelSO*, "", "GameplayModifiersModelSO");
#pragma pack(pop)
