// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IGameEnergyCounter
#include "GlobalNamespace/IGameEnergyCounter.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SaberClashChecker
  class SaberClashChecker;
  // Forward declaring type: BeatmapObjectManager
  class BeatmapObjectManager;
  // Forward declaring type: PlayerHeadAndObstacleInteraction
  class PlayerHeadAndObstacleInteraction;
  // Forward declaring type: NoteController
  class NoteController;
  // Forward declaring type: NoteCutInfo
  struct NoteCutInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x7C
  #pragma pack(push, 1)
  // Autogenerated type: GameEnergyCounter
  // [] Offset: FFFFFFFF
  class GameEnergyCounter : public UnityEngine::MonoBehaviour/*, public GlobalNamespace::IGameEnergyCounter*/ {
    public:
    // Nested type: GlobalNamespace::GameEnergyCounter::InitData
    class InitData;
    // private System.Single _badNoteEnergyDrain
    // Size: 0x4
    // Offset: 0x18
    float badNoteEnergyDrain;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _missNoteEnergyDrain
    // Size: 0x4
    // Offset: 0x1C
    float missNoteEnergyDrain;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _hitBombEnergyDrain
    // Size: 0x4
    // Offset: 0x20
    float hitBombEnergyDrain;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _goodNoteEnergyCharge
    // Size: 0x4
    // Offset: 0x24
    float goodNoteEnergyCharge;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _obstacleEnergyDrainPerSecond
    // Size: 0x4
    // Offset: 0x28
    float obstacleEnergyDrainPerSecond;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 _batteryLives
    // Size: 0x4
    // Offset: 0x2C
    int batteryLives;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [InjectAttribute] Offset: 0xD29088
    // private readonly GameEnergyCounter/InitData _initData
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::GameEnergyCounter::InitData* initData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameEnergyCounter::InitData*) == 0x8);
    // [InjectAttribute] Offset: 0xD29098
    // private readonly SaberClashChecker _saberClashChecker
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::SaberClashChecker* saberClashChecker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SaberClashChecker*) == 0x8);
    // [InjectAttribute] Offset: 0xD290A8
    // private readonly BeatmapObjectManager _beatmapObjectManager
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::BeatmapObjectManager* beatmapObjectManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapObjectManager*) == 0x8);
    // [InjectAttribute] Offset: 0xD290B8
    // private readonly PlayerHeadAndObstacleInteraction _playerHeadAndObstacleInteraction
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::PlayerHeadAndObstacleInteraction* playerHeadAndObstacleInteraction;
    // Field size check
    static_assert(sizeof(GlobalNamespace::PlayerHeadAndObstacleInteraction*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD290C8
    // private System.Action didInitEvent
    // Size: 0x8
    // Offset: 0x50
    System::Action* didInitEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD290D8
    // private System.Action gameEnergyDidReach0Event
    // Size: 0x8
    // Offset: 0x58
    System::Action* gameEnergyDidReach0Event;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD290E8
    // private System.Action`1<System.Single> gameEnergyDidChangeEvent
    // Size: 0x8
    // Offset: 0x60
    System::Action_1<float>* gameEnergyDidChangeEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD290F8
    // private System.Single <energy>k__BackingField
    // Size: 0x4
    // Offset: 0x68
    float energy;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xD29108
    // private GameplayModifiers/EnergyType <energyType>k__BackingField
    // Size: 0x4
    // Offset: 0x6C
    GlobalNamespace::GameplayModifiers::EnergyType energyType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameplayModifiers::EnergyType) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xD29118
    // private System.Boolean <noFail>k__BackingField
    // Size: 0x1
    // Offset: 0x70
    bool noFail;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xD29128
    // private System.Boolean <instaFail>k__BackingField
    // Size: 0x1
    // Offset: 0x71
    bool instaFail;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xD29138
    // private System.Boolean <failOnSaberClash>k__BackingField
    // Size: 0x1
    // Offset: 0x72
    bool failOnSaberClash;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isInitialized
    // Size: 0x1
    // Offset: 0x73
    bool isInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _didReach0Energy
    // Size: 0x1
    // Offset: 0x74
    bool didReach0Energy;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: didReach0Energy and: nextFrameEnergyChange
    char __padding19[0x3] = {};
    // private System.Single _nextFrameEnergyChange
    // Size: 0x4
    // Offset: 0x78
    float nextFrameEnergyChange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: GameEnergyCounter
    GameEnergyCounter(float badNoteEnergyDrain_ = {}, float missNoteEnergyDrain_ = {}, float hitBombEnergyDrain_ = {}, float goodNoteEnergyCharge_ = {}, float obstacleEnergyDrainPerSecond_ = {}, int batteryLives_ = {}, GlobalNamespace::GameEnergyCounter::InitData* initData_ = {}, GlobalNamespace::SaberClashChecker* saberClashChecker_ = {}, GlobalNamespace::BeatmapObjectManager* beatmapObjectManager_ = {}, GlobalNamespace::PlayerHeadAndObstacleInteraction* playerHeadAndObstacleInteraction_ = {}, System::Action* didInitEvent_ = {}, System::Action* gameEnergyDidReach0Event_ = {}, System::Action_1<float>* gameEnergyDidChangeEvent_ = {}, float energy_ = {}, GlobalNamespace::GameplayModifiers::EnergyType energyType_ = {}, bool noFail_ = {}, bool instaFail_ = {}, bool failOnSaberClash_ = {}, bool isInitialized_ = {}, bool didReach0Energy_ = {}, float nextFrameEnergyChange_ = {}) noexcept : badNoteEnergyDrain{badNoteEnergyDrain_}, missNoteEnergyDrain{missNoteEnergyDrain_}, hitBombEnergyDrain{hitBombEnergyDrain_}, goodNoteEnergyCharge{goodNoteEnergyCharge_}, obstacleEnergyDrainPerSecond{obstacleEnergyDrainPerSecond_}, batteryLives{batteryLives_}, initData{initData_}, saberClashChecker{saberClashChecker_}, beatmapObjectManager{beatmapObjectManager_}, playerHeadAndObstacleInteraction{playerHeadAndObstacleInteraction_}, didInitEvent{didInitEvent_}, gameEnergyDidReach0Event{gameEnergyDidReach0Event_}, gameEnergyDidChangeEvent{gameEnergyDidChangeEvent_}, energy{energy_}, energyType{energyType_}, noFail{noFail_}, instaFail{instaFail_}, failOnSaberClash{failOnSaberClash_}, isInitialized{isInitialized_}, didReach0Energy{didReach0Energy_}, nextFrameEnergyChange{nextFrameEnergyChange_} {}
    // Creating interface conversion operator: operator GlobalNamespace::IGameEnergyCounter
    operator GlobalNamespace::IGameEnergyCounter() noexcept {
      return *reinterpret_cast<GlobalNamespace::IGameEnergyCounter*>(this);
    }
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_didInitEvent(System.Action value)
    // Offset: 0xF1FBC4
    void add_didInitEvent(System::Action* value);
    // public System.Void remove_didInitEvent(System.Action value)
    // Offset: 0xF1FC68
    void remove_didInitEvent(System::Action* value);
    // public System.Void add_gameEnergyDidReach0Event(System.Action value)
    // Offset: 0xF1FD0C
    void add_gameEnergyDidReach0Event(System::Action* value);
    // public System.Void remove_gameEnergyDidReach0Event(System.Action value)
    // Offset: 0xF1FDB0
    void remove_gameEnergyDidReach0Event(System::Action* value);
    // public System.Void add_gameEnergyDidChangeEvent(System.Action`1<System.Single> value)
    // Offset: 0xF1FE54
    void add_gameEnergyDidChangeEvent(System::Action_1<float>* value);
    // public System.Void remove_gameEnergyDidChangeEvent(System.Action`1<System.Single> value)
    // Offset: 0xF1FEF8
    void remove_gameEnergyDidChangeEvent(System::Action_1<float>* value);
    // public System.Boolean get_isInitialized()
    // Offset: 0xF1FF9C
    bool get_isInitialized();
    // public System.Single get_energy()
    // Offset: 0xF1FFA4
    float get_energy();
    // private System.Void set_energy(System.Single value)
    // Offset: 0xF1FFAC
    void set_energy(float value);
    // public System.Int32 get_batteryEnergy()
    // Offset: 0xF1FFB4
    int get_batteryEnergy();
    // public System.Int32 get_batteryLives()
    // Offset: 0xF20038
    int get_batteryLives();
    // public GameplayModifiers/EnergyType get_energyType()
    // Offset: 0xF20040
    GlobalNamespace::GameplayModifiers::EnergyType get_energyType();
    // private System.Void set_energyType(GameplayModifiers/EnergyType value)
    // Offset: 0xF20048
    void set_energyType(GlobalNamespace::GameplayModifiers::EnergyType value);
    // public System.Boolean get_noFail()
    // Offset: 0xF20050
    bool get_noFail();
    // private System.Void set_noFail(System.Boolean value)
    // Offset: 0xF20058
    void set_noFail(bool value);
    // public System.Boolean get_instaFail()
    // Offset: 0xF20064
    bool get_instaFail();
    // private System.Void set_instaFail(System.Boolean value)
    // Offset: 0xF2006C
    void set_instaFail(bool value);
    // public System.Boolean get_failOnSaberClash()
    // Offset: 0xF20078
    bool get_failOnSaberClash();
    // private System.Void set_failOnSaberClash(System.Boolean value)
    // Offset: 0xF20080
    void set_failOnSaberClash(bool value);
    // protected System.Void Start()
    // Offset: 0xF2008C
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0xF201FC
    void OnDestroy();
    // protected System.Void LateUpdate()
    // Offset: 0xF202E4
    void LateUpdate();
    // private System.Void HandleNoteWasCut(NoteController noteController, in NoteCutInfo noteCutInfo)
    // Offset: 0xF20524
    void HandleNoteWasCut(GlobalNamespace::NoteController* noteController, GlobalNamespace::NoteCutInfo& noteCutInfo);
    // private System.Void HandleNoteWasMissed(NoteController noteController)
    // Offset: 0xF2059C
    void HandleNoteWasMissed(GlobalNamespace::NoteController* noteController);
    // private System.Void ProcessEnergyChange(System.Single energyChange)
    // Offset: 0xF203F0
    void ProcessEnergyChange(float energyChange);
    // public System.Void .ctor()
    // Offset: 0xF205D8
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GameEnergyCounter* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::GameEnergyCounter::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GameEnergyCounter*, creationType>()));
    }
  }; // GameEnergyCounter
  #pragma pack(pop)
  static check_size<sizeof(GameEnergyCounter), 120 + sizeof(float)> __GlobalNamespace_GameEnergyCounterSizeCheck;
  static_assert(sizeof(GameEnergyCounter) == 0x7C);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::GameEnergyCounter*, "", "GameEnergyCounter");
