// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IRefreshable
#include "GlobalNamespace/IRefreshable.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameplayModifiersModelSO
  class GameplayModifiersModelSO;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: GameplayModifierToggle
  class GameplayModifierToggle;
  // Forward declaring type: GameplayModifierParamsSO
  class GameplayModifierParamsSO;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ToggleBinder
  class ToggleBinder;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Toggle
  class Toggle;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: GameplayModifiersPanelController
  class GameplayModifiersPanelController : public UnityEngine::MonoBehaviour, public GlobalNamespace::IRefreshable {
    public:
    // Nested type: GlobalNamespace::GameplayModifiersPanelController::$$c__DisplayClass14_0
    class $$c__DisplayClass14_0;
    // private GameplayModifiersModelSO _gameplayModifiersModel
    // Offset: 0x18
    GlobalNamespace::GameplayModifiersModelSO* gameplayModifiersModel;
    // private TMPro.TextMeshProUGUI _totalMultiplierValueText
    // Offset: 0x20
    TMPro::TextMeshProUGUI* totalMultiplierValueText;
    // private TMPro.TextMeshProUGUI _maxRankValueText
    // Offset: 0x28
    TMPro::TextMeshProUGUI* maxRankValueText;
    // private System.Action didChangeGameplayModifiersEvent
    // Offset: 0x30
    System::Action* didChangeGameplayModifiersEvent;
    // private GameplayModifiers _gameplayModifiers
    // Offset: 0x38
    GlobalNamespace::GameplayModifiers* gameplayModifiers;
    // private HMUI.ToggleBinder _toggleBinder
    // Offset: 0x40
    HMUI::ToggleBinder* toggleBinder;
    // private GameplayModifierToggle[] _gameplayModifierToggles
    // Offset: 0x48
    ::Array<GlobalNamespace::GameplayModifierToggle*>* gameplayModifierToggles;
    // private System.Boolean _changingGameplayModifierToggles
    // Offset: 0x50
    bool changingGameplayModifierToggles;
    // private readonly System.Collections.Generic.Dictionary`2<GameplayModifierParamsSO,UnityEngine.UI.Toggle> _toggleForGameplayModifierParam
    // Offset: 0x58
    System::Collections::Generic::Dictionary_2<GlobalNamespace::GameplayModifierParamsSO*, UnityEngine::UI::Toggle*>* toggleForGameplayModifierParam;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_didChangeGameplayModifiersEvent(System.Action value)
    // Offset: 0x2009B04
    void add_didChangeGameplayModifiersEvent(System::Action* value);
    // public System.Void remove_didChangeGameplayModifiersEvent(System.Action value)
    // Offset: 0x2009BA8
    void remove_didChangeGameplayModifiersEvent(System::Action* value);
    // public GameplayModifiers get_gameplayModifiers()
    // Offset: 0x2009C4C
    GlobalNamespace::GameplayModifiers* get_gameplayModifiers();
    // public System.Void SetData(GameplayModifiers newGameplayModifiers)
    // Offset: 0x2009C54
    void SetData(GlobalNamespace::GameplayModifiers* newGameplayModifiers);
    // protected System.Void Awake()
    // Offset: 0x2009C5C
    void Awake();
    // private System.Void OnDestroy()
    // Offset: 0x2009E00
    void OnDestroy();
    // private System.Void SetToggleValueWithGameplayModifierParams(GameplayModifierParamsSO gameplayModifierParams, System.Boolean value)
    // Offset: 0x2009E14
    void SetToggleValueWithGameplayModifierParams(GlobalNamespace::GameplayModifierParamsSO* gameplayModifierParams, bool value);
    // private System.Boolean GetToggleValueWithGameplayModifierParams(GameplayModifierParamsSO gameplayModifierParams)
    // Offset: 0x2009EAC
    bool GetToggleValueWithGameplayModifierParams(GlobalNamespace::GameplayModifierParamsSO* gameplayModifierParams);
    // private System.Void RefreshTotalMultiplierAndRankUI()
    // Offset: 0x2009F40
    void RefreshTotalMultiplierAndRankUI();
    // private System.Void IRefreshable.Refresh()
    // Offset: 0x200A018
    // Implemented from: IRefreshable
    // Base method: System.Void IRefreshable::Refresh()
    void GlobalNamespace_IRefreshable_Refresh();
    // public System.Void .ctor()
    // Offset: 0x200A120
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static GameplayModifiersPanelController* New_ctor();
  }; // GameplayModifiersPanelController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::GameplayModifiersPanelController*, "", "GameplayModifiersPanelController");
#pragma pack(pop)
