// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IGameEnergyCounter
#include "GlobalNamespace/IGameEnergyCounter.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SaberClashChecker
  class SaberClashChecker;
  // Forward declaring type: BeatmapObjectManager
  class BeatmapObjectManager;
  // Forward declaring type: PlayerHeadAndObstacleInteraction
  class PlayerHeadAndObstacleInteraction;
  // Forward declaring type: NoteController
  class NoteController;
  // Forward declaring type: NoteCutInfo
  struct NoteCutInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GameEnergyCounter
  class GameEnergyCounter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GameEnergyCounter);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GameEnergyCounter*, "", "GameEnergyCounter");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x6C
  #pragma pack(push, 1)
  // Autogenerated type: GameEnergyCounter
  // [TokenAttribute] Offset: FFFFFFFF
  class GameEnergyCounter : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IGameEnergyCounter*/ {
    public:
    // Nested type: ::GlobalNamespace::GameEnergyCounter::InitData
    class InitData;
    public:
    // private System.Int32 _batteryLives
    // Size: 0x4
    // Offset: 0x18
    int batteryLives;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: batteryLives and: initData
    char __padding0[0x4] = {};
    // [InjectAttribute] Offset: 0x10DD208
    // private readonly GameEnergyCounter/InitData _initData
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::GameEnergyCounter::InitData* initData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameEnergyCounter::InitData*) == 0x8);
    // [InjectAttribute] Offset: 0x10DD218
    // private readonly SaberClashChecker _saberClashChecker
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::SaberClashChecker* saberClashChecker;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SaberClashChecker*) == 0x8);
    // [InjectAttribute] Offset: 0x10DD228
    // private readonly BeatmapObjectManager _beatmapObjectManager
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::BeatmapObjectManager* beatmapObjectManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapObjectManager*) == 0x8);
    // [InjectAttribute] Offset: 0x10DD238
    // private readonly PlayerHeadAndObstacleInteraction _playerHeadAndObstacleInteraction
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::PlayerHeadAndObstacleInteraction* playerHeadAndObstacleInteraction;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerHeadAndObstacleInteraction*) == 0x8);
    // private System.Action didInitEvent
    // Size: 0x8
    // Offset: 0x40
    ::System::Action* didInitEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action gameEnergyDidReach0Event
    // Size: 0x8
    // Offset: 0x48
    ::System::Action* gameEnergyDidReach0Event;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<System.Single> gameEnergyDidChangeEvent
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_1<float>* gameEnergyDidChangeEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<float>*) == 0x8);
    // private System.Single <energy>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    float energy;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private GameplayModifiers/EnergyType <energyType>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    ::GlobalNamespace::GameplayModifiers::EnergyType energyType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameplayModifiers::EnergyType) == 0x4);
    // private System.Boolean <noFail>k__BackingField
    // Size: 0x1
    // Offset: 0x60
    bool noFail;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <instaFail>k__BackingField
    // Size: 0x1
    // Offset: 0x61
    bool instaFail;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <failOnSaberClash>k__BackingField
    // Size: 0x1
    // Offset: 0x62
    bool failOnSaberClash;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isInitialized
    // Size: 0x1
    // Offset: 0x63
    bool isInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _didReach0Energy
    // Size: 0x1
    // Offset: 0x64
    bool didReach0Energy;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: didReach0Energy and: nextFrameEnergyChange
    char __padding14[0x3] = {};
    // private System.Single _nextFrameEnergyChange
    // Size: 0x4
    // Offset: 0x68
    float nextFrameEnergyChange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IGameEnergyCounter
    operator ::GlobalNamespace::IGameEnergyCounter() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IGameEnergyCounter*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single kBadNoteEnergyDrain
    static constexpr const float kBadNoteEnergyDrain = 0.1;
    // Get static field: static private System.Single kBadNoteEnergyDrain
    static float _get_kBadNoteEnergyDrain();
    // Set static field: static private System.Single kBadNoteEnergyDrain
    static void _set_kBadNoteEnergyDrain(float value);
