// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HMUI.TableCell
#include "HMUI/TableCell.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: CurvedTextMeshPro
  class CurvedTextMeshPro;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SongPackMasksModel
  class SongPackMasksModel;
  // Forward declaring type: INetworkPlayer
  class INetworkPlayer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GameServerListTableCell
  class GameServerListTableCell;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GameServerListTableCell);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GameServerListTableCell*, "", "GameServerListTableCell");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: GameServerListTableCell
  // [TokenAttribute] Offset: FFFFFFFF
  class GameServerListTableCell : public ::HMUI::TableCell {
    public:
    public:
    // private HMUI.CurvedTextMeshPro _serverName
    // Size: 0x8
    // Offset: 0x58
    ::HMUI::CurvedTextMeshPro* serverName;
    // Field size check
    static_assert(sizeof(::HMUI::CurvedTextMeshPro*) == 0x8);
    // private HMUI.CurvedTextMeshPro _difficultiesText
    // Size: 0x8
    // Offset: 0x60
    ::HMUI::CurvedTextMeshPro* difficultiesText;
    // Field size check
    static_assert(sizeof(::HMUI::CurvedTextMeshPro*) == 0x8);
    // private HMUI.CurvedTextMeshPro _musicPackText
    // Size: 0x8
    // Offset: 0x68
    ::HMUI::CurvedTextMeshPro* musicPackText;
    // Field size check
    static_assert(sizeof(::HMUI::CurvedTextMeshPro*) == 0x8);
    // private HMUI.CurvedTextMeshPro _playerCount
    // Size: 0x8
    // Offset: 0x70
    ::HMUI::CurvedTextMeshPro* playerCount;
    // Field size check
    static_assert(sizeof(::HMUI::CurvedTextMeshPro*) == 0x8);
    // private UnityEngine.GameObject _passwordProtected
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* passwordProtected;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [InjectAttribute] Offset: 0x111DC14
    // private readonly SongPackMasksModel _songPackMasksModel
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::SongPackMasksModel* songPackMasksModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SongPackMasksModel*) == 0x8);
    public:
    // Get instance field reference: private HMUI.CurvedTextMeshPro _serverName
    [[deprecated("Use field access instead!")]] ::HMUI::CurvedTextMeshPro*& dyn__serverName();
    // Get instance field reference: private HMUI.CurvedTextMeshPro _difficultiesText
    [[deprecated("Use field access instead!")]] ::HMUI::CurvedTextMeshPro*& dyn__difficultiesText();
    // Get instance field reference: private HMUI.CurvedTextMeshPro _musicPackText
    [[deprecated("Use field access instead!")]] ::HMUI::CurvedTextMeshPro*& dyn__musicPackText();
    // Get instance field reference: private HMUI.CurvedTextMeshPro _playerCount
    [[deprecated("Use field access instead!")]] ::HMUI::CurvedTextMeshPro*& dyn__playerCount();
    // Get instance field reference: private UnityEngine.GameObject _passwordProtected
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn__passwordProtected();
    // Get instance field reference: private readonly SongPackMasksModel _songPackMasksModel
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SongPackMasksModel*& dyn__songPackMasksModel();
    // public System.Void .ctor()
    // Offset: 0x14457DC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GameServerListTableCell* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::GameServerListTableCell::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GameServerListTableCell*, creationType>()));
    }
    // public System.Void SetData(INetworkPlayer player)
    // Offset: 0x144545C
    void SetData(::GlobalNamespace::INetworkPlayer* player);
  }; // GameServerListTableCell
  #pragma pack(pop)
  static check_size<sizeof(GameServerListTableCell), 128 + sizeof(::GlobalNamespace::SongPackMasksModel*)> __GlobalNamespace_GameServerListTableCellSizeCheck;
  static_assert(sizeof(GameServerListTableCell) == 0x88);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::GameServerListTableCell::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::GameServerListTableCell::SetData
// Il2CppName: SetData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GameServerListTableCell::*)(::GlobalNamespace::INetworkPlayer*)>(&GlobalNamespace::GameServerListTableCell::SetData)> {
  static const MethodInfo* get() {
    static auto* player = &::il2cpp_utils::GetClassFromName("", "INetworkPlayer")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GameServerListTableCell*), "SetData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{player});
  }
};
