// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HMUI.TableView/HMUI.IDataSource
#include "HMUI/TableView_IDataSource.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Skipping declaration: TableView because it is already included!
  // Forward declaring type: TableCell
  class TableCell;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameServerPlayerTableCell
  class GameServerPlayerTableCell;
  // Forward declaring type: AdditionalContentModel
  class AdditionalContentModel;
  // Forward declaring type: PreviewDifficultyBeatmap
  class PreviewDifficultyBeatmap;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: ILobbyPlayersDataModel
  class ILobbyPlayersDataModel;
  // Forward declaring type: ILobbyPlayerData
  class ILobbyPlayerData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: DiContainer
  class DiContainer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GameServerPlayersTableView
  class GameServerPlayersTableView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GameServerPlayersTableView);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GameServerPlayersTableView*, "", "GameServerPlayersTableView");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: GameServerPlayersTableView
  // [TokenAttribute] Offset: FFFFFFFF
  class GameServerPlayersTableView : public ::UnityEngine::MonoBehaviour/*, public ::HMUI::TableView::IDataSource*/ {
    public:
    public:
    // private HMUI.TableView _tableView
    // Size: 0x8
    // Offset: 0x18
    ::HMUI::TableView* tableView;
    // Field size check
    static_assert(sizeof(::HMUI::TableView*) == 0x8);
    // private GameServerPlayerTableCell _gameServerPlayerCellPrefab
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::GameServerPlayerTableCell* gameServerPlayerCellPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameServerPlayerTableCell*) == 0x8);
    // private GameServerPlayerTableCell _gameServerPlayerCellWithoutSongsPrefab
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::GameServerPlayerTableCell* gameServerPlayerCellWithoutSongsPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameServerPlayerTableCell*) == 0x8);
    // private GameServerPlayerTableCell _gameServerPlayerCellWithoutModifiersPrefab
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::GameServerPlayerTableCell* gameServerPlayerCellWithoutModifiersPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameServerPlayerTableCell*) == 0x8);
    // private UnityEngine.GameObject _tableHeaderSongGo
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* tableHeaderSongGo;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject _tableHeaderModifiersGo
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* tableHeaderModifiersGo;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [InjectAttribute] Offset: 0x1124B78
    // private readonly Zenject.DiContainer _container
    // Size: 0x8
    // Offset: 0x48
    ::Zenject::DiContainer* container;
    // Field size check
    static_assert(sizeof(::Zenject::DiContainer*) == 0x8);
    // [InjectAttribute] Offset: 0x1124B88
    // private readonly AdditionalContentModel _additionalContentModel
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::AdditionalContentModel* additionalContentModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AdditionalContentModel*) == 0x8);
    // private System.Action`1<PreviewDifficultyBeatmap> selectSuggestedLevelEvent
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_1<::GlobalNamespace::PreviewDifficultyBeatmap*>* selectSuggestedLevelEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::PreviewDifficultyBeatmap*>*) == 0x8);
    // private System.Action`1<GameplayModifiers> selectSuggestedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_1<::GlobalNamespace::GameplayModifiers*>* selectSuggestedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::GameplayModifiers*>*) == 0x8);
    // private System.Action`1<System.String> kickPlayerEvent
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_1<::StringW>* kickPlayerEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Boolean _initialized
    // Size: 0x1
    // Offset: 0x70
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _hasKickPermissions
    // Size: 0x1
    // Offset: 0x71
    bool hasKickPermissions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _allowSelection
    // Size: 0x1
    // Offset: 0x72
    bool allowSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showSongSelection
    // Size: 0x1
    // Offset: 0x73
    bool showSongSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showModifierSelection
    // Size: 0x1
    // Offset: 0x74
    bool showModifierSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showModifierSelection and: selectedPlayer
    char __padding15[0x3] = {};
    // private IConnectedPlayer _selectedPlayer
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::IConnectedPlayer* selectedPlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IConnectedPlayer*) == 0x8);
    // private System.Collections.Generic.List`1<IConnectedPlayer> _sortedConnectedPlayers
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::GlobalNamespace::IConnectedPlayer*>* sortedConnectedPlayers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private ILobbyPlayersDataModel _lobbyPlayersDataModel
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::ILobbyPlayersDataModel* lobbyPlayersDataModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ILobbyPlayersDataModel*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::HMUI::TableView::IDataSource
    operator ::HMUI::TableView::IDataSource() noexcept {
      return *reinterpret_cast<::HMUI::TableView::IDataSource*>(this);
    }
    // Creating interface conversion operator: i_IDataSource
    inline ::HMUI::TableView::IDataSource* i_IDataSource() noexcept {
      return reinterpret_cast<::HMUI::TableView::IDataSource*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.String kCellId
    static constexpr const char* kCellId = "Cell";
    // Get static field: static private System.String kCellId
