// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GorillaScoreBoard
  class GorillaScoreBoard;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: DisconnectCause
  struct DisconnectCause;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaScoreboardSpawner
  class GorillaScoreboardSpawner;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaScoreboardSpawner);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaScoreboardSpawner*, "", "GorillaScoreboardSpawner");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: GorillaScoreboardSpawner
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaScoreboardSpawner : public ::Photon::Pun::MonoBehaviourPunCallbacks {
    public:
    // Nested type: ::GlobalNamespace::GorillaScoreboardSpawner::$UpdateBoard$d__11
    class $UpdateBoard$d__11;
    public:
    // public System.String gameType
    // Size: 0x8
    // Offset: 0x20
    ::StringW gameType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean includeMMR
    // Size: 0x1
    // Offset: 0x28
    bool includeMMR;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: includeMMR and: scoreboardPrefab
    char __padding1[0x7] = {};
    // public UnityEngine.GameObject scoreboardPrefab
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* scoreboardPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject notInRoomText
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* notInRoomText;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject controllingParentGameObject
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* controllingParentGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean isActive
    // Size: 0x1
    // Offset: 0x48
    bool isActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isActive and: currentScoreboard
    char __padding5[0x7] = {};
    // public GorillaScoreBoard currentScoreboard
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::GorillaScoreBoard* currentScoreboard;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaScoreBoard*) == 0x8);
    public:
    // Get instance field reference: public System.String gameType
    [[deprecated("Use field access instead!")]] ::StringW& dyn_gameType();
    // Get instance field reference: public System.Boolean includeMMR
    [[deprecated("Use field access instead!")]] bool& dyn_includeMMR();
    // Get instance field reference: public UnityEngine.GameObject scoreboardPrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_scoreboardPrefab();
    // Get instance field reference: public UnityEngine.GameObject notInRoomText
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_notInRoomText();
    // Get instance field reference: public UnityEngine.GameObject controllingParentGameObject
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_controllingParentGameObject();
    // Get instance field reference: public System.Boolean isActive
    [[deprecated("Use field access instead!")]] bool& dyn_isActive();
    // Get instance field reference: public GorillaScoreBoard currentScoreboard
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::GorillaScoreBoard*& dyn_currentScoreboard();
    // public System.Void .ctor()
    // Offset: 0xC7F030
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GorillaScoreboardSpawner* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::GorillaScoreboardSpawner::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GorillaScoreboardSpawner*, creationType>()));
    }
    // public System.Void Awake()
    // Offset: 0xC7ECF0
    void Awake();
    // public System.Boolean IsCurrentScoreboard()
    // Offset: 0xC7ED8C
    bool IsCurrentScoreboard();
    // private System.Collections.IEnumerator UpdateBoard()
    // Offset: 0xC7ED1C
    ::System::Collections::IEnumerator* UpdateBoard();
    // public override System.Void OnJoinedRoom()
    // Offset: 0xC7EDB0
    // Implemented from: Photon.Pun.MonoBehaviourPunCallbacks
    // Base method: System.Void MonoBehaviourPunCallbacks::OnJoinedRoom()
    void OnJoinedRoom();
    // public override System.Void OnDisconnected(Photon.Realtime.DisconnectCause cause)
    // Offset: 0xC7EF20
    // Implemented from: Photon.Pun.MonoBehaviourPunCallbacks
    // Base method: System.Void MonoBehaviourPunCallbacks::OnDisconnected(Photon.Realtime.DisconnectCause cause)
    void OnDisconnected(::Photon::Realtime::DisconnectCause cause);
    // public override System.Void OnLeftRoom()
    // Offset: 0xC7EF5C
    // Implemented from: Photon.Pun.MonoBehaviourPunCallbacks
    // Base method: System.Void MonoBehaviourPunCallbacks::OnLeftRoom()
    void OnLeftRoom();
  }; // GorillaScoreboardSpawner
  #pragma pack(pop)
  static check_size<sizeof(GorillaScoreboardSpawner), 80 + sizeof(::GlobalNamespace::GorillaScoreBoard*)> __GlobalNamespace_GorillaScoreboardSpawnerSizeCheck;
  static_assert(sizeof(GorillaScoreboardSpawner) == 0x58);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::GorillaScoreboardSpawner::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::GorillaScoreboardSpawner::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaScoreboardSpawner::*)()>(&GlobalNamespace::GorillaScoreboardSpawner::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaScoreboardSpawner*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaScoreboardSpawner::IsCurrentScoreboard
// Il2CppName: IsCurrentScoreboard
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (GlobalNamespace::GorillaScoreboardSpawner::*)()>(&GlobalNamespace::GorillaScoreboardSpawner::IsCurrentScoreboard)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaScoreboardSpawner*), "IsCurrentScoreboard", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaScoreboardSpawner::UpdateBoard
// Il2CppName: UpdateBoard
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::IEnumerator* (GlobalNamespace::GorillaScoreboardSpawner::*)()>(&GlobalNamespace::GorillaScoreboardSpawner::UpdateBoard)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaScoreboardSpawner*), "UpdateBoard", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaScoreboardSpawner::OnJoinedRoom
// Il2CppName: OnJoinedRoom
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaScoreboardSpawner::*)()>(&GlobalNamespace::GorillaScoreboardSpawner::OnJoinedRoom)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaScoreboardSpawner*), "OnJoinedRoom", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaScoreboardSpawner::OnDisconnected
// Il2CppName: OnDisconnected
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaScoreboardSpawner::*)(::Photon::Realtime::DisconnectCause)>(&GlobalNamespace::GorillaScoreboardSpawner::OnDisconnected)> {
  static const MethodInfo* get() {
    static auto* cause = &::il2cpp_utils::GetClassFromName("Photon.Realtime", "DisconnectCause")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaScoreboardSpawner*), "OnDisconnected", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{cause});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaScoreboardSpawner::OnLeftRoom
// Il2CppName: OnLeftRoom
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaScoreboardSpawner::*)()>(&GlobalNamespace::GorillaScoreboardSpawner::OnLeftRoom)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaScoreboardSpawner*), "OnLeftRoom", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
