// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GorillaTurning
  class GorillaTurning;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaTurnSlider
  class GorillaTurnSlider;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaTurnSlider);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaTurnSlider*, "", "GorillaTurnSlider");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTurnSlider
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaTurnSlider : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.Single zRange
    // Size: 0x4
    // Offset: 0x18
    float zRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxValue
    // Size: 0x4
    // Offset: 0x1C
    float maxValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minValue
    // Size: 0x4
    // Offset: 0x20
    float minValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: minValue and: gorillaTurn
    char __padding2[0x4] = {};
    // public GorillaTurning gorillaTurn
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::GorillaTurning* gorillaTurn;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaTurning*) == 0x8);
    // private System.Single startingZ
    // Size: 0x4
    // Offset: 0x30
    float startingZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 startingLocation
    // Size: 0xC
    // Offset: 0x34
    ::UnityEngine::Vector3 startingLocation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Single zRange
    [[deprecated("Use field access instead!")]] float& dyn_zRange();
    // Get instance field reference: public System.Single maxValue
    [[deprecated("Use field access instead!")]] float& dyn_maxValue();
    // Get instance field reference: public System.Single minValue
    [[deprecated("Use field access instead!")]] float& dyn_minValue();
    // Get instance field reference: public GorillaTurning gorillaTurn
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::GorillaTurning*& dyn_gorillaTurn();
    // Get instance field reference: private System.Single startingZ
    [[deprecated("Use field access instead!")]] float& dyn_startingZ();
    // Get instance field reference: public UnityEngine.Vector3 startingLocation
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_startingLocation();
    // public System.Void .ctor()
    // Offset: 0xC88DA4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GorillaTurnSlider* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::GorillaTurnSlider::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GorillaTurnSlider*, creationType>()));
    }
    // private System.Void Awake()
    // Offset: 0xC88AE0
    void Awake();
    // private System.Void FixedUpdate()
    // Offset: 0xC88BD0
    void FixedUpdate();
    // public System.Void SetPosition(System.Single speed)
    // Offset: 0xC88B2C
    void SetPosition(float speed);
    // public System.Single InterpolateValue(System.Single value)
    // Offset: 0xC88BD4
    float InterpolateValue(float value);
    // public System.Void OnSliderRelease()
    // Offset: 0xC88C0C
    void OnSliderRelease();
  }; // GorillaTurnSlider
  #pragma pack(pop)
  static check_size<sizeof(GorillaTurnSlider), 52 + sizeof(::UnityEngine::Vector3)> __GlobalNamespace_GorillaTurnSliderSizeCheck;
  static_assert(sizeof(GorillaTurnSlider) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::GorillaTurnSlider::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::GorillaTurnSlider::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaTurnSlider::*)()>(&GlobalNamespace::GorillaTurnSlider::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaTurnSlider*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaTurnSlider::FixedUpdate
// Il2CppName: FixedUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaTurnSlider::*)()>(&GlobalNamespace::GorillaTurnSlider::FixedUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaTurnSlider*), "FixedUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaTurnSlider::SetPosition
// Il2CppName: SetPosition
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaTurnSlider::*)(float)>(&GlobalNamespace::GorillaTurnSlider::SetPosition)> {
  static const MethodInfo* get() {
    static auto* speed = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaTurnSlider*), "SetPosition", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{speed});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaTurnSlider::InterpolateValue
// Il2CppName: InterpolateValue
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (GlobalNamespace::GorillaTurnSlider::*)(float)>(&GlobalNamespace::GorillaTurnSlider::InterpolateValue)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaTurnSlider*), "InterpolateValue", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaTurnSlider::OnSliderRelease
// Il2CppName: OnSliderRelease
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaTurnSlider::*)()>(&GlobalNamespace::GorillaTurnSlider::OnSliderRelease)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaTurnSlider*), "OnSliderRelease", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
