// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: GameServerLobbyFlowCoordinator
#include "GlobalNamespace/GameServerLobbyFlowCoordinator.hpp"
// Including type: HostLobbySetupViewController
#include "GlobalNamespace/HostLobbySetupViewController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SimpleDialogPromptViewController
  class SimpleDialogPromptViewController;
  // Forward declaring type: IUnifiedNetworkPlayerModel
  class IUnifiedNetworkPlayerModel;
  // Forward declaring type: ILobbyStateDataModel
  class ILobbyStateDataModel;
  // Forward declaring type: ILobbyHostGameStateController
  class ILobbyHostGameStateController;
  // Forward declaring type: LobbyGameState
  class LobbyGameState;
  // Forward declaring type: NetworkPlayerEntitlementChecker
  class NetworkPlayerEntitlementChecker;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: BeatmapCharacteristicSO
  class BeatmapCharacteristicSO;
  // Forward declaring type: BeatmapDifficulty
  struct BeatmapDifficulty;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: MultiplayerResultsViewController
  class MultiplayerResultsViewController;
  // Forward declaring type: MultiplayerLevelScenesTransitionSetupDataSO
  class MultiplayerLevelScenesTransitionSetupDataSO;
  // Forward declaring type: MultiplayerResultsData
  class MultiplayerResultsData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x1D0
  #pragma pack(push, 1)
  // Autogenerated type: HostGameServerLobbyFlowCoordinator
  class HostGameServerLobbyFlowCoordinator : public GlobalNamespace::GameServerLobbyFlowCoordinator {
    public:
    // Writing base type padding for base size: 0x171 to desired offset: 0x178
    char ___base_padding[0x7] = {};
    // Nested type: GlobalNamespace::HostGameServerLobbyFlowCoordinator::$$c__DisplayClass23_0
    class $$c__DisplayClass23_0;
    // Nested type: GlobalNamespace::HostGameServerLobbyFlowCoordinator::$$c__DisplayClass23_1
    class $$c__DisplayClass23_1;
    // Nested type: GlobalNamespace::HostGameServerLobbyFlowCoordinator::$$c__DisplayClass33_0
    class $$c__DisplayClass33_0;
    // Nested type: GlobalNamespace::HostGameServerLobbyFlowCoordinator::$$c__DisplayClass43_0
    class $$c__DisplayClass43_0;
    // Nested type: GlobalNamespace::HostGameServerLobbyFlowCoordinator::$$c
    class $$c;
    // Nested type: GlobalNamespace::HostGameServerLobbyFlowCoordinator::$UpdateMissingEntitlementsAsync$d__43
    struct $UpdateMissingEntitlementsAsync$d__43;
    // [InjectAttribute] Offset: 0xE22B50
    // private readonly HostLobbySetupViewController _hostLobbySetupViewController
    // Size: 0x8
    // Offset: 0x178
    GlobalNamespace::HostLobbySetupViewController* hostLobbySetupViewController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::HostLobbySetupViewController*) == 0x8);
    // [InjectAttribute] Offset: 0xE22B60
    // private readonly SimpleDialogPromptViewController _simpleDialogPromptViewController
    // Size: 0x8
    // Offset: 0x180
    GlobalNamespace::SimpleDialogPromptViewController* simpleDialogPromptViewController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SimpleDialogPromptViewController*) == 0x8);
    // [InjectAttribute] Offset: 0xE22B70
    // private readonly IUnifiedNetworkPlayerModel _unifiedNetworkPlayerModel
    // Size: 0x8
    // Offset: 0x188
    GlobalNamespace::IUnifiedNetworkPlayerModel* unifiedNetworkPlayerModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IUnifiedNetworkPlayerModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE22B80
    // private readonly ILobbyStateDataModel _lobbyStateDataModel
    // Size: 0x8
    // Offset: 0x190
    GlobalNamespace::ILobbyStateDataModel* lobbyStateDataModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ILobbyStateDataModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE22B90
    // private readonly ILobbyHostGameStateController _lobbyGameStateController
    // Size: 0x8
    // Offset: 0x198
    GlobalNamespace::ILobbyHostGameStateController* lobbyGameStateController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ILobbyHostGameStateController*) == 0x8);
    // [InjectAttribute] Offset: 0xE22BA0
    // private readonly LobbyGameState _lobbyGameState
    // Size: 0x8
    // Offset: 0x1A0
    GlobalNamespace::LobbyGameState* lobbyGameState;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LobbyGameState*) == 0x8);
    // [InjectAttribute] Offset: 0xE22BB0
    // private readonly NetworkPlayerEntitlementChecker _entitlementChecker
    // Size: 0x8
    // Offset: 0x1A8
    GlobalNamespace::NetworkPlayerEntitlementChecker* entitlementChecker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NetworkPlayerEntitlementChecker*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE22BC0
    // private System.Action`1<HostGameServerLobbyFlowCoordinator> willFinishEvent
    // Size: 0x8
    // Offset: 0x1B0
    System::Action_1<GlobalNamespace::HostGameServerLobbyFlowCoordinator*>* willFinishEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::HostGameServerLobbyFlowCoordinator*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE22BD0
    // private System.Action`1<HostGameServerLobbyFlowCoordinator> didFinishedEvent
    // Size: 0x8
    // Offset: 0x1B8
    System::Action_1<GlobalNamespace::HostGameServerLobbyFlowCoordinator*>* didFinishedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::HostGameServerLobbyFlowCoordinator*>*) == 0x8);
    // private readonly System.Text.StringBuilder _stringBuilder
    // Size: 0x8
    // Offset: 0x1C0
    System::Text::StringBuilder* stringBuilder;
    // Field size check
    static_assert(sizeof(System::Text::StringBuilder*) == 0x8);
    // private System.Threading.CancellationTokenSource _canStartGameCts
    // Size: 0x8
    // Offset: 0x1C8
    System::Threading::CancellationTokenSource* canStartGameCts;
    // Field size check
    static_assert(sizeof(System::Threading::CancellationTokenSource*) == 0x8);
    // Creating value type constructor for type: HostGameServerLobbyFlowCoordinator
