// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: BasicBeatmapEventType
#include "GlobalNamespace/BasicBeatmapEventType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SpringJoint
  class SpringJoint;
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatmapCallbacksController
  class BeatmapCallbacksController;
  // Forward declaring type: BeatmapDataCallbackWrapper
  class BeatmapDataCallbackWrapper;
  // Forward declaring type: BasicBeatmapEventData
  class BasicBeatmapEventData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: HydraulicCarSuspensionEffect
  class HydraulicCarSuspensionEffect;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::HydraulicCarSuspensionEffect);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::HydraulicCarSuspensionEffect*, "", "HydraulicCarSuspensionEffect");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: HydraulicCarSuspensionEffect
  // [TokenAttribute] Offset: FFFFFFFF
  class HydraulicCarSuspensionEffect : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private BasicBeatmapEventType _contractEvent
    // Size: 0x4
    // Offset: 0x18
    ::GlobalNamespace::BasicBeatmapEventType contractEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BasicBeatmapEventType) == 0x4);
    // Padding between fields: contractEvent and: contractEventValues
    char __padding0[0x4] = {};
    // private System.Int32[] _contractEventValues
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<int> contractEventValues;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // [SpaceAttribute] Offset: 0x11191C4
    // private BasicBeatmapEventType _expandEvent
    // Size: 0x4
    // Offset: 0x28
    ::GlobalNamespace::BasicBeatmapEventType expandEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BasicBeatmapEventType) == 0x4);
    // Padding between fields: expandEvent and: expandEventValues
    char __padding2[0x4] = {};
    // private System.Int32[] _expandEventValues
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<int> expandEventValues;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // [SpaceAttribute] Offset: 0x111920C
    // private UnityEngine.SpringJoint _springJoint
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::SpringJoint* springJoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpringJoint*) == 0x8);
    // private System.Single _contractDistance
    // Size: 0x4
    // Offset: 0x40
    float contractDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _expandDistance
    // Size: 0x4
    // Offset: 0x44
    float expandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x1119264
    // private UnityEngine.Rigidbody _rigidbody
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Rigidbody* rigidbody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // [InjectAttribute] Offset: 0x111929C
    // private readonly BeatmapCallbacksController _beatmapCallbacksController
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::BeatmapCallbacksController* beatmapCallbacksController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapCallbacksController*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.Int32> _contractEventValuesHashSet
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::HashSet_1<int>* contractEventValuesHashSet;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.Int32> _expandEventValuesHashSet
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::HashSet_1<int>* expandEventValuesHashSet;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // private BeatmapDataCallbackWrapper _contractBeatmapDataCallbackWrapper
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::BeatmapDataCallbackWrapper* contractBeatmapDataCallbackWrapper;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapDataCallbackWrapper*) == 0x8);
    // private BeatmapDataCallbackWrapper _expandBeatmapDataCallbackWrapper
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::BeatmapDataCallbackWrapper* expandBeatmapDataCallbackWrapper;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapDataCallbackWrapper*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private BasicBeatmapEventType _contractEvent
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::BasicBeatmapEventType& dyn__contractEvent();
    // Get instance field reference: private System.Int32[] _contractEventValues
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn__contractEventValues();
    // Get instance field reference: private BasicBeatmapEventType _expandEvent
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::BasicBeatmapEventType& dyn__expandEvent();
    // Get instance field reference: private System.Int32[] _expandEventValues
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn__expandEventValues();
    // Get instance field reference: private UnityEngine.SpringJoint _springJoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::SpringJoint*& dyn__springJoint();
    // Get instance field reference: private System.Single _contractDistance
    [[deprecated("Use field access instead!")]] float& dyn__contractDistance();
    // Get instance field reference: private System.Single _expandDistance
    [[deprecated("Use field access instead!")]] float& dyn__expandDistance();
    // Get instance field reference: private UnityEngine.Rigidbody _rigidbody
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn__rigidbody();
    // Get instance field reference: private readonly BeatmapCallbacksController _beatmapCallbacksController
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::BeatmapCallbacksController*& dyn__beatmapCallbacksController();
    // Get instance field reference: private System.Collections.Generic.HashSet`1<System.Int32> _contractEventValuesHashSet
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::HashSet_1<int>*& dyn__contractEventValuesHashSet();
    // Get instance field reference: private System.Collections.Generic.HashSet`1<System.Int32> _expandEventValuesHashSet
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::HashSet_1<int>*& dyn__expandEventValuesHashSet();
    // Get instance field reference: private BeatmapDataCallbackWrapper _contractBeatmapDataCallbackWrapper
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::BeatmapDataCallbackWrapper*& dyn__contractBeatmapDataCallbackWrapper();
    // Get instance field reference: private BeatmapDataCallbackWrapper _expandBeatmapDataCallbackWrapper
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::BeatmapDataCallbackWrapper*& dyn__expandBeatmapDataCallbackWrapper();
    // public System.Void .ctor()
    // Offset: 0x139CBE8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static HydraulicCarSuspensionEffect* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::HydraulicCarSuspensionEffect::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<HydraulicCarSuspensionEffect*, creationType>()));
    }
    // protected System.Void Start()
    // Offset: 0x139C844
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0x139CA28
    void OnDestroy();
    // private System.Void HandleContractBeatmapEvent(BasicBeatmapEventData basicBeatmapEventData)
    // Offset: 0x139CA78
    void HandleContractBeatmapEvent(::GlobalNamespace::BasicBeatmapEventData* basicBeatmapEventData);
    // private System.Void HandleExpandBeatmapEvent(BasicBeatmapEventData basicBeatmapEventData)
    // Offset: 0x139CB30
    void HandleExpandBeatmapEvent(::GlobalNamespace::BasicBeatmapEventData* basicBeatmapEventData);
  }; // HydraulicCarSuspensionEffect
  #pragma pack(pop)
  static check_size<sizeof(HydraulicCarSuspensionEffect), 112 + sizeof(::GlobalNamespace::BeatmapDataCallbackWrapper*)> __GlobalNamespace_HydraulicCarSuspensionEffectSizeCheck;
  static_assert(sizeof(HydraulicCarSuspensionEffect) == 0x78);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::HydraulicCarSuspensionEffect::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::HydraulicCarSuspensionEffect::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::HydraulicCarSuspensionEffect::*)()>(&GlobalNamespace::HydraulicCarSuspensionEffect::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::HydraulicCarSuspensionEffect*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::HydraulicCarSuspensionEffect::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::HydraulicCarSuspensionEffect::*)()>(&GlobalNamespace::HydraulicCarSuspensionEffect::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::HydraulicCarSuspensionEffect*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::HydraulicCarSuspensionEffect::HandleContractBeatmapEvent
// Il2CppName: HandleContractBeatmapEvent
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::HydraulicCarSuspensionEffect::*)(::GlobalNamespace::BasicBeatmapEventData*)>(&GlobalNamespace::HydraulicCarSuspensionEffect::HandleContractBeatmapEvent)> {
  static const MethodInfo* get() {
    static auto* basicBeatmapEventData = &::il2cpp_utils::GetClassFromName("", "BasicBeatmapEventData")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::HydraulicCarSuspensionEffect*), "HandleContractBeatmapEvent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{basicBeatmapEventData});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::HydraulicCarSuspensionEffect::HandleExpandBeatmapEvent
// Il2CppName: HandleExpandBeatmapEvent
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::HydraulicCarSuspensionEffect::*)(::GlobalNamespace::BasicBeatmapEventData*)>(&GlobalNamespace::HydraulicCarSuspensionEffect::HandleExpandBeatmapEvent)> {
  static const MethodInfo* get() {
    static auto* basicBeatmapEventData = &::il2cpp_utils::GetClassFromName("", "BasicBeatmapEventData")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::HydraulicCarSuspensionEffect*), "HandleExpandBeatmapEvent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{basicBeatmapEventData});
  }
};
