// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: BeatmapEventType
#include "GlobalNamespace/BeatmapEventType.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SpringJoint
  class SpringJoint;
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IBeatmapObjectCallbackController
  class IBeatmapObjectCallbackController;
  // Forward declaring type: BeatmapEventData
  class BeatmapEventData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: HydraulicCarSuspensionEffect
  class HydraulicCarSuspensionEffect : public UnityEngine::MonoBehaviour {
    public:
    // private BeatmapEventType _contractEvent
    // Size: 0x4
    // Offset: 0x18
    GlobalNamespace::BeatmapEventType contractEvent;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapEventType) == 0x4);
    // Padding between fields: contractEvent and: contractEventValues
    char __padding0[0x4] = {};
    // private System.Int32[] _contractEventValues
    // Size: 0x8
    // Offset: 0x20
    ::Array<int>* contractEventValues;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // [SpaceAttribute] Offset: 0xE1399C
    // private BeatmapEventType _expandEvent
    // Size: 0x4
    // Offset: 0x28
    GlobalNamespace::BeatmapEventType expandEvent;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapEventType) == 0x4);
    // Padding between fields: expandEvent and: expandEventValues
    char __padding2[0x4] = {};
    // private System.Int32[] _expandEventValues
    // Size: 0x8
    // Offset: 0x30
    ::Array<int>* expandEventValues;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // [SpaceAttribute] Offset: 0xE139E4
    // private UnityEngine.SpringJoint _springJoint
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::SpringJoint* springJoint;
    // Field size check
    static_assert(sizeof(UnityEngine::SpringJoint*) == 0x8);
    // private System.Single _contractDistance
    // Size: 0x4
    // Offset: 0x40
    float contractDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _expandDistance
    // Size: 0x4
    // Offset: 0x44
    float expandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0xE13A3C
    // private UnityEngine.Rigidbody _rigidbody
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::Rigidbody* rigidbody;
    // Field size check
    static_assert(sizeof(UnityEngine::Rigidbody*) == 0x8);
    // [InjectAttribute] Offset: 0xE13A74
    // private readonly IBeatmapObjectCallbackController _beatmapObjectCallbackController
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::IBeatmapObjectCallbackController* beatmapObjectCallbackController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IBeatmapObjectCallbackController*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.Int32> _contractEventValuesHashSet
    // Size: 0x8
    // Offset: 0x58
    System::Collections::Generic::HashSet_1<int>* contractEventValuesHashSet;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.Int32> _expandEventValuesHashSet
    // Size: 0x8
    // Offset: 0x60
    System::Collections::Generic::HashSet_1<int>* expandEventValuesHashSet;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // Creating value type constructor for type: HydraulicCarSuspensionEffect
    HydraulicCarSuspensionEffect(GlobalNamespace::BeatmapEventType contractEvent_ = {}, ::Array<int>* contractEventValues_ = {}, GlobalNamespace::BeatmapEventType expandEvent_ = {}, ::Array<int>* expandEventValues_ = {}, UnityEngine::SpringJoint* springJoint_ = {}, float contractDistance_ = {}, float expandDistance_ = {}, UnityEngine::Rigidbody* rigidbody_ = {}, GlobalNamespace::IBeatmapObjectCallbackController* beatmapObjectCallbackController_ = {}, System::Collections::Generic::HashSet_1<int>* contractEventValuesHashSet_ = {}, System::Collections::Generic::HashSet_1<int>* expandEventValuesHashSet_ = {}) noexcept : contractEvent{contractEvent_}, contractEventValues{contractEventValues_}, expandEvent{expandEvent_}, expandEventValues{expandEventValues_}, springJoint{springJoint_}, contractDistance{contractDistance_}, expandDistance{expandDistance_}, rigidbody{rigidbody_}, beatmapObjectCallbackController{beatmapObjectCallbackController_}, contractEventValuesHashSet{contractEventValuesHashSet_}, expandEventValuesHashSet{expandEventValuesHashSet_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0x10C3A30
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0x10C3B78
    void OnDestroy();
    // private System.Void HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger(BeatmapEventData beatmapEventData)
    // Offset: 0x10C3C78
    void HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger(GlobalNamespace::BeatmapEventData* beatmapEventData);
    // public System.Void .ctor()
    // Offset: 0x10C3D90
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static HydraulicCarSuspensionEffect* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::HydraulicCarSuspensionEffect::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<HydraulicCarSuspensionEffect*, creationType>()));
    }
  }; // HydraulicCarSuspensionEffect
  #pragma pack(pop)
  static check_size<sizeof(HydraulicCarSuspensionEffect), 96 + sizeof(System::Collections::Generic::HashSet_1<int>*)> __GlobalNamespace_HydraulicCarSuspensionEffectSizeCheck;
  static_assert(sizeof(HydraulicCarSuspensionEffect) == 0x68);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::HydraulicCarSuspensionEffect*, "", "HydraulicCarSuspensionEffect");
// Writing includes for template specializations
#include "GlobalNamespace/BeatmapEventData.hpp"
// Writing MetadataGetter for method: GlobalNamespace::HydraulicCarSuspensionEffect::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::HydraulicCarSuspensionEffect::*)()>(&GlobalNamespace::HydraulicCarSuspensionEffect::Start)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::HydraulicCarSuspensionEffect*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::HydraulicCarSuspensionEffect::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::HydraulicCarSuspensionEffect::*)()>(&GlobalNamespace::HydraulicCarSuspensionEffect::OnDestroy)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::HydraulicCarSuspensionEffect*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::HydraulicCarSuspensionEffect::HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger
// Il2CppName: HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::HydraulicCarSuspensionEffect::*)(GlobalNamespace::BeatmapEventData*)>(&GlobalNamespace::HydraulicCarSuspensionEffect::HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::HydraulicCarSuspensionEffect*), "HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<GlobalNamespace::BeatmapEventData*>()});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::HydraulicCarSuspensionEffect::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
