// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: SaberType
#include "GlobalNamespace/SaberType.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: CanvasGroup
  class CanvasGroup;
  // Forward declaring type: Collider
  class Collider;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ColorManager
  class ColorManager;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x69
  #pragma pack(push, 1)
  // Autogenerated type: IntroTutorialRing
  class IntroTutorialRing : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.UI.Image[] _progressImages
    // Size: 0x8
    // Offset: 0x18
    ::Array<UnityEngine::UI::Image*>* progressImages;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::UI::Image*>*) == 0x8);
    // private SaberType _saberType
    // Size: 0x4
    // Offset: 0x20
    GlobalNamespace::SaberType saberType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SaberType) == 0x4);
    // Padding between fields: saberType and: particleSystem
    char __padding1[0x4] = {};
    // private UnityEngine.ParticleSystem _particleSystem
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::ParticleSystem* particleSystem;
    // Field size check
    static_assert(sizeof(UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.CanvasGroup _canvasGroup
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::CanvasGroup* canvasGroup;
    // Field size check
    static_assert(sizeof(UnityEngine::CanvasGroup*) == 0x8);
    // private System.Single _activationDuration
    // Size: 0x4
    // Offset: 0x38
    float activationDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: activationDuration and: ringGLowImages
    char __padding4[0x4] = {};
    // private UnityEngine.UI.Image[] _ringGLowImages
    // Size: 0x8
    // Offset: 0x40
    ::Array<UnityEngine::UI::Image*>* ringGLowImages;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::UI::Image*>*) == 0x8);
    // [InjectAttribute] Offset: 0xD29C50
    // private readonly ColorManager _colorManager
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::ColorManager* colorManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorManager*) == 0x8);
    // private System.Boolean _highlighted
    // Size: 0x1
    // Offset: 0x50
    bool highlighted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: highlighted and: emitNextParticleTimer
    char __padding7[0x3] = {};
    // private System.Single _emitNextParticleTimer
    // Size: 0x4
    // Offset: 0x54
    float emitNextParticleTimer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _activationProgress
    // Size: 0x4
    // Offset: 0x58
    float activationProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: activationProgress and: sabersInside
    char __padding9[0x4] = {};
    // private readonly System.Collections.Generic.HashSet`1<SaberType> _sabersInside
    // Size: 0x8
    // Offset: 0x60
    System::Collections::Generic::HashSet_1<GlobalNamespace::SaberType>* sabersInside;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<GlobalNamespace::SaberType>*) == 0x8);
    // private System.Boolean _sabersInsideAfterOnEnable
    // Size: 0x1
    // Offset: 0x68
    bool sabersInsideAfterOnEnable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: IntroTutorialRing
    IntroTutorialRing(::Array<UnityEngine::UI::Image*>* progressImages_ = {}, GlobalNamespace::SaberType saberType_ = {}, UnityEngine::ParticleSystem* particleSystem_ = {}, UnityEngine::CanvasGroup* canvasGroup_ = {}, float activationDuration_ = {}, ::Array<UnityEngine::UI::Image*>* ringGLowImages_ = {}, GlobalNamespace::ColorManager* colorManager_ = {}, bool highlighted_ = {}, float emitNextParticleTimer_ = {}, float activationProgress_ = {}, System::Collections::Generic::HashSet_1<GlobalNamespace::SaberType>* sabersInside_ = {}, bool sabersInsideAfterOnEnable_ = {}) noexcept : progressImages{progressImages_}, saberType{saberType_}, particleSystem{particleSystem_}, canvasGroup{canvasGroup_}, activationDuration{activationDuration_}, ringGLowImages{ringGLowImages_}, colorManager{colorManager_}, highlighted{highlighted_}, emitNextParticleTimer{emitNextParticleTimer_}, activationProgress{activationProgress_}, sabersInside{sabersInside_}, sabersInsideAfterOnEnable{sabersInsideAfterOnEnable_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void set_alpha(System.Single value)
    // Offset: 0xFF75F8
    void set_alpha(float value);
    // public System.Boolean get_fullyActivated()
    // Offset: 0xFF7374
    bool get_fullyActivated();
    // public SaberType get_saberType()
    // Offset: 0xFF77C0
    GlobalNamespace::SaberType get_saberType();
    // public System.Void set_saberType(SaberType value)
    // Offset: 0xFF77C8
    void set_saberType(GlobalNamespace::SaberType value);
    // protected System.Void Start()
    // Offset: 0xFF77D0
    void Start();
    // protected System.Void OnEnable()
    // Offset: 0xFF7868
    void OnEnable();
    // protected System.Void Update()
    // Offset: 0xFF78C0
    void Update();
    // private System.Void SetProgressImagesfillAmount(System.Single fillAmount)
    // Offset: 0xFF7A30
    void SetProgressImagesfillAmount(float fillAmount);
    // private System.Void OnTriggerEnter(UnityEngine.Collider other)
    // Offset: 0xFF7AAC
    void OnTriggerEnter(UnityEngine::Collider* other);
    // private System.Void OnTriggerExit(UnityEngine.Collider other)
    // Offset: 0xFF7BB0
    void OnTriggerExit(UnityEngine::Collider* other);
    // private System.Void OnTriggerStay(UnityEngine.Collider other)
    // Offset: 0xFF7CB4
    void OnTriggerStay(UnityEngine::Collider* other);
    // public System.Void .ctor()
    // Offset: 0xFF7DC4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static IntroTutorialRing* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::IntroTutorialRing::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<IntroTutorialRing*, creationType>()));
    }
  }; // IntroTutorialRing
  #pragma pack(pop)
  static check_size<sizeof(IntroTutorialRing), 104 + sizeof(bool)> __GlobalNamespace_IntroTutorialRingSizeCheck;
  static_assert(sizeof(IntroTutorialRing) == 0x69);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::IntroTutorialRing*, "", "IntroTutorialRing");
