// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: SaberType
#include "GlobalNamespace/SaberType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: CanvasGroup
  class CanvasGroup;
  // Forward declaring type: Collider
  class Collider;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ColorManager
  class ColorManager;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: IntroTutorialRing
  class IntroTutorialRing : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.UI.Image[] _progressImages
    // Offset: 0x18
    ::Array<UnityEngine::UI::Image*>* progressImages;
    // private SaberType _saberType
    // Offset: 0x20
    GlobalNamespace::SaberType saberType;
    // private UnityEngine.ParticleSystem _particleSystem
    // Offset: 0x28
    UnityEngine::ParticleSystem* particleSystem;
    // private UnityEngine.CanvasGroup _canvasGroup
    // Offset: 0x30
    UnityEngine::CanvasGroup* canvasGroup;
    // private System.Single _activationDuration
    // Offset: 0x38
    float activationDuration;
    // private UnityEngine.UI.Image[] _ringGLowImages
    // Offset: 0x40
    ::Array<UnityEngine::UI::Image*>* ringGLowImages;
    // private ColorManager _colorManager
    // Offset: 0x48
    GlobalNamespace::ColorManager* colorManager;
    // private System.Boolean _highlighted
    // Offset: 0x50
    bool highlighted;
    // private System.Single _emitNextParticleTimer
    // Offset: 0x54
    float emitNextParticleTimer;
    // private System.Single _activationProgress
    // Offset: 0x58
    float activationProgress;
    // private System.Collections.Generic.HashSet`1<SaberType> _sabersInside
    // Offset: 0x60
    System::Collections::Generic::HashSet_1<GlobalNamespace::SaberType>* sabersInside;
    // private System.Boolean _sabersInsideAfterOnEnable
    // Offset: 0x68
    bool sabersInsideAfterOnEnable;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void set_alpha(System.Single value)
    // Offset: 0xB45F78
    void set_alpha(float value);
    // public System.Boolean get_fullyActivated()
    // Offset: 0xB45CD4
    bool get_fullyActivated();
    // public SaberType get_saberType()
    // Offset: 0xB4613C
    GlobalNamespace::SaberType get_saberType();
    // public System.Void set_saberType(SaberType value)
    // Offset: 0xB46144
    void set_saberType(GlobalNamespace::SaberType value);
    // protected System.Void Start()
    // Offset: 0xB4614C
    void Start();
    // protected System.Void OnEnable()
    // Offset: 0xB461E4
    void OnEnable();
    // protected System.Void Update()
    // Offset: 0xB4623C
    void Update();
    // private System.Void SetProgressImagesfillAmount(System.Single fillAmount)
    // Offset: 0xB463AC
    void SetProgressImagesfillAmount(float fillAmount);
    // private System.Void OnTriggerEnter(UnityEngine.Collider other)
    // Offset: 0xB46428
    void OnTriggerEnter(UnityEngine::Collider* other);
    // private System.Void OnTriggerExit(UnityEngine.Collider other)
    // Offset: 0xB4652C
    void OnTriggerExit(UnityEngine::Collider* other);
    // private System.Void OnTriggerStay(UnityEngine.Collider other)
    // Offset: 0xB46630
    void OnTriggerStay(UnityEngine::Collider* other);
    // public System.Void .ctor()
    // Offset: 0xB46740
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static IntroTutorialRing* New_ctor();
  }; // IntroTutorialRing
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::IntroTutorialRing*, "", "IntroTutorialRing");
#pragma pack(pop)
