// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BloomFogSO
  class BloomFogSO;
  // Forward declaring type: IntroTutorialRing
  class IntroTutorialRing;
  // Forward declaring type: IGamePause
  class IGamePause;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: CanvasGroup
  class CanvasGroup;
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: IntroTutorialController
  class IntroTutorialController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::IntroTutorialController::$ShowFinishAnimationCoroutine$d__21
    class $ShowFinishAnimationCoroutine$d__21;
    // private BloomFogSO _bloomFog
    // Offset: 0x18
    GlobalNamespace::BloomFogSO* bloomFog;
    // private IntroTutorialRing _redRing
    // Offset: 0x20
    GlobalNamespace::IntroTutorialRing* redRing;
    // private IntroTutorialRing _blueRing
    // Offset: 0x28
    GlobalNamespace::IntroTutorialRing* blueRing;
    // private UnityEngine.GameObject _redRingWrapper
    // Offset: 0x30
    UnityEngine::GameObject* redRingWrapper;
    // private UnityEngine.GameObject _blueRingWrapper
    // Offset: 0x38
    UnityEngine::GameObject* blueRingWrapper;
    // private UnityEngine.CanvasGroup _textCanvasGroup
    // Offset: 0x40
    UnityEngine::CanvasGroup* textCanvasGroup;
    // private UnityEngine.ParticleSystem _shockWavePS
    // Offset: 0x48
    UnityEngine::ParticleSystem* shockWavePS;
    // private IGamePause _gamePause
    // Offset: 0x50
    GlobalNamespace::IGamePause* gamePause;
    // private System.Action introTutorialDidFinishEvent
    // Offset: 0x58
    System::Action* introTutorialDidFinishEvent;
    // private System.Boolean _showingFinishAnimation
    // Offset: 0x60
    bool showingFinishAnimation;
    // private System.Boolean _redRingWrapperActive
    // Offset: 0x61
    bool redRingWrapperActive;
    // private System.Boolean _blueRingWrapperActive
    // Offset: 0x62
    bool blueRingWrapperActive;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_introTutorialDidFinishEvent(System.Action value)
    // Offset: 0xB457C8
    void add_introTutorialDidFinishEvent(System::Action* value);
    // public System.Void remove_introTutorialDidFinishEvent(System.Action value)
    // Offset: 0xB4586C
    void remove_introTutorialDidFinishEvent(System::Action* value);
    // protected System.Void Start()
    // Offset: 0xB45910
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0xB45A94
    void OnDestroy();
    // protected System.Void Update()
    // Offset: 0xB45C34
    void Update();
    // private System.Void CleanUp()
    // Offset: 0xB45A98
    void CleanUp();
    // private System.Void HandleGameDidPause()
    // Offset: 0xB45D84
    void HandleGameDidPause();
    // private System.Void HandlegameDidResume()
    // Offset: 0xB45E00
    void HandlegameDidResume();
    // private System.Void ShowFinishAnimation()
    // Offset: 0xB45CF8
    void ShowFinishAnimation();
    // private System.Collections.IEnumerator ShowFinishAnimationCoroutine()
    // Offset: 0xB45E44
    System::Collections::IEnumerator* ShowFinishAnimationCoroutine();
    // private System.Void SetFinishAnimationParams(System.Single progress)
    // Offset: 0xB45EEC
    void SetFinishAnimationParams(float progress);
    // public System.Void .ctor()
    // Offset: 0xB45F94
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static IntroTutorialController* New_ctor();
  }; // IntroTutorialController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::IntroTutorialController*, "", "IntroTutorialController");
#pragma pack(pop)
