// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x41
  #pragma pack(push, 1)
  // Autogenerated type: LeaderboardScoreUploader
  class LeaderboardScoreUploader : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::LeaderboardScoreUploader::ScoreData
    class ScoreData;
    // Nested type: GlobalNamespace::LeaderboardScoreUploader::ScoresToUploadData
    class ScoresToUploadData;
    // Nested type: GlobalNamespace::LeaderboardScoreUploader::UploadScoreCallback
    class UploadScoreCallback;
    // Nested type: GlobalNamespace::LeaderboardScoreUploader::$$c__DisplayClass14_0
    class $$c__DisplayClass14_0;
    // Nested type: GlobalNamespace::LeaderboardScoreUploader::$UploadScoresCoroutine$d__14
    class $UploadScoresCoroutine$d__14;
    // [CompilerGeneratedAttribute] Offset: 0xE1657C
    // private System.Action allScoresDidUploadEvent
    // Size: 0x8
    // Offset: 0x18
    System::Action* allScoresDidUploadEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Collections.Generic.List`1<LeaderboardScoreUploader/ScoreData> _scoresToUpload
    // Size: 0x8
    // Offset: 0x20
    System::Collections::Generic::List_1<GlobalNamespace::LeaderboardScoreUploader::ScoreData*>* scoresToUpload;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::LeaderboardScoreUploader::ScoreData*>*) == 0x8);
    // private System.Collections.Generic.List`1<LeaderboardScoreUploader/ScoreData> _scoresToUploadForCurrentPlayer
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Generic::List_1<GlobalNamespace::LeaderboardScoreUploader::ScoreData*>* scoresToUploadForCurrentPlayer;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::LeaderboardScoreUploader::ScoreData*>*) == 0x8);
    // private LeaderboardScoreUploader/UploadScoreCallback _uploadScoreCallback
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::LeaderboardScoreUploader::UploadScoreCallback* uploadScoreCallback;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LeaderboardScoreUploader::UploadScoreCallback*) == 0x8);
    // private System.String _playerId
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* playerId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean _uploading
    // Size: 0x1
    // Offset: 0x40
    bool uploading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: LeaderboardScoreUploader
    LeaderboardScoreUploader(System::Action* allScoresDidUploadEvent_ = {}, System::Collections::Generic::List_1<GlobalNamespace::LeaderboardScoreUploader::ScoreData*>* scoresToUpload_ = {}, System::Collections::Generic::List_1<GlobalNamespace::LeaderboardScoreUploader::ScoreData*>* scoresToUploadForCurrentPlayer_ = {}, GlobalNamespace::LeaderboardScoreUploader::UploadScoreCallback* uploadScoreCallback_ = {}, ::Il2CppString* playerId_ = {}, bool uploading_ = {}) noexcept : allScoresDidUploadEvent{allScoresDidUploadEvent_}, scoresToUpload{scoresToUpload_}, scoresToUploadForCurrentPlayer{scoresToUploadForCurrentPlayer_}, uploadScoreCallback{uploadScoreCallback_}, playerId{playerId_}, uploading{uploading_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.String kScoresToUploadFileName
    static constexpr const char* kScoresToUploadFileName = "ScoresToUpload.dat";
    // Get static field: static private System.String kScoresToUploadFileName
    static ::Il2CppString* _get_kScoresToUploadFileName();
    // Set static field: static private System.String kScoresToUploadFileName
    static void _set_kScoresToUploadFileName(::Il2CppString* value);
    // public System.Void add_allScoresDidUploadEvent(System.Action value)
    // Offset: 0x106BAE4
    void add_allScoresDidUploadEvent(System::Action* value);
    // public System.Void remove_allScoresDidUploadEvent(System.Action value)
    // Offset: 0x106BB88
    void remove_allScoresDidUploadEvent(System::Action* value);
    // public System.Void Init(LeaderboardScoreUploader/UploadScoreCallback uploadScoreCallback, System.String playerId)
    // Offset: 0x106BC2C
    void Init(GlobalNamespace::LeaderboardScoreUploader::UploadScoreCallback* uploadScoreCallback, ::Il2CppString* playerId);
    // private System.Void OnApplicationQuit()
    // Offset: 0x106BCD8
    void OnApplicationQuit();
    // private System.Collections.IEnumerator UploadScoresCoroutine()
    // Offset: 0x106BC68
    System::Collections::IEnumerator* UploadScoresCoroutine();
    // private System.Void LoadScoresToUploadFromFile()
    // Offset: 0x106BD08
    void LoadScoresToUploadFromFile();
    // private System.Void SaveScoresToUploadToFile()
    // Offset: 0x106BEE0
    void SaveScoresToUploadToFile();
    // public System.Void AddScore(LeaderboardScoreUploader/ScoreData scoreData)
    // Offset: 0x106BFEC
    void AddScore(GlobalNamespace::LeaderboardScoreUploader::ScoreData* scoreData);
    // private System.Boolean <UploadScoresCoroutine>b__14_1()
    // Offset: 0x106C150
    bool $UploadScoresCoroutine$b__14_1();
    // public System.Void .ctor()
    // Offset: 0x106C0C0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LeaderboardScoreUploader* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::LeaderboardScoreUploader::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LeaderboardScoreUploader*, creationType>()));
    }
  }; // LeaderboardScoreUploader
  #pragma pack(pop)
  static check_size<sizeof(LeaderboardScoreUploader), 64 + sizeof(bool)> __GlobalNamespace_LeaderboardScoreUploaderSizeCheck;
  static_assert(sizeof(LeaderboardScoreUploader) == 0x41);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LeaderboardScoreUploader*, "", "LeaderboardScoreUploader");
