// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: LeaderboardUploadData
  class LeaderboardUploadData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::LeaderboardUploadData);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::LeaderboardUploadData*, "", "LeaderboardUploadData");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: LeaderboardUploadData
  // [TokenAttribute] Offset: FFFFFFFF
  class LeaderboardUploadData : public ::Il2CppObject {
    public:
    public:
    // public System.String playerName
    // Size: 0x8
    // Offset: 0x10
    ::StringW playerName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String playerId
    // Size: 0x8
    // Offset: 0x18
    ::StringW playerId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String score
    // Size: 0x8
    // Offset: 0x20
    ::StringW score;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String leaderboardId
    // Size: 0x8
    // Offset: 0x28
    ::StringW leaderboardId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String songName
    // Size: 0x8
    // Offset: 0x30
    ::StringW songName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String songSubName
    // Size: 0x8
    // Offset: 0x38
    ::StringW songSubName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String authorName
    // Size: 0x8
    // Offset: 0x40
    ::StringW authorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String bpm
    // Size: 0x8
    // Offset: 0x48
    ::StringW bpm;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String difficulty
    // Size: 0x8
    // Offset: 0x50
    ::StringW difficulty;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String infoHash
    // Size: 0x8
    // Offset: 0x58
    ::StringW infoHash;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.List`1<System.String> modifiers
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::StringW>* modifiers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    public:
    // Get instance field reference: public System.String playerName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_playerName();
    // Get instance field reference: public System.String playerId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_playerId();
    // Get instance field reference: public System.String score
    [[deprecated("Use field access instead!")]] ::StringW& dyn_score();
    // Get instance field reference: public System.String leaderboardId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_leaderboardId();
    // Get instance field reference: public System.String songName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_songName();
    // Get instance field reference: public System.String songSubName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_songSubName();
    // Get instance field reference: public System.String authorName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_authorName();
    // Get instance field reference: public System.String bpm
    [[deprecated("Use field access instead!")]] ::StringW& dyn_bpm();
    // Get instance field reference: public System.String difficulty
    [[deprecated("Use field access instead!")]] ::StringW& dyn_difficulty();
    // Get instance field reference: public System.String infoHash
    [[deprecated("Use field access instead!")]] ::StringW& dyn_infoHash();
    // Get instance field reference: public System.Collections.Generic.List`1<System.String> modifiers
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::StringW>*& dyn_modifiers();
    // public System.Void .ctor(System.String playerName, System.String playerId, System.String score, System.String leaderboardId, System.String songName, System.String songSubName, System.String authorName, System.String bpm, System.String difficulty, System.String infoHash, System.Collections.Generic.List`1<System.String> modifiers)
    // Offset: 0x13A5240
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LeaderboardUploadData* New_ctor(::StringW playerName, ::StringW playerId, ::StringW score, ::StringW leaderboardId, ::StringW songName, ::StringW songSubName, ::StringW authorName, ::StringW bpm, ::StringW difficulty, ::StringW infoHash, ::System::Collections::Generic::List_1<::StringW>* modifiers) {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::LeaderboardUploadData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LeaderboardUploadData*, creationType>(playerName, playerId, score, leaderboardId, songName, songSubName, authorName, bpm, difficulty, infoHash, modifiers)));
    }
  }; // LeaderboardUploadData
  #pragma pack(pop)
  static check_size<sizeof(LeaderboardUploadData), 96 + sizeof(::System::Collections::Generic::List_1<::StringW>*)> __GlobalNamespace_LeaderboardUploadDataSizeCheck;
  static_assert(sizeof(LeaderboardUploadData) == 0x68);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::LeaderboardUploadData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
