// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: LeaderboardUploadData
  class LeaderboardUploadData : public ::CsObject {
    public:
    // public System.String playerName
    // Offset: 0x10
    ::CsString* playerName;
    // public System.String playerId
    // Offset: 0x18
    ::CsString* playerId;
    // public System.String score
    // Offset: 0x20
    ::CsString* score;
    // public System.String leaderboardId
    // Offset: 0x28
    ::CsString* leaderboardId;
    // public System.String songName
    // Offset: 0x30
    ::CsString* songName;
    // public System.String songSubName
    // Offset: 0x38
    ::CsString* songSubName;
    // public System.String authorName
    // Offset: 0x40
    ::CsString* authorName;
    // public System.String bpm
    // Offset: 0x48
    ::CsString* bpm;
    // public System.String difficulty
    // Offset: 0x50
    ::CsString* difficulty;
    // public System.String infoHash
    // Offset: 0x58
    ::CsString* infoHash;
    // public System.Collections.Generic.List`1<System.String> modifiers
    // Offset: 0x60
    System::Collections::Generic::List_1<::CsString*>* modifiers;
    // public System.Void .ctor(System.String playerName, System.String playerId, System.String score, System.String leaderboardId, System.String songName, System.String songSubName, System.String authorName, System.String bpm, System.String difficulty, System.String infoHash, System.Collections.Generic.List`1<System.String> modifiers)
    // Offset: 0xB45438
    static LeaderboardUploadData* New_ctor(::CsString* playerName, ::CsString* playerId, ::CsString* score, ::CsString* leaderboardId, ::CsString* songName, ::CsString* songSubName, ::CsString* authorName, ::CsString* bpm, ::CsString* difficulty, ::CsString* infoHash, System::Collections::Generic::List_1<::CsString*>* modifiers);
  }; // LeaderboardUploadData
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LeaderboardUploadData*, "", "LeaderboardUploadData");
#pragma pack(pop)
