// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.NavigationController
#include "HMUI/NavigationController.hpp"
// Including type: SongPackMask
#include "GlobalNamespace/SongPackMask.hpp"
// Including type: SelectLevelCategoryViewController
#include "GlobalNamespace/SelectLevelCategoryViewController.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PlayerDataModel
  class PlayerDataModel;
  // Forward declaring type: IBeatmapLevelPack
  class IBeatmapLevelPack;
  // Forward declaring type: AnnotatedBeatmapLevelCollectionsViewController
  class AnnotatedBeatmapLevelCollectionsViewController;
  // Forward declaring type: LevelSearchViewController
  class LevelSearchViewController;
  // Forward declaring type: BeatmapLevelsModel
  class BeatmapLevelsModel;
  // Forward declaring type: IAnnotatedBeatmapLevelCollection
  class IAnnotatedBeatmapLevelCollection;
  // Forward declaring type: BeatmapCharacteristicSO
  class BeatmapCharacteristicSO;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Action_4;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Skipping declaration: ViewController because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: LevelFilteringNavigationController
  class LevelFilteringNavigationController : public HMUI::NavigationController {
    public:
    // Nested type: GlobalNamespace::LevelFilteringNavigationController::$$c
    class $$c;
    // Nested type: GlobalNamespace::LevelFilteringNavigationController::$$c__DisplayClass41_0
    class $$c__DisplayClass41_0;
    // Nested type: GlobalNamespace::LevelFilteringNavigationController::$UpdateCustomSongs$d__42
    struct $UpdateCustomSongs$d__42;
    // private UnityEngine.GameObject _emptyFavoritesListInfoPrefab
    // Offset: 0x98
    UnityEngine::GameObject* emptyFavoritesListInfoPrefab;
    // private UnityEngine.GameObject _emptyCustomSongListInfoPrefab
    // Offset: 0xA0
    UnityEngine::GameObject* emptyCustomSongListInfoPrefab;
    // private readonly PlayerDataModel _playerDataModel
    // Offset: 0xA8
    GlobalNamespace::PlayerDataModel* playerDataModel;
    // private readonly SelectLevelCategoryViewController _selectLevelCategoryViewController
    // Offset: 0xB0
    GlobalNamespace::SelectLevelCategoryViewController* selectLevelCategoryViewController;
    // private readonly AnnotatedBeatmapLevelCollectionsViewController _annotatedBeatmapLevelCollectionsViewController
    // Offset: 0xB8
    GlobalNamespace::AnnotatedBeatmapLevelCollectionsViewController* annotatedBeatmapLevelCollectionsViewController;
    // private readonly LevelSearchViewController _levelSearchViewController
    // Offset: 0xC0
    GlobalNamespace::LevelSearchViewController* levelSearchViewController;
    // private readonly BeatmapLevelsModel _beatmapLevelsModel
    // Offset: 0xC8
    GlobalNamespace::BeatmapLevelsModel* beatmapLevelsModel;
    // private System.Action`4<LevelFilteringNavigationController,IAnnotatedBeatmapLevelCollection,UnityEngine.GameObject,BeatmapCharacteristicSO> didSelectAnnotatedBeatmapLevelCollectionEvent
    // Offset: 0xD0
    System::Action_4<GlobalNamespace::LevelFilteringNavigationController*, GlobalNamespace::IAnnotatedBeatmapLevelCollection*, UnityEngine::GameObject*, GlobalNamespace::BeatmapCharacteristicSO*>* didSelectAnnotatedBeatmapLevelCollectionEvent;
    // private System.Action`1<LevelFilteringNavigationController> didStartLoadingEvent
    // Offset: 0xD8
    System::Action_1<GlobalNamespace::LevelFilteringNavigationController*>* didStartLoadingEvent;
    // private System.Threading.CancellationTokenSource _cancellationTokenSource
    // Offset: 0xE0
    System::Threading::CancellationTokenSource* cancellationTokenSource;
    // private UnityEngine.GameObject _currentNoDataInfoPrefab
    // Offset: 0xE8
    UnityEngine::GameObject* currentNoDataInfoPrefab;
    // private System.String _levelPackIdToBeSelectedAfterPresent
    // Offset: 0xF0
    ::Il2CppString* levelPackIdToBeSelectedAfterPresent;
    // private System.Boolean _hidePacksIfOneOrNone
    // Offset: 0xF8
    bool hidePacksIfOneOrNone;
    // private System.Boolean _enableCustomLevels
    // Offset: 0xF9
    bool enableCustomLevels;
    // private SongPackMask _songPackMask
    // Offset: 0x100
    GlobalNamespace::SongPackMask songPackMask;
    // private SelectLevelCategoryViewController/LevelCategory[] _enabledLevelCategories
    // Offset: 0x110
    ::Array<GlobalNamespace::SelectLevelCategoryViewController::LevelCategory>* enabledLevelCategories;
    // private IBeatmapLevelPack[] _ostBeatmapLevelPacks
    // Offset: 0x118
    ::Array<GlobalNamespace::IBeatmapLevelPack*>* ostBeatmapLevelPacks;
    // private IBeatmapLevelPack[] _musicPacksBeatmapLevelPacks
    // Offset: 0x120
    ::Array<GlobalNamespace::IBeatmapLevelPack*>* musicPacksBeatmapLevelPacks;
    // private IBeatmapLevelPack[] _customLevelPacks
    // Offset: 0x128
    ::Array<GlobalNamespace::IBeatmapLevelPack*>* customLevelPacks;
    // private IBeatmapLevelPack[] _allBeatmapLevelPacks
    // Offset: 0x130
    ::Array<GlobalNamespace::IBeatmapLevelPack*>* allBeatmapLevelPacks;
    // public System.Void add_didSelectAnnotatedBeatmapLevelCollectionEvent(System.Action`4<LevelFilteringNavigationController,IAnnotatedBeatmapLevelCollection,UnityEngine.GameObject,BeatmapCharacteristicSO> value)
    // Offset: 0x1ABDAF8
    void add_didSelectAnnotatedBeatmapLevelCollectionEvent(System::Action_4<GlobalNamespace::LevelFilteringNavigationController*, GlobalNamespace::IAnnotatedBeatmapLevelCollection*, UnityEngine::GameObject*, GlobalNamespace::BeatmapCharacteristicSO*>* value);
    // public System.Void remove_didSelectAnnotatedBeatmapLevelCollectionEvent(System.Action`4<LevelFilteringNavigationController,IAnnotatedBeatmapLevelCollection,UnityEngine.GameObject,BeatmapCharacteristicSO> value)
    // Offset: 0x1ABDB9C
    void remove_didSelectAnnotatedBeatmapLevelCollectionEvent(System::Action_4<GlobalNamespace::LevelFilteringNavigationController*, GlobalNamespace::IAnnotatedBeatmapLevelCollection*, UnityEngine::GameObject*, GlobalNamespace::BeatmapCharacteristicSO*>* value);
    // public System.Void add_didStartLoadingEvent(System.Action`1<LevelFilteringNavigationController> value)
    // Offset: 0x1ABDC40
    void add_didStartLoadingEvent(System::Action_1<GlobalNamespace::LevelFilteringNavigationController*>* value);
    // public System.Void remove_didStartLoadingEvent(System.Action`1<LevelFilteringNavigationController> value)
    // Offset: 0x1ABDCE4
    void remove_didStartLoadingEvent(System::Action_1<GlobalNamespace::LevelFilteringNavigationController*>* value);
    // public IBeatmapLevelPack get_selectedBeatmapLevelPack()
    // Offset: 0x1ABDD88
    GlobalNamespace::IBeatmapLevelPack* get_selectedBeatmapLevelPack();
    // public SelectLevelCategoryViewController/LevelCategory get_selectedLevelCategory()
    // Offset: 0x1ABDDE8
    GlobalNamespace::SelectLevelCategoryViewController::LevelCategory get_selectedLevelCategory();
    // public System.Void Setup(SongPackMask songPackMask, IBeatmapLevelPack levelPackToBeSelectedAfterPresent, SelectLevelCategoryViewController/LevelCategory startLevelCategory, System.Boolean hidePacksIfOneOrNone, System.Boolean enableCustomLevels)
    // Offset: 0x1ABDE04
    void Setup(GlobalNamespace::SongPackMask songPackMask, GlobalNamespace::IBeatmapLevelPack* levelPackToBeSelectedAfterPresent, GlobalNamespace::SelectLevelCategoryViewController::LevelCategory startLevelCategory, bool hidePacksIfOneOrNone, bool enableCustomLevels);
    // private System.Void SetupBeatmapLevelPacks()
    // Offset: 0x1ABE080
    void SetupBeatmapLevelPacks();
    // private System.Void LevelSearchViewControllerDidStartLoading(LevelSearchViewController obj)
    // Offset: 0x1ABE9E8
    void LevelSearchViewControllerDidStartLoading(GlobalNamespace::LevelSearchViewController* obj);
    // private System.Void LevelSearchViewControllerDidFilterBeatmapLevelCollection(IAnnotatedBeatmapLevelCollection annotatedBeatmapLevelCollection, BeatmapCharacteristicSO preferredBeatmapCharacteristic)
    // Offset: 0x1ABEE08
    void LevelSearchViewControllerDidFilterBeatmapLevelCollection(GlobalNamespace::IAnnotatedBeatmapLevelCollection* annotatedBeatmapLevelCollection, GlobalNamespace::BeatmapCharacteristicSO* preferredBeatmapCharacteristic);
    // private System.Void SelectLevelCategoryViewControllerDidSelectLevelCategory(SelectLevelCategoryViewController viewController, SelectLevelCategoryViewController/LevelCategory levelCategory)
    // Offset: 0x1ABEE8C
    void SelectLevelCategoryViewControllerDidSelectLevelCategory(GlobalNamespace::SelectLevelCategoryViewController* viewController, GlobalNamespace::SelectLevelCategoryViewController::LevelCategory levelCategory);
    // private System.Void UpdateSecondChildControllerContent(SelectLevelCategoryViewController/LevelCategory levelCategory)
    // Offset: 0x1ABE3A8
    void UpdateSecondChildControllerContent(GlobalNamespace::SelectLevelCategoryViewController::LevelCategory levelCategory);
    // private System.Void ShowPacksInSecondChildController(System.Collections.Generic.IReadOnlyList`1<IBeatmapLevelPack> beatmapLevelPacks)
    // Offset: 0x1ABEE94
    void ShowPacksInSecondChildController(System::Collections::Generic::IReadOnlyList_1<GlobalNamespace::IBeatmapLevelPack*>* beatmapLevelPacks);
    // private System.Void ReplaceSecondViewController(HMUI.ViewController viewController)
    // Offset: 0x1ABF108
    void ReplaceSecondViewController(HMUI::ViewController* viewController);
    // private System.Void HandlePlayerDataFavoriteLevelsSetDidChange()
    // Offset: 0x1ABF298
    void HandlePlayerDataFavoriteLevelsSetDidChange();
    // private System.Void HandleIncreaseNumberOfGameplays()
    // Offset: 0x1ABF2F4
    void HandleIncreaseNumberOfGameplays();
    // private System.Void HandleAnnotatedBeatmapLevelCollectionsViewControllerDidSelectAnnotatedBeatmapLevelCollection(IAnnotatedBeatmapLevelCollection annotatedBeatmapLevelCollection)
    // Offset: 0x1ABF360
    void HandleAnnotatedBeatmapLevelCollectionsViewControllerDidSelectAnnotatedBeatmapLevelCollection(GlobalNamespace::IAnnotatedBeatmapLevelCollection* annotatedBeatmapLevelCollection);
    // public System.Void SelectAnnotatedBeatmapLevelCollection(IBeatmapLevelPack levelPack)
    // Offset: 0x1ABF3E0
    void SelectAnnotatedBeatmapLevelCollection(GlobalNamespace::IBeatmapLevelPack* levelPack);
    // private System.Void UpdateCustomSongs()
    // Offset: 0x1ABF1BC
    void UpdateCustomSongs();
    // private System.Boolean <SetupBeatmapLevelPacks>b__29_0(IBeatmapLevelPack pack)
    // Offset: 0x1ABF7F4
    bool $SetupBeatmapLevelPacks$b__29_0(GlobalNamespace::IBeatmapLevelPack* pack);
    // private System.Boolean <SetupBeatmapLevelPacks>b__29_1(IBeatmapLevelPack pack)
    // Offset: 0x1ABF8D4
    bool $SetupBeatmapLevelPacks$b__29_1(GlobalNamespace::IBeatmapLevelPack* pack);
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0x1ABE590
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // protected override System.Void DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    // Offset: 0x1ABEA4C
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    void DidDeactivate(bool removedFromHierarchy, bool screenSystemDisabling);
    // public System.Void .ctor()
    // Offset: 0x1ABF7EC
    // Implemented from: HMUI.NavigationController
    // Base method: System.Void NavigationController::.ctor()
    // Base method: System.Void ContainerViewController::.ctor()
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static LevelFilteringNavigationController* New_ctor();
  }; // LevelFilteringNavigationController
  check_size<sizeof(LevelFilteringNavigationController), 304 + sizeof(void*) + ((304 + sizeof(void*)) % 8 != 0 ? (8 - (304 + sizeof(void*)) % 8) : 0)> __GlobalNamespace_LevelFilteringNavigationControllerSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LevelFilteringNavigationController*, "", "LevelFilteringNavigationController");
#pragma pack(pop)
