// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HMUI.NavigationController
#include "HMUI/NavigationController.hpp"
// Including type: StandardLevelDetailViewController/ContentType
#include "GlobalNamespace/StandardLevelDetailViewController.hpp"
// Including type: BeatmapDifficultyMask
#include "GlobalNamespace/BeatmapDifficultyMask.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LoadingControl
  class LoadingControl;
  // Forward declaring type: LevelCollectionViewController
  class LevelCollectionViewController;
  // Forward declaring type: LevelPackDetailViewController
  class LevelPackDetailViewController;
  // Skipping declaration: StandardLevelDetailViewController because it is already included!
  // Forward declaring type: AppStaticSettingsSO
  class AppStaticSettingsSO;
  // Forward declaring type: IBeatmapLevelPack
  class IBeatmapLevelPack;
  // Forward declaring type: IBeatmapLevel
  class IBeatmapLevel;
  // Forward declaring type: IDifficultyBeatmap
  class IDifficultyBeatmap;
  // Forward declaring type: IPreviewBeatmapLevel
  class IPreviewBeatmapLevel;
  // Forward declaring type: BeatmapCharacteristicSO
  class BeatmapCharacteristicSO;
  // Forward declaring type: IAnnotatedBeatmapLevelCollection
  class IAnnotatedBeatmapLevelCollection;
  // Forward declaring type: IBeatmapLevelCollection
  class IBeatmapLevelCollection;
}
// Forward declaring namespace: Tweening
namespace Tweening {
  // Forward declaring type: TimeTweeningManager
  class TimeTweeningManager;
  // Forward declaring type: FloatTween
  class FloatTween;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Skipping declaration: ViewController because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: LevelCollectionNavigationController
  class LevelCollectionNavigationController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::LevelCollectionNavigationController);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::LevelCollectionNavigationController*, "", "LevelCollectionNavigationController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x138
  #pragma pack(push, 1)
  // Autogenerated type: LevelCollectionNavigationController
  // [TokenAttribute] Offset: FFFFFFFF
  class LevelCollectionNavigationController : public ::HMUI::NavigationController {
    public:
    // Writing base type padding for base size: 0x94 to desired offset: 0x98
    char ___base_padding[0x4] = {};
    // Nested type: ::GlobalNamespace::LevelCollectionNavigationController::AlphaAnimationType
    struct AlphaAnimationType;
    // Nested type: ::GlobalNamespace::LevelCollectionNavigationController::$$c__DisplayClass54_0
    class $$c__DisplayClass54_0;
    public:
    // private LoadingControl _loadingControl
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::LoadingControl* loadingControl;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LoadingControl*) == 0x8);
    // [InjectAttribute] Offset: 0x10EA88C
    // private readonly LevelCollectionViewController _levelCollectionViewController
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::LevelCollectionViewController* levelCollectionViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LevelCollectionViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x10EA89C
    // private readonly LevelPackDetailViewController _levelPackDetailViewController
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::LevelPackDetailViewController* levelPackDetailViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LevelPackDetailViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x10EA8AC
    // private readonly StandardLevelDetailViewController _levelDetailViewController
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::StandardLevelDetailViewController* levelDetailViewController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::StandardLevelDetailViewController*) == 0x8);
    // [InjectAttribute] Offset: 0x10EA8BC
    // private readonly AppStaticSettingsSO _appStaticSettings
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::AppStaticSettingsSO* appStaticSettings;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AppStaticSettingsSO*) == 0x8);
    // [InjectAttribute] Offset: 0x10EA8CC
    // private readonly Tweening.TimeTweeningManager _timeTweeningManager
    // Size: 0x8
    // Offset: 0xC0
    ::Tweening::TimeTweeningManager* timeTweeningManager;
    // Field size check
    static_assert(sizeof(::Tweening::TimeTweeningManager*) == 0x8);
    // private System.Action`2<LevelCollectionNavigationController,StandardLevelDetailViewController/ContentType> didChangeLevelDetailContentEvent
    // Size: 0x8
    // Offset: 0xC8
    ::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::StandardLevelDetailViewController::ContentType>* didChangeLevelDetailContentEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::StandardLevelDetailViewController::ContentType>*) == 0x8);
    // private System.Action`2<LevelCollectionNavigationController,IBeatmapLevelPack> didSelectLevelPackEvent
    // Size: 0x8
    // Offset: 0xD0
    ::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::IBeatmapLevelPack*>* didSelectLevelPackEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::IBeatmapLevelPack*>*) == 0x8);
    // private System.Action`1<LevelCollectionNavigationController> didPressActionButtonEvent
    // Size: 0x8
    // Offset: 0xD8
    ::System::Action_1<::GlobalNamespace::LevelCollectionNavigationController*>* didPressActionButtonEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::LevelCollectionNavigationController*>*) == 0x8);
    // private System.Action`2<LevelCollectionNavigationController,IBeatmapLevelPack> didPressOpenPackButtonEvent
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::IBeatmapLevelPack*>* didPressOpenPackButtonEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::IBeatmapLevelPack*>*) == 0x8);
    // private System.Action`2<LevelCollectionNavigationController,IBeatmapLevel> didPressPracticeButtonEvent
    // Size: 0x8
    // Offset: 0xE8
    ::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::IBeatmapLevel*>* didPressPracticeButtonEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::IBeatmapLevel*>*) == 0x8);
    // private System.Action`2<LevelCollectionNavigationController,IDifficultyBeatmap> didChangeDifficultyBeatmapEvent
    // Size: 0x8
    // Offset: 0xF0
    ::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::IDifficultyBeatmap*>* didChangeDifficultyBeatmapEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::LevelCollectionNavigationController*, ::GlobalNamespace::IDifficultyBeatmap*>*) == 0x8);
    // private System.Boolean _showPracticeButtonInDetailView
    // Size: 0x1
    // Offset: 0xF8
    bool showPracticeButtonInDetailView;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showPracticeButtonInDetailView and: actionButtonTextInDetailView
    char __padding12[0x7] = {};
    // private System.String _actionButtonTextInDetailView
    // Size: 0x8
    // Offset: 0x100
    ::StringW actionButtonTextInDetailView;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private IBeatmapLevelPack _levelPack
    // Size: 0x8
    // Offset: 0x108
    ::GlobalNamespace::IBeatmapLevelPack* levelPack;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IBeatmapLevelPack*) == 0x8);
    // private BeatmapDifficultyMask _allowedBeatmapDifficultyMask
    // Size: 0x1
    // Offset: 0x110
    ::GlobalNamespace::BeatmapDifficultyMask allowedBeatmapDifficultyMask;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapDifficultyMask) == 0x1);
    // Padding between fields: allowedBeatmapDifficultyMask and: beatmapLevelToBeSelectedAfterPresent
    char __padding15[0x7] = {};
    // private IPreviewBeatmapLevel _beatmapLevelToBeSelectedAfterPresent
    // Size: 0x8
    // Offset: 0x118
    ::GlobalNamespace::IPreviewBeatmapLevel* beatmapLevelToBeSelectedAfterPresent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IPreviewBeatmapLevel*) == 0x8);
    // private System.Boolean _loading
    // Size: 0x1
    // Offset: 0x120
    bool loading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _hideDetailViewController
    // Size: 0x1
    // Offset: 0x121
    bool hideDetailViewController;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hideDetailViewController and: notAllowedCharacteristics
    char __padding18[0x6] = {};
    // private BeatmapCharacteristicSO[] _notAllowedCharacteristics
    // Size: 0x8
    // Offset: 0x128
    ::ArrayW<::GlobalNamespace::BeatmapCharacteristicSO*> notAllowedCharacteristics;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::BeatmapCharacteristicSO*>) == 0x8);
    // private Tweening.FloatTween _floatTween
    // Size: 0x8
    // Offset: 0x130
    ::Tweening::FloatTween* floatTween;
    // Field size check
    static_assert(sizeof(::Tweening::FloatTween*) == 0x8);
    public:
    // Get instance field reference: private LoadingControl _loadingControl
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::LoadingControl*& dyn__loadingControl();
    // Get instance field reference: private readonly LevelCollectionViewController _levelCollectionViewController
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::LevelCollectionViewController*& dyn__levelCollectionViewController();
    // Get instance field reference: private readonly LevelPackDetailViewController _levelPackDetailViewController
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::LevelPackDetailViewController*& dyn__levelPackDetailViewController();
    // Get instance field reference: private readonly StandardLevelDetailViewController _levelDetailViewController
