// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HMUI.TableView/HMUI.IDataSource
#include "HMUI/TableView_IDataSource.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Skipping declaration: TableView because it is already included!
  // Forward declaring type: AlphabetScrollbar
  class AlphabetScrollbar;
  // Forward declaring type: TableCell
  class TableCell;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LevelListTableCell
  class LevelListTableCell;
  // Forward declaring type: LevelPackHeaderTableCell
  class LevelPackHeaderTableCell;
  // Forward declaring type: AdditionalContentModel
  class AdditionalContentModel;
  // Forward declaring type: IPreviewBeatmapLevel
  class IPreviewBeatmapLevel;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: LevelCollectionTableView
  class LevelCollectionTableView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(GlobalNamespace::LevelCollectionTableView);
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LevelCollectionTableView*, "", "LevelCollectionTableView");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: LevelCollectionTableView
  // [TokenAttribute] Offset: FFFFFFFF
  class LevelCollectionTableView : public UnityEngine::MonoBehaviour/*, public HMUI::TableView::IDataSource*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private HMUI.TableView _tableView
    // Size: 0x8
    // Offset: 0x18
    HMUI::TableView* tableView;
    // Field size check
    static_assert(sizeof(HMUI::TableView*) == 0x8);
    // private HMUI.AlphabetScrollbar _alphabetScrollbar
    // Size: 0x8
    // Offset: 0x20
    HMUI::AlphabetScrollbar* alphabetScrollbar;
    // Field size check
    static_assert(sizeof(HMUI::AlphabetScrollbar*) == 0x8);
    // private LevelListTableCell _levelCellPrefab
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::LevelListTableCell* levelCellPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LevelListTableCell*) == 0x8);
    // private System.String _levelCellsReuseIdentifier
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppString* levelCellsReuseIdentifier;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private LevelPackHeaderTableCell _packCellPrefab
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::LevelPackHeaderTableCell* packCellPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LevelPackHeaderTableCell*) == 0x8);
    // private System.String _packCellsReuseIdentifier
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* packCellsReuseIdentifier;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Single _cellHeight
    // Size: 0x4
    // Offset: 0x48
    float cellHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 _showAlphabetScrollbarLevelCountThreshold
    // Size: 0x4
    // Offset: 0x4C
    int showAlphabetScrollbarLevelCountThreshold;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [InjectAttribute] Offset: 0xF485D8
    // private AdditionalContentModel _additionalContentModel
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::AdditionalContentModel* additionalContentModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AdditionalContentModel*) == 0x8);
    // private System.Action`2<LevelCollectionTableView,IPreviewBeatmapLevel> didSelectLevelEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action_2<GlobalNamespace::LevelCollectionTableView*, GlobalNamespace::IPreviewBeatmapLevel*>* didSelectLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::LevelCollectionTableView*, GlobalNamespace::IPreviewBeatmapLevel*>*) == 0x8);
    // private System.Action`1<LevelCollectionTableView> didSelectHeaderEvent
    // Size: 0x8
    // Offset: 0x60
    System::Action_1<GlobalNamespace::LevelCollectionTableView*>* didSelectHeaderEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::LevelCollectionTableView*>*) == 0x8);
    // private System.Boolean _isInitialized
    // Size: 0x1
    // Offset: 0x68
    bool isInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isInitialized and: previewBeatmapLevels
    char __padding11[0x7] = {};
    // private IPreviewBeatmapLevel[] _previewBeatmapLevels
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<GlobalNamespace::IPreviewBeatmapLevel*> previewBeatmapLevels;
    // Field size check
    static_assert(sizeof(::ArrayW<GlobalNamespace::IPreviewBeatmapLevel*>) == 0x8);
    // private UnityEngine.Sprite _headerSprite
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::Sprite* headerSprite;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // private System.String _headerText
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppString* headerText;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean _showLevelPackHeader
    // Size: 0x1
    // Offset: 0x88
    bool showLevelPackHeader;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showLevelPackHeader and: favoriteLevelIds
    char __padding15[0x7] = {};
    // private System.Collections.Generic.HashSet`1<System.String> _favoriteLevelIds
    // Size: 0x8
    // Offset: 0x90
    System::Collections::Generic::HashSet_1<::Il2CppString*>* favoriteLevelIds;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<::Il2CppString*>*) == 0x8);
    // private System.Int32 _selectedRow
    // Size: 0x4
    // Offset: 0x98
    int selectedRow;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: selectedRow and: selectedPreviewBeatmapLevel
    char __padding17[0x4] = {};
    // private IPreviewBeatmapLevel _selectedPreviewBeatmapLevel
    // Size: 0x8
    // Offset: 0xA0
    GlobalNamespace::IPreviewBeatmapLevel* selectedPreviewBeatmapLevel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IPreviewBeatmapLevel*) == 0x8);
    public:
    // Creating interface conversion operator: operator HMUI::TableView::IDataSource
    operator HMUI::TableView::IDataSource() noexcept {
      return *reinterpret_cast<HMUI::TableView::IDataSource*>(this);
    }
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: private HMUI.TableView _tableView
    HMUI::TableView*& dyn__tableView();
    // Get instance field reference: private HMUI.AlphabetScrollbar _alphabetScrollbar
    HMUI::AlphabetScrollbar*& dyn__alphabetScrollbar();
    // Get instance field reference: private LevelListTableCell _levelCellPrefab
    GlobalNamespace::LevelListTableCell*& dyn__levelCellPrefab();
