// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: ILevelGameplaySetupData
#include "GlobalNamespace/ILevelGameplaySetupData.hpp"
// Including type: BeatmapDifficulty
#include "GlobalNamespace/BeatmapDifficulty.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: IPreviewBeatmapLevel
  class IPreviewBeatmapLevel;
  // Forward declaring type: BeatmapCharacteristicSO
  class BeatmapCharacteristicSO;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: LevelGameplaySetupData
  // [] Offset: FFFFFFFF
  class LevelGameplaySetupData : public ::Il2CppObject/*, public GlobalNamespace::ILevelGameplaySetupData*/ {
    public:
    // private GameplayModifiers _gameplayModifiers
    // Size: 0x8
    // Offset: 0x10
    GlobalNamespace::GameplayModifiers* gameplayModifiers;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameplayModifiers*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD2124C
    // private IPreviewBeatmapLevel <beatmapLevel>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::IPreviewBeatmapLevel* beatmapLevel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IPreviewBeatmapLevel*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD2125C
    // private BeatmapCharacteristicSO <beatmapCharacteristic>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::BeatmapCharacteristicSO* beatmapCharacteristic;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapCharacteristicSO*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD2126C
    // private BeatmapDifficulty <beatmapDifficulty>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    GlobalNamespace::BeatmapDifficulty beatmapDifficulty;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapDifficulty) == 0x4);
    // Creating value type constructor for type: LevelGameplaySetupData
    LevelGameplaySetupData(GlobalNamespace::GameplayModifiers* gameplayModifiers_ = {}, GlobalNamespace::IPreviewBeatmapLevel* beatmapLevel_ = {}, GlobalNamespace::BeatmapCharacteristicSO* beatmapCharacteristic_ = {}, GlobalNamespace::BeatmapDifficulty beatmapDifficulty_ = {}) noexcept : gameplayModifiers{gameplayModifiers_}, beatmapLevel{beatmapLevel_}, beatmapCharacteristic{beatmapCharacteristic_}, beatmapDifficulty{beatmapDifficulty_} {}
    // Creating interface conversion operator: operator GlobalNamespace::ILevelGameplaySetupData
    operator GlobalNamespace::ILevelGameplaySetupData() noexcept {
      return *reinterpret_cast<GlobalNamespace::ILevelGameplaySetupData*>(this);
    }
    // public IPreviewBeatmapLevel get_beatmapLevel()
    // Offset: 0x1096840
    GlobalNamespace::IPreviewBeatmapLevel* get_beatmapLevel_NEW();
    // public System.Void set_beatmapLevel(IPreviewBeatmapLevel value)
    // Offset: 0x1096848
    void set_beatmapLevel_NEW(GlobalNamespace::IPreviewBeatmapLevel* value);
    // public BeatmapCharacteristicSO get_beatmapCharacteristic()
    // Offset: 0x1096850
    GlobalNamespace::BeatmapCharacteristicSO* get_beatmapCharacteristic_NEW();
    // public System.Void set_beatmapCharacteristic(BeatmapCharacteristicSO value)
    // Offset: 0x1096858
    void set_beatmapCharacteristic_NEW(GlobalNamespace::BeatmapCharacteristicSO* value);
    // public BeatmapDifficulty get_beatmapDifficulty()
    // Offset: 0x1096860
    GlobalNamespace::BeatmapDifficulty get_beatmapDifficulty_NEW();
    // public System.Void set_beatmapDifficulty(BeatmapDifficulty value)
    // Offset: 0x1096868
    void set_beatmapDifficulty_NEW(GlobalNamespace::BeatmapDifficulty value);
    // public GameplayModifiers get_gameplayModifiers()
    // Offset: 0x1096870
    GlobalNamespace::GameplayModifiers* get_gameplayModifiers_NEW();
    // public System.Void set_gameplayModifiers(GameplayModifiers value)
    // Offset: 0x10968DC
    void set_gameplayModifiers_NEW(GlobalNamespace::GameplayModifiers* value);
    // public System.Void .ctor()
    // Offset: 0x10968E4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LevelGameplaySetupData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::LevelGameplaySetupData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LevelGameplaySetupData*, creationType>()));
    }
  }; // LevelGameplaySetupData
  #pragma pack(pop)
  static check_size<sizeof(LevelGameplaySetupData), 40 + sizeof(GlobalNamespace::BeatmapDifficulty)> __GlobalNamespace_LevelGameplaySetupDataSizeCheck;
  static_assert(sizeof(LevelGameplaySetupData) == 0x2C);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LevelGameplaySetupData*, "", "LevelGameplaySetupData");
