// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: BeatmapDifficultyMask
#include "GlobalNamespace/BeatmapDifficultyMask.hpp"
// Including type: SongPackMask
#include "GlobalNamespace/SongPackMask.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatmapCharacteristicSO
  class BeatmapCharacteristicSO;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: LevelFilterParams
  // [TokenAttribute] Offset: FFFFFFFF
  class LevelFilterParams : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private System.Boolean <filterByLevelIds>k__BackingField
    // Size: 0x1
    // Offset: 0x10
    bool filterByLevelIds;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: filterByLevelIds and: beatmapLevelIds
    char __padding0[0x7] = {};
    // private System.Collections.Generic.HashSet`1<System.String> <beatmapLevelIds>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    System::Collections::Generic::HashSet_1<::Il2CppString*>* beatmapLevelIds;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<::Il2CppString*>*) == 0x8);
    // private System.Boolean <filterByOwned>k__BackingField
    // Size: 0x1
    // Offset: 0x20
    bool filterByOwned;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: filterByOwned and: searchText
    char __padding2[0x7] = {};
    // private System.String <searchText>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* searchText;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean <filterByDifficulty>k__BackingField
    // Size: 0x1
    // Offset: 0x30
    bool filterByDifficulty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private BeatmapDifficultyMask <filteredDifficulty>k__BackingField
    // Size: 0x1
    // Offset: 0x31
    GlobalNamespace::BeatmapDifficultyMask filteredDifficulty;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapDifficultyMask) == 0x1);
    // private System.Boolean <filterBySongPacks>k__BackingField
    // Size: 0x1
    // Offset: 0x32
    bool filterBySongPacks;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: filterBySongPacks and: filteredSongPacks
    char __padding6[0x5] = {};
    // private SongPackMask <filteredSongPacks>k__BackingField
    // Size: 0x10
    // Offset: 0x38
    GlobalNamespace::SongPackMask filteredSongPacks;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SongPackMask) == 0x10);
    // private System.Boolean <filterByCharacteristic>k__BackingField
    // Size: 0x1
    // Offset: 0x48
    bool filterByCharacteristic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: filterByCharacteristic and: filteredCharacteristic
    char __padding8[0x7] = {};
    // private BeatmapCharacteristicSO <filteredCharacteristic>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::BeatmapCharacteristicSO* filteredCharacteristic;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapCharacteristicSO*) == 0x8);
    // private System.Boolean <filterByNotPlayedYet>k__BackingField
    // Size: 0x1
    // Offset: 0x58
    bool filterByNotPlayedYet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <filterByMinBpm>k__BackingField
    // Size: 0x1
    // Offset: 0x59
    bool filterByMinBpm;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: filterByMinBpm and: filteredMinBpm
    char __padding11[0x2] = {};
    // private System.Single <filteredMinBpm>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    float filteredMinBpm;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <filterByMaxBpm>k__BackingField
    // Size: 0x1
    // Offset: 0x60
    bool filterByMaxBpm;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: filterByMaxBpm and: filteredMaxBpm
    char __padding13[0x3] = {};
    // private System.Single <filteredMaxBpm>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    float filteredMaxBpm;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // [DoesNotRequireDomainReloadInitAttribute] Offset: 0xF01E0C
    // Get static field: static public readonly System.Single[] bpmValues
    static ::ArrayW<float> _get_bpmValues();
    // Set static field: static public readonly System.Single[] bpmValues
    static void _set_bpmValues(::ArrayW<float> value);
    // Get instance field reference: private System.Boolean <filterByLevelIds>k__BackingField
    bool& dyn_$filterByLevelIds$k__BackingField();
    // Get instance field reference: private System.Collections.Generic.HashSet`1<System.String> <beatmapLevelIds>k__BackingField
    System::Collections::Generic::HashSet_1<::Il2CppString*>*& dyn_$beatmapLevelIds$k__BackingField();
    // Get instance field reference: private System.Boolean <filterByOwned>k__BackingField
    bool& dyn_$filterByOwned$k__BackingField();
