// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HMUI.TableView/HMUI.IDataSource
#include "HMUI/TableView_IDataSource.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Skipping declaration: TableView because it is already included!
  // Forward declaring type: AlphabetScrollbar
  class AlphabetScrollbar;
  // Forward declaring type: TableCell
  class TableCell;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LevelListTableCell
  class LevelListTableCell;
  // Forward declaring type: LevelPackHeaderTableCell
  class LevelPackHeaderTableCell;
  // Forward declaring type: AdditionalContentModel
  class AdditionalContentModel;
  // Forward declaring type: BeatmapLevelsPromoDataSO
  class BeatmapLevelsPromoDataSO;
  // Forward declaring type: IPreviewBeatmapLevel
  class IPreviewBeatmapLevel;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: LevelCollectionTableView
  class LevelCollectionTableView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::LevelCollectionTableView);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::LevelCollectionTableView*, "", "LevelCollectionTableView");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: LevelCollectionTableView
  // [TokenAttribute] Offset: FFFFFFFF
  class LevelCollectionTableView : public ::UnityEngine::MonoBehaviour/*, public ::HMUI::TableView::IDataSource*/ {
    public:
    public:
    // private HMUI.TableView _tableView
    // Size: 0x8
    // Offset: 0x18
    ::HMUI::TableView* tableView;
    // Field size check
    static_assert(sizeof(::HMUI::TableView*) == 0x8);
    // private HMUI.AlphabetScrollbar _alphabetScrollbar
    // Size: 0x8
    // Offset: 0x20
    ::HMUI::AlphabetScrollbar* alphabetScrollbar;
    // Field size check
    static_assert(sizeof(::HMUI::AlphabetScrollbar*) == 0x8);
    // private LevelListTableCell _levelCellPrefab
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::LevelListTableCell* levelCellPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LevelListTableCell*) == 0x8);
    // private System.String _levelCellsReuseIdentifier
    // Size: 0x8
    // Offset: 0x30
    ::StringW levelCellsReuseIdentifier;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private LevelPackHeaderTableCell _packCellPrefab
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::LevelPackHeaderTableCell* packCellPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LevelPackHeaderTableCell*) == 0x8);
    // private System.String _packCellsReuseIdentifier
    // Size: 0x8
    // Offset: 0x40
    ::StringW packCellsReuseIdentifier;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single _cellHeight
    // Size: 0x4
    // Offset: 0x48
    float cellHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 _showAlphabetScrollbarLevelCountThreshold
    // Size: 0x4
    // Offset: 0x4C
    int showAlphabetScrollbarLevelCountThreshold;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [InjectAttribute] Offset: 0x1132418
    // private readonly AdditionalContentModel _additionalContentModel
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::AdditionalContentModel* additionalContentModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AdditionalContentModel*) == 0x8);
    // [InjectAttribute] Offset: 0x1132428
    // private readonly BeatmapLevelsPromoDataSO _beatmapLevelsPromoData
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::BeatmapLevelsPromoDataSO* beatmapLevelsPromoData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapLevelsPromoDataSO*) == 0x8);
    // private System.Action`2<LevelCollectionTableView,IPreviewBeatmapLevel> didSelectLevelEvent
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_2<::GlobalNamespace::LevelCollectionTableView*, ::GlobalNamespace::IPreviewBeatmapLevel*>* didSelectLevelEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::LevelCollectionTableView*, ::GlobalNamespace::IPreviewBeatmapLevel*>*) == 0x8);
    // private System.Action`1<LevelCollectionTableView> didSelectHeaderEvent
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_1<::GlobalNamespace::LevelCollectionTableView*>* didSelectHeaderEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::LevelCollectionTableView*>*) == 0x8);
    // private System.Boolean _isInitialized
    // Size: 0x1
    // Offset: 0x70
    bool isInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isInitialized and: previewBeatmapLevels
    char __padding12[0x7] = {};
    // private System.Collections.Generic.IReadOnlyList`1<IPreviewBeatmapLevel> _previewBeatmapLevels
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::IReadOnlyList_1<::GlobalNamespace::IPreviewBeatmapLevel*>* previewBeatmapLevels;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IReadOnlyList_1<::GlobalNamespace::IPreviewBeatmapLevel*>*) == 0x8);
    // private UnityEngine.Sprite _headerSprite
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Sprite* headerSprite;
    // Field size check
    static_assert(sizeof(::UnityEngine::Sprite*) == 0x8);
    // private System.String _headerText
    // Size: 0x8
    // Offset: 0x88
    ::StringW headerText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _showLevelPackHeader
    // Size: 0x1
    // Offset: 0x90
    bool showLevelPackHeader;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showLevelPackHeader and: favoriteLevelIds
    char __padding16[0x7] = {};
    // private System.Collections.Generic.HashSet`1<System.String> _favoriteLevelIds
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::HashSet_1<::StringW>* favoriteLevelIds;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::StringW>*) == 0x8);
    // private System.Int32 _selectedRow
    // Size: 0x4
    // Offset: 0xA0
    int selectedRow;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: selectedRow and: selectedPreviewBeatmapLevel
    char __padding18[0x4] = {};
    // private IPreviewBeatmapLevel _selectedPreviewBeatmapLevel
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::IPreviewBeatmapLevel* selectedPreviewBeatmapLevel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IPreviewBeatmapLevel*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::HMUI::TableView::IDataSource
    operator ::HMUI::TableView::IDataSource() noexcept {
      return *reinterpret_cast<::HMUI::TableView::IDataSource*>(this);
    }
    // Creating interface conversion operator: i_IDataSource
    inline ::HMUI::TableView::IDataSource* i_IDataSource() noexcept {
      return reinterpret_cast<::HMUI::TableView::IDataSource*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private HMUI.TableView _tableView
    [[deprecated("Use field access instead!")]] ::HMUI::TableView*& dyn__tableView();
