// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: BeatmapEventType
#include "GlobalNamespace/BeatmapEventType.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ColorSO
  class ColorSO;
  // Forward declaring type: BeatmapObjectCallbackController
  class BeatmapObjectCallbackController;
  // Forward declaring type: LightWithIdManager
  class LightWithIdManager;
  // Forward declaring type: BeatmapEventData
  class BeatmapEventData;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: LightSwitchEventEffect
  class LightSwitchEventEffect : public UnityEngine::MonoBehaviour {
    public:
    // private ColorSO _lightColor0
    // Offset: 0x18
    GlobalNamespace::ColorSO* lightColor0;
    // private ColorSO _lightColor1
    // Offset: 0x20
    GlobalNamespace::ColorSO* lightColor1;
    // private ColorSO _highlightColor0
    // Offset: 0x28
    GlobalNamespace::ColorSO* highlightColor0;
    // private ColorSO _highlightColor1
    // Offset: 0x30
    GlobalNamespace::ColorSO* highlightColor1;
    // private ColorSO _lightColor0Boost
    // Offset: 0x38
    GlobalNamespace::ColorSO* lightColor0Boost;
    // private ColorSO _lightColor1Boost
    // Offset: 0x40
    GlobalNamespace::ColorSO* lightColor1Boost;
    // private ColorSO _highlightColor0Boost
    // Offset: 0x48
    GlobalNamespace::ColorSO* highlightColor0Boost;
    // private ColorSO _highlightColor1Boost
    // Offset: 0x50
    GlobalNamespace::ColorSO* highlightColor1Boost;
    // private System.Single _offColorIntensity
    // Offset: 0x58
    float offColorIntensity;
    // private System.Boolean _lightOnStart
    // Offset: 0x5C
    bool lightOnStart;
    // private System.Int32 _lightsID
    // Offset: 0x60
    int lightsID;
    // private BeatmapEventType _event
    // Offset: 0x64
    GlobalNamespace::BeatmapEventType event;
    // private BeatmapEventType _colorBoostEvent
    // Offset: 0x68
    GlobalNamespace::BeatmapEventType colorBoostEvent;
    // private BeatmapObjectCallbackController _beatmapObjectCallbackController
    // Offset: 0x70
    GlobalNamespace::BeatmapObjectCallbackController* beatmapObjectCallbackController;
    // private LightWithIdManager _lightManager
    // Offset: 0x78
    GlobalNamespace::LightWithIdManager* lightManager;
    // private System.Boolean _lightIsOn
    // Offset: 0x80
    bool lightIsOn;
    // private UnityEngine.Color _offColor
    // Offset: 0x84
    UnityEngine::Color offColor;
    // private System.Single _highlightValue
    // Offset: 0x94
    float highlightValue;
    // private UnityEngine.Color _afterHighlightColor
    // Offset: 0x98
    UnityEngine::Color afterHighlightColor;
    // private UnityEngine.Color _highlightColor
    // Offset: 0xA8
    UnityEngine::Color highlightColor;
    // private System.Single kFadeSpeed
    // Offset: 0xB8
    float kFadeSpeed;
    // private System.Boolean _initialized
    // Offset: 0xBC
    bool initialized;
    // private System.Boolean _colorBoost
    // Offset: 0xBD
    bool colorBoost;
    // private System.Int32 _prevLightSwitchBeatmapEventDataValue
    // Offset: 0xC0
    int prevLightSwitchBeatmapEventDataValue;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Int32 get_LightsID()
    // Offset: 0xBFA6DC
    int get_LightsID();
    // protected System.Void Start()
    // Offset: 0xBFA6E4
    void Start();
    // private System.Void OnDestroy()
    // Offset: 0xBFA778
    void OnDestroy();
    // protected System.Void Update()
    // Offset: 0xBFA850
    void Update();
    // private System.Void HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger(BeatmapEventData beatmapEventData)
    // Offset: 0xBFA9F8
    void HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger(GlobalNamespace::BeatmapEventData* beatmapEventData);
    // private System.Void ProcessLightSwitchEvent(System.Int32 beatmapEventDataValue, System.Boolean updateColorsOnly)
    // Offset: 0xBFAA80
    void ProcessLightSwitchEvent(int beatmapEventDataValue, bool updateColorsOnly);
    // private UnityEngine.Color GetNormalColor(System.Int32 beatmapEventValue)
    // Offset: 0xBFAC4C
    UnityEngine::Color GetNormalColor(int beatmapEventValue);
    // private UnityEngine.Color GetHighlightColor(System.Int32 beatmapEventValue)
    // Offset: 0xBFACA8
    UnityEngine::Color GetHighlightColor(int beatmapEventValue);
    // private System.Void SetColor(UnityEngine.Color color)
    // Offset: 0xBFA9D4
    void SetColor(UnityEngine::Color color);
    // public System.Void .ctor()
    // Offset: 0xBFAD04
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static LightSwitchEventEffect* New_ctor();
  }; // LightSwitchEventEffect
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LightSwitchEventEffect*, "", "LightSwitchEventEffect");
#pragma pack(pop)
