// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: PersistentScriptableObject
#include "GlobalNamespace/PersistentScriptableObject.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Boolean
#include "System/Boolean.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BloomPrePassEffectSO
  class BloomPrePassEffectSO;
  // Forward declaring type: MainEffectSO
  class MainEffectSO;
  // Forward declaring type: MainSettingsModelSO
  class MainSettingsModelSO;
  // Forward declaring type: MirrorRendererGraphicsSettingsPresets
  class MirrorRendererGraphicsSettingsPresets;
  // Forward declaring type: MainEffectGraphicsSettingsPresetsSO
  class MainEffectGraphicsSettingsPresetsSO;
  // Forward declaring type: BloomPrePassGraphicsSettingsPresetsSO
  class BloomPrePassGraphicsSettingsPresetsSO;
  // Forward declaring type: MirrorRendererSO
  class MirrorRendererSO;
  // Forward declaring type: MainEffectContainerSO
  class MainEffectContainerSO;
  // Forward declaring type: BloomPrePassEffectContainerSO
  class BloomPrePassEffectContainerSO;
  // Forward declaring type: BakedLightDataLoader
  class BakedLightDataLoader;
  // Forward declaring type: BakedReflectionProbe
  class BakedReflectionProbe;
  // Forward declaring type: LightmapLightWithIds
  class LightmapLightWithIds;
  // Forward declaring type: FakeMirrorObjectsInstaller
  class FakeMirrorObjectsInstaller;
  // Forward declaring type: FakeMirrorSettings
  class FakeMirrorSettings;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: LightBakingPersistentSettingsSO
  // [TokenAttribute] Offset: FFFFFFFF
  class LightBakingPersistentSettingsSO : public GlobalNamespace::PersistentScriptableObject {
    public:
    // private System.Int32 _reflectionsCount
    // Size: 0x4
    // Offset: 0x18
    int reflectionsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: reflectionsCount and: bloomPrePassEffectToneMappingOff
    char __padding0[0x4] = {};
    // [SpaceAttribute] Offset: 0xE4AE60
    // private BloomPrePassEffectSO _bloomPrePassEffectToneMappingOff
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::BloomPrePassEffectSO* bloomPrePassEffectToneMappingOff;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BloomPrePassEffectSO*) == 0x8);
    // private MainEffectSO _mainEffectForBaking
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::MainEffectSO* mainEffectForBaking;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MainEffectSO*) == 0x8);
    // [SpaceAttribute] Offset: 0xE4AEA8
    // private System.Single _colorFromSchemeAlpha
    // Size: 0x4
    // Offset: 0x30
    float colorFromSchemeAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: colorFromSchemeAlpha and: bakedLightEditorColors
    char __padding3[0x4] = {};
    // private UnityEngine.Color[] _bakedLightEditorColors
    // Size: 0x8
    // Offset: 0x38
    ::Array<UnityEngine::Color>* bakedLightEditorColors;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Color>*) == 0x8);
    // [SpaceAttribute] Offset: 0xE4AEF0
    // private MainSettingsModelSO _mainSettingsModel
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::MainSettingsModelSO* mainSettingsModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MainSettingsModelSO*) == 0x8);
    // private MirrorRendererGraphicsSettingsPresets _mirrorRendererGraphicsSettingsPresets
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::MirrorRendererGraphicsSettingsPresets* mirrorRendererGraphicsSettingsPresets;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MirrorRendererGraphicsSettingsPresets*) == 0x8);
    // private MainEffectGraphicsSettingsPresetsSO _mainEffectGraphicsSettingsPresets
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::MainEffectGraphicsSettingsPresetsSO* mainEffectGraphicsSettingsPresets;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MainEffectGraphicsSettingsPresetsSO*) == 0x8);
    // private BloomPrePassGraphicsSettingsPresetsSO _bloomPrePassGraphicsSettingsPresets
    // Size: 0x8
    // Offset: 0x58
    GlobalNamespace::BloomPrePassGraphicsSettingsPresetsSO* bloomPrePassGraphicsSettingsPresets;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BloomPrePassGraphicsSettingsPresetsSO*) == 0x8);
    // private MirrorRendererSO _mirrorRenderer
    // Size: 0x8
    // Offset: 0x60
    GlobalNamespace::MirrorRendererSO* mirrorRenderer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MirrorRendererSO*) == 0x8);
    // private MainEffectContainerSO _mainEffectContainer
    // Size: 0x8
    // Offset: 0x68
    GlobalNamespace::MainEffectContainerSO* mainEffectContainer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MainEffectContainerSO*) == 0x8);
    // private BloomPrePassEffectContainerSO _bloomPrePassEffectContainer
    // Size: 0x8
    // Offset: 0x70
    GlobalNamespace::BloomPrePassEffectContainerSO* bloomPrePassEffectContainer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BloomPrePassEffectContainerSO*) == 0x8);
    // [SpaceAttribute] Offset: 0xE4AF88
    // private BakedLightDataLoader _bakedLightDataLoaderPrefab
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::BakedLightDataLoader* bakedLightDataLoaderPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BakedLightDataLoader*) == 0x8);
    // private BakedReflectionProbe _bakedReflectionProbePrefab
    // Size: 0x8
    // Offset: 0x80
    GlobalNamespace::BakedReflectionProbe* bakedReflectionProbePrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BakedReflectionProbe*) == 0x8);
    // private LightmapLightWithIds _lightmapLightWithIds
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::LightmapLightWithIds* lightmapLightWithIds;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LightmapLightWithIds*) == 0x8);
    // private FakeMirrorObjectsInstaller _fakeMirrorObjectsInstallerPrefab
    // Size: 0x8
    // Offset: 0x90
    GlobalNamespace::FakeMirrorObjectsInstaller* fakeMirrorObjectsInstallerPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FakeMirrorObjectsInstaller*) == 0x8);
    // private FakeMirrorSettings _fakeMirrorSettingsPrefab
    // Size: 0x8
    // Offset: 0x98
    GlobalNamespace::FakeMirrorSettings* fakeMirrorSettingsPrefab;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FakeMirrorSettings*) == 0x8);
    // private UnityEngine.Material _defaultDepthOnlyWriteMaterialForFakeMirror
    // Size: 0x8
    // Offset: 0xA0
    UnityEngine::Material* defaultDepthOnlyWriteMaterialForFakeMirror;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // Creating value type constructor for type: LightBakingPersistentSettingsSO
