// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: IConnectionManager
#include "GlobalNamespace/IConnectionManager.hpp"
// Including type: LiteNetLib.INetEventListener
#include "LiteNetLib/INetEventListener.hpp"
// Including type: IUnconnectedSenderReceiver
#include "GlobalNamespace/IUnconnectedSenderReceiver.hpp"
// Including type: System.Int64
#include "System/Int64.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource

  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataReader
  class NetDataReader;
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
}
// Forward declaring namespace: MasterServer
namespace MasterServer {
  // Forward declaring type: ITimeProvider
  class ITimeProvider;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: SocketError
  struct SocketError;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD8
  #pragma pack(push, 1)
  // Autogenerated type: LiteNetLibConnectionManager
  class LiteNetLibConnectionManager : public ::Il2CppObject/*, public GlobalNamespace::IConnectionManager, public LiteNetLib::INetEventListener, public GlobalNamespace::IUnconnectedSenderReceiver*/ {
    public:
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::NetworkMode
    struct NetworkMode;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::ConnectionState
    struct ConnectionState;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::LiteNetLibConnectionParamsBase
    class LiteNetLibConnectionParamsBase;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::StartServerParams
    class StartServerParams;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::StartRelayParams
    class StartRelayParams;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::StartClientParams
    class StartClientParams;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::ConnectToServerParams
    class ConnectToServerParams;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::NetPeerConnectionRequest
    class NetPeerConnectionRequest;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::NetPeerConnection
    class NetPeerConnection;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::StatisticsUpdated
    class StatisticsUpdated;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::$$c
    class $$c;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::$BackgroundDisconnectSentry$d__129
    struct $BackgroundDisconnectSentry$d__129;
    // Nested type: GlobalNamespace::LiteNetLibConnectionManager::$BackgroundShutdownSentry$d__130
    struct $BackgroundShutdownSentry$d__130;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: LiteNetLibConnectionManager/NetworkMode
    struct NetworkMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: NetworkMode
      constexpr NetworkMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public LiteNetLibConnectionManager/NetworkMode None
      static constexpr const int None = 0;
      // Get static field: static public LiteNetLibConnectionManager/NetworkMode None
      static GlobalNamespace::LiteNetLibConnectionManager::NetworkMode _get_None();
      // Set static field: static public LiteNetLibConnectionManager/NetworkMode None
      static void _set_None(GlobalNamespace::LiteNetLibConnectionManager::NetworkMode value);
      // static field const value: static public LiteNetLibConnectionManager/NetworkMode Client
      static constexpr const int Client = 1;
      // Get static field: static public LiteNetLibConnectionManager/NetworkMode Client
      static GlobalNamespace::LiteNetLibConnectionManager::NetworkMode _get_Client();
      // Set static field: static public LiteNetLibConnectionManager/NetworkMode Client
      static void _set_Client(GlobalNamespace::LiteNetLibConnectionManager::NetworkMode value);
      // static field const value: static public LiteNetLibConnectionManager/NetworkMode Server
      static constexpr const int Server = 2;
      // Get static field: static public LiteNetLibConnectionManager/NetworkMode Server
      static GlobalNamespace::LiteNetLibConnectionManager::NetworkMode _get_Server();
      // Set static field: static public LiteNetLibConnectionManager/NetworkMode Server
      static void _set_Server(GlobalNamespace::LiteNetLibConnectionManager::NetworkMode value);
      // static field const value: static public LiteNetLibConnectionManager/NetworkMode Relay
      static constexpr const int Relay = 3;
      // Get static field: static public LiteNetLibConnectionManager/NetworkMode Relay
      static GlobalNamespace::LiteNetLibConnectionManager::NetworkMode _get_Relay();
      // Set static field: static public LiteNetLibConnectionManager/NetworkMode Relay
      static void _set_Relay(GlobalNamespace::LiteNetLibConnectionManager::NetworkMode value);
    }; // LiteNetLibConnectionManager/NetworkMode
    #pragma pack(pop)
    static check_size<sizeof(LiteNetLibConnectionManager::NetworkMode), 0 + sizeof(int)> __GlobalNamespace_LiteNetLibConnectionManager_NetworkModeSizeCheck;
    static_assert(sizeof(LiteNetLibConnectionManager::NetworkMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: LiteNetLibConnectionManager/ConnectionState
    struct ConnectionState/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ConnectionState
      constexpr ConnectionState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public LiteNetLibConnectionManager/ConnectionState Unconnected
      static constexpr const int Unconnected = 0;
      // Get static field: static public LiteNetLibConnectionManager/ConnectionState Unconnected
      static GlobalNamespace::LiteNetLibConnectionManager::ConnectionState _get_Unconnected();
      // Set static field: static public LiteNetLibConnectionManager/ConnectionState Unconnected
      static void _set_Unconnected(GlobalNamespace::LiteNetLibConnectionManager::ConnectionState value);
      // static field const value: static public LiteNetLibConnectionManager/ConnectionState Connecting
      static constexpr const int Connecting = 1;
      // Get static field: static public LiteNetLibConnectionManager/ConnectionState Connecting
      static GlobalNamespace::LiteNetLibConnectionManager::ConnectionState _get_Connecting();
      // Set static field: static public LiteNetLibConnectionManager/ConnectionState Connecting
      static void _set_Connecting(GlobalNamespace::LiteNetLibConnectionManager::ConnectionState value);
      // static field const value: static public LiteNetLibConnectionManager/ConnectionState Connected
      static constexpr const int Connected = 2;
      // Get static field: static public LiteNetLibConnectionManager/ConnectionState Connected
      static GlobalNamespace::LiteNetLibConnectionManager::ConnectionState _get_Connected();
      // Set static field: static public LiteNetLibConnectionManager/ConnectionState Connected
      static void _set_Connected(GlobalNamespace::LiteNetLibConnectionManager::ConnectionState value);
      // static field const value: static public LiteNetLibConnectionManager/ConnectionState Disconnecting
      static constexpr const int Disconnecting = 3;
      // Get static field: static public LiteNetLibConnectionManager/ConnectionState Disconnecting
      static GlobalNamespace::LiteNetLibConnectionManager::ConnectionState _get_Disconnecting();
      // Set static field: static public LiteNetLibConnectionManager/ConnectionState Disconnecting
      static void _set_Disconnecting(GlobalNamespace::LiteNetLibConnectionManager::ConnectionState value);
    }; // LiteNetLibConnectionManager/ConnectionState
    #pragma pack(pop)
    static check_size<sizeof(LiteNetLibConnectionManager::ConnectionState), 0 + sizeof(int)> __GlobalNamespace_LiteNetLibConnectionManager_ConnectionStateSizeCheck;
    static_assert(sizeof(LiteNetLibConnectionManager::ConnectionState) == 0x4);
    // private readonly System.Byte[] _unconnectedPacketHeader
    // Size: 0x8
    // Offset: 0x10
    ::Array<uint8_t>* unconnectedPacketHeader;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private readonly LiteNetLib.NetManager _netManager
    // Size: 0x8
    // Offset: 0x18
    LiteNetLib::NetManager* netManager;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetManager*) == 0x8);
    // private readonly PacketEncryptionLayer _encryptionLayer
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::PacketEncryptionLayer* encryptionLayer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::PacketEncryptionLayer*) == 0x8);
    // private readonly System.Collections.Generic.List`1<LiteNetLibConnectionManager/NetPeerConnection> _connections
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Generic::List_1<GlobalNamespace::LiteNetLibConnectionManager::NetPeerConnection*>* connections;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::LiteNetLibConnectionManager::NetPeerConnection*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<LiteNetLibConnectionManager/NetPeerConnection> _pendingConnections
    // Size: 0x8
    // Offset: 0x30
    System::Collections::Generic::List_1<GlobalNamespace::LiteNetLibConnectionManager::NetPeerConnection*>* pendingConnections;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::LiteNetLibConnectionManager::NetPeerConnection*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<LiteNetLibConnectionManager/NetPeerConnectionRequest> _pendingRequests
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Generic::List_1<GlobalNamespace::LiteNetLibConnectionManager::NetPeerConnectionRequest*>* pendingRequests;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::LiteNetLibConnectionManager::NetPeerConnectionRequest*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<System.Net.IPEndPoint> _pendingReconnections
    // Size: 0x8
    // Offset: 0x40
    System::Collections::Generic::HashSet_1<System::Net::IPEndPoint*>* pendingReconnections;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<System::Net::IPEndPoint*>*) == 0x8);
    // private System.String _userId
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* userId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String _userName
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppString* userName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String _secret
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppString* secret;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private LiteNetLibConnectionManager/NetworkMode _mode
    // Size: 0x4
    // Offset: 0x60
    GlobalNamespace::LiteNetLibConnectionManager::NetworkMode mode;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LiteNetLibConnectionManager::NetworkMode) == 0x4);
    // private LiteNetLibConnectionManager/ConnectionState _connectionState
    // Size: 0x4
    // Offset: 0x64
    GlobalNamespace::LiteNetLibConnectionManager::ConnectionState connectionState;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LiteNetLibConnectionManager::ConnectionState) == 0x4);
    // private System.Threading.CancellationTokenSource _backgroundSentryDisconnectCts
    // Size: 0x8
    // Offset: 0x68
    System::Threading::CancellationTokenSource* backgroundSentryDisconnectCts;
    // Field size check
    static_assert(sizeof(System::Threading::CancellationTokenSource*) == 0x8);
    // private System.Threading.CancellationTokenSource _backgroundSentryShutdownCts
    // Size: 0x8
    // Offset: 0x70
    System::Threading::CancellationTokenSource* backgroundSentryShutdownCts;
    // Field size check
    static_assert(sizeof(System::Threading::CancellationTokenSource*) == 0x8);
    // private System.Boolean _sentryDisconnected
    // Size: 0x1
    // Offset: 0x78
    bool sentryDisconnected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _sentryShutdown
    // Size: 0x1
    // Offset: 0x79
    bool sentryShutdown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sentryShutdown and: lastPollUpdateTime
    char __padding15[0x6] = {};
    // private System.Int64 _lastPollUpdateTime
    // Size: 0x8
    // Offset: 0x80
    int64_t lastPollUpdateTime;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 _lastStatisticsUpdateTime
    // Size: 0x8
    // Offset: 0x88
    int64_t lastStatisticsUpdateTime;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0B80
    // private System.Action onConnectedEvent
    // Size: 0x8
    // Offset: 0x90
    System::Action* onConnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0B90
    // private System.Action`1<DisconnectedReason> onDisconnectedEvent
    // Size: 0x8
    // Offset: 0x98
    System::Action_1<GlobalNamespace::DisconnectedReason>* onDisconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::DisconnectedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0BA0
    // private System.Action`1<ConnectionFailedReason> onConnectionFailedEvent
    // Size: 0x8
    // Offset: 0xA0
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* onConnectionFailedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::ConnectionFailedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0BB0
    // private System.Action`1<IConnection> onConnectionConnectedEvent
    // Size: 0x8
    // Offset: 0xA8
    System::Action_1<GlobalNamespace::IConnection*>* onConnectionConnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnection*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0BC0
    // private System.Action`2<IConnection,DisconnectedReason> onConnectionDisconnectedEvent
    // Size: 0x8
    // Offset: 0xB0
    System::Action_2<GlobalNamespace::IConnection*, GlobalNamespace::DisconnectedReason>* onConnectionDisconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::IConnection*, GlobalNamespace::DisconnectedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0BD0
    // private System.Action`2<IConnection,System.Single> onLatencyUpdatedEvent
    // Size: 0x8
    // Offset: 0xB8
    System::Action_2<GlobalNamespace::IConnection*, float>* onLatencyUpdatedEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::IConnection*, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0BE0
    // private System.Action`3<IConnection,LiteNetLib.Utils.NetDataReader,LiteNetLib.DeliveryMethod> onReceivedDataEvent
    // Size: 0x8
    // Offset: 0xC0
    System::Action_3<GlobalNamespace::IConnection*, LiteNetLib::Utils::NetDataReader*, LiteNetLib::DeliveryMethod>* onReceivedDataEvent;
    // Field size check
    static_assert(sizeof(System::Action_3<GlobalNamespace::IConnection*, LiteNetLib::Utils::NetDataReader*, LiteNetLib::DeliveryMethod>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0BF0
    // private System.Action`2<System.Net.IPEndPoint,LiteNetLib.Utils.NetDataReader> onReceiveUnconnectedDataEvent
    // Size: 0x8
    // Offset: 0xC8
    System::Action_2<System::Net::IPEndPoint*, LiteNetLib::Utils::NetDataReader*>* onReceiveUnconnectedDataEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<System::Net::IPEndPoint*, LiteNetLib::Utils::NetDataReader*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0C00
    // private LiteNetLibConnectionManager/StatisticsUpdated onStatisticsUpdatedEvent
    // Size: 0x8
    // Offset: 0xD0
    GlobalNamespace::LiteNetLibConnectionManager::StatisticsUpdated* onStatisticsUpdatedEvent;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LiteNetLibConnectionManager::StatisticsUpdated*) == 0x8);
    // Creating value type constructor for type: LiteNetLibConnectionManager
