// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ButtonBinder
  class ButtonBinder;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: LoadingControl
  class LoadingControl : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.GameObject _loadingContainer
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::GameObject* loadingContainer;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private TMPro.TextMeshProUGUI _loadingText
    // Size: 0x8
    // Offset: 0x20
    TMPro::TextMeshProUGUI* loadingText;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshProUGUI*) == 0x8);
    // [SpaceAttribute] Offset: 0xE21978
    // private TMPro.TextMeshProUGUI _refreshText
    // Size: 0x8
    // Offset: 0x28
    TMPro::TextMeshProUGUI* refreshText;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshProUGUI*) == 0x8);
    // private UnityEngine.UI.Button _refreshButton
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::UI::Button* refreshButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.GameObject _refreshContainer
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::GameObject* refreshContainer;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // [SpaceAttribute] Offset: 0xE219D0
    // private UnityEngine.GameObject _downloadingContainer
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::GameObject* downloadingContainer;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private TMPro.TextMeshProUGUI _downloadingText
    // Size: 0x8
    // Offset: 0x48
    TMPro::TextMeshProUGUI* downloadingText;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshProUGUI*) == 0x8);
    // private UnityEngine.UI.Image _donwloadingProgressImage
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::UI::Image* donwloadingProgressImage;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Image*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE21A28
    // private System.Action didPressRefreshButtonEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action* didPressRefreshButtonEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private HMUI.ButtonBinder _buttonBinder
    // Size: 0x8
    // Offset: 0x60
    HMUI::ButtonBinder* buttonBinder;
    // Field size check
    static_assert(sizeof(HMUI::ButtonBinder*) == 0x8);
    // Creating value type constructor for type: LoadingControl
    LoadingControl(UnityEngine::GameObject* loadingContainer_ = {}, TMPro::TextMeshProUGUI* loadingText_ = {}, TMPro::TextMeshProUGUI* refreshText_ = {}, UnityEngine::UI::Button* refreshButton_ = {}, UnityEngine::GameObject* refreshContainer_ = {}, UnityEngine::GameObject* downloadingContainer_ = {}, TMPro::TextMeshProUGUI* downloadingText_ = {}, UnityEngine::UI::Image* donwloadingProgressImage_ = {}, System::Action* didPressRefreshButtonEvent_ = {}, HMUI::ButtonBinder* buttonBinder_ = {}) noexcept : loadingContainer{loadingContainer_}, loadingText{loadingText_}, refreshText{refreshText_}, refreshButton{refreshButton_}, refreshContainer{refreshContainer_}, downloadingContainer{downloadingContainer_}, downloadingText{downloadingText_}, donwloadingProgressImage{donwloadingProgressImage_}, didPressRefreshButtonEvent{didPressRefreshButtonEvent_}, buttonBinder{buttonBinder_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_didPressRefreshButtonEvent(System.Action value)
    // Offset: 0x11FDF48
    void add_didPressRefreshButtonEvent(System::Action* value);
    // public System.Void remove_didPressRefreshButtonEvent(System.Action value)
    // Offset: 0x11FE018
    void remove_didPressRefreshButtonEvent(System::Action* value);
    // public System.Boolean get_isLoading()
    // Offset: 0x1205E44
    bool get_isLoading();
    // protected System.Void Awake()
    // Offset: 0x1205E60
    void Awake();
    // protected System.Void OnDestroy()
    // Offset: 0x1205F10
    void OnDestroy();
    // public System.Void ShowLoading(System.String text)
    // Offset: 0x11FDD48
    void ShowLoading(::Il2CppString* text);
    // public System.Void ShowText(System.String text, System.Boolean showRefreshButton)
    // Offset: 0x11FDDD0
    void ShowText(::Il2CppString* text, bool showRefreshButton);
    // public System.Void ShowDownloadingProgress(System.String text, System.Single downloadingProgress)
    // Offset: 0x1205F2C
    void ShowDownloadingProgress(::Il2CppString* text, float downloadingProgress);
    // public System.Void Hide()
    // Offset: 0x11FDE84
    void Hide();
    // private System.Void <Awake>b__14_0()
    // Offset: 0x1205FDC
    void $Awake$b__14_0();
    // public System.Void .ctor()
    // Offset: 0x1205FD4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LoadingControl* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::LoadingControl::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LoadingControl*, creationType>()));
    }
  }; // LoadingControl
  #pragma pack(pop)
  static check_size<sizeof(LoadingControl), 96 + sizeof(HMUI::ButtonBinder*)> __GlobalNamespace_LoadingControlSizeCheck;
  static_assert(sizeof(LoadingControl) == 0x68);
  // Writing MetadataGetter for method: LoadingControl::add_didPressRefreshButtonEvent
  // Il2CppName: add_didPressRefreshButtonEvent
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)(System::Action*)>(&LoadingControl::add_didPressRefreshButtonEvent)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "add_didPressRefreshButtonEvent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<System::Action*>()});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::remove_didPressRefreshButtonEvent
  // Il2CppName: remove_didPressRefreshButtonEvent
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)(System::Action*)>(&LoadingControl::remove_didPressRefreshButtonEvent)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "remove_didPressRefreshButtonEvent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<System::Action*>()});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::get_isLoading
  // Il2CppName: get_isLoading
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (LoadingControl::*)()>(&LoadingControl::get_isLoading)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "get_isLoading", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::Awake
  // Il2CppName: Awake
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)()>(&LoadingControl::Awake)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::OnDestroy
  // Il2CppName: OnDestroy
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)()>(&LoadingControl::OnDestroy)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::ShowLoading
  // Il2CppName: ShowLoading
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)(::Il2CppString*)>(&LoadingControl::ShowLoading)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "ShowLoading", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<::Il2CppString*>()});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::ShowText
  // Il2CppName: ShowText
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)(::Il2CppString*, bool)>(&LoadingControl::ShowText)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "ShowText", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<::Il2CppString*>(), ::il2cpp_utils::ExtractIndependentType<bool>()});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::ShowDownloadingProgress
  // Il2CppName: ShowDownloadingProgress
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)(::Il2CppString*, float)>(&LoadingControl::ShowDownloadingProgress)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "ShowDownloadingProgress", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<::Il2CppString*>(), ::il2cpp_utils::ExtractIndependentType<float>()});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::Hide
  // Il2CppName: Hide
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)()>(&LoadingControl::Hide)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "Hide", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::$Awake$b__14_0
  // Il2CppName: <Awake>b__14_0
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)()>(&LoadingControl::$Awake$b__14_0)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), "<Awake>b__14_0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: LoadingControl::New_ctor
  // Il2CppName: .ctor
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)()>(&LoadingControl::New_ctor<::il2cpp_utils::CreationType::Temporary>)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), ".ctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LoadingControl::*)()>(&LoadingControl::New_ctor<::il2cpp_utils::CreationType::Manual>)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LoadingControl*), ".ctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LoadingControl*, "", "LoadingControl");
