// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ButtonBinder
  class ButtonBinder;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: LoadingControl
  class LoadingControl : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.GameObject _loadingContainer
    // Offset: 0x18
    UnityEngine::GameObject* loadingContainer;
    // private TMPro.TextMeshProUGUI _loadingText
    // Offset: 0x20
    TMPro::TextMeshProUGUI* loadingText;
    // private TMPro.TextMeshProUGUI _refreshText
    // Offset: 0x28
    TMPro::TextMeshProUGUI* refreshText;
    // private UnityEngine.UI.Button _refreshButton
    // Offset: 0x30
    UnityEngine::UI::Button* refreshButton;
    // private UnityEngine.GameObject _refreshContainer
    // Offset: 0x38
    UnityEngine::GameObject* refreshContainer;
    // private UnityEngine.GameObject _downloadingContainer
    // Offset: 0x40
    UnityEngine::GameObject* downloadingContainer;
    // private TMPro.TextMeshProUGUI _downloadingText
    // Offset: 0x48
    TMPro::TextMeshProUGUI* downloadingText;
    // private UnityEngine.UI.Image _donwloadingProgressImage
    // Offset: 0x50
    UnityEngine::UI::Image* donwloadingProgressImage;
    // private System.Action didPressRefreshButtonEvent
    // Offset: 0x58
    System::Action* didPressRefreshButtonEvent;
    // private HMUI.ButtonBinder _buttonBinder
    // Offset: 0x60
    HMUI::ButtonBinder* buttonBinder;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_didPressRefreshButtonEvent(System.Action value)
    // Offset: 0x1AC2C38
    void add_didPressRefreshButtonEvent(System::Action* value);
    // public System.Void remove_didPressRefreshButtonEvent(System.Action value)
    // Offset: 0x1AC2D08
    void remove_didPressRefreshButtonEvent(System::Action* value);
    // public System.Boolean get_isLoading()
    // Offset: 0x1AC881C
    bool get_isLoading();
    // protected System.Void Awake()
    // Offset: 0x1AC8838
    void Awake();
    // protected System.Void OnDestroy()
    // Offset: 0x1AC88FC
    void OnDestroy();
    // public System.Void ShowLoading(System.String text)
    // Offset: 0x1AC2A2C
    void ShowLoading(::Il2CppString* text);
    // public System.Void ShowText(System.String text, System.Boolean showRefreshButton)
    // Offset: 0x1AC2AB4
    void ShowText(::Il2CppString* text, bool showRefreshButton);
    // public System.Void ShowDownloadingProgress(System.String text, System.Single downloadingProgress)
    // Offset: 0x1AC8918
    void ShowDownloadingProgress(::Il2CppString* text, float downloadingProgress);
    // public System.Void Hide()
    // Offset: 0x1AC2B68
    void Hide();
    // private System.Void <Awake>b__14_0()
    // Offset: 0x1AC89C8
    void $Awake$b__14_0();
    // public System.Void .ctor()
    // Offset: 0x1AC89C0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static LoadingControl* New_ctor();
  }; // LoadingControl
  check_size<sizeof(LoadingControl), 96 + sizeof(void*) + ((96 + sizeof(void*)) % 8 != 0 ? (8 - (96 + sizeof(void*)) % 8) : 0)> __GlobalNamespace_LoadingControlSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LoadingControl*, "", "LoadingControl");
#pragma pack(pop)
