// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: Polyglot
namespace Polyglot {
  // Forward declaring type: LocalizedTextMeshProUGUI
  class LocalizedTextMeshProUGUI;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameServersFilterText
  class GameServersFilterText;
  // Forward declaring type: EditableBeatmapSelectionView
  class EditableBeatmapSelectionView;
  // Forward declaring type: EditableModifiersSelectionView
  class EditableModifiersSelectionView;
  // Forward declaring type: BeatmapLevelSelectionMask
  struct BeatmapLevelSelectionMask;
  // Forward declaring type: ILobbyPlayerData
  class ILobbyPlayerData;
  // Forward declaring type: CannotStartGameReason
  struct CannotStartGameReason;
  // Forward declaring type: MultiplayerLobbyState
  struct MultiplayerLobbyState;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: HoverHint
  class HoverHint;
  // Forward declaring type: ToggleBinder
  class ToggleBinder;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x10A
  #pragma pack(push, 1)
  // Autogenerated type: LobbySetupViewController
  // [TokenAttribute] Offset: FFFFFFFF
  class LobbySetupViewController : public HMUI::ViewController {
    public:
    // private UnityEngine.UI.Button _startGameReadyButton
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::UI::Button* startGameReadyButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _cancelGameUnreadyButton
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::UI::Button* cancelGameUnreadyButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private Polyglot.LocalizedTextMeshProUGUI _startReadyText
    // Size: 0x8
    // Offset: 0x80
    Polyglot::LocalizedTextMeshProUGUI* startReadyText;
    // Field size check
    static_assert(sizeof(Polyglot::LocalizedTextMeshProUGUI*) == 0x8);
    // private Polyglot.LocalizedTextMeshProUGUI _cancelUnreadyText
    // Size: 0x8
    // Offset: 0x88
    Polyglot::LocalizedTextMeshProUGUI* cancelUnreadyText;
    // Field size check
    static_assert(sizeof(Polyglot::LocalizedTextMeshProUGUI*) == 0x8);
    // private GameServersFilterText _serverSettings
    // Size: 0x8
    // Offset: 0x90
    GlobalNamespace::GameServersFilterText* serverSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameServersFilterText*) == 0x8);
    // [SpaceAttribute] Offset: 0xE489FC
    // private UnityEngine.GameObject _suggestionHeader
    // Size: 0x8
    // Offset: 0x98
    UnityEngine::GameObject* suggestionHeader;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private EditableBeatmapSelectionView _beatmapSelectionView
    // Size: 0x8
    // Offset: 0xA0
    GlobalNamespace::EditableBeatmapSelectionView* beatmapSelectionView;
    // Field size check
    static_assert(sizeof(GlobalNamespace::EditableBeatmapSelectionView*) == 0x8);
    // private EditableModifiersSelectionView _modifiersSelectionView
    // Size: 0x8
    // Offset: 0xA8
    GlobalNamespace::EditableModifiersSelectionView* modifiersSelectionView;
    // Field size check
    static_assert(sizeof(GlobalNamespace::EditableModifiersSelectionView*) == 0x8);
    // private HMUI.HoverHint _cantStartGameHoverHint
    // Size: 0x8
    // Offset: 0xB0
    HMUI::HoverHint* cantStartGameHoverHint;
    // Field size check
    static_assert(sizeof(HMUI::HoverHint*) == 0x8);
    // private UnityEngine.GameObject _playerMissingLevelHoverHintWrapper
    // Size: 0x8
    // Offset: 0xB8
    UnityEngine::GameObject* playerMissingLevelHoverHintWrapper;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private HMUI.HoverHint _playersMissingLevelHoverHint
    // Size: 0x8
    // Offset: 0xC0
    HMUI::HoverHint* playersMissingLevelHoverHint;
    // Field size check
    static_assert(sizeof(HMUI::HoverHint*) == 0x8);
    // private UnityEngine.GameObject _spectatorWarningTextWrapper
    // Size: 0x8
    // Offset: 0xC8
    UnityEngine::GameObject* spectatorWarningTextWrapper;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private readonly HMUI.ToggleBinder _toggleBinder
    // Size: 0x8
    // Offset: 0xD0
    HMUI::ToggleBinder* toggleBinder;
    // Field size check
    static_assert(sizeof(HMUI::ToggleBinder*) == 0x8);
    // private System.Action selectBeatmapEvent
    // Size: 0x8
    // Offset: 0xD8
    System::Action* selectBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Action selectModifiersEvent
    // Size: 0x8
    // Offset: 0xE0
    System::Action* selectModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Action startGameOrReadyEvent
    // Size: 0x8
    // Offset: 0xE8
    System::Action* startGameOrReadyEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Action cancelGameOrUnreadyEvent
    // Size: 0x8
    // Offset: 0xF0
    System::Action* cancelGameOrUnreadyEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Action clearSuggestedBeatmapEvent
    // Size: 0x8
    // Offset: 0xF8
    System::Action* clearSuggestedBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Action clearSuggestedModifiersEvent
    // Size: 0x8
    // Offset: 0x100
    System::Action* clearSuggestedModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Boolean _isPartyOwner
    // Size: 0x1
    // Offset: 0x108
    bool isPartyOwner;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isQuickStart
    // Size: 0x1
    // Offset: 0x109
    bool isQuickStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: LobbySetupViewController
