// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: LocalNetworkPlayerModel
#include "GlobalNamespace/LocalNetworkPlayerModel.hpp"
// Including type: INetworkPlayer
#include "GlobalNamespace/INetworkPlayer.hpp"
// Including type: BeatmapLevelSelectionMask
#include "GlobalNamespace/BeatmapLevelSelectionMask.hpp"
// Including type: GameplayServerConfiguration
#include "GlobalNamespace/GameplayServerConfiguration.hpp"
// Including type: System.Single
#include "System/Single.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPAddress
  class IPAddress;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::LocalNetworkPlayerModel::LocalNetworkPlayer);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::LocalNetworkPlayerModel::LocalNetworkPlayer*, "", "LocalNetworkPlayerModel/LocalNetworkPlayer");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x97
  #pragma pack(push, 1)
  // Autogenerated type: LocalNetworkPlayerModel/LocalNetworkPlayer
  // [TokenAttribute] Offset: FFFFFFFF
  class LocalNetworkPlayerModel::LocalNetworkPlayer : public ::Il2CppObject/*, public ::GlobalNamespace::INetworkPlayer*/ {
    public:
    public:
    // private readonly LocalNetworkPlayerModel _playerModel
    // Size: 0x8
    // Offset: 0x10
    ::GlobalNamespace::LocalNetworkPlayerModel* playerModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LocalNetworkPlayerModel*) == 0x8);
    // private readonly System.String _userId
    // Size: 0x8
    // Offset: 0x18
    ::StringW userId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.String _userName
    // Size: 0x8
    // Offset: 0x20
    ::StringW userName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.Net.IPAddress _ipAddress
    // Size: 0x8
    // Offset: 0x28
    ::System::Net::IPAddress* ipAddress;
    // Field size check
    static_assert(sizeof(::System::Net::IPAddress*) == 0x8);
    // private readonly System.Boolean _isMe
    // Size: 0x1
    // Offset: 0x30
    bool isMe;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isPartyOwner
    // Size: 0x1
    // Offset: 0x31
    bool isPartyOwner;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPartyOwner and: joinRequestTime
    char __padding5[0x2] = {};
    // private System.Single _joinRequestTime
    // Size: 0x4
    // Offset: 0x34
    float joinRequestTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _inviteSentTime
    // Size: 0x4
    // Offset: 0x38
    float inviteSentTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _isBlocked
    // Size: 0x1
    // Offset: 0x3C
    bool isBlocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _hasBlockedMe
    // Size: 0x1
    // Offset: 0x3D
    bool hasBlockedMe;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasBlockedMe and: secret
    char __padding9[0x2] = {};
    // private System.String _secret
    // Size: 0x8
    // Offset: 0x40
    ::StringW secret;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 _multiplayerPort
    // Size: 0x4
    // Offset: 0x48
    int multiplayerPort;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: multiplayerPort and: connectedPlayer
    char __padding11[0x4] = {};
    // private IConnectedPlayer _connectedPlayer
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::IConnectedPlayer* connectedPlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IConnectedPlayer*) == 0x8);
    // private System.Single _connectingStartTime
    // Size: 0x4
    // Offset: 0x58
    float connectingStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 _currentPartySize
    // Size: 0x4
    // Offset: 0x5C
    int currentPartySize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private BeatmapLevelSelectionMask _selectionMask
    // Size: 0x18
    // Offset: 0x60
    ::GlobalNamespace::BeatmapLevelSelectionMask selectionMask;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapLevelSelectionMask) == 0x18);
    // private GameplayServerConfiguration _configuration
    // Size: 0x18
    // Offset: 0x78
    ::GlobalNamespace::GameplayServerConfiguration configuration;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameplayServerConfiguration) == 0x18);
    // private System.Single _lastUpdateTime
    // Size: 0x4
    // Offset: 0x90
    float lastUpdateTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _allowedJoinToMyParty
    // Size: 0x1
    // Offset: 0x94
    bool allowedJoinToMyParty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _requestedToJoinMyParty
    // Size: 0x1
    // Offset: 0x95
    bool requestedToJoinMyParty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _invitedMeToJoinTheirParty
    // Size: 0x1
    // Offset: 0x96
    bool invitedMeToJoinTheirParty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::INetworkPlayer
    operator ::GlobalNamespace::INetworkPlayer() noexcept {
      return *reinterpret_cast<::GlobalNamespace::INetworkPlayer*>(this);
    }
    // Creating interface conversion operator: i_INetworkPlayer
    inline ::GlobalNamespace::INetworkPlayer* i_INetworkPlayer() noexcept {
      return reinterpret_cast<::GlobalNamespace::INetworkPlayer*>(this);
    }
    // static field const value: static private System.Single kPeerBroadcastTimeout
    static constexpr const float kPeerBroadcastTimeout = 30;
    // Get static field: static private System.Single kPeerBroadcastTimeout
    static float _get_kPeerBroadcastTimeout();
    // Set static field: static private System.Single kPeerBroadcastTimeout
