// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: LiteNetLib.INetEventListener
#include "LiteNetLib/INetEventListener.hpp"
// Including type: System.UInt32
#include "System/UInt32.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
  // Forward declaring type: IPAddress
  class IPAddress;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: NetworkPacketSerializer`2<TType, TData>
  template<typename TType, typename TData>
  class NetworkPacketSerializer_2;
  // Forward declaring type: GameplayServerConfiguration
  struct GameplayServerConfiguration;
}
// Forward declaring namespace: LiteNetLib
namespace LiteNetLib {
  // Forward declaring type: NetManager
  class NetManager;
  // Forward declaring type: NetPacketReader
  class NetPacketReader;
  // Forward declaring type: UnconnectedMessageType
  struct UnconnectedMessageType;
  // Forward declaring type: ConnectionRequest
  class ConnectionRequest;
  // Forward declaring type: NetPeer
  class NetPeer;
  // Forward declaring type: DisconnectInfo
  struct DisconnectInfo;
  // Forward declaring type: DeliveryMethod
  struct DeliveryMethod;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
  // Forward declaring type: INetSerializable
  class INetSerializable;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: SocketError
  struct SocketError;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x6C
  #pragma pack(push, 1)
  // Autogenerated type: LocalNetworkDiscoveryManager
  class LocalNetworkDiscoveryManager : public UnityEngine::MonoBehaviour/*, public LiteNetLib::INetEventListener*/ {
    public:
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::PacketType
    struct PacketType;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::BroadcastPacket
    class BroadcastPacket;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::JoinRequestPacket
    class JoinRequestPacket;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::JoinResponsePacket
    class JoinResponsePacket;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::InviteRequestPacket
    class InviteRequestPacket;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::InviteResponsePacket
    class InviteResponsePacket;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::PeerUpdatedDelegate
    class PeerUpdatedDelegate;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::JoinRequestedDelegate
    class JoinRequestedDelegate;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::JoinRespondedDelegate
    class JoinRespondedDelegate;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::InviteRequestedDelegate
    class InviteRequestedDelegate;
    // Nested type: GlobalNamespace::LocalNetworkDiscoveryManager::InviteRespondedDelegate
    class InviteRespondedDelegate;
    // Size: 0x1
    #pragma pack(push, 1)
    // Autogenerated type: LocalNetworkDiscoveryManager/PacketType
    struct PacketType/*, public System::Enum*/ {
      public:
      // public System.Byte value__
      // Size: 0x1
      // Offset: 0x0
      uint8_t value;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      // Creating value type constructor for type: PacketType
      constexpr PacketType(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public LocalNetworkDiscoveryManager/PacketType Broadcast
      static constexpr const uint8_t Broadcast = 0u;
      // Get static field: static public LocalNetworkDiscoveryManager/PacketType Broadcast
      static GlobalNamespace::LocalNetworkDiscoveryManager::PacketType _get_Broadcast();
      // Set static field: static public LocalNetworkDiscoveryManager/PacketType Broadcast
      static void _set_Broadcast(GlobalNamespace::LocalNetworkDiscoveryManager::PacketType value);
      // static field const value: static public LocalNetworkDiscoveryManager/PacketType JoinRequest
      static constexpr const uint8_t JoinRequest = 1u;
      // Get static field: static public LocalNetworkDiscoveryManager/PacketType JoinRequest
      static GlobalNamespace::LocalNetworkDiscoveryManager::PacketType _get_JoinRequest();
      // Set static field: static public LocalNetworkDiscoveryManager/PacketType JoinRequest
      static void _set_JoinRequest(GlobalNamespace::LocalNetworkDiscoveryManager::PacketType value);
      // static field const value: static public LocalNetworkDiscoveryManager/PacketType JoinResponse
      static constexpr const uint8_t JoinResponse = 2u;
      // Get static field: static public LocalNetworkDiscoveryManager/PacketType JoinResponse
      static GlobalNamespace::LocalNetworkDiscoveryManager::PacketType _get_JoinResponse();
      // Set static field: static public LocalNetworkDiscoveryManager/PacketType JoinResponse
      static void _set_JoinResponse(GlobalNamespace::LocalNetworkDiscoveryManager::PacketType value);
      // static field const value: static public LocalNetworkDiscoveryManager/PacketType InviteRequest
      static constexpr const uint8_t InviteRequest = 3u;
      // Get static field: static public LocalNetworkDiscoveryManager/PacketType InviteRequest
      static GlobalNamespace::LocalNetworkDiscoveryManager::PacketType _get_InviteRequest();
      // Set static field: static public LocalNetworkDiscoveryManager/PacketType InviteRequest
      static void _set_InviteRequest(GlobalNamespace::LocalNetworkDiscoveryManager::PacketType value);
      // static field const value: static public LocalNetworkDiscoveryManager/PacketType InviteResponse
      static constexpr const uint8_t InviteResponse = 4u;
      // Get static field: static public LocalNetworkDiscoveryManager/PacketType InviteResponse
      static GlobalNamespace::LocalNetworkDiscoveryManager::PacketType _get_InviteResponse();
      // Set static field: static public LocalNetworkDiscoveryManager/PacketType InviteResponse
      static void _set_InviteResponse(GlobalNamespace::LocalNetworkDiscoveryManager::PacketType value);
    }; // LocalNetworkDiscoveryManager/PacketType
    #pragma pack(pop)
    static check_size<sizeof(LocalNetworkDiscoveryManager::PacketType), 0 + sizeof(uint8_t)> __GlobalNamespace_LocalNetworkDiscoveryManager_PacketTypeSizeCheck;
    static_assert(sizeof(LocalNetworkDiscoveryManager::PacketType) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xE17D10
    // private LocalNetworkDiscoveryManager/PeerUpdatedDelegate peerUpdatedEvent
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::LocalNetworkDiscoveryManager::PeerUpdatedDelegate* peerUpdatedEvent;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LocalNetworkDiscoveryManager::PeerUpdatedDelegate*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17D20
    // private LocalNetworkDiscoveryManager/JoinRequestedDelegate joinRequestedEvent
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::LocalNetworkDiscoveryManager::JoinRequestedDelegate* joinRequestedEvent;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LocalNetworkDiscoveryManager::JoinRequestedDelegate*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17D30
    // private LocalNetworkDiscoveryManager/JoinRespondedDelegate joinRespondedEvent
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::LocalNetworkDiscoveryManager::JoinRespondedDelegate* joinRespondedEvent;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LocalNetworkDiscoveryManager::JoinRespondedDelegate*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17D40
    // private LocalNetworkDiscoveryManager/InviteRequestedDelegate inviteRequestedEvent
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::LocalNetworkDiscoveryManager::InviteRequestedDelegate* inviteRequestedEvent;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LocalNetworkDiscoveryManager::InviteRequestedDelegate*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17D50
    // private LocalNetworkDiscoveryManager/InviteRespondedDelegate inviteRespondedEvent
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::LocalNetworkDiscoveryManager::InviteRespondedDelegate* inviteRespondedEvent;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LocalNetworkDiscoveryManager::InviteRespondedDelegate*) == 0x8);
    // private LiteNetLib.NetManager _netManager
    // Size: 0x8
    // Offset: 0x40
    LiteNetLib::NetManager* netManager;
    // Field size check
    static_assert(sizeof(LiteNetLib::NetManager*) == 0x8);
    // private readonly NetworkPacketSerializer`2<LocalNetworkDiscoveryManager/PacketType,System.Net.IPEndPoint> _packetSerializer
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::NetworkPacketSerializer_2<GlobalNamespace::LocalNetworkDiscoveryManager::PacketType, System::Net::IPEndPoint*>* packetSerializer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NetworkPacketSerializer_2<GlobalNamespace::LocalNetworkDiscoveryManager::PacketType, System::Net::IPEndPoint*>*) == 0x8);
    // private readonly LiteNetLib.Utils.NetDataWriter _netDataWriter
    // Size: 0x8
    // Offset: 0x50
    LiteNetLib::Utils::NetDataWriter* netDataWriter;
    // Field size check
    static_assert(sizeof(LiteNetLib::Utils::NetDataWriter*) == 0x8);
    // private readonly LocalNetworkDiscoveryManager/BroadcastPacket _broadcastPacket
    // Size: 0x8
    // Offset: 0x58
    GlobalNamespace::LocalNetworkDiscoveryManager::BroadcastPacket* broadcastPacket;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LocalNetworkDiscoveryManager::BroadcastPacket*) == 0x8);
    // private System.Int32 _discoveryPort
    // Size: 0x4
    // Offset: 0x60
    int discoveryPort;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _initialized
    // Size: 0x1
    // Offset: 0x64
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _enableBroadcasting
    // Size: 0x1
    // Offset: 0x65
    bool enableBroadcasting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableBroadcasting and: lastBroadcastTime
    char __padding11[0x2] = {};
    // private System.Single _lastBroadcastTime
    // Size: 0x4
    // Offset: 0x68
    float lastBroadcastTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: LocalNetworkDiscoveryManager
