// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PersistentScriptableObject
#include "GlobalNamespace/PersistentScriptableObject.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  class List_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: LeaderboardType because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  class Action_2;
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: LocalLeaderboardsModel
  class LocalLeaderboardsModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(GlobalNamespace::LocalLeaderboardsModel);
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LocalLeaderboardsModel*, "", "LocalLeaderboardsModel");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: LocalLeaderboardsModel
  // [TokenAttribute] Offset: FFFFFFFF
  class LocalLeaderboardsModel : public GlobalNamespace::PersistentScriptableObject {
    public:
    // Nested type: GlobalNamespace::LocalLeaderboardsModel::LeaderboardType
    struct LeaderboardType;
    // Nested type: GlobalNamespace::LocalLeaderboardsModel::ScoreData
    class ScoreData;
    // Nested type: GlobalNamespace::LocalLeaderboardsModel::LeaderboardData
    class LeaderboardData;
    // Nested type: GlobalNamespace::LocalLeaderboardsModel::SavedLeaderboardsData
    class SavedLeaderboardsData;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: LocalLeaderboardsModel/LeaderboardType
    // [TokenAttribute] Offset: FFFFFFFF
    struct LeaderboardType/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LeaderboardType
      constexpr LeaderboardType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public LocalLeaderboardsModel/LeaderboardType AllTime
      static constexpr const int AllTime = 0;
      // Get static field: static public LocalLeaderboardsModel/LeaderboardType AllTime
      static GlobalNamespace::LocalLeaderboardsModel::LeaderboardType _get_AllTime();
      // Set static field: static public LocalLeaderboardsModel/LeaderboardType AllTime
      static void _set_AllTime(GlobalNamespace::LocalLeaderboardsModel::LeaderboardType value);
      // static field const value: static public LocalLeaderboardsModel/LeaderboardType Daily
      static constexpr const int Daily = 1;
      // Get static field: static public LocalLeaderboardsModel/LeaderboardType Daily
      static GlobalNamespace::LocalLeaderboardsModel::LeaderboardType _get_Daily();
      // Set static field: static public LocalLeaderboardsModel/LeaderboardType Daily
      static void _set_Daily(GlobalNamespace::LocalLeaderboardsModel::LeaderboardType value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // LocalLeaderboardsModel/LeaderboardType
    #pragma pack(pop)
    static check_size<sizeof(LocalLeaderboardsModel::LeaderboardType), 0 + sizeof(int)> __GlobalNamespace_LocalLeaderboardsModel_LeaderboardTypeSizeCheck;
    static_assert(sizeof(LocalLeaderboardsModel::LeaderboardType) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Int32 _maxNumberOfScoresInLeaderboard
    // Size: 0x4
    // Offset: 0x18
    int maxNumberOfScoresInLeaderboard;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: maxNumberOfScoresInLeaderboard and: newScoreWasAddedToLeaderboardEvent
    char __padding0[0x4] = {};
    // private System.Action`2<System.String,LocalLeaderboardsModel/LeaderboardType> newScoreWasAddedToLeaderboardEvent
    // Size: 0x8
    // Offset: 0x20
    System::Action_2<::StringW, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType>* newScoreWasAddedToLeaderboardEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::StringW, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<LocalLeaderboardsModel/LeaderboardType,System.Int32> _lastScorePositions
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Generic::Dictionary_2<GlobalNamespace::LocalLeaderboardsModel::LeaderboardType, int>* lastScorePositions;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<GlobalNamespace::LocalLeaderboardsModel::LeaderboardType, int>*) == 0x8);
    // private System.String _lastScoreLeaderboardId
    // Size: 0x8
    // Offset: 0x30
    ::StringW lastScoreLeaderboardId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.List`1<LocalLeaderboardsModel/LeaderboardData> _leaderboardsData
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>* leaderboardsData;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>*) == 0x8);
    // private System.Collections.Generic.List`1<LocalLeaderboardsModel/LeaderboardData> _dailyLeaderboardsData
    // Size: 0x8
    // Offset: 0x40
    System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>* dailyLeaderboardsData;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>*) == 0x8);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.String kLocalLeaderboardsFileName
    static constexpr const char* kLocalLeaderboardsFileName = "LocalLeaderboards.dat";
    // Get static field: static private System.String kLocalLeaderboardsFileName
    static ::StringW _get_kLocalLeaderboardsFileName();
    // Set static field: static private System.String kLocalLeaderboardsFileName
    static void _set_kLocalLeaderboardsFileName(::StringW value);
    // static field const value: static private System.String kLocalDailyLeaderboardsFileName
    static constexpr const char* kLocalDailyLeaderboardsFileName = "LocalDailyLeaderboards.dat";
    // Get static field: static private System.String kLocalDailyLeaderboardsFileName
    static ::StringW _get_kLocalDailyLeaderboardsFileName();
    // Set static field: static private System.String kLocalDailyLeaderboardsFileName
    static void _set_kLocalDailyLeaderboardsFileName(::StringW value);
    // Get instance field reference: private System.Int32 _maxNumberOfScoresInLeaderboard
    int& dyn__maxNumberOfScoresInLeaderboard();
    // Get instance field reference: private System.Action`2<System.String,LocalLeaderboardsModel/LeaderboardType> newScoreWasAddedToLeaderboardEvent
    System::Action_2<::StringW, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType>*& dyn_newScoreWasAddedToLeaderboardEvent();
    // Get instance field reference: private System.Collections.Generic.Dictionary`2<LocalLeaderboardsModel/LeaderboardType,System.Int32> _lastScorePositions
    System::Collections::Generic::Dictionary_2<GlobalNamespace::LocalLeaderboardsModel::LeaderboardType, int>*& dyn__lastScorePositions();
    // Get instance field reference: private System.String _lastScoreLeaderboardId
    ::StringW& dyn__lastScoreLeaderboardId();
    // Get instance field reference: private System.Collections.Generic.List`1<LocalLeaderboardsModel/LeaderboardData> _leaderboardsData
    System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>*& dyn__leaderboardsData();
    // Get instance field reference: private System.Collections.Generic.List`1<LocalLeaderboardsModel/LeaderboardData> _dailyLeaderboardsData
    System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>*& dyn__dailyLeaderboardsData();
    // public System.Void add_newScoreWasAddedToLeaderboardEvent(System.Action`2<System.String,LocalLeaderboardsModel/LeaderboardType> value)
    // Offset: 0x2B9C8C8
    void add_newScoreWasAddedToLeaderboardEvent(System::Action_2<::StringW, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType>* value);
    // public System.Void remove_newScoreWasAddedToLeaderboardEvent(System.Action`2<System.String,LocalLeaderboardsModel/LeaderboardType> value)
    // Offset: 0x2B9CBE0
    void remove_newScoreWasAddedToLeaderboardEvent(System::Action_2<::StringW, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType>* value);
    // protected System.Void OnDisable()
    // Offset: 0x2B9D1F4
    void OnDisable();
    // static private System.Void LoadLeaderboardsData(System.String filename, out System.Collections.Generic.List`1<LocalLeaderboardsModel/LeaderboardData> leaderboardsData)
    // Offset: 0x2B9D25C
    static void LoadLeaderboardsData(::StringW filename, ByRef<System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>*> leaderboardsData);
    // static private System.Void SaveLeaderboardsData(System.String filename, System.Collections.Generic.List`1<LocalLeaderboardsModel/LeaderboardData> leaderboardsData)
    // Offset: 0x2B9D408
    static void SaveLeaderboardsData(::StringW filename, System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>* leaderboardsData);
    // public System.Void Load()
    // Offset: 0x2B9D130
    void Load();
    // public System.Void Save()
    // Offset: 0x2B9D1F8
    void Save();
    // private System.Collections.Generic.List`1<LocalLeaderboardsModel/LeaderboardData> GetLeaderboardsData(LocalLeaderboardsModel/LeaderboardType leaderboardType)
    // Offset: 0x2B9D5C8
    System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>* GetLeaderboardsData(GlobalNamespace::LocalLeaderboardsModel::LeaderboardType leaderboardType);
    // private LocalLeaderboardsModel/LeaderboardData GetLeaderboardData(System.String leaderboardId, LocalLeaderboardsModel/LeaderboardType leaderboardType)
    // Offset: 0x2B9D5F0
    GlobalNamespace::LocalLeaderboardsModel::LeaderboardData* GetLeaderboardData(::StringW leaderboardId, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType leaderboardType);
    // private System.Int64 GetCurrentTimestamp()
    // Offset: 0x2B9D6C0
    int64_t GetCurrentTimestamp();
    // protected System.Void UpdateDailyLeaderboard(System.String leaderboardId)
    // Offset: 0x2B9D4D0
    void UpdateDailyLeaderboard(::StringW leaderboardId);
    // private System.Void AddScore(System.String leaderboardId, LocalLeaderboardsModel/LeaderboardType leaderboardType, System.String playerName, System.Int32 score, System.Boolean fullCombo)
    // Offset: 0x2B9D79C
    void AddScore(::StringW leaderboardId, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType leaderboardType, ::StringW playerName, int score, bool fullCombo);
    // private System.Boolean WillScoreGoIntoLeaderboard(System.String leaderboardId, LocalLeaderboardsModel/LeaderboardType leaderboardType, System.Int32 score)
    // Offset: 0x2B9DA20
    bool WillScoreGoIntoLeaderboard(::StringW leaderboardId, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType leaderboardType, int score);
    // public System.Collections.Generic.List`1<LocalLeaderboardsModel/ScoreData> GetScores(System.String leaderboardId, LocalLeaderboardsModel/LeaderboardType leaderboardType)
    // Offset: 0x2B9CF28
    System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::ScoreData*>* GetScores(::StringW leaderboardId, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType leaderboardType);
    // public System.Int32 GetHighScore(System.String leaderboardId, LocalLeaderboardsModel/LeaderboardType leaderboardType)
    // Offset: 0x2B9DAF4
    int GetHighScore(::StringW leaderboardId, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType leaderboardType);
    // public System.Int32 GetPositionInLeaderboard(System.String leaderboardId, LocalLeaderboardsModel/LeaderboardType leaderboardType, System.Int32 score)
    // Offset: 0x2B9DB88
    int GetPositionInLeaderboard(::StringW leaderboardId, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType leaderboardType, int score);
    // public System.Int32 GetLastScorePosition(System.String leaderboardId, LocalLeaderboardsModel/LeaderboardType leaderboardType)
    // Offset: 0x2B9CF44
    int GetLastScorePosition(::StringW leaderboardId, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType leaderboardType);
    // public System.Void ClearLastScorePosition()
    // Offset: 0x2B9CE50
    void ClearLastScorePosition();
    // public System.Void AddScore(System.String leaderboardId, System.String playerName, System.Int32 score, System.Boolean fullCombo)
    // Offset: 0x2B9DC64
    void AddScore(::StringW leaderboardId, ::StringW playerName, int score, bool fullCombo);
    // public System.Boolean WillScoreGoIntoLeaderboard(System.String leaderboardId, System.Int32 score)
    // Offset: 0x2B9DCCC
    bool WillScoreGoIntoLeaderboard(::StringW leaderboardId, int score);
    // public System.Void ClearLeaderboard(System.String leaderboardId)
    // Offset: 0x2B9DD2C
    void ClearLeaderboard(::StringW leaderboardId);
    // public System.Void ClearAllLeaderboards(System.Boolean deleteLeaderboardFile)
    // Offset: 0x2B9CD80
    void ClearAllLeaderboards(bool deleteLeaderboardFile);
    // public System.Void .ctor()
    // Offset: 0x2B9DE64
    // Implemented from: PersistentScriptableObject
    // Base method: System.Void PersistentScriptableObject::.ctor()
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LocalLeaderboardsModel* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::LocalLeaderboardsModel::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LocalLeaderboardsModel*, creationType>()));
    }
    // protected override System.Void OnEnable()
    // Offset: 0x2B9D108
    // Implemented from: PersistentScriptableObject
    // Base method: System.Void PersistentScriptableObject::OnEnable()
    void OnEnable();
  }; // LocalLeaderboardsModel
  #pragma pack(pop)
  static check_size<sizeof(LocalLeaderboardsModel), 64 + sizeof(System::Collections::Generic::List_1<GlobalNamespace::LocalLeaderboardsModel::LeaderboardData*>*)> __GlobalNamespace_LocalLeaderboardsModelSizeCheck;
  static_assert(sizeof(LocalLeaderboardsModel) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::LocalLeaderboardsModel::LeaderboardType, "", "LocalLeaderboardsModel/LeaderboardType");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::LocalLeaderboardsModel::add_newScoreWasAddedToLeaderboardEvent
// Il2CppName: add_newScoreWasAddedToLeaderboardEvent
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::LocalLeaderboardsModel::*)(System::Action_2<::StringW, GlobalNamespace::LocalLeaderboardsModel::LeaderboardType>*)>(&GlobalNamespace::LocalLeaderboardsModel::add_newScoreWasAddedToLeaderboardEvent)> {
  static const MethodInfo* get() {
