// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: TeleportAimHandler
  class TeleportAimHandler;
  // Forward declaring type: LocomotionController
  class LocomotionController;
  // Forward declaring type: TeleportDestination
  class TeleportDestination;
  // Forward declaring type: TeleportInputHandler
  class TeleportInputHandler;
  // Skipping declaration: States because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Action_4;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: LayerMask
  struct LayerMask;
  // Forward declaring type: RaycastHit
  struct RaycastHit;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: LocomotionTeleport
  class LocomotionTeleport;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::LocomotionTeleport);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::LocomotionTeleport*, "", "LocomotionTeleport");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: LocomotionTeleport
  // [TokenAttribute] Offset: FFFFFFFF
  class LocomotionTeleport : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::LocomotionTeleport::States
    struct States;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::TeleportIntentions
    struct TeleportIntentions;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::AimCollisionTypes
    struct AimCollisionTypes;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::AimData
    class AimData;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::$ReadyStateCoroutine$d__52
    class $ReadyStateCoroutine$d__52;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::$AimStateCoroutine$d__64
    class $AimStateCoroutine$d__64;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::$CancelAimStateCoroutine$d__68
    class $CancelAimStateCoroutine$d__68;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::$PreTeleportStateCoroutine$d__72
    class $PreTeleportStateCoroutine$d__72;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::$CancelTeleportStateCoroutine$d__76
    class $CancelTeleportStateCoroutine$d__76;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::$TeleportingStateCoroutine$d__80
    class $TeleportingStateCoroutine$d__80;
    // Nested type: ::GlobalNamespace::LocomotionTeleport::$PostTeleportStateCoroutine$d__84
    class $PostTeleportStateCoroutine$d__84;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: LocomotionTeleport/States
    // [TokenAttribute] Offset: FFFFFFFF
    struct States/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: States
      constexpr States(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public LocomotionTeleport/States Ready
      static constexpr const int Ready = 0;
      // Get static field: static public LocomotionTeleport/States Ready
      static ::GlobalNamespace::LocomotionTeleport::States _get_Ready();
      // Set static field: static public LocomotionTeleport/States Ready
      static void _set_Ready(::GlobalNamespace::LocomotionTeleport::States value);
      // static field const value: static public LocomotionTeleport/States Aim
      static constexpr const int Aim = 1;
      // Get static field: static public LocomotionTeleport/States Aim
      static ::GlobalNamespace::LocomotionTeleport::States _get_Aim();
      // Set static field: static public LocomotionTeleport/States Aim
      static void _set_Aim(::GlobalNamespace::LocomotionTeleport::States value);
      // static field const value: static public LocomotionTeleport/States CancelAim
      static constexpr const int CancelAim = 2;
      // Get static field: static public LocomotionTeleport/States CancelAim
      static ::GlobalNamespace::LocomotionTeleport::States _get_CancelAim();
      // Set static field: static public LocomotionTeleport/States CancelAim
      static void _set_CancelAim(::GlobalNamespace::LocomotionTeleport::States value);
      // static field const value: static public LocomotionTeleport/States PreTeleport
      static constexpr const int PreTeleport = 3;
      // Get static field: static public LocomotionTeleport/States PreTeleport
      static ::GlobalNamespace::LocomotionTeleport::States _get_PreTeleport();
      // Set static field: static public LocomotionTeleport/States PreTeleport
      static void _set_PreTeleport(::GlobalNamespace::LocomotionTeleport::States value);
      // static field const value: static public LocomotionTeleport/States CancelTeleport
      static constexpr const int CancelTeleport = 4;
      // Get static field: static public LocomotionTeleport/States CancelTeleport
      static ::GlobalNamespace::LocomotionTeleport::States _get_CancelTeleport();
      // Set static field: static public LocomotionTeleport/States CancelTeleport
      static void _set_CancelTeleport(::GlobalNamespace::LocomotionTeleport::States value);
      // static field const value: static public LocomotionTeleport/States Teleporting
      static constexpr const int Teleporting = 5;
      // Get static field: static public LocomotionTeleport/States Teleporting
      static ::GlobalNamespace::LocomotionTeleport::States _get_Teleporting();
      // Set static field: static public LocomotionTeleport/States Teleporting
      static void _set_Teleporting(::GlobalNamespace::LocomotionTeleport::States value);
      // static field const value: static public LocomotionTeleport/States PostTeleport
      static constexpr const int PostTeleport = 6;
      // Get static field: static public LocomotionTeleport/States PostTeleport
      static ::GlobalNamespace::LocomotionTeleport::States _get_PostTeleport();
      // Set static field: static public LocomotionTeleport/States PostTeleport
      static void _set_PostTeleport(::GlobalNamespace::LocomotionTeleport::States value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // LocomotionTeleport/States
    #pragma pack(pop)
    static check_size<sizeof(LocomotionTeleport::States), 0 + sizeof(int)> __GlobalNamespace_LocomotionTeleport_StatesSizeCheck;
    static_assert(sizeof(LocomotionTeleport::States) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: LocomotionTeleport/TeleportIntentions
    // [TokenAttribute] Offset: FFFFFFFF
    struct TeleportIntentions/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TeleportIntentions
      constexpr TeleportIntentions(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public LocomotionTeleport/TeleportIntentions None
      static constexpr const int None = 0;
      // Get static field: static public LocomotionTeleport/TeleportIntentions None
      static ::GlobalNamespace::LocomotionTeleport::TeleportIntentions _get_None();
      // Set static field: static public LocomotionTeleport/TeleportIntentions None
      static void _set_None(::GlobalNamespace::LocomotionTeleport::TeleportIntentions value);
      // static field const value: static public LocomotionTeleport/TeleportIntentions Aim
      static constexpr const int Aim = 1;
      // Get static field: static public LocomotionTeleport/TeleportIntentions Aim
      static ::GlobalNamespace::LocomotionTeleport::TeleportIntentions _get_Aim();
      // Set static field: static public LocomotionTeleport/TeleportIntentions Aim
      static void _set_Aim(::GlobalNamespace::LocomotionTeleport::TeleportIntentions value);
      // static field const value: static public LocomotionTeleport/TeleportIntentions PreTeleport
      static constexpr const int PreTeleport = 2;
      // Get static field: static public LocomotionTeleport/TeleportIntentions PreTeleport
      static ::GlobalNamespace::LocomotionTeleport::TeleportIntentions _get_PreTeleport();
      // Set static field: static public LocomotionTeleport/TeleportIntentions PreTeleport
      static void _set_PreTeleport(::GlobalNamespace::LocomotionTeleport::TeleportIntentions value);
      // static field const value: static public LocomotionTeleport/TeleportIntentions Teleport
      static constexpr const int Teleport = 3;
      // Get static field: static public LocomotionTeleport/TeleportIntentions Teleport
      static ::GlobalNamespace::LocomotionTeleport::TeleportIntentions _get_Teleport();
      // Set static field: static public LocomotionTeleport/TeleportIntentions Teleport
      static void _set_Teleport(::GlobalNamespace::LocomotionTeleport::TeleportIntentions value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // LocomotionTeleport/TeleportIntentions
    #pragma pack(pop)
    static check_size<sizeof(LocomotionTeleport::TeleportIntentions), 0 + sizeof(int)> __GlobalNamespace_LocomotionTeleport_TeleportIntentionsSizeCheck;
    static_assert(sizeof(LocomotionTeleport::TeleportIntentions) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: LocomotionTeleport/AimCollisionTypes
    // [TokenAttribute] Offset: FFFFFFFF
    struct AimCollisionTypes/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AimCollisionTypes
      constexpr AimCollisionTypes(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public LocomotionTeleport/AimCollisionTypes Point
      static constexpr const int Point = 0;
      // Get static field: static public LocomotionTeleport/AimCollisionTypes Point
      static ::GlobalNamespace::LocomotionTeleport::AimCollisionTypes _get_Point();
      // Set static field: static public LocomotionTeleport/AimCollisionTypes Point
      static void _set_Point(::GlobalNamespace::LocomotionTeleport::AimCollisionTypes value);
      // static field const value: static public LocomotionTeleport/AimCollisionTypes Sphere
      static constexpr const int Sphere = 1;
      // Get static field: static public LocomotionTeleport/AimCollisionTypes Sphere
      static ::GlobalNamespace::LocomotionTeleport::AimCollisionTypes _get_Sphere();
      // Set static field: static public LocomotionTeleport/AimCollisionTypes Sphere
      static void _set_Sphere(::GlobalNamespace::LocomotionTeleport::AimCollisionTypes value);
      // static field const value: static public LocomotionTeleport/AimCollisionTypes Capsule
      static constexpr const int Capsule = 2;
      // Get static field: static public LocomotionTeleport/AimCollisionTypes Capsule
      static ::GlobalNamespace::LocomotionTeleport::AimCollisionTypes _get_Capsule();
      // Set static field: static public LocomotionTeleport/AimCollisionTypes Capsule
      static void _set_Capsule(::GlobalNamespace::LocomotionTeleport::AimCollisionTypes value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // LocomotionTeleport/AimCollisionTypes
    #pragma pack(pop)
    static check_size<sizeof(LocomotionTeleport::AimCollisionTypes), 0 + sizeof(int)> __GlobalNamespace_LocomotionTeleport_AimCollisionTypesSizeCheck;
    static_assert(sizeof(LocomotionTeleport::AimCollisionTypes) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0x9938BC
    // public System.Boolean EnableMovementDuringReady
    // Size: 0x1
    // Offset: 0x18
    bool EnableMovementDuringReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x9938F4
    // public System.Boolean EnableMovementDuringAim
    // Size: 0x1
    // Offset: 0x19
    bool EnableMovementDuringAim;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x99392C
    // public System.Boolean EnableMovementDuringPreTeleport
    // Size: 0x1
    // Offset: 0x1A
    bool EnableMovementDuringPreTeleport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x993964
    // public System.Boolean EnableMovementDuringPostTeleport
    // Size: 0x1
    // Offset: 0x1B
    bool EnableMovementDuringPostTeleport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x99399C
    // public System.Boolean EnableRotationDuringReady
    // Size: 0x1
    // Offset: 0x1C
    bool EnableRotationDuringReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x9939D4
    // public System.Boolean EnableRotationDuringAim
    // Size: 0x1
    // Offset: 0x1D
    bool EnableRotationDuringAim;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x993A0C
    // public System.Boolean EnableRotationDuringPreTeleport
    // Size: 0x1
    // Offset: 0x1E
    bool EnableRotationDuringPreTeleport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x993A44
    // public System.Boolean EnableRotationDuringPostTeleport
    // Size: 0x1
    // Offset: 0x1F
    bool EnableRotationDuringPostTeleport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private LocomotionTeleport/States <CurrentState>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    ::GlobalNamespace::LocomotionTeleport::States CurrentState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LocomotionTeleport::States) == 0x4);
    // Padding between fields: CurrentState and: AimHandler
    char __padding8[0x4] = {};
    // public TeleportAimHandler AimHandler
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::TeleportAimHandler* AimHandler;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TeleportAimHandler*) == 0x8);
    // [TooltipAttribute] Offset: 0x993A8C
    // public TeleportDestination TeleportDestinationPrefab
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::TeleportDestination* TeleportDestinationPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TeleportDestination*) == 0x8);
    // [TooltipAttribute] Offset: 0x993AC4
    // public System.Int32 TeleportDestinationLayer
    // Size: 0x4
    // Offset: 0x38
    int TeleportDestinationLayer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: TeleportDestinationLayer and: UpdateTeleportDestination
    char __padding11[0x4] = {};
    // private System.Action`4<System.Boolean,System.Nullable`1<UnityEngine.Vector3>,System.Nullable`1<UnityEngine.Quaternion>,System.Nullable`1<UnityEngine.Quaternion>> UpdateTeleportDestination
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_4<bool, ::System::Nullable_1<::UnityEngine::Vector3>, ::System::Nullable_1<::UnityEngine::Quaternion>, ::System::Nullable_1<::UnityEngine::Quaternion>>* UpdateTeleportDestination;
    // Field size check
    static_assert(sizeof(::System::Action_4<bool, ::System::Nullable_1<::UnityEngine::Vector3>, ::System::Nullable_1<::UnityEngine::Quaternion>, ::System::Nullable_1<::UnityEngine::Quaternion>>*) == 0x8);
    // public TeleportInputHandler InputHandler
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::TeleportInputHandler* InputHandler;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TeleportInputHandler*) == 0x8);
    // public LocomotionTeleport/TeleportIntentions CurrentIntention
    // Size: 0x4
    // Offset: 0x50
    ::GlobalNamespace::LocomotionTeleport::TeleportIntentions CurrentIntention;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LocomotionTeleport::TeleportIntentions) == 0x4);
    // public System.Boolean IsPreTeleportRequested
    // Size: 0x1
    // Offset: 0x54
    bool IsPreTeleportRequested;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean IsTransitioning
    // Size: 0x1
    // Offset: 0x55
    bool IsTransitioning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean IsPostTeleportRequested
    // Size: 0x1
    // Offset: 0x56
    bool IsPostTeleportRequested;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsPostTeleportRequested and: teleportDestination
    char __padding17[0x1] = {};
    // private TeleportDestination _teleportDestination
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::TeleportDestination* teleportDestination;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TeleportDestination*) == 0x8);
    // private LocomotionController <LocomotionController>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::LocomotionController* LocomotionController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LocomotionController*) == 0x8);
    // [TooltipAttribute] Offset: 0x993B1C
    // public LocomotionTeleport/AimCollisionTypes AimCollisionType
    // Size: 0x4
    // Offset: 0x68
    ::GlobalNamespace::LocomotionTeleport::AimCollisionTypes AimCollisionType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LocomotionTeleport::AimCollisionTypes) == 0x4);
    // [TooltipAttribute] Offset: 0x993B54
    // public System.Boolean UseCharacterCollisionData
    // Size: 0x1
    // Offset: 0x6C
    bool UseCharacterCollisionData;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UseCharacterCollisionData and: AimCollisionRadius
    char __padding21[0x3] = {};
    // [TooltipAttribute] Offset: 0x993B8C
    // public System.Single AimCollisionRadius
    // Size: 0x4
    // Offset: 0x70
    float AimCollisionRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x993BC4
    // public System.Single AimCollisionHeight
    // Size: 0x4
    // Offset: 0x74
    float AimCollisionHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Action EnterStateReady
    // Size: 0x8
    // Offset: 0x78
    ::System::Action* EnterStateReady;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action EnterStateAim
    // Size: 0x8
    // Offset: 0x80
    ::System::Action* EnterStateAim;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<LocomotionTeleport/AimData> UpdateAimData
    // Size: 0x8
    // Offset: 0x88
    ::System::Action_1<::GlobalNamespace::LocomotionTeleport::AimData*>* UpdateAimData;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::LocomotionTeleport::AimData*>*) == 0x8);
    // private System.Action ExitStateAim
    // Size: 0x8
    // Offset: 0x90
    ::System::Action* ExitStateAim;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action EnterStateCancelAim
    // Size: 0x8
    // Offset: 0x98
    ::System::Action* EnterStateCancelAim;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action EnterStatePreTeleport
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action* EnterStatePreTeleport;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action EnterStateCancelTeleport
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action* EnterStateCancelTeleport;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action EnterStateTeleporting
    // Size: 0x8
    // Offset: 0xB0
    ::System::Action* EnterStateTeleporting;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action EnterStatePostTeleport
    // Size: 0x8
    // Offset: 0xB8
    ::System::Action* EnterStatePostTeleport;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`3<UnityEngine.Transform,UnityEngine.Vector3,UnityEngine.Quaternion> Teleported
    // Size: 0x8
    // Offset: 0xC0
    ::System::Action_3<::UnityEngine::Transform*, ::UnityEngine::Vector3, ::UnityEngine::Quaternion>* Teleported;
    // Field size check
    static_assert(sizeof(::System::Action_3<::UnityEngine::Transform*, ::UnityEngine::Vector3, ::UnityEngine::Quaternion>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Boolean EnableMovementDuringReady
    [[deprecated("Use field access instead!")]] bool& dyn_EnableMovementDuringReady();
    // Get instance field reference: public System.Boolean EnableMovementDuringAim
    [[deprecated("Use field access instead!")]] bool& dyn_EnableMovementDuringAim();
    // Get instance field reference: public System.Boolean EnableMovementDuringPreTeleport
    [[deprecated("Use field access instead!")]] bool& dyn_EnableMovementDuringPreTeleport();
