// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: PersistentScriptableObject
#include "GlobalNamespace/PersistentScriptableObject.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: FloatSO
  class FloatSO;
  // Forward declaring type: BoolSO
  class BoolSO;
  // Forward declaring type: Vector2IntSO
  class Vector2IntSO;
  // Forward declaring type: IntSO
  class IntSO;
  // Forward declaring type: Vector3SO
  class Vector3SO;
  // Forward declaring type: LanguageSO
  class LanguageSO;
  // Forward declaring type: StringSO
  class StringSO;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x154
  #pragma pack(push, 1)
  // Autogenerated type: MainSettingsModelSO
  // [TokenAttribute] Offset: FFFFFFFF
  class MainSettingsModelSO : public GlobalNamespace::PersistentScriptableObject {
    public:
    // Nested type: GlobalNamespace::MainSettingsModelSO::WindowMode
    struct WindowMode;
    // Nested type: GlobalNamespace::MainSettingsModelSO::Config
    class Config;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // [SOVariableAttribute] Offset: 0xF02754
    // public FloatSO vrResolutionScale
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::FloatSO* vrResolutionScale;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02764
    // public FloatSO menuVRResolutionScaleMultiplier
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::FloatSO* menuVRResolutionScaleMultiplier;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02774
    // public BoolSO useFixedFoveatedRenderingDuringGameplay
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::BoolSO* useFixedFoveatedRenderingDuringGameplay;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02784
    // public Vector2IntSO windowResolution
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::Vector2IntSO* windowResolution;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector2IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02794
    // public BoolSO fullscreen
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::BoolSO* fullscreen;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF027A4
    // public IntSO antiAliasingLevel
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::IntSO* antiAliasingLevel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF027B4
    // public FloatSO volume
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::FloatSO* volume;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF027C4
    // public FloatSO ambientVolumeScale
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::FloatSO* ambientVolumeScale;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF027D4
    // public BoolSO controllersRumbleEnabled
    // Size: 0x8
    // Offset: 0x58
    GlobalNamespace::BoolSO* controllersRumbleEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF027E4
    // public Vector3SO roomCenter
    // Size: 0x8
    // Offset: 0x60
    GlobalNamespace::Vector3SO* roomCenter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF027F4
    // public FloatSO roomRotation
    // Size: 0x8
    // Offset: 0x68
    GlobalNamespace::FloatSO* roomRotation;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02804
    // public Vector3SO controllerPosition
    // Size: 0x8
    // Offset: 0x70
    GlobalNamespace::Vector3SO* controllerPosition;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02814
    // public Vector3SO controllerRotation
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::Vector3SO* controllerRotation;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02824
    // public IntSO mirrorGraphicsSettings
    // Size: 0x8
    // Offset: 0x80
    GlobalNamespace::IntSO* mirrorGraphicsSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02834
    // public IntSO mainEffectGraphicsSettings
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::IntSO* mainEffectGraphicsSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02844
    // public IntSO bloomPrePassGraphicsSettings
    // Size: 0x8
    // Offset: 0x90
    GlobalNamespace::IntSO* bloomPrePassGraphicsSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02854
    // public BoolSO smokeGraphicsSettings
    // Size: 0x8
    // Offset: 0x98
    GlobalNamespace::BoolSO* smokeGraphicsSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02864
    // public BoolSO enableAlphaFeatures
    // Size: 0x8
    // Offset: 0xA0
    GlobalNamespace::BoolSO* enableAlphaFeatures;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02874
    // public IntSO pauseButtonPressDurationLevel
    // Size: 0x8
    // Offset: 0xA8
    GlobalNamespace::IntSO* pauseButtonPressDurationLevel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02884
    // public BoolSO burnMarkTrailsEnabled
    // Size: 0x8
    // Offset: 0xB0
    GlobalNamespace::BoolSO* burnMarkTrailsEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02894
    // public BoolSO screenDisplacementEffectsEnabled
    // Size: 0x8
    // Offset: 0xB8
    GlobalNamespace::BoolSO* screenDisplacementEffectsEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF028A4
    // public BoolSO smoothCameraEnabled
    // Size: 0x8
    // Offset: 0xC0
    GlobalNamespace::BoolSO* smoothCameraEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF028B4
    // public FloatSO smoothCameraFieldOfView
    // Size: 0x8
    // Offset: 0xC8
    GlobalNamespace::FloatSO* smoothCameraFieldOfView;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF028C4
    // public Vector3SO smoothCameraThirdPersonPosition
    // Size: 0x8
    // Offset: 0xD0
    GlobalNamespace::Vector3SO* smoothCameraThirdPersonPosition;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF028D4
    // public Vector3SO smoothCameraThirdPersonEulerAngles
    // Size: 0x8
    // Offset: 0xD8
    GlobalNamespace::Vector3SO* smoothCameraThirdPersonEulerAngles;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF028E4
    // public BoolSO smoothCameraThirdPersonEnabled
    // Size: 0x8
    // Offset: 0xE0
    GlobalNamespace::BoolSO* smoothCameraThirdPersonEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF028F4
    // public FloatSO smoothCameraRotationSmooth
    // Size: 0x8
    // Offset: 0xE8
    GlobalNamespace::FloatSO* smoothCameraRotationSmooth;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02904
    // public FloatSO smoothCameraPositionSmooth
    // Size: 0x8
    // Offset: 0xF0
    GlobalNamespace::FloatSO* smoothCameraPositionSmooth;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02914
    // public BoolSO overrideAudioLatency
    // Size: 0x8
    // Offset: 0xF8
    GlobalNamespace::BoolSO* overrideAudioLatency;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02924
    // public FloatSO audioLatency
    // Size: 0x8
    // Offset: 0x100
    GlobalNamespace::FloatSO* audioLatency;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02934
    // public IntSO maxShockwaveParticles
    // Size: 0x8
    // Offset: 0x108
    GlobalNamespace::IntSO* maxShockwaveParticles;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02944
    // public IntSO maxNumberOfCutSoundEffects
    // Size: 0x8
    // Offset: 0x110
    GlobalNamespace::IntSO* maxNumberOfCutSoundEffects;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02954
    // public BoolSO onlineServicesEnabled
    // Size: 0x8
    // Offset: 0x118
    GlobalNamespace::BoolSO* onlineServicesEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02964
    // public BoolSO oculusMRCEnabled
    // Size: 0x8
    // Offset: 0x120
    GlobalNamespace::BoolSO* oculusMRCEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02974
    // public BoolSO openVrThreadedHaptics
    // Size: 0x8
    // Offset: 0x128
    GlobalNamespace::BoolSO* openVrThreadedHaptics;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02984
    // public LanguageSO language
    // Size: 0x8
    // Offset: 0x130
    GlobalNamespace::LanguageSO* language;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LanguageSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF02994
    // public BoolSO useCustomServerEnvironment
    // Size: 0x8
    // Offset: 0x138
    GlobalNamespace::BoolSO* useCustomServerEnvironment;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF029A4
    // public StringSO customServerHostName
    // Size: 0x8
    // Offset: 0x140
    GlobalNamespace::StringSO* customServerHostName;
    // Field size check
    static_assert(sizeof(GlobalNamespace::StringSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xF029B4
    // public BoolSO depthTextureEnabled
    // Size: 0x8
    // Offset: 0x148
    GlobalNamespace::BoolSO* depthTextureEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // private System.Boolean <createScreenshotDuringTheGame>k__BackingField
    // Size: 0x1
    // Offset: 0x150
    bool createScreenshotDuringTheGame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <playingForTheFirstTime>k__BackingField
    // Size: 0x1
    // Offset: 0x151
    bool playingForTheFirstTime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _playingForTheFirstTimeChecked
    // Size: 0x1
    // Offset: 0x152
    bool playingForTheFirstTimeChecked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isLoaded
    // Size: 0x1
    // Offset: 0x153
    bool isLoaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static public System.Single kDefaultPlayerHeight
    static constexpr const float kDefaultPlayerHeight = 1.8;
    // Get static field: static public System.Single kDefaultPlayerHeight
    static float _get_kDefaultPlayerHeight();
    // Set static field: static public System.Single kDefaultPlayerHeight
    static void _set_kDefaultPlayerHeight(float value);
    // static field const value: static public System.Single kHeadPosToPlayerHeightOffset
    static constexpr const float kHeadPosToPlayerHeightOffset = 0.1;
    // Get static field: static public System.Single kHeadPosToPlayerHeightOffset
    static float _get_kHeadPosToPlayerHeightOffset();
