// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MainSettingsModelSO
  class MainSettingsModelSO;
  // Forward declaring type: AudioManagerSO
  class AudioManagerSO;
  // Forward declaring type: PerceivedLoudnessPerLevelSO
  class PerceivedLoudnessPerLevelSO;
  // Forward declaring type: RelativeSfxVolumePerLevelSO
  class RelativeSfxVolumePerLevelSO;
  // Forward declaring type: AvatarDataModel
  class AvatarDataModel;
  // Forward declaring type: AvatarPartsModelSO
  class AvatarPartsModelSO;
  // Forward declaring type: SkinColorSetSO
  class SkinColorSetSO;
  // Forward declaring type: MirrorRendererGraphicsSettingsPresets
  class MirrorRendererGraphicsSettingsPresets;
  // Forward declaring type: MainEffectGraphicsSettingsPresetsSO

  // Forward declaring type: OpenVRHelper
  class OpenVRHelper;
  // Forward declaring type: DevicelessVRHelper
  class DevicelessVRHelper;
  // Forward declaring type: TestPlatformAdditionalContentModel
  class TestPlatformAdditionalContentModel;
  // Forward declaring type: PS4PlatformAdditionalContentModel
  class PS4PlatformAdditionalContentModel;
  // Forward declaring type: OculusPlatformAdditionalContentModel
  class OculusPlatformAdditionalContentModel;
  // Forward declaring type: SteamPlatformAdditionalContentModel
  class SteamPlatformAdditionalContentModel;
  // Forward declaring type: SteamLevelProductsModelSO
  class SteamLevelProductsModelSO;
  // Forward declaring type: OculusLevelProductsModelSO
  class OculusLevelProductsModelSO;
  // Forward declaring type: PS4LevelProductsModelSO
  class PS4LevelProductsModelSO;
  // Forward declaring type: PS4LeaderboardIdsModelSO
  class PS4LeaderboardIdsModelSO;
  // Forward declaring type: RichPresenceManager
  class RichPresenceManager;
  // Forward declaring type: DlcPromoPanelDataSO
  class DlcPromoPanelDataSO;
  // Forward declaring type: NetworkConfigSO
  class NetworkConfigSO;
  // Forward declaring type: SteamNetworkPlayerModel
  class SteamNetworkPlayerModel;
  // Forward declaring type: OculusNetworkPlayerModel
  class OculusNetworkPlayerModel;
  // Forward declaring type: PS4NetworkPlayerModel
  class PS4NetworkPlayerModel;
  // Forward declaring type: BeatmapCharacteristicCollectionSO
  class BeatmapCharacteristicCollectionSO;
  // Forward declaring type: LeaderboardScoreUploader
  class LeaderboardScoreUploader;
  // Forward declaring type: PlatformLeaderboardsModel
  class PlatformLeaderboardsModel;
  // Forward declaring type: BeatmapLevelSO
  class BeatmapLevelSO;
  // Forward declaring type: RecordingToolInstallerSO
  class RecordingToolInstallerSO;
  // Forward declaring type: EnvironmentCommandLineArgsProvider
  class EnvironmentCommandLineArgsProvider;
  // Forward declaring type: MockPlayersModel
  class MockPlayersModel;
}
// Forward declaring namespace: Tweening
namespace Tweening {
  // Forward declaring type: TimeTweeningManager
  class TimeTweeningManager;
}
// Forward declaring namespace: OnlineServices
namespace OnlineServices {
  // Forward declaring type: ServerManager
  class ServerManager;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: DiContainer
  class DiContainer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MainSystemInit
  class MainSystemInit;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MainSystemInit);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MainSystemInit*, "", "MainSystemInit");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x210
  #pragma pack(push, 1)
  // Autogenerated type: MainSystemInit
  // [TokenAttribute] Offset: FFFFFFFF
  class MainSystemInit : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MainSettingsModelSO _mainSettingsModel
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::MainSettingsModelSO* mainSettingsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MainSettingsModelSO*) == 0x8);
    // private AudioManagerSO _audioManager
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::AudioManagerSO* audioManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AudioManagerSO*) == 0x8);
    // private PerceivedLoudnessPerLevelSO _perceivedLoudnessPerLevel
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::PerceivedLoudnessPerLevelSO* perceivedLoudnessPerLevel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PerceivedLoudnessPerLevelSO*) == 0x8);
    // private RelativeSfxVolumePerLevelSO _relativeSfxVolumePerLevel
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::RelativeSfxVolumePerLevelSO* relativeSfxVolumePerLevel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RelativeSfxVolumePerLevelSO*) == 0x8);
    // private AvatarDataModel _avatarDataModel
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::AvatarDataModel* avatarDataModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarDataModel*) == 0x8);
    // private AvatarPartsModelSO _avatarPartsModel
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::AvatarPartsModelSO* avatarPartsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarPartsModelSO*) == 0x8);
    // private SkinColorSetSO _skinColorSet
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::SkinColorSetSO* skinColorSet;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SkinColorSetSO*) == 0x8);
    // private MirrorRendererGraphicsSettingsPresets _mirrorRendererGraphicsSettingsPresets
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::MirrorRendererGraphicsSettingsPresets* mirrorRendererGraphicsSettingsPresets;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MirrorRendererGraphicsSettingsPresets*) == 0x8);
    // private MainEffectGraphicsSettingsPresetsSO _mainEffectGraphicsSettingsPresets
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::MainEffectGraphicsSettingsPresetsSO* mainEffectGraphicsSettingsPresets;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MainEffectGraphicsSettingsPresetsSO*) == 0x8);
    // private BloomPrePassGraphicsSettingsPresetsSO _bloomPrePassGraphicsSettingsPresets
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::BloomPrePassGraphicsSettingsPresetsSO* bloomPrePassGraphicsSettingsPresets;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BloomPrePassGraphicsSettingsPresetsSO*) == 0x8);
    // private MirrorRendererSO _mirrorRenderer
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::MirrorRendererSO* mirrorRenderer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MirrorRendererSO*) == 0x8);
    // private MainEffectContainerSO _mainEffectContainer
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::MainEffectContainerSO* mainEffectContainer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MainEffectContainerSO*) == 0x8);
    // private BloomPrePassEffectContainerSO _bloomPrePassEffectContainer
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::BloomPrePassEffectContainerSO* bloomPrePassEffectContainer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BloomPrePassEffectContainerSO*) == 0x8);
    // private SongPackMaskModelSO _songPackMaskModel
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::SongPackMaskModelSO* songPackMaskModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SongPackMaskModelSO*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F100
    // private AppStaticSettingsSO _appStaticSettings
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::AppStaticSettingsSO* appStaticSettings;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AppStaticSettingsSO*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F138
    // private StandardLevelScenesTransitionSetupDataSO _standardLevelScenesTransitionSetupData
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::StandardLevelScenesTransitionSetupDataSO* standardLevelScenesTransitionSetupData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::StandardLevelScenesTransitionSetupDataSO*) == 0x8);
    // private MissionLevelScenesTransitionSetupDataSO _missionLevelScenesTransitionSetupData
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::MissionLevelScenesTransitionSetupDataSO* missionLevelScenesTransitionSetupData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MissionLevelScenesTransitionSetupDataSO*) == 0x8);
    // private MultiplayerLevelScenesTransitionSetupDataSO _multiplayerLevelScenesTransitionSetupData
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::MultiplayerLevelScenesTransitionSetupDataSO* multiplayerLevelScenesTransitionSetupData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerLevelScenesTransitionSetupDataSO*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F190
    // private TimeHelper _timeHelperPrefab
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::TimeHelper* timeHelperPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TimeHelper*) == 0x8);
    // private PlayerDataModel _playerDataModelPrefab
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::PlayerDataModel* playerDataModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerDataModel*) == 0x8);
    // private CampaignProgressModel _campaignProgressModelPrefab
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::CampaignProgressModel* campaignProgressModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::CampaignProgressModel*) == 0x8);
    // private BeatmapLevelsModel _beatmapLevelsModelPrefab
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::BeatmapLevelsModel* beatmapLevelsModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapLevelsModel*) == 0x8);
    // private CustomLevelLoader _customLevelLoaderPrefab
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::CustomLevelLoader* customLevelLoaderPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::CustomLevelLoader*) == 0x8);
    // private CachedMediaAsyncLoader _cachedMediaAsyncLoaderPrefab
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::CachedMediaAsyncLoader* cachedMediaAsyncLoaderPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::CachedMediaAsyncLoader*) == 0x8);
    // private ExternalCamerasManager _externalCamerasManagerPrefab
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::ExternalCamerasManager* externalCamerasManagerPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ExternalCamerasManager*) == 0x8);
    // private MultiplayerSessionManager _multiplayerSessionManagerPrefab
    // Size: 0x8
    // Offset: 0xE0
    ::GlobalNamespace::MultiplayerSessionManager* multiplayerSessionManagerPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerSessionManager*) == 0x8);
    // private VoipManager _voipManagerPrefab
    // Size: 0x8
    // Offset: 0xE8
    ::GlobalNamespace::VoipManager* voipManagerPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VoipManager*) == 0x8);
    // private LocalNetworkPlayerModel _localNetworkPlayerModelPrefab
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::LocalNetworkPlayerModel* localNetworkPlayerModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LocalNetworkPlayerModel*) == 0x8);
    // private MasterServerNetworkPlayerModel _masterServerNetworkPlayerModelPrefab
    // Size: 0x8
    // Offset: 0xF8
    ::GlobalNamespace::MasterServerNetworkPlayerModel* masterServerNetworkPlayerModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MasterServerNetworkPlayerModel*) == 0x8);
    // private GameLiftNetworkPlayerModel _gameLiftNetworkPlayerModelPrefab
    // Size: 0x8
    // Offset: 0x100
    ::GlobalNamespace::GameLiftNetworkPlayerModel* gameLiftNetworkPlayerModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameLiftNetworkPlayerModel*) == 0x8);
    // private NetworkPlayerEntitlementChecker _networkPlayerEntitlementCheckerPrefab
    // Size: 0x8
    // Offset: 0x108
    ::GlobalNamespace::NetworkPlayerEntitlementChecker* networkPlayerEntitlementCheckerPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetworkPlayerEntitlementChecker*) == 0x8);
    // private HapticFeedbackController _hapticFeedbackControllerPrefab
    // Size: 0x8
    // Offset: 0x110
    ::GlobalNamespace::HapticFeedbackController* hapticFeedbackControllerPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HapticFeedbackController*) == 0x8);
    // private Tweening.TimeTweeningManager _tweeningManagerPrefab
    // Size: 0x8
    // Offset: 0x118
    ::Tweening::TimeTweeningManager* tweeningManagerPrefab;
    // Field size check
    static_assert(sizeof(::Tweening::TimeTweeningManager*) == 0x8);
    // private BloomPrePassLightsUpdateSystem _lightsUpdateSystemPrefab
    // Size: 0x8
    // Offset: 0x120
    ::GlobalNamespace::BloomPrePassLightsUpdateSystem* lightsUpdateSystemPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BloomPrePassLightsUpdateSystem*) == 0x8);
    // private EnvironmentAudioEffectsPlayer _environmentAudioEffectsPlayerPrefab
    // Size: 0x8
    // Offset: 0x128
    ::GlobalNamespace::EnvironmentAudioEffectsPlayer* environmentAudioEffectsPlayerPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EnvironmentAudioEffectsPlayer*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F2C8
    // private NodePoseSyncStateManager _nodePoseSyncStateManagerPrefab
    // Size: 0x8
    // Offset: 0x130
    ::GlobalNamespace::NodePoseSyncStateManager* nodePoseSyncStateManagerPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NodePoseSyncStateManager*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F300
    // private AlwaysOwnedContentContainerSO _alwaysOwnedContentContainer
    // Size: 0x8
    // Offset: 0x138
    ::GlobalNamespace::AlwaysOwnedContentContainerSO* alwaysOwnedContentContainer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AlwaysOwnedContentContainerSO*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F338
    // private PSVRHelper _psVRHelperPrefab
    // Size: 0x8
    // Offset: 0x140
    ::GlobalNamespace::PSVRHelper* psVRHelperPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PSVRHelper*) == 0x8);
    // private OculusVRHelper _oculusVRHelperPrefab
    // Size: 0x8
    // Offset: 0x148
    ::GlobalNamespace::OculusVRHelper* oculusVRHelperPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OculusVRHelper*) == 0x8);
    // private OpenVRHelper _openVRHelperPrefab
    // Size: 0x8
    // Offset: 0x150
    ::GlobalNamespace::OpenVRHelper* openVRHelperPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OpenVRHelper*) == 0x8);
    // private DevicelessVRHelper _devicelessVRHelperPrefab
    // Size: 0x8
    // Offset: 0x158
    ::GlobalNamespace::DevicelessVRHelper* devicelessVRHelperPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::DevicelessVRHelper*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F3A0
    // private TestPlatformAdditionalContentModel _testPlatformAdditionalContentModelPrefab
    // Size: 0x8
    // Offset: 0x160
    ::GlobalNamespace::TestPlatformAdditionalContentModel* testPlatformAdditionalContentModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TestPlatformAdditionalContentModel*) == 0x8);
    // private PS4PlatformAdditionalContentModel _ps4PlatformAdditionalContentModelPrefab
    // Size: 0x8
    // Offset: 0x168
    ::GlobalNamespace::PS4PlatformAdditionalContentModel* ps4PlatformAdditionalContentModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PS4PlatformAdditionalContentModel*) == 0x8);
    // private OculusPlatformAdditionalContentModel _oculusPlatformAdditionalContentModelPrefab
    // Size: 0x8
    // Offset: 0x170
    ::GlobalNamespace::OculusPlatformAdditionalContentModel* oculusPlatformAdditionalContentModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OculusPlatformAdditionalContentModel*) == 0x8);
    // private SteamPlatformAdditionalContentModel _steamPlatformAdditionalContentModelPrefab
    // Size: 0x8
    // Offset: 0x178
    ::GlobalNamespace::SteamPlatformAdditionalContentModel* steamPlatformAdditionalContentModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamPlatformAdditionalContentModel*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F408
    // private SteamLevelProductsModelSO _steamLevelProductsModel
    // Size: 0x8
    // Offset: 0x180
    ::GlobalNamespace::SteamLevelProductsModelSO* steamLevelProductsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamLevelProductsModelSO*) == 0x8);
    // private OculusLevelProductsModelSO _oculusLevelProducsModel
    // Size: 0x8
    // Offset: 0x188
    ::GlobalNamespace::OculusLevelProductsModelSO* oculusLevelProducsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OculusLevelProductsModelSO*) == 0x8);
    // private PS4LevelProductsModelSO _ps4LevelProductsModel
    // Size: 0x8
    // Offset: 0x190
    ::GlobalNamespace::PS4LevelProductsModelSO* ps4LevelProductsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PS4LevelProductsModelSO*) == 0x8);
    // private PS4LeaderboardIdsModelSO _ps4LeaderboardIdsModel
    // Size: 0x8
    // Offset: 0x198
    ::GlobalNamespace::PS4LeaderboardIdsModelSO* ps4LeaderboardIdsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PS4LeaderboardIdsModelSO*) == 0x8);
    // private OnlineServices.ServerManager _onlineServicesServerManagerPrefab
    // Size: 0x8
    // Offset: 0x1A0
    ::OnlineServices::ServerManager* onlineServicesServerManagerPrefab;
    // Field size check
    static_assert(sizeof(::OnlineServices::ServerManager*) == 0x8);
    // private RichPresenceManager _richPresenceManagerPrefab
    // Size: 0x8
    // Offset: 0x1A8
    ::GlobalNamespace::RichPresenceManager* richPresenceManagerPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RichPresenceManager*) == 0x8);
    // private DlcPromoPanelDataSO _dlcPromoPanelData
    // Size: 0x8
    // Offset: 0x1B0
    ::GlobalNamespace::DlcPromoPanelDataSO* dlcPromoPanelData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::DlcPromoPanelDataSO*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F4A0
    // private NetworkConfigSO _networkConfig
    // Size: 0x8
    // Offset: 0x1B8
    ::GlobalNamespace::NetworkConfigSO* networkConfig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetworkConfigSO*) == 0x8);
    // private SteamNetworkPlayerModel _steamNetworkPlayerModelPrefab
    // Size: 0x8
    // Offset: 0x1C0
    ::GlobalNamespace::SteamNetworkPlayerModel* steamNetworkPlayerModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamNetworkPlayerModel*) == 0x8);
    // private OculusNetworkPlayerModel _oculusNetworkPlayerModelPrefab
    // Size: 0x8
    // Offset: 0x1C8
    ::GlobalNamespace::OculusNetworkPlayerModel* oculusNetworkPlayerModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OculusNetworkPlayerModel*) == 0x8);
    // private PS4NetworkPlayerModel _ps4NetworkPlayerModelPrefab
    // Size: 0x8
    // Offset: 0x1D0
    ::GlobalNamespace::PS4NetworkPlayerModel* ps4NetworkPlayerModelPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PS4NetworkPlayerModel*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F508
    // private BeatmapCharacteristicCollectionSO _beatmapCharacteristicCollection
    // Size: 0x8
    // Offset: 0x1D8
    ::GlobalNamespace::BeatmapCharacteristicCollectionSO* beatmapCharacteristicCollection;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapCharacteristicCollectionSO*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F540
    // private LeaderboardScoreUploader _leaderboardScoreUploader
    // Size: 0x8
    // Offset: 0x1E0
    ::GlobalNamespace::LeaderboardScoreUploader* leaderboardScoreUploader;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LeaderboardScoreUploader*) == 0x8);
    // private PlatformLeaderboardsModel _platformLeaderboardsModel
    // Size: 0x8
    // Offset: 0x1E8
    ::GlobalNamespace::PlatformLeaderboardsModel* platformLeaderboardsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlatformLeaderboardsModel*) == 0x8);
    // private BeatmapLevelSO _anyBeatmapLevelSO
    // Size: 0x8
    // Offset: 0x1F0
    ::GlobalNamespace::BeatmapLevelSO* anyBeatmapLevelSO;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapLevelSO*) == 0x8);
    // [SpaceAttribute] Offset: 0x110F598
    // private RecordingToolInstallerSO _recordingToolInstaller
    // Size: 0x8
    // Offset: 0x1F8
    ::GlobalNamespace::RecordingToolInstallerSO* recordingToolInstaller;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RecordingToolInstallerSO*) == 0x8);
    // private readonly EnvironmentCommandLineArgsProvider _commandLineArgsProvider
    // Size: 0x8
    // Offset: 0x200
    ::GlobalNamespace::EnvironmentCommandLineArgsProvider* commandLineArgsProvider;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EnvironmentCommandLineArgsProvider*) == 0x8);
    // private MockPlayersModel _mockPlayersModel
    // Size: 0x8
    // Offset: 0x208
    ::GlobalNamespace::MockPlayersModel* mockPlayersModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MockPlayersModel*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MainSettingsModelSO _mainSettingsModel
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::MainSettingsModelSO*& dyn__mainSettingsModel();
    // Get instance field reference: private AudioManagerSO _audioManager
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::AudioManagerSO*& dyn__audioManager();
    // Get instance field reference: private PerceivedLoudnessPerLevelSO _perceivedLoudnessPerLevel
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PerceivedLoudnessPerLevelSO*& dyn__perceivedLoudnessPerLevel();
