// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PersistentScriptableObject
#include "GlobalNamespace/PersistentScriptableObject.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: FloatSO
  class FloatSO;
  // Forward declaring type: BoolSO
  class BoolSO;
  // Forward declaring type: Vector2IntSO
  class Vector2IntSO;
  // Forward declaring type: IntSO
  class IntSO;
  // Forward declaring type: Vector3SO
  class Vector3SO;
  // Forward declaring type: LanguageSO
  class LanguageSO;
  // Forward declaring type: StringSO
  class StringSO;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x154
  #pragma pack(push, 1)
  // Autogenerated type: MainSettingsModelSO
  // [TokenAttribute] Offset: FFFFFFFF
  class MainSettingsModelSO : public GlobalNamespace::PersistentScriptableObject {
    public:
    // Nested type: GlobalNamespace::MainSettingsModelSO::WindowMode
    struct WindowMode;
    // Nested type: GlobalNamespace::MainSettingsModelSO::Config
    class Config;
    // [SOVariableAttribute] Offset: 0xE01624
    // public FloatSO vrResolutionScale
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::FloatSO* vrResolutionScale;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01634
    // public FloatSO menuVRResolutionScaleMultiplier
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::FloatSO* menuVRResolutionScaleMultiplier;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01644
    // public BoolSO useFixedFoveatedRenderingDuringGameplay
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::BoolSO* useFixedFoveatedRenderingDuringGameplay;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01654
    // public Vector2IntSO windowResolution
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::Vector2IntSO* windowResolution;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector2IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01664
    // public BoolSO fullscreen
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::BoolSO* fullscreen;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01674
    // public IntSO antiAliasingLevel
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::IntSO* antiAliasingLevel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01684
    // public FloatSO volume
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::FloatSO* volume;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01694
    // public FloatSO ambientVolumeScale
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::FloatSO* ambientVolumeScale;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE016A4
    // public BoolSO controllersRumbleEnabled
    // Size: 0x8
    // Offset: 0x58
    GlobalNamespace::BoolSO* controllersRumbleEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE016B4
    // public Vector3SO roomCenter
    // Size: 0x8
    // Offset: 0x60
    GlobalNamespace::Vector3SO* roomCenter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE016C4
    // public FloatSO roomRotation
    // Size: 0x8
    // Offset: 0x68
    GlobalNamespace::FloatSO* roomRotation;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE016D4
    // public Vector3SO controllerPosition
    // Size: 0x8
    // Offset: 0x70
    GlobalNamespace::Vector3SO* controllerPosition;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE016E4
    // public Vector3SO controllerRotation
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::Vector3SO* controllerRotation;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE016F4
    // public IntSO mirrorGraphicsSettings
    // Size: 0x8
    // Offset: 0x80
    GlobalNamespace::IntSO* mirrorGraphicsSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01704
    // public IntSO mainEffectGraphicsSettings
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::IntSO* mainEffectGraphicsSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01714
    // public IntSO bloomPrePassGraphicsSettings
    // Size: 0x8
    // Offset: 0x90
    GlobalNamespace::IntSO* bloomPrePassGraphicsSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01724
    // public BoolSO smokeGraphicsSettings
    // Size: 0x8
    // Offset: 0x98
    GlobalNamespace::BoolSO* smokeGraphicsSettings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01734
    // public BoolSO enableAlphaFeatures
    // Size: 0x8
    // Offset: 0xA0
    GlobalNamespace::BoolSO* enableAlphaFeatures;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01744
    // public IntSO pauseButtonPressDurationLevel
    // Size: 0x8
    // Offset: 0xA8
    GlobalNamespace::IntSO* pauseButtonPressDurationLevel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01754
    // public BoolSO burnMarkTrailsEnabled
    // Size: 0x8
    // Offset: 0xB0
    GlobalNamespace::BoolSO* burnMarkTrailsEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01764
    // public BoolSO screenDisplacementEffectsEnabled
    // Size: 0x8
    // Offset: 0xB8
    GlobalNamespace::BoolSO* screenDisplacementEffectsEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01774
    // public BoolSO smoothCameraEnabled
    // Size: 0x8
    // Offset: 0xC0
    GlobalNamespace::BoolSO* smoothCameraEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01784
    // public FloatSO smoothCameraFieldOfView
    // Size: 0x8
    // Offset: 0xC8
    GlobalNamespace::FloatSO* smoothCameraFieldOfView;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01794
    // public Vector3SO smoothCameraThirdPersonPosition
    // Size: 0x8
    // Offset: 0xD0
    GlobalNamespace::Vector3SO* smoothCameraThirdPersonPosition;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE017A4
    // public Vector3SO smoothCameraThirdPersonEulerAngles
    // Size: 0x8
    // Offset: 0xD8
    GlobalNamespace::Vector3SO* smoothCameraThirdPersonEulerAngles;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE017B4
    // public BoolSO smoothCameraThirdPersonEnabled
    // Size: 0x8
    // Offset: 0xE0
    GlobalNamespace::BoolSO* smoothCameraThirdPersonEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE017C4
    // public FloatSO smoothCameraRotationSmooth
    // Size: 0x8
    // Offset: 0xE8
    GlobalNamespace::FloatSO* smoothCameraRotationSmooth;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE017D4
    // public FloatSO smoothCameraPositionSmooth
    // Size: 0x8
    // Offset: 0xF0
    GlobalNamespace::FloatSO* smoothCameraPositionSmooth;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE017E4
    // public BoolSO overrideAudioLatency
    // Size: 0x8
    // Offset: 0xF8
    GlobalNamespace::BoolSO* overrideAudioLatency;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE017F4
    // public FloatSO audioLatency
    // Size: 0x8
    // Offset: 0x100
    GlobalNamespace::FloatSO* audioLatency;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01804
    // public IntSO maxShockwaveParticles
    // Size: 0x8
    // Offset: 0x108
    GlobalNamespace::IntSO* maxShockwaveParticles;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01814
    // public IntSO maxNumberOfCutSoundEffects
    // Size: 0x8
    // Offset: 0x110
    GlobalNamespace::IntSO* maxNumberOfCutSoundEffects;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IntSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01824
    // public BoolSO onlineServicesEnabled
    // Size: 0x8
    // Offset: 0x118
    GlobalNamespace::BoolSO* onlineServicesEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01834
    // public BoolSO oculusMRCEnabled
    // Size: 0x8
    // Offset: 0x120
    GlobalNamespace::BoolSO* oculusMRCEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01844
    // public BoolSO openVrThreadedHaptics
    // Size: 0x8
    // Offset: 0x128
    GlobalNamespace::BoolSO* openVrThreadedHaptics;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01854
    // public LanguageSO language
    // Size: 0x8
    // Offset: 0x130
    GlobalNamespace::LanguageSO* language;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LanguageSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01864
    // public BoolSO useCustomServerEnvironment
    // Size: 0x8
    // Offset: 0x138
    GlobalNamespace::BoolSO* useCustomServerEnvironment;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01874
    // public StringSO customServerHostName
    // Size: 0x8
    // Offset: 0x140
    GlobalNamespace::StringSO* customServerHostName;
    // Field size check
    static_assert(sizeof(GlobalNamespace::StringSO*) == 0x8);
    // [SOVariableAttribute] Offset: 0xE01884
    // public BoolSO depthTextureEnabled
    // Size: 0x8
    // Offset: 0x148
    GlobalNamespace::BoolSO* depthTextureEnabled;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BoolSO*) == 0x8);
    // private System.Boolean <createScreenshotDuringTheGame>k__BackingField
    // Size: 0x1
    // Offset: 0x150
    bool createScreenshotDuringTheGame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <playingForTheFirstTime>k__BackingField
    // Size: 0x1
    // Offset: 0x151
    bool playingForTheFirstTime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _playingForTheFirstTimeChecked
    // Size: 0x1
    // Offset: 0x152
    bool playingForTheFirstTimeChecked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isLoaded
    // Size: 0x1
    // Offset: 0x153
    bool isLoaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: MainSettingsModelSO
