// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: MainSettingsModelSO
#include "GlobalNamespace/MainSettingsModelSO.hpp"
// Including type: MainSettingsModelSO/WindowMode
#include "GlobalNamespace/MainSettingsModelSO_WindowMode.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD8
  #pragma pack(push, 1)
  // Autogenerated type: MainSettingsModelSO/Config
  // [TokenAttribute] Offset: FFFFFFFF
  class MainSettingsModelSO::Config : public ::Il2CppObject {
    public:
    // public System.String version
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* version;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.Int32 windowResolutionWidth
    // Size: 0x4
    // Offset: 0x18
    int windowResolutionWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 windowResolutionHeight
    // Size: 0x4
    // Offset: 0x1C
    int windowResolutionHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public MainSettingsModelSO/WindowMode windowMode
    // Size: 0x4
    // Offset: 0x20
    GlobalNamespace::MainSettingsModelSO::WindowMode windowMode;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MainSettingsModelSO::WindowMode) == 0x4);
    // public System.Single vrResolutionScale
    // Size: 0x4
    // Offset: 0x24
    float vrResolutionScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single menuVRResolutionScaleMultiplier
    // Size: 0x4
    // Offset: 0x28
    float menuVRResolutionScaleMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean useFixedFoveatedRenderingDuringGameplay
    // Size: 0x1
    // Offset: 0x2C
    bool useFixedFoveatedRenderingDuringGameplay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useFixedFoveatedRenderingDuringGameplay and: antiAliasingLevel
    char __padding6[0x3] = {};
    // public System.Int32 antiAliasingLevel
    // Size: 0x4
    // Offset: 0x30
    int antiAliasingLevel;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 mirrorGraphicsSettings
    // Size: 0x4
    // Offset: 0x34
    int mirrorGraphicsSettings;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 mainEffectGraphicsSettings
    // Size: 0x4
    // Offset: 0x38
    int mainEffectGraphicsSettings;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 bloomGraphicsSettings
    // Size: 0x4
    // Offset: 0x3C
    int bloomGraphicsSettings;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 smokeGraphicsSettings
    // Size: 0x4
    // Offset: 0x40
    int smokeGraphicsSettings;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean burnMarkTrailsEnabled
    // Size: 0x1
    // Offset: 0x44
    bool burnMarkTrailsEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean screenDisplacementEffectsEnabled
    // Size: 0x1
    // Offset: 0x45
    bool screenDisplacementEffectsEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: screenDisplacementEffectsEnabled and: roomCenterX
    char __padding13[0x2] = {};
    // public System.Single roomCenterX
    // Size: 0x4
    // Offset: 0x48
    float roomCenterX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single roomCenterY
    // Size: 0x4
    // Offset: 0x4C
    float roomCenterY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single roomCenterZ
    // Size: 0x4
    // Offset: 0x50
    float roomCenterZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single roomRotation
    // Size: 0x4
    // Offset: 0x54
    float roomRotation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single controllerPositionX
    // Size: 0x4
    // Offset: 0x58
    float controllerPositionX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single controllerPositionY
    // Size: 0x4
    // Offset: 0x5C
    float controllerPositionY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single controllerPositionZ
    // Size: 0x4
    // Offset: 0x60
    float controllerPositionZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single controllerRotationX
    // Size: 0x4
    // Offset: 0x64
    float controllerRotationX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single controllerRotationY
    // Size: 0x4
    // Offset: 0x68
    float controllerRotationY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single controllerRotationZ
    // Size: 0x4
    // Offset: 0x6C
    float controllerRotationZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 smoothCameraEnabled
    // Size: 0x4
    // Offset: 0x70
    int smoothCameraEnabled;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single smoothCameraFieldOfView
    // Size: 0x4
    // Offset: 0x74
    float smoothCameraFieldOfView;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single smoothCameraThirdPersonPositionX
    // Size: 0x4
    // Offset: 0x78
    float smoothCameraThirdPersonPositionX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single smoothCameraThirdPersonPositionY
    // Size: 0x4
    // Offset: 0x7C
    float smoothCameraThirdPersonPositionY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single smoothCameraThirdPersonPositionZ
    // Size: 0x4
    // Offset: 0x80
    float smoothCameraThirdPersonPositionZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single smoothCameraThirdPersonEulerAnglesX
    // Size: 0x4
    // Offset: 0x84
    float smoothCameraThirdPersonEulerAnglesX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single smoothCameraThirdPersonEulerAnglesY
    // Size: 0x4
    // Offset: 0x88
    float smoothCameraThirdPersonEulerAnglesY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single smoothCameraThirdPersonEulerAnglesZ
    // Size: 0x4
    // Offset: 0x8C
    float smoothCameraThirdPersonEulerAnglesZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 smoothCameraThirdPersonEnabled
    // Size: 0x4
    // Offset: 0x90
    int smoothCameraThirdPersonEnabled;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single smoothCameraRotationSmooth
    // Size: 0x4
    // Offset: 0x94
    float smoothCameraRotationSmooth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single smoothCameraPositionSmooth
    // Size: 0x4
    // Offset: 0x98
    float smoothCameraPositionSmooth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean useCustomServerEnvironment
    // Size: 0x1
    // Offset: 0x9C
    bool useCustomServerEnvironment;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useCustomServerEnvironment and: customServerHostName
    char __padding35[0x3] = {};
    // public System.String customServerHostName
    // Size: 0x8
    // Offset: 0xA0
    ::Il2CppString* customServerHostName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.Single volume
    // Size: 0x4
    // Offset: 0xA8
    float volume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ambientVolumeScale
    // Size: 0x4
    // Offset: 0xAC
    float ambientVolumeScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean controllersRumbleEnabled
    // Size: 0x1
    // Offset: 0xB0
    bool controllersRumbleEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: controllersRumbleEnabled and: enableAlphaFeatures
    char __padding39[0x3] = {};
    // public System.Int32 enableAlphaFeatures
    // Size: 0x4
    // Offset: 0xB4
    int enableAlphaFeatures;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 pauseButtonPressDurationLevel
    // Size: 0x4
    // Offset: 0xB8
    int pauseButtonPressDurationLevel;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 maxShockwaveParticles
    // Size: 0x4
    // Offset: 0xBC
    int maxShockwaveParticles;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean overrideAudioLatency
    // Size: 0x1
    // Offset: 0xC0
    bool overrideAudioLatency;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideAudioLatency and: audioLatency
    char __padding43[0x3] = {};
    // public System.Single audioLatency
    // Size: 0x4
    // Offset: 0xC4
    float audioLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 maxNumberOfCutSoundEffects
    // Size: 0x4
    // Offset: 0xC8
    int maxNumberOfCutSoundEffects;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean onlineServicesEnabled
    // Size: 0x1
    // Offset: 0xCC
    bool onlineServicesEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean oculusMRCEnabled
    // Size: 0x1
    // Offset: 0xCD
    bool oculusMRCEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean openVrThreadedHaptics
    // Size: 0x1
    // Offset: 0xCE
    bool openVrThreadedHaptics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: openVrThreadedHaptics and: language
    char __padding48[0x1] = {};
    // public System.String language
    // Size: 0x8
    // Offset: 0xD0
    ::Il2CppString* language;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: Config
    Config(::Il2CppString* version_ = {}, int windowResolutionWidth_ = {}, int windowResolutionHeight_ = {}, GlobalNamespace::MainSettingsModelSO::WindowMode windowMode_ = {}, float vrResolutionScale_ = {}, float menuVRResolutionScaleMultiplier_ = {}, bool useFixedFoveatedRenderingDuringGameplay_ = {}, int antiAliasingLevel_ = {}, int mirrorGraphicsSettings_ = {}, int mainEffectGraphicsSettings_ = {}, int bloomGraphicsSettings_ = {}, int smokeGraphicsSettings_ = {}, bool burnMarkTrailsEnabled_ = {}, bool screenDisplacementEffectsEnabled_ = {}, float roomCenterX_ = {}, float roomCenterY_ = {}, float roomCenterZ_ = {}, float roomRotation_ = {}, float controllerPositionX_ = {}, float controllerPositionY_ = {}, float controllerPositionZ_ = {}, float controllerRotationX_ = {}, float controllerRotationY_ = {}, float controllerRotationZ_ = {}, int smoothCameraEnabled_ = {}, float smoothCameraFieldOfView_ = {}, float smoothCameraThirdPersonPositionX_ = {}, float smoothCameraThirdPersonPositionY_ = {}, float smoothCameraThirdPersonPositionZ_ = {}, float smoothCameraThirdPersonEulerAnglesX_ = {}, float smoothCameraThirdPersonEulerAnglesY_ = {}, float smoothCameraThirdPersonEulerAnglesZ_ = {}, int smoothCameraThirdPersonEnabled_ = {}, float smoothCameraRotationSmooth_ = {}, float smoothCameraPositionSmooth_ = {}, bool useCustomServerEnvironment_ = {}, ::Il2CppString* customServerHostName_ = {}, float volume_ = {}, float ambientVolumeScale_ = {}, bool controllersRumbleEnabled_ = {}, int enableAlphaFeatures_ = {}, int pauseButtonPressDurationLevel_ = {}, int maxShockwaveParticles_ = {}, bool overrideAudioLatency_ = {}, float audioLatency_ = {}, int maxNumberOfCutSoundEffects_ = {}, bool onlineServicesEnabled_ = {}, bool oculusMRCEnabled_ = {}, bool openVrThreadedHaptics_ = {}, ::Il2CppString* language_ = {}) noexcept : version{version_}, windowResolutionWidth{windowResolutionWidth_}, windowResolutionHeight{windowResolutionHeight_}, windowMode{windowMode_}, vrResolutionScale{vrResolutionScale_}, menuVRResolutionScaleMultiplier{menuVRResolutionScaleMultiplier_}, useFixedFoveatedRenderingDuringGameplay{useFixedFoveatedRenderingDuringGameplay_}, antiAliasingLevel{antiAliasingLevel_}, mirrorGraphicsSettings{mirrorGraphicsSettings_}, mainEffectGraphicsSettings{mainEffectGraphicsSettings_}, bloomGraphicsSettings{bloomGraphicsSettings_}, smokeGraphicsSettings{smokeGraphicsSettings_}, burnMarkTrailsEnabled{burnMarkTrailsEnabled_}, screenDisplacementEffectsEnabled{screenDisplacementEffectsEnabled_}, roomCenterX{roomCenterX_}, roomCenterY{roomCenterY_}, roomCenterZ{roomCenterZ_}, roomRotation{roomRotation_}, controllerPositionX{controllerPositionX_}, controllerPositionY{controllerPositionY_}, controllerPositionZ{controllerPositionZ_}, controllerRotationX{controllerRotationX_}, controllerRotationY{controllerRotationY_}, controllerRotationZ{controllerRotationZ_}, smoothCameraEnabled{smoothCameraEnabled_}, smoothCameraFieldOfView{smoothCameraFieldOfView_}, smoothCameraThirdPersonPositionX{smoothCameraThirdPersonPositionX_}, smoothCameraThirdPersonPositionY{smoothCameraThirdPersonPositionY_}, smoothCameraThirdPersonPositionZ{smoothCameraThirdPersonPositionZ_}, smoothCameraThirdPersonEulerAnglesX{smoothCameraThirdPersonEulerAnglesX_}, smoothCameraThirdPersonEulerAnglesY{smoothCameraThirdPersonEulerAnglesY_}, smoothCameraThirdPersonEulerAnglesZ{smoothCameraThirdPersonEulerAnglesZ_}, smoothCameraThirdPersonEnabled{smoothCameraThirdPersonEnabled_}, smoothCameraRotationSmooth{smoothCameraRotationSmooth_}, smoothCameraPositionSmooth{smoothCameraPositionSmooth_}, useCustomServerEnvironment{useCustomServerEnvironment_}, customServerHostName{customServerHostName_}, volume{volume_}, ambientVolumeScale{ambientVolumeScale_}, controllersRumbleEnabled{controllersRumbleEnabled_}, enableAlphaFeatures{enableAlphaFeatures_}, pauseButtonPressDurationLevel{pauseButtonPressDurationLevel_}, maxShockwaveParticles{maxShockwaveParticles_}, overrideAudioLatency{overrideAudioLatency_}, audioLatency{audioLatency_}, maxNumberOfCutSoundEffects{maxNumberOfCutSoundEffects_}, onlineServicesEnabled{onlineServicesEnabled_}, oculusMRCEnabled{oculusMRCEnabled_}, openVrThreadedHaptics{openVrThreadedHaptics_}, language{language_} {}
    // Get instance field: public System.String version
    ::Il2CppString* _get_version();
    // Set instance field: public System.String version
    void _set_version(::Il2CppString* value);
    // Get instance field: public System.Int32 windowResolutionWidth
    int _get_windowResolutionWidth();
    // Set instance field: public System.Int32 windowResolutionWidth
    void _set_windowResolutionWidth(int value);
    // Get instance field: public System.Int32 windowResolutionHeight
    int _get_windowResolutionHeight();
    // Set instance field: public System.Int32 windowResolutionHeight
    void _set_windowResolutionHeight(int value);
    // Get instance field: public MainSettingsModelSO/WindowMode windowMode
    GlobalNamespace::MainSettingsModelSO::WindowMode _get_windowMode();
    // Set instance field: public MainSettingsModelSO/WindowMode windowMode
    void _set_windowMode(GlobalNamespace::MainSettingsModelSO::WindowMode value);
    // Get instance field: public System.Single vrResolutionScale
    float _get_vrResolutionScale();
    // Set instance field: public System.Single vrResolutionScale
    void _set_vrResolutionScale(float value);
    // Get instance field: public System.Single menuVRResolutionScaleMultiplier
    float _get_menuVRResolutionScaleMultiplier();
    // Set instance field: public System.Single menuVRResolutionScaleMultiplier
    void _set_menuVRResolutionScaleMultiplier(float value);
    // Get instance field: public System.Boolean useFixedFoveatedRenderingDuringGameplay
    bool _get_useFixedFoveatedRenderingDuringGameplay();
    // Set instance field: public System.Boolean useFixedFoveatedRenderingDuringGameplay
    void _set_useFixedFoveatedRenderingDuringGameplay(bool value);
    // Get instance field: public System.Int32 antiAliasingLevel
    int _get_antiAliasingLevel();
    // Set instance field: public System.Int32 antiAliasingLevel
    void _set_antiAliasingLevel(int value);
    // Get instance field: public System.Int32 mirrorGraphicsSettings
    int _get_mirrorGraphicsSettings();
    // Set instance field: public System.Int32 mirrorGraphicsSettings
    void _set_mirrorGraphicsSettings(int value);
    // Get instance field: public System.Int32 mainEffectGraphicsSettings
    int _get_mainEffectGraphicsSettings();
    // Set instance field: public System.Int32 mainEffectGraphicsSettings
    void _set_mainEffectGraphicsSettings(int value);
    // Get instance field: public System.Int32 bloomGraphicsSettings
    int _get_bloomGraphicsSettings();
    // Set instance field: public System.Int32 bloomGraphicsSettings
    void _set_bloomGraphicsSettings(int value);
    // Get instance field: public System.Int32 smokeGraphicsSettings
    int _get_smokeGraphicsSettings();
    // Set instance field: public System.Int32 smokeGraphicsSettings
    void _set_smokeGraphicsSettings(int value);
    // Get instance field: public System.Boolean burnMarkTrailsEnabled
    bool _get_burnMarkTrailsEnabled();
    // Set instance field: public System.Boolean burnMarkTrailsEnabled
    void _set_burnMarkTrailsEnabled(bool value);
    // Get instance field: public System.Boolean screenDisplacementEffectsEnabled
    bool _get_screenDisplacementEffectsEnabled();
    // Set instance field: public System.Boolean screenDisplacementEffectsEnabled
    void _set_screenDisplacementEffectsEnabled(bool value);
    // Get instance field: public System.Single roomCenterX
    float _get_roomCenterX();
    // Set instance field: public System.Single roomCenterX
    void _set_roomCenterX(float value);
    // Get instance field: public System.Single roomCenterY
    float _get_roomCenterY();
    // Set instance field: public System.Single roomCenterY
    void _set_roomCenterY(float value);
    // Get instance field: public System.Single roomCenterZ
    float _get_roomCenterZ();
    // Set instance field: public System.Single roomCenterZ
    void _set_roomCenterZ(float value);
    // Get instance field: public System.Single roomRotation
    float _get_roomRotation();
    // Set instance field: public System.Single roomRotation
    void _set_roomRotation(float value);
    // Get instance field: public System.Single controllerPositionX
    float _get_controllerPositionX();
    // Set instance field: public System.Single controllerPositionX
    void _set_controllerPositionX(float value);
    // Get instance field: public System.Single controllerPositionY
    float _get_controllerPositionY();
    // Set instance field: public System.Single controllerPositionY
    void _set_controllerPositionY(float value);
    // Get instance field: public System.Single controllerPositionZ
    float _get_controllerPositionZ();
    // Set instance field: public System.Single controllerPositionZ
    void _set_controllerPositionZ(float value);
    // Get instance field: public System.Single controllerRotationX
    float _get_controllerRotationX();
    // Set instance field: public System.Single controllerRotationX
    void _set_controllerRotationX(float value);
    // Get instance field: public System.Single controllerRotationY
    float _get_controllerRotationY();
    // Set instance field: public System.Single controllerRotationY
    void _set_controllerRotationY(float value);
    // Get instance field: public System.Single controllerRotationZ
    float _get_controllerRotationZ();
    // Set instance field: public System.Single controllerRotationZ
    void _set_controllerRotationZ(float value);
    // Get instance field: public System.Int32 smoothCameraEnabled
    int _get_smoothCameraEnabled();
    // Set instance field: public System.Int32 smoothCameraEnabled
    void _set_smoothCameraEnabled(int value);
    // Get instance field: public System.Single smoothCameraFieldOfView
    float _get_smoothCameraFieldOfView();
    // Set instance field: public System.Single smoothCameraFieldOfView
    void _set_smoothCameraFieldOfView(float value);
    // Get instance field: public System.Single smoothCameraThirdPersonPositionX
    float _get_smoothCameraThirdPersonPositionX();
    // Set instance field: public System.Single smoothCameraThirdPersonPositionX
    void _set_smoothCameraThirdPersonPositionX(float value);
    // Get instance field: public System.Single smoothCameraThirdPersonPositionY
    float _get_smoothCameraThirdPersonPositionY();
    // Set instance field: public System.Single smoothCameraThirdPersonPositionY
    void _set_smoothCameraThirdPersonPositionY(float value);
    // Get instance field: public System.Single smoothCameraThirdPersonPositionZ
    float _get_smoothCameraThirdPersonPositionZ();
    // Set instance field: public System.Single smoothCameraThirdPersonPositionZ
    void _set_smoothCameraThirdPersonPositionZ(float value);
    // Get instance field: public System.Single smoothCameraThirdPersonEulerAnglesX
    float _get_smoothCameraThirdPersonEulerAnglesX();
    // Set instance field: public System.Single smoothCameraThirdPersonEulerAnglesX
    void _set_smoothCameraThirdPersonEulerAnglesX(float value);
    // Get instance field: public System.Single smoothCameraThirdPersonEulerAnglesY
    float _get_smoothCameraThirdPersonEulerAnglesY();
    // Set instance field: public System.Single smoothCameraThirdPersonEulerAnglesY
    void _set_smoothCameraThirdPersonEulerAnglesY(float value);
    // Get instance field: public System.Single smoothCameraThirdPersonEulerAnglesZ
    float _get_smoothCameraThirdPersonEulerAnglesZ();
    // Set instance field: public System.Single smoothCameraThirdPersonEulerAnglesZ
    void _set_smoothCameraThirdPersonEulerAnglesZ(float value);
    // Get instance field: public System.Int32 smoothCameraThirdPersonEnabled
    int _get_smoothCameraThirdPersonEnabled();
    // Set instance field: public System.Int32 smoothCameraThirdPersonEnabled
    void _set_smoothCameraThirdPersonEnabled(int value);
    // Get instance field: public System.Single smoothCameraRotationSmooth
    float _get_smoothCameraRotationSmooth();
    // Set instance field: public System.Single smoothCameraRotationSmooth
    void _set_smoothCameraRotationSmooth(float value);
    // Get instance field: public System.Single smoothCameraPositionSmooth
    float _get_smoothCameraPositionSmooth();
    // Set instance field: public System.Single smoothCameraPositionSmooth
    void _set_smoothCameraPositionSmooth(float value);
    // Get instance field: public System.Boolean useCustomServerEnvironment
    bool _get_useCustomServerEnvironment();
    // Set instance field: public System.Boolean useCustomServerEnvironment
    void _set_useCustomServerEnvironment(bool value);
    // Get instance field: public System.String customServerHostName
    ::Il2CppString* _get_customServerHostName();
    // Set instance field: public System.String customServerHostName
    void _set_customServerHostName(::Il2CppString* value);
    // Get instance field: public System.Single volume
    float _get_volume();
    // Set instance field: public System.Single volume
    void _set_volume(float value);
    // Get instance field: public System.Single ambientVolumeScale
    float _get_ambientVolumeScale();
    // Set instance field: public System.Single ambientVolumeScale
    void _set_ambientVolumeScale(float value);
    // Get instance field: public System.Boolean controllersRumbleEnabled
    bool _get_controllersRumbleEnabled();
    // Set instance field: public System.Boolean controllersRumbleEnabled
    void _set_controllersRumbleEnabled(bool value);
    // Get instance field: public System.Int32 enableAlphaFeatures
    int _get_enableAlphaFeatures();
    // Set instance field: public System.Int32 enableAlphaFeatures
    void _set_enableAlphaFeatures(int value);
    // Get instance field: public System.Int32 pauseButtonPressDurationLevel
    int _get_pauseButtonPressDurationLevel();
    // Set instance field: public System.Int32 pauseButtonPressDurationLevel
    void _set_pauseButtonPressDurationLevel(int value);
    // Get instance field: public System.Int32 maxShockwaveParticles
    int _get_maxShockwaveParticles();
    // Set instance field: public System.Int32 maxShockwaveParticles
    void _set_maxShockwaveParticles(int value);
    // Get instance field: public System.Boolean overrideAudioLatency
    bool _get_overrideAudioLatency();
    // Set instance field: public System.Boolean overrideAudioLatency
    void _set_overrideAudioLatency(bool value);
    // Get instance field: public System.Single audioLatency
    float _get_audioLatency();
    // Set instance field: public System.Single audioLatency
    void _set_audioLatency(float value);
    // Get instance field: public System.Int32 maxNumberOfCutSoundEffects
    int _get_maxNumberOfCutSoundEffects();
    // Set instance field: public System.Int32 maxNumberOfCutSoundEffects
    void _set_maxNumberOfCutSoundEffects(int value);
    // Get instance field: public System.Boolean onlineServicesEnabled
    bool _get_onlineServicesEnabled();
    // Set instance field: public System.Boolean onlineServicesEnabled
    void _set_onlineServicesEnabled(bool value);
    // Get instance field: public System.Boolean oculusMRCEnabled
    bool _get_oculusMRCEnabled();
    // Set instance field: public System.Boolean oculusMRCEnabled
    void _set_oculusMRCEnabled(bool value);
    // Get instance field: public System.Boolean openVrThreadedHaptics
    bool _get_openVrThreadedHaptics();
    // Set instance field: public System.Boolean openVrThreadedHaptics
    void _set_openVrThreadedHaptics(bool value);
    // Get instance field: public System.String language
    ::Il2CppString* _get_language();
    // Set instance field: public System.String language
    void _set_language(::Il2CppString* value);
    // public System.Void .ctor()
    // Offset: 0x117CE84
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MainSettingsModelSO::Config* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MainSettingsModelSO::Config::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MainSettingsModelSO::Config*, creationType>()));
    }
  }; // MainSettingsModelSO/Config
  #pragma pack(pop)
  static check_size<sizeof(MainSettingsModelSO::Config), 208 + sizeof(::Il2CppString*)> __GlobalNamespace_MainSettingsModelSO_ConfigSizeCheck;
  static_assert(sizeof(MainSettingsModelSO::Config) == 0xD8);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MainSettingsModelSO::Config*, "", "MainSettingsModelSO/Config");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::MainSettingsModelSO::Config::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
