// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: IConnectionManager
#include "GlobalNamespace/IConnectionManager.hpp"
// Including type: MasterServer.MessageHandler/IMessageSender
#include "MasterServer/MessageHandler_IMessageSender.hpp"
// Including type: DiscoveryPolicy
#include "GlobalNamespace/DiscoveryPolicy.hpp"
// Including type: InvitePolicy
#include "GlobalNamespace/InvitePolicy.hpp"
// Including type: GameplayServerConfiguration
#include "GlobalNamespace/GameplayServerConfiguration.hpp"
// Including type: PublicServerInfo
#include "GlobalNamespace/PublicServerInfo.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MasterServer
namespace MasterServer {
  // Forward declaring type: UserMessageHandler
  class UserMessageHandler;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LiteNetLibConnectionManager
  class LiteNetLibConnectionManager;
  // Forward declaring type: IConnection
  class IConnection;
  // Forward declaring type: MasterServerEndPoint
  class MasterServerEndPoint;
  // Forward declaring type: IAuthenticationTokenProvider
  class IAuthenticationTokenProvider;
  // Skipping declaration: ConnectionAttempt because it is already included!
  // Forward declaring type: GameplayServerFilter
  struct GameplayServerFilter;
  // Forward declaring type: IConnectionInitParams`1<T>
  template<typename T>
  class IConnectionInitParams_1;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataReader
  class NetDataReader;
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MasterServerConnectionManager
  class MasterServerConnectionManager : public ::Il2CppObject/*, public GlobalNamespace::IConnectionManager, public MasterServer::MessageHandler::IMessageSender*/ {
    public:
    // Nested type: GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt
    struct ConnectionAttempt;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::ConnectionState
    struct ConnectionState;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::MasterServerConnectionManagerParamsBase
    class MasterServerConnectionManagerParamsBase;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::StartServerParams
    class StartServerParams;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::ConnectToServerParams
    class ConnectToServerParams;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::ConnectToMatchmakingParams
    class ConnectToMatchmakingParams;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::StartClientParams
    class StartClientParams;
    // Autogenerated type: MasterServerConnectionManager/ConnectionAttempt
    struct ConnectionAttempt : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: ConnectionAttempt
      constexpr ConnectionAttempt(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MasterServerConnectionManager/ConnectionAttempt None
      static constexpr const int None = 0;
      // Get static field: static public MasterServerConnectionManager/ConnectionAttempt None
      static GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt _get_None();
      // Set static field: static public MasterServerConnectionManager/ConnectionAttempt None
      static void _set_None(GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt value);
      // static field const value: static public MasterServerConnectionManager/ConnectionAttempt NatPunchthrough
      static constexpr const int NatPunchthrough = 1;
      // Get static field: static public MasterServerConnectionManager/ConnectionAttempt NatPunchthrough
      static GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt _get_NatPunchthrough();
      // Set static field: static public MasterServerConnectionManager/ConnectionAttempt NatPunchthrough
      static void _set_NatPunchthrough(GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt value);
      // static field const value: static public MasterServerConnectionManager/ConnectionAttempt DedicatedServer
      static constexpr const int DedicatedServer = 2;
      // Get static field: static public MasterServerConnectionManager/ConnectionAttempt DedicatedServer
      static GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt _get_DedicatedServer();
      // Set static field: static public MasterServerConnectionManager/ConnectionAttempt DedicatedServer
      static void _set_DedicatedServer(GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt value);
    }; // MasterServerConnectionManager/ConnectionAttempt
    // Autogenerated type: MasterServerConnectionManager/ConnectionState
    struct ConnectionState : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: ConnectionState
      constexpr ConnectionState(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MasterServerConnectionManager/ConnectionState Unconnected
      static constexpr const int Unconnected = 0;
      // Get static field: static public MasterServerConnectionManager/ConnectionState Unconnected
      static GlobalNamespace::MasterServerConnectionManager::ConnectionState _get_Unconnected();
      // Set static field: static public MasterServerConnectionManager/ConnectionState Unconnected
      static void _set_Unconnected(GlobalNamespace::MasterServerConnectionManager::ConnectionState value);
      // static field const value: static public MasterServerConnectionManager/ConnectionState Connecting
      static constexpr const int Connecting = 1;
      // Get static field: static public MasterServerConnectionManager/ConnectionState Connecting
      static GlobalNamespace::MasterServerConnectionManager::ConnectionState _get_Connecting();
      // Set static field: static public MasterServerConnectionManager/ConnectionState Connecting
      static void _set_Connecting(GlobalNamespace::MasterServerConnectionManager::ConnectionState value);
      // static field const value: static public MasterServerConnectionManager/ConnectionState Connected
      static constexpr const int Connected = 2;
      // Get static field: static public MasterServerConnectionManager/ConnectionState Connected
      static GlobalNamespace::MasterServerConnectionManager::ConnectionState _get_Connected();
      // Set static field: static public MasterServerConnectionManager/ConnectionState Connected
      static void _set_Connected(GlobalNamespace::MasterServerConnectionManager::ConnectionState value);
    }; // MasterServerConnectionManager/ConnectionState
    // private readonly LiteNetLibConnectionManager _liteNetLibConnectionManager
    // Offset: 0x10
    GlobalNamespace::LiteNetLibConnectionManager* liteNetLibConnectionManager;
    // private System.String _code
    // Offset: 0x18
    ::Il2CppString* code;
    // private System.Net.IPEndPoint _serverEndPoint
    // Offset: 0x20
    System::Net::IPEndPoint* serverEndPoint;
    // private System.String _serverName
    // Offset: 0x28
    ::Il2CppString* serverName;
    // private System.String _serverPassword
    // Offset: 0x30
    ::Il2CppString* serverPassword;
    // private System.String _serverUserId
    // Offset: 0x38
    ::Il2CppString* serverUserId;
    // private System.String _serverUserName
    // Offset: 0x40
    ::Il2CppString* serverUserName;
    // private MasterServerConnectionManager/ConnectionAttempt _connectionAttempt
    // Offset: 0x48
    GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt connectionAttempt;
    // private MasterServer.UserMessageHandler _messageHandler
    // Offset: 0x50
    MasterServer::UserMessageHandler* messageHandler;
    // private DiscoveryPolicy _discoveryPolicy
    // Offset: 0x58
    GlobalNamespace::DiscoveryPolicy discoveryPolicy;
    // private InvitePolicy _invitePolicy
    // Offset: 0x5C
    GlobalNamespace::InvitePolicy invitePolicy;
    // private GameplayServerConfiguration _configuration
    // Offset: 0x60
    GlobalNamespace::GameplayServerConfiguration configuration;
    // private System.Int32 _currentPlayerCount
    // Offset: 0x78
    int currentPlayerCount;
    // private System.Int32 _maxPlayerCount
    // Offset: 0x7C
    int maxPlayerCount;
    // private MasterServerConnectionManager/ConnectionState _connectionState
    // Offset: 0x80
    GlobalNamespace::MasterServerConnectionManager::ConnectionState connectionState;
    // private System.Threading.CancellationTokenSource _connectionCancellationTokenSource
    // Offset: 0x88
    System::Threading::CancellationTokenSource* connectionCancellationTokenSource;
    // private System.Action onConnectedEvent
    // Offset: 0x90
    System::Action* onConnectedEvent;
    // private System.Action`1<DisconnectedReason> onDisconnectedEvent
    // Offset: 0x98
    System::Action_1<GlobalNamespace::DisconnectedReason>* onDisconnectedEvent;
    // private System.Action`1<ConnectionFailedReason> onConnectionFailedEvent
    // Offset: 0xA0
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* onConnectionFailedEvent;
    // private System.Action`1<IConnection> onConnectionConnectedEvent
    // Offset: 0xA8
    System::Action_1<GlobalNamespace::IConnection*>* onConnectionConnectedEvent;
    // private System.Action`1<IConnection> onConnectionDisconnectedEvent
    // Offset: 0xB0
    System::Action_1<GlobalNamespace::IConnection*>* onConnectionDisconnectedEvent;
    // private System.Action`2<IConnection,System.Single> onLatencyUpdatedEvent
    // Offset: 0xB8
    System::Action_2<GlobalNamespace::IConnection*, float>* onLatencyUpdatedEvent;
    // private System.Action`3<IConnection,LiteNetLib.Utils.NetDataReader,LiteNetLib.DeliveryMethod> onReceivedDataEvent
    // Offset: 0xC0
    System::Action_3<GlobalNamespace::IConnection*, LiteNetLib::Utils::NetDataReader*, LiteNetLib::DeliveryMethod>* onReceivedDataEvent;
    // Creating interface conversion operator: operator GlobalNamespace::IConnectionManager
    operator GlobalNamespace::IConnectionManager() noexcept {
      return *reinterpret_cast<GlobalNamespace::IConnectionManager*>(this);
    }
    // Creating interface conversion operator: operator MasterServer::MessageHandler::IMessageSender
    operator MasterServer::MessageHandler::IMessageSender() noexcept {
      return *reinterpret_cast<MasterServer::MessageHandler::IMessageSender*>(this);
    }
    // public System.Int32 get_port()
    // Offset: 0x212E774
    int get_port();
    // public System.String get_secret()
    // Offset: 0x212E790
    ::Il2CppString* get_secret();
    // public System.String get_serverName()
    // Offset: 0x212E7AC
    ::Il2CppString* get_serverName();
    // public System.String get_serverPassword()
