// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: IMasterServerQuickPlaySetupModel
#include "GlobalNamespace/IMasterServerQuickPlaySetupModel.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.Single
#include "System/Single.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: INetworkConfig
  class INetworkConfig;
  // Forward declaring type: MasterServerQuickPlaySetupData
  class MasterServerQuickPlaySetupData;
}
// Forward declaring namespace: System::Net::Http
namespace System::Net::Http {
  // Forward declaring type: HttpClient
  class HttpClient;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: MasterServerQuickPlaySetupModel
  // [] Offset: FFFFFFFF
  class MasterServerQuickPlaySetupModel : public ::Il2CppObject/*, public GlobalNamespace::IMasterServerQuickPlaySetupModel*/ {
    public:
    // Nested type: GlobalNamespace::MasterServerQuickPlaySetupModel::$GetQuickPlaySetupInternal$d__10
    struct $GetQuickPlaySetupInternal$d__10;
    // [InjectAttribute] Offset: 0xD21650
    // private readonly INetworkConfig _networkConfig
    // Size: 0x8
    // Offset: 0x10
    GlobalNamespace::INetworkConfig* networkConfig;
    // Field size check
    static_assert(sizeof(GlobalNamespace::INetworkConfig*) == 0x8);
    // private readonly System.Net.Http.HttpClient _client
    // Size: 0x8
    // Offset: 0x18
    System::Net::Http::HttpClient* client;
    // Field size check
    static_assert(sizeof(System::Net::Http::HttpClient*) == 0x8);
    // private System.Threading.Tasks.Task`1<MasterServerQuickPlaySetupData> _request
    // Size: 0x8
    // Offset: 0x20
    System::Threading::Tasks::Task_1<GlobalNamespace::MasterServerQuickPlaySetupData*>* request;
    // Field size check
    static_assert(sizeof(System::Threading::Tasks::Task_1<GlobalNamespace::MasterServerQuickPlaySetupData*>*) == 0x8);
    // private System.DateTime _lastRequestTime
    // Size: 0x8
    // Offset: 0x28
    System::DateTime lastRequestTime;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // Creating value type constructor for type: MasterServerQuickPlaySetupModel
    MasterServerQuickPlaySetupModel(GlobalNamespace::INetworkConfig* networkConfig_ = {}, System::Net::Http::HttpClient* client_ = {}, System::Threading::Tasks::Task_1<GlobalNamespace::MasterServerQuickPlaySetupData*>* request_ = {}, System::DateTime lastRequestTime_ = {}) noexcept : networkConfig{networkConfig_}, client{client_}, request{request_}, lastRequestTime{lastRequestTime_} {}
    // Creating interface conversion operator: operator GlobalNamespace::IMasterServerQuickPlaySetupModel
    operator GlobalNamespace::IMasterServerQuickPlaySetupModel() noexcept {
      return *reinterpret_cast<GlobalNamespace::IMasterServerQuickPlaySetupModel*>(this);
    }
    // static field const value: static private System.Single kRequestCacheTimeoutHours
    static constexpr const float kRequestCacheTimeoutHours = 1;
    // Get static field: static private System.Single kRequestCacheTimeoutHours
    static float _get_kRequestCacheTimeoutHours();
    // Set static field: static private System.Single kRequestCacheTimeoutHours
    static void _set_kRequestCacheTimeoutHours(float value);
    // static field const value: static private System.Int32 kRequestTimeoutSeconds
    static constexpr const int kRequestTimeoutSeconds = 30;
    // Get static field: static private System.Int32 kRequestTimeoutSeconds
    static int _get_kRequestTimeoutSeconds();
    // Set static field: static private System.Int32 kRequestTimeoutSeconds
    static void _set_kRequestTimeoutSeconds(int value);
    // static field const value: static private System.String kQuickPlayOverrideSetupJson
    static constexpr const char* kQuickPlayOverrideSetupJson = "mp_override.json";
    // Get static field: static private System.String kQuickPlayOverrideSetupJson
    static ::Il2CppString* _get_kQuickPlayOverrideSetupJson();
    // Set static field: static private System.String kQuickPlayOverrideSetupJson
    static void _set_kQuickPlayOverrideSetupJson(::Il2CppString* value);
    // public System.Threading.Tasks.Task`1<MasterServerQuickPlaySetupData> GetQuickPlaySetupAsync(System.Threading.CancellationToken cancellationToken)
    // Offset: 0x10BBC60
    System::Threading::Tasks::Task_1<GlobalNamespace::MasterServerQuickPlaySetupData*>* GetQuickPlaySetupAsync(System::Threading::CancellationToken cancellationToken);
    // private System.Void Init()
    // Offset: 0x10BBE58
    void Init();
    // private System.Void StartRequest()
    // Offset: 0x10BBDE0
    void StartRequest();
    // private System.Threading.Tasks.Task`1<MasterServerQuickPlaySetupData> GetQuickPlaySetupInternal()
    // Offset: 0x10BBE5C
    System::Threading::Tasks::Task_1<GlobalNamespace::MasterServerQuickPlaySetupData*>* GetQuickPlaySetupInternal();
    // private System.Boolean IsQuickPlaySetupTaskValid()
    // Offset: 0x10BBCD4
    bool IsQuickPlaySetupTaskValid();
    // private System.Boolean IsUrlValid(System.String url)
    // Offset: 0x10BBF5C
    bool IsUrlValid(::Il2CppString* url);
    // public System.Void .ctor()
    // Offset: 0x10BBFC8
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MasterServerQuickPlaySetupModel* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MasterServerQuickPlaySetupModel::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MasterServerQuickPlaySetupModel*, creationType>()));
    }
  }; // MasterServerQuickPlaySetupModel
  #pragma pack(pop)
  static check_size<sizeof(MasterServerQuickPlaySetupModel), 40 + sizeof(System::DateTime)> __GlobalNamespace_MasterServerQuickPlaySetupModelSizeCheck;
  static_assert(sizeof(MasterServerQuickPlaySetupModel) == 0x30);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MasterServerQuickPlaySetupModel*, "", "MasterServerQuickPlaySetupModel");
