// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: IConnectionManager
#include "GlobalNamespace/IConnectionManager.hpp"
// Including type: DiscoveryPolicy
#include "GlobalNamespace/DiscoveryPolicy.hpp"
// Including type: InvitePolicy
#include "GlobalNamespace/InvitePolicy.hpp"
// Including type: GameplayServerConfiguration
#include "GlobalNamespace/GameplayServerConfiguration.hpp"
// Including type: PublicServerInfo
#include "GlobalNamespace/PublicServerInfo.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MasterServer
namespace MasterServer {
  // Forward declaring type: UserMessageHandler
  class UserMessageHandler;
  // Forward declaring type: ITimeProvider
  class ITimeProvider;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LiteNetLibConnectionManager
  class LiteNetLibConnectionManager;
  // Forward declaring type: IConnection
  class IConnection;
  // Forward declaring type: MasterServerEndPoint
  class MasterServerEndPoint;
  // Forward declaring type: IAuthenticationTokenProvider
  class IAuthenticationTokenProvider;
  // Forward declaring type: IConnectionInitParams`1<T>
  template<typename T>
  class IConnectionInitParams_1;
  // Skipping declaration: ConnectionAttempt because it is already included!
  // Forward declaring type: GameplayServerFilter
  struct GameplayServerFilter;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataReader
  class NetDataReader;
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: MasterServerConnectionManager
  class MasterServerConnectionManager : public ::Il2CppObject/*, public GlobalNamespace::IConnectionManager*/ {
    public:
    // Nested type: GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt
    struct ConnectionAttempt;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::ConnectionState
    struct ConnectionState;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::MasterServerConnectionManagerParamsBase
    class MasterServerConnectionManagerParamsBase;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::StartServerParams
    class StartServerParams;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::ConnectToServerParams
    class ConnectToServerParams;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::ConnectToMatchmakingParams
    class ConnectToMatchmakingParams;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::StartClientParams
    class StartClientParams;
    // Nested type: GlobalNamespace::MasterServerConnectionManager::$ConnectToEndPoint$d__114
    struct $ConnectToEndPoint$d__114;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MasterServerConnectionManager/ConnectionAttempt
    struct ConnectionAttempt/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ConnectionAttempt
      constexpr ConnectionAttempt(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MasterServerConnectionManager/ConnectionAttempt None
      static constexpr const int None = 0;
      // Get static field: static public MasterServerConnectionManager/ConnectionAttempt None
      static GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt _get_None();
      // Set static field: static public MasterServerConnectionManager/ConnectionAttempt None
      static void _set_None(GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt value);
      // static field const value: static public MasterServerConnectionManager/ConnectionAttempt NatPunchthrough
      static constexpr const int NatPunchthrough = 1;
      // Get static field: static public MasterServerConnectionManager/ConnectionAttempt NatPunchthrough
      static GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt _get_NatPunchthrough();
      // Set static field: static public MasterServerConnectionManager/ConnectionAttempt NatPunchthrough
      static void _set_NatPunchthrough(GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt value);
      // static field const value: static public MasterServerConnectionManager/ConnectionAttempt DedicatedServer
      static constexpr const int DedicatedServer = 2;
      // Get static field: static public MasterServerConnectionManager/ConnectionAttempt DedicatedServer
      static GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt _get_DedicatedServer();
      // Set static field: static public MasterServerConnectionManager/ConnectionAttempt DedicatedServer
      static void _set_DedicatedServer(GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt value);
    }; // MasterServerConnectionManager/ConnectionAttempt
    #pragma pack(pop)
    static check_size<sizeof(MasterServerConnectionManager::ConnectionAttempt), 0 + sizeof(int)> __GlobalNamespace_MasterServerConnectionManager_ConnectionAttemptSizeCheck;
    static_assert(sizeof(MasterServerConnectionManager::ConnectionAttempt) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MasterServerConnectionManager/ConnectionState
    struct ConnectionState/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ConnectionState
      constexpr ConnectionState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MasterServerConnectionManager/ConnectionState Unconnected
      static constexpr const int Unconnected = 0;
      // Get static field: static public MasterServerConnectionManager/ConnectionState Unconnected
      static GlobalNamespace::MasterServerConnectionManager::ConnectionState _get_Unconnected();
      // Set static field: static public MasterServerConnectionManager/ConnectionState Unconnected
      static void _set_Unconnected(GlobalNamespace::MasterServerConnectionManager::ConnectionState value);
      // static field const value: static public MasterServerConnectionManager/ConnectionState Connecting
      static constexpr const int Connecting = 1;
      // Get static field: static public MasterServerConnectionManager/ConnectionState Connecting
      static GlobalNamespace::MasterServerConnectionManager::ConnectionState _get_Connecting();
      // Set static field: static public MasterServerConnectionManager/ConnectionState Connecting
      static void _set_Connecting(GlobalNamespace::MasterServerConnectionManager::ConnectionState value);
      // static field const value: static public MasterServerConnectionManager/ConnectionState Connected
      static constexpr const int Connected = 2;
      // Get static field: static public MasterServerConnectionManager/ConnectionState Connected
      static GlobalNamespace::MasterServerConnectionManager::ConnectionState _get_Connected();
      // Set static field: static public MasterServerConnectionManager/ConnectionState Connected
      static void _set_Connected(GlobalNamespace::MasterServerConnectionManager::ConnectionState value);
      // static field const value: static public MasterServerConnectionManager/ConnectionState Disconnecting
      static constexpr const int Disconnecting = 3;
      // Get static field: static public MasterServerConnectionManager/ConnectionState Disconnecting
      static GlobalNamespace::MasterServerConnectionManager::ConnectionState _get_Disconnecting();
      // Set static field: static public MasterServerConnectionManager/ConnectionState Disconnecting
      static void _set_Disconnecting(GlobalNamespace::MasterServerConnectionManager::ConnectionState value);
    }; // MasterServerConnectionManager/ConnectionState
    #pragma pack(pop)
    static check_size<sizeof(MasterServerConnectionManager::ConnectionState), 0 + sizeof(int)> __GlobalNamespace_MasterServerConnectionManager_ConnectionStateSizeCheck;
    static_assert(sizeof(MasterServerConnectionManager::ConnectionState) == 0x4);
    // private readonly MasterServer.ITimeProvider _timeProvider
    // Size: 0x8
    // Offset: 0x10
    MasterServer::ITimeProvider* timeProvider;
    // Field size check
    static_assert(sizeof(MasterServer::ITimeProvider*) == 0x8);
    // private readonly LiteNetLibConnectionManager _liteNetLibConnectionManager
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::LiteNetLibConnectionManager* liteNetLibConnectionManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LiteNetLibConnectionManager*) == 0x8);
    // private System.String _code
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* code;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Net.IPEndPoint _serverEndPoint
    // Size: 0x8
    // Offset: 0x28
    System::Net::IPEndPoint* serverEndPoint;
    // Field size check
    static_assert(sizeof(System::Net::IPEndPoint*) == 0x8);
    // private System.String _serverName
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppString* serverName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String _serverPassword
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* serverPassword;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String _serverUserId
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* serverUserId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String _serverUserName
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* serverUserName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private MasterServerConnectionManager/ConnectionAttempt _connectionAttempt
    // Size: 0x4
    // Offset: 0x50
    GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt connectionAttempt;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MasterServerConnectionManager::ConnectionAttempt) == 0x4);
    // Padding between fields: connectionAttempt and: messageHandler
    char __padding8[0x4] = {};
    // private MasterServer.UserMessageHandler _messageHandler
    // Size: 0x8
    // Offset: 0x58
    MasterServer::UserMessageHandler* messageHandler;
    // Field size check
    static_assert(sizeof(MasterServer::UserMessageHandler*) == 0x8);
    // private DiscoveryPolicy _discoveryPolicy
    // Size: 0x1
    // Offset: 0x60
    GlobalNamespace::DiscoveryPolicy discoveryPolicy;
    // Field size check
    static_assert(sizeof(GlobalNamespace::DiscoveryPolicy) == 0x1);
    // Padding between fields: discoveryPolicy and: invitePolicy
    char __padding10[0x3] = {};
    // private InvitePolicy _invitePolicy
    // Size: 0x4
    // Offset: 0x64
    GlobalNamespace::InvitePolicy invitePolicy;
    // Field size check
    static_assert(sizeof(GlobalNamespace::InvitePolicy) == 0x4);
    // private GameplayServerConfiguration _configuration
    // Size: 0x18
    // Offset: 0x68
    GlobalNamespace::GameplayServerConfiguration configuration;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameplayServerConfiguration) == 0x18);
    // private System.Int32 _currentPlayerCount
    // Size: 0x4
    // Offset: 0x80
    int currentPlayerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _maxPlayerCount
    // Size: 0x4
    // Offset: 0x84
    int maxPlayerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private MasterServerConnectionManager/ConnectionState _connectionState
    // Size: 0x4
    // Offset: 0x88
    GlobalNamespace::MasterServerConnectionManager::ConnectionState connectionState;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MasterServerConnectionManager::ConnectionState) == 0x4);
    // Padding between fields: connectionState and: connectionCancellationTokenSource
    char __padding15[0x4] = {};
    // private System.Threading.CancellationTokenSource _connectionCancellationTokenSource
    // Size: 0x8
    // Offset: 0x90
    System::Threading::CancellationTokenSource* connectionCancellationTokenSource;
    // Field size check
    static_assert(sizeof(System::Threading::CancellationTokenSource*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0C60
    // private System.Action onConnectedEvent
    // Size: 0x8
    // Offset: 0x98
    System::Action* onConnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0C70
    // private System.Action`1<DisconnectedReason> onDisconnectedEvent
    // Size: 0x8
    // Offset: 0xA0
    System::Action_1<GlobalNamespace::DisconnectedReason>* onDisconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::DisconnectedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0C80
    // private System.Action`1<ConnectionFailedReason> onConnectionFailedEvent
    // Size: 0x8
    // Offset: 0xA8
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* onConnectionFailedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::ConnectionFailedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0C90
    // private System.Action`1<IConnection> onConnectionConnectedEvent
    // Size: 0x8
    // Offset: 0xB0
    System::Action_1<GlobalNamespace::IConnection*>* onConnectionConnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnection*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0CA0
    // private System.Action`2<IConnection,DisconnectedReason> onConnectionDisconnectedEvent
    // Size: 0x8
    // Offset: 0xB8
    System::Action_2<GlobalNamespace::IConnection*, GlobalNamespace::DisconnectedReason>* onConnectionDisconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::IConnection*, GlobalNamespace::DisconnectedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0CB0
    // private System.Action`2<IConnection,System.Single> onLatencyUpdatedEvent
    // Size: 0x8
    // Offset: 0xC0
    System::Action_2<GlobalNamespace::IConnection*, float>* onLatencyUpdatedEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::IConnection*, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF0CC0
    // private System.Action`3<IConnection,LiteNetLib.Utils.NetDataReader,LiteNetLib.DeliveryMethod> onReceivedDataEvent
    // Size: 0x8
    // Offset: 0xC8
    System::Action_3<GlobalNamespace::IConnection*, LiteNetLib::Utils::NetDataReader*, LiteNetLib::DeliveryMethod>* onReceivedDataEvent;
    // Field size check
    static_assert(sizeof(System::Action_3<GlobalNamespace::IConnection*, LiteNetLib::Utils::NetDataReader*, LiteNetLib::DeliveryMethod>*) == 0x8);
    // Creating value type constructor for type: MasterServerConnectionManager
