// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: LightWithIdMonoBehaviour
#include "GlobalNamespace/LightWithIdMonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MaterialLightWithId
  class MaterialLightWithId : public GlobalNamespace::LightWithIdMonoBehaviour {
    public:
    // private UnityEngine.MeshRenderer _meshRenderer
    // Offset: 0x30
    UnityEngine::MeshRenderer* meshRenderer;
    // private System.Boolean _alphaIntoColor
    // Offset: 0x38
    bool alphaIntoColor;
    // private System.Boolean _setColorOnly
    // Offset: 0x39
    bool setColorOnly;
    // private System.String _colorProperty
    // Offset: 0x40
    ::Il2CppString* colorProperty;
    // private System.Single _alphaIntensity
    // Offset: 0x48
    float alphaIntensity;
    // private UnityEngine.Color _color
    // Offset: 0x4C
    UnityEngine::Color color;
    // private System.Single _alpha
    // Offset: 0x5C
    float alpha;
    // private System.Int32 _propertyId
    // Offset: 0x60
    int propertyId;
    // Get static field: static private UnityEngine.MaterialPropertyBlock _materialPropertyBlock
    static UnityEngine::MaterialPropertyBlock* _get__materialPropertyBlock();
    // Set static field: static private UnityEngine.MaterialPropertyBlock _materialPropertyBlock
    static void _set__materialPropertyBlock(UnityEngine::MaterialPropertyBlock* value);
    // public UnityEngine.Color get_color()
    // Offset: 0x187D864
    UnityEngine::Color get_color();
    // protected System.Void Awake()
    // Offset: 0x187D870
    void Awake();
    // public override System.Void ColorWasSet(UnityEngine.Color color)
    // Offset: 0x187D8CC
    // Implemented from: LightWithIdMonoBehaviour
    // Base method: System.Void LightWithIdMonoBehaviour::ColorWasSet(UnityEngine.Color color)
    void ColorWasSet(UnityEngine::Color color);
    // public System.Void .ctor()
    // Offset: 0x187DA70
    // Implemented from: LightWithIdMonoBehaviour
    // Base method: System.Void LightWithIdMonoBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MaterialLightWithId* New_ctor();
    // static private System.Void .cctor()
    // Offset: 0x187DAE0
    // Implemented from: UnityEngine.Object
    // Base method: System.Void Object::.cctor()
    static void _cctor();
  }; // MaterialLightWithId
  check_size<sizeof(MaterialLightWithId), 96 + sizeof(int) + 8 - (96 + sizeof(int)) % 8> __GlobalNamespace_MaterialLightWithIdSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MaterialLightWithId*, "", "MaterialLightWithId");
#pragma pack(pop)
