// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MB3_MeshBakerRoot
#include "GlobalNamespace/MB3_MeshBakerRoot.hpp"
// Including type: DigitalOpus.MB.Core.MB3_MeshCombiner
#include "DigitalOpus/MB/Core/MB3_MeshCombiner.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MB2_TextureBakeResults
  class MB2_TextureBakeResults;
  // Forward declaring type: MB3_TextureBaker
  class MB3_TextureBaker;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MB2_EditorMethodsInterface
  class MB2_EditorMethodsInterface;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MB3_MeshBakerCommon
  class MB3_MeshBakerCommon;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MB3_MeshBakerCommon);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MB3_MeshBakerCommon*, "", "MB3_MeshBakerCommon");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: MB3_MeshBakerCommon
  // [TokenAttribute] Offset: FFFFFFFF
  class MB3_MeshBakerCommon : public ::GlobalNamespace::MB3_MeshBakerRoot {
    public:
    // Writing base type padding for base size: 0x24 to desired offset: 0x28
    char ___base_padding[0x4] = {};
    // Nested type: ::GlobalNamespace::MB3_MeshBakerCommon::$$c
    class $$c;
    public:
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> objsToMesh
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* objsToMesh;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Boolean useObjsToMeshFromTexBaker
    // Size: 0x1
    // Offset: 0x30
    bool useObjsToMeshFromTexBaker;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean clearBuffersAfterBake
    // Size: 0x1
    // Offset: 0x31
    bool clearBuffersAfterBake;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: clearBuffersAfterBake and: bakeAssetsInPlaceFolderPath
    char __padding2[0x6] = {};
    // public System.String bakeAssetsInPlaceFolderPath
    // Size: 0x8
    // Offset: 0x38
    ::StringW bakeAssetsInPlaceFolderPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject resultPrefab
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* resultPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean resultPrefabLeaveInstanceInSceneAfterBake
    // Size: 0x1
    // Offset: 0x48
    bool resultPrefabLeaveInstanceInSceneAfterBake;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: resultPrefabLeaveInstanceInSceneAfterBake and: parentSceneObject
    char __padding5[0x7] = {};
    // public UnityEngine.Transform parentSceneObject
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* parentSceneObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    public:
    // Get instance field reference: public System.Collections.Generic.List`1<UnityEngine.GameObject> objsToMesh
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_objsToMesh();
    // Get instance field reference: public System.Boolean useObjsToMeshFromTexBaker
    [[deprecated("Use field access instead!")]] bool& dyn_useObjsToMeshFromTexBaker();
    // Get instance field reference: public System.Boolean clearBuffersAfterBake
    [[deprecated("Use field access instead!")]] bool& dyn_clearBuffersAfterBake();
    // Get instance field reference: public System.String bakeAssetsInPlaceFolderPath
    [[deprecated("Use field access instead!")]] ::StringW& dyn_bakeAssetsInPlaceFolderPath();
    // Get instance field reference: public UnityEngine.GameObject resultPrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_resultPrefab();
    // Get instance field reference: public System.Boolean resultPrefabLeaveInstanceInSceneAfterBake
    [[deprecated("Use field access instead!")]] bool& dyn_resultPrefabLeaveInstanceInSceneAfterBake();
    // Get instance field reference: public UnityEngine.Transform parentSceneObject
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_parentSceneObject();
    // public DigitalOpus.MB.Core.MB3_MeshCombiner get_meshCombiner()
    // Offset: 0xFFFFFFFFFFFFFFFF
    ::DigitalOpus::MB::Core::MB3_MeshCombiner* get_meshCombiner();
    // public System.Void EnableDisableSourceObjectRenderers(System.Boolean show)
    // Offset: 0x11C5018
    void EnableDisableSourceObjectRenderers(bool show);
    // public System.Void ClearMesh()
    // Offset: 0x11C52E8
    void ClearMesh();
    // public System.Void ClearMesh(DigitalOpus.MB.Core.MB2_EditorMethodsInterface editorMethods)
    // Offset: 0x11C5318
    void ClearMesh(::DigitalOpus::MB::Core::MB2_EditorMethodsInterface* editorMethods);
    // public System.Void DestroyMesh()
    // Offset: 0x11C535C
    void DestroyMesh();
    // public System.Void DestroyMeshEditor(DigitalOpus.MB.Core.MB2_EditorMethodsInterface editorMethods)
    // Offset: 0x11C538C
    void DestroyMeshEditor(::DigitalOpus::MB::Core::MB2_EditorMethodsInterface* editorMethods);
    // public System.Int32 GetNumObjectsInCombined()
    // Offset: 0x11C53D0
    int GetNumObjectsInCombined();
    // public System.Int32 GetNumVerticesFor(UnityEngine.GameObject go)
    // Offset: 0x11C5400
    int GetNumVerticesFor(::UnityEngine::GameObject* go);
    // public MB3_TextureBaker GetTextureBaker()
    // Offset: 0x11C5444
    ::GlobalNamespace::MB3_TextureBaker* GetTextureBaker();
    // public System.Boolean AddDeleteGameObjects(UnityEngine.GameObject[] gos, UnityEngine.GameObject[] deleteGOs, System.Boolean disableRendererInSource)
    // Offset: 0xFFFFFFFFFFFFFFFF
    bool AddDeleteGameObjects(::ArrayW<::UnityEngine::GameObject*> gos, ::ArrayW<::UnityEngine::GameObject*> deleteGOs, bool disableRendererInSource);
    // public System.Boolean AddDeleteGameObjectsByID(UnityEngine.GameObject[] gos, System.Int32[] deleteGOinstanceIDs, System.Boolean disableRendererInSource)
    // Offset: 0xFFFFFFFFFFFFFFFF
    bool AddDeleteGameObjectsByID(::ArrayW<::UnityEngine::GameObject*> gos, ::ArrayW<int> deleteGOinstanceIDs, bool disableRendererInSource);
    // public System.Void Apply(DigitalOpus.MB.Core.MB3_MeshCombiner/DigitalOpus.MB.Core.GenerateUV2Delegate uv2GenerationMethod)
    // Offset: 0x11C555C
    void Apply(::DigitalOpus::MB::Core::MB3_MeshCombiner::GenerateUV2Delegate* uv2GenerationMethod);
    // public System.Void Apply(System.Boolean triangles, System.Boolean vertices, System.Boolean normals, System.Boolean tangents, System.Boolean uvs, System.Boolean uv2, System.Boolean uv3, System.Boolean uv4, System.Boolean colors, System.Boolean bones, System.Boolean blendShapesFlag, DigitalOpus.MB.Core.MB3_MeshCombiner/DigitalOpus.MB.Core.GenerateUV2Delegate uv2GenerationMethod)
    // Offset: 0x11C56EC
    void Apply(bool triangles, bool vertices, bool normals, bool tangents, bool uvs, bool uv2, bool uv3, bool uv4, bool colors, bool bones, bool blendShapesFlag, ::DigitalOpus::MB::Core::MB3_MeshCombiner::GenerateUV2Delegate* uv2GenerationMethod);
    // public System.Boolean CombinedMeshContains(UnityEngine.GameObject go)
    // Offset: 0x11C591C
    bool CombinedMeshContains(::UnityEngine::GameObject* go);
    // public System.Void UpdateGameObjects(UnityEngine.GameObject[] gos)
    // Offset: 0x11C5960
    void UpdateGameObjects(::ArrayW<::UnityEngine::GameObject*> gos);
    // public System.Void UpdateGameObjects(UnityEngine.GameObject[] gos, System.Boolean updateBounds)
    // Offset: 0x11C5A58
    void UpdateGameObjects(::ArrayW<::UnityEngine::GameObject*> gos, bool updateBounds);
    // public System.Void UpdateGameObjects(UnityEngine.GameObject[] gos, System.Boolean recalcBounds, System.Boolean updateVertices, System.Boolean updateNormals, System.Boolean updateTangents, System.Boolean updateUV, System.Boolean updateUV1, System.Boolean updateUV2, System.Boolean updateColors, System.Boolean updateSkinningInfo)
    // Offset: 0x11C5B50
    void UpdateGameObjects(::ArrayW<::UnityEngine::GameObject*> gos, bool recalcBounds, bool updateVertices, bool updateNormals, bool updateTangents, bool updateUV, bool updateUV1, bool updateUV2, bool updateColors, bool updateSkinningInfo);
    // public System.Boolean UpdateGameObjects(UnityEngine.GameObject[] gos, System.Boolean recalcBounds, System.Boolean updateVertices, System.Boolean updateNormals, System.Boolean updateTangents, System.Boolean updateUV, System.Boolean updateUV2, System.Boolean updateUV3, System.Boolean updateUV4, System.Boolean updateUV5, System.Boolean updateUV6, System.Boolean updateUV7, System.Boolean updateUV8, System.Boolean updateColors, System.Boolean updateSkinningInfo)
    // Offset: 0x11C5C70
    bool UpdateGameObjects(::ArrayW<::UnityEngine::GameObject*> gos, bool recalcBounds, bool updateVertices, bool updateNormals, bool updateTangents, bool updateUV, bool updateUV2, bool updateUV3, bool updateUV4, bool updateUV5, bool updateUV6, bool updateUV7, bool updateUV8, bool updateColors, bool updateSkinningInfo);
    // public System.Void UpdateSkinnedMeshApproximateBounds()
    // Offset: 0x11C5DE0
    void UpdateSkinnedMeshApproximateBounds();
    // public System.Void UpdateSkinnedMeshApproximateBoundsFromBones()
    // Offset: 0x11C5E40
    void UpdateSkinnedMeshApproximateBoundsFromBones();
    // public System.Void UpdateSkinnedMeshApproximateBoundsFromBounds()
    // Offset: 0x11C5EA0
    void UpdateSkinnedMeshApproximateBoundsFromBounds();
    // protected System.Boolean _ValidateForUpdateSkinnedMeshBounds()
    // Offset: 0x11C5F00
    bool _ValidateForUpdateSkinnedMeshBounds();
    // public override MB2_TextureBakeResults get_textureBakeResults()
    // Offset: 0x11C4B0C
    // Implemented from: MB3_MeshBakerRoot
    // Base method: MB2_TextureBakeResults MB3_MeshBakerRoot::get_textureBakeResults()
    ::GlobalNamespace::MB2_TextureBakeResults* get_textureBakeResults();
    // public override System.Void set_textureBakeResults(MB2_TextureBakeResults value)
    // Offset: 0x11C4B3C
    // Implemented from: MB3_MeshBakerRoot
    // Base method: System.Void MB3_MeshBakerRoot::set_textureBakeResults(MB2_TextureBakeResults value)
    void set_textureBakeResults(::GlobalNamespace::MB2_TextureBakeResults* value);
    // protected System.Void .ctor()
    // Offset: 0x11C4AFC
    // Implemented from: MB3_MeshBakerRoot
    // Base method: System.Void MB3_MeshBakerRoot::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MB3_MeshBakerCommon* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::MB3_MeshBakerCommon::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MB3_MeshBakerCommon*, creationType>()));
    }
    // public override System.Collections.Generic.List`1<UnityEngine.GameObject> GetObjectsToCombine()
    // Offset: 0x11C4B80
    // Implemented from: MB3_MeshBakerRoot
    // Base method: System.Collections.Generic.List`1<UnityEngine.GameObject> MB3_MeshBakerRoot::GetObjectsToCombine()
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* GetObjectsToCombine();
    // public override System.Void PurgeNullsFromObjectsToCombine()
    // Offset: 0x11C4D48
    // Implemented from: MB3_MeshBakerRoot
    // Base method: System.Void MB3_MeshBakerRoot::PurgeNullsFromObjectsToCombine()
    void PurgeNullsFromObjectsToCombine();
  }; // MB3_MeshBakerCommon
  #pragma pack(pop)
  static check_size<sizeof(MB3_MeshBakerCommon), 80 + sizeof(::UnityEngine::Transform*)> __GlobalNamespace_MB3_MeshBakerCommonSizeCheck;
  static_assert(sizeof(MB3_MeshBakerCommon) == 0x58);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::MB3_MeshBakerCommon::get_meshCombiner
// Il2CppName: get_meshCombiner
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::DigitalOpus::MB::Core::MB3_MeshCombiner* (GlobalNamespace::MB3_MeshBakerCommon::*)()>(&GlobalNamespace::MB3_MeshBakerCommon::get_meshCombiner)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MB3_MeshBakerCommon*), "get_meshCombiner", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MB3_MeshBakerCommon::EnableDisableSourceObjectRenderers
// Il2CppName: EnableDisableSourceObjectRenderers
template<>
