// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: DigitalOpus.MB.Core.MB2_LogLevel
#include "DigitalOpus/MB/Core/MB2_LogLevel.hpp"
// Including type: DigitalOpus.MB.Core.MB2_PackingAlgorithmEnum
#include "DigitalOpus/MB/Core/MB2_PackingAlgorithmEnum.hpp"
// Including type: MB2_TextureBakeResults/ResultType
#include "GlobalNamespace/MB2_TextureBakeResults.hpp"
// Including type: DigitalOpus.MB.Core.MB3_TextureCombiner
#include "DigitalOpus/MB/Core/MB3_TextureCombiner.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: MB2_TextureBakeResults because it is already included!
  // Forward declaring type: MB_MultiMaterial
  class MB_MultiMaterial;
  // Forward declaring type: MB_MultiMaterialTexArray
  class MB_MultiMaterialTexArray;
  // Forward declaring type: MB_TextureArrayFormatSet
  class MB_TextureArrayFormatSet;
  // Forward declaring type: MB_AtlasesAndRects
  class MB_AtlasesAndRects;
  // Forward declaring type: MB_TextureArrayResultMaterial
  class MB_TextureArrayResultMaterial;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: ShaderTextureProperty
  class ShaderTextureProperty;
  // Forward declaring type: ProgressUpdateDelegate
  class ProgressUpdateDelegate;
  // Forward declaring type: MB2_EditorMethodsInterface
  class MB2_EditorMethodsInterface;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MB3_MeshBakerPrefab
  class MB3_MeshBakerPrefab;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MB3_MeshBakerPrefab);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MB3_MeshBakerPrefab*, "", "MB3_MeshBakerPrefab");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: MB3_MeshBakerPrefab
  // [TokenAttribute] Offset: FFFFFFFF
  class MB3_MeshBakerPrefab : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::MB3_MeshBakerPrefab::OnCombinedTexturesCoroutineSuccess
    class OnCombinedTexturesCoroutineSuccess;
    // Nested type: ::GlobalNamespace::MB3_MeshBakerPrefab::OnCombinedTexturesCoroutineFail
    class OnCombinedTexturesCoroutineFail;
    // Nested type: ::GlobalNamespace::MB3_MeshBakerPrefab::$CreateAtlasesCoroutine$d__103
    class $CreateAtlasesCoroutine$d__103;
    // Nested type: ::GlobalNamespace::MB3_MeshBakerPrefab::$_CreateAtlasesCoroutineTextureArray$d__104
    class $_CreateAtlasesCoroutineTextureArray$d__104;
    // Nested type: ::GlobalNamespace::MB3_MeshBakerPrefab::$_CreateAtlasesCoroutine$d__105
    class $_CreateAtlasesCoroutine$d__105;
    public:
    // public DigitalOpus.MB.Core.MB2_LogLevel LOG_LEVEL
    // Size: 0x4
    // Offset: 0x18
    ::DigitalOpus::MB::Core::MB2_LogLevel LOG_LEVEL;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_LogLevel) == 0x4);
    // Padding between fields: LOG_LEVEL and: textureBakeResults
    char __padding0[0x4] = {};
    // protected MB2_TextureBakeResults _textureBakeResults
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::MB2_TextureBakeResults* textureBakeResults;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB2_TextureBakeResults*) == 0x8);
    // protected System.Int32 _atlasPadding
    // Size: 0x4
    // Offset: 0x28
    int atlasPadding;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _maxAtlasSize
    // Size: 0x4
    // Offset: 0x2C
    int maxAtlasSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _useMaxAtlasWidthOverride
    // Size: 0x1
    // Offset: 0x30
    bool useMaxAtlasWidthOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useMaxAtlasWidthOverride and: maxAtlasWidthOverride
    char __padding4[0x3] = {};
    // protected System.Int32 _maxAtlasWidthOverride
    // Size: 0x4
    // Offset: 0x34
    int maxAtlasWidthOverride;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _useMaxAtlasHeightOverride
    // Size: 0x1
    // Offset: 0x38
    bool useMaxAtlasHeightOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useMaxAtlasHeightOverride and: maxAtlasHeightOverride
    char __padding6[0x3] = {};
    // protected System.Int32 _maxAtlasHeightOverride
    // Size: 0x4
    // Offset: 0x3C
    int maxAtlasHeightOverride;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _resizePowerOfTwoTextures
    // Size: 0x1
    // Offset: 0x40
    bool resizePowerOfTwoTextures;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _fixOutOfBoundsUVs
    // Size: 0x1
    // Offset: 0x41
    bool fixOutOfBoundsUVs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fixOutOfBoundsUVs and: maxTilingBakeSize
    char __padding9[0x2] = {};
    // protected System.Int32 _maxTilingBakeSize
    // Size: 0x4
    // Offset: 0x44
    int maxTilingBakeSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected DigitalOpus.MB.Core.MB2_PackingAlgorithmEnum _packingAlgorithm
    // Size: 0x4
    // Offset: 0x48
    ::DigitalOpus::MB::Core::MB2_PackingAlgorithmEnum packingAlgorithm;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_PackingAlgorithmEnum) == 0x4);
    // protected System.Int32 _layerTexturePackerFastMesh
    // Size: 0x4
    // Offset: 0x4C
    int layerTexturePackerFastMesh;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _meshBakerTexturePackerForcePowerOfTwo
    // Size: 0x1
    // Offset: 0x50
    bool meshBakerTexturePackerForcePowerOfTwo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: meshBakerTexturePackerForcePowerOfTwo and: customShaderProperties
    char __padding13[0x7] = {};
    // protected System.Collections.Generic.List`1<DigitalOpus.MB.Core.ShaderTextureProperty> _customShaderProperties
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::ShaderTextureProperty*>* customShaderProperties;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::ShaderTextureProperty*>*) == 0x8);
    // protected System.Collections.Generic.List`1<System.String> _texturePropNamesToIgnore
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::StringW>* texturePropNamesToIgnore;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // protected System.Collections.Generic.List`1<System.String> _customShaderPropNames_Depricated
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::StringW>* customShaderPropNames_Depricated;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // protected MB2_TextureBakeResults/ResultType _resultType
    // Size: 0x4
    // Offset: 0x70
    ::GlobalNamespace::MB2_TextureBakeResults::ResultType resultType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB2_TextureBakeResults::ResultType) == 0x4);
    // protected System.Boolean _doMultiMaterial
    // Size: 0x1
    // Offset: 0x74
    bool doMultiMaterial;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doMultiMaterialSplitAtlasesIfTooBig
    // Size: 0x1
    // Offset: 0x75
    bool doMultiMaterialSplitAtlasesIfTooBig;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doMultiMaterialSplitAtlasesIfOBUVs
    // Size: 0x1
    // Offset: 0x76
    bool doMultiMaterialSplitAtlasesIfOBUVs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doMultiMaterialSplitAtlasesIfOBUVs and: resultMaterial
    char __padding20[0x1] = {};
    // protected UnityEngine.Material _resultMaterial
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Material* resultMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // protected System.Boolean _considerNonTextureProperties
    // Size: 0x1
    // Offset: 0x80
    bool considerNonTextureProperties;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doSuggestTreatment
    // Size: 0x1
    // Offset: 0x81
    bool doSuggestTreatment;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doSuggestTreatment and: coroutineResult
    char __padding23[0x6] = {};
    // private DigitalOpus.MB.Core.MB3_TextureCombiner/DigitalOpus.MB.Core.CreateAtlasesCoroutineResult _coroutineResult
    // Size: 0x8
    // Offset: 0x88
    ::DigitalOpus::MB::Core::MB3_TextureCombiner::CreateAtlasesCoroutineResult* coroutineResult;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB3_TextureCombiner::CreateAtlasesCoroutineResult*) == 0x8);
    // public MB_MultiMaterial[] resultMaterials
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::GlobalNamespace::MB_MultiMaterial*> resultMaterials;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MB_MultiMaterial*>) == 0x8);
    // public MB_MultiMaterialTexArray[] resultMaterialsTexArray
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::GlobalNamespace::MB_MultiMaterialTexArray*> resultMaterialsTexArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MB_MultiMaterialTexArray*>) == 0x8);
    // public MB_TextureArrayFormatSet[] textureArrayOutputFormats
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::GlobalNamespace::MB_TextureArrayFormatSet*> textureArrayOutputFormats;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MB_TextureArrayFormatSet*>) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> objsToMesh
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* objsToMesh;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public MB3_MeshBakerPrefab/OnCombinedTexturesCoroutineSuccess onBuiltAtlasesSuccess
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::MB3_MeshBakerPrefab::OnCombinedTexturesCoroutineSuccess* onBuiltAtlasesSuccess;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB3_MeshBakerPrefab::OnCombinedTexturesCoroutineSuccess*) == 0x8);
    // public MB3_MeshBakerPrefab/OnCombinedTexturesCoroutineFail onBuiltAtlasesFail
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::MB3_MeshBakerPrefab::OnCombinedTexturesCoroutineFail* onBuiltAtlasesFail;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB3_MeshBakerPrefab::OnCombinedTexturesCoroutineFail*) == 0x8);
    // public MB_AtlasesAndRects[] OnCombinedTexturesCoroutineAtlasesAndRects
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::GlobalNamespace::MB_AtlasesAndRects*> OnCombinedTexturesCoroutineAtlasesAndRects;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MB_AtlasesAndRects*>) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public DigitalOpus.MB.Core.MB2_LogLevel LOG_LEVEL
    [[deprecated("Use field access instead!")]] ::DigitalOpus::MB::Core::MB2_LogLevel& dyn_LOG_LEVEL();
    // Get instance field reference: protected MB2_TextureBakeResults _textureBakeResults
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::MB2_TextureBakeResults*& dyn__textureBakeResults();
    // Get instance field reference: protected System.Int32 _atlasPadding
    [[deprecated("Use field access instead!")]] int& dyn__atlasPadding();
    // Get instance field reference: protected System.Int32 _maxAtlasSize
