// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: IMenuRpcManager
#include "GlobalNamespace/IMenuRpcManager.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Action`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Action_4;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: RpcHandler`1<TType>
  template<typename TType>
  class RpcHandler_1;
  // Forward declaring type: PlayersLobbyPermissionConfigurationNetSerializable
  class PlayersLobbyPermissionConfigurationNetSerializable;
  // Forward declaring type: PlayersMissingEntitlementsNetSerializable
  class PlayersMissingEntitlementsNetSerializable;
  // Forward declaring type: BeatmapIdentifierNetSerializable
  class BeatmapIdentifierNetSerializable;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MenuRpcManager
  class MenuRpcManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MenuRpcManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MenuRpcManager*, "", "MenuRpcManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x150
  #pragma pack(push, 1)
  // Autogenerated type: MenuRpcManager
  // [TokenAttribute] Offset: FFFFFFFF
  class MenuRpcManager : public ::Il2CppObject/*, public ::GlobalNamespace::IMenuRpcManager*/ {
    public:
    // Nested type: ::GlobalNamespace::MenuRpcManager::RpcType
    struct RpcType;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetPlayersPermissionConfigurationRpc
    class GetPlayersPermissionConfigurationRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetPlayersPermissionConfigurationRpc
    class SetPlayersPermissionConfigurationRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetPlayersMissingEntitlementsToLevelRpc
    class SetPlayersMissingEntitlementsToLevelRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetIsEntitledToLevelRpc
    class GetIsEntitledToLevelRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetIsEntitledToLevelRpc
    class SetIsEntitledToLevelRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::InvalidateLevelEntitlementStatusesRpc
    class InvalidateLevelEntitlementStatusesRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SelectLevelPackRpc
    class SelectLevelPackRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetSelectedBeatmapRpc
    class SetSelectedBeatmapRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetSelectedBeatmapRpc
    class GetSelectedBeatmapRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::RecommendBeatmapRpc
    class RecommendBeatmapRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::ClearRecommendedBeatmapRpc
    class ClearRecommendedBeatmapRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetRecommendedBeatmapRpc
    class GetRecommendedBeatmapRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetSelectedGameplayModifiersRpc
    class SetSelectedGameplayModifiersRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetSelectedGameplayModifiersRpc
    class GetSelectedGameplayModifiersRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::RecommendGameplayModifiersRpc
    class RecommendGameplayModifiersRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::ClearRecommendedGameplayModifiersRpc
    class ClearRecommendedGameplayModifiersRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetRecommendedGameplayModifiersRpc
    class GetRecommendedGameplayModifiersRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetIsStartButtonEnabledRpc
    class GetIsStartButtonEnabledRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetIsStartButtonEnabledRpc
    class SetIsStartButtonEnabledRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::LevelLoadErrorRpc
    class LevelLoadErrorRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::LevelLoadSuccessRpc
    class LevelLoadSuccessRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::StartLevelRpc
    class StartLevelRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetStartedLevelRpc
    class GetStartedLevelRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetMultiplayerGameStateRpc
    class GetMultiplayerGameStateRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetMultiplayerGameStateRpc
    class SetMultiplayerGameStateRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::CancelCountdownRpc
    class CancelCountdownRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetCountdownEndTimeRpc
    class SetCountdownEndTimeRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetCountdownEndTimeRpc
    class GetCountdownEndTimeRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::CancelLevelStartRpc
    class CancelLevelStartRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetIsReadyRpc
    class GetIsReadyRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetIsReadyRpc
    class SetIsReadyRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetStartGameTimeRpc
    class SetStartGameTimeRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::CancelStartGameTimeRpc
    class CancelStartGameTimeRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetIsInLobbyRpc
    class GetIsInLobbyRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetIsInLobbyRpc
    class SetIsInLobbyRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::GetOwnedSongPacksRpc
    class GetOwnedSongPacksRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::SetOwnedSongPacksRpc
    class SetOwnedSongPacksRpc;
    // Nested type: ::GlobalNamespace::MenuRpcManager::RequestKickPlayerRpc
    class RequestKickPlayerRpc;
    // Size: 0x1
    #pragma pack(push, 1)
    // Autogenerated type: MenuRpcManager/RpcType
    // [TokenAttribute] Offset: FFFFFFFF
    struct RpcType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Byte value__
      // Size: 0x1
      // Offset: 0x0
      uint8_t value;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      public:
      // Creating value type constructor for type: RpcType
      constexpr RpcType(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public MenuRpcManager/RpcType SetPlayersMissingEntitlementsToLevel
      static constexpr const uint8_t SetPlayersMissingEntitlementsToLevel = 0u;
      // Get static field: static public MenuRpcManager/RpcType SetPlayersMissingEntitlementsToLevel
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetPlayersMissingEntitlementsToLevel();
      // Set static field: static public MenuRpcManager/RpcType SetPlayersMissingEntitlementsToLevel
      static void _set_SetPlayersMissingEntitlementsToLevel(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsEntitledToLevel
      static constexpr const uint8_t GetIsEntitledToLevel = 1u;
      // Get static field: static public MenuRpcManager/RpcType GetIsEntitledToLevel
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetIsEntitledToLevel();
      // Set static field: static public MenuRpcManager/RpcType GetIsEntitledToLevel
      static void _set_GetIsEntitledToLevel(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsEntitledToLevel
      static constexpr const uint8_t SetIsEntitledToLevel = 2u;
      // Get static field: static public MenuRpcManager/RpcType SetIsEntitledToLevel
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetIsEntitledToLevel();
      // Set static field: static public MenuRpcManager/RpcType SetIsEntitledToLevel
      static void _set_SetIsEntitledToLevel(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType InvalidateLevelEntitlementStatuses
      static constexpr const uint8_t InvalidateLevelEntitlementStatuses = 3u;
      // Get static field: static public MenuRpcManager/RpcType InvalidateLevelEntitlementStatuses
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_InvalidateLevelEntitlementStatuses();
      // Set static field: static public MenuRpcManager/RpcType InvalidateLevelEntitlementStatuses
      static void _set_InvalidateLevelEntitlementStatuses(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SelectLevelPack
      static constexpr const uint8_t SelectLevelPack = 4u;
      // Get static field: static public MenuRpcManager/RpcType SelectLevelPack
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SelectLevelPack();
      // Set static field: static public MenuRpcManager/RpcType SelectLevelPack
      static void _set_SelectLevelPack(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetSelectedBeatmap
      static constexpr const uint8_t SetSelectedBeatmap = 5u;
      // Get static field: static public MenuRpcManager/RpcType SetSelectedBeatmap
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetSelectedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType SetSelectedBeatmap
      static void _set_SetSelectedBeatmap(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetSelectedBeatmap
      static constexpr const uint8_t GetSelectedBeatmap = 6u;
      // Get static field: static public MenuRpcManager/RpcType GetSelectedBeatmap
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetSelectedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType GetSelectedBeatmap
      static void _set_GetSelectedBeatmap(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType RecommendBeatmap
      static constexpr const uint8_t RecommendBeatmap = 7u;
      // Get static field: static public MenuRpcManager/RpcType RecommendBeatmap
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_RecommendBeatmap();
      // Set static field: static public MenuRpcManager/RpcType RecommendBeatmap
      static void _set_RecommendBeatmap(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType ClearRecommendedBeatmap
      static constexpr const uint8_t ClearRecommendedBeatmap = 8u;
      // Get static field: static public MenuRpcManager/RpcType ClearRecommendedBeatmap
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_ClearRecommendedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType ClearRecommendedBeatmap
      static void _set_ClearRecommendedBeatmap(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetRecommendedBeatmap
      static constexpr const uint8_t GetRecommendedBeatmap = 9u;
      // Get static field: static public MenuRpcManager/RpcType GetRecommendedBeatmap
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetRecommendedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType GetRecommendedBeatmap
      static void _set_GetRecommendedBeatmap(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetSelectedGameplayModifiers
      static constexpr const uint8_t SetSelectedGameplayModifiers = 10u;
      // Get static field: static public MenuRpcManager/RpcType SetSelectedGameplayModifiers
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetSelectedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType SetSelectedGameplayModifiers
      static void _set_SetSelectedGameplayModifiers(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetSelectedGameplayModifiers
      static constexpr const uint8_t GetSelectedGameplayModifiers = 11u;
      // Get static field: static public MenuRpcManager/RpcType GetSelectedGameplayModifiers
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetSelectedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType GetSelectedGameplayModifiers
      static void _set_GetSelectedGameplayModifiers(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType RecommendGameplayModifiers
      static constexpr const uint8_t RecommendGameplayModifiers = 12u;
      // Get static field: static public MenuRpcManager/RpcType RecommendGameplayModifiers
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_RecommendGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType RecommendGameplayModifiers
      static void _set_RecommendGameplayModifiers(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType ClearRecommendedGameplayModifiers
      static constexpr const uint8_t ClearRecommendedGameplayModifiers = 13u;
      // Get static field: static public MenuRpcManager/RpcType ClearRecommendedGameplayModifiers
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_ClearRecommendedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType ClearRecommendedGameplayModifiers
      static void _set_ClearRecommendedGameplayModifiers(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetRecommendedGameplayModifiers
      static constexpr const uint8_t GetRecommendedGameplayModifiers = 14u;
      // Get static field: static public MenuRpcManager/RpcType GetRecommendedGameplayModifiers
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetRecommendedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType GetRecommendedGameplayModifiers
      static void _set_GetRecommendedGameplayModifiers(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType LevelLoadError
      static constexpr const uint8_t LevelLoadError = 15u;
      // Get static field: static public MenuRpcManager/RpcType LevelLoadError
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_LevelLoadError();
      // Set static field: static public MenuRpcManager/RpcType LevelLoadError
      static void _set_LevelLoadError(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType LevelLoadSuccess
      static constexpr const uint8_t LevelLoadSuccess = 16u;
      // Get static field: static public MenuRpcManager/RpcType LevelLoadSuccess
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_LevelLoadSuccess();
      // Set static field: static public MenuRpcManager/RpcType LevelLoadSuccess
      static void _set_LevelLoadSuccess(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType StartLevel
      static constexpr const uint8_t StartLevel = 17u;
      // Get static field: static public MenuRpcManager/RpcType StartLevel
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_StartLevel();
      // Set static field: static public MenuRpcManager/RpcType StartLevel
      static void _set_StartLevel(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetStartedLevel
      static constexpr const uint8_t GetStartedLevel = 18u;
      // Get static field: static public MenuRpcManager/RpcType GetStartedLevel
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetStartedLevel();
      // Set static field: static public MenuRpcManager/RpcType GetStartedLevel
      static void _set_GetStartedLevel(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType CancelLevelStart
      static constexpr const uint8_t CancelLevelStart = 19u;
      // Get static field: static public MenuRpcManager/RpcType CancelLevelStart
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_CancelLevelStart();
      // Set static field: static public MenuRpcManager/RpcType CancelLevelStart
      static void _set_CancelLevelStart(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetMultiplayerGameState
      static constexpr const uint8_t GetMultiplayerGameState = 20u;
      // Get static field: static public MenuRpcManager/RpcType GetMultiplayerGameState
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetMultiplayerGameState();
      // Set static field: static public MenuRpcManager/RpcType GetMultiplayerGameState
      static void _set_GetMultiplayerGameState(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetMultiplayerGameState
      static constexpr const uint8_t SetMultiplayerGameState = 21u;
      // Get static field: static public MenuRpcManager/RpcType SetMultiplayerGameState
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetMultiplayerGameState();
      // Set static field: static public MenuRpcManager/RpcType SetMultiplayerGameState
      static void _set_SetMultiplayerGameState(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsReady
      static constexpr const uint8_t GetIsReady = 22u;
      // Get static field: static public MenuRpcManager/RpcType GetIsReady
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetIsReady();
      // Set static field: static public MenuRpcManager/RpcType GetIsReady
      static void _set_GetIsReady(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsReady
      static constexpr const uint8_t SetIsReady = 23u;
      // Get static field: static public MenuRpcManager/RpcType SetIsReady
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetIsReady();
      // Set static field: static public MenuRpcManager/RpcType SetIsReady
      static void _set_SetIsReady(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetStartGameTime
      static constexpr const uint8_t SetStartGameTime = 24u;
      // Get static field: static public MenuRpcManager/RpcType SetStartGameTime
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetStartGameTime();
      // Set static field: static public MenuRpcManager/RpcType SetStartGameTime
      static void _set_SetStartGameTime(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType CancelStartGameTime
      static constexpr const uint8_t CancelStartGameTime = 25u;
      // Get static field: static public MenuRpcManager/RpcType CancelStartGameTime
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_CancelStartGameTime();
      // Set static field: static public MenuRpcManager/RpcType CancelStartGameTime
      static void _set_CancelStartGameTime(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsInLobby
      static constexpr const uint8_t GetIsInLobby = 26u;
      // Get static field: static public MenuRpcManager/RpcType GetIsInLobby
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetIsInLobby();
      // Set static field: static public MenuRpcManager/RpcType GetIsInLobby
      static void _set_GetIsInLobby(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsInLobby
      static constexpr const uint8_t SetIsInLobby = 27u;
      // Get static field: static public MenuRpcManager/RpcType SetIsInLobby
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetIsInLobby();
      // Set static field: static public MenuRpcManager/RpcType SetIsInLobby
      static void _set_SetIsInLobby(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetCountdownEndTime
      static constexpr const uint8_t GetCountdownEndTime = 28u;
      // Get static field: static public MenuRpcManager/RpcType GetCountdownEndTime
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetCountdownEndTime();
      // Set static field: static public MenuRpcManager/RpcType GetCountdownEndTime
      static void _set_GetCountdownEndTime(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetCountdownEndTime
      static constexpr const uint8_t SetCountdownEndTime = 29u;
      // Get static field: static public MenuRpcManager/RpcType SetCountdownEndTime
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetCountdownEndTime();
      // Set static field: static public MenuRpcManager/RpcType SetCountdownEndTime
      static void _set_SetCountdownEndTime(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType CancelCountdown
      static constexpr const uint8_t CancelCountdown = 30u;
      // Get static field: static public MenuRpcManager/RpcType CancelCountdown
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_CancelCountdown();
      // Set static field: static public MenuRpcManager/RpcType CancelCountdown
      static void _set_CancelCountdown(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetOwnedSongPacks
      static constexpr const uint8_t GetOwnedSongPacks = 31u;
      // Get static field: static public MenuRpcManager/RpcType GetOwnedSongPacks
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetOwnedSongPacks();
      // Set static field: static public MenuRpcManager/RpcType GetOwnedSongPacks
      static void _set_GetOwnedSongPacks(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetOwnedSongPacks
      static constexpr const uint8_t SetOwnedSongPacks = 32u;
      // Get static field: static public MenuRpcManager/RpcType SetOwnedSongPacks
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetOwnedSongPacks();
      // Set static field: static public MenuRpcManager/RpcType SetOwnedSongPacks
      static void _set_SetOwnedSongPacks(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType RequestKickPlayer
      static constexpr const uint8_t RequestKickPlayer = 33u;
      // Get static field: static public MenuRpcManager/RpcType RequestKickPlayer
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_RequestKickPlayer();
      // Set static field: static public MenuRpcManager/RpcType RequestKickPlayer
      static void _set_RequestKickPlayer(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetPermissionConfiguration
      static constexpr const uint8_t GetPermissionConfiguration = 34u;
      // Get static field: static public MenuRpcManager/RpcType GetPermissionConfiguration
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetPermissionConfiguration();
      // Set static field: static public MenuRpcManager/RpcType GetPermissionConfiguration
      static void _set_GetPermissionConfiguration(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetPermissionConfiguration
      static constexpr const uint8_t SetPermissionConfiguration = 35u;
      // Get static field: static public MenuRpcManager/RpcType SetPermissionConfiguration
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetPermissionConfiguration();
      // Set static field: static public MenuRpcManager/RpcType SetPermissionConfiguration
      static void _set_SetPermissionConfiguration(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsStartButtonEnabled
      static constexpr const uint8_t GetIsStartButtonEnabled = 36u;
      // Get static field: static public MenuRpcManager/RpcType GetIsStartButtonEnabled
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_GetIsStartButtonEnabled();
      // Set static field: static public MenuRpcManager/RpcType GetIsStartButtonEnabled
      static void _set_GetIsStartButtonEnabled(::GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsStartButtonEnabled
      static constexpr const uint8_t SetIsStartButtonEnabled = 37u;
      // Get static field: static public MenuRpcManager/RpcType SetIsStartButtonEnabled
      static ::GlobalNamespace::MenuRpcManager::RpcType _get_SetIsStartButtonEnabled();
      // Set static field: static public MenuRpcManager/RpcType SetIsStartButtonEnabled
      static void _set_SetIsStartButtonEnabled(::GlobalNamespace::MenuRpcManager::RpcType value);
      // Get instance field reference: public System.Byte value__
      uint8_t& dyn_value__();
    }; // MenuRpcManager/RpcType
    #pragma pack(pop)
    static check_size<sizeof(MenuRpcManager::RpcType), 0 + sizeof(uint8_t)> __GlobalNamespace_MenuRpcManager_RpcTypeSizeCheck;
    static_assert(sizeof(MenuRpcManager::RpcType) == 0x1);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Size: 0x8
    // Offset: 0x10
    ::GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IMultiplayerSessionManager*) == 0x8);
    // private readonly RpcHandler`1<MenuRpcManager/RpcType> _rpcHandler
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::RpcHandler_1<::GlobalNamespace::MenuRpcManager::RpcType>* rpcHandler;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RpcHandler_1<::GlobalNamespace::MenuRpcManager::RpcType>*) == 0x8);
    // private System.Action`1<System.String> getPlayersPermissionConfigurationEvent
    // Size: 0x8
    // Offset: 0x20
    ::System::Action_1<::StringW>* getPlayersPermissionConfigurationEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,PlayersLobbyPermissionConfigurationNetSerializable> setPlayersPermissionConfigurationEvent
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_2<::StringW, ::GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>* setPlayersPermissionConfigurationEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>*) == 0x8);
    // private System.Action`2<System.String,PlayersMissingEntitlementsNetSerializable> setPlayersMissingEntitlementsToLevelEvent
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_2<::StringW, ::GlobalNamespace::PlayersMissingEntitlementsNetSerializable*>* setPlayersMissingEntitlementsToLevelEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::GlobalNamespace::PlayersMissingEntitlementsNetSerializable*>*) == 0x8);
    // private System.Action`2<System.String,System.String> getIsEntitledToLevelEvent
    // Size: 0x8
    // Offset: 0x38
    ::System::Action_2<::StringW, ::StringW>* getIsEntitledToLevelEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::StringW>*) == 0x8);
    // private System.Action`3<System.String,System.String,EntitlementsStatus> setIsEntitledToLevelEvent
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_3<::StringW, ::StringW, ::GlobalNamespace::EntitlementsStatus>* setIsEntitledToLevelEvent;
    // Field size check
    static_assert(sizeof(::System::Action_3<::StringW, ::StringW, ::GlobalNamespace::EntitlementsStatus>*) == 0x8);
    // private System.Action`1<System.String> levelEntitlementStatusesInvalidatedEvent
    // Size: 0x8
    // Offset: 0x48
    ::System::Action_1<::StringW>* levelEntitlementStatusesInvalidatedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,System.String> selectedLevelPackEvent
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_2<::StringW, ::StringW>* selectedLevelPackEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::StringW>*) == 0x8);
    // private System.Action`2<System.String,BeatmapIdentifierNetSerializable> setSelectedBeatmapEvent
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>* setSelectedBeatmapEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>*) == 0x8);
    // private System.Action`1<System.String> getSelectedBeatmapEvent
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_1<::StringW>* getSelectedBeatmapEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,BeatmapIdentifierNetSerializable> recommendBeatmapEvent
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>* recommendBeatmapEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>*) == 0x8);
    // private System.Action`1<System.String> clearRecommendedBeatmapEvent
    // Size: 0x8
    // Offset: 0x70
    ::System::Action_1<::StringW>* clearRecommendedBeatmapEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`1<System.String> getRecommendedBeatmapEvent
    // Size: 0x8
    // Offset: 0x78
    ::System::Action_1<::StringW>* getRecommendedBeatmapEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,GameplayModifiers> setSelectGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x80
    ::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>* setSelectGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>*) == 0x8);
    // private System.Action`1<System.String> getSelectedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x88
    ::System::Action_1<::StringW>* getSelectedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,GameplayModifiers> recommendGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x90
    ::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>* recommendGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>*) == 0x8);
    // private System.Action`1<System.String> clearRecommendedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x98
    ::System::Action_1<::StringW>* clearRecommendedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`1<System.String> getRecommendedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_1<::StringW>* getRecommendedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`1<System.String> getIsStartButtonEnabledEvent
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action_1<::StringW>* getIsStartButtonEnabledEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,CannotStartGameReason> setIsStartButtonEnabledEvent
    // Size: 0x8
    // Offset: 0xB0
    ::System::Action_2<::StringW, ::GlobalNamespace::CannotStartGameReason>* setIsStartButtonEnabledEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::GlobalNamespace::CannotStartGameReason>*) == 0x8);
    // private System.Action`2<System.String,System.String> levelLoadErrorEvent
    // Size: 0x8
    // Offset: 0xB8
    ::System::Action_2<::StringW, ::StringW>* levelLoadErrorEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::StringW>*) == 0x8);
    // private System.Action`2<System.String,System.String> levelLoadSuccessEvent
    // Size: 0x8
    // Offset: 0xC0
    ::System::Action_2<::StringW, ::StringW>* levelLoadSuccessEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::StringW>*) == 0x8);
    // private System.Action`4<System.String,BeatmapIdentifierNetSerializable,GameplayModifiers,System.Single> startedLevelEvent
    // Size: 0x8
    // Offset: 0xC8
    ::System::Action_4<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*, ::GlobalNamespace::GameplayModifiers*, float>* startedLevelEvent;
    // Field size check
    static_assert(sizeof(::System::Action_4<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*, ::GlobalNamespace::GameplayModifiers*, float>*) == 0x8);
    // private System.Action`1<System.String> getStartedLevelEvent
    // Size: 0x8
    // Offset: 0xD0
    ::System::Action_1<::StringW>* getStartedLevelEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`1<System.String> getMultiplayerGameStateEvent
    // Size: 0x8
    // Offset: 0xD8
    ::System::Action_1<::StringW>* getMultiplayerGameStateEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,MultiplayerGameState> setMultiplayerGameStateEvent
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action_2<::StringW, ::GlobalNamespace::MultiplayerGameState>* setMultiplayerGameStateEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::GlobalNamespace::MultiplayerGameState>*) == 0x8);
    // private System.Action`1<System.String> cancelCountdownEvent
    // Size: 0x8
    // Offset: 0xE8
    ::System::Action_1<::StringW>* cancelCountdownEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,System.Single> setCountdownEndTimeEvent
    // Size: 0x8
    // Offset: 0xF0
    ::System::Action_2<::StringW, float>* setCountdownEndTimeEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, float>*) == 0x8);
    // private System.Action`1<System.String> getCountdownEndTimeEvent
    // Size: 0x8
    // Offset: 0xF8
    ::System::Action_1<::StringW>* getCountdownEndTimeEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`1<System.String> cancelledLevelStartEvent
    // Size: 0x8
    // Offset: 0x100
    ::System::Action_1<::StringW>* cancelledLevelStartEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`1<System.String> getIsReadyEvent
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_1<::StringW>* getIsReadyEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,System.Boolean> setIsReadyEvent
    // Size: 0x8
    // Offset: 0x110
    ::System::Action_2<::StringW, bool>* setIsReadyEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, bool>*) == 0x8);
    // private System.Action`2<System.String,System.Single> setStartGameTimeEvent
    // Size: 0x8
    // Offset: 0x118
    ::System::Action_2<::StringW, float>* setStartGameTimeEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, float>*) == 0x8);
    // private System.Action`1<System.String> cancelStartGameTimeEvent
    // Size: 0x8
    // Offset: 0x120
    ::System::Action_1<::StringW>* cancelStartGameTimeEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`1<System.String> getIsInLobbyEvent
    // Size: 0x8
    // Offset: 0x128
    ::System::Action_1<::StringW>* getIsInLobbyEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,System.Boolean> setIsInLobbyEvent
    // Size: 0x8
    // Offset: 0x130
    ::System::Action_2<::StringW, bool>* setIsInLobbyEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, bool>*) == 0x8);
    // private System.Action`1<System.String> getOwnedSongPacksEvent
    // Size: 0x8
    // Offset: 0x138
    ::System::Action_1<::StringW>* getOwnedSongPacksEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`2<System.String,SongPackMask> setOwnedSongPacksEvent
    // Size: 0x8
    // Offset: 0x140
    ::System::Action_2<::StringW, ::GlobalNamespace::SongPackMask>* setOwnedSongPacksEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::GlobalNamespace::SongPackMask>*) == 0x8);
    // private System.Action`2<System.String,System.String> requestedKickPlayerEvent
    // Size: 0x8
    // Offset: 0x148
    ::System::Action_2<::StringW, ::StringW>* requestedKickPlayerEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::StringW, ::StringW>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IMenuRpcManager
    operator ::GlobalNamespace::IMenuRpcManager() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IMenuRpcManager*>(this);
    }
    // static field const value: static private System.String kMenuState
    static constexpr const char* kMenuState = "in_menu";
    // Get static field: static private System.String kMenuState
    static ::StringW _get_kMenuState();
    // Set static field: static private System.String kMenuState
    static void _set_kMenuState(::StringW value);
    // Get instance field reference: private readonly IMultiplayerSessionManager _multiplayerSessionManager
    ::GlobalNamespace::IMultiplayerSessionManager*& dyn__multiplayerSessionManager();
    // Get instance field reference: private readonly RpcHandler`1<MenuRpcManager/RpcType> _rpcHandler
    ::GlobalNamespace::RpcHandler_1<::GlobalNamespace::MenuRpcManager::RpcType>*& dyn__rpcHandler();
    // Get instance field reference: private System.Action`1<System.String> getPlayersPermissionConfigurationEvent
    ::System::Action_1<::StringW>*& dyn_getPlayersPermissionConfigurationEvent();
    // Get instance field reference: private System.Action`2<System.String,PlayersLobbyPermissionConfigurationNetSerializable> setPlayersPermissionConfigurationEvent
    ::System::Action_2<::StringW, ::GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>*& dyn_setPlayersPermissionConfigurationEvent();
    // Get instance field reference: private System.Action`2<System.String,PlayersMissingEntitlementsNetSerializable> setPlayersMissingEntitlementsToLevelEvent
    ::System::Action_2<::StringW, ::GlobalNamespace::PlayersMissingEntitlementsNetSerializable*>*& dyn_setPlayersMissingEntitlementsToLevelEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> getIsEntitledToLevelEvent
    ::System::Action_2<::StringW, ::StringW>*& dyn_getIsEntitledToLevelEvent();
    // Get instance field reference: private System.Action`3<System.String,System.String,EntitlementsStatus> setIsEntitledToLevelEvent
    ::System::Action_3<::StringW, ::StringW, ::GlobalNamespace::EntitlementsStatus>*& dyn_setIsEntitledToLevelEvent();
    // Get instance field reference: private System.Action`1<System.String> levelEntitlementStatusesInvalidatedEvent
    ::System::Action_1<::StringW>*& dyn_levelEntitlementStatusesInvalidatedEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> selectedLevelPackEvent
    ::System::Action_2<::StringW, ::StringW>*& dyn_selectedLevelPackEvent();
    // Get instance field reference: private System.Action`2<System.String,BeatmapIdentifierNetSerializable> setSelectedBeatmapEvent
    ::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>*& dyn_setSelectedBeatmapEvent();
    // Get instance field reference: private System.Action`1<System.String> getSelectedBeatmapEvent
    ::System::Action_1<::StringW>*& dyn_getSelectedBeatmapEvent();
    // Get instance field reference: private System.Action`2<System.String,BeatmapIdentifierNetSerializable> recommendBeatmapEvent
    ::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>*& dyn_recommendBeatmapEvent();
    // Get instance field reference: private System.Action`1<System.String> clearRecommendedBeatmapEvent
    ::System::Action_1<::StringW>*& dyn_clearRecommendedBeatmapEvent();
    // Get instance field reference: private System.Action`1<System.String> getRecommendedBeatmapEvent
    ::System::Action_1<::StringW>*& dyn_getRecommendedBeatmapEvent();
    // Get instance field reference: private System.Action`2<System.String,GameplayModifiers> setSelectGameplayModifiersEvent
    ::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>*& dyn_setSelectGameplayModifiersEvent();
    // Get instance field reference: private System.Action`1<System.String> getSelectedGameplayModifiersEvent
    ::System::Action_1<::StringW>*& dyn_getSelectedGameplayModifiersEvent();
    // Get instance field reference: private System.Action`2<System.String,GameplayModifiers> recommendGameplayModifiersEvent
    ::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>*& dyn_recommendGameplayModifiersEvent();
    // Get instance field reference: private System.Action`1<System.String> clearRecommendedGameplayModifiersEvent
    ::System::Action_1<::StringW>*& dyn_clearRecommendedGameplayModifiersEvent();
    // Get instance field reference: private System.Action`1<System.String> getRecommendedGameplayModifiersEvent
    ::System::Action_1<::StringW>*& dyn_getRecommendedGameplayModifiersEvent();
    // Get instance field reference: private System.Action`1<System.String> getIsStartButtonEnabledEvent
    ::System::Action_1<::StringW>*& dyn_getIsStartButtonEnabledEvent();
    // Get instance field reference: private System.Action`2<System.String,CannotStartGameReason> setIsStartButtonEnabledEvent
    ::System::Action_2<::StringW, ::GlobalNamespace::CannotStartGameReason>*& dyn_setIsStartButtonEnabledEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> levelLoadErrorEvent
    ::System::Action_2<::StringW, ::StringW>*& dyn_levelLoadErrorEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> levelLoadSuccessEvent
    ::System::Action_2<::StringW, ::StringW>*& dyn_levelLoadSuccessEvent();
    // Get instance field reference: private System.Action`4<System.String,BeatmapIdentifierNetSerializable,GameplayModifiers,System.Single> startedLevelEvent
    ::System::Action_4<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*, ::GlobalNamespace::GameplayModifiers*, float>*& dyn_startedLevelEvent();
    // Get instance field reference: private System.Action`1<System.String> getStartedLevelEvent
    ::System::Action_1<::StringW>*& dyn_getStartedLevelEvent();
    // Get instance field reference: private System.Action`1<System.String> getMultiplayerGameStateEvent
    ::System::Action_1<::StringW>*& dyn_getMultiplayerGameStateEvent();
    // Get instance field reference: private System.Action`2<System.String,MultiplayerGameState> setMultiplayerGameStateEvent
    ::System::Action_2<::StringW, ::GlobalNamespace::MultiplayerGameState>*& dyn_setMultiplayerGameStateEvent();
    // Get instance field reference: private System.Action`1<System.String> cancelCountdownEvent
    ::System::Action_1<::StringW>*& dyn_cancelCountdownEvent();
    // Get instance field reference: private System.Action`2<System.String,System.Single> setCountdownEndTimeEvent
    ::System::Action_2<::StringW, float>*& dyn_setCountdownEndTimeEvent();
    // Get instance field reference: private System.Action`1<System.String> getCountdownEndTimeEvent
    ::System::Action_1<::StringW>*& dyn_getCountdownEndTimeEvent();
    // Get instance field reference: private System.Action`1<System.String> cancelledLevelStartEvent
    ::System::Action_1<::StringW>*& dyn_cancelledLevelStartEvent();
    // Get instance field reference: private System.Action`1<System.String> getIsReadyEvent
    ::System::Action_1<::StringW>*& dyn_getIsReadyEvent();
    // Get instance field reference: private System.Action`2<System.String,System.Boolean> setIsReadyEvent
    ::System::Action_2<::StringW, bool>*& dyn_setIsReadyEvent();
    // Get instance field reference: private System.Action`2<System.String,System.Single> setStartGameTimeEvent
    ::System::Action_2<::StringW, float>*& dyn_setStartGameTimeEvent();
    // Get instance field reference: private System.Action`1<System.String> cancelStartGameTimeEvent
    ::System::Action_1<::StringW>*& dyn_cancelStartGameTimeEvent();
    // Get instance field reference: private System.Action`1<System.String> getIsInLobbyEvent
    ::System::Action_1<::StringW>*& dyn_getIsInLobbyEvent();
    // Get instance field reference: private System.Action`2<System.String,System.Boolean> setIsInLobbyEvent
    ::System::Action_2<::StringW, bool>*& dyn_setIsInLobbyEvent();
    // Get instance field reference: private System.Action`1<System.String> getOwnedSongPacksEvent
    ::System::Action_1<::StringW>*& dyn_getOwnedSongPacksEvent();
    // Get instance field reference: private System.Action`2<System.String,SongPackMask> setOwnedSongPacksEvent
    ::System::Action_2<::StringW, ::GlobalNamespace::SongPackMask>*& dyn_setOwnedSongPacksEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> requestedKickPlayerEvent
    ::System::Action_2<::StringW, ::StringW>*& dyn_requestedKickPlayerEvent();
    // public IMultiplayerSessionManager get_multiplayerSessionManager()
    // Offset: 0x2C9E8F4
    ::GlobalNamespace::IMultiplayerSessionManager* get_multiplayerSessionManager();
    // public System.Boolean get_enabled()
    // Offset: 0x2C9E8FC
    bool get_enabled();
    // public System.Void set_enabled(System.Boolean value)
    // Offset: 0x2C9E9C0
    void set_enabled(bool value);
    // public System.Boolean get_enabledForAllPlayers()
    // Offset: 0x2C9EA94
    bool get_enabledForAllPlayers();
    // public System.Single get_syncTime()
    // Offset: 0x2C9EC80
    float get_syncTime();
    // public System.Void add_getPlayersPermissionConfigurationEvent(System.Action`1<System.String> value)
    // Offset: 0x2C9FA90
    void add_getPlayersPermissionConfigurationEvent(::System::Action_1<::StringW>* value);
    // public System.Void remove_getPlayersPermissionConfigurationEvent(System.Action`1<System.String> value)
    // Offset: 0x2C9FB34
    void remove_getPlayersPermissionConfigurationEvent(::System::Action_1<::StringW>* value);
    // public System.Void add_setPlayersPermissionConfigurationEvent(System.Action`2<System.String,PlayersLobbyPermissionConfigurationNetSerializable> value)
    // Offset: 0x2C9FCA4
    void add_setPlayersPermissionConfigurationEvent(::System::Action_2<::StringW, ::GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>* value);
    // public System.Void remove_setPlayersPermissionConfigurationEvent(System.Action`2<System.String,PlayersLobbyPermissionConfigurationNetSerializable> value)
    // Offset: 0x2C9FD48
    void remove_setPlayersPermissionConfigurationEvent(::System::Action_2<::StringW, ::GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>* value);
    // public System.Void add_setPlayersMissingEntitlementsToLevelEvent(System.Action`2<System.String,PlayersMissingEntitlementsNetSerializable> value)
    // Offset: 0x2C9FED0
    void add_setPlayersMissingEntitlementsToLevelEvent(::System::Action_2<::StringW, ::GlobalNamespace::PlayersMissingEntitlementsNetSerializable*>* value);
    // public System.Void remove_setPlayersMissingEntitlementsToLevelEvent(System.Action`2<System.String,PlayersMissingEntitlementsNetSerializable> value)
    // Offset: 0x2C9FF74
    void remove_setPlayersMissingEntitlementsToLevelEvent(::System::Action_2<::StringW, ::GlobalNamespace::PlayersMissingEntitlementsNetSerializable*>* value);
    // public System.Void add_getIsEntitledToLevelEvent(System.Action`2<System.String,System.String> value)
    // Offset: 0x2CA00FC
    void add_getIsEntitledToLevelEvent(::System::Action_2<::StringW, ::StringW>* value);
    // public System.Void remove_getIsEntitledToLevelEvent(System.Action`2<System.String,System.String> value)
    // Offset: 0x2CA01A0
    void remove_getIsEntitledToLevelEvent(::System::Action_2<::StringW, ::StringW>* value);
    // public System.Void add_setIsEntitledToLevelEvent(System.Action`3<System.String,System.String,EntitlementsStatus> value)
    // Offset: 0x2CA0328
    void add_setIsEntitledToLevelEvent(::System::Action_3<::StringW, ::StringW, ::GlobalNamespace::EntitlementsStatus>* value);
    // public System.Void remove_setIsEntitledToLevelEvent(System.Action`3<System.String,System.String,EntitlementsStatus> value)
    // Offset: 0x2CA03CC
    void remove_setIsEntitledToLevelEvent(::System::Action_3<::StringW, ::StringW, ::GlobalNamespace::EntitlementsStatus>* value);
    // public System.Void add_levelEntitlementStatusesInvalidatedEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA0570
    void add_levelEntitlementStatusesInvalidatedEvent(::System::Action_1<::StringW>* value);
    // public System.Void remove_levelEntitlementStatusesInvalidatedEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA0614
    void remove_levelEntitlementStatusesInvalidatedEvent(::System::Action_1<::StringW>* value);
    // public System.Void add_selectedLevelPackEvent(System.Action`2<System.String,System.String> value)
    // Offset: 0x2CA0784
    void add_selectedLevelPackEvent(::System::Action_2<::StringW, ::StringW>* value);
    // public System.Void remove_selectedLevelPackEvent(System.Action`2<System.String,System.String> value)
    // Offset: 0x2CA0828
    void remove_selectedLevelPackEvent(::System::Action_2<::StringW, ::StringW>* value);
    // public System.Void add_setSelectedBeatmapEvent(System.Action`2<System.String,BeatmapIdentifierNetSerializable> value)
    // Offset: 0x2CA09B0
    void add_setSelectedBeatmapEvent(::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>* value);
    // public System.Void remove_setSelectedBeatmapEvent(System.Action`2<System.String,BeatmapIdentifierNetSerializable> value)
    // Offset: 0x2CA0A54
    void remove_setSelectedBeatmapEvent(::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>* value);
    // public System.Void add_getSelectedBeatmapEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA0BDC
    void add_getSelectedBeatmapEvent(::System::Action_1<::StringW>* value);
    // public System.Void remove_getSelectedBeatmapEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA0C80
    void remove_getSelectedBeatmapEvent(::System::Action_1<::StringW>* value);
    // public System.Void add_recommendBeatmapEvent(System.Action`2<System.String,BeatmapIdentifierNetSerializable> value)
    // Offset: 0x2CA0DF0
    void add_recommendBeatmapEvent(::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>* value);
    // public System.Void remove_recommendBeatmapEvent(System.Action`2<System.String,BeatmapIdentifierNetSerializable> value)
    // Offset: 0x2CA0E94
    void remove_recommendBeatmapEvent(::System::Action_2<::StringW, ::GlobalNamespace::BeatmapIdentifierNetSerializable*>* value);
    // public System.Void add_clearRecommendedBeatmapEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA101C
    void add_clearRecommendedBeatmapEvent(::System::Action_1<::StringW>* value);
    // public System.Void remove_clearRecommendedBeatmapEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA10C0
    void remove_clearRecommendedBeatmapEvent(::System::Action_1<::StringW>* value);
    // public System.Void add_getRecommendedBeatmapEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA1230
    void add_getRecommendedBeatmapEvent(::System::Action_1<::StringW>* value);
    // public System.Void remove_getRecommendedBeatmapEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA12D4
    void remove_getRecommendedBeatmapEvent(::System::Action_1<::StringW>* value);
    // public System.Void add_setSelectGameplayModifiersEvent(System.Action`2<System.String,GameplayModifiers> value)
    // Offset: 0x2CA1444
    void add_setSelectGameplayModifiersEvent(::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>* value);
    // public System.Void remove_setSelectGameplayModifiersEvent(System.Action`2<System.String,GameplayModifiers> value)
    // Offset: 0x2CA14E8
    void remove_setSelectGameplayModifiersEvent(::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>* value);
    // public System.Void add_getSelectedGameplayModifiersEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA1670
    void add_getSelectedGameplayModifiersEvent(::System::Action_1<::StringW>* value);
    // public System.Void remove_getSelectedGameplayModifiersEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA1714
    void remove_getSelectedGameplayModifiersEvent(::System::Action_1<::StringW>* value);
    // public System.Void add_recommendGameplayModifiersEvent(System.Action`2<System.String,GameplayModifiers> value)
    // Offset: 0x2CA1884
    void add_recommendGameplayModifiersEvent(::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>* value);
    // public System.Void remove_recommendGameplayModifiersEvent(System.Action`2<System.String,GameplayModifiers> value)
    // Offset: 0x2CA1928
    void remove_recommendGameplayModifiersEvent(::System::Action_2<::StringW, ::GlobalNamespace::GameplayModifiers*>* value);
    // public System.Void add_clearRecommendedGameplayModifiersEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA1AB0
    void add_clearRecommendedGameplayModifiersEvent(::System::Action_1<::StringW>* value);
    // public System.Void remove_clearRecommendedGameplayModifiersEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA1B54
    void remove_clearRecommendedGameplayModifiersEvent(::System::Action_1<::StringW>* value);
    // public System.Void add_getRecommendedGameplayModifiersEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA1CC4
    void add_getRecommendedGameplayModifiersEvent(::System::Action_1<::StringW>* value);
    // public System.Void remove_getRecommendedGameplayModifiersEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA1D68
    void remove_getRecommendedGameplayModifiersEvent(::System::Action_1<::StringW>* value);
    // public System.Void add_getIsStartButtonEnabledEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA1ED8
    void add_getIsStartButtonEnabledEvent(::System::Action_1<::StringW>* value);
    // public System.Void remove_getIsStartButtonEnabledEvent(System.Action`1<System.String> value)
    // Offset: 0x2CA1F7C
    void remove_getIsStartButtonEnabledEvent(::System::Action_1<::StringW>* value);
    // public System.Void add_setIsStartButtonEnabledEvent(System.Action`2<System.String,CannotStartGameReason> value)
    // Offset: 0x2CA20EC
    void add_setIsStartButtonEnabledEvent(::System::Action_2<::StringW, ::GlobalNamespace::CannotStartGameReason>* value);
    // public System.Void remove_setIsStartButtonEnabledEvent(System.Action`2<System.String,CannotStartGameReason> value)
    // Offset: 0x2CA2190
    void remove_setIsStartButtonEnabledEvent(::System::Action_2<::StringW, ::GlobalNamespace::CannotStartGameReason>* value);
    // public System.Void add_levelLoadErrorEvent(System.Action`2<System.String,System.String> value)
    // Offset: 0x2CA2318
