// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: IMenuRpcManager
#include "GlobalNamespace/IMenuRpcManager.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Action`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Action_4;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: RpcHandler`1<TType>
  template<typename TType>
  class RpcHandler_1;
  // Forward declaring type: PlayersLobbyPermissionConfigurationNetSerializable
  class PlayersLobbyPermissionConfigurationNetSerializable;
  // Forward declaring type: PlayersMissingEntitlementsNetSerializable
  class PlayersMissingEntitlementsNetSerializable;
  // Forward declaring type: BeatmapIdentifierNetSerializable
  class BeatmapIdentifierNetSerializable;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x150
  #pragma pack(push, 1)
  // Autogenerated type: MenuRpcManager
  // [TokenAttribute] Offset: FFFFFFFF
  class MenuRpcManager : public ::Il2CppObject/*, public GlobalNamespace::IMenuRpcManager*/ {
    public:
    // Nested type: GlobalNamespace::MenuRpcManager::RpcType
    struct RpcType;
    // Nested type: GlobalNamespace::MenuRpcManager::GetPlayersPermissionConfigurationRpc
    class GetPlayersPermissionConfigurationRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetPlayersPermissionConfigurationRpc
    class SetPlayersPermissionConfigurationRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetPlayersMissingEntitlementsToLevelRpc
    class SetPlayersMissingEntitlementsToLevelRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetIsEntitledToLevelRpc
    class GetIsEntitledToLevelRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetIsEntitledToLevelRpc
    class SetIsEntitledToLevelRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::InvalidateLevelEntitlementStatusesRpc
    class InvalidateLevelEntitlementStatusesRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SelectLevelPackRpc
    class SelectLevelPackRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetSelectedBeatmapRpc
    class SetSelectedBeatmapRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetSelectedBeatmapRpc
    class GetSelectedBeatmapRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::RecommendBeatmapRpc
    class RecommendBeatmapRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::ClearRecommendedBeatmapRpc
    class ClearRecommendedBeatmapRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetRecommendedBeatmapRpc
    class GetRecommendedBeatmapRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetSelectedGameplayModifiersRpc
    class SetSelectedGameplayModifiersRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetSelectedGameplayModifiersRpc
    class GetSelectedGameplayModifiersRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::RecommendGameplayModifiersRpc
    class RecommendGameplayModifiersRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::ClearRecommendedGameplayModifiersRpc
    class ClearRecommendedGameplayModifiersRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetRecommendedGameplayModifiersRpc
    class GetRecommendedGameplayModifiersRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetIsStartButtonEnabledRpc
    class GetIsStartButtonEnabledRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetIsStartButtonEnabledRpc
    class SetIsStartButtonEnabledRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::LevelLoadErrorRpc
    class LevelLoadErrorRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::LevelLoadSuccessRpc
    class LevelLoadSuccessRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::StartLevelRpc
    class StartLevelRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetStartedLevelRpc
    class GetStartedLevelRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetMultiplayerGameStateRpc
    class GetMultiplayerGameStateRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetMultiplayerGameStateRpc
    class SetMultiplayerGameStateRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::CancelCountdownRpc
    class CancelCountdownRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetCountdownEndTimeRpc
    class SetCountdownEndTimeRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetCountdownEndTimeRpc
    class GetCountdownEndTimeRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::CancelLevelStartRpc
    class CancelLevelStartRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetIsReadyRpc
    class GetIsReadyRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetIsReadyRpc
    class SetIsReadyRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetStartGameTimeRpc
    class SetStartGameTimeRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::CancelStartGameTimeRpc
    class CancelStartGameTimeRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetIsInLobbyRpc
    class GetIsInLobbyRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetIsInLobbyRpc
    class SetIsInLobbyRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetOwnedSongPacksRpc
    class GetOwnedSongPacksRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetOwnedSongPacksRpc
    class SetOwnedSongPacksRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::RequestKickPlayerRpc
    class RequestKickPlayerRpc;
    // Size: 0x1
    #pragma pack(push, 1)
    // Autogenerated type: MenuRpcManager/RpcType
    // [TokenAttribute] Offset: FFFFFFFF
    struct RpcType/*, public System::Enum*/ {
      public:
      // public System.Byte value__
      // Size: 0x1
      // Offset: 0x0
      uint8_t value;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      // Creating value type constructor for type: RpcType
      constexpr RpcType(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public MenuRpcManager/RpcType SetPlayersMissingEntitlementsToLevel
      static constexpr const uint8_t SetPlayersMissingEntitlementsToLevel = 0u;
      // Get static field: static public MenuRpcManager/RpcType SetPlayersMissingEntitlementsToLevel
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetPlayersMissingEntitlementsToLevel();
      // Set static field: static public MenuRpcManager/RpcType SetPlayersMissingEntitlementsToLevel
      static void _set_SetPlayersMissingEntitlementsToLevel(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsEntitledToLevel
      static constexpr const uint8_t GetIsEntitledToLevel = 1u;
      // Get static field: static public MenuRpcManager/RpcType GetIsEntitledToLevel
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetIsEntitledToLevel();
      // Set static field: static public MenuRpcManager/RpcType GetIsEntitledToLevel
      static void _set_GetIsEntitledToLevel(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsEntitledToLevel
      static constexpr const uint8_t SetIsEntitledToLevel = 2u;
      // Get static field: static public MenuRpcManager/RpcType SetIsEntitledToLevel
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetIsEntitledToLevel();
      // Set static field: static public MenuRpcManager/RpcType SetIsEntitledToLevel
      static void _set_SetIsEntitledToLevel(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType InvalidateLevelEntitlementStatuses
      static constexpr const uint8_t InvalidateLevelEntitlementStatuses = 3u;
      // Get static field: static public MenuRpcManager/RpcType InvalidateLevelEntitlementStatuses
      static GlobalNamespace::MenuRpcManager::RpcType _get_InvalidateLevelEntitlementStatuses();
      // Set static field: static public MenuRpcManager/RpcType InvalidateLevelEntitlementStatuses
      static void _set_InvalidateLevelEntitlementStatuses(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SelectLevelPack
      static constexpr const uint8_t SelectLevelPack = 4u;
      // Get static field: static public MenuRpcManager/RpcType SelectLevelPack
      static GlobalNamespace::MenuRpcManager::RpcType _get_SelectLevelPack();
      // Set static field: static public MenuRpcManager/RpcType SelectLevelPack
      static void _set_SelectLevelPack(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetSelectedBeatmap
      static constexpr const uint8_t SetSelectedBeatmap = 5u;
      // Get static field: static public MenuRpcManager/RpcType SetSelectedBeatmap
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetSelectedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType SetSelectedBeatmap
      static void _set_SetSelectedBeatmap(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetSelectedBeatmap
      static constexpr const uint8_t GetSelectedBeatmap = 6u;
      // Get static field: static public MenuRpcManager/RpcType GetSelectedBeatmap
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetSelectedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType GetSelectedBeatmap
      static void _set_GetSelectedBeatmap(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType RecommendBeatmap
      static constexpr const uint8_t RecommendBeatmap = 7u;
      // Get static field: static public MenuRpcManager/RpcType RecommendBeatmap
      static GlobalNamespace::MenuRpcManager::RpcType _get_RecommendBeatmap();
      // Set static field: static public MenuRpcManager/RpcType RecommendBeatmap
      static void _set_RecommendBeatmap(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType ClearRecommendedBeatmap
      static constexpr const uint8_t ClearRecommendedBeatmap = 8u;
      // Get static field: static public MenuRpcManager/RpcType ClearRecommendedBeatmap
      static GlobalNamespace::MenuRpcManager::RpcType _get_ClearRecommendedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType ClearRecommendedBeatmap
      static void _set_ClearRecommendedBeatmap(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetRecommendedBeatmap
      static constexpr const uint8_t GetRecommendedBeatmap = 9u;
      // Get static field: static public MenuRpcManager/RpcType GetRecommendedBeatmap
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetRecommendedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType GetRecommendedBeatmap
      static void _set_GetRecommendedBeatmap(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetSelectedGameplayModifiers
      static constexpr const uint8_t SetSelectedGameplayModifiers = 10u;
      // Get static field: static public MenuRpcManager/RpcType SetSelectedGameplayModifiers
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetSelectedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType SetSelectedGameplayModifiers
      static void _set_SetSelectedGameplayModifiers(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetSelectedGameplayModifiers
      static constexpr const uint8_t GetSelectedGameplayModifiers = 11u;
      // Get static field: static public MenuRpcManager/RpcType GetSelectedGameplayModifiers
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetSelectedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType GetSelectedGameplayModifiers
      static void _set_GetSelectedGameplayModifiers(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType RecommendGameplayModifiers
      static constexpr const uint8_t RecommendGameplayModifiers = 12u;
      // Get static field: static public MenuRpcManager/RpcType RecommendGameplayModifiers
      static GlobalNamespace::MenuRpcManager::RpcType _get_RecommendGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType RecommendGameplayModifiers
      static void _set_RecommendGameplayModifiers(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType ClearRecommendedGameplayModifiers
      static constexpr const uint8_t ClearRecommendedGameplayModifiers = 13u;
      // Get static field: static public MenuRpcManager/RpcType ClearRecommendedGameplayModifiers
      static GlobalNamespace::MenuRpcManager::RpcType _get_ClearRecommendedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType ClearRecommendedGameplayModifiers
      static void _set_ClearRecommendedGameplayModifiers(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetRecommendedGameplayModifiers
      static constexpr const uint8_t GetRecommendedGameplayModifiers = 14u;
      // Get static field: static public MenuRpcManager/RpcType GetRecommendedGameplayModifiers
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetRecommendedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType GetRecommendedGameplayModifiers
      static void _set_GetRecommendedGameplayModifiers(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType LevelLoadError
      static constexpr const uint8_t LevelLoadError = 15u;
      // Get static field: static public MenuRpcManager/RpcType LevelLoadError
      static GlobalNamespace::MenuRpcManager::RpcType _get_LevelLoadError();
      // Set static field: static public MenuRpcManager/RpcType LevelLoadError
      static void _set_LevelLoadError(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType LevelLoadSuccess
      static constexpr const uint8_t LevelLoadSuccess = 16u;
      // Get static field: static public MenuRpcManager/RpcType LevelLoadSuccess
      static GlobalNamespace::MenuRpcManager::RpcType _get_LevelLoadSuccess();
      // Set static field: static public MenuRpcManager/RpcType LevelLoadSuccess
      static void _set_LevelLoadSuccess(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType StartLevel
      static constexpr const uint8_t StartLevel = 17u;
      // Get static field: static public MenuRpcManager/RpcType StartLevel
      static GlobalNamespace::MenuRpcManager::RpcType _get_StartLevel();
      // Set static field: static public MenuRpcManager/RpcType StartLevel
      static void _set_StartLevel(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetStartedLevel
      static constexpr const uint8_t GetStartedLevel = 18u;
      // Get static field: static public MenuRpcManager/RpcType GetStartedLevel
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetStartedLevel();
      // Set static field: static public MenuRpcManager/RpcType GetStartedLevel
      static void _set_GetStartedLevel(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType CancelLevelStart
      static constexpr const uint8_t CancelLevelStart = 19u;
      // Get static field: static public MenuRpcManager/RpcType CancelLevelStart
      static GlobalNamespace::MenuRpcManager::RpcType _get_CancelLevelStart();
      // Set static field: static public MenuRpcManager/RpcType CancelLevelStart
      static void _set_CancelLevelStart(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetMultiplayerGameState
      static constexpr const uint8_t GetMultiplayerGameState = 20u;
      // Get static field: static public MenuRpcManager/RpcType GetMultiplayerGameState
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetMultiplayerGameState();
      // Set static field: static public MenuRpcManager/RpcType GetMultiplayerGameState
      static void _set_GetMultiplayerGameState(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetMultiplayerGameState
      static constexpr const uint8_t SetMultiplayerGameState = 21u;
      // Get static field: static public MenuRpcManager/RpcType SetMultiplayerGameState
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetMultiplayerGameState();
      // Set static field: static public MenuRpcManager/RpcType SetMultiplayerGameState
      static void _set_SetMultiplayerGameState(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsReady
      static constexpr const uint8_t GetIsReady = 22u;
      // Get static field: static public MenuRpcManager/RpcType GetIsReady
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetIsReady();
      // Set static field: static public MenuRpcManager/RpcType GetIsReady
      static void _set_GetIsReady(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsReady
      static constexpr const uint8_t SetIsReady = 23u;
      // Get static field: static public MenuRpcManager/RpcType SetIsReady
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetIsReady();
      // Set static field: static public MenuRpcManager/RpcType SetIsReady
      static void _set_SetIsReady(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetStartGameTime
      static constexpr const uint8_t SetStartGameTime = 24u;
      // Get static field: static public MenuRpcManager/RpcType SetStartGameTime
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetStartGameTime();
      // Set static field: static public MenuRpcManager/RpcType SetStartGameTime
      static void _set_SetStartGameTime(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType CancelStartGameTime
      static constexpr const uint8_t CancelStartGameTime = 25u;
      // Get static field: static public MenuRpcManager/RpcType CancelStartGameTime
      static GlobalNamespace::MenuRpcManager::RpcType _get_CancelStartGameTime();
      // Set static field: static public MenuRpcManager/RpcType CancelStartGameTime
      static void _set_CancelStartGameTime(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsInLobby
      static constexpr const uint8_t GetIsInLobby = 26u;
      // Get static field: static public MenuRpcManager/RpcType GetIsInLobby
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetIsInLobby();
      // Set static field: static public MenuRpcManager/RpcType GetIsInLobby
      static void _set_GetIsInLobby(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsInLobby
      static constexpr const uint8_t SetIsInLobby = 27u;
      // Get static field: static public MenuRpcManager/RpcType SetIsInLobby
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetIsInLobby();
      // Set static field: static public MenuRpcManager/RpcType SetIsInLobby
      static void _set_SetIsInLobby(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetCountdownEndTime
      static constexpr const uint8_t GetCountdownEndTime = 28u;
      // Get static field: static public MenuRpcManager/RpcType GetCountdownEndTime
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetCountdownEndTime();
      // Set static field: static public MenuRpcManager/RpcType GetCountdownEndTime
      static void _set_GetCountdownEndTime(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetCountdownEndTime
      static constexpr const uint8_t SetCountdownEndTime = 29u;
      // Get static field: static public MenuRpcManager/RpcType SetCountdownEndTime
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetCountdownEndTime();
      // Set static field: static public MenuRpcManager/RpcType SetCountdownEndTime
      static void _set_SetCountdownEndTime(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType CancelCountdown
      static constexpr const uint8_t CancelCountdown = 30u;
      // Get static field: static public MenuRpcManager/RpcType CancelCountdown
      static GlobalNamespace::MenuRpcManager::RpcType _get_CancelCountdown();
      // Set static field: static public MenuRpcManager/RpcType CancelCountdown
      static void _set_CancelCountdown(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetOwnedSongPacks
      static constexpr const uint8_t GetOwnedSongPacks = 31u;
      // Get static field: static public MenuRpcManager/RpcType GetOwnedSongPacks
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetOwnedSongPacks();
      // Set static field: static public MenuRpcManager/RpcType GetOwnedSongPacks
      static void _set_GetOwnedSongPacks(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetOwnedSongPacks
      static constexpr const uint8_t SetOwnedSongPacks = 32u;
      // Get static field: static public MenuRpcManager/RpcType SetOwnedSongPacks
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetOwnedSongPacks();
      // Set static field: static public MenuRpcManager/RpcType SetOwnedSongPacks
      static void _set_SetOwnedSongPacks(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType RequestKickPlayer
      static constexpr const uint8_t RequestKickPlayer = 33u;
      // Get static field: static public MenuRpcManager/RpcType RequestKickPlayer
      static GlobalNamespace::MenuRpcManager::RpcType _get_RequestKickPlayer();
      // Set static field: static public MenuRpcManager/RpcType RequestKickPlayer
      static void _set_RequestKickPlayer(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetPermissionConfiguration
      static constexpr const uint8_t GetPermissionConfiguration = 34u;
      // Get static field: static public MenuRpcManager/RpcType GetPermissionConfiguration
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetPermissionConfiguration();
      // Set static field: static public MenuRpcManager/RpcType GetPermissionConfiguration
      static void _set_GetPermissionConfiguration(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetPermissionConfiguration
      static constexpr const uint8_t SetPermissionConfiguration = 35u;
      // Get static field: static public MenuRpcManager/RpcType SetPermissionConfiguration
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetPermissionConfiguration();
      // Set static field: static public MenuRpcManager/RpcType SetPermissionConfiguration
      static void _set_SetPermissionConfiguration(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsStartButtonEnabled
      static constexpr const uint8_t GetIsStartButtonEnabled = 36u;
      // Get static field: static public MenuRpcManager/RpcType GetIsStartButtonEnabled
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetIsStartButtonEnabled();
      // Set static field: static public MenuRpcManager/RpcType GetIsStartButtonEnabled
      static void _set_GetIsStartButtonEnabled(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsStartButtonEnabled
      static constexpr const uint8_t SetIsStartButtonEnabled = 37u;
      // Get static field: static public MenuRpcManager/RpcType SetIsStartButtonEnabled
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetIsStartButtonEnabled();
      // Set static field: static public MenuRpcManager/RpcType SetIsStartButtonEnabled
      static void _set_SetIsStartButtonEnabled(GlobalNamespace::MenuRpcManager::RpcType value);
      // Get instance field reference: public System.Byte value__
      uint8_t& dyn_value__();
    }; // MenuRpcManager/RpcType
    #pragma pack(pop)
    static check_size<sizeof(MenuRpcManager::RpcType), 0 + sizeof(uint8_t)> __GlobalNamespace_MenuRpcManager_RpcTypeSizeCheck;
    static_assert(sizeof(MenuRpcManager::RpcType) == 0x1);
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Size: 0x8
    // Offset: 0x10
    GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IMultiplayerSessionManager*) == 0x8);
    // private readonly RpcHandler`1<MenuRpcManager/RpcType> _rpcHandler
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::RpcHandler_1<GlobalNamespace::MenuRpcManager::RpcType>* rpcHandler;
    // Field size check
    static_assert(sizeof(GlobalNamespace::RpcHandler_1<GlobalNamespace::MenuRpcManager::RpcType>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9CC0
    // private System.Action`1<System.String> getPlayersPermissionConfigurationEvent
    // Size: 0x8
    // Offset: 0x20
    System::Action_1<::Il2CppString*>* getPlayersPermissionConfigurationEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9CD0
    // private System.Action`2<System.String,PlayersLobbyPermissionConfigurationNetSerializable> setPlayersPermissionConfigurationEvent
    // Size: 0x8
    // Offset: 0x28
    System::Action_2<::Il2CppString*, GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>* setPlayersPermissionConfigurationEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9CE0
    // private System.Action`2<System.String,PlayersMissingEntitlementsNetSerializable> setPlayersMissingEntitlementsToLevelEvent
    // Size: 0x8
    // Offset: 0x30
    System::Action_2<::Il2CppString*, GlobalNamespace::PlayersMissingEntitlementsNetSerializable*>* setPlayersMissingEntitlementsToLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::PlayersMissingEntitlementsNetSerializable*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9CF0
    // private System.Action`2<System.String,System.String> getIsEntitledToLevelEvent
    // Size: 0x8
    // Offset: 0x38
    System::Action_2<::Il2CppString*, ::Il2CppString*>* getIsEntitledToLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D00
    // private System.Action`3<System.String,System.String,EntitlementsStatus> setIsEntitledToLevelEvent
    // Size: 0x8
    // Offset: 0x40
    System::Action_3<::Il2CppString*, ::Il2CppString*, GlobalNamespace::EntitlementsStatus>* setIsEntitledToLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_3<::Il2CppString*, ::Il2CppString*, GlobalNamespace::EntitlementsStatus>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D10
    // private System.Action`1<System.String> levelEntitlementStatusesInvalidatedEvent
    // Size: 0x8
    // Offset: 0x48
    System::Action_1<::Il2CppString*>* levelEntitlementStatusesInvalidatedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D20
    // private System.Action`2<System.String,System.String> selectedLevelPackEvent
    // Size: 0x8
    // Offset: 0x50
    System::Action_2<::Il2CppString*, ::Il2CppString*>* selectedLevelPackEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D30
    // private System.Action`2<System.String,BeatmapIdentifierNetSerializable> setSelectedBeatmapEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>* setSelectedBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D40
    // private System.Action`1<System.String> getSelectedBeatmapEvent
    // Size: 0x8
    // Offset: 0x60
    System::Action_1<::Il2CppString*>* getSelectedBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D50
    // private System.Action`2<System.String,BeatmapIdentifierNetSerializable> recommendBeatmapEvent
    // Size: 0x8
    // Offset: 0x68
    System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>* recommendBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D60
    // private System.Action`1<System.String> clearRecommendedBeatmapEvent
    // Size: 0x8
    // Offset: 0x70
    System::Action_1<::Il2CppString*>* clearRecommendedBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D70
    // private System.Action`1<System.String> getRecommendedBeatmapEvent
    // Size: 0x8
    // Offset: 0x78
    System::Action_1<::Il2CppString*>* getRecommendedBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D80
    // private System.Action`2<System.String,GameplayModifiers> setSelectGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x80
    System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>* setSelectGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9D90
    // private System.Action`1<System.String> getSelectedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x88
    System::Action_1<::Il2CppString*>* getSelectedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9DA0
    // private System.Action`2<System.String,GameplayModifiers> recommendGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x90
    System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>* recommendGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9DB0
    // private System.Action`1<System.String> clearRecommendedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x98
    System::Action_1<::Il2CppString*>* clearRecommendedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9DC0
    // private System.Action`1<System.String> getRecommendedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0xA0
    System::Action_1<::Il2CppString*>* getRecommendedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9DD0
    // private System.Action`1<System.String> getIsStartButtonEnabledEvent
    // Size: 0x8
    // Offset: 0xA8
    System::Action_1<::Il2CppString*>* getIsStartButtonEnabledEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9DE0
    // private System.Action`2<System.String,CannotStartGameReason> setIsStartButtonEnabledEvent
    // Size: 0x8
    // Offset: 0xB0
    System::Action_2<::Il2CppString*, GlobalNamespace::CannotStartGameReason>* setIsStartButtonEnabledEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::CannotStartGameReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9DF0
    // private System.Action`2<System.String,System.String> levelLoadErrorEvent
    // Size: 0x8
    // Offset: 0xB8
    System::Action_2<::Il2CppString*, ::Il2CppString*>* levelLoadErrorEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E00
    // private System.Action`2<System.String,System.String> levelLoadSuccessEvent
    // Size: 0x8
    // Offset: 0xC0
    System::Action_2<::Il2CppString*, ::Il2CppString*>* levelLoadSuccessEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E10
    // private System.Action`4<System.String,BeatmapIdentifierNetSerializable,GameplayModifiers,System.Single> startedLevelEvent
    // Size: 0x8
    // Offset: 0xC8
    System::Action_4<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*, GlobalNamespace::GameplayModifiers*, float>* startedLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_4<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*, GlobalNamespace::GameplayModifiers*, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E20
    // private System.Action`1<System.String> getStartedLevelEvent
    // Size: 0x8
    // Offset: 0xD0
    System::Action_1<::Il2CppString*>* getStartedLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E30
    // private System.Action`1<System.String> getMultiplayerGameStateEvent
    // Size: 0x8
    // Offset: 0xD8
    System::Action_1<::Il2CppString*>* getMultiplayerGameStateEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E40
    // private System.Action`2<System.String,MultiplayerGameState> setMultiplayerGameStateEvent
    // Size: 0x8
    // Offset: 0xE0
    System::Action_2<::Il2CppString*, GlobalNamespace::MultiplayerGameState>* setMultiplayerGameStateEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::MultiplayerGameState>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E50
    // private System.Action`1<System.String> cancelCountdownEvent
    // Size: 0x8
    // Offset: 0xE8
    System::Action_1<::Il2CppString*>* cancelCountdownEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E60
    // private System.Action`2<System.String,System.Single> setCountdownEndTimeEvent
    // Size: 0x8
    // Offset: 0xF0
    System::Action_2<::Il2CppString*, float>* setCountdownEndTimeEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E70
    // private System.Action`1<System.String> getCountdownEndTimeEvent
    // Size: 0x8
    // Offset: 0xF8
    System::Action_1<::Il2CppString*>* getCountdownEndTimeEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E80
    // private System.Action`1<System.String> cancelledLevelStartEvent
    // Size: 0x8
    // Offset: 0x100
    System::Action_1<::Il2CppString*>* cancelledLevelStartEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9E90
    // private System.Action`1<System.String> getIsReadyEvent
    // Size: 0x8
    // Offset: 0x108
    System::Action_1<::Il2CppString*>* getIsReadyEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9EA0
    // private System.Action`2<System.String,System.Boolean> setIsReadyEvent
    // Size: 0x8
    // Offset: 0x110
    System::Action_2<::Il2CppString*, bool>* setIsReadyEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, bool>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9EB0
    // private System.Action`2<System.String,System.Single> setStartGameTimeEvent
    // Size: 0x8
    // Offset: 0x118
    System::Action_2<::Il2CppString*, float>* setStartGameTimeEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9EC0
    // private System.Action`1<System.String> cancelStartGameTimeEvent
    // Size: 0x8
    // Offset: 0x120
    System::Action_1<::Il2CppString*>* cancelStartGameTimeEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9ED0
    // private System.Action`1<System.String> getIsInLobbyEvent
    // Size: 0x8
    // Offset: 0x128
    System::Action_1<::Il2CppString*>* getIsInLobbyEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9EE0
    // private System.Action`2<System.String,System.Boolean> setIsInLobbyEvent
    // Size: 0x8
    // Offset: 0x130
    System::Action_2<::Il2CppString*, bool>* setIsInLobbyEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, bool>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9EF0
    // private System.Action`1<System.String> getOwnedSongPacksEvent
    // Size: 0x8
    // Offset: 0x138
    System::Action_1<::Il2CppString*>* getOwnedSongPacksEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9F00
    // private System.Action`2<System.String,SongPackMask> setOwnedSongPacksEvent
    // Size: 0x8
    // Offset: 0x140
    System::Action_2<::Il2CppString*, GlobalNamespace::SongPackMask>* setOwnedSongPacksEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::SongPackMask>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xED9F10
    // private System.Action`2<System.String,System.String> requestedKickPlayerEvent
    // Size: 0x8
    // Offset: 0x148
    System::Action_2<::Il2CppString*, ::Il2CppString*>* requestedKickPlayerEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // Creating value type constructor for type: MenuRpcManager
    MenuRpcManager(GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager_ = {}, GlobalNamespace::RpcHandler_1<GlobalNamespace::MenuRpcManager::RpcType>* rpcHandler_ = {}, System::Action_1<::Il2CppString*>* getPlayersPermissionConfigurationEvent_ = {}, System::Action_2<::Il2CppString*, GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>* setPlayersPermissionConfigurationEvent_ = {}, System::Action_2<::Il2CppString*, GlobalNamespace::PlayersMissingEntitlementsNetSerializable*>* setPlayersMissingEntitlementsToLevelEvent_ = {}, System::Action_2<::Il2CppString*, ::Il2CppString*>* getIsEntitledToLevelEvent_ = {}, System::Action_3<::Il2CppString*, ::Il2CppString*, GlobalNamespace::EntitlementsStatus>* setIsEntitledToLevelEvent_ = {}, System::Action_1<::Il2CppString*>* levelEntitlementStatusesInvalidatedEvent_ = {}, System::Action_2<::Il2CppString*, ::Il2CppString*>* selectedLevelPackEvent_ = {}, System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>* setSelectedBeatmapEvent_ = {}, System::Action_1<::Il2CppString*>* getSelectedBeatmapEvent_ = {}, System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>* recommendBeatmapEvent_ = {}, System::Action_1<::Il2CppString*>* clearRecommendedBeatmapEvent_ = {}, System::Action_1<::Il2CppString*>* getRecommendedBeatmapEvent_ = {}, System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>* setSelectGameplayModifiersEvent_ = {}, System::Action_1<::Il2CppString*>* getSelectedGameplayModifiersEvent_ = {}, System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>* recommendGameplayModifiersEvent_ = {}, System::Action_1<::Il2CppString*>* clearRecommendedGameplayModifiersEvent_ = {}, System::Action_1<::Il2CppString*>* getRecommendedGameplayModifiersEvent_ = {}, System::Action_1<::Il2CppString*>* getIsStartButtonEnabledEvent_ = {}, System::Action_2<::Il2CppString*, GlobalNamespace::CannotStartGameReason>* setIsStartButtonEnabledEvent_ = {}, System::Action_2<::Il2CppString*, ::Il2CppString*>* levelLoadErrorEvent_ = {}, System::Action_2<::Il2CppString*, ::Il2CppString*>* levelLoadSuccessEvent_ = {}, System::Action_4<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*, GlobalNamespace::GameplayModifiers*, float>* startedLevelEvent_ = {}, System::Action_1<::Il2CppString*>* getStartedLevelEvent_ = {}, System::Action_1<::Il2CppString*>* getMultiplayerGameStateEvent_ = {}, System::Action_2<::Il2CppString*, GlobalNamespace::MultiplayerGameState>* setMultiplayerGameStateEvent_ = {}, System::Action_1<::Il2CppString*>* cancelCountdownEvent_ = {}, System::Action_2<::Il2CppString*, float>* setCountdownEndTimeEvent_ = {}, System::Action_1<::Il2CppString*>* getCountdownEndTimeEvent_ = {}, System::Action_1<::Il2CppString*>* cancelledLevelStartEvent_ = {}, System::Action_1<::Il2CppString*>* getIsReadyEvent_ = {}, System::Action_2<::Il2CppString*, bool>* setIsReadyEvent_ = {}, System::Action_2<::Il2CppString*, float>* setStartGameTimeEvent_ = {}, System::Action_1<::Il2CppString*>* cancelStartGameTimeEvent_ = {}, System::Action_1<::Il2CppString*>* getIsInLobbyEvent_ = {}, System::Action_2<::Il2CppString*, bool>* setIsInLobbyEvent_ = {}, System::Action_1<::Il2CppString*>* getOwnedSongPacksEvent_ = {}, System::Action_2<::Il2CppString*, GlobalNamespace::SongPackMask>* setOwnedSongPacksEvent_ = {}, System::Action_2<::Il2CppString*, ::Il2CppString*>* requestedKickPlayerEvent_ = {}) noexcept : multiplayerSessionManager{multiplayerSessionManager_}, rpcHandler{rpcHandler_}, getPlayersPermissionConfigurationEvent{getPlayersPermissionConfigurationEvent_}, setPlayersPermissionConfigurationEvent{setPlayersPermissionConfigurationEvent_}, setPlayersMissingEntitlementsToLevelEvent{setPlayersMissingEntitlementsToLevelEvent_}, getIsEntitledToLevelEvent{getIsEntitledToLevelEvent_}, setIsEntitledToLevelEvent{setIsEntitledToLevelEvent_}, levelEntitlementStatusesInvalidatedEvent{levelEntitlementStatusesInvalidatedEvent_}, selectedLevelPackEvent{selectedLevelPackEvent_}, setSelectedBeatmapEvent{setSelectedBeatmapEvent_}, getSelectedBeatmapEvent{getSelectedBeatmapEvent_}, recommendBeatmapEvent{recommendBeatmapEvent_}, clearRecommendedBeatmapEvent{clearRecommendedBeatmapEvent_}, getRecommendedBeatmapEvent{getRecommendedBeatmapEvent_}, setSelectGameplayModifiersEvent{setSelectGameplayModifiersEvent_}, getSelectedGameplayModifiersEvent{getSelectedGameplayModifiersEvent_}, recommendGameplayModifiersEvent{recommendGameplayModifiersEvent_}, clearRecommendedGameplayModifiersEvent{clearRecommendedGameplayModifiersEvent_}, getRecommendedGameplayModifiersEvent{getRecommendedGameplayModifiersEvent_}, getIsStartButtonEnabledEvent{getIsStartButtonEnabledEvent_}, setIsStartButtonEnabledEvent{setIsStartButtonEnabledEvent_}, levelLoadErrorEvent{levelLoadErrorEvent_}, levelLoadSuccessEvent{levelLoadSuccessEvent_}, startedLevelEvent{startedLevelEvent_}, getStartedLevelEvent{getStartedLevelEvent_}, getMultiplayerGameStateEvent{getMultiplayerGameStateEvent_}, setMultiplayerGameStateEvent{setMultiplayerGameStateEvent_}, cancelCountdownEvent{cancelCountdownEvent_}, setCountdownEndTimeEvent{setCountdownEndTimeEvent_}, getCountdownEndTimeEvent{getCountdownEndTimeEvent_}, cancelledLevelStartEvent{cancelledLevelStartEvent_}, getIsReadyEvent{getIsReadyEvent_}, setIsReadyEvent{setIsReadyEvent_}, setStartGameTimeEvent{setStartGameTimeEvent_}, cancelStartGameTimeEvent{cancelStartGameTimeEvent_}, getIsInLobbyEvent{getIsInLobbyEvent_}, setIsInLobbyEvent{setIsInLobbyEvent_}, getOwnedSongPacksEvent{getOwnedSongPacksEvent_}, setOwnedSongPacksEvent{setOwnedSongPacksEvent_}, requestedKickPlayerEvent{requestedKickPlayerEvent_} {}
    // Creating interface conversion operator: operator GlobalNamespace::IMenuRpcManager
    operator GlobalNamespace::IMenuRpcManager() noexcept {
      return *reinterpret_cast<GlobalNamespace::IMenuRpcManager*>(this);
    }
    // static field const value: static private System.String kMenuState
    static constexpr const char* kMenuState = "in_menu";
    // Get static field: static private System.String kMenuState
    static ::Il2CppString* _get_kMenuState();
    // Set static field: static private System.String kMenuState
    static void _set_kMenuState(::Il2CppString* value);
    // Get instance field reference: private readonly IMultiplayerSessionManager _multiplayerSessionManager
    GlobalNamespace::IMultiplayerSessionManager*& dyn__multiplayerSessionManager();
    // Get instance field reference: private readonly RpcHandler`1<MenuRpcManager/RpcType> _rpcHandler
    GlobalNamespace::RpcHandler_1<GlobalNamespace::MenuRpcManager::RpcType>*& dyn__rpcHandler();
    // Get instance field reference: private System.Action`1<System.String> getPlayersPermissionConfigurationEvent
    System::Action_1<::Il2CppString*>*& dyn_getPlayersPermissionConfigurationEvent();
    // Get instance field reference: private System.Action`2<System.String,PlayersLobbyPermissionConfigurationNetSerializable> setPlayersPermissionConfigurationEvent
    System::Action_2<::Il2CppString*, GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>*& dyn_setPlayersPermissionConfigurationEvent();
    // Get instance field reference: private System.Action`2<System.String,PlayersMissingEntitlementsNetSerializable> setPlayersMissingEntitlementsToLevelEvent
    System::Action_2<::Il2CppString*, GlobalNamespace::PlayersMissingEntitlementsNetSerializable*>*& dyn_setPlayersMissingEntitlementsToLevelEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> getIsEntitledToLevelEvent
    System::Action_2<::Il2CppString*, ::Il2CppString*>*& dyn_getIsEntitledToLevelEvent();
    // Get instance field reference: private System.Action`3<System.String,System.String,EntitlementsStatus> setIsEntitledToLevelEvent
    System::Action_3<::Il2CppString*, ::Il2CppString*, GlobalNamespace::EntitlementsStatus>*& dyn_setIsEntitledToLevelEvent();
    // Get instance field reference: private System.Action`1<System.String> levelEntitlementStatusesInvalidatedEvent
    System::Action_1<::Il2CppString*>*& dyn_levelEntitlementStatusesInvalidatedEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> selectedLevelPackEvent
    System::Action_2<::Il2CppString*, ::Il2CppString*>*& dyn_selectedLevelPackEvent();
    // Get instance field reference: private System.Action`2<System.String,BeatmapIdentifierNetSerializable> setSelectedBeatmapEvent
    System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>*& dyn_setSelectedBeatmapEvent();
    // Get instance field reference: private System.Action`1<System.String> getSelectedBeatmapEvent
    System::Action_1<::Il2CppString*>*& dyn_getSelectedBeatmapEvent();
    // Get instance field reference: private System.Action`2<System.String,BeatmapIdentifierNetSerializable> recommendBeatmapEvent
    System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>*& dyn_recommendBeatmapEvent();
    // Get instance field reference: private System.Action`1<System.String> clearRecommendedBeatmapEvent
    System::Action_1<::Il2CppString*>*& dyn_clearRecommendedBeatmapEvent();
    // Get instance field reference: private System.Action`1<System.String> getRecommendedBeatmapEvent
    System::Action_1<::Il2CppString*>*& dyn_getRecommendedBeatmapEvent();
    // Get instance field reference: private System.Action`2<System.String,GameplayModifiers> setSelectGameplayModifiersEvent
    System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>*& dyn_setSelectGameplayModifiersEvent();
    // Get instance field reference: private System.Action`1<System.String> getSelectedGameplayModifiersEvent
    System::Action_1<::Il2CppString*>*& dyn_getSelectedGameplayModifiersEvent();
    // Get instance field reference: private System.Action`2<System.String,GameplayModifiers> recommendGameplayModifiersEvent
    System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>*& dyn_recommendGameplayModifiersEvent();
    // Get instance field reference: private System.Action`1<System.String> clearRecommendedGameplayModifiersEvent
    System::Action_1<::Il2CppString*>*& dyn_clearRecommendedGameplayModifiersEvent();
    // Get instance field reference: private System.Action`1<System.String> getRecommendedGameplayModifiersEvent
    System::Action_1<::Il2CppString*>*& dyn_getRecommendedGameplayModifiersEvent();
    // Get instance field reference: private System.Action`1<System.String> getIsStartButtonEnabledEvent
    System::Action_1<::Il2CppString*>*& dyn_getIsStartButtonEnabledEvent();
    // Get instance field reference: private System.Action`2<System.String,CannotStartGameReason> setIsStartButtonEnabledEvent
    System::Action_2<::Il2CppString*, GlobalNamespace::CannotStartGameReason>*& dyn_setIsStartButtonEnabledEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> levelLoadErrorEvent
    System::Action_2<::Il2CppString*, ::Il2CppString*>*& dyn_levelLoadErrorEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> levelLoadSuccessEvent
    System::Action_2<::Il2CppString*, ::Il2CppString*>*& dyn_levelLoadSuccessEvent();
    // Get instance field reference: private System.Action`4<System.String,BeatmapIdentifierNetSerializable,GameplayModifiers,System.Single> startedLevelEvent
    System::Action_4<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*, GlobalNamespace::GameplayModifiers*, float>*& dyn_startedLevelEvent();
    // Get instance field reference: private System.Action`1<System.String> getStartedLevelEvent
    System::Action_1<::Il2CppString*>*& dyn_getStartedLevelEvent();
    // Get instance field reference: private System.Action`1<System.String> getMultiplayerGameStateEvent
    System::Action_1<::Il2CppString*>*& dyn_getMultiplayerGameStateEvent();
    // Get instance field reference: private System.Action`2<System.String,MultiplayerGameState> setMultiplayerGameStateEvent
    System::Action_2<::Il2CppString*, GlobalNamespace::MultiplayerGameState>*& dyn_setMultiplayerGameStateEvent();
    // Get instance field reference: private System.Action`1<System.String> cancelCountdownEvent
    System::Action_1<::Il2CppString*>*& dyn_cancelCountdownEvent();
    // Get instance field reference: private System.Action`2<System.String,System.Single> setCountdownEndTimeEvent
    System::Action_2<::Il2CppString*, float>*& dyn_setCountdownEndTimeEvent();
    // Get instance field reference: private System.Action`1<System.String> getCountdownEndTimeEvent
    System::Action_1<::Il2CppString*>*& dyn_getCountdownEndTimeEvent();
    // Get instance field reference: private System.Action`1<System.String> cancelledLevelStartEvent
    System::Action_1<::Il2CppString*>*& dyn_cancelledLevelStartEvent();
    // Get instance field reference: private System.Action`1<System.String> getIsReadyEvent
    System::Action_1<::Il2CppString*>*& dyn_getIsReadyEvent();
    // Get instance field reference: private System.Action`2<System.String,System.Boolean> setIsReadyEvent
    System::Action_2<::Il2CppString*, bool>*& dyn_setIsReadyEvent();
    // Get instance field reference: private System.Action`2<System.String,System.Single> setStartGameTimeEvent
    System::Action_2<::Il2CppString*, float>*& dyn_setStartGameTimeEvent();
    // Get instance field reference: private System.Action`1<System.String> cancelStartGameTimeEvent
    System::Action_1<::Il2CppString*>*& dyn_cancelStartGameTimeEvent();
    // Get instance field reference: private System.Action`1<System.String> getIsInLobbyEvent
    System::Action_1<::Il2CppString*>*& dyn_getIsInLobbyEvent();
    // Get instance field reference: private System.Action`2<System.String,System.Boolean> setIsInLobbyEvent
    System::Action_2<::Il2CppString*, bool>*& dyn_setIsInLobbyEvent();
    // Get instance field reference: private System.Action`1<System.String> getOwnedSongPacksEvent
    System::Action_1<::Il2CppString*>*& dyn_getOwnedSongPacksEvent();
    // Get instance field reference: private System.Action`2<System.String,SongPackMask> setOwnedSongPacksEvent
    System::Action_2<::Il2CppString*, GlobalNamespace::SongPackMask>*& dyn_setOwnedSongPacksEvent();
    // Get instance field reference: private System.Action`2<System.String,System.String> requestedKickPlayerEvent
    System::Action_2<::Il2CppString*, ::Il2CppString*>*& dyn_requestedKickPlayerEvent();
    // public IMultiplayerSessionManager get_multiplayerSessionManager()
    // Offset: 0x12E96B0
    GlobalNamespace::IMultiplayerSessionManager* get_multiplayerSessionManager();
    // public System.Boolean get_enabled()
    // Offset: 0x12E96B8
    bool get_enabled();
    // public System.Void set_enabled(System.Boolean value)
    // Offset: 0x12E977C
    void set_enabled(bool value);
    // public System.Boolean get_enabledForAllPlayers()
    // Offset: 0x12E9850
    bool get_enabledForAllPlayers();
    // public System.Single get_syncTime()
    // Offset: 0x12E9A3C
    float get_syncTime();
    // public System.Void .ctor(IMultiplayerSessionManager multiplayerSessionManager)
    // Offset: 0x12E9AF0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MenuRpcManager* New_ctor(GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MenuRpcManager::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MenuRpcManager*, creationType>(multiplayerSessionManager)));
    }
    // public System.Void Dispose()
    // Offset: 0x12EA728
    void Dispose();
    // public System.Boolean EnabledForPlayer(IConnectedPlayer player)
    // Offset: 0x12EA78C
    bool EnabledForPlayer(GlobalNamespace::IConnectedPlayer* player);
    // public System.Void add_getPlayersPermissionConfigurationEvent(System.Action`1<System.String> value)
    // Offset: 0x12EA84C
    void add_getPlayersPermissionConfigurationEvent(System::Action_1<::Il2CppString*>* value);
    // public System.Void remove_getPlayersPermissionConfigurationEvent(System.Action`1<System.String> value)
    // Offset: 0x12EA8F0
    void remove_getPlayersPermissionConfigurationEvent(System::Action_1<::Il2CppString*>* value);
    // public System.Void GetPlayersPermissionConfiguration()
    // Offset: 0x12EA994
    void GetPlayersPermissionConfiguration();
    // private System.Void InvokeGetPlayersPermissionConfiguration(System.String userId)
    // Offset: 0x12EA9EC
    void InvokeGetPlayersPermissionConfiguration(::Il2CppString* userId);
    // public System.Void add_setPlayersPermissionConfigurationEvent(System.Action`2<System.String,PlayersLobbyPermissionConfigurationNetSerializable> value)
    // Offset: 0x12EAA60
    void add_setPlayersPermissionConfigurationEvent(System::Action_2<::Il2CppString*, GlobalNamespace::PlayersLobbyPermissionConfigurationNetSerializable*>* value);
    // public System.Void remove_setPlayersPermissionConfigurationEvent(System.Action`2<System.String,PlayersLobbyPermissionConfigurationNetSerializable> value)
    // Offset: 0x12EAB04
