// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MenuLightsPresetSO
  class MenuLightsPresetSO;
  // Forward declaring type: LightWithIdManager
  class LightWithIdManager;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: MenuLightsManager
  class MenuLightsManager : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::MenuLightsManager::$Start$d__4
    class $Start$d__4;
    // private MenuLightsPresetSO _defaultPreset
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::MenuLightsPresetSO* defaultPreset;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MenuLightsPresetSO*) == 0x8);
    // private System.Single _smooth
    // Size: 0x4
    // Offset: 0x20
    float smooth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: smooth and: lightManager
    char __padding1[0x4] = {};
    // [InjectAttribute] Offset: 0xE1A7B8
    // private LightWithIdManager _lightManager
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::LightWithIdManager* lightManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LightWithIdManager*) == 0x8);
    // private MenuLightsPresetSO _preset
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::MenuLightsPresetSO* preset;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MenuLightsPresetSO*) == 0x8);
    // Creating value type constructor for type: MenuLightsManager
    MenuLightsManager(GlobalNamespace::MenuLightsPresetSO* defaultPreset_ = {}, float smooth_ = {}, GlobalNamespace::LightWithIdManager* lightManager_ = {}, GlobalNamespace::MenuLightsPresetSO* preset_ = {}) noexcept : defaultPreset{defaultPreset_}, smooth{smooth_}, lightManager{lightManager_}, preset{preset_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Collections.IEnumerator Start()
    // Offset: 0x2407730
    System::Collections::IEnumerator* Start();
    // protected System.Void Update()
    // Offset: 0x24077CC
    void Update();
    // private System.Boolean IsColorVeryCloseToColor(UnityEngine.Color color0, UnityEngine.Color color1)
    // Offset: 0x2407980
    bool IsColorVeryCloseToColor(UnityEngine::Color color0, UnityEngine::Color color1);
    // private System.Void SetColor(System.Int32 lightId, UnityEngine.Color color)
    // Offset: 0x2407AA8
    void SetColor(int lightId, UnityEngine::Color color);
    // private UnityEngine.Color CurrentColorForID(System.Int32 lightId)
    // Offset: 0x2407AC4
    UnityEngine::Color CurrentColorForID(int lightId);
    // private System.Boolean SetColorsFromPreset(MenuLightsPresetSO preset, System.Single interpolationFactor)
    // Offset: 0x240781C
    bool SetColorsFromPreset(GlobalNamespace::MenuLightsPresetSO* preset, float interpolationFactor);
    // private System.Void RefreshLightsDictForPreset(MenuLightsPresetSO preset)
    // Offset: 0x2407B1C
    void RefreshLightsDictForPreset(GlobalNamespace::MenuLightsPresetSO* preset);
    // public System.Void SetColorPreset(MenuLightsPresetSO preset, System.Boolean animated)
    // Offset: 0x240087C
    void SetColorPreset(GlobalNamespace::MenuLightsPresetSO* preset, bool animated);
    // public System.Void RefreshColors()
    // Offset: 0x2407BF4
    void RefreshColors();
    // public System.Void .ctor()
    // Offset: 0x2407C9C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MenuLightsManager* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MenuLightsManager::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MenuLightsManager*, creationType>()));
    }
  }; // MenuLightsManager
  #pragma pack(pop)
  static check_size<sizeof(MenuLightsManager), 48 + sizeof(GlobalNamespace::MenuLightsPresetSO*)> __GlobalNamespace_MenuLightsManagerSizeCheck;
  static_assert(sizeof(MenuLightsManager) == 0x38);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MenuLightsManager*, "", "MenuLightsManager");
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::Start
// Il2CppName: Start
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::Update
// Il2CppName: Update
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::IsColorVeryCloseToColor
// Il2CppName: IsColorVeryCloseToColor
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::SetColor
// Il2CppName: SetColor
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::CurrentColorForID
// Il2CppName: CurrentColorForID
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::SetColorsFromPreset
// Il2CppName: SetColorsFromPreset
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::RefreshLightsDictForPreset
// Il2CppName: RefreshLightsDictForPreset
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::SetColorPreset
// Il2CppName: SetColorPreset
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::RefreshColors
// Il2CppName: RefreshColors
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::MenuLightsManager::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
