// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: TubeBloomPrePassLight
  class TubeBloomPrePassLight;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MenuNeonLightsGenerator
  class MenuNeonLightsGenerator : public UnityEngine::MonoBehaviour {
    public:
    // private System.Boolean _generate
    // Offset: 0x18
    bool generate;
    // private System.Single _radius
    // Offset: 0x1C
    float radius;
    // private System.Single _angle
    // Offset: 0x20
    float angle;
    // private System.Int32 _numberOfElements
    // Offset: 0x24
    int numberOfElements;
    // private UnityEngine.AnimationCurve _intensityCurve
    // Offset: 0x28
    UnityEngine::AnimationCurve* intensityCurve;
    // private System.Single _intensityMultiplier
    // Offset: 0x30
    float intensityMultiplier;
    // private UnityEngine.AnimationCurve _lengthCurve
    // Offset: 0x38
    UnityEngine::AnimationCurve* lengthCurve;
    // private System.Single _lengthMultiplier
    // Offset: 0x40
    float lengthMultiplier;
    // private UnityEngine.AnimationCurve _widthCurve
    // Offset: 0x48
    UnityEngine::AnimationCurve* widthCurve;
    // private System.Single _widthMultiplier
    // Offset: 0x50
    float widthMultiplier;
    // private TubeBloomPrePassLight _neonLightPrefab
    // Offset: 0x58
    GlobalNamespace::TubeBloomPrePassLight* neonLightPrefab;
    // private UnityEngine.Vector3 _afterSpawnRotation
    // Offset: 0x60
    UnityEngine::Vector3 afterSpawnRotation;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void .ctor()
    // Offset: 0xED95E8
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MenuNeonLightsGenerator* New_ctor();
  }; // MenuNeonLightsGenerator
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MenuNeonLightsGenerator*, "", "MenuNeonLightsGenerator");
#pragma pack(pop)
