// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: ScenesTransitionSetupDataSO
#include "GlobalNamespace/ScenesTransitionSetupDataSO.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SceneInfo
  class SceneInfo;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: MenuScenesTransitionSetupDataSO
  class MenuScenesTransitionSetupDataSO : public GlobalNamespace::ScenesTransitionSetupDataSO {
    public:
    // private SceneInfo _menuSceneInfo
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::SceneInfo* menuSceneInfo;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SceneInfo*) == 0x8);
    // private SceneInfo _menuCoreSceneInfo
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::SceneInfo* menuCoreSceneInfo;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SceneInfo*) == 0x8);
    // private SceneInfo _menuEnvironmentSceneInfo
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::SceneInfo* menuEnvironmentSceneInfo;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SceneInfo*) == 0x8);
    // private SceneInfo _menuViewControllersSceneInfo
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::SceneInfo* menuViewControllersSceneInfo;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SceneInfo*) == 0x8);
    // Creating value type constructor for type: MenuScenesTransitionSetupDataSO
    MenuScenesTransitionSetupDataSO(GlobalNamespace::SceneInfo* menuSceneInfo_ = {}, GlobalNamespace::SceneInfo* menuCoreSceneInfo_ = {}, GlobalNamespace::SceneInfo* menuEnvironmentSceneInfo_ = {}, GlobalNamespace::SceneInfo* menuViewControllersSceneInfo_ = {}) noexcept : menuSceneInfo{menuSceneInfo_}, menuCoreSceneInfo{menuCoreSceneInfo_}, menuEnvironmentSceneInfo{menuEnvironmentSceneInfo_}, menuViewControllersSceneInfo{menuViewControllersSceneInfo_} {}
    // public System.Void Init()
    // Offset: 0x1023E40
    void Init();
    // public System.Void .ctor()
    // Offset: 0x1023F7C
    // Implemented from: ScenesTransitionSetupDataSO
    // Base method: System.Void ScenesTransitionSetupDataSO::.ctor()
    // Base method: System.Void PersistentScriptableObject::.ctor()
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MenuScenesTransitionSetupDataSO* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MenuScenesTransitionSetupDataSO::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MenuScenesTransitionSetupDataSO*, creationType>()));
    }
  }; // MenuScenesTransitionSetupDataSO
  #pragma pack(pop)
  static check_size<sizeof(MenuScenesTransitionSetupDataSO), 64 + sizeof(GlobalNamespace::SceneInfo*)> __GlobalNamespace_MenuScenesTransitionSetupDataSOSizeCheck;
  static_assert(sizeof(MenuScenesTransitionSetupDataSO) == 0x48);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MenuScenesTransitionSetupDataSO*, "", "MenuScenesTransitionSetupDataSO");
