// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: IMenuRpcManager
#include "GlobalNamespace/IMenuRpcManager.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Action_4;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: RpcHandler`1<TType>
  template<typename TType>
  class RpcHandler_1;
  // Forward declaring type: BeatmapIdentifierNetSerializable
  class BeatmapIdentifierNetSerializable;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x100
  #pragma pack(push, 1)
  // Autogenerated type: MenuRpcManager
  // [] Offset: FFFFFFFF
  class MenuRpcManager : public ::Il2CppObject/*, public System::IDisposable, public GlobalNamespace::IMenuRpcManager*/ {
    public:
    // Nested type: GlobalNamespace::MenuRpcManager::RpcType
    struct RpcType;
    // Nested type: GlobalNamespace::MenuRpcManager::GetIsEntitledToLevelRpc
    class GetIsEntitledToLevelRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetIsEntitledToLevelRpc
    class SetIsEntitledToLevelRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::InvalidateLevelEntitlementStatusesRpc
    class InvalidateLevelEntitlementStatusesRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SelectLevelPackRpc
    class SelectLevelPackRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SelectBeatmapRpc
    class SelectBeatmapRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::ClearSelectedBeatmapRpc
    class ClearSelectedBeatmapRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetSelectedBeatmapRpc
    class GetSelectedBeatmapRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SelectGameplayModifiersRpc
    class SelectGameplayModifiersRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::ClearSelectedGameplayModifiersRpc
    class ClearSelectedGameplayModifiersRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetSelectedGameplayModifiersRpc
    class GetSelectedGameplayModifiersRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::LevelLoadErrorRpc
    class LevelLoadErrorRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::LevelLoadSuccessRpc
    class LevelLoadSuccessRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::StartLevelRpc
    class StartLevelRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetStartedLevelRpc
    class GetStartedLevelRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetMultiplayerGameStateRpc
    class GetMultiplayerGameStateRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetMultiplayerGameStateRpc
    class SetMultiplayerGameStateRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::CancelCountdownRpc
    class CancelCountdownRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetCountdownEndTimeRpc
    class SetCountdownEndTimeRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetCountdownEndTimeRpc
    class GetCountdownEndTimeRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::CancelLevelStartRpc
    class CancelLevelStartRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetIsReadyRpc
    class GetIsReadyRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetIsReadyRpc
    class SetIsReadyRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetStartGameTimeRpc
    class SetStartGameTimeRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::CancelStartGameTimeRpc
    class CancelStartGameTimeRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetIsInLobbyRpc
    class GetIsInLobbyRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetIsInLobbyRpc
    class SetIsInLobbyRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::GetOwnedSongPacksRpc
    class GetOwnedSongPacksRpc;
    // Nested type: GlobalNamespace::MenuRpcManager::SetOwnedSongPacksRpc
    class SetOwnedSongPacksRpc;
    // Size: 0x1
    #pragma pack(push, 1)
    // Autogenerated type: MenuRpcManager/RpcType
    // [] Offset: FFFFFFFF
    struct RpcType/*, public System::Enum*/ {
      public:
      // public System.Byte value__
      // Size: 0x1
      // Offset: 0x0
      uint8_t value;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      // Creating value type constructor for type: RpcType
      constexpr RpcType(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public MenuRpcManager/RpcType GetIsEntitledToLevel
      static constexpr const uint8_t GetIsEntitledToLevel = 0u;
      // Get static field: static public MenuRpcManager/RpcType GetIsEntitledToLevel
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetIsEntitledToLevel();
      // Set static field: static public MenuRpcManager/RpcType GetIsEntitledToLevel
      static void _set_GetIsEntitledToLevel(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsEntitledToLevel
      static constexpr const uint8_t SetIsEntitledToLevel = 1u;
      // Get static field: static public MenuRpcManager/RpcType SetIsEntitledToLevel
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetIsEntitledToLevel();
      // Set static field: static public MenuRpcManager/RpcType SetIsEntitledToLevel
      static void _set_SetIsEntitledToLevel(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType InvalidateLevelEntitlementStatuses
      static constexpr const uint8_t InvalidateLevelEntitlementStatuses = 2u;
      // Get static field: static public MenuRpcManager/RpcType InvalidateLevelEntitlementStatuses
      static GlobalNamespace::MenuRpcManager::RpcType _get_InvalidateLevelEntitlementStatuses();
      // Set static field: static public MenuRpcManager/RpcType InvalidateLevelEntitlementStatuses
      static void _set_InvalidateLevelEntitlementStatuses(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SelectLevelPack
      static constexpr const uint8_t SelectLevelPack = 3u;
      // Get static field: static public MenuRpcManager/RpcType SelectLevelPack
      static GlobalNamespace::MenuRpcManager::RpcType _get_SelectLevelPack();
      // Set static field: static public MenuRpcManager/RpcType SelectLevelPack
      static void _set_SelectLevelPack(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SelectBeatmap
      static constexpr const uint8_t SelectBeatmap = 4u;
      // Get static field: static public MenuRpcManager/RpcType SelectBeatmap
      static GlobalNamespace::MenuRpcManager::RpcType _get_SelectBeatmap();
      // Set static field: static public MenuRpcManager/RpcType SelectBeatmap
      static void _set_SelectBeatmap(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType ClearSelectedBeatmap
      static constexpr const uint8_t ClearSelectedBeatmap = 5u;
      // Get static field: static public MenuRpcManager/RpcType ClearSelectedBeatmap
      static GlobalNamespace::MenuRpcManager::RpcType _get_ClearSelectedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType ClearSelectedBeatmap
      static void _set_ClearSelectedBeatmap(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetSelectedBeatmap
      static constexpr const uint8_t GetSelectedBeatmap = 6u;
      // Get static field: static public MenuRpcManager/RpcType GetSelectedBeatmap
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetSelectedBeatmap();
      // Set static field: static public MenuRpcManager/RpcType GetSelectedBeatmap
      static void _set_GetSelectedBeatmap(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SelectGameplayModifiers
      static constexpr const uint8_t SelectGameplayModifiers = 7u;
      // Get static field: static public MenuRpcManager/RpcType SelectGameplayModifiers
      static GlobalNamespace::MenuRpcManager::RpcType _get_SelectGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType SelectGameplayModifiers
      static void _set_SelectGameplayModifiers(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType ClearSelectedGameplayModifiers
      static constexpr const uint8_t ClearSelectedGameplayModifiers = 8u;
      // Get static field: static public MenuRpcManager/RpcType ClearSelectedGameplayModifiers
      static GlobalNamespace::MenuRpcManager::RpcType _get_ClearSelectedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType ClearSelectedGameplayModifiers
      static void _set_ClearSelectedGameplayModifiers(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetSelectedGameplayModifiers
      static constexpr const uint8_t GetSelectedGameplayModifiers = 9u;
      // Get static field: static public MenuRpcManager/RpcType GetSelectedGameplayModifiers
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetSelectedGameplayModifiers();
      // Set static field: static public MenuRpcManager/RpcType GetSelectedGameplayModifiers
      static void _set_GetSelectedGameplayModifiers(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType LevelLoadError
      static constexpr const uint8_t LevelLoadError = 10u;
      // Get static field: static public MenuRpcManager/RpcType LevelLoadError
      static GlobalNamespace::MenuRpcManager::RpcType _get_LevelLoadError();
      // Set static field: static public MenuRpcManager/RpcType LevelLoadError
      static void _set_LevelLoadError(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType LevelLoadSuccess
      static constexpr const uint8_t LevelLoadSuccess = 11u;
      // Get static field: static public MenuRpcManager/RpcType LevelLoadSuccess
      static GlobalNamespace::MenuRpcManager::RpcType _get_LevelLoadSuccess();
      // Set static field: static public MenuRpcManager/RpcType LevelLoadSuccess
      static void _set_LevelLoadSuccess(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType StartLevel
      static constexpr const uint8_t StartLevel = 12u;
      // Get static field: static public MenuRpcManager/RpcType StartLevel
      static GlobalNamespace::MenuRpcManager::RpcType _get_StartLevel();
      // Set static field: static public MenuRpcManager/RpcType StartLevel
      static void _set_StartLevel(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetStartedLevel
      static constexpr const uint8_t GetStartedLevel = 13u;
      // Get static field: static public MenuRpcManager/RpcType GetStartedLevel
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetStartedLevel();
      // Set static field: static public MenuRpcManager/RpcType GetStartedLevel
      static void _set_GetStartedLevel(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType CancelLevelStart
      static constexpr const uint8_t CancelLevelStart = 14u;
      // Get static field: static public MenuRpcManager/RpcType CancelLevelStart
      static GlobalNamespace::MenuRpcManager::RpcType _get_CancelLevelStart();
      // Set static field: static public MenuRpcManager/RpcType CancelLevelStart
      static void _set_CancelLevelStart(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetMultiplayerGameState
      static constexpr const uint8_t GetMultiplayerGameState = 15u;
      // Get static field: static public MenuRpcManager/RpcType GetMultiplayerGameState
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetMultiplayerGameState();
      // Set static field: static public MenuRpcManager/RpcType GetMultiplayerGameState
      static void _set_GetMultiplayerGameState(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetMultiplayerGameState
      static constexpr const uint8_t SetMultiplayerGameState = 16u;
      // Get static field: static public MenuRpcManager/RpcType SetMultiplayerGameState
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetMultiplayerGameState();
      // Set static field: static public MenuRpcManager/RpcType SetMultiplayerGameState
      static void _set_SetMultiplayerGameState(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsReady
      static constexpr const uint8_t GetIsReady = 17u;
      // Get static field: static public MenuRpcManager/RpcType GetIsReady
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetIsReady();
      // Set static field: static public MenuRpcManager/RpcType GetIsReady
      static void _set_GetIsReady(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsReady
      static constexpr const uint8_t SetIsReady = 18u;
      // Get static field: static public MenuRpcManager/RpcType SetIsReady
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetIsReady();
      // Set static field: static public MenuRpcManager/RpcType SetIsReady
      static void _set_SetIsReady(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetStartGameTime
      static constexpr const uint8_t SetStartGameTime = 19u;
      // Get static field: static public MenuRpcManager/RpcType SetStartGameTime
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetStartGameTime();
      // Set static field: static public MenuRpcManager/RpcType SetStartGameTime
      static void _set_SetStartGameTime(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType CancelStartGameTime
      static constexpr const uint8_t CancelStartGameTime = 20u;
      // Get static field: static public MenuRpcManager/RpcType CancelStartGameTime
      static GlobalNamespace::MenuRpcManager::RpcType _get_CancelStartGameTime();
      // Set static field: static public MenuRpcManager/RpcType CancelStartGameTime
      static void _set_CancelStartGameTime(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetIsInLobby
      static constexpr const uint8_t GetIsInLobby = 21u;
      // Get static field: static public MenuRpcManager/RpcType GetIsInLobby
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetIsInLobby();
      // Set static field: static public MenuRpcManager/RpcType GetIsInLobby
      static void _set_GetIsInLobby(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetIsInLobby
      static constexpr const uint8_t SetIsInLobby = 22u;
      // Get static field: static public MenuRpcManager/RpcType SetIsInLobby
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetIsInLobby();
      // Set static field: static public MenuRpcManager/RpcType SetIsInLobby
      static void _set_SetIsInLobby(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetCountdownEndTime
      static constexpr const uint8_t GetCountdownEndTime = 23u;
      // Get static field: static public MenuRpcManager/RpcType GetCountdownEndTime
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetCountdownEndTime();
      // Set static field: static public MenuRpcManager/RpcType GetCountdownEndTime
      static void _set_GetCountdownEndTime(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetCountdownEndTime
      static constexpr const uint8_t SetCountdownEndTime = 24u;
      // Get static field: static public MenuRpcManager/RpcType SetCountdownEndTime
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetCountdownEndTime();
      // Set static field: static public MenuRpcManager/RpcType SetCountdownEndTime
      static void _set_SetCountdownEndTime(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType CancelCountdown
      static constexpr const uint8_t CancelCountdown = 25u;
      // Get static field: static public MenuRpcManager/RpcType CancelCountdown
      static GlobalNamespace::MenuRpcManager::RpcType _get_CancelCountdown();
      // Set static field: static public MenuRpcManager/RpcType CancelCountdown
      static void _set_CancelCountdown(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType GetOwnedSongPacks
      static constexpr const uint8_t GetOwnedSongPacks = 26u;
      // Get static field: static public MenuRpcManager/RpcType GetOwnedSongPacks
      static GlobalNamespace::MenuRpcManager::RpcType _get_GetOwnedSongPacks();
      // Set static field: static public MenuRpcManager/RpcType GetOwnedSongPacks
      static void _set_GetOwnedSongPacks(GlobalNamespace::MenuRpcManager::RpcType value);
      // static field const value: static public MenuRpcManager/RpcType SetOwnedSongPacks
      static constexpr const uint8_t SetOwnedSongPacks = 27u;
      // Get static field: static public MenuRpcManager/RpcType SetOwnedSongPacks
      static GlobalNamespace::MenuRpcManager::RpcType _get_SetOwnedSongPacks();
      // Set static field: static public MenuRpcManager/RpcType SetOwnedSongPacks
      static void _set_SetOwnedSongPacks(GlobalNamespace::MenuRpcManager::RpcType value);
    }; // MenuRpcManager/RpcType
    #pragma pack(pop)
    static check_size<sizeof(MenuRpcManager::RpcType), 0 + sizeof(uint8_t)> __GlobalNamespace_MenuRpcManager_RpcTypeSizeCheck;
    static_assert(sizeof(MenuRpcManager::RpcType) == 0x1);
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Size: 0x8
    // Offset: 0x10
    GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IMultiplayerSessionManager*) == 0x8);
    // private readonly RpcHandler`1<MenuRpcManager/RpcType> _rpcHandler
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::RpcHandler_1<GlobalNamespace::MenuRpcManager::RpcType>* rpcHandler;
    // Field size check
    static_assert(sizeof(GlobalNamespace::RpcHandler_1<GlobalNamespace::MenuRpcManager::RpcType>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BD5C
    // private System.Action`2<System.String,System.String> getIsEntitledToLevelEvent
    // Size: 0x8
    // Offset: 0x20
    System::Action_2<::Il2CppString*, ::Il2CppString*>* getIsEntitledToLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BD6C
    // private System.Action`3<System.String,System.String,EntitlementsStatus> setIsEntitledToLevelEvent
    // Size: 0x8
    // Offset: 0x28
    System::Action_3<::Il2CppString*, ::Il2CppString*, GlobalNamespace::EntitlementsStatus>* setIsEntitledToLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_3<::Il2CppString*, ::Il2CppString*, GlobalNamespace::EntitlementsStatus>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BD7C
    // private System.Action`1<System.String> levelEntitlementStatusesInvalidatedEvent
    // Size: 0x8
    // Offset: 0x30
    System::Action_1<::Il2CppString*>* levelEntitlementStatusesInvalidatedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BD8C
    // private System.Action`2<System.String,System.String> selectedLevelPackEvent
    // Size: 0x8
    // Offset: 0x38
    System::Action_2<::Il2CppString*, ::Il2CppString*>* selectedLevelPackEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BD9C
    // private System.Action`2<System.String,BeatmapIdentifierNetSerializable> selectedBeatmapEvent
    // Size: 0x8
    // Offset: 0x40
    System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>* selectedBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BDAC
    // private System.Action`1<System.String> clearSelectedBeatmapEvent
    // Size: 0x8
    // Offset: 0x48
    System::Action_1<::Il2CppString*>* clearSelectedBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BDBC
    // private System.Action`1<System.String> getSelectedBeatmapEvent
    // Size: 0x8
    // Offset: 0x50
    System::Action_1<::Il2CppString*>* getSelectedBeatmapEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BDCC
    // private System.Action`2<System.String,GameplayModifiers> selectedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>* selectedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::GameplayModifiers*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BDDC
    // private System.Action`1<System.String> clearSelectedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x60
    System::Action_1<::Il2CppString*>* clearSelectedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BDEC
    // private System.Action`1<System.String> getSelectedGameplayModifiersEvent
    // Size: 0x8
    // Offset: 0x68
    System::Action_1<::Il2CppString*>* getSelectedGameplayModifiersEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BDFC
    // private System.Action`2<System.String,System.String> levelLoadErrorEvent
    // Size: 0x8
    // Offset: 0x70
    System::Action_2<::Il2CppString*, ::Il2CppString*>* levelLoadErrorEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE0C
    // private System.Action`2<System.String,System.String> levelLoadSuccessEvent
    // Size: 0x8
    // Offset: 0x78
    System::Action_2<::Il2CppString*, ::Il2CppString*>* levelLoadSuccessEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE1C
    // private System.Action`4<System.String,BeatmapIdentifierNetSerializable,GameplayModifiers,System.Single> startedLevelEvent
    // Size: 0x8
    // Offset: 0x80
    System::Action_4<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*, GlobalNamespace::GameplayModifiers*, float>* startedLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_4<::Il2CppString*, GlobalNamespace::BeatmapIdentifierNetSerializable*, GlobalNamespace::GameplayModifiers*, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE2C
    // private System.Action`1<System.String> getStartedLevelEvent
    // Size: 0x8
    // Offset: 0x88
    System::Action_1<::Il2CppString*>* getStartedLevelEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE3C
    // private System.Action`1<System.String> getMultiplayerGameStateEvent
    // Size: 0x8
    // Offset: 0x90
    System::Action_1<::Il2CppString*>* getMultiplayerGameStateEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE4C
    // private System.Action`2<System.String,MultiplayerGameState> setMultiplayerGameStateEvent
    // Size: 0x8
    // Offset: 0x98
    System::Action_2<::Il2CppString*, GlobalNamespace::MultiplayerGameState>* setMultiplayerGameStateEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::MultiplayerGameState>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE5C
    // private System.Action`1<System.String> cancelCountdownEvent
    // Size: 0x8
    // Offset: 0xA0
    System::Action_1<::Il2CppString*>* cancelCountdownEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE6C
    // private System.Action`2<System.String,System.Single> setCountdownEndTimeEvent
    // Size: 0x8
    // Offset: 0xA8
    System::Action_2<::Il2CppString*, float>* setCountdownEndTimeEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE7C
    // private System.Action`1<System.String> getCountdownEndTimeEvent
    // Size: 0x8
    // Offset: 0xB0
    System::Action_1<::Il2CppString*>* getCountdownEndTimeEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE8C
    // private System.Action`1<System.String> cancelledLevelStartEvent
    // Size: 0x8
    // Offset: 0xB8
    System::Action_1<::Il2CppString*>* cancelledLevelStartEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BE9C
    // private System.Action`1<System.String> getIsReadyEvent
    // Size: 0x8
    // Offset: 0xC0
    System::Action_1<::Il2CppString*>* getIsReadyEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BEAC
    // private System.Action`2<System.String,System.Boolean> setIsReadyEvent
    // Size: 0x8
    // Offset: 0xC8
    System::Action_2<::Il2CppString*, bool>* setIsReadyEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, bool>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BEBC
    // private System.Action`2<System.String,System.Single> setStartGameTimeEvent
    // Size: 0x8
    // Offset: 0xD0
    System::Action_2<::Il2CppString*, float>* setStartGameTimeEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BECC
    // private System.Action`1<System.String> cancelStartGameTimeEvent
    // Size: 0x8
    // Offset: 0xD8
    System::Action_1<::Il2CppString*>* cancelStartGameTimeEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BEDC
    // private System.Action`1<System.String> getIsInLobbyEvent
    // Size: 0x8
    // Offset: 0xE0
    System::Action_1<::Il2CppString*>* getIsInLobbyEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BEEC
    // private System.Action`2<System.String,System.Boolean> setIsInLobbyEvent
    // Size: 0x8
    // Offset: 0xE8
    System::Action_2<::Il2CppString*, bool>* setIsInLobbyEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, bool>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BEFC
    // private System.Action`1<System.String> getOwnedSongPacksEvent
    // Size: 0x8
    // Offset: 0xF0
    System::Action_1<::Il2CppString*>* getOwnedSongPacksEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD1BF0C
    // private System.Action`2<System.String,SongPackMask> setOwnedSongPacksEvent
    // Size: 0x8
    // Offset: 0xF8
    System::Action_2<::Il2CppString*, GlobalNamespace::SongPackMask>* setOwnedSongPacksEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<::Il2CppString*, GlobalNamespace::SongPackMask>*) == 0x8);
    // Creating value type constructor for type: MenuRpcManager
