// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ResultObjectiveListItemsList
  class ResultObjectiveListItemsList;
  // Forward declaring type: FireworksController
  class FireworksController;
  // Forward declaring type: SongPreviewPlayer
  class SongPreviewPlayer;
  // Forward declaring type: MissionNode
  class MissionNode;
  // Forward declaring type: MissionCompletionResults
  class MissionCompletionResults;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Sprite
  class Sprite;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MissionResultsViewController
  class MissionResultsViewController : public HMUI::ViewController {
    public:
    // Nested type: GlobalNamespace::MissionResultsViewController::$StartFireworksAfterDelay$d__28
    class $StartFireworksAfterDelay$d__28;
    // Nested type: GlobalNamespace::MissionResultsViewController::$$c__DisplayClass29_0
    class $$c__DisplayClass29_0;
    // private UnityEngine.GameObject _failedBannerGo
    // Offset: 0x70
    UnityEngine::GameObject* failedBannerGo;
    // private UnityEngine.GameObject _clearedBannerGo
    // Offset: 0x78
    UnityEngine::GameObject* clearedBannerGo;
    // private TMPro.TextMeshProUGUI _missionNameText
    // Offset: 0x80
    TMPro::TextMeshProUGUI* missionNameText;
    // private TMPro.TextMeshProUGUI _songNameText
    // Offset: 0x88
    TMPro::TextMeshProUGUI* songNameText;
    // private UnityEngine.Sprite _successIcon
    // Offset: 0x90
    UnityEngine::Sprite* successIcon;
    // private UnityEngine.Sprite _successIconGlow
    // Offset: 0x98
    UnityEngine::Sprite* successIconGlow;
    // private UnityEngine.Color _successColor
    // Offset: 0xA0
    UnityEngine::Color successColor;
    // private UnityEngine.Sprite _failIcon
    // Offset: 0xB0
    UnityEngine::Sprite* failIcon;
    // private UnityEngine.Sprite _failIconGlow
    // Offset: 0xB8
    UnityEngine::Sprite* failIconGlow;
    // private UnityEngine.Color _failColor
    // Offset: 0xC0
    UnityEngine::Color failColor;
    // private ResultObjectiveListItemsList _resultObjectiveListItemList
    // Offset: 0xD0
    GlobalNamespace::ResultObjectiveListItemsList* resultObjectiveListItemList;
    // private UnityEngine.UI.Button _continueButton
    // Offset: 0xD8
    UnityEngine::UI::Button* continueButton;
    // private UnityEngine.UI.Button _retryButton
    // Offset: 0xE0
    UnityEngine::UI::Button* retryButton;
    // private UnityEngine.AudioClip _levelClearedAudioClip
    // Offset: 0xE8
    UnityEngine::AudioClip* levelClearedAudioClip;
    // private readonly FireworksController _fireworksController
    // Offset: 0xF0
    GlobalNamespace::FireworksController* fireworksController;
    // private readonly SongPreviewPlayer _songPreviewPlayer
    // Offset: 0xF8
    GlobalNamespace::SongPreviewPlayer* songPreviewPlayer;
    // private System.Action`1<MissionResultsViewController> continueButtonPressedEvent
    // Offset: 0x100
    System::Action_1<GlobalNamespace::MissionResultsViewController*>* continueButtonPressedEvent;
    // private System.Action`1<MissionResultsViewController> retryButtonPressedEvent
    // Offset: 0x108
    System::Action_1<GlobalNamespace::MissionResultsViewController*>* retryButtonPressedEvent;
    // private MissionNode _missionNode
    // Offset: 0x110
    GlobalNamespace::MissionNode* missionNode;
    // private MissionCompletionResults _missionCompletionResults
    // Offset: 0x118
    GlobalNamespace::MissionCompletionResults* missionCompletionResults;
    // private UnityEngine.Coroutine _startFireworksAfterDelayCoroutine
    // Offset: 0x120
    UnityEngine::Coroutine* startFireworksAfterDelayCoroutine;
    // public System.Void add_continueButtonPressedEvent(System.Action`1<MissionResultsViewController> value)
    // Offset: 0x1FCDD08
    void add_continueButtonPressedEvent(System::Action_1<GlobalNamespace::MissionResultsViewController*>* value);
    // public System.Void remove_continueButtonPressedEvent(System.Action`1<MissionResultsViewController> value)
    // Offset: 0x1FCDDB0
    void remove_continueButtonPressedEvent(System::Action_1<GlobalNamespace::MissionResultsViewController*>* value);
    // public System.Void add_retryButtonPressedEvent(System.Action`1<MissionResultsViewController> value)
    // Offset: 0x1FCDE58
    void add_retryButtonPressedEvent(System::Action_1<GlobalNamespace::MissionResultsViewController*>* value);
    // public System.Void remove_retryButtonPressedEvent(System.Action`1<MissionResultsViewController> value)
    // Offset: 0x1FCDF00
    void remove_retryButtonPressedEvent(System::Action_1<GlobalNamespace::MissionResultsViewController*>* value);
    // public System.Void Init(MissionNode missionNode, MissionCompletionResults missionCompletionResults)
    // Offset: 0x1FCDFA8
    void Init(GlobalNamespace::MissionNode* missionNode, GlobalNamespace::MissionCompletionResults* missionCompletionResults);
    // private System.Collections.IEnumerator StartFireworksAfterDelay(System.Single delay)
    // Offset: 0x1FCE3C8
    System::Collections::IEnumerator* StartFireworksAfterDelay(float delay);
    // private System.Void SetDataToUI()
    // Offset: 0x1FCE164
    void SetDataToUI();
    // private System.Void ContinueButtonPressed()
    // Offset: 0x1FCE4E0
    void ContinueButtonPressed();
    // private System.Void RetryButtonPressed()
    // Offset: 0x1FCE544
    void RetryButtonPressed();
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0x1FCDFE0
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // protected override System.Void DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    // Offset: 0x1FCE454
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    void DidDeactivate(bool removedFromHierarchy, bool screenSystemDisabling);
    // public System.Void .ctor()
    // Offset: 0x1FCE5A8
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MissionResultsViewController* New_ctor();
  }; // MissionResultsViewController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MissionResultsViewController*, "", "MissionResultsViewController");
#pragma pack(pop)
