// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Animator
  class Animator;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MissionNodeVisualController
  class MissionNodeVisualController;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MissionNodeConnection
  class MissionNodeConnection : public UnityEngine::MonoBehaviour {
    public:
    // private System.Single _separator
    // Offset: 0x18
    float separator;
    // private System.Single _width
    // Offset: 0x1C
    float width;
    // private UnityEngine.RectTransform _rectTransform
    // Offset: 0x20
    UnityEngine::RectTransform* rectTransform;
    // private UnityEngine.UI.Image _image
    // Offset: 0x28
    UnityEngine::UI::Image* image;
    // private MissionNodeVisualController _parentMissionNode
    // Offset: 0x30
    GlobalNamespace::MissionNodeVisualController* parentMissionNode;
    // private MissionNodeVisualController _childMissionNode
    // Offset: 0x38
    GlobalNamespace::MissionNodeVisualController* childMissionNode;
    // private UnityEngine.Animator _animator
    // Offset: 0x40
    UnityEngine::Animator* animator;
    // private UnityEngine.Vector2 _parentMissionNodePosition
    // Offset: 0x48
    UnityEngine::Vector2 parentMissionNodePosition;
    // private UnityEngine.Vector2 _childMissionNodePosition
    // Offset: 0x50
    UnityEngine::Vector2 childMissionNodePosition;
    // private System.Boolean _isActive
    // Offset: 0x58
    bool isActive;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public MissionNodeVisualController get_parentMissionNode()
    // Offset: 0xEE0CF8
    GlobalNamespace::MissionNodeVisualController* get_parentMissionNode();
    // public MissionNodeVisualController get_childMissionNode()
    // Offset: 0xEE0D00
    GlobalNamespace::MissionNodeVisualController* get_childMissionNode();
    // public System.Boolean get_isActive()
    // Offset: 0xEE0D08
    bool get_isActive();
    // public System.Void Setup(MissionNodeVisualController parentMissionNode, MissionNodeVisualController childMissionNode)
    // Offset: 0xEDC95C
    void Setup(GlobalNamespace::MissionNodeVisualController* parentMissionNode, GlobalNamespace::MissionNodeVisualController* childMissionNode);
    // public System.Void UpdateConnectionRectTransform()
    // Offset: 0xEE0D10
    void UpdateConnectionRectTransform();
    // public System.Void SetActive(System.Boolean animated)
    // Offset: 0xEE0884
    void SetActive(bool animated);
    // public System.Void MissionConnectionEnabledDidFinish()
    // Offset: 0xEE1000
    void MissionConnectionEnabledDidFinish();
    // public System.Void .ctor()
    // Offset: 0xEE1020
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MissionNodeConnection* New_ctor();
  }; // MissionNodeConnection
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MissionNodeConnection*, "", "MissionNodeConnection");
#pragma pack(pop)
