// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameplayModifiersModelSO
  class GameplayModifiersModelSO;
  // Forward declaring type: LevelBar
  class LevelBar;
  // Forward declaring type: ObjectiveListItemsList
  class ObjectiveListItemsList;
  // Forward declaring type: GameplayModifierInfoListItemsList
  class GameplayModifierInfoListItemsList;
  // Forward declaring type: MissionNode
  class MissionNode;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MissionLevelDetailViewController
  class MissionLevelDetailViewController : public HMUI::ViewController {
    public:
    // Nested type: GlobalNamespace::MissionLevelDetailViewController::$$c__DisplayClass14_0
    class $$c__DisplayClass14_0;
    // private GameplayModifiersModelSO _gameplayModifiersModel
    // Offset: 0x70
    GlobalNamespace::GameplayModifiersModelSO* gameplayModifiersModel;
    // private UnityEngine.UI.Button _playButton
    // Offset: 0x78
    UnityEngine::UI::Button* playButton;
    // private LevelBar _levelBar
    // Offset: 0x80
    GlobalNamespace::LevelBar* levelBar;
    // private ObjectiveListItemsList _objectiveListItems
    // Offset: 0x88
    GlobalNamespace::ObjectiveListItemsList* objectiveListItems;
    // private GameplayModifierInfoListItemsList _gameplayModifierInfoListItemsList
    // Offset: 0x90
    GlobalNamespace::GameplayModifierInfoListItemsList* gameplayModifierInfoListItemsList;
    // private UnityEngine.GameObject _modifiersPanelGO
    // Offset: 0x98
    UnityEngine::GameObject* modifiersPanelGO;
    // private System.Action`1<MissionLevelDetailViewController> didPressPlayButtonEvent
    // Offset: 0xA0
    System::Action_1<GlobalNamespace::MissionLevelDetailViewController*>* didPressPlayButtonEvent;
    // private MissionNode _missionNode
    // Offset: 0xA8
    GlobalNamespace::MissionNode* missionNode;
    // public System.Void add_didPressPlayButtonEvent(System.Action`1<MissionLevelDetailViewController> value)
    // Offset: 0x10184A0
    void add_didPressPlayButtonEvent(System::Action_1<GlobalNamespace::MissionLevelDetailViewController*>* value);
    // public System.Void remove_didPressPlayButtonEvent(System.Action`1<MissionLevelDetailViewController> value)
    // Offset: 0x1018544
    void remove_didPressPlayButtonEvent(System::Action_1<GlobalNamespace::MissionLevelDetailViewController*>* value);
    // public MissionNode get_missionNode()
    // Offset: 0x10185E8
    GlobalNamespace::MissionNode* get_missionNode();
    // public System.Void Setup(MissionNode missionNode)
    // Offset: 0x10185F0
    void Setup(GlobalNamespace::MissionNode* missionNode);
    // public System.Void RefreshContent()
    // Offset: 0x1018634
    void RefreshContent();
    // private System.Void PlayButtonPressed()
    // Offset: 0x10188A4
    void PlayButtonPressed();
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0x10187F8
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // public System.Void .ctor()
    // Offset: 0x1018908
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MissionLevelDetailViewController* New_ctor();
  }; // MissionLevelDetailViewController
  check_size<sizeof(MissionLevelDetailViewController), 168 + sizeof(void*) + ((168 + sizeof(void*)) % 8 != 0 ? (8 - (168 + sizeof(void*)) % 8) : 0)> __GlobalNamespace_MissionLevelDetailViewControllerSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MissionLevelDetailViewController*, "", "MissionLevelDetailViewController");
#pragma pack(pop)
