// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ResultObjectiveListItemsList
  class ResultObjectiveListItemsList;
  // Forward declaring type: FireworksController
  class FireworksController;
  // Forward declaring type: SongPreviewPlayer
  class SongPreviewPlayer;
  // Forward declaring type: MissionNode
  class MissionNode;
  // Forward declaring type: MissionCompletionResults
  class MissionCompletionResults;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MissionResultsViewController
  class MissionResultsViewController : public HMUI::ViewController {
    public:
    // Nested type: GlobalNamespace::MissionResultsViewController::$StartFireworksAfterDelay$d__27
    class $StartFireworksAfterDelay$d__27;
    // Nested type: GlobalNamespace::MissionResultsViewController::$$c__DisplayClass28_0
    class $$c__DisplayClass28_0;
    // private TMPro.TextMeshProUGUI _resultText
    // Offset: 0x68
    TMPro::TextMeshProUGUI* resultText;
    // private TMPro.TextMeshProUGUI _missionNameText
    // Offset: 0x70
    TMPro::TextMeshProUGUI* missionNameText;
    // private TMPro.TextMeshProUGUI _songNameText
    // Offset: 0x78
    TMPro::TextMeshProUGUI* songNameText;
    // private UnityEngine.Sprite _successIcon
    // Offset: 0x80
    UnityEngine::Sprite* successIcon;
    // private UnityEngine.Sprite _successIconGlow
    // Offset: 0x88
    UnityEngine::Sprite* successIconGlow;
    // private UnityEngine.Color _successColor
    // Offset: 0x90
    UnityEngine::Color successColor;
    // private UnityEngine.Sprite _failIcon
    // Offset: 0xA0
    UnityEngine::Sprite* failIcon;
    // private UnityEngine.Sprite _failIconGlow
    // Offset: 0xA8
    UnityEngine::Sprite* failIconGlow;
    // private UnityEngine.Color _failColor
    // Offset: 0xB0
    UnityEngine::Color failColor;
    // private ResultObjectiveListItemsList _resultObjectiveListItemList
    // Offset: 0xC0
    GlobalNamespace::ResultObjectiveListItemsList* resultObjectiveListItemList;
    // private UnityEngine.UI.Button _continueButton
    // Offset: 0xC8
    UnityEngine::UI::Button* continueButton;
    // private UnityEngine.UI.Button _retryButton
    // Offset: 0xD0
    UnityEngine::UI::Button* retryButton;
    // private UnityEngine.AudioClip _levelClearedAudioClip
    // Offset: 0xD8
    UnityEngine::AudioClip* levelClearedAudioClip;
    // private FireworksController _fireworksController
    // Offset: 0xE0
    GlobalNamespace::FireworksController* fireworksController;
    // private SongPreviewPlayer _songPreviewPlayer
    // Offset: 0xE8
    GlobalNamespace::SongPreviewPlayer* songPreviewPlayer;
    // private System.Action`1<MissionResultsViewController> continueButtonPressedEvent
    // Offset: 0xF0
    System::Action_1<GlobalNamespace::MissionResultsViewController*>* continueButtonPressedEvent;
    // private System.Action`1<MissionResultsViewController> retryButtonPressedEvent
    // Offset: 0xF8
    System::Action_1<GlobalNamespace::MissionResultsViewController*>* retryButtonPressedEvent;
    // private MissionNode _missionNode
    // Offset: 0x100
    GlobalNamespace::MissionNode* missionNode;
    // private MissionCompletionResults _missionCompletionResults
    // Offset: 0x108
    GlobalNamespace::MissionCompletionResults* missionCompletionResults;
    // private UnityEngine.Coroutine _startFireworksAfterDelayCoroutine
    // Offset: 0x110
    UnityEngine::Coroutine* startFireworksAfterDelayCoroutine;
    // public System.Void add_continueButtonPressedEvent(System.Action`1<MissionResultsViewController> value)
    // Offset: 0xC0D6D8
    void add_continueButtonPressedEvent(System::Action_1<GlobalNamespace::MissionResultsViewController*>* value);
    // public System.Void remove_continueButtonPressedEvent(System.Action`1<MissionResultsViewController> value)
    // Offset: 0xC0D77C
    void remove_continueButtonPressedEvent(System::Action_1<GlobalNamespace::MissionResultsViewController*>* value);
    // public System.Void add_retryButtonPressedEvent(System.Action`1<MissionResultsViewController> value)
    // Offset: 0xC0D820
    void add_retryButtonPressedEvent(System::Action_1<GlobalNamespace::MissionResultsViewController*>* value);
    // public System.Void remove_retryButtonPressedEvent(System.Action`1<MissionResultsViewController> value)
    // Offset: 0xC0D8C4
    void remove_retryButtonPressedEvent(System::Action_1<GlobalNamespace::MissionResultsViewController*>* value);
    // public System.Void Init(MissionNode missionNode, MissionCompletionResults missionCompletionResults)
    // Offset: 0xC0D968
    void Init(GlobalNamespace::MissionNode* missionNode, GlobalNamespace::MissionCompletionResults* missionCompletionResults);
    // private System.Collections.IEnumerator StartFireworksAfterDelay(System.Single delay)
    // Offset: 0xC0DDD4
    System::Collections::IEnumerator* StartFireworksAfterDelay(float delay);
    // private System.Void SetDataToUI()
    // Offset: 0xC0DB28
    void SetDataToUI();
    // private System.Void ContinueButtonPressed()
    // Offset: 0xC0DEEC
    void ContinueButtonPressed();
    // private System.Void RetryButtonPressed()
    // Offset: 0xC0DF50
    void RetryButtonPressed();
    // protected override System.Void DidActivate(System.Boolean firstActivation, HMUI.ViewController/ActivationType activationType)
    // Offset: 0xC0D9A0
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, HMUI.ViewController/ActivationType activationType)
    void DidActivate(bool firstActivation, HMUI::ViewController::ActivationType activationType);
    // protected override System.Void DidDeactivate(HMUI.ViewController/DeactivationType deactivationType)
    // Offset: 0xC0DE60
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidDeactivate(HMUI.ViewController/DeactivationType deactivationType)
    void DidDeactivate(HMUI::ViewController::DeactivationType deactivationType);
    // public System.Void .ctor()
    // Offset: 0xC0DFB4
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MissionResultsViewController* New_ctor();
  }; // MissionResultsViewController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MissionResultsViewController*, "", "MissionResultsViewController");
#pragma pack(pop)
