// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: IConnectedPlayer
#include "GlobalNamespace/IConnectedPlayer.hpp"
// Including type: INetworkPlayer
#include "GlobalNamespace/INetworkPlayer.hpp"
// Including type: MultiplayerAvatarData
#include "GlobalNamespace/MultiplayerAvatarData.hpp"
// Including type: BeatmapLevelSelectionMask
#include "GlobalNamespace/BeatmapLevelSelectionMask.hpp"
// Including type: GameplayServerConfiguration
#include "GlobalNamespace/GameplayServerConfiguration.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MockPlayerSettings
  class MockPlayerSettings;
  // Forward declaring type: MockPlayerFiniteStateMachine
  class MockPlayerFiniteStateMachine;
  // Forward declaring type: DisconnectedReason
  struct DisconnectedReason;
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: AvatarPartsModel
  class AvatarPartsModel;
  // Forward declaring type: BeatmapLevelsModel
  class BeatmapLevelsModel;
  // Forward declaring type: NodePoseSyncStateManager
  class NodePoseSyncStateManager;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xE8
  #pragma pack(push, 1)
  // Autogenerated type: MockPlayer
  // [TokenAttribute] Offset: FFFFFFFF
  class MockPlayer : public ::Il2CppObject/*, public GlobalNamespace::IConnectedPlayer, public GlobalNamespace::INetworkPlayer*/ {
    public:
    // private readonly System.Boolean <isMe>k__BackingField
    // Size: 0x1
    // Offset: 0x10
    bool isMe;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isConnected>k__BackingField
    // Size: 0x1
    // Offset: 0x11
    bool isConnected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isConnected and: multiplayerAvatarData
    char __padding1[0x6] = {};
    // private MultiplayerAvatarData <multiplayerAvatarData>k__BackingField
    // Size: 0x70
    // Offset: 0x18
    GlobalNamespace::MultiplayerAvatarData multiplayerAvatarData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerAvatarData) == 0x70);
    // private System.Boolean <isConnectionOwner>k__BackingField
    // Size: 0x1
    // Offset: 0x88
    bool isConnectionOwner;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isKicked>k__BackingField
    // Size: 0x1
    // Offset: 0x89
    bool isKicked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isKicked and: currentPartySize
    char __padding4[0x2] = {};
    // private System.Int32 <currentPartySize>k__BackingField
    // Size: 0x4
    // Offset: 0x8C
    int currentPartySize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private BeatmapLevelSelectionMask <selectionMask>k__BackingField
    // Size: 0x18
    // Offset: 0x90
    GlobalNamespace::BeatmapLevelSelectionMask selectionMask;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapLevelSelectionMask) == 0x18);
    // private GameplayServerConfiguration <configuration>k__BackingField
    // Size: 0x18
    // Offset: 0xA8
    GlobalNamespace::GameplayServerConfiguration configuration;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameplayServerConfiguration) == 0x18);
    // private System.Boolean <isMyPartyOwner>k__BackingField
    // Size: 0x1
    // Offset: 0xC0
    bool isMyPartyOwner;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <requiresPassword>k__BackingField
    // Size: 0x1
    // Offset: 0xC1
    bool requiresPassword;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isWaitingOnJoin>k__BackingField
    // Size: 0x1
    // Offset: 0xC2
    bool isWaitingOnJoin;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <canInvite>k__BackingField
    // Size: 0x1
    // Offset: 0xC3
    bool canInvite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isWaitingOnInvite>k__BackingField
    // Size: 0x1
    // Offset: 0xC4
    bool isWaitingOnInvite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <canKick>k__BackingField
    // Size: 0x1
    // Offset: 0xC5
    bool canKick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <canLeave>k__BackingField
    // Size: 0x1
    // Offset: 0xC6
    bool canLeave;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <canBlock>k__BackingField
    // Size: 0x1
    // Offset: 0xC7
    bool canBlock;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <canUnblock>k__BackingField
    // Size: 0x1
    // Offset: 0xC8
    bool canUnblock;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isReady
    // Size: 0x1
    // Offset: 0xC9
    bool isReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isReady and: playerState
    char __padding17[0x6] = {};
    // private readonly System.Collections.Generic.HashSet`1<System.String> _playerState
    // Size: 0x8
    // Offset: 0xD0
    System::Collections::Generic::HashSet_1<::Il2CppString*>* playerState;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<::Il2CppString*>*) == 0x8);
    // private readonly MockPlayerSettings _settings
    // Size: 0x8
    // Offset: 0xD8
    GlobalNamespace::MockPlayerSettings* settings;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MockPlayerSettings*) == 0x8);
    // private MockPlayerFiniteStateMachine _fsm
    // Size: 0x8
    // Offset: 0xE0
    GlobalNamespace::MockPlayerFiniteStateMachine* fsm;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MockPlayerFiniteStateMachine*) == 0x8);
    // Creating value type constructor for type: MockPlayer
