// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MockPlayerGamePoseGenerator
#include "GlobalNamespace/MockPlayerGamePoseGenerator.hpp"
// Including type: UnityEngine.Pose
#include "UnityEngine/Pose.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IMockPlayerScoreCalculator
  class IMockPlayerScoreCalculator;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: MockNoteData
  class MockNoteData;
  // Forward declaring type: MockObstacleData
  class MockObstacleData;
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: IGameplayRpcManager
  class IGameplayRpcManager;
  // Forward declaring type: NoteCutDirection
  struct NoteCutDirection;
  // Forward declaring type: NoteSpawnInfoNetSerializable
  class NoteSpawnInfoNetSerializable;
  // Forward declaring type: ObstacleSpawnInfoNetSerializable
  class ObstacleSpawnInfoNetSerializable;
  // Forward declaring type: SliderSpawnInfoNetSerializable
  class SliderSpawnInfoNetSerializable;
  // Forward declaring type: MockBeatmapData
  class MockBeatmapData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MockPlayerGamePoseGeneratorAI
  class MockPlayerGamePoseGeneratorAI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MockPlayerGamePoseGeneratorAI);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MockPlayerGamePoseGeneratorAI*, "", "MockPlayerGamePoseGeneratorAI");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x10F
  #pragma pack(push, 1)
  // Autogenerated type: MockPlayerGamePoseGeneratorAI
  // [TokenAttribute] Offset: FFFFFFFF
  class MockPlayerGamePoseGeneratorAI : public ::GlobalNamespace::MockPlayerGamePoseGenerator {
    public:
    public:
    // private readonly IMockPlayerScoreCalculator _scoreCalculator
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::IMockPlayerScoreCalculator* scoreCalculator;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IMockPlayerScoreCalculator*) == 0x8);
    // private System.Int32 _lastKnowScore
    // Size: 0x4
    // Offset: 0x40
    int lastKnowScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _songStartTime
    // Size: 0x4
    // Offset: 0x44
    float songStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _timeScale
    // Size: 0x4
    // Offset: 0x48
    float timeScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: timeScale and: onSongFinished
    char __padding3[0x4] = {};
    // private System.Action _onSongFinished
    // Size: 0x8
    // Offset: 0x50
    ::System::Action* onSongFinished;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private GameplayModifiers _gameplayModifiers
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::GameplayModifiers* gameplayModifiers;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameplayModifiers*) == 0x8);
    // private System.Single _lastEventTime
    // Size: 0x4
    // Offset: 0x60
    float lastEventTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Pose _lastHeadPose
    // Size: 0x1C
    // Offset: 0x64
    ::UnityEngine::Pose lastHeadPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private UnityEngine.Pose _lastLeftHandPose
    // Size: 0x1C
    // Offset: 0x80
    ::UnityEngine::Pose lastLeftHandPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private UnityEngine.Pose _lastRightHandPose
    // Size: 0x1C
    // Offset: 0x9C
    ::UnityEngine::Pose lastRightHandPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private System.Single _lastSongTime
    // Size: 0x4
    // Offset: 0xB8
    float lastSongTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 _lineCount
    // Size: 0x4
    // Offset: 0xBC
    int lineCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private MockNoteData[] _leftNotes
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::GlobalNamespace::MockNoteData*> leftNotes;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MockNoteData*>) == 0x8);
    // private MockNoteData[] _rightNotes
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<::GlobalNamespace::MockNoteData*> rightNotes;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MockNoteData*>) == 0x8);
    // private MockNoteData[] _bombNotes
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::GlobalNamespace::MockNoteData*> bombNotes;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MockNoteData*>) == 0x8);
    // private MockObstacleData[] _obstacles
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::GlobalNamespace::MockObstacleData*> obstacles;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MockObstacleData*>) == 0x8);
    // private System.Int32 _leftNoteIndex
    // Size: 0x4
    // Offset: 0xE0
    int leftNoteIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _rightNoteIndex
    // Size: 0x4
    // Offset: 0xE4
    int rightNoteIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _bombNoteIndex
    // Size: 0x4
    // Offset: 0xE8
    int bombNoteIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _obstacleIndex
    // Size: 0x4
    // Offset: 0xEC
    int obstacleIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _prevLeftScore
    // Size: 0x4
    // Offset: 0xF0
    int prevLeftScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _prevRightScore
    // Size: 0x4
    // Offset: 0xF4
    int prevRightScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _nextLeftHitScore
    // Size: 0x4
    // Offset: 0xF8
    int nextLeftHitScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _nextRightHitScore
    // Size: 0x4
    // Offset: 0xFC
    int nextRightHitScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _score
    // Size: 0x4
    // Offset: 0x100
    int score;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _combo
    // Size: 0x4
    // Offset: 0x104
    int combo;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _multiplier
    // Size: 0x4
    // Offset: 0x108
    int multiplier;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _fullCombo
    // Size: 0x1
    // Offset: 0x10C
    bool fullCombo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _hasFinishedLevel
    // Size: 0x1
    // Offset: 0x10D
    bool hasFinishedLevel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isInited
    // Size: 0x1
    // Offset: 0x10E
    bool isInited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private readonly IMockPlayerScoreCalculator _scoreCalculator
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::IMockPlayerScoreCalculator*& dyn__scoreCalculator();
    // Get instance field reference: private System.Int32 _lastKnowScore
    [[deprecated("Use field access instead!")]] int& dyn__lastKnowScore();
    // Get instance field reference: private System.Single _songStartTime
    [[deprecated("Use field access instead!")]] float& dyn__songStartTime();
    // Get instance field reference: private System.Single _timeScale
    [[deprecated("Use field access instead!")]] float& dyn__timeScale();
    // Get instance field reference: private System.Action _onSongFinished
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn__onSongFinished();
