// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IMultiplayerSessionManager
#include "GlobalNamespace/IMultiplayerSessionManager.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MockPlayersModel
  class MockPlayersModel;
  // Forward declaring type: AvatarPartsModel
  class AvatarPartsModel;
  // Forward declaring type: BeatmapLevelsModel
  class BeatmapLevelsModel;
  // Forward declaring type: NodePoseSyncStateManager
  class NodePoseSyncStateManager;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: SmallBufferPool
  class SmallBufferPool;
  // Forward declaring type: MockPlayer
  class MockPlayer;
  // Forward declaring type: MockedPlayerMultiplayerSessionManager
  class MockedPlayerMultiplayerSessionManager;
  // Forward declaring type: ConnectedPlayerManager
  class ConnectedPlayerManager;
  // Forward declaring type: INetworkPacketSubSerializer`1<TData>
  template<typename TData>
  class INetworkPacketSubSerializer_1;
  // Forward declaring type: GameplayServerConfiguration
  struct GameplayServerConfiguration;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: INetSerializable
  class INetSerializable;
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x95
  #pragma pack(push, 1)
  // Autogenerated type: MockMultiplayerSessionManager
  class MockMultiplayerSessionManager : public UnityEngine::MonoBehaviour/*, public GlobalNamespace::IMultiplayerSessionManager*/ {
    public:
    // Nested type: GlobalNamespace::MockMultiplayerSessionManager::$$c__DisplayClass76_0
    class $$c__DisplayClass76_0;
    // Nested type: GlobalNamespace::MockMultiplayerSessionManager::$$c
    class $$c;
    // Nested type: GlobalNamespace::MockMultiplayerSessionManager::$PerformAtSyncTime$d__90
    struct $PerformAtSyncTime$d__90;
    // Nested type: GlobalNamespace::MockMultiplayerSessionManager::$SendToOthers$d__94
    struct $SendToOthers$d__94;
    // [InjectAttribute] Offset: 0xE1D66C
    // private readonly MockPlayersModel _playersModel
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::MockPlayersModel* playersModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MockPlayersModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE1D67C
    // private readonly AvatarPartsModel _avatarPartsModel
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::AvatarPartsModel* avatarPartsModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarPartsModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE1D68C
    // private readonly BeatmapLevelsModel _beatmapLevelsModel
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::BeatmapLevelsModel* beatmapLevelsModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::BeatmapLevelsModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE1D69C
    // private readonly NodePoseSyncStateManager _nodePoseSyncStateManager
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::NodePoseSyncStateManager* nodePoseSyncStateManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NodePoseSyncStateManager*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1D6AC
    // private System.Boolean <isPartyCreated>k__BackingField
    // Size: 0x1
    // Offset: 0x38
    bool isPartyCreated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPartyCreated and: syncTimeDelay
    char __padding4[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xE1D6BC
    // private System.Single <syncTimeDelay>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    float syncTimeDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xE1D6CC
    // private System.Action`1<IConnectedPlayer> playerConnectedEvent
    // Size: 0x8
    // Offset: 0x40
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerConnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1D6DC
    // private System.Action`1<ConnectionFailedReason> connectionFailedEvent
    // Size: 0x8
    // Offset: 0x48
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* connectionFailedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::ConnectionFailedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1D6EC
    // private System.Action`1<IConnectedPlayer> playerDisconnectedEvent
    // Size: 0x8
    // Offset: 0x50
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerDisconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1D6FC
    // private System.Action`1<IConnectedPlayer> playerAvatarChangedEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerAvatarChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1D70C
    // private System.Action`1<IConnectedPlayer> playerStateChangedEvent
    // Size: 0x8
    // Offset: 0x60
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerStateChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1D71C
    // private System.Action`1<DisconnectedReason> disconnectedEvent
    // Size: 0x8
    // Offset: 0x68
    System::Action_1<GlobalNamespace::DisconnectedReason>* disconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::DisconnectedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1D72C
    // private System.Action connectedEvent
    // Size: 0x8
    // Offset: 0x70
    System::Action* connectedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private readonly SmallBufferPool _smallBufferPool
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::SmallBufferPool* smallBufferPool;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SmallBufferPool*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<MockPlayer,MockedPlayerMultiplayerSessionManager> _playerSessionManagers
    // Size: 0x8
    // Offset: 0x80
    System::Collections::Generic::Dictionary_2<GlobalNamespace::MockPlayer*, GlobalNamespace::MockedPlayerMultiplayerSessionManager*>* playerSessionManagers;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<GlobalNamespace::MockPlayer*, GlobalNamespace::MockedPlayerMultiplayerSessionManager*>*) == 0x8);
    // private MockedPlayerMultiplayerSessionManager _localPlayerSessionManager
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::MockedPlayerMultiplayerSessionManager* localPlayerSessionManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MockedPlayerMultiplayerSessionManager*) == 0x8);
    // private System.Int32 _maxPlayerCount
    // Size: 0x4
    // Offset: 0x90
    int maxPlayerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _disposed
    // Size: 0x1
    // Offset: 0x94
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: MockMultiplayerSessionManager
