// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MouseLook
  class MouseLook : public ::Il2CppObject {
    public:
    // private System.Single _xSensitivity
    // Offset: 0x10
    float xSensitivity;
    // private System.Single _ySensitivity
    // Offset: 0x14
    float ySensitivity;
    // private System.Boolean _clampVerticalRotation
    // Offset: 0x18
    bool clampVerticalRotation;
    // private System.Single _minimumX
    // Offset: 0x1C
    float minimumX;
    // private System.Single _maximumX
    // Offset: 0x20
    float maximumX;
    // private System.Boolean _smooth
    // Offset: 0x24
    bool smooth;
    // private System.Single _smoothTime
    // Offset: 0x28
    float smoothTime;
    // private System.Boolean _lockCursor
    // Offset: 0x2C
    bool lockCursor;
    // private UnityEngine.Quaternion _characterTargetRot
    // Offset: 0x30
    UnityEngine::Quaternion characterTargetRot;
    // private UnityEngine.Quaternion _cameraTargetRot
    // Offset: 0x40
    UnityEngine::Quaternion cameraTargetRot;
    // private System.Boolean _cursorIsLocked
    // Offset: 0x50
    bool cursorIsLocked;
    // public System.Void Init(UnityEngine.Transform character, UnityEngine.Transform camera)
    // Offset: 0x205BD2C
    void Init(UnityEngine::Transform* character, UnityEngine::Transform* camera);
    // public System.Void LookRotation(UnityEngine.Transform character, UnityEngine.Transform camera)
    // Offset: 0x205BDC4
    void LookRotation(UnityEngine::Transform* character, UnityEngine::Transform* camera);
    // public System.Void SetCursorLock(System.Boolean value)
    // Offset: 0x205C174
    void SetCursorLock(bool value);
    // public System.Void UpdateCursorLock()
    // Offset: 0x205C164
    void UpdateCursorLock();
    // private System.Void InternalLockUpdate()
    // Offset: 0x205C1A8
    void InternalLockUpdate();
    // private UnityEngine.Quaternion ClampRotationAroundXAxis(UnityEngine.Quaternion q)
    // Offset: 0x205C09C
    UnityEngine::Quaternion ClampRotationAroundXAxis(UnityEngine::Quaternion q);
    // public System.Void .ctor()
    // Offset: 0x205C224
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static MouseLook* New_ctor();
  }; // MouseLook
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MouseLook*, "", "MouseLook");
#pragma pack(pop)
