// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: BeatmapEventType
#include "GlobalNamespace/BeatmapEventType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatmapObjectCallbackController
  class BeatmapObjectCallbackController;
  // Forward declaring type: BeatmapEventData
  class BeatmapEventData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MovementBeatmapEventEffect
  class MovementBeatmapEventEffect : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::MovementBeatmapEventEffect::MovementData
    class MovementData;
    // private BeatmapEventType _beatmapEventType
    // Offset: 0x18
    GlobalNamespace::BeatmapEventType beatmapEventType;
    // private System.Single _transitionSpeed
    // Offset: 0x1C
    float transitionSpeed;
    // private MovementBeatmapEventEffect/MovementData[] _movementData
    // Offset: 0x20
    ::Array<GlobalNamespace::MovementBeatmapEventEffect::MovementData*>* movementData;
    // private UnityEngine.Transform[] _transforms
    // Offset: 0x28
    ::Array<UnityEngine::Transform*>* transforms;
    // private readonly BeatmapObjectCallbackController _beatmapObjectCallbackController
    // Offset: 0x30
    GlobalNamespace::BeatmapObjectCallbackController* beatmapObjectCallbackController;
    // private System.Int32 _currentMovementDataIdx
    // Offset: 0x38
    int currentMovementDataIdx;
    // private UnityEngine.Vector3 _currentPositionOffset
    // Offset: 0x3C
    UnityEngine::Vector3 currentPositionOffset;
    // private UnityEngine.Vector3 _prevPositionOffset
    // Offset: 0x48
    UnityEngine::Vector3 prevPositionOffset;
    // private UnityEngine.Vector3[] _startLocalPositions
    // Offset: 0x58
    ::Array<UnityEngine::Vector3>* startLocalPositions;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0xFA5694
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0xFA594C
    void OnDestroy();
    // protected System.Void FixedUpdate()
    // Offset: 0xFA5A28
    void FixedUpdate();
    // protected System.Void LateUpdate()
    // Offset: 0xFA5BA8
    void LateUpdate();
    // private System.Void HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger(BeatmapEventData beatmapEventData)
    // Offset: 0xFA5C94
    void HandleBeatmapObjectCallbackControllerBeatmapEventDidTrigger(GlobalNamespace::BeatmapEventData* beatmapEventData);
    // private System.Void SetLocalPositionOffsetsForAllObjects(UnityEngine.Vector3 localPositionOffset)
    // Offset: 0xFA5814
    void SetLocalPositionOffsetsForAllObjects(UnityEngine::Vector3 localPositionOffset);
    // public System.Void .ctor()
    // Offset: 0xFA5CEC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MovementBeatmapEventEffect* New_ctor();
  }; // MovementBeatmapEventEffect
  check_size<sizeof(MovementBeatmapEventEffect), 88 + sizeof(void*) + 8 - (88 + sizeof(void*)) % 8> __GlobalNamespace_MovementBeatmapEventEffectSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MovementBeatmapEventEffect*, "", "MovementBeatmapEventEffect");
#pragma pack(pop)
