// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerIntroCountdown
  class MultiplayerIntroCountdown;
  // Forward declaring type: MultiplayerScoreRingManager
  class MultiplayerScoreRingManager;
  // Forward declaring type: MultiplayerPlayersManager
  class MultiplayerPlayersManager;
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerIntroAnimationController
  class MultiplayerIntroAnimationController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::MultiplayerIntroAnimationController::$PlayIntroAnimationCoroutine$d__11
    class $PlayIntroAnimationCoroutine$d__11;
    // private System.Single _startDelay
    // Offset: 0x18
    float startDelay;
    // private System.Single _animationDuration
    // Offset: 0x1C
    float animationDuration;
    // private System.Single _spawnEffectPeak
    // Offset: 0x20
    float spawnEffectPeak;
    // private System.Single _endDelay
    // Offset: 0x24
    float endDelay;
    // private MultiplayerIntroCountdown _countdownAnimator
    // Offset: 0x28
    GlobalNamespace::MultiplayerIntroCountdown* countdownAnimator;
    // private MultiplayerScoreRingManager _scoreRingManager
    // Offset: 0x30
    GlobalNamespace::MultiplayerScoreRingManager* scoreRingManager;
    // private readonly MultiplayerPlayersManager _multiplayerPlayersManager
    // Offset: 0x38
    GlobalNamespace::MultiplayerPlayersManager* multiplayerPlayersManager;
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Offset: 0x40
    GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void SetBeforeIntroValue()
    // Offset: 0xFB1424
    void SetBeforeIntroValue();
    // public System.Void PlayIntroAnimation(System.Single maxDesiredIntroAnimationDuration, System.Action onCompleted)
    // Offset: 0xFAF64C
    void PlayIntroAnimation(float maxDesiredIntroAnimationDuration, System::Action* onCompleted);
    // public System.Single GetFullIntroAnimationTime()
    // Offset: 0xFAF614
    float GetFullIntroAnimationTime();
    // private System.Collections.IEnumerator PlayIntroAnimationCoroutine(System.Single maxDesiredIntroAnimationDuration, System.Action onCompleted)
    // Offset: 0xFB2D58
    System::Collections::IEnumerator* PlayIntroAnimationCoroutine(float maxDesiredIntroAnimationDuration, System::Action* onCompleted);
    // public System.Void TransitionToAfterIntroAnimationState()
    // Offset: 0xFAF678
    void TransitionToAfterIntroAnimationState();
    // private System.Collections.Generic.Queue`1<System.Int32> CalculatePlayerIndexSequence(System.Collections.Generic.IReadOnlyList`1<IConnectedPlayer> allActivePlayer)
    // Offset: 0xFB2E2C
    System::Collections::Generic::Queue_1<int>* CalculatePlayerIndexSequence(System::Collections::Generic::IReadOnlyList_1<GlobalNamespace::IConnectedPlayer*>* allActivePlayer);
    // public System.Void .ctor()
    // Offset: 0xFB32D4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MultiplayerIntroAnimationController* New_ctor();
  }; // MultiplayerIntroAnimationController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerIntroAnimationController*, "", "MultiplayerIntroAnimationController");
#pragma pack(pop)
