// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerIntroCountdownTextController
  class MultiplayerIntroCountdownTextController;
  // Forward declaring type: MultiplayerOffsetPositionByLocalPlayerPosition
  class MultiplayerOffsetPositionByLocalPlayerPosition;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Forward declaring namespace: Tweening
namespace Tweening {
  // Forward declaring type: TweeningManager
  class TweeningManager;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: MultiplayerIntroCountdown
  // [TokenAttribute] Offset: FFFFFFFF
  class MultiplayerIntroCountdown : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::MultiplayerIntroCountdown::$CountdownRoutine$d__23
    class $CountdownRoutine$d__23;
    // Nested type: GlobalNamespace::MultiplayerIntroCountdown::$PlayDelayed$d__24
    class $PlayDelayed$d__24;
    // Nested type: GlobalNamespace::MultiplayerIntroCountdown::$$c__DisplayClass25_0
    class $$c__DisplayClass25_0;
    // Nested type: GlobalNamespace::MultiplayerIntroCountdown::$PhaseRoutine$d__25
    class $PhaseRoutine$d__25;
    // private System.Single _textAppearDuration
    // Size: 0x4
    // Offset: 0x18
    float textAppearDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _textDisappearDuration
    // Size: 0x4
    // Offset: 0x1C
    float textDisappearDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _goDisappearDuration
    // Size: 0x4
    // Offset: 0x20
    float goDisappearDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _partsDistance
    // Size: 0x4
    // Offset: 0x24
    float partsDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _startLocalPosition
    // Size: 0xC
    // Offset: 0x28
    UnityEngine::Vector3 startLocalPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _targetLocalPosition
    // Size: 0xC
    // Offset: 0x34
    UnityEngine::Vector3 targetLocalPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [SpaceAttribute] Offset: 0xEB5070
    // private UnityEngine.AudioClip _readyClip
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::AudioClip* readyClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioClip _setClip
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::AudioClip* setClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioClip _goClip
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::AudioClip* goClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioClip _buildUpClip
    // Size: 0x8
    // Offset: 0x58
    UnityEngine::AudioClip* buildUpClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AudioClip*) == 0x8);
    // [SpaceAttribute] Offset: 0xEB50D8
    // private MultiplayerIntroCountdownTextController _textController0
    // Size: 0x8
    // Offset: 0x60
    GlobalNamespace::MultiplayerIntroCountdownTextController* textController0;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerIntroCountdownTextController*) == 0x8);
    // private MultiplayerIntroCountdownTextController _textController1
    // Size: 0x8
    // Offset: 0x68
    GlobalNamespace::MultiplayerIntroCountdownTextController* textController1;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerIntroCountdownTextController*) == 0x8);
    // private UnityEngine.AudioSource _audioSource
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(UnityEngine::AudioSource*) == 0x8);
    // [SpaceAttribute] Offset: 0xEB5130
    // private MultiplayerOffsetPositionByLocalPlayerPosition _multiplayerOffsetByLocalPlayerPosition
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::MultiplayerOffsetPositionByLocalPlayerPosition* multiplayerOffsetByLocalPlayerPosition;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerOffsetPositionByLocalPlayerPosition*) == 0x8);
    // [InjectAttribute] Offset: 0xEB5168
    // private readonly Tweening.TweeningManager _tweeningManager
    // Size: 0x8
    // Offset: 0x80
    Tweening::TweeningManager* tweeningManager;
    // Field size check
    static_assert(sizeof(Tweening::TweeningManager*) == 0x8);
    // private MultiplayerIntroCountdownTextController _currentTextController
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::MultiplayerIntroCountdownTextController* currentTextController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerIntroCountdownTextController*) == 0x8);
    // private System.Single _fontSize
    // Size: 0x4
    // Offset: 0x90
    float fontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _alpha
    // Size: 0x4
    // Offset: 0x94
    float alpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: MultiplayerIntroCountdown
    MultiplayerIntroCountdown(float textAppearDuration_ = {}, float textDisappearDuration_ = {}, float goDisappearDuration_ = {}, float partsDistance_ = {}, UnityEngine::Vector3 startLocalPosition_ = {}, UnityEngine::Vector3 targetLocalPosition_ = {}, UnityEngine::AudioClip* readyClip_ = {}, UnityEngine::AudioClip* setClip_ = {}, UnityEngine::AudioClip* goClip_ = {}, UnityEngine::AudioClip* buildUpClip_ = {}, GlobalNamespace::MultiplayerIntroCountdownTextController* textController0_ = {}, GlobalNamespace::MultiplayerIntroCountdownTextController* textController1_ = {}, UnityEngine::AudioSource* audioSource_ = {}, GlobalNamespace::MultiplayerOffsetPositionByLocalPlayerPosition* multiplayerOffsetByLocalPlayerPosition_ = {}, Tweening::TweeningManager* tweeningManager_ = {}, GlobalNamespace::MultiplayerIntroCountdownTextController* currentTextController_ = {}, float fontSize_ = {}, float alpha_ = {}) noexcept : textAppearDuration{textAppearDuration_}, textDisappearDuration{textDisappearDuration_}, goDisappearDuration{goDisappearDuration_}, partsDistance{partsDistance_}, startLocalPosition{startLocalPosition_}, targetLocalPosition{targetLocalPosition_}, readyClip{readyClip_}, setClip{setClip_}, goClip{goClip_}, buildUpClip{buildUpClip_}, textController0{textController0_}, textController1{textController1_}, audioSource{audioSource_}, multiplayerOffsetByLocalPlayerPosition{multiplayerOffsetByLocalPlayerPosition_}, tweeningManager{tweeningManager_}, currentTextController{currentTextController_}, fontSize{fontSize_}, alpha{alpha_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field: private System.Single _textAppearDuration
    float _get__textAppearDuration();
    // Set instance field: private System.Single _textAppearDuration
    void _set__textAppearDuration(float value);
    // Get instance field: private System.Single _textDisappearDuration
    float _get__textDisappearDuration();
    // Set instance field: private System.Single _textDisappearDuration
    void _set__textDisappearDuration(float value);
    // Get instance field: private System.Single _goDisappearDuration
    float _get__goDisappearDuration();
    // Set instance field: private System.Single _goDisappearDuration
    void _set__goDisappearDuration(float value);
    // Get instance field: private System.Single _partsDistance
    float _get__partsDistance();
    // Set instance field: private System.Single _partsDistance
    void _set__partsDistance(float value);
    // Get instance field: private UnityEngine.Vector3 _startLocalPosition
    UnityEngine::Vector3 _get__startLocalPosition();
    // Set instance field: private UnityEngine.Vector3 _startLocalPosition
    void _set__startLocalPosition(UnityEngine::Vector3 value);
    // Get instance field: private UnityEngine.Vector3 _targetLocalPosition
    UnityEngine::Vector3 _get__targetLocalPosition();
    // Set instance field: private UnityEngine.Vector3 _targetLocalPosition
    void _set__targetLocalPosition(UnityEngine::Vector3 value);
    // Get instance field: private UnityEngine.AudioClip _readyClip
    UnityEngine::AudioClip* _get__readyClip();
    // Set instance field: private UnityEngine.AudioClip _readyClip
    void _set__readyClip(UnityEngine::AudioClip* value);
    // Get instance field: private UnityEngine.AudioClip _setClip
    UnityEngine::AudioClip* _get__setClip();
    // Set instance field: private UnityEngine.AudioClip _setClip
    void _set__setClip(UnityEngine::AudioClip* value);
    // Get instance field: private UnityEngine.AudioClip _goClip
    UnityEngine::AudioClip* _get__goClip();
    // Set instance field: private UnityEngine.AudioClip _goClip
    void _set__goClip(UnityEngine::AudioClip* value);
    // Get instance field: private UnityEngine.AudioClip _buildUpClip
    UnityEngine::AudioClip* _get__buildUpClip();
    // Set instance field: private UnityEngine.AudioClip _buildUpClip
    void _set__buildUpClip(UnityEngine::AudioClip* value);
    // Get instance field: private MultiplayerIntroCountdownTextController _textController0
    GlobalNamespace::MultiplayerIntroCountdownTextController* _get__textController0();
    // Set instance field: private MultiplayerIntroCountdownTextController _textController0
    void _set__textController0(GlobalNamespace::MultiplayerIntroCountdownTextController* value);
    // Get instance field: private MultiplayerIntroCountdownTextController _textController1
    GlobalNamespace::MultiplayerIntroCountdownTextController* _get__textController1();
    // Set instance field: private MultiplayerIntroCountdownTextController _textController1
    void _set__textController1(GlobalNamespace::MultiplayerIntroCountdownTextController* value);
    // Get instance field: private UnityEngine.AudioSource _audioSource
    UnityEngine::AudioSource* _get__audioSource();
    // Set instance field: private UnityEngine.AudioSource _audioSource
    void _set__audioSource(UnityEngine::AudioSource* value);
    // Get instance field: private MultiplayerOffsetPositionByLocalPlayerPosition _multiplayerOffsetByLocalPlayerPosition
    GlobalNamespace::MultiplayerOffsetPositionByLocalPlayerPosition* _get__multiplayerOffsetByLocalPlayerPosition();
    // Set instance field: private MultiplayerOffsetPositionByLocalPlayerPosition _multiplayerOffsetByLocalPlayerPosition
    void _set__multiplayerOffsetByLocalPlayerPosition(GlobalNamespace::MultiplayerOffsetPositionByLocalPlayerPosition* value);
    // Get instance field: private readonly Tweening.TweeningManager _tweeningManager
    Tweening::TweeningManager* _get__tweeningManager();
    // Set instance field: private readonly Tweening.TweeningManager _tweeningManager
    void _set__tweeningManager(Tweening::TweeningManager* value);
    // Get instance field: private MultiplayerIntroCountdownTextController _currentTextController
    GlobalNamespace::MultiplayerIntroCountdownTextController* _get__currentTextController();
    // Set instance field: private MultiplayerIntroCountdownTextController _currentTextController
    void _set__currentTextController(GlobalNamespace::MultiplayerIntroCountdownTextController* value);
    // Get instance field: private System.Single _fontSize
    float _get__fontSize();
    // Set instance field: private System.Single _fontSize
    void _set__fontSize(float value);
    // Get instance field: private System.Single _alpha
    float _get__alpha();
    // Set instance field: private System.Single _alpha
    void _set__alpha(float value);
    // public System.Single get_textAppearDuration()
    // Offset: 0x1FC492C
    float get_textAppearDuration();
    // protected System.Void Awake()
    // Offset: 0x1FC4934
    void Awake();
    // protected System.Void OnDestroy()
    // Offset: 0x1FC4A5C
    void OnDestroy();
    // public System.Void StartCountdown(System.Single seconds, System.Single delay, System.Single durationMultiplier)
    // Offset: 0x1FC4AF4
    void StartCountdown(float seconds, float delay, float durationMultiplier);
    // private System.Collections.IEnumerator CountdownRoutine(System.Single seconds, System.Single delay, System.Single durationMultiplier)
    // Offset: 0x1FC4B70
    System::Collections::IEnumerator* CountdownRoutine(float seconds, float delay, float durationMultiplier);
    // private System.Collections.IEnumerator PlayDelayed(UnityEngine.AudioClip audioClip, System.Single delay)
    // Offset: 0x1FC4C30
    System::Collections::IEnumerator* PlayDelayed(UnityEngine::AudioClip* audioClip, float delay);
    // private System.Collections.IEnumerator PhaseRoutine(System.String text, System.Single appearDuration, System.Single disappearDuration)
    // Offset: 0x1FC4CE8
    System::Collections::IEnumerator* PhaseRoutine(::Il2CppString* text, float appearDuration, float disappearDuration);
    // public System.Void .ctor()
    // Offset: 0x1FC4DA4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MultiplayerIntroCountdown* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MultiplayerIntroCountdown::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MultiplayerIntroCountdown*, creationType>()));
    }
  }; // MultiplayerIntroCountdown
  #pragma pack(pop)
  static check_size<sizeof(MultiplayerIntroCountdown), 148 + sizeof(float)> __GlobalNamespace_MultiplayerIntroCountdownSizeCheck;
  static_assert(sizeof(MultiplayerIntroCountdown) == 0x98);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerIntroCountdown*, "", "MultiplayerIntroCountdown");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerIntroCountdown::get_textAppearDuration
// Il2CppName: get_textAppearDuration
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (GlobalNamespace::MultiplayerIntroCountdown::*)()>(&GlobalNamespace::MultiplayerIntroCountdown::get_textAppearDuration)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerIntroCountdown*), "get_textAppearDuration", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerIntroCountdown::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::MultiplayerIntroCountdown::*)()>(&GlobalNamespace::MultiplayerIntroCountdown::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerIntroCountdown*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerIntroCountdown::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::MultiplayerIntroCountdown::*)()>(&GlobalNamespace::MultiplayerIntroCountdown::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerIntroCountdown*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerIntroCountdown::StartCountdown
// Il2CppName: StartCountdown
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::MultiplayerIntroCountdown::*)(float, float, float)>(&GlobalNamespace::MultiplayerIntroCountdown::StartCountdown)> {
  static const MethodInfo* get() {
    static auto* seconds = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* delay = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* durationMultiplier = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerIntroCountdown*), "StartCountdown", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{seconds, delay, durationMultiplier});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerIntroCountdown::CountdownRoutine
// Il2CppName: CountdownRoutine
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::Collections::IEnumerator* (GlobalNamespace::MultiplayerIntroCountdown::*)(float, float, float)>(&GlobalNamespace::MultiplayerIntroCountdown::CountdownRoutine)> {
  static const MethodInfo* get() {
    static auto* seconds = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* delay = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* durationMultiplier = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerIntroCountdown*), "CountdownRoutine", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{seconds, delay, durationMultiplier});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerIntroCountdown::PlayDelayed
// Il2CppName: PlayDelayed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::Collections::IEnumerator* (GlobalNamespace::MultiplayerIntroCountdown::*)(UnityEngine::AudioClip*, float)>(&GlobalNamespace::MultiplayerIntroCountdown::PlayDelayed)> {
  static const MethodInfo* get() {
    static auto* audioClip = &::il2cpp_utils::GetClassFromName("UnityEngine", "AudioClip")->byval_arg;
    static auto* delay = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerIntroCountdown*), "PlayDelayed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{audioClip, delay});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerIntroCountdown::PhaseRoutine
// Il2CppName: PhaseRoutine
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::Collections::IEnumerator* (GlobalNamespace::MultiplayerIntroCountdown::*)(::Il2CppString*, float, float)>(&GlobalNamespace::MultiplayerIntroCountdown::PhaseRoutine)> {
  static const MethodInfo* get() {
    static auto* text = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* appearDuration = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* disappearDuration = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerIntroCountdown*), "PhaseRoutine", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{text, appearDuration, disappearDuration});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerIntroCountdown::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
