// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IConnectedPlayerBeatmapObjectEventManager
#include "GlobalNamespace/IConnectedPlayerBeatmapObjectEventManager.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IPoolableSerializable
  class IPoolableSerializable;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: IGameplayRpcManager
  class IGameplayRpcManager;
  // Forward declaring type: MultiplayerConnectedPlayerSongTimeSyncController
  class MultiplayerConnectedPlayerSongTimeSyncController;
  // Forward declaring type: NoteSpawnInfoNetSerializable
  class NoteSpawnInfoNetSerializable;
  // Forward declaring type: ObstacleSpawnInfoNetSerializable
  class ObstacleSpawnInfoNetSerializable;
  // Forward declaring type: SliderSpawnInfoNetSerializable
  class SliderSpawnInfoNetSerializable;
  // Forward declaring type: NoteCutInfoNetSerializable
  class NoteCutInfoNetSerializable;
  // Forward declaring type: NoteMissInfoNetSerializable
  class NoteMissInfoNetSerializable;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerConnectedPlayerBeatmapObjectEventManager
  class MultiplayerConnectedPlayerBeatmapObjectEventManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MultiplayerConnectedPlayerBeatmapObjectEventManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MultiplayerConnectedPlayerBeatmapObjectEventManager*, "", "MultiplayerConnectedPlayerBeatmapObjectEventManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x61
  #pragma pack(push, 1)
  // Autogenerated type: MultiplayerConnectedPlayerBeatmapObjectEventManager
  // [TokenAttribute] Offset: FFFFFFFF
  class MultiplayerConnectedPlayerBeatmapObjectEventManager : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IConnectedPlayerBeatmapObjectEventManager*/ {
    public:
    // Nested type: ::GlobalNamespace::MultiplayerConnectedPlayerBeatmapObjectEventManager::TimestampedBeatmapObjectEventData
    struct TimestampedBeatmapObjectEventData;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: MultiplayerConnectedPlayerBeatmapObjectEventManager/TimestampedBeatmapObjectEventData
    // [TokenAttribute] Offset: FFFFFFFF
    // [IsReadOnlyAttribute] Offset: FFFFFFFF
    struct TimestampedBeatmapObjectEventData/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly System.Single time
      // Size: 0x4
      // Offset: 0x0
      float time;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // Padding between fields: time and: beatmapObjectEventData
      char __padding0[0x4] = {};
      // public readonly IPoolableSerializable beatmapObjectEventData
      // Size: 0x8
      // Offset: 0x8
      ::GlobalNamespace::IPoolableSerializable* beatmapObjectEventData;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::IPoolableSerializable*) == 0x8);
      public:
      // Creating value type constructor for type: TimestampedBeatmapObjectEventData
      constexpr TimestampedBeatmapObjectEventData(float time_ = {}, ::GlobalNamespace::IPoolableSerializable* beatmapObjectEventData_ = {}) noexcept : time{time_}, beatmapObjectEventData{beatmapObjectEventData_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating interface conversion operator: i_ValueType
      inline ::System::ValueType* i_ValueType() noexcept {
        return reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly System.Single time
      [[deprecated("Use field access instead!")]] float& dyn_time();
      // Get instance field reference: public readonly IPoolableSerializable beatmapObjectEventData
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::IPoolableSerializable*& dyn_beatmapObjectEventData();
      // public System.Void .ctor(System.Single time, IPoolableSerializable beatmapObjectEventData)
      // Offset: 0x1453B34
      // ABORTED: conflicts with another method.  TimestampedBeatmapObjectEventData(float time, ::GlobalNamespace::IPoolableSerializable* beatmapObjectEventData);
    }; // MultiplayerConnectedPlayerBeatmapObjectEventManager/TimestampedBeatmapObjectEventData
    #pragma pack(pop)
    static check_size<sizeof(MultiplayerConnectedPlayerBeatmapObjectEventManager::TimestampedBeatmapObjectEventData), 8 + sizeof(::GlobalNamespace::IPoolableSerializable*)> __GlobalNamespace_MultiplayerConnectedPlayerBeatmapObjectEventManager_TimestampedBeatmapObjectEventDataSizeCheck;
    static_assert(sizeof(MultiplayerConnectedPlayerBeatmapObjectEventManager::TimestampedBeatmapObjectEventData) == 0x10);
    public:
    // [InjectAttribute] Offset: 0x1117914
    // private readonly IConnectedPlayer _connectedPlayer
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::IConnectedPlayer* connectedPlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IConnectedPlayer*) == 0x8);
    // [InjectAttribute] Offset: 0x1117924
    // private readonly IGameplayRpcManager _gameplayRpcManager
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::IGameplayRpcManager* gameplayRpcManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IGameplayRpcManager*) == 0x8);
    // [InjectAttribute] Offset: 0x1117934
    // private readonly MultiplayerConnectedPlayerSongTimeSyncController _songTimeController
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::MultiplayerConnectedPlayerSongTimeSyncController* songTimeController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerConnectedPlayerSongTimeSyncController*) == 0x8);
    // private System.Action`1<NoteSpawnInfoNetSerializable> connectedPlayerNoteWasSpawnedEvent
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_1<::GlobalNamespace::NoteSpawnInfoNetSerializable*>* connectedPlayerNoteWasSpawnedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::NoteSpawnInfoNetSerializable*>*) == 0x8);
    // private System.Action`1<ObstacleSpawnInfoNetSerializable> connectedPlayerObstacleWasSpawnedEvent
    // Size: 0x8
    // Offset: 0x38
    ::System::Action_1<::GlobalNamespace::ObstacleSpawnInfoNetSerializable*>* connectedPlayerObstacleWasSpawnedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::ObstacleSpawnInfoNetSerializable*>*) == 0x8);
    // private System.Action`1<SliderSpawnInfoNetSerializable> connectedPlayerSliderWasSpawnedEvent
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_1<::GlobalNamespace::SliderSpawnInfoNetSerializable*>* connectedPlayerSliderWasSpawnedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::SliderSpawnInfoNetSerializable*>*) == 0x8);
    // private System.Action`1<NoteCutInfoNetSerializable> connectedPlayerNoteWasCutEvent
    // Size: 0x8
    // Offset: 0x48
    ::System::Action_1<::GlobalNamespace::NoteCutInfoNetSerializable*>* connectedPlayerNoteWasCutEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::NoteCutInfoNetSerializable*>*) == 0x8);
    // private System.Action`1<NoteMissInfoNetSerializable> connectedPlayerNoteWasMissedEvent
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_1<::GlobalNamespace::NoteMissInfoNetSerializable*>* connectedPlayerNoteWasMissedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::NoteMissInfoNetSerializable*>*) == 0x8);
    // private readonly System.Collections.Generic.Queue`1<MultiplayerConnectedPlayerBeatmapObjectEventManager/TimestampedBeatmapObjectEventData> _beatmapObjectEventQueue
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::Queue_1<::GlobalNamespace::MultiplayerConnectedPlayerBeatmapObjectEventManager::TimestampedBeatmapObjectEventData>* beatmapObjectEventQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::GlobalNamespace::MultiplayerConnectedPlayerBeatmapObjectEventManager::TimestampedBeatmapObjectEventData>*) == 0x8);
    // private System.Boolean _paused
    // Size: 0x1
    // Offset: 0x60
    bool paused;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IConnectedPlayerBeatmapObjectEventManager
    operator ::GlobalNamespace::IConnectedPlayerBeatmapObjectEventManager() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IConnectedPlayerBeatmapObjectEventManager*>(this);
    }
    // Creating interface conversion operator: i_IConnectedPlayerBeatmapObjectEventManager
    inline ::GlobalNamespace::IConnectedPlayerBeatmapObjectEventManager* i_IConnectedPlayerBeatmapObjectEventManager() noexcept {
      return reinterpret_cast<::GlobalNamespace::IConnectedPlayerBeatmapObjectEventManager*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private readonly IConnectedPlayer _connectedPlayer
