// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: CoreGameHUDController
#include "GlobalNamespace/CoreGameHUDController.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: CanvasGroup
  class CanvasGroup;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerScoreProvider
  class MultiplayerScoreProvider;
  // Forward declaring type: MultiplayerPlayersManager
  class MultiplayerPlayersManager;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerPositionHUDController
  class MultiplayerPositionHUDController : public UnityEngine::MonoBehaviour {
    public:
    // private TMPro.TextMeshProUGUI _playerCountText
    // Offset: 0x18
    TMPro::TextMeshProUGUI* playerCountText;
    // private TMPro.TextMeshProUGUI _positionText
    // Offset: 0x20
    TMPro::TextMeshProUGUI* positionText;
    // private UnityEngine.CanvasGroup _canvasGroup
    // Offset: 0x28
    UnityEngine::CanvasGroup* canvasGroup;
    // private UnityEngine.GameObject _firstPlayerAnimationGo
    // Offset: 0x30
    UnityEngine::GameObject* firstPlayerAnimationGo;
    // private readonly MultiplayerScoreProvider _scoreProvider
    // Offset: 0x38
    GlobalNamespace::MultiplayerScoreProvider* scoreProvider;
    // private readonly MultiplayerPlayersManager _playersManager
    // Offset: 0x40
    GlobalNamespace::MultiplayerPlayersManager* playersManager;
    // private readonly CoreGameHUDController/InitData _initData
    // Offset: 0x48
    GlobalNamespace::CoreGameHUDController::InitData* initData;
    // private System.Int32 _prevPosition
    // Offset: 0x50
    int prevPosition;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void set_alpha(System.Single value)
    // Offset: 0x1FD6718
    void set_alpha(float value);
    // protected System.Void Start()
    // Offset: 0x1FD6734
    void Start();
    // protected System.Void Update()
    // Offset: 0x1FD6880
    void Update();
    // public System.Void .ctor()
    // Offset: 0x1FD6A34
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MultiplayerPositionHUDController* New_ctor();
  }; // MultiplayerPositionHUDController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerPositionHUDController*, "", "MultiplayerPositionHUDController");
#pragma pack(pop)
