// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.FlowCoordinator
#include "HMUI/FlowCoordinator.hpp"
// Including type: MultiplayerLobbyConnectionController
#include "GlobalNamespace/MultiplayerLobbyConnectionController.hpp"
// Including type: MultiplayerModeSelectionViewController
#include "GlobalNamespace/MultiplayerModeSelectionViewController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SongPackMaskModelSO
  class SongPackMaskModelSO;
  // Forward declaring type: GameServerBrowserFlowCoordinator
  class GameServerBrowserFlowCoordinator;
  // Forward declaring type: GameServerLobbyFlowCoordinator
  class GameServerLobbyFlowCoordinator;
  // Forward declaring type: CreateServerFormData
  struct CreateServerFormData;
  // Forward declaring type: CreateServerViewController
  class CreateServerViewController;
  // Forward declaring type: JoinQuickPlayViewController
  class JoinQuickPlayViewController;
  // Forward declaring type: ServerCodeEntryViewController
  class ServerCodeEntryViewController;
  // Forward declaring type: SimpleDialogPromptViewController
  class SimpleDialogPromptViewController;
  // Forward declaring type: JoiningLobbyViewController
  class JoiningLobbyViewController;
  // Skipping declaration: IUnifiedNetworkPlayerModel because it is already included!
  // Forward declaring type: AvatarDataModel
  class AvatarDataModel;
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: FadeInOutController
  class FadeInOutController;
  // Forward declaring type: LobbyDataModelsManager
  class LobbyDataModelsManager;
  // Skipping declaration: ConnectionFailedReason because it is already included!
  // Forward declaring type: IMasterServerAvailabilityModel
  class IMasterServerAvailabilityModel;
  // Forward declaring type: IMasterServerQuickPlaySetupModel
  class IMasterServerQuickPlaySetupModel;
  // Forward declaring type: PlayerDataModel
  class PlayerDataModel;
  // Forward declaring type: SongPreviewPlayer
  class SongPreviewPlayer;
  // Forward declaring type: IAnalyticsModel
  class IAnalyticsModel;
  // Forward declaring type: ILobbyGameStateController
  class ILobbyGameStateController;
  // Forward declaring type: MasterServerQuickPlaySetupData
  class MasterServerQuickPlaySetupData;
  // Forward declaring type: SelectMultiplayerLobbyDestination
  class SelectMultiplayerLobbyDestination;
  // Skipping declaration: INetworkPlayerModel because it is already included!
  // Forward declaring type: MultiplayerUnavailableReason
  struct MultiplayerUnavailableReason;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: TaskCompletionSource`1<TResult>
  template<typename TResult>
  class TaskCompletionSource_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x188
  #pragma pack(push, 1)
  // Autogenerated type: MultiplayerModeSelectionFlowCoordinator
  // [TokenAttribute] Offset: FFFFFFFF
  class MultiplayerModeSelectionFlowCoordinator : public HMUI::FlowCoordinator {
    public:
    // Nested type: GlobalNamespace::MultiplayerModeSelectionFlowCoordinator::$TryShowModeSelection$d__49
    struct $TryShowModeSelection$d__49;
    // Nested type: GlobalNamespace::MultiplayerModeSelectionFlowCoordinator::$ResolveAndPresentNextFlowCoordinator$d__50
    struct $ResolveAndPresentNextFlowCoordinator$d__50;
    // private UnityEngine.AudioClip _ambienceAudioClip
    // Size: 0x8
    // Offset: 0xA8
    UnityEngine::AudioClip* ambienceAudioClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AudioClip*) == 0x8);
    // private SongPackMaskModelSO _songPackMaskModel
    // Size: 0x8
    // Offset: 0xB0
    GlobalNamespace::SongPackMaskModelSO* songPackMaskModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SongPackMaskModelSO*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CE2C
    // private readonly GameServerBrowserFlowCoordinator _gameServerBrowserFlowCoordinator
    // Size: 0x8
    // Offset: 0xB8
    GlobalNamespace::GameServerBrowserFlowCoordinator* gameServerBrowserFlowCoordinator;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameServerBrowserFlowCoordinator*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CE3C
    // private readonly GameServerLobbyFlowCoordinator _gameServerLobbyFlowCoordinator
    // Size: 0x8
    // Offset: 0xC0
    GlobalNamespace::GameServerLobbyFlowCoordinator* gameServerLobbyFlowCoordinator;
    // Field size check
    static_assert(sizeof(GlobalNamespace::GameServerLobbyFlowCoordinator*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CE4C
    // private readonly MultiplayerModeSelectionViewController _multiplayerModeSelectionViewController
    // Size: 0x8
    // Offset: 0xC8
    GlobalNamespace::MultiplayerModeSelectionViewController* multiplayerModeSelectionViewController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerModeSelectionViewController*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CE5C
    // private readonly CreateServerViewController _createServerViewController
    // Size: 0x8
    // Offset: 0xD0
    GlobalNamespace::CreateServerViewController* createServerViewController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::CreateServerViewController*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CE6C
    // private readonly JoinQuickPlayViewController _joinQuickPlayViewController
    // Size: 0x8
    // Offset: 0xD8
    GlobalNamespace::JoinQuickPlayViewController* joinQuickPlayViewController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::JoinQuickPlayViewController*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CE7C
    // private readonly ServerCodeEntryViewController _serverCodeEntryViewController
    // Size: 0x8
    // Offset: 0xE0
    GlobalNamespace::ServerCodeEntryViewController* serverCodeEntryViewController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ServerCodeEntryViewController*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CE8C
    // private readonly SimpleDialogPromptViewController _simpleDialogPromptViewController
    // Size: 0x8
    // Offset: 0xE8
    GlobalNamespace::SimpleDialogPromptViewController* simpleDialogPromptViewController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SimpleDialogPromptViewController*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CE9C
    // private readonly JoiningLobbyViewController _joiningLobbyViewController
    // Size: 0x8
    // Offset: 0xF0
    GlobalNamespace::JoiningLobbyViewController* joiningLobbyViewController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::JoiningLobbyViewController*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CEAC
    // private readonly IUnifiedNetworkPlayerModel _unifiedNetworkPlayerModel
    // Size: 0x8
    // Offset: 0xF8
    GlobalNamespace::IUnifiedNetworkPlayerModel* unifiedNetworkPlayerModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IUnifiedNetworkPlayerModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CEBC
    // private readonly AvatarDataModel _avatarDataModel
    // Size: 0x8
    // Offset: 0x100
    GlobalNamespace::AvatarDataModel* avatarDataModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::AvatarDataModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CECC
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Size: 0x8
    // Offset: 0x108
    GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IMultiplayerSessionManager*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CEDC
    // private readonly FadeInOutController _fadeInOutController
    // Size: 0x8
    // Offset: 0x110
    GlobalNamespace::FadeInOutController* fadeInOutController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FadeInOutController*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CEEC
    // private readonly LobbyDataModelsManager _lobbyDataModelsManager
    // Size: 0x8
    // Offset: 0x118
    GlobalNamespace::LobbyDataModelsManager* lobbyDataModelsManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LobbyDataModelsManager*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CEFC
    // private readonly MultiplayerLobbyConnectionController _multiplayerLobbyConnectionController
    // Size: 0x8
    // Offset: 0x120
    GlobalNamespace::MultiplayerLobbyConnectionController* multiplayerLobbyConnectionController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerLobbyConnectionController*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CF0C
    // private readonly IMasterServerAvailabilityModel _masterServerAvailabilityModel
    // Size: 0x8
    // Offset: 0x128
    GlobalNamespace::IMasterServerAvailabilityModel* masterServerAvailabilityModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IMasterServerAvailabilityModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CF1C
    // private readonly IMasterServerQuickPlaySetupModel _masterServerQuickPlaySetupModel
    // Size: 0x8
    // Offset: 0x130
    GlobalNamespace::IMasterServerQuickPlaySetupModel* masterServerQuickPlaySetupModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IMasterServerQuickPlaySetupModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CF2C
    // private readonly PlayerDataModel _playerDataModel
    // Size: 0x8
    // Offset: 0x138
    GlobalNamespace::PlayerDataModel* playerDataModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::PlayerDataModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CF3C
    // private readonly SongPreviewPlayer _songPreviewPlayer
    // Size: 0x8
    // Offset: 0x140
    GlobalNamespace::SongPreviewPlayer* songPreviewPlayer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SongPreviewPlayer*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CF4C
    // private readonly IAnalyticsModel _analyticsModel
    // Size: 0x8
    // Offset: 0x148
    GlobalNamespace::IAnalyticsModel* analyticsModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IAnalyticsModel*) == 0x8);
    // [InjectAttribute] Offset: 0xE0CF5C
    // private readonly ILobbyGameStateController _lobbyGameStateController
    // Size: 0x8
    // Offset: 0x150
    GlobalNamespace::ILobbyGameStateController* lobbyGameStateController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ILobbyGameStateController*) == 0x8);
    // private System.Action`1<MultiplayerModeSelectionFlowCoordinator> didFinishEvent
    // Size: 0x8
    // Offset: 0x158
    System::Action_1<GlobalNamespace::MultiplayerModeSelectionFlowCoordinator*>* didFinishEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::MultiplayerModeSelectionFlowCoordinator*>*) == 0x8);
    // private System.Threading.CancellationTokenSource _joiningLobbyCancellationTokenSource
    // Size: 0x8
    // Offset: 0x160
    System::Threading::CancellationTokenSource* joiningLobbyCancellationTokenSource;
    // Field size check
    static_assert(sizeof(System::Threading::CancellationTokenSource*) == 0x8);
    // private System.Threading.CancellationTokenSource _cancellationTokenSource
    // Size: 0x8
    // Offset: 0x168
    System::Threading::CancellationTokenSource* cancellationTokenSource;
    // Field size check
    static_assert(sizeof(System::Threading::CancellationTokenSource*) == 0x8);
    // private System.Threading.Tasks.TaskCompletionSource`1<System.Boolean> _transitionFinishedTaskSource
    // Size: 0x8
    // Offset: 0x170
    System::Threading::Tasks::TaskCompletionSource_1<bool>* transitionFinishedTaskSource;
    // Field size check
    static_assert(sizeof(System::Threading::Tasks::TaskCompletionSource_1<bool>*) == 0x8);
    // private MasterServerQuickPlaySetupData _masterServerQuickPlaySetupData
    // Size: 0x8
    // Offset: 0x178
    GlobalNamespace::MasterServerQuickPlaySetupData* masterServerQuickPlaySetupData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MasterServerQuickPlaySetupData*) == 0x8);
    // private SelectMultiplayerLobbyDestination _lobbyDestination
    // Size: 0x8
    // Offset: 0x180
    GlobalNamespace::SelectMultiplayerLobbyDestination* lobbyDestination;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SelectMultiplayerLobbyDestination*) == 0x8);
    // Creating value type constructor for type: MultiplayerModeSelectionFlowCoordinator
