// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerLobbyAvatarManager
  class MultiplayerLobbyAvatarManager;
  // Forward declaring type: MultiplayerLobbyCenterStageManager
  class MultiplayerLobbyCenterStageManager;
  // Forward declaring type: MultiplayerLobbyAvatarPlaceManager
  class MultiplayerLobbyAvatarPlaceManager;
  // Forward declaring type: MenuEnvironmentManager
  class MenuEnvironmentManager;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x41
  #pragma pack(push, 1)
  // Autogenerated type: MultiplayerLobbyController
  // [TokenAttribute] Offset: FFFFFFFF
  class MultiplayerLobbyController : public UnityEngine::MonoBehaviour {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private System.Single _innerCircleRadius
    // Size: 0x4
    // Offset: 0x18
    float innerCircleRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _minOuterCircleRadius
    // Size: 0x4
    // Offset: 0x1C
    float minOuterCircleRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [InjectAttribute] Offset: 0xF0EEE8
    // private readonly MultiplayerLobbyAvatarManager _multiplayerLobbyAvatarManager
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::MultiplayerLobbyAvatarManager* multiplayerLobbyAvatarManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerLobbyAvatarManager*) == 0x8);
    // [InjectAttribute] Offset: 0xF0EEF8
    // private readonly MultiplayerLobbyCenterStageManager _multiplayerLobbyCenterStageManager
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::MultiplayerLobbyCenterStageManager* multiplayerLobbyCenterStageManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerLobbyCenterStageManager*) == 0x8);
    // [InjectAttribute] Offset: 0xF0EF08
    // private readonly MultiplayerLobbyAvatarPlaceManager _multiplayerLobbyAvatarPlaceManager
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::MultiplayerLobbyAvatarPlaceManager* multiplayerLobbyAvatarPlaceManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerLobbyAvatarPlaceManager*) == 0x8);
    // [InjectAttribute] Offset: 0xF0EF18
    // private readonly MenuEnvironmentManager _menuEnvironmentManager
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::MenuEnvironmentManager* menuEnvironmentManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MenuEnvironmentManager*) == 0x8);
    // private System.Boolean <lobbyActivated>k__BackingField
    // Size: 0x1
    // Offset: 0x40
    bool lobbyActivated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Single _innerCircleRadius
    float& dyn__innerCircleRadius();
    // Get instance field reference: private System.Single _minOuterCircleRadius
    float& dyn__minOuterCircleRadius();
    // Get instance field reference: private readonly MultiplayerLobbyAvatarManager _multiplayerLobbyAvatarManager
    GlobalNamespace::MultiplayerLobbyAvatarManager*& dyn__multiplayerLobbyAvatarManager();
    // Get instance field reference: private readonly MultiplayerLobbyCenterStageManager _multiplayerLobbyCenterStageManager
    GlobalNamespace::MultiplayerLobbyCenterStageManager*& dyn__multiplayerLobbyCenterStageManager();
    // Get instance field reference: private readonly MultiplayerLobbyAvatarPlaceManager _multiplayerLobbyAvatarPlaceManager
    GlobalNamespace::MultiplayerLobbyAvatarPlaceManager*& dyn__multiplayerLobbyAvatarPlaceManager();
    // Get instance field reference: private readonly MenuEnvironmentManager _menuEnvironmentManager
    GlobalNamespace::MenuEnvironmentManager*& dyn__menuEnvironmentManager();
    // Get instance field reference: private System.Boolean <lobbyActivated>k__BackingField
    bool& dyn_$lobbyActivated$k__BackingField();
    // public System.Boolean get_lobbyActivated()
    // Offset: 0x11C57C0
    bool get_lobbyActivated();
    // private System.Void set_lobbyActivated(System.Boolean value)
    // Offset: 0x11C57C8
    void set_lobbyActivated(bool value);
    // public System.Void ActivateMultiplayerLobby()
    // Offset: 0x11C57D4
    void ActivateMultiplayerLobby();
    // public System.Void DeactivateMultiplayerLobby()
    // Offset: 0x11C5870
    void DeactivateMultiplayerLobby();
    // public System.Void .ctor()
    // Offset: 0x11C58E4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MultiplayerLobbyController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MultiplayerLobbyController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MultiplayerLobbyController*, creationType>()));
    }
  }; // MultiplayerLobbyController
  #pragma pack(pop)
  static check_size<sizeof(MultiplayerLobbyController), 64 + sizeof(bool)> __GlobalNamespace_MultiplayerLobbyControllerSizeCheck;
  static_assert(sizeof(MultiplayerLobbyController) == 0x41);
}
NEED_NO_BOX(GlobalNamespace::MultiplayerLobbyController);
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerLobbyController*, "", "MultiplayerLobbyController");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerLobbyController::get_lobbyActivated
// Il2CppName: get_lobbyActivated
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (GlobalNamespace::MultiplayerLobbyController::*)()>(&GlobalNamespace::MultiplayerLobbyController::get_lobbyActivated)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerLobbyController*), "get_lobbyActivated", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerLobbyController::set_lobbyActivated
// Il2CppName: set_lobbyActivated
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::MultiplayerLobbyController::*)(bool)>(&GlobalNamespace::MultiplayerLobbyController::set_lobbyActivated)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerLobbyController*), "set_lobbyActivated", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerLobbyController::ActivateMultiplayerLobby
// Il2CppName: ActivateMultiplayerLobby
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::MultiplayerLobbyController::*)()>(&GlobalNamespace::MultiplayerLobbyController::ActivateMultiplayerLobby)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerLobbyController*), "ActivateMultiplayerLobby", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerLobbyController::DeactivateMultiplayerLobby
// Il2CppName: DeactivateMultiplayerLobby
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::MultiplayerLobbyController::*)()>(&GlobalNamespace::MultiplayerLobbyController::DeactivateMultiplayerLobby)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::MultiplayerLobbyController*), "DeactivateMultiplayerLobby", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::MultiplayerLobbyController::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
