// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameSongController
  class GameSongController;
  // Forward declaring type: IGameplayRpcManager
  class IGameplayRpcManager;
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: IMultiplayerLevelEndActionsListener
  class IMultiplayerLevelEndActionsListener;
  // Forward declaring type: PrepareLevelCompletionResults
  class PrepareLevelCompletionResults;
  // Forward declaring type: GameEnergyCounter
  class GameEnergyCounter;
  // Forward declaring type: MultiplayerLocalActivePlayerInGameMenuController
  class MultiplayerLocalActivePlayerInGameMenuController;
  // Forward declaring type: IVRPlatformHelper
  class IVRPlatformHelper;
  // Forward declaring type: MultiplayerLocalPlayerDisconnectHelper
  class MultiplayerLocalPlayerDisconnectHelper;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerLocalActivePlayerGameplayManager
  class MultiplayerLocalActivePlayerGameplayManager : public UnityEngine::MonoBehaviour {
    public:
    // private readonly GameSongController _gameSongController
    // Offset: 0x18
    GlobalNamespace::GameSongController* gameSongController;
    // private readonly IGameplayRpcManager _gameplayRpcManager
    // Offset: 0x20
    GlobalNamespace::IGameplayRpcManager* gameplayRpcManager;
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Offset: 0x28
    GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // private readonly IMultiplayerLevelEndActionsListener _multiplayerLevelEndActions
    // Offset: 0x30
    GlobalNamespace::IMultiplayerLevelEndActionsListener* multiplayerLevelEndActions;
    // private readonly PrepareLevelCompletionResults _prepareLevelCompletionResults
    // Offset: 0x38
    GlobalNamespace::PrepareLevelCompletionResults* prepareLevelCompletionResults;
    // private readonly GameEnergyCounter _gameEnergyCounter
    // Offset: 0x40
    GlobalNamespace::GameEnergyCounter* gameEnergyCounter;
    // private readonly MultiplayerLocalActivePlayerInGameMenuController _inGameMenuController
    // Offset: 0x48
    GlobalNamespace::MultiplayerLocalActivePlayerInGameMenuController* inGameMenuController;
    // private readonly IVRPlatformHelper _platformHelper
    // Offset: 0x50
    GlobalNamespace::IVRPlatformHelper* platformHelper;
    // private readonly MultiplayerLocalPlayerDisconnectHelper _disconnectHelper
    // Offset: 0x58
    GlobalNamespace::MultiplayerLocalPlayerDisconnectHelper* disconnectHelper;
    // private System.Boolean _levelFinishedOrFailed
    // Offset: 0x60
    bool levelFinishedOrFailed;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // private System.Void Start()
    // Offset: 0xF6DBF4
    void Start();
    // protected System.Void OnDisable()
    // Offset: 0xF6E054
    void OnDisable();
    // private System.Void PerformPlayerFail()
    // Offset: 0xF6E57C
    void PerformPlayerFail();
    // private System.Void HandleGameEnergyDidReach0()
    // Offset: 0xF6E77C
    void HandleGameEnergyDidReach0();
    // private System.Void HandleInGameMenuControllerDidGiveUp()
    // Offset: 0xF6E780
    void HandleInGameMenuControllerDidGiveUp();
    // private System.Void HandleInGameMenuControllerRequestsDisconnect()
    // Offset: 0xF6E784
    void HandleInGameMenuControllerRequestsDisconnect();
    // private System.Void HandleSongDidFinish()
    // Offset: 0xF6E9B4
    void HandleSongDidFinish();
    // private System.Void HandleLevelEndedEarly(System.String userId)
    // Offset: 0xF6EBB4
    void HandleLevelEndedEarly(::Il2CppString* userId);
    // private System.Void HandleHmdUnmounted()
    // Offset: 0xF6EBB8
    void HandleHmdUnmounted();
    // private System.Void HandleInputFocusWasCaptured()
    // Offset: 0xF6EBBC
    void HandleInputFocusWasCaptured();
    // private System.Void OnApplicationFocus(System.Boolean hasFocus)
    // Offset: 0xF6EBC0
    void OnApplicationFocus(bool hasFocus);
    // public System.Void .ctor()
    // Offset: 0xF6EBCC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MultiplayerLocalActivePlayerGameplayManager* New_ctor();
  }; // MultiplayerLocalActivePlayerGameplayManager
  check_size<sizeof(MultiplayerLocalActivePlayerGameplayManager), 96 + sizeof(bool) + ((96 + sizeof(bool)) % 8 != 0 ? (8 - (96 + sizeof(bool)) % 8) : 0)> __GlobalNamespace_MultiplayerLocalActivePlayerGameplayManagerSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerLocalActivePlayerGameplayManager*, "", "MultiplayerLocalActivePlayerGameplayManager");
#pragma pack(pop)
