// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: MultiplayerPlayerStartState
#include "GlobalNamespace/MultiplayerPlayerStartState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerResultsData
  class MultiplayerResultsData;
  // Forward declaring type: MultiplayerLevelScenesTransitionSetupDataSO
  class MultiplayerLevelScenesTransitionSetupDataSO;
  // Forward declaring type: GameScenesManager
  class GameScenesManager;
  // Forward declaring type: MultiplayerPlayersManager
  class MultiplayerPlayersManager;
  // Forward declaring type: SceneStartSyncController
  class SceneStartSyncController;
  // Forward declaring type: SongStartSyncController
  class SongStartSyncController;
  // Forward declaring type: MultiplayerLevelFinishedController
  class MultiplayerLevelFinishedController;
  // Forward declaring type: FadeInOutController
  class FadeInOutController;
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: MultiplayerIntroAnimationController
  class MultiplayerIntroAnimationController;
  // Forward declaring type: MultiplayerOutroAnimationController
  class MultiplayerOutroAnimationController;
  // Forward declaring type: IMenuRpcManager
  class IMenuRpcManager;
  // Forward declaring type: IGameplayRpcManager
  class IGameplayRpcManager;
  // Forward declaring type: GameplayCoreSceneSetupData
  class GameplayCoreSceneSetupData;
  // Forward declaring type: MultiplayerBadgesProvider
  class MultiplayerBadgesProvider;
  // Forward declaring type: PlayersSpecificSettingsAtGameStartModel
  class PlayersSpecificSettingsAtGameStartModel;
  // Skipping declaration: State because it is already included!
  // Forward declaring type: MultiplayerGameState
  struct MultiplayerGameState;
  // Forward declaring type: MultiplayerLevelCompletionResults
  class MultiplayerLevelCompletionResults;
  // Forward declaring type: DisconnectedReason
  struct DisconnectedReason;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: DiContainer
  class DiContainer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerController
  class MultiplayerController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MultiplayerController);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MultiplayerController*, "", "MultiplayerController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: MultiplayerController
  // [TokenAttribute] Offset: FFFFFFFF
  class MultiplayerController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::MultiplayerController::State
    struct State;
    // Nested type: ::GlobalNamespace::MultiplayerController::$PerformSongStartSync$d__37
    class $PerformSongStartSync$d__37;
    // Nested type: ::GlobalNamespace::MultiplayerController::$$c__DisplayClass42_0
    class $$c__DisplayClass42_0;
    // Nested type: ::GlobalNamespace::MultiplayerController::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MultiplayerController/State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MultiplayerController/State CheckingLobbyState
      static constexpr const int CheckingLobbyState = 0;
      // Get static field: static public MultiplayerController/State CheckingLobbyState
      static ::GlobalNamespace::MultiplayerController::State _get_CheckingLobbyState();
      // Set static field: static public MultiplayerController/State CheckingLobbyState
      static void _set_CheckingLobbyState(::GlobalNamespace::MultiplayerController::State value);
      // static field const value: static public MultiplayerController/State WaitingForPlayers
      static constexpr const int WaitingForPlayers = 1;
      // Get static field: static public MultiplayerController/State WaitingForPlayers
      static ::GlobalNamespace::MultiplayerController::State _get_WaitingForPlayers();
      // Set static field: static public MultiplayerController/State WaitingForPlayers
      static void _set_WaitingForPlayers(::GlobalNamespace::MultiplayerController::State value);
      // static field const value: static public MultiplayerController/State SongStartSync
      static constexpr const int SongStartSync = 2;
      // Get static field: static public MultiplayerController/State SongStartSync
      static ::GlobalNamespace::MultiplayerController::State _get_SongStartSync();
      // Set static field: static public MultiplayerController/State SongStartSync
      static void _set_SongStartSync(::GlobalNamespace::MultiplayerController::State value);
      // static field const value: static public MultiplayerController/State Intro
      static constexpr const int Intro = 3;
      // Get static field: static public MultiplayerController/State Intro
      static ::GlobalNamespace::MultiplayerController::State _get_Intro();
      // Set static field: static public MultiplayerController/State Intro
      static void _set_Intro(::GlobalNamespace::MultiplayerController::State value);
      // static field const value: static public MultiplayerController/State Gameplay
      static constexpr const int Gameplay = 4;
      // Get static field: static public MultiplayerController/State Gameplay
      static ::GlobalNamespace::MultiplayerController::State _get_Gameplay();
      // Set static field: static public MultiplayerController/State Gameplay
      static void _set_Gameplay(::GlobalNamespace::MultiplayerController::State value);
      // static field const value: static public MultiplayerController/State Outro
      static constexpr const int Outro = 5;
      // Get static field: static public MultiplayerController/State Outro
      static ::GlobalNamespace::MultiplayerController::State _get_Outro();
      // Set static field: static public MultiplayerController/State Outro
      static void _set_Outro(::GlobalNamespace::MultiplayerController::State value);
      // static field const value: static public MultiplayerController/State Finished
      static constexpr const int Finished = 6;
      // Get static field: static public MultiplayerController/State Finished
      static ::GlobalNamespace::MultiplayerController::State _get_Finished();
      // Set static field: static public MultiplayerController/State Finished
      static void _set_Finished(::GlobalNamespace::MultiplayerController::State value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MultiplayerController/State
    #pragma pack(pop)
    static check_size<sizeof(MultiplayerController::State), 0 + sizeof(int)> __GlobalNamespace_MultiplayerController_StateSizeCheck;
    static_assert(sizeof(MultiplayerController::State) == 0x4);
    public:
    // private UnityEngine.GameObject _loadingEnvironment
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* loadingEnvironment;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [SpaceAttribute] Offset: 0x10DBF1C
    // private MultiplayerLevelScenesTransitionSetupDataSO _multiplayerLevelSceneSetupData
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::MultiplayerLevelScenesTransitionSetupDataSO* multiplayerLevelSceneSetupData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerLevelScenesTransitionSetupDataSO*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBF54
    // private readonly GameScenesManager _gameScenesManager
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::GameScenesManager* gameScenesManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameScenesManager*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBF64
    // private readonly MultiplayerPlayersManager _playersManager
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::MultiplayerPlayersManager* playersManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerPlayersManager*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBF74
    // private readonly SceneStartSyncController _sceneStartSyncController
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::SceneStartSyncController* sceneStartSyncController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SceneStartSyncController*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBF84
    // private readonly SongStartSyncController _songStartSyncController
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::SongStartSyncController* songStartSyncController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SongStartSyncController*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBF94
    // private readonly MultiplayerLevelFinishedController _multiplayerLevelFinishedController
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::MultiplayerLevelFinishedController* multiplayerLevelFinishedController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerLevelFinishedController*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBFA4
    // private readonly FadeInOutController _fadeInOutController
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::FadeInOutController* fadeInOutController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FadeInOutController*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBFB4
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IMultiplayerSessionManager*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBFC4
    // private readonly MultiplayerIntroAnimationController _introAnimationController
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::MultiplayerIntroAnimationController* introAnimationController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerIntroAnimationController*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBFD4
    // private readonly MultiplayerOutroAnimationController _outroAnimationController
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::MultiplayerOutroAnimationController* outroAnimationController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerOutroAnimationController*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBFE4
    // private readonly IMenuRpcManager _menuRpcManager
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::IMenuRpcManager* menuRpcManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IMenuRpcManager*) == 0x8);
    // [InjectAttribute] Offset: 0x10DBFF4
    // private readonly IGameplayRpcManager _gameplayRpcManager
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::IGameplayRpcManager* gameplayRpcManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IGameplayRpcManager*) == 0x8);
    // [InjectAttribute] Offset: 0x10DC004
    // private readonly GameplayCoreSceneSetupData _sceneSetupData
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::GameplayCoreSceneSetupData* sceneSetupData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameplayCoreSceneSetupData*) == 0x8);
    // [InjectAttribute] Offset: 0x10DC014
    // private readonly Zenject.DiContainer _diContainer
    // Size: 0x8
    // Offset: 0x88
    ::Zenject::DiContainer* diContainer;
    // Field size check
    static_assert(sizeof(::Zenject::DiContainer*) == 0x8);
    // [InjectAttribute] Offset: 0x10DC024
    // private readonly MultiplayerBadgesProvider _badgesProvider
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::MultiplayerBadgesProvider* badgesProvider;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerBadgesProvider*) == 0x8);
    // private System.Action`1<MultiplayerController/State> stateChangedEvent
    // Size: 0x8
    // Offset: 0x98
    ::System::Action_1<::GlobalNamespace::MultiplayerController::State>* stateChangedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::MultiplayerController::State>*) == 0x8);
    // private System.Single _startTime
    // Size: 0x4
    // Offset: 0xA0
    float startTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private MultiplayerPlayerStartState _localPlayerSyncStartState
    // Size: 0x4
    // Offset: 0xA4
    ::GlobalNamespace::MultiplayerPlayerStartState localPlayerSyncStartState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerPlayerStartState) == 0x4);
    // private MultiplayerController/State _state
    // Size: 0x4
    // Offset: 0xA8
    ::GlobalNamespace::MultiplayerController::State state;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerController::State) == 0x4);
    // Padding between fields: state and: sessionGameId
    char __padding19[0x4] = {};
    // private System.String _sessionGameId
    // Size: 0x8
    // Offset: 0xB0
    ::StringW sessionGameId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MultiplayerResultsData _resultsData
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::MultiplayerResultsData* resultsData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerResultsData*) == 0x8);
    // private PlayersSpecificSettingsAtGameStartModel _playersSpecificSettingsAtGameStartModel
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::PlayersSpecificSettingsAtGameStartModel* playersSpecificSettingsAtGameStartModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayersSpecificSettingsAtGameStartModel*) == 0x8);
    // private UnityEngine.Coroutine _timeoutGetGameStateCoroutine
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Coroutine* timeoutGetGameStateCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single kSongTimeToSongStartSyncTimeOffset
    static constexpr const float kSongTimeToSongStartSyncTimeOffset = -0.6;
    // Get static field: static private System.Single kSongTimeToSongStartSyncTimeOffset
    static float _get_kSongTimeToSongStartSyncTimeOffset();
    // Set static field: static private System.Single kSongTimeToSongStartSyncTimeOffset
    static void _set_kSongTimeToSongStartSyncTimeOffset(float value);
    // static field const value: static private System.Single kMinAnimationDurationPercentage
    static constexpr const float kMinAnimationDurationPercentage = 0.75;
