// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MockPlayer
  class MockPlayer;
  // Forward declaring type: MockServer
  class MockServer;
  // Forward declaring type: MasterServerAvailabilityData
  class MasterServerAvailabilityData;
  // Forward declaring type: MasterServerQuickPlaySetupData
  class MasterServerQuickPlaySetupData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: MultiplayerMockSettings
  // [] Offset: FFFFFFFF
  class MultiplayerMockSettings : public UnityEngine::ScriptableObject {
    public:
    // Nested type: GlobalNamespace::MultiplayerMockSettings::$get_mockServers$d__26
    class $get_mockServers$d__26;
    // private System.Boolean _isEnabled
    // Size: 0x1
    // Offset: 0x18
    bool isEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isEnabled and: otherPlayers
    char __padding0[0x7] = {};
    // [FormerlySerializedAsAttribute] Offset: 0xD275E4
    // private System.Collections.Generic.List`1<MockPlayer> _otherPlayers
    // Size: 0x8
    // Offset: 0x20
    System::Collections::Generic::List_1<GlobalNamespace::MockPlayer*>* otherPlayers;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::MockPlayer*>*) == 0x8);
    // private MockPlayer _localPlayer
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::MockPlayer* localPlayer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MockPlayer*) == 0x8);
    // private MockServer _mockServer
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::MockServer* mockServer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MockServer*) == 0x8);
    // private System.Single _scoreGainAmount
    // Size: 0x4
    // Offset: 0x38
    float scoreGainAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _scoreGainRepeatInterval
    // Size: 0x4
    // Offset: 0x3C
    float scoreGainRepeatInterval;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _scoreStartDelay
    // Size: 0x4
    // Offset: 0x40
    float scoreStartDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: scoreStartDelay and: masterServerAvailabilityData
    char __padding6[0x4] = {};
    // private MasterServerAvailabilityData _masterServerAvailabilityData
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::MasterServerAvailabilityData* masterServerAvailabilityData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MasterServerAvailabilityData*) == 0x8);
    // private MasterServerQuickPlaySetupData _masterServerQuickPlaySetupData
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::MasterServerQuickPlaySetupData* masterServerQuickPlaySetupData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MasterServerQuickPlaySetupData*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD276A0
    // private System.Action partyCreatedEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action* partyCreatedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD276B0
    // private System.Action`1<MockPlayer> playerDidConnectEvent
    // Size: 0x8
    // Offset: 0x60
    System::Action_1<GlobalNamespace::MockPlayer*>* playerDidConnectEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::MockPlayer*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD276C0
    // private System.Action`1<MockPlayer> playerDidDisconnectEvent
    // Size: 0x8
    // Offset: 0x68
    System::Action_1<GlobalNamespace::MockPlayer*>* playerDidDisconnectEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::MockPlayer*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD276D0
    // private System.Action`1<MockPlayer> playerStateChangedEvent
    // Size: 0x8
    // Offset: 0x70
    System::Action_1<GlobalNamespace::MockPlayer*>* playerStateChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::MockPlayer*>*) == 0x8);
    // Creating value type constructor for type: MultiplayerMockSettings
    MultiplayerMockSettings(bool isEnabled_ = {}, System::Collections::Generic::List_1<GlobalNamespace::MockPlayer*>* otherPlayers_ = {}, GlobalNamespace::MockPlayer* localPlayer_ = {}, GlobalNamespace::MockServer* mockServer_ = {}, float scoreGainAmount_ = {}, float scoreGainRepeatInterval_ = {}, float scoreStartDelay_ = {}, GlobalNamespace::MasterServerAvailabilityData* masterServerAvailabilityData_ = {}, GlobalNamespace::MasterServerQuickPlaySetupData* masterServerQuickPlaySetupData_ = {}, System::Action* partyCreatedEvent_ = {}, System::Action_1<GlobalNamespace::MockPlayer*>* playerDidConnectEvent_ = {}, System::Action_1<GlobalNamespace::MockPlayer*>* playerDidDisconnectEvent_ = {}, System::Action_1<GlobalNamespace::MockPlayer*>* playerStateChangedEvent_ = {}) noexcept : isEnabled{isEnabled_}, otherPlayers{otherPlayers_}, localPlayer{localPlayer_}, mockServer{mockServer_}, scoreGainAmount{scoreGainAmount_}, scoreGainRepeatInterval{scoreGainRepeatInterval_}, scoreStartDelay{scoreStartDelay_}, masterServerAvailabilityData{masterServerAvailabilityData_}, masterServerQuickPlaySetupData{masterServerQuickPlaySetupData_}, partyCreatedEvent{partyCreatedEvent_}, playerDidConnectEvent{playerDidConnectEvent_}, playerDidDisconnectEvent{playerDidDisconnectEvent_}, playerStateChangedEvent{playerStateChangedEvent_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public MockPlayer get_localPlayer()
    // Offset: 0xF52890
    GlobalNamespace::MockPlayer* get_localPlayer();
    // public System.Single get_scoreGainAmount()
    // Offset: 0xF5296C
    float get_scoreGainAmount();
    // public System.Single get_scoreGainRepeatInterval()
    // Offset: 0xF52974
    float get_scoreGainRepeatInterval();
    // public System.Single get_scoreStartDelay()
    // Offset: 0xF5297C
    float get_scoreStartDelay();
    // public MasterServerAvailabilityData get_masterServerAvailabilityData()
    // Offset: 0xF52984
    GlobalNamespace::MasterServerAvailabilityData* get_masterServerAvailabilityData();
    // public System.Void set_masterServerAvailabilityData(MasterServerAvailabilityData value)
    // Offset: 0xF5298C
    void set_masterServerAvailabilityData(GlobalNamespace::MasterServerAvailabilityData* value);
    // public MasterServerQuickPlaySetupData get_masterServerQuickPlaySetupData()
    // Offset: 0xF52994
    GlobalNamespace::MasterServerQuickPlaySetupData* get_masterServerQuickPlaySetupData();
    // public System.Void set_masterServerQuickPlaySetupData(MasterServerQuickPlaySetupData value)
    // Offset: 0xF5299C
    void set_masterServerQuickPlaySetupData(GlobalNamespace::MasterServerQuickPlaySetupData* value);
    // public System.Collections.Generic.List`1<MockPlayer> get_otherPlayers()
    // Offset: 0xF529A4
    System::Collections::Generic::List_1<GlobalNamespace::MockPlayer*>* get_otherPlayers();
    // public System.Collections.Generic.IEnumerable`1<MockServer> get_mockServers()
    // Offset: 0xF529AC
    System::Collections::Generic::IEnumerable_1<GlobalNamespace::MockServer*>* get_mockServers();
    // public MockServer get_mockServer()
    // Offset: 0xF52A64
    GlobalNamespace::MockServer* get_mockServer();
    // public System.Void add_partyCreatedEvent(System.Action value)
    // Offset: 0xF52A6C
    void add_partyCreatedEvent(System::Action* value);
    // public System.Void remove_partyCreatedEvent(System.Action value)
    // Offset: 0xF52B10
    void remove_partyCreatedEvent(System::Action* value);
    // public System.Void add_playerDidConnectEvent(System.Action`1<MockPlayer> value)
    // Offset: 0xF52BB4
    void add_playerDidConnectEvent(System::Action_1<GlobalNamespace::MockPlayer*>* value);
    // public System.Void remove_playerDidConnectEvent(System.Action`1<MockPlayer> value)
    // Offset: 0xF52C58
    void remove_playerDidConnectEvent(System::Action_1<GlobalNamespace::MockPlayer*>* value);
    // public System.Void add_playerDidDisconnectEvent(System.Action`1<MockPlayer> value)
    // Offset: 0xF52CFC
    void add_playerDidDisconnectEvent(System::Action_1<GlobalNamespace::MockPlayer*>* value);
    // public System.Void remove_playerDidDisconnectEvent(System.Action`1<MockPlayer> value)
    // Offset: 0xF52DA0
    void remove_playerDidDisconnectEvent(System::Action_1<GlobalNamespace::MockPlayer*>* value);
    // public System.Void add_playerStateChangedEvent(System.Action`1<MockPlayer> value)
    // Offset: 0xF52E44
    void add_playerStateChangedEvent(System::Action_1<GlobalNamespace::MockPlayer*>* value);
    // public System.Void remove_playerStateChangedEvent(System.Action`1<MockPlayer> value)
    // Offset: 0xF52EE8
    void remove_playerStateChangedEvent(System::Action_1<GlobalNamespace::MockPlayer*>* value);
    // public System.Boolean get_isEnabled()
    // Offset: 0xF52F8C
    bool get_isEnabled();
    // public System.Void set_isEnabled(System.Boolean value)
    // Offset: 0xF52F94
    void set_isEnabled(bool value);
    // public System.Void CreateParty()
    // Offset: 0xF52FA0
    void CreateParty();
    // public System.Void ConnectPlayer(MockPlayer player)
    // Offset: 0xF52FB4
    void ConnectPlayer(GlobalNamespace::MockPlayer* player);
    // public System.Void DisconnectPlayer(MockPlayer player)
    // Offset: 0xF53048
    void DisconnectPlayer(GlobalNamespace::MockPlayer* player);
    // public System.Void ReportPlayerStateChanged(MockPlayer player)
    // Offset: 0xF530E0
    void ReportPlayerStateChanged(GlobalNamespace::MockPlayer* player);
    // public System.Void FailPlayer(MockPlayer player)
    // Offset: 0xF53154
    void FailPlayer(GlobalNamespace::MockPlayer* player);
    // static public MultiplayerMockSettings SharedSettings()
    // Offset: 0xF53194
    static GlobalNamespace::MultiplayerMockSettings* SharedSettings();
    // public System.Void .ctor()
    // Offset: 0xF5319C
    // Implemented from: UnityEngine.ScriptableObject
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MultiplayerMockSettings* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MultiplayerMockSettings::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MultiplayerMockSettings*, creationType>()));
    }
  }; // MultiplayerMockSettings
  #pragma pack(pop)
  static check_size<sizeof(MultiplayerMockSettings), 112 + sizeof(System::Action_1<GlobalNamespace::MockPlayer*>*)> __GlobalNamespace_MultiplayerMockSettingsSizeCheck;
  static_assert(sizeof(MultiplayerMockSettings) == 0x78);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerMockSettings*, "", "MultiplayerMockSettings");
