// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerLeaderboardPanelItem
  class MultiplayerLeaderboardPanelItem : public UnityEngine::MonoBehaviour {
    public:
    // private TMPro.TextMeshProUGUI _playerNameText
    // Offset: 0x18
    TMPro::TextMeshProUGUI* playerNameText;
    // private TMPro.TextMeshProUGUI _scoreText
    // Offset: 0x20
    TMPro::TextMeshProUGUI* scoreText;
    // private TMPro.TextMeshProUGUI _positionText
    // Offset: 0x28
    TMPro::TextMeshProUGUI* positionText;
    // private UnityEngine.UI.Image _backgroundImage
    // Offset: 0x30
    UnityEngine::UI::Image* backgroundImage;
    // private UnityEngine.Color _normalPlayerTextColor
    // Offset: 0x38
    UnityEngine::Color normalPlayerTextColor;
    // private UnityEngine.Color _failedPlayerTextColor
    // Offset: 0x48
    UnityEngine::Color failedPlayerTextColor;
    // private UnityEngine.Color _firstPlayerBackgroundColor
    // Offset: 0x58
    UnityEngine::Color firstPlayerBackgroundColor;
    // private UnityEngine.Color _lastPlayerBackgroundColor
    // Offset: 0x68
    UnityEngine::Color lastPlayerBackgroundColor;
    // private System.Int32 _prevPosition
    // Offset: 0x78
    int prevPosition;
    // private System.String _prevPlayerName
    // Offset: 0x80
    ::Il2CppString* prevPlayerName;
    // private System.Int32 _prevScore
    // Offset: 0x88
    int prevScore;
    // private System.Boolean _prevFailed
    // Offset: 0x8C
    bool prevFailed;
    // private System.Int32 _prevNumberOfPlayers
    // Offset: 0x90
    int prevNumberOfPlayers;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void SetData(System.Int32 position, System.String playerName, System.Int32 score, System.Boolean failed, System.Int32 numberOfPlayers)
    // Offset: 0xFB59E0
    void SetData(int position, ::Il2CppString* playerName, int score, bool failed, int numberOfPlayers);
    // public System.Void set_hide(System.Boolean value)
    // Offset: 0xFB5728
    void set_hide(bool value);
    // public System.Void .ctor()
    // Offset: 0xFB5D0C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MultiplayerLeaderboardPanelItem* New_ctor();
  }; // MultiplayerLeaderboardPanelItem
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerLeaderboardPanelItem*, "", "MultiplayerLeaderboardPanelItem");
#pragma pack(pop)
