// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: StandaloneMonobehavior
#include "GlobalNamespace/StandaloneMonobehavior.hpp"
// Including type: IMultiplayerSessionManager
#include "GlobalNamespace/IMultiplayerSessionManager.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: NetworkPacketSerializer`2<TType, TData>
  template<typename TType, typename TData>
  class NetworkPacketSerializer_2;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: SynchronizedActionQueue
  class SynchronizedActionQueue;
  // Forward declaring type: ConnectedPlayerManager
  class ConnectedPlayerManager;
  // Forward declaring type: INetworkPacketSubSerializer`1<TData>
  template<typename TData>
  class INetworkPacketSubSerializer_1;
  // Forward declaring type: SessionType
  struct MultiplayerSessionManager_SessionType;
  // Forward declaring type: UpdateConnectionStateReason
  struct UpdateConnectionStateReason;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: INetSerializable
  class INetSerializable;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerSessionManager
  class MultiplayerSessionManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MultiplayerSessionManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MultiplayerSessionManager*, "", "MultiplayerSessionManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xB8
  #pragma pack(push, 1)
  // Autogenerated type: MultiplayerSessionManager
  // [TokenAttribute] Offset: FFFFFFFF
  class MultiplayerSessionManager : public ::GlobalNamespace::StandaloneMonobehavior/*, public ::GlobalNamespace::IMultiplayerSessionManager*/ {
    public:
    // Writing base type padding for base size: 0x34 to desired offset: 0x38
    char ___base_padding[0x4] = {};
    // Nested type: ::GlobalNamespace::MultiplayerSessionManager::ConnectionState
    struct ConnectionState;
    // Nested type: ::GlobalNamespace::MultiplayerSessionManager::$$c__DisplayClass96_0
    class $$c__DisplayClass96_0;
    // Nested type: ::GlobalNamespace::MultiplayerSessionManager::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MultiplayerSessionManager/ConnectionState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ConnectionState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ConnectionState
      constexpr ConnectionState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MultiplayerSessionManager/ConnectionState Disconnected
      static constexpr const int Disconnected = 0;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Disconnected
      static ::GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Disconnected();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Disconnected
      static void _set_Disconnected(::GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
      // static field const value: static public MultiplayerSessionManager/ConnectionState Connecting
      static constexpr const int Connecting = 1;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Connecting
      static ::GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Connecting();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Connecting
      static void _set_Connecting(::GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
      // static field const value: static public MultiplayerSessionManager/ConnectionState Connected
      static constexpr const int Connected = 2;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Connected
      static ::GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Connected();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Connected
      static void _set_Connected(::GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
      // static field const value: static public MultiplayerSessionManager/ConnectionState Disconnecting
      static constexpr const int Disconnecting = 3;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Disconnecting
      static ::GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Disconnecting();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Disconnecting
      static void _set_Disconnecting(::GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MultiplayerSessionManager/ConnectionState
    #pragma pack(pop)
    static check_size<sizeof(MultiplayerSessionManager::ConnectionState), 0 + sizeof(int)> __GlobalNamespace_MultiplayerSessionManager_ConnectionStateSizeCheck;
    static_assert(sizeof(MultiplayerSessionManager::ConnectionState) == 0x4);
    public:
    // private readonly NetworkPacketSerializer`2<MultiplayerSessionManager/MessageType,IConnectedPlayer> _packetSerializer
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::NetworkPacketSerializer_2<::GlobalNamespace::MultiplayerSessionManager_MessageType, ::GlobalNamespace::IConnectedPlayer*>* packetSerializer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetworkPacketSerializer_2<::GlobalNamespace::MultiplayerSessionManager_MessageType, ::GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<IConnectedPlayer> _connectedPlayers
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::GlobalNamespace::IConnectedPlayer*>* connectedPlayers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<System.String> _localPlayerState
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::HashSet_1<::StringW>* localPlayerState;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::StringW>*) == 0x8);
    // private readonly SynchronizedActionQueue _synchronizedActionQueue
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::SynchronizedActionQueue* synchronizedActionQueue;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SynchronizedActionQueue*) == 0x8);
    // private System.Int32 _maxPlayerCount
    // Size: 0x4
    // Offset: 0x58
    int maxPlayerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private MultiplayerSessionManager/ConnectionState _connectionState
    // Size: 0x4
    // Offset: 0x5C
    ::GlobalNamespace::MultiplayerSessionManager::ConnectionState connectionState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MultiplayerSessionManager::ConnectionState) == 0x4);
    // private readonly System.Collections.Generic.Queue`1<System.Int32> _freeSortIndices
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::Queue_1<int>* freeSortIndices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<int>*) == 0x8);
    // private System.Action connectedEvent
    // Size: 0x8
    // Offset: 0x68
    ::System::Action* connectedEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<ConnectionFailedReason> connectionFailedEvent
    // Size: 0x8
    // Offset: 0x70
    ::System::Action_1<::GlobalNamespace::ConnectionFailedReason>* connectionFailedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::ConnectionFailedReason>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> playerConnectedEvent
    // Size: 0x8
    // Offset: 0x78
    ::System::Action_1<::GlobalNamespace::IConnectedPlayer*>* playerConnectedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> playerDisconnectedEvent
    // Size: 0x8
    // Offset: 0x80
    ::System::Action_1<::GlobalNamespace::IConnectedPlayer*>* playerDisconnectedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> playerAvatarChangedEvent
    // Size: 0x8
    // Offset: 0x88
    ::System::Action_1<::GlobalNamespace::IConnectedPlayer*>* playerAvatarChangedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> playerStateChangedEvent
    // Size: 0x8
    // Offset: 0x90
    ::System::Action_1<::GlobalNamespace::IConnectedPlayer*>* playerStateChangedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action`1<IConnectedPlayer> connectionOwnerStateChangedEvent
    // Size: 0x8
    // Offset: 0x98
    ::System::Action_1<::GlobalNamespace::IConnectedPlayer*>* connectionOwnerStateChangedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::IConnectedPlayer*>*) == 0x8);
    // private System.Action`1<DisconnectedReason> disconnectedEvent
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_1<::GlobalNamespace::DisconnectedReason>* disconnectedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::DisconnectedReason>*) == 0x8);
    // private IConnectedPlayer <connectionOwner>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::IConnectedPlayer* connectionOwner;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IConnectedPlayer*) == 0x8);
    // private ConnectedPlayerManager _connectedPlayerManager
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::ConnectedPlayerManager* connectedPlayerManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ConnectedPlayerManager*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IMultiplayerSessionManager
    operator ::GlobalNamespace::IMultiplayerSessionManager() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IMultiplayerSessionManager*>(this);
    }
    // Creating interface conversion operator: i_IMultiplayerSessionManager
    inline ::GlobalNamespace::IMultiplayerSessionManager* i_IMultiplayerSessionManager() noexcept {
      return reinterpret_cast<::GlobalNamespace::IMultiplayerSessionManager*>(this);
    }
    // static field const value: static private System.String kMultiplayerSessionState
    static constexpr const char* kMultiplayerSessionState = "multiplayer_session";
