// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: StandaloneMonobehavior
#include "GlobalNamespace/StandaloneMonobehavior.hpp"
// Including type: IMultiplayerSessionManager
#include "GlobalNamespace/IMultiplayerSessionManager.hpp"
// Including type: ConnectionFailedReason
#include "GlobalNamespace/ConnectionFailedReason.hpp"
// Including type: DisconnectedReason
#include "GlobalNamespace/DisconnectedReason.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: NetworkPacketSerializer`2<TType, TData>
  template<typename TType, typename TData>
  class NetworkPacketSerializer_2;
  // Forward declaring type: SynchronizedActionQueue
  class SynchronizedActionQueue;
  // Forward declaring type: ConnectedPlayerManager
  class ConnectedPlayerManager;
  // Forward declaring type: IConnectionManager
  class IConnectionManager;
  // Forward declaring type: IConnectionInitParams`1<T>
  template<typename T>
  class IConnectionInitParams_1;
  // Forward declaring type: UpdateConnectionStateReason
  struct UpdateConnectionStateReason;
  // Skipping declaration: MessageType because it is already included!
  // Forward declaring type: INetworkPacketSubSerializer`1<TData>
  template<typename TData>
  class INetworkPacketSubSerializer_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: INetSerializable
  class INetSerializable;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerSessionManager
  class MultiplayerSessionManager : public GlobalNamespace::StandaloneMonobehavior, public GlobalNamespace::IMultiplayerSessionManager {
    public:
    // Nested type: GlobalNamespace::MultiplayerSessionManager::MessageType
    struct MessageType;
    // Nested type: GlobalNamespace::MultiplayerSessionManager::SessionType
    struct SessionType;
    // Nested type: GlobalNamespace::MultiplayerSessionManager::ConnectionState
    struct ConnectionState;
    // Nested type: GlobalNamespace::MultiplayerSessionManager::$$c__DisplayClass91_0
    class $$c__DisplayClass91_0;
    // Nested type: GlobalNamespace::MultiplayerSessionManager::$$c
    class $$c;
    // Autogenerated type: MultiplayerSessionManager/MessageType
    struct MessageType : public System::Enum {
      public:
      // public System.Byte value__
      // Offset: 0x0
      uint8_t value;
      // Creating value type constructor for type: MessageType
      constexpr MessageType(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public MultiplayerSessionManager/MessageType MenuRpc
      static constexpr const uint8_t MenuRpc = 0u;
      // Get static field: static public MultiplayerSessionManager/MessageType MenuRpc
      static GlobalNamespace::MultiplayerSessionManager::MessageType _get_MenuRpc();
      // Set static field: static public MultiplayerSessionManager/MessageType MenuRpc
      static void _set_MenuRpc(GlobalNamespace::MultiplayerSessionManager::MessageType value);
      // static field const value: static public MultiplayerSessionManager/MessageType GameplayRpc
      static constexpr const uint8_t GameplayRpc = 1u;
      // Get static field: static public MultiplayerSessionManager/MessageType GameplayRpc
      static GlobalNamespace::MultiplayerSessionManager::MessageType _get_GameplayRpc();
      // Set static field: static public MultiplayerSessionManager/MessageType GameplayRpc
      static void _set_GameplayRpc(GlobalNamespace::MultiplayerSessionManager::MessageType value);
      // static field const value: static public MultiplayerSessionManager/MessageType NodePoseSyncState
      static constexpr const uint8_t NodePoseSyncState = 2u;
      // Get static field: static public MultiplayerSessionManager/MessageType NodePoseSyncState
      static GlobalNamespace::MultiplayerSessionManager::MessageType _get_NodePoseSyncState();
      // Set static field: static public MultiplayerSessionManager/MessageType NodePoseSyncState
      static void _set_NodePoseSyncState(GlobalNamespace::MultiplayerSessionManager::MessageType value);
      // static field const value: static public MultiplayerSessionManager/MessageType ScoreSyncState
      static constexpr const uint8_t ScoreSyncState = 3u;
      // Get static field: static public MultiplayerSessionManager/MessageType ScoreSyncState
      static GlobalNamespace::MultiplayerSessionManager::MessageType _get_ScoreSyncState();
      // Set static field: static public MultiplayerSessionManager/MessageType ScoreSyncState
      static void _set_ScoreSyncState(GlobalNamespace::MultiplayerSessionManager::MessageType value);
    }; // MultiplayerSessionManager/MessageType
    // Autogenerated type: MultiplayerSessionManager/ConnectionState
    struct ConnectionState : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: ConnectionState
      constexpr ConnectionState(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MultiplayerSessionManager/ConnectionState Disconnected
      static constexpr const int Disconnected = 0;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Disconnected
      static GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Disconnected();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Disconnected
      static void _set_Disconnected(GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
      // static field const value: static public MultiplayerSessionManager/ConnectionState Connecting
      static constexpr const int Connecting = 1;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Connecting
      static GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Connecting();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Connecting
      static void _set_Connecting(GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
      // static field const value: static public MultiplayerSessionManager/ConnectionState Connected
      static constexpr const int Connected = 2;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Connected
      static GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Connected();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Connected
      static void _set_Connected(GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
    }; // MultiplayerSessionManager/ConnectionState
    // private readonly NetworkPacketSerializer`2<MultiplayerSessionManager/MessageType,IConnectedPlayer> _packetSerializer
    // Offset: 0x20
    GlobalNamespace::NetworkPacketSerializer_2<GlobalNamespace::MultiplayerSessionManager::MessageType, GlobalNamespace::IConnectedPlayer*>* packetSerializer;
    // private readonly System.Collections.Generic.List`1<IConnectedPlayer> _connectedPlayers
    // Offset: 0x28
    System::Collections::Generic::List_1<GlobalNamespace::IConnectedPlayer*>* connectedPlayers;
    // private readonly System.Collections.Generic.HashSet`1<System.String> _localPlayerState
    // Offset: 0x30
    System::Collections::Generic::HashSet_1<::Il2CppString*>* localPlayerState;
    // private readonly SynchronizedActionQueue _synchronizedActionQueue
    // Offset: 0x38
    GlobalNamespace::SynchronizedActionQueue* synchronizedActionQueue;
    // private System.Int32 _maxPlayerCount
    // Offset: 0x40
    int maxPlayerCount;
    // private MultiplayerSessionManager/ConnectionState _connectionState
    // Offset: 0x44
    GlobalNamespace::MultiplayerSessionManager::ConnectionState connectionState;
    // private readonly System.Collections.Generic.Queue`1<System.Int32> _freeSortIndices
    // Offset: 0x48
    System::Collections::Generic::Queue_1<int>* freeSortIndices;
    // private System.Action connectedEvent
    // Offset: 0x50
    System::Action* connectedEvent;
    // private System.Action`1<ConnectionFailedReason> connectionFailedEvent
    // Offset: 0x58
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* connectionFailedEvent;
    // private System.Action`1<IConnectedPlayer> playerConnectedEvent
    // Offset: 0x60
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerConnectedEvent;
    // private System.Action`1<IConnectedPlayer> playerDisconnectedEvent
    // Offset: 0x68
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerDisconnectedEvent;
    // private System.Action`1<IConnectedPlayer> playerStateChangedEvent
    // Offset: 0x70
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerStateChangedEvent;
    // private System.Action`1<DisconnectedReason> disconnectedEvent
    // Offset: 0x78
    System::Action_1<GlobalNamespace::DisconnectedReason>* disconnectedEvent;
    // private IConnectedPlayer <connectionOwner>k__BackingField
    // Offset: 0x80
    GlobalNamespace::IConnectedPlayer* connectionOwner;
    // private System.Boolean _exclusiveConnectedPlayerManager
    // Offset: 0x88
    bool exclusiveConnectedPlayerManager;
    // private ConnectedPlayerManager _connectedPlayerManager
    // Offset: 0x90
    GlobalNamespace::ConnectedPlayerManager* connectedPlayerManager;
    // static field const value: static private System.String kMultiplayerSessionState
    static constexpr const char* kMultiplayerSessionState = "multiplayer_session";
    // Get static field: static private System.String kMultiplayerSessionState
    static ::Il2CppString* _get_kMultiplayerSessionState();
    // Set static field: static private System.String kMultiplayerSessionState
    static void _set_kMultiplayerSessionState(::Il2CppString* value);
    // private System.Void set_connectionOwner(IConnectedPlayer value)
    // Offset: 0x1C35860
    void set_connectionOwner(GlobalNamespace::IConnectedPlayer* value);
    // public ConnectedPlayerManager get_connectedPlayerManager()
    // Offset: 0x1C35A28
    GlobalNamespace::ConnectedPlayerManager* get_connectedPlayerManager();
    // public System.Int32 get_maxPlayerCount()
    // Offset: 0x1C35A30
    int get_maxPlayerCount();
