// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: MultiplayerScoreProvider
#include "GlobalNamespace/MultiplayerScoreProvider.hpp"
// Including type: MultiplayerController
#include "GlobalNamespace/MultiplayerController.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerPlayersManager
  class MultiplayerPlayersManager;
  // Forward declaring type: MultiplayerLayoutProvider
  class MultiplayerLayoutProvider;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerVerticalPlayerMovementManager
  class MultiplayerVerticalPlayerMovementManager : public UnityEngine::MonoBehaviour {
    public:
    // private System.Single _movementRange
    // Offset: 0x18
    float movementRange;
    // private System.Single _duelMovementRange
    // Offset: 0x1C
    float duelMovementRange;
    // private System.Single _metersPerSecondMove
    // Offset: 0x20
    float metersPerSecondMove;
    // private System.Single _minScoreDifference
    // Offset: 0x24
    float minScoreDifference;
    // private readonly MultiplayerPlayersManager _multiplayerPlayersManager
    // Offset: 0x28
    GlobalNamespace::MultiplayerPlayersManager* multiplayerPlayersManager;
    // private readonly MultiplayerScoreProvider _scoreProvider
    // Offset: 0x30
    GlobalNamespace::MultiplayerScoreProvider* scoreProvider;
    // private readonly MultiplayerLayoutProvider _layoutProvider
    // Offset: 0x38
    GlobalNamespace::MultiplayerLayoutProvider* layoutProvider;
    // private readonly MultiplayerController _multiplayerController
    // Offset: 0x40
    GlobalNamespace::MultiplayerController* multiplayerController;
    // private readonly System.Collections.Generic.List`1<MultiplayerScoreProvider/RankedPlayer> _reusablePlayersList
    // Offset: 0x48
    System::Collections::Generic::List_1<GlobalNamespace::MultiplayerScoreProvider::RankedPlayer*>* reusablePlayersList;
    // private System.Single _lastFrameBaseScore
    // Offset: 0x50
    float lastFrameBaseScore;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0xFD4E98
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0xFD4F5C
    void OnDestroy();
    // protected System.Void Update()
    // Offset: 0xFD5038
    void Update();
    // private System.Void HandleStateChanged(MultiplayerController/State state)
    // Offset: 0xFD4F4C
    void HandleStateChanged(GlobalNamespace::MultiplayerController::State state);
    // public System.Void .ctor()
    // Offset: 0xFD577C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MultiplayerVerticalPlayerMovementManager* New_ctor();
  }; // MultiplayerVerticalPlayerMovementManager
  check_size<sizeof(MultiplayerVerticalPlayerMovementManager), 80 + sizeof(float) + ((80 + sizeof(float)) % 8 != 0 ? (8 - (80 + sizeof(float)) % 8) : 0)> __GlobalNamespace_MultiplayerVerticalPlayerMovementManagerSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerVerticalPlayerMovementManager*, "", "MultiplayerVerticalPlayerMovementManager");
#pragma pack(pop)
