// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MultiplayerScoreRingManager
  class MultiplayerScoreRingManager;
  // Forward declaring type: MultiplayerResultsTableView
  class MultiplayerResultsTableView;
  // Forward declaring type: MultiplayerPlayersManager
  class MultiplayerPlayersManager;
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: LevelCompletionResults
  class LevelCompletionResults;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerOutroAnimationController
  class MultiplayerOutroAnimationController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::MultiplayerOutroAnimationController::$PlayOutroAnimation$d__9
    class $PlayOutroAnimation$d__9;
    // Nested type: GlobalNamespace::MultiplayerOutroAnimationController::$PlayBigAvatarHideSfxClip$d__10
    class $PlayBigAvatarHideSfxClip$d__10;
    // private System.Single _startDelay
    // Offset: 0x18
    float startDelay;
    // private System.Single _endDuration
    // Offset: 0x1C
    float endDuration;
    // private MultiplayerScoreRingManager _multiplayerScoreRingManager
    // Offset: 0x20
    GlobalNamespace::MultiplayerScoreRingManager* multiplayerScoreRingManager;
    // private MultiplayerResultsTableView _resultsTableView
    // Offset: 0x28
    GlobalNamespace::MultiplayerResultsTableView* resultsTableView;
    // private UnityEngine.AudioSource _outroSfxAudioSource
    // Offset: 0x30
    UnityEngine::AudioSource* outroSfxAudioSource;
    // private UnityEngine.AudioClip _levelFinishedAudioClip
    // Offset: 0x38
    UnityEngine::AudioClip* levelFinishedAudioClip;
    // private readonly MultiplayerPlayersManager _multiplayerPlayersManager
    // Offset: 0x40
    GlobalNamespace::MultiplayerPlayersManager* multiplayerPlayersManager;
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Offset: 0x48
    GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void AnimateOutro(LevelCompletionResults localPlayerResults, System.Collections.Generic.Dictionary`2<System.String,LevelCompletionResults> otherPlayersResults, System.Action onCompleted)
    // Offset: 0xF79208
    void AnimateOutro(GlobalNamespace::LevelCompletionResults* localPlayerResults, System::Collections::Generic::Dictionary_2<::Il2CppString*, GlobalNamespace::LevelCompletionResults*>* otherPlayersResults, System::Action* onCompleted);
    // private System.Collections.IEnumerator PlayOutroAnimation(LevelCompletionResults localPlayerLevelCompletionResults, System.Collections.Generic.Dictionary`2<System.String,LevelCompletionResults> otherPlayersLevelCompletionResults, System.Action onCompleted)
    // Offset: 0xF79234
    System::Collections::IEnumerator* PlayOutroAnimation(GlobalNamespace::LevelCompletionResults* localPlayerLevelCompletionResults, System::Collections::Generic::Dictionary_2<::Il2CppString*, GlobalNamespace::LevelCompletionResults*>* otherPlayersLevelCompletionResults, System::Action* onCompleted);
    // private System.Collections.IEnumerator PlayBigAvatarHideSfxClip(System.Single delay)
    // Offset: 0xF79328
    System::Collections::IEnumerator* PlayBigAvatarHideSfxClip(float delay);
    // private System.Void PlayMusicPreview(System.Single maxDuration)
    // Offset: 0xF793E0
    void PlayMusicPreview(float maxDuration);
    // public System.Void .ctor()
    // Offset: 0xF794B8
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MultiplayerOutroAnimationController* New_ctor();
  }; // MultiplayerOutroAnimationController
  check_size<sizeof(MultiplayerOutroAnimationController), 72 + sizeof(void*) + 8 - (72 + sizeof(void*)) % 8> __GlobalNamespace_MultiplayerOutroAnimationControllerSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerOutroAnimationController*, "", "MultiplayerOutroAnimationController");
#pragma pack(pop)
