// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: Polyglot
namespace Polyglot {
  // Forward declaring type: LocalizedTextMeshProUGUI
  class LocalizedTextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: DisconnectPromptView
  class DisconnectPromptView;
  // Forward declaring type: LevelBar
  class LevelBar;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: LocalPlayerInGameMenuInitData
  class LocalPlayerInGameMenuInitData;
  // Forward declaring type: VRControllersInputManager
  class VRControllersInputManager;
  // Forward declaring type: MultiplayerLocalPlayerDisconnectHelper
  class MultiplayerLocalPlayerDisconnectHelper;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ButtonBinder
  class ButtonBinder;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerLocalActivePlayerInGameMenuViewController
  class MultiplayerLocalActivePlayerInGameMenuViewController : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.UI.Button _disconnectButton
    // Offset: 0x18
    UnityEngine::UI::Button* disconnectButton;
    // private Polyglot.LocalizedTextMeshProUGUI _disconnectButtonLocalizedText
    // Offset: 0x20
    Polyglot::LocalizedTextMeshProUGUI* disconnectButtonLocalizedText;
    // private UnityEngine.UI.Button _giveUpButton
    // Offset: 0x28
    UnityEngine::UI::Button* giveUpButton;
    // private UnityEngine.UI.Button _resumeButton
    // Offset: 0x30
    UnityEngine::UI::Button* resumeButton;
    // private UnityEngine.GameObject _mainBar
    // Offset: 0x38
    UnityEngine::GameObject* mainBar;
    // private DisconnectPromptView _disconnectPromptView
    // Offset: 0x40
    GlobalNamespace::DisconnectPromptView* disconnectPromptView;
    // private LevelBar _levelBar
    // Offset: 0x48
    GlobalNamespace::LevelBar* levelBar;
    // private UnityEngine.GameObject _menuWrapperGameObject
    // Offset: 0x50
    UnityEngine::GameObject* menuWrapperGameObject;
    // private UnityEngine.GameObject _menuControllersGameObject
    // Offset: 0x58
    UnityEngine::GameObject* menuControllersGameObject;
    // private readonly IConnectedPlayer _connectedPlayer
    // Offset: 0x60
    GlobalNamespace::IConnectedPlayer* connectedPlayer;
    // private readonly LocalPlayerInGameMenuInitData _localPlayerInGameMenuInitData
    // Offset: 0x68
    GlobalNamespace::LocalPlayerInGameMenuInitData* localPlayerInGameMenuInitData;
    // private readonly VRControllersInputManager _vrControllersInputManager
    // Offset: 0x70
    GlobalNamespace::VRControllersInputManager* vrControllersInputManager;
    // private readonly MultiplayerLocalPlayerDisconnectHelper _disconnectHelper
    // Offset: 0x78
    GlobalNamespace::MultiplayerLocalPlayerDisconnectHelper* disconnectHelper;
    // private System.Action didPressDisconnectButtonEvent
    // Offset: 0x80
    System::Action* didPressDisconnectButtonEvent;
    // private System.Action didPressGiveUpButtonEvent
    // Offset: 0x88
    System::Action* didPressGiveUpButtonEvent;
    // private System.Action didPressResumeButtonEvent
    // Offset: 0x90
    System::Action* didPressResumeButtonEvent;
    // private HMUI.ButtonBinder _buttonBinder
    // Offset: 0x98
    HMUI::ButtonBinder* buttonBinder;
    // private System.Single _disabledInteractionRemainingTime
    // Offset: 0xA0
    float disabledInteractionRemainingTime;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single kDisabledInteractionDuration
    static constexpr const float kDisabledInteractionDuration = 0.2;
    // Get static field: static private System.Single kDisabledInteractionDuration
    static float _get_kDisabledInteractionDuration();
    // Set static field: static private System.Single kDisabledInteractionDuration
    static void _set_kDisabledInteractionDuration(float value);
    // public System.Void add_didPressDisconnectButtonEvent(System.Action value)
    // Offset: 0x223C2D0
    void add_didPressDisconnectButtonEvent(System::Action* value);
    // public System.Void remove_didPressDisconnectButtonEvent(System.Action value)
    // Offset: 0x223C7CC
    void remove_didPressDisconnectButtonEvent(System::Action* value);
    // public System.Void add_didPressGiveUpButtonEvent(System.Action value)
    // Offset: 0x223C418
    void add_didPressGiveUpButtonEvent(System::Action* value);
    // public System.Void remove_didPressGiveUpButtonEvent(System.Action value)
    // Offset: 0x223C914
    void remove_didPressGiveUpButtonEvent(System::Action* value);
    // public System.Void add_didPressResumeButtonEvent(System.Action value)
    // Offset: 0x223C374
    void add_didPressResumeButtonEvent(System::Action* value);
    // public System.Void remove_didPressResumeButtonEvent(System.Action value)
    // Offset: 0x223C870
    void remove_didPressResumeButtonEvent(System::Action* value);
    // protected System.Void Awake()
    // Offset: 0x223CD20
    void Awake();
    // protected System.Void Start()
    // Offset: 0x223CEC0
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0x223D024
    void OnDestroy();
    // protected System.Void Update()
    // Offset: 0x223D0C8
    void Update();
    // public System.Void ShowMenu()
    // Offset: 0x223CA40
    void ShowMenu();
    // public System.Void HideMenu()
    // Offset: 0x223CA9C
    void HideMenu();
    // private System.Void DisconnectButtonPressed()
    // Offset: 0x223D178
    void DisconnectButtonPressed();
    // private System.Void HandleDisconnectPromptViewDidViewFinish(System.Boolean disconnect)
    // Offset: 0x223D1B8
    void HandleDisconnectPromptViewDidViewFinish(bool disconnect);
    // private System.Void GiveUpButtonPressed()
    // Offset: 0x223D288
    void GiveUpButtonPressed();
    // private System.Void ResumeButtonPressed()
    // Offset: 0x223D138
    void ResumeButtonPressed();
    // private System.Void <HandleDisconnectPromptViewDidViewFinish>b__32_0()
    // Offset: 0x223D2E4
    void $HandleDisconnectPromptViewDidViewFinish$b__32_0();
    // public System.Void .ctor()
    // Offset: 0x223D2DC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MultiplayerLocalActivePlayerInGameMenuViewController* New_ctor();
  }; // MultiplayerLocalActivePlayerInGameMenuViewController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerLocalActivePlayerInGameMenuViewController*, "", "MultiplayerLocalActivePlayerInGameMenuViewController");
#pragma pack(pop)
