// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.FlowCoordinator
#include "HMUI/FlowCoordinator.hpp"
// Including type: MultiplayerModeSelectionViewController
#include "GlobalNamespace/MultiplayerModeSelectionViewController.hpp"
// Including type: UnifiedNetworkPlayerModel
#include "GlobalNamespace/UnifiedNetworkPlayerModel.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameServerBrowserFlowCoordinator
  class GameServerBrowserFlowCoordinator;
  // Forward declaring type: HostGameServerLobbyFlowCoordinator
  class HostGameServerLobbyFlowCoordinator;
  // Forward declaring type: ClientGameServerLobbyFlowCoordinator
  class ClientGameServerLobbyFlowCoordinator;
  // Forward declaring type: QuickPlayLobbyFlowCoordinator
  class QuickPlayLobbyFlowCoordinator;
  // Skipping declaration: INetworkPlayerModel because it is already included!
  // Forward declaring type: CreateServerViewController
  class CreateServerViewController;
  // Forward declaring type: JoinQuickPlayViewController
  class JoinQuickPlayViewController;
  // Forward declaring type: ServerCodeEntryViewController
  class ServerCodeEntryViewController;
  // Forward declaring type: SimpleDialogPromptViewController
  class SimpleDialogPromptViewController;
  // Forward declaring type: JoiningLobbyViewController
  class JoiningLobbyViewController;
  // Skipping declaration: IUnifiedNetworkPlayerModel because it is already included!
  // Forward declaring type: AvatarDataModel
  class AvatarDataModel;
  // Forward declaring type: IMultiplayerSessionManager
  class IMultiplayerSessionManager;
  // Forward declaring type: FadeInOutController
  class FadeInOutController;
  // Forward declaring type: LobbyDataModelsManager
  class LobbyDataModelsManager;
  // Forward declaring type: MultiplayerLobbyConnectionController
  class MultiplayerLobbyConnectionController;
  // Forward declaring type: IMasterServerAvailabilityModel
  class IMasterServerAvailabilityModel;
  // Forward declaring type: PlayerDataModel
  class PlayerDataModel;
  // Forward declaring type: ConnectionFailedReason
  struct ConnectionFailedReason;
  // Forward declaring type: MultiplayerUnavailableReason
  struct MultiplayerUnavailableReason;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: TaskCompletionSource`1<TResult>
  template<typename TResult>
  class TaskCompletionSource_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerModeSelectionFlowCoordinator
  class MultiplayerModeSelectionFlowCoordinator : public HMUI::FlowCoordinator {
    public:
    // Nested type: GlobalNamespace::MultiplayerModeSelectionFlowCoordinator::$TryShowModeSelection$d__42
    struct $TryShowModeSelection$d__42;
    // private readonly GameServerBrowserFlowCoordinator _gameServerBrowserFlowCoordinator
    // Offset: 0xA8
    GlobalNamespace::GameServerBrowserFlowCoordinator* gameServerBrowserFlowCoordinator;
    // private readonly HostGameServerLobbyFlowCoordinator _hostGameServerLobbyFlowCoordinator
    // Offset: 0xB0
    GlobalNamespace::HostGameServerLobbyFlowCoordinator* hostGameServerLobbyFlowCoordinator;
    // private readonly ClientGameServerLobbyFlowCoordinator _clientGameServerLobbyFlowCoordinator
    // Offset: 0xB8
    GlobalNamespace::ClientGameServerLobbyFlowCoordinator* clientGameServerLobbyFlowCoordinator;
    // private readonly QuickPlayLobbyFlowCoordinator _quickPlayLobbyFlowCoordinator
    // Offset: 0xC0
    GlobalNamespace::QuickPlayLobbyFlowCoordinator* quickPlayLobbyFlowCoordinator;
    // private readonly MultiplayerModeSelectionViewController _multiplayerModeSelectionViewController
    // Offset: 0xC8
    GlobalNamespace::MultiplayerModeSelectionViewController* multiplayerModeSelectionViewController;
    // private readonly CreateServerViewController _createServerViewController
    // Offset: 0xD0
    GlobalNamespace::CreateServerViewController* createServerViewController;
    // private readonly JoinQuickPlayViewController _joinQuickPlayViewController
    // Offset: 0xD8
    GlobalNamespace::JoinQuickPlayViewController* joinQuickPlayViewController;
    // private readonly ServerCodeEntryViewController _serverCodeEntryViewController
    // Offset: 0xE0
    GlobalNamespace::ServerCodeEntryViewController* serverCodeEntryViewController;
    // private readonly SimpleDialogPromptViewController _simpleDialogPromptViewController
    // Offset: 0xE8
    GlobalNamespace::SimpleDialogPromptViewController* simpleDialogPromptViewController;
    // private readonly JoiningLobbyViewController _joiningLobbyViewController
    // Offset: 0xF0
    GlobalNamespace::JoiningLobbyViewController* joiningLobbyViewController;
    // private readonly IUnifiedNetworkPlayerModel _unifiedNetworkPlayerModel
    // Offset: 0xF8
    GlobalNamespace::IUnifiedNetworkPlayerModel* unifiedNetworkPlayerModel;
    // private readonly AvatarDataModel _avatarDataModel
    // Offset: 0x100
    GlobalNamespace::AvatarDataModel* avatarDataModel;
    // private readonly IMultiplayerSessionManager _multiplayerSessionManager
    // Offset: 0x108
    GlobalNamespace::IMultiplayerSessionManager* multiplayerSessionManager;
    // private readonly FadeInOutController _fadeInOutController
    // Offset: 0x110
    GlobalNamespace::FadeInOutController* fadeInOutController;
    // private readonly LobbyDataModelsManager _lobbyDataModelsManager
    // Offset: 0x118
    GlobalNamespace::LobbyDataModelsManager* lobbyDataModelsManager;
    // private readonly MultiplayerLobbyConnectionController _multiplayerLobbyConnectionController
    // Offset: 0x120
    GlobalNamespace::MultiplayerLobbyConnectionController* multiplayerLobbyConnectionController;
    // private readonly IMasterServerAvailabilityModel _masterServerAvailabilityModel
    // Offset: 0x128
    GlobalNamespace::IMasterServerAvailabilityModel* masterServerAvailabilityModel;
    // private readonly PlayerDataModel _playerDataModel
    // Offset: 0x130
    GlobalNamespace::PlayerDataModel* playerDataModel;
    // private System.Action`1<MultiplayerModeSelectionFlowCoordinator> didFinishEvent
    // Offset: 0x138
    System::Action_1<GlobalNamespace::MultiplayerModeSelectionFlowCoordinator*>* didFinishEvent;
    // private System.Threading.CancellationTokenSource _cancellationTokenSource
    // Offset: 0x140
    System::Threading::CancellationTokenSource* cancellationTokenSource;
    // private System.Threading.Tasks.TaskCompletionSource`1<System.Boolean> _transitionFinishedTaskSource
    // Offset: 0x148
    System::Threading::Tasks::TaskCompletionSource_1<bool>* transitionFinishedTaskSource;
    // public System.Void add_didFinishEvent(System.Action`1<MultiplayerModeSelectionFlowCoordinator> value)
    // Offset: 0x22419D0
    void add_didFinishEvent(System::Action_1<GlobalNamespace::MultiplayerModeSelectionFlowCoordinator*>* value);
    // public System.Void remove_didFinishEvent(System.Action`1<MultiplayerModeSelectionFlowCoordinator> value)
    // Offset: 0x2241A78
    void remove_didFinishEvent(System::Action_1<GlobalNamespace::MultiplayerModeSelectionFlowCoordinator*>* value);
    // private System.Void HandleMultiplayerLobbyConnectionControllerConnectionSuccessActivateModel()
    // Offset: 0x2242BA0
    void HandleMultiplayerLobbyConnectionControllerConnectionSuccessActivateModel();
    // private System.Void HandleMultiplayerLobbyConnectionControllerConnectionSuccess()
    // Offset: 0x2242BBC
    void HandleMultiplayerLobbyConnectionControllerConnectionSuccess();
    // private System.Void HandleMultiplayerLobbyConnectionControllerConnectionFailed(ConnectionFailedReason reason)
    // Offset: 0x2242BC0
    void HandleMultiplayerLobbyConnectionControllerConnectionFailed(GlobalNamespace::ConnectionFailedReason reason);
    // private System.Void HandleMultiplayerLobbyControllerDidFinish(MultiplayerModeSelectionViewController viewController, MultiplayerModeSelectionViewController/MenuButton menuButton)
    // Offset: 0x2242C8C
    void HandleMultiplayerLobbyControllerDidFinish(GlobalNamespace::MultiplayerModeSelectionViewController* viewController, GlobalNamespace::MultiplayerModeSelectionViewController::MenuButton menuButton);
    // private System.Void HandleGameServerBrowserFlowCoordinatorDidFinish(GameServerBrowserFlowCoordinator flowCoordinator)
    // Offset: 0x2242D70
    void HandleGameServerBrowserFlowCoordinatorDidFinish(GlobalNamespace::GameServerBrowserFlowCoordinator* flowCoordinator);
    // private System.Void HandleJoiningLobbyViewControllerDidFinish()
    // Offset: 0x2242D84
    void HandleJoiningLobbyViewControllerDidFinish();
    // private System.Void HandleJoinQuickPlayViewControllerDidFinish(System.Boolean success)
    // Offset: 0x2242E48
    void HandleJoinQuickPlayViewControllerDidFinish(bool success);
    // private System.Void HandleServerCodeEntryViewControllerDidFinish(System.Boolean success, System.String code)
    // Offset: 0x2242F50
    void HandleServerCodeEntryViewControllerDidFinish(bool success, ::Il2CppString* code);
    // private System.Void HandleCreateServerViewControllerDidFinish(System.Boolean success, UnifiedNetworkPlayerModel/CreatePartyConfig createPartyConfig)
    // Offset: 0x2243038
    void HandleCreateServerViewControllerDidFinish(bool success, GlobalNamespace::UnifiedNetworkPlayerModel::CreatePartyConfig* createPartyConfig);
    // private System.Void HandleClientGameServerLobbyFlowCoordinatorDidFinish(ClientGameServerLobbyFlowCoordinator obj)
    // Offset: 0x2243140
    void HandleClientGameServerLobbyFlowCoordinatorDidFinish(GlobalNamespace::ClientGameServerLobbyFlowCoordinator* obj);
    // private System.Void HandleQuickPlayLobbyFlowCoordinatorDidFinish()
    // Offset: 0x2243290
    void HandleQuickPlayLobbyFlowCoordinatorDidFinish();
    // private System.Void HandleHostGameServerLobbyFlowCoordinatorDidFinish(HostGameServerLobbyFlowCoordinator flowCoordinator)
    // Offset: 0x22433D8
    void HandleHostGameServerLobbyFlowCoordinatorDidFinish(GlobalNamespace::HostGameServerLobbyFlowCoordinator* flowCoordinator);
    // private System.Void HandleConnectedPlayerManagerCreated(INetworkPlayerModel networkPlayerModel)
    // Offset: 0x22434B8
    void HandleConnectedPlayerManagerCreated(GlobalNamespace::INetworkPlayerModel* networkPlayerModel);
    // private System.Void TryShowModeSelection(System.Boolean shouldProvideInitialViewControllers)
    // Offset: 0x2241E24
    void TryShowModeSelection(bool shouldProvideInitialViewControllers);
    // private System.Void ResolveAndPresentNextFlowCoordinator()
    // Offset: 0x22428E8
    void ResolveAndPresentNextFlowCoordinator();
    // private System.Void PresentConnectionErrorDialog(ConnectionFailedReason reason)
    // Offset: 0x2242984
    void PresentConnectionErrorDialog(GlobalNamespace::ConnectionFailedReason reason);
    // private System.Void PresentMasterServerUnavailableErrorDialog(MultiplayerUnavailableReason reason, System.Nullable`1<System.Int64> maintenanceWindowEndTime, System.String remoteLocalizedMessage)
    // Offset: 0x22436A8
    void PresentMasterServerUnavailableErrorDialog(GlobalNamespace::MultiplayerUnavailableReason reason, System::Nullable_1<int64_t> maintenanceWindowEndTime, ::Il2CppString* remoteLocalizedMessage);
    // private System.Void <ResolveAndPresentNextFlowCoordinator>b__43_0()
    // Offset: 0x224390C
    void $ResolveAndPresentNextFlowCoordinator$b__43_0();
    // private System.Void <PresentConnectionErrorDialog>b__44_0(System.Int32 btnId)
    // Offset: 0x2243B48
    void $PresentConnectionErrorDialog$b__44_0(int btnId);
    // private System.Void <PresentConnectionErrorDialog>b__44_1(System.Int32 btnId)
    // Offset: 0x2243B60
    void $PresentConnectionErrorDialog$b__44_1(int btnId);
    // private System.Void <PresentMasterServerUnavailableErrorDialog>b__45_0(System.Int32 btnId)
    // Offset: 0x2243B78
    void $PresentMasterServerUnavailableErrorDialog$b__45_0(int btnId);
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0x2241B20
    // Implemented from: HMUI.FlowCoordinator
    // Base method: System.Void FlowCoordinator::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // protected override System.Void DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    // Offset: 0x2241EF4
    // Implemented from: HMUI.FlowCoordinator
    // Base method: System.Void FlowCoordinator::DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    void DidDeactivate(bool removedFromHierarchy, bool screenSystemDisabling);
    // protected override System.Void BackButtonWasPressed(HMUI.ViewController topViewController)
    // Offset: 0x2242248
    // Implemented from: HMUI.FlowCoordinator
    // Base method: System.Void FlowCoordinator::BackButtonWasPressed(HMUI.ViewController topViewController)
    void BackButtonWasPressed(HMUI::ViewController* topViewController);
    // protected override System.Void TopViewControllerWillChange(HMUI.ViewController oldViewController, HMUI.ViewController newViewController, HMUI.ViewController/AnimationType animationType)
    // Offset: 0x2242334
    // Implemented from: HMUI.FlowCoordinator
    // Base method: System.Void FlowCoordinator::TopViewControllerWillChange(HMUI.ViewController oldViewController, HMUI.ViewController newViewController, HMUI.ViewController/AnimationType animationType)
    void TopViewControllerWillChange(HMUI::ViewController* oldViewController, HMUI::ViewController* newViewController, HMUI::ViewController::AnimationType animationType);
    // protected override System.Void TransitionDidStart()
    // Offset: 0x2242570
    // Implemented from: HMUI.FlowCoordinator
    // Base method: System.Void FlowCoordinator::TransitionDidStart()
    void TransitionDidStart();
    // protected override System.Void TransitionDidFinish()
    // Offset: 0x22426A8
    // Implemented from: HMUI.FlowCoordinator
    // Base method: System.Void FlowCoordinator::TransitionDidFinish()
    void TransitionDidFinish();
    // public System.Void .ctor()
    // Offset: 0x2243904
    // Implemented from: HMUI.FlowCoordinator
    // Base method: System.Void FlowCoordinator::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MultiplayerModeSelectionFlowCoordinator* New_ctor();
  }; // MultiplayerModeSelectionFlowCoordinator
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerModeSelectionFlowCoordinator*, "", "MultiplayerModeSelectionFlowCoordinator");
#pragma pack(pop)
