// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: MultiplayerScoreProvider
#include "GlobalNamespace/MultiplayerScoreProvider.hpp"
// Including type: MultiplayerController
#include "GlobalNamespace/MultiplayerController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: MultiplayerLeadPlayerProvider
  class MultiplayerLeadPlayerProvider : public UnityEngine::MonoBehaviour {
    public:
    // private System.Single _timeToGainFirstLead
    // Size: 0x4
    // Offset: 0x18
    float timeToGainFirstLead;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _timeToLooseLead
    // Size: 0x4
    // Offset: 0x1C
    float timeToLooseLead;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [InjectAttribute] Offset: 0xD28284
    // private readonly MultiplayerScoreProvider _scoreProvider
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::MultiplayerScoreProvider* scoreProvider;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerScoreProvider*) == 0x8);
    // [InjectAttribute] Offset: 0xD28294
    // private readonly MultiplayerController _multiplayerController
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::MultiplayerController* multiplayerController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerController*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD282A4
    // private System.Action`1<System.String> newLeaderWasSelectedEvent
    // Size: 0x8
    // Offset: 0x30
    System::Action_1<::Il2CppString*>* newLeaderWasSelectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<::Il2CppString*>*) == 0x8);
    // private System.Single _currentLeadingPlayerStartTime
    // Size: 0x4
    // Offset: 0x38
    float currentLeadingPlayerStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: currentLeadingPlayerStartTime and: currentlyDisplayedUser
    char __padding5[0x4] = {};
    // private MultiplayerScoreProvider/RankedPlayer _currentlyDisplayedUser
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::MultiplayerScoreProvider::RankedPlayer* currentlyDisplayedUser;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerScoreProvider::RankedPlayer*) == 0x8);
    // private MultiplayerScoreProvider/RankedPlayer _currentlyLeadingUser
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::MultiplayerScoreProvider::RankedPlayer* currentlyLeadingUser;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerScoreProvider::RankedPlayer*) == 0x8);
    // Creating value type constructor for type: MultiplayerLeadPlayerProvider
    MultiplayerLeadPlayerProvider(float timeToGainFirstLead_ = {}, float timeToLooseLead_ = {}, GlobalNamespace::MultiplayerScoreProvider* scoreProvider_ = {}, GlobalNamespace::MultiplayerController* multiplayerController_ = {}, System::Action_1<::Il2CppString*>* newLeaderWasSelectedEvent_ = {}, float currentLeadingPlayerStartTime_ = {}, GlobalNamespace::MultiplayerScoreProvider::RankedPlayer* currentlyDisplayedUser_ = {}, GlobalNamespace::MultiplayerScoreProvider::RankedPlayer* currentlyLeadingUser_ = {}) noexcept : timeToGainFirstLead{timeToGainFirstLead_}, timeToLooseLead{timeToLooseLead_}, scoreProvider{scoreProvider_}, multiplayerController{multiplayerController_}, newLeaderWasSelectedEvent{newLeaderWasSelectedEvent_}, currentLeadingPlayerStartTime{currentLeadingPlayerStartTime_}, currentlyDisplayedUser{currentlyDisplayedUser_}, currentlyLeadingUser{currentlyLeadingUser_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_newLeaderWasSelectedEvent(System.Action`1<System.String> value)
    // Offset: 0xF42230
    void add_newLeaderWasSelectedEvent(System::Action_1<::Il2CppString*>* value);
    // public System.Void remove_newLeaderWasSelectedEvent(System.Action`1<System.String> value)
    // Offset: 0xF4201C
    void remove_newLeaderWasSelectedEvent(System::Action_1<::Il2CppString*>* value);
    // protected System.Void Start()
    // Offset: 0xF45314
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0xF453E4
    void OnDestroy();
    // protected System.Void Update()
    // Offset: 0xF4553C
    void Update();
    // private System.Void StopProviding()
    // Offset: 0xF455FC
    void StopProviding();
    // private System.Void StartProviding()
    // Offset: 0xF456A0
    void StartProviding();
    // private System.Void HandleStateChanged(MultiplayerController/State state)
    // Offset: 0xF453D4
    void HandleStateChanged(GlobalNamespace::MultiplayerController::State state);
    // private System.Void HandleFirstPlayerDidChange(MultiplayerScoreProvider/RankedPlayer firstPlayer)
    // Offset: 0xF45748
    void HandleFirstPlayerDidChange(GlobalNamespace::MultiplayerScoreProvider::RankedPlayer* firstPlayer);
    // public System.Void .ctor()
    // Offset: 0xF45874
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MultiplayerLeadPlayerProvider* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MultiplayerLeadPlayerProvider::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MultiplayerLeadPlayerProvider*, creationType>()));
    }
  }; // MultiplayerLeadPlayerProvider
  #pragma pack(pop)
  static check_size<sizeof(MultiplayerLeadPlayerProvider), 72 + sizeof(GlobalNamespace::MultiplayerScoreProvider::RankedPlayer*)> __GlobalNamespace_MultiplayerLeadPlayerProviderSizeCheck;
  static_assert(sizeof(MultiplayerLeadPlayerProvider) == 0x50);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerLeadPlayerProvider*, "", "MultiplayerLeadPlayerProvider");
