// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: StandaloneMonobehavior
#include "GlobalNamespace/StandaloneMonobehavior.hpp"
// Including type: IMultiplayerSessionManager
#include "GlobalNamespace/IMultiplayerSessionManager.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IConnectionInitParams`1<T>
  template<typename T>
  class IConnectionInitParams_1;
  // Forward declaring type: NetworkPacketSerializer`2<TType, TData>
  template<typename TType, typename TData>
  class NetworkPacketSerializer_2;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
  // Forward declaring type: SynchronizedActionQueue
  class SynchronizedActionQueue;
  // Forward declaring type: ConnectedPlayerManager
  class ConnectedPlayerManager;
  // Forward declaring type: IConnectionManager
  class IConnectionManager;
  // Skipping declaration: SessionType because it is already included!
  // Forward declaring type: UpdateConnectionStateReason
  struct UpdateConnectionStateReason;
  // Forward declaring type: INetworkPacketSubSerializer`1<TData>
  template<typename TData>
  class INetworkPacketSubSerializer_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: INetSerializable
  class INetSerializable;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerSessionManager
  class MultiplayerSessionManager : public GlobalNamespace::StandaloneMonobehavior/*, public GlobalNamespace::IMultiplayerSessionManager*/ {
    public:
    // Nested type: GlobalNamespace::MultiplayerSessionManager::SessionType
    struct SessionType;
    // Nested type: GlobalNamespace::MultiplayerSessionManager::ConnectionState
    struct ConnectionState;
    // Nested type: GlobalNamespace::MultiplayerSessionManager::$$c__DisplayClass92_0
    class $$c__DisplayClass92_0;
    // Nested type: GlobalNamespace::MultiplayerSessionManager::$$c
    class $$c;
    // Autogenerated type: MultiplayerSessionManager/SessionType
    struct SessionType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: SessionType
      constexpr SessionType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MultiplayerSessionManager/SessionType Player
      static constexpr const int Player = 0;
      // Get static field: static public MultiplayerSessionManager/SessionType Player
      static GlobalNamespace::MultiplayerSessionManager::SessionType _get_Player();
      // Set static field: static public MultiplayerSessionManager/SessionType Player
      static void _set_Player(GlobalNamespace::MultiplayerSessionManager::SessionType value);
      // static field const value: static public MultiplayerSessionManager/SessionType Spectator
      static constexpr const int Spectator = 1;
      // Get static field: static public MultiplayerSessionManager/SessionType Spectator
      static GlobalNamespace::MultiplayerSessionManager::SessionType _get_Spectator();
      // Set static field: static public MultiplayerSessionManager/SessionType Spectator
      static void _set_Spectator(GlobalNamespace::MultiplayerSessionManager::SessionType value);
      // static field const value: static public MultiplayerSessionManager/SessionType DedicatedServer
      static constexpr const int DedicatedServer = 2;
      // Get static field: static public MultiplayerSessionManager/SessionType DedicatedServer
      static GlobalNamespace::MultiplayerSessionManager::SessionType _get_DedicatedServer();
      // Set static field: static public MultiplayerSessionManager/SessionType DedicatedServer
      static void _set_DedicatedServer(GlobalNamespace::MultiplayerSessionManager::SessionType value);
    }; // MultiplayerSessionManager/SessionType
    // Autogenerated type: MultiplayerSessionManager/ConnectionState
    struct ConnectionState : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: ConnectionState
      constexpr ConnectionState(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MultiplayerSessionManager/ConnectionState Disconnected
      static constexpr const int Disconnected = 0;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Disconnected
      static GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Disconnected();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Disconnected
      static void _set_Disconnected(GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
      // static field const value: static public MultiplayerSessionManager/ConnectionState Connecting
      static constexpr const int Connecting = 1;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Connecting
      static GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Connecting();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Connecting
      static void _set_Connecting(GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
      // static field const value: static public MultiplayerSessionManager/ConnectionState Connected
      static constexpr const int Connected = 2;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Connected
      static GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Connected();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Connected
      static void _set_Connected(GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
      // static field const value: static public MultiplayerSessionManager/ConnectionState Disconnecting
      static constexpr const int Disconnecting = 3;
      // Get static field: static public MultiplayerSessionManager/ConnectionState Disconnecting
      static GlobalNamespace::MultiplayerSessionManager::ConnectionState _get_Disconnecting();
      // Set static field: static public MultiplayerSessionManager/ConnectionState Disconnecting
      static void _set_Disconnecting(GlobalNamespace::MultiplayerSessionManager::ConnectionState value);
    }; // MultiplayerSessionManager/ConnectionState
    // private readonly NetworkPacketSerializer`2<MultiplayerSessionManager/MessageType,IConnectedPlayer> _packetSerializer
    // Offset: 0x30
    GlobalNamespace::NetworkPacketSerializer_2<GlobalNamespace::MultiplayerSessionManager_MessageType, GlobalNamespace::IConnectedPlayer*>* packetSerializer;
    // private readonly System.Collections.Generic.List`1<IConnectedPlayer> _connectedPlayers
    // Offset: 0x38
    System::Collections::Generic::List_1<GlobalNamespace::IConnectedPlayer*>* connectedPlayers;
    // private readonly System.Collections.Generic.HashSet`1<System.String> _localPlayerState
    // Offset: 0x40
    System::Collections::Generic::HashSet_1<::Il2CppString*>* localPlayerState;
    // private readonly SynchronizedActionQueue _synchronizedActionQueue
    // Offset: 0x48
    GlobalNamespace::SynchronizedActionQueue* synchronizedActionQueue;
    // private System.Int32 _maxPlayerCount
    // Offset: 0x50
    int maxPlayerCount;
    // private MultiplayerSessionManager/ConnectionState _connectionState
    // Offset: 0x54
    GlobalNamespace::MultiplayerSessionManager::ConnectionState connectionState;
    // private readonly System.Collections.Generic.Queue`1<System.Int32> _freeSortIndices
    // Offset: 0x58
    System::Collections::Generic::Queue_1<int>* freeSortIndices;
    // private System.Action connectedEvent
    // Offset: 0x60
    System::Action* connectedEvent;
    // private System.Action`1<ConnectionFailedReason> connectionFailedEvent
    // Offset: 0x68
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* connectionFailedEvent;
    // private System.Action`1<IConnectedPlayer> playerConnectedEvent
    // Offset: 0x70
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerConnectedEvent;
    // private System.Action`1<IConnectedPlayer> playerDisconnectedEvent
    // Offset: 0x78
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerDisconnectedEvent;
    // private System.Action`1<IConnectedPlayer> playerStateChangedEvent
    // Offset: 0x80
    System::Action_1<GlobalNamespace::IConnectedPlayer*>* playerStateChangedEvent;
    // private System.Action`1<DisconnectedReason> disconnectedEvent
    // Offset: 0x88
    System::Action_1<GlobalNamespace::DisconnectedReason>* disconnectedEvent;
    // private IConnectedPlayer <connectionOwner>k__BackingField
    // Offset: 0x90
    GlobalNamespace::IConnectedPlayer* connectionOwner;
    // private System.Boolean _exclusiveConnectedPlayerManager
    // Offset: 0x98
    bool exclusiveConnectedPlayerManager;
    // private ConnectedPlayerManager _connectedPlayerManager
    // Offset: 0xA0
    GlobalNamespace::ConnectedPlayerManager* connectedPlayerManager;
    // Creating interface conversion operator: operator GlobalNamespace::IMultiplayerSessionManager
    operator GlobalNamespace::IMultiplayerSessionManager() noexcept {
      return *reinterpret_cast<GlobalNamespace::IMultiplayerSessionManager*>(this);
    }
    // static field const value: static private System.String kMultiplayerSessionState
    static constexpr const char* kMultiplayerSessionState = "multiplayer_session";
    // Get static field: static private System.String kMultiplayerSessionState
    static ::Il2CppString* _get_kMultiplayerSessionState();
    // Set static field: static private System.String kMultiplayerSessionState
    static void _set_kMultiplayerSessionState(::Il2CppString* value);
    // private System.Void set_connectionOwner(IConnectedPlayer value)
    // Offset: 0x1E49AAC
    void set_connectionOwner(GlobalNamespace::IConnectedPlayer* value);
