// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AvatarVisualController
  class AvatarVisualController;
  // Forward declaring type: ScaleAnimator
  class ScaleAnimator;
  // Forward declaring type: ColorSO
  class ColorSO;
  // Forward declaring type: VFXController
  class VFXController;
  // Forward declaring type: LightsAnimator
  class LightsAnimator;
}
// Forward declaring namespace: Tweening
namespace Tweening {
  // Forward declaring type: TweeningManager
  class TweeningManager;
  // Forward declaring type: Tween
  class Tween;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: MultiplayerConnectedPlayerIntroAnimator
  class MultiplayerConnectedPlayerIntroAnimator : public UnityEngine::MonoBehaviour {
    public:
    // private AvatarVisualController _avatarVisualsController
    // Offset: 0x18
    GlobalNamespace::AvatarVisualController* avatarVisualsController;
    // private ScaleAnimator _avatarScaleAnimator
    // Offset: 0x20
    GlobalNamespace::ScaleAnimator* avatarScaleAnimator;
    // protected ColorSO _activeLightsColor
    // Offset: 0x28
    GlobalNamespace::ColorSO* activeLightsColor;
    // protected ColorSO _offLightsColor
    // Offset: 0x30
    GlobalNamespace::ColorSO* offLightsColor;
    // private VFXController _spawnVFXController
    // Offset: 0x38
    GlobalNamespace::VFXController* spawnVFXController;
    // protected LightsAnimator[] _lightsAnimators
    // Offset: 0x40
    ::Array<GlobalNamespace::LightsAnimator*>* lightsAnimators;
    // private readonly Tweening.TweeningManager _tweeningManager
    // Offset: 0x48
    Tweening::TweeningManager* tweeningManager;
    // private Tweening.Tween _animateAvatarColorTween
    // Offset: 0x50
    Tweening::Tween* animateAvatarColorTween;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void OnDestroy()
    // Offset: 0xFAB8A8
    void OnDestroy();
    // public System.Void SetBeforeIntroValues()
    // Offset: 0xFAB940
    void SetBeforeIntroValues();
    // public System.Void Animate(System.Single duration, System.Int32 order)
    // Offset: 0xFAB9F0
    void Animate(float duration, int order);
    // public System.Void TransitionToAfterIntroAnimationState()
    // Offset: 0xFABBE4
    void TransitionToAfterIntroAnimationState();
    // private System.Void <Animate>b__10_0(UnityEngine.Color color)
    // Offset: 0xFABCB4
    void $Animate$b__10_0(UnityEngine::Color color);
    // public System.Void .ctor()
    // Offset: 0xFABCAC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static MultiplayerConnectedPlayerIntroAnimator* New_ctor();
  }; // MultiplayerConnectedPlayerIntroAnimator
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerConnectedPlayerIntroAnimator*, "", "MultiplayerConnectedPlayerIntroAnimator");
#pragma pack(pop)
