// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: MultiplayerEnvironmentResizeController
#include "GlobalNamespace/MultiplayerEnvironmentResizeController.hpp"
// Including type: MultiplayerEnvironmentResizeController/ResizeType
#include "GlobalNamespace/MultiplayerEnvironmentResizeController_ResizeType.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: TubeBloomPrePassLight
  class TubeBloomPrePassLight;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x28
  #pragma pack(push, 1)
  // Autogenerated type: MultiplayerEnvironmentResizeController/ResizeData
  // [] Offset: FFFFFFFF
  class MultiplayerEnvironmentResizeController::ResizeData : public ::Il2CppObject {
    public:
    // private MultiplayerEnvironmentResizeController/ResizeType _resizeType
    // Size: 0x4
    // Offset: 0x10
    GlobalNamespace::MultiplayerEnvironmentResizeController::ResizeType resizeType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MultiplayerEnvironmentResizeController::ResizeType) == 0x4);
    // private System.Single _offset
    // Size: 0x4
    // Offset: 0x14
    float offset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private TubeBloomPrePassLight[] _lights
    // Size: 0x8
    // Offset: 0x18
    ::Array<GlobalNamespace::TubeBloomPrePassLight*>* lights;
    // Field size check
    static_assert(sizeof(::Array<GlobalNamespace::TubeBloomPrePassLight*>*) == 0x8);
    // [NullAllowed] Offset: 0xDD3F24
    // private UnityEngine.Transform[] _otherTransforms
    // Size: 0x8
    // Offset: 0x20
    ::Array<UnityEngine::Transform*>* otherTransforms;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Transform*>*) == 0x8);
    // Creating value type constructor for type: ResizeData
    ResizeData(GlobalNamespace::MultiplayerEnvironmentResizeController::ResizeType resizeType_ = {}, float offset_ = {}, ::Array<GlobalNamespace::TubeBloomPrePassLight*>* lights_ = {}, ::Array<UnityEngine::Transform*>* otherTransforms_ = {}) noexcept : resizeType{resizeType_}, offset{offset_}, lights{lights_}, otherTransforms{otherTransforms_} {}
    // public MultiplayerEnvironmentResizeController/ResizeType get_resizeType()
    // Offset: 0xFB2990
    GlobalNamespace::MultiplayerEnvironmentResizeController::ResizeType get_resizeType();
    // public System.Single get_offset()
    // Offset: 0xFB2998
    float get_offset();
    // public TubeBloomPrePassLight[] get_lights()
    // Offset: 0xFB29A0
    ::Array<GlobalNamespace::TubeBloomPrePassLight*>* get_lights();
    // public UnityEngine.Transform[] get_otherTransforms()
    // Offset: 0xFB29A8
    ::Array<UnityEngine::Transform*>* get_otherTransforms();
    // public System.Void .ctor()
    // Offset: 0xFB29B0
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MultiplayerEnvironmentResizeController::ResizeData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::MultiplayerEnvironmentResizeController::ResizeData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MultiplayerEnvironmentResizeController::ResizeData*, creationType>()));
    }
  }; // MultiplayerEnvironmentResizeController/ResizeData
  #pragma pack(pop)
  static check_size<sizeof(MultiplayerEnvironmentResizeController::ResizeData), 32 + sizeof(::Array<UnityEngine::Transform*>*)> __GlobalNamespace_MultiplayerEnvironmentResizeController_ResizeDataSizeCheck;
  static_assert(sizeof(MultiplayerEnvironmentResizeController::ResizeData) == 0x28);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::MultiplayerEnvironmentResizeController::ResizeData*, "", "MultiplayerEnvironmentResizeController/ResizeData");
