// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: NetworkPlayersTableView
  class NetworkPlayersTableView;
  // Forward declaring type: INetworkPlayer
  class INetworkPlayer;
  // Forward declaring type: INetworkPlayerModel
  class INetworkPlayerModel;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: NetworkPlayersViewController
  class NetworkPlayersViewController : public HMUI::ViewController {
    public:
    // private NetworkPlayersTableView _networkPlayersTableView
    // Size: 0x8
    // Offset: 0x70
    GlobalNamespace::NetworkPlayersTableView* networkPlayersTableView;
    // Field size check
    static_assert(sizeof(GlobalNamespace::NetworkPlayersTableView*) == 0x8);
    // private System.Boolean _refreshIsNeeded
    // Size: 0x1
    // Offset: 0x78
    bool refreshIsNeeded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: refreshIsNeeded and: onJoinRequestEvent
    char __padding1[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xD2FBD8
    // private System.Action`1<INetworkPlayer> onJoinRequestEvent
    // Size: 0x8
    // Offset: 0x80
    System::Action_1<GlobalNamespace::INetworkPlayer*>* onJoinRequestEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::INetworkPlayer*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD2FBE8
    // private System.Action`1<INetworkPlayer> onInviteRequestEvent
    // Size: 0x8
    // Offset: 0x88
    System::Action_1<GlobalNamespace::INetworkPlayer*>* onInviteRequestEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::INetworkPlayer*>*) == 0x8);
    // Creating value type constructor for type: NetworkPlayersViewController
    NetworkPlayersViewController(GlobalNamespace::NetworkPlayersTableView* networkPlayersTableView_ = {}, bool refreshIsNeeded_ = {}, System::Action_1<GlobalNamespace::INetworkPlayer*>* onJoinRequestEvent_ = {}, System::Action_1<GlobalNamespace::INetworkPlayer*>* onInviteRequestEvent_ = {}) noexcept : networkPlayersTableView{networkPlayersTableView_}, refreshIsNeeded{refreshIsNeeded_}, onJoinRequestEvent{onJoinRequestEvent_}, onInviteRequestEvent{onInviteRequestEvent_} {}
    // public System.String get_myPartyTitle()
    // Offset: 0xFFFFFFFF
    ::Il2CppString* get_myPartyTitle();
    // public System.String get_otherPlayersTitle()
    // Offset: 0xFFFFFFFF
    ::Il2CppString* get_otherPlayersTitle();
    // public INetworkPlayerModel get_networkPlayerModel()
    // Offset: 0xFFFFFFFF
    GlobalNamespace::INetworkPlayerModel* get_networkPlayerModel();
    // public System.Void add_onJoinRequestEvent(System.Action`1<INetworkPlayer> value)
    // Offset: 0x10C03D4
    void add_onJoinRequestEvent(System::Action_1<GlobalNamespace::INetworkPlayer*>* value);
    // public System.Void remove_onJoinRequestEvent(System.Action`1<INetworkPlayer> value)
    // Offset: 0x10C0478
    void remove_onJoinRequestEvent(System::Action_1<GlobalNamespace::INetworkPlayer*>* value);
    // public System.Void add_onInviteRequestEvent(System.Action`1<INetworkPlayer> value)
    // Offset: 0x10C051C
    void add_onInviteRequestEvent(System::Action_1<GlobalNamespace::INetworkPlayer*>* value);
    // public System.Void remove_onInviteRequestEvent(System.Action`1<INetworkPlayer> value)
    // Offset: 0x10C05C0
    void remove_onInviteRequestEvent(System::Action_1<GlobalNamespace::INetworkPlayer*>* value);
    // protected System.Void NetworkPlayersViewControllerDidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy)
    // Offset: 0x10C0AE8
    void NetworkPlayersViewControllerDidActivate(bool firstActivation, bool addedToHierarchy);
    // protected System.Void NetworkPlayersViewControllerDidDeactivate(System.Boolean removedFromHierarchy)
    // Offset: 0x10C0D90
    void NetworkPlayersViewControllerDidDeactivate(bool removedFromHierarchy);
    // private System.Void HandlePartyChanged(INetworkPlayerModel playerModel)
    // Offset: 0x10C0D9C
    void HandlePartyChanged(GlobalNamespace::INetworkPlayerModel* playerModel);
    // private System.Void HandleJoinRequest(INetworkPlayer player)
    // Offset: 0x10C0DB4
    void HandleJoinRequest(GlobalNamespace::INetworkPlayer* player);
    // private System.Void HandleInviteRequest(INetworkPlayer player)
    // Offset: 0x10C0E28
    void HandleInviteRequest(GlobalNamespace::INetworkPlayer* player);
    // private System.Void Refresh()
    // Offset: 0x10C093C
    void Refresh();
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0x10C0664
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // protected override System.Void DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    // Offset: 0x10C0AEC
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    void DidDeactivate(bool removedFromHierarchy, bool screenSystemDisabling);
    // protected override System.Void OnDestroy()
    // Offset: 0x10C0D94
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::OnDestroy()
    void OnDestroy();
    // protected System.Void .ctor()
    // Offset: 0x10C0E9C
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static NetworkPlayersViewController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::NetworkPlayersViewController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<NetworkPlayersViewController*, creationType>()));
    }
  }; // NetworkPlayersViewController
  #pragma pack(pop)
  static check_size<sizeof(NetworkPlayersViewController), 136 + sizeof(System::Action_1<GlobalNamespace::INetworkPlayer*>*)> __GlobalNamespace_NetworkPlayersViewControllerSizeCheck;
  static_assert(sizeof(NetworkPlayersViewController) == 0x90);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::NetworkPlayersViewController*, "", "NetworkPlayersViewController");
