// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.ParticleSystem/EmissionModule
#include "UnityEngine/ParticleSystem_EmissionModule.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: ParticleSystem because it is already included!
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ColorManager
  class ColorManager;
  // Forward declaring type: NoteData
  class NoteData;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: NoteRibbonCutEffect
  class NoteRibbonCutEffect : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.Transform _jumpPartTransform
    // Offset: 0x18
    UnityEngine::Transform* jumpPartTransform;
    // private UnityEngine.ParticleSystem _sparklesPS
    // Offset: 0x20
    UnityEngine::ParticleSystem* sparklesPS;
    // private UnityEngine.ParticleSystem _burnPS
    // Offset: 0x28
    UnityEngine::ParticleSystem* burnPS;
    // private readonly ColorManager _colorManager
    // Offset: 0x30
    GlobalNamespace::ColorManager* colorManager;
    // private System.Single _jumpLength
    // Offset: 0x38
    float jumpLength;
    // private System.Single _ribbonWidth
    // Offset: 0x3C
    float ribbonWidth;
    // private System.Single _jumpHeight
    // Offset: 0x40
    float jumpHeight;
    // private UnityEngine.ParticleSystem/EmissionModule _sparklesPSEmission
    // Offset: 0x48
    UnityEngine::ParticleSystem::EmissionModule sparklesPSEmission;
    // private UnityEngine.ParticleSystem/EmissionModule _burnPSEmission
    // Offset: 0x50
    UnityEngine::ParticleSystem::EmissionModule burnPSEmission;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Awake()
    // Offset: 0x10B0E0C
    void Awake();
    // public System.Void Init(NoteData noteData, System.Single jumpLength, System.Single jumpDuration, System.Single jumpGravity, System.Single ribbonWidth)
    // Offset: 0x10B0EEC
    void Init(GlobalNamespace::NoteData* noteData, float jumpLength, float jumpDuration, float jumpGravity, float ribbonWidth);
    // public System.Void SetSplitPoint(UnityEngine.Vector2 splitPoint)
    // Offset: 0x10B1034
    void SetSplitPoint(UnityEngine::Vector2 splitPoint);
    // public System.Void set_enableEmission(System.Boolean value)
    // Offset: 0x10B0E7C
    void set_enableEmission(bool value);
    // public System.Void set_hide(System.Boolean value)
    // Offset: 0x10B1160
    void set_hide(bool value);
    // public System.Void .ctor()
    // Offset: 0x10B11C4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static NoteRibbonCutEffect* New_ctor();
  }; // NoteRibbonCutEffect
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::NoteRibbonCutEffect*, "", "NoteRibbonCutEffect");
#pragma pack(pop)
