// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: BeatmapObjectData
#include "GlobalNamespace/BeatmapObjectData.hpp"
// Including type: ColorType
#include "GlobalNamespace/ColorType.hpp"
// Including type: NoteCutDirection
#include "GlobalNamespace/NoteCutDirection.hpp"
// Including type: NoteLineLayer
#include "GlobalNamespace/NoteLineLayer.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: GameplayType because it is already included!
  // Skipping declaration: ScoringType because it is already included!
  // Skipping declaration: BeatmapDataItem because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: NoteData
  class NoteData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::NoteData);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::NoteData*, "", "NoteData");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x54
  #pragma pack(push, 1)
  // Autogenerated type: NoteData
  // [TokenAttribute] Offset: FFFFFFFF
  class NoteData : public ::GlobalNamespace::BeatmapObjectData {
    public:
    // Nested type: ::GlobalNamespace::NoteData::GameplayType
    struct GameplayType;
    // Nested type: ::GlobalNamespace::NoteData::ScoringType
    struct ScoringType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: NoteData/GameplayType
    // [TokenAttribute] Offset: FFFFFFFF
    struct GameplayType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GameplayType
      constexpr GameplayType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public NoteData/GameplayType Normal
      static constexpr const int Normal = 0;
      // Get static field: static public NoteData/GameplayType Normal
      static ::GlobalNamespace::NoteData::GameplayType _get_Normal();
      // Set static field: static public NoteData/GameplayType Normal
      static void _set_Normal(::GlobalNamespace::NoteData::GameplayType value);
      // static field const value: static public NoteData/GameplayType Bomb
      static constexpr const int Bomb = 1;
      // Get static field: static public NoteData/GameplayType Bomb
      static ::GlobalNamespace::NoteData::GameplayType _get_Bomb();
      // Set static field: static public NoteData/GameplayType Bomb
      static void _set_Bomb(::GlobalNamespace::NoteData::GameplayType value);
      // static field const value: static public NoteData/GameplayType BurstSliderHead
      static constexpr const int BurstSliderHead = 2;
      // Get static field: static public NoteData/GameplayType BurstSliderHead
      static ::GlobalNamespace::NoteData::GameplayType _get_BurstSliderHead();
      // Set static field: static public NoteData/GameplayType BurstSliderHead
      static void _set_BurstSliderHead(::GlobalNamespace::NoteData::GameplayType value);
      // static field const value: static public NoteData/GameplayType BurstSliderElement
      static constexpr const int BurstSliderElement = 3;
      // Get static field: static public NoteData/GameplayType BurstSliderElement
      static ::GlobalNamespace::NoteData::GameplayType _get_BurstSliderElement();
      // Set static field: static public NoteData/GameplayType BurstSliderElement
      static void _set_BurstSliderElement(::GlobalNamespace::NoteData::GameplayType value);
      // static field const value: static public NoteData/GameplayType BurstSliderElementFill
      static constexpr const int BurstSliderElementFill = 4;
      // Get static field: static public NoteData/GameplayType BurstSliderElementFill
      static ::GlobalNamespace::NoteData::GameplayType _get_BurstSliderElementFill();
      // Set static field: static public NoteData/GameplayType BurstSliderElementFill
      static void _set_BurstSliderElementFill(::GlobalNamespace::NoteData::GameplayType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // NoteData/GameplayType
    #pragma pack(pop)
    static check_size<sizeof(NoteData::GameplayType), 0 + sizeof(int)> __GlobalNamespace_NoteData_GameplayTypeSizeCheck;
    static_assert(sizeof(NoteData::GameplayType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: NoteData/ScoringType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ScoringType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ScoringType
      constexpr ScoringType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public NoteData/ScoringType Ignore
      static constexpr const int Ignore = -1;
      // Get static field: static public NoteData/ScoringType Ignore
      static ::GlobalNamespace::NoteData::ScoringType _get_Ignore();
      // Set static field: static public NoteData/ScoringType Ignore
      static void _set_Ignore(::GlobalNamespace::NoteData::ScoringType value);
      // static field const value: static public NoteData/ScoringType NoScore
      static constexpr const int NoScore = 0;
      // Get static field: static public NoteData/ScoringType NoScore
      static ::GlobalNamespace::NoteData::ScoringType _get_NoScore();
      // Set static field: static public NoteData/ScoringType NoScore
      static void _set_NoScore(::GlobalNamespace::NoteData::ScoringType value);
      // static field const value: static public NoteData/ScoringType Normal
      static constexpr const int Normal = 1;
      // Get static field: static public NoteData/ScoringType Normal
      static ::GlobalNamespace::NoteData::ScoringType _get_Normal();
      // Set static field: static public NoteData/ScoringType Normal
      static void _set_Normal(::GlobalNamespace::NoteData::ScoringType value);
      // static field const value: static public NoteData/ScoringType SliderHead
      static constexpr const int SliderHead = 2;
      // Get static field: static public NoteData/ScoringType SliderHead
      static ::GlobalNamespace::NoteData::ScoringType _get_SliderHead();
      // Set static field: static public NoteData/ScoringType SliderHead
      static void _set_SliderHead(::GlobalNamespace::NoteData::ScoringType value);
      // static field const value: static public NoteData/ScoringType SliderTail
      static constexpr const int SliderTail = 3;
      // Get static field: static public NoteData/ScoringType SliderTail
      static ::GlobalNamespace::NoteData::ScoringType _get_SliderTail();
      // Set static field: static public NoteData/ScoringType SliderTail
      static void _set_SliderTail(::GlobalNamespace::NoteData::ScoringType value);
      // static field const value: static public NoteData/ScoringType BurstSliderHead
      static constexpr const int BurstSliderHead = 4;
      // Get static field: static public NoteData/ScoringType BurstSliderHead
      static ::GlobalNamespace::NoteData::ScoringType _get_BurstSliderHead();
      // Set static field: static public NoteData/ScoringType BurstSliderHead
      static void _set_BurstSliderHead(::GlobalNamespace::NoteData::ScoringType value);
      // static field const value: static public NoteData/ScoringType BurstSliderElement
      static constexpr const int BurstSliderElement = 5;
      // Get static field: static public NoteData/ScoringType BurstSliderElement
      static ::GlobalNamespace::NoteData::ScoringType _get_BurstSliderElement();
      // Set static field: static public NoteData/ScoringType BurstSliderElement
      static void _set_BurstSliderElement(::GlobalNamespace::NoteData::ScoringType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // NoteData/ScoringType
    #pragma pack(pop)
    static check_size<sizeof(NoteData::ScoringType), 0 + sizeof(int)> __GlobalNamespace_NoteData_ScoringTypeSizeCheck;
    static_assert(sizeof(NoteData::ScoringType) == 0x4);
    public:
    // private NoteData/GameplayType <gameplayType>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    ::GlobalNamespace::NoteData::GameplayType gameplayType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteData::GameplayType) == 0x4);
    // private NoteData/ScoringType <scoringType>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    ::GlobalNamespace::NoteData::ScoringType scoringType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteData::ScoringType) == 0x4);
    // private ColorType <colorType>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    ::GlobalNamespace::ColorType colorType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ColorType) == 0x4);
    // private NoteCutDirection <cutDirection>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    ::GlobalNamespace::NoteCutDirection cutDirection;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteCutDirection) == 0x4);
    // private System.Single <timeToNextColorNote>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    float timeToNextColorNote;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <timeToPrevColorNote>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    float timeToPrevColorNote;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <lineIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    int lineIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private NoteLineLayer <noteLineLayer>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    ::GlobalNamespace::NoteLineLayer noteLineLayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteLineLayer) == 0x4);
    // private NoteLineLayer <beforeJumpNoteLineLayer>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    ::GlobalNamespace::NoteLineLayer beforeJumpNoteLineLayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteLineLayer) == 0x4);
    // private System.Int32 <flipLineIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x44
    int flipLineIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <flipYSide>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    float flipYSide;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <cutDirectionAngleOffset>k__BackingField
    // Size: 0x4
    // Offset: 0x4C
    float cutDirectionAngleOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <cutSfxVolumeMultiplier>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    float cutSfxVolumeMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private NoteData/GameplayType <gameplayType>k__BackingField
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::NoteData::GameplayType& dyn_$gameplayType$k__BackingField();
    // Get instance field reference: private NoteData/ScoringType <scoringType>k__BackingField
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::NoteData::ScoringType& dyn_$scoringType$k__BackingField();
    // Get instance field reference: private ColorType <colorType>k__BackingField
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::ColorType& dyn_$colorType$k__BackingField();
    // Get instance field reference: private NoteCutDirection <cutDirection>k__BackingField
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::NoteCutDirection& dyn_$cutDirection$k__BackingField();
