// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: NoteCutSoundEffect
#include "GlobalNamespace/NoteCutSoundEffect.hpp"
// Including type: BeatmapObjectCallbackController
#include "GlobalNamespace/BeatmapObjectCallbackController.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AudioManagerSO
  class AudioManagerSO;
  // Forward declaring type: BeatmapObjectManager
  class BeatmapObjectManager;
  // Forward declaring type: PlayerController
  class PlayerController;
  // Forward declaring type: RandomObjectPicker`1<T>
  template<typename T>
  class RandomObjectPicker_1;
  // Forward declaring type: AudioTimeSyncController
  class AudioTimeSyncController;
  // Forward declaring type: BeatmapObjectData
  class BeatmapObjectData;
  // Forward declaring type: INoteController
  class INoteController;
  // Forward declaring type: NoteCutInfo
  class NoteCutInfo;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: NoteCutSoundEffectManager
  class NoteCutSoundEffectManager : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::NoteCutSoundEffectManager::InitData
    class InitData;
    // private AudioManagerSO _audioManager
    // Offset: 0x18
    GlobalNamespace::AudioManagerSO* audioManager;
    // private System.Single _audioSamplesBeatAlignOffset
    // Offset: 0x20
    float audioSamplesBeatAlignOffset;
    // private UnityEngine.AudioClip[] _longCutEffectsAudioClips
    // Offset: 0x28
    ::Array<UnityEngine::AudioClip*>* longCutEffectsAudioClips;
    // private UnityEngine.AudioClip[] _shortCutEffectsAudioClips
    // Offset: 0x30
    ::Array<UnityEngine::AudioClip*>* shortCutEffectsAudioClips;
    // private UnityEngine.AudioClip _testAudioClip
    // Offset: 0x38
    UnityEngine::AudioClip* testAudioClip;
    // private NoteCutSoundEffectManager/InitData _initData
    // Offset: 0x40
    GlobalNamespace::NoteCutSoundEffectManager::InitData* initData;
    // private BeatmapObjectManager _beatmapObjectManager
    // Offset: 0x48
    GlobalNamespace::BeatmapObjectManager* beatmapObjectManager;
    // private PlayerController _playerController
    // Offset: 0x50
    GlobalNamespace::PlayerController* playerController;
    // private BeatmapObjectCallbackController _beatmapObjectCallbackController
    // Offset: 0x58
    GlobalNamespace::BeatmapObjectCallbackController* beatmapObjectCallbackController;
    // private NoteCutSoundEffect/Pool _noteCutSoundEffectPool
    // Offset: 0x60
    GlobalNamespace::NoteCutSoundEffect::Pool* noteCutSoundEffectPool;
    // private AudioTimeSyncController _audioTimeSyncController
    // Offset: 0x68
    GlobalNamespace::AudioTimeSyncController* audioTimeSyncController;
    // private System.Boolean <handleWrongSaberTypeAsGood>k__BackingField
    // Offset: 0x70
    bool handleWrongSaberTypeAsGood;
    // private BeatmapObjectCallbackController/BeatmapObjectCallbackData _beatmapObjectCallbackData
    // Offset: 0x78
    GlobalNamespace::BeatmapObjectCallbackController::BeatmapObjectCallbackData* beatmapObjectCallbackData;
    // private RandomObjectPicker`1<UnityEngine.AudioClip> _randomLongCutSoundPicker
    // Offset: 0x80
    GlobalNamespace::RandomObjectPicker_1<UnityEngine::AudioClip*>* randomLongCutSoundPicker;
    // private RandomObjectPicker`1<UnityEngine.AudioClip> _randomShortCutSoundPicker
    // Offset: 0x88
    GlobalNamespace::RandomObjectPicker_1<UnityEngine::AudioClip*>* randomShortCutSoundPicker;
    // private System.Single _prevNoteATime
    // Offset: 0x90
    float prevNoteATime;
    // private System.Single _prevNoteBTime
    // Offset: 0x94
    float prevNoteBTime;
    // private NoteCutSoundEffect _prevNoteASoundEffect
    // Offset: 0x98
    GlobalNamespace::NoteCutSoundEffect* prevNoteASoundEffect;
    // private NoteCutSoundEffect _prevNoteBSoundEffect
    // Offset: 0xA0
    GlobalNamespace::NoteCutSoundEffect* prevNoteBSoundEffect;
    // private System.Single _beatAlignOffset
    // Offset: 0xA8
    float beatAlignOffset;
    // private System.Boolean _useTestAudioClips
    // Offset: 0xAC
    bool useTestAudioClips;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Int32 kMaxNumberOfEffects
    static constexpr const int kMaxNumberOfEffects = 64;
    // Get static field: static private System.Int32 kMaxNumberOfEffects
    static int _get_kMaxNumberOfEffects();
    // Set static field: static private System.Int32 kMaxNumberOfEffects
    static void _set_kMaxNumberOfEffects(int value);
    // static field const value: static private System.Single kTwoNotesAtTheSameTimeVolumeMul
    static constexpr const float kTwoNotesAtTheSameTimeVolumeMul = 0.9;
    // Get static field: static private System.Single kTwoNotesAtTheSameTimeVolumeMul
    static float _get_kTwoNotesAtTheSameTimeVolumeMul();
    // Set static field: static private System.Single kTwoNotesAtTheSameTimeVolumeMul
    static void _set_kTwoNotesAtTheSameTimeVolumeMul(float value);
    // static field const value: static private System.Single kDenseNotesVolumeMul
    static constexpr const float kDenseNotesVolumeMul = 0.9;
    // Get static field: static private System.Single kDenseNotesVolumeMul
    static float _get_kDenseNotesVolumeMul();
    // Set static field: static private System.Single kDenseNotesVolumeMul
    static void _set_kDenseNotesVolumeMul(float value);
    // public System.Boolean get_handleWrongSaberTypeAsGood()
    // Offset: 0xC1865C
    bool get_handleWrongSaberTypeAsGood();
    // public System.Void set_handleWrongSaberTypeAsGood(System.Boolean value)
    // Offset: 0xC18664
    void set_handleWrongSaberTypeAsGood(bool value);
    // protected System.Void Start()
    // Offset: 0xC18670
    void Start();
    // protected System.Void OnDestroy()
    // Offset: 0xC1887C
    void OnDestroy();
    // private System.Void BeatmapObjectCallback(BeatmapObjectData beatmapObjectData)
    // Offset: 0xC18994
    void BeatmapObjectCallback(GlobalNamespace::BeatmapObjectData* beatmapObjectData);
    // private System.Void HandleNoteWasCut(INoteController noteController, NoteCutInfo noteCutInfo)
    // Offset: 0xC18E4C
    void HandleNoteWasCut(GlobalNamespace::INoteController* noteController, GlobalNamespace::NoteCutInfo* noteCutInfo);
    // private System.Void HandleCutSoundEffectDidFinish(NoteCutSoundEffect cutSoundEffect)
    // Offset: 0xC18F68
    void HandleCutSoundEffectDidFinish(GlobalNamespace::NoteCutSoundEffect* cutSoundEffect);
    // public System.Void Pause()
    // Offset: 0xC19014
    void Pause();
    // public System.Void Resume()
    // Offset: 0xC19110
    void Resume();
    // public System.Void .ctor()
    // Offset: 0xC19254
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static NoteCutSoundEffectManager* New_ctor();
  }; // NoteCutSoundEffectManager
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::NoteCutSoundEffectManager*, "", "NoteCutSoundEffectManager");
#pragma pack(pop)
