// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PlayerTransforms
  class PlayerTransforms;
  // Forward declaring type: PlayerSpaceConvertor
  class PlayerSpaceConvertor;
  // Forward declaring type: IAudioTimeSource
  class IAudioTimeSource;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: NoteJump
  class NoteJump;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::NoteJump);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::NoteJump*, "", "NoteJump");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x119
  #pragma pack(push, 1)
  // Autogenerated type: NoteJump
  // [TokenAttribute] Offset: FFFFFFFF
  class NoteJump : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Transform _rotatedObject
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Transform* rotatedObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [SpaceAttribute] Offset: 0x1114818
    // private System.Single _yAvoidanceUp
    // Size: 0x4
    // Offset: 0x20
    float yAvoidanceUp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _yAvoidanceDown
    // Size: 0x4
    // Offset: 0x24
    float yAvoidanceDown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x1114860
    // private System.Single _endDistanceOffset
    // Size: 0x4
    // Offset: 0x28
    float endDistanceOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: endDistanceOffset and: playerTransforms
    char __padding3[0x4] = {};
    // [InjectAttribute] Offset: 0x1114898
    // private readonly PlayerTransforms _playerTransforms
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::PlayerTransforms* playerTransforms;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerTransforms*) == 0x8);
    // [InjectAttribute] Offset: 0x11148A8
    // private readonly PlayerSpaceConvertor _playerSpaceConvertor
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::PlayerSpaceConvertor* playerSpaceConvertor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerSpaceConvertor*) == 0x8);
    // [InjectAttribute] Offset: 0x11148B8
    // private readonly IAudioTimeSource _audioTimeSyncController
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::IAudioTimeSource* audioTimeSyncController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IAudioTimeSource*) == 0x8);
    // private System.Action noteJumpDidFinishEvent
    // Size: 0x8
    // Offset: 0x48
    ::System::Action* noteJumpDidFinishEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action noteJumpDidPassMissedMarkerEvent
    // Size: 0x8
    // Offset: 0x50
    ::System::Action* noteJumpDidPassMissedMarkerEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<NoteJump> noteJumpDidPassThreeQuartersEvent
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_1<::GlobalNamespace::NoteJump*>* noteJumpDidPassThreeQuartersEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::NoteJump*>*) == 0x8);
    // private System.Action noteJumpDidPassHalfEvent
    // Size: 0x8
    // Offset: 0x60
    ::System::Action* noteJumpDidPassHalfEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<System.Single> noteJumpDidUpdateProgressEvent
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_1<float>* noteJumpDidUpdateProgressEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<float>*) == 0x8);
    // private UnityEngine.Vector3 _startPos
    // Size: 0xC
    // Offset: 0x70
    ::UnityEngine::Vector3 startPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _endPos
    // Size: 0xC
    // Offset: 0x7C
    ::UnityEngine::Vector3 endPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single _jumpDuration
    // Size: 0x4
    // Offset: 0x88
    float jumpDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _moveVec
    // Size: 0xC
    // Offset: 0x8C
    ::UnityEngine::Vector3 moveVec;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single _beatTime
    // Size: 0x4
    // Offset: 0x98
    float beatTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _startVerticalVelocity
    // Size: 0x4
    // Offset: 0x9C
    float startVerticalVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion _startRotation
    // Size: 0x10
    // Offset: 0xA0
    ::UnityEngine::Quaternion startRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion _middleRotation
    // Size: 0x10
    // Offset: 0xB0
    ::UnityEngine::Quaternion middleRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion _endRotation
    // Size: 0x10
    // Offset: 0xC0
    ::UnityEngine::Quaternion endRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single _gravity
    // Size: 0x4
    // Offset: 0xD0
    float gravity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _yAvoidance
    // Size: 0x4
    // Offset: 0xD4
    float yAvoidance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _missedTime
    // Size: 0x4
    // Offset: 0xD8
    float missedTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _missedMarkReported
    // Size: 0x1
    // Offset: 0xDC
    bool missedMarkReported;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _threeQuartersMarkReported
    // Size: 0x1
    // Offset: 0xDD
    bool threeQuartersMarkReported;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _halfJumpMarkReported
    // Size: 0x1
    // Offset: 0xDE
    bool halfJumpMarkReported;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: halfJumpMarkReported and: localPosition
    char __padding26[0x1] = {};
    // private UnityEngine.Vector3 _localPosition
    // Size: 0xC
    // Offset: 0xE0
    ::UnityEngine::Vector3 localPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: localPosition and: randomRotations
    char __padding27[0x4] = {};
    // private readonly UnityEngine.Vector3[] _randomRotations
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<::UnityEngine::Vector3> randomRotations;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Quaternion _worldRotation
    // Size: 0x10
    // Offset: 0xF8
    ::UnityEngine::Quaternion worldRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion _inverseWorldRotation
    // Size: 0x10
    // Offset: 0x108
    ::UnityEngine::Quaternion inverseWorldRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Boolean _rotateTowardsPlayer
    // Size: 0x1
    // Offset: 0x118
    bool rotateTowardsPlayer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.Single kMissedTimeOffset
    static constexpr const float kMissedTimeOffset = 0.15;
    // Get static field: static public System.Single kMissedTimeOffset
    static float _get_kMissedTimeOffset();
    // Set static field: static public System.Single kMissedTimeOffset
    static void _set_kMissedTimeOffset(float value);
    // Get instance field reference: private UnityEngine.Transform _rotatedObject
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn__rotatedObject();
    // Get instance field reference: private System.Single _yAvoidanceUp
    [[deprecated("Use field access instead!")]] float& dyn__yAvoidanceUp();
