// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PlayerTransforms
  class PlayerTransforms;
  // Forward declaring type: AudioTimeSyncController
  class AudioTimeSyncController;
  // Forward declaring type: ColorManager
  class ColorManager;
  // Forward declaring type: NoteController
  class NoteController;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: LineRenderer
  class LineRenderer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: NoteLineConnectionController
  class NoteLineConnectionController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::NoteLineConnectionController::Pool
    class Pool;
    // private UnityEngine.LineRenderer _lineRenderer
    // Offset: 0x18
    UnityEngine::LineRenderer* lineRenderer;
    // private readonly PlayerTransforms _playerTransforms
    // Offset: 0x20
    GlobalNamespace::PlayerTransforms* playerTransforms;
    // private readonly AudioTimeSyncController _audioTimeSyncController
    // Offset: 0x28
    GlobalNamespace::AudioTimeSyncController* audioTimeSyncController;
    // private readonly ColorManager _colorManager
    // Offset: 0x30
    GlobalNamespace::ColorManager* colorManager;
    // private System.Action`1<NoteLineConnectionController> didFinishEvent
    // Offset: 0x38
    System::Action_1<GlobalNamespace::NoteLineConnectionController*>* didFinishEvent;
    // private NoteController _noteController0
    // Offset: 0x40
    GlobalNamespace::NoteController* noteController0;
    // private NoteController _noteController1
    // Offset: 0x48
    GlobalNamespace::NoteController* noteController1;
    // private UnityEngine.Color _color0
    // Offset: 0x50
    UnityEngine::Color color0;
    // private UnityEngine.Color _color1
    // Offset: 0x60
    UnityEngine::Color color1;
    // private System.Single _fadeOutStartDistance
    // Offset: 0x70
    float fadeOutStartDistance;
    // private System.Single _fadeOutEndDistance
    // Offset: 0x74
    float fadeOutEndDistance;
    // private System.Single _noteTime
    // Offset: 0x78
    float noteTime;
    // private System.Boolean _didFinish
    // Offset: 0x7C
    bool didFinish;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_didFinishEvent(System.Action`1<NoteLineConnectionController> value)
    // Offset: 0xFE9014
    void add_didFinishEvent(System::Action_1<GlobalNamespace::NoteLineConnectionController*>* value);
    // public System.Void remove_didFinishEvent(System.Action`1<NoteLineConnectionController> value)
    // Offset: 0xFE90B8
    void remove_didFinishEvent(System::Action_1<GlobalNamespace::NoteLineConnectionController*>* value);
    // public System.Void Setup(NoteController noteController0, NoteController noteController1, System.Single fadeOutStartDistance, System.Single fadeOutEndDistance, System.Single noteTime)
    // Offset: 0xFE915C
    void Setup(GlobalNamespace::NoteController* noteController0, GlobalNamespace::NoteController* noteController1, float fadeOutStartDistance, float fadeOutEndDistance, float noteTime);
    // protected System.Void Update()
    // Offset: 0xFE941C
    void Update();
    // private System.Void UpdatePositionsAndColors()
    // Offset: 0xFE9230
    void UpdatePositionsAndColors();
    // public System.Void .ctor()
    // Offset: 0xFE94B4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static NoteLineConnectionController* New_ctor();
  }; // NoteLineConnectionController
  check_size<sizeof(NoteLineConnectionController), 124 + sizeof(bool) + 8 - (124 + sizeof(bool)) % 8> __GlobalNamespace_NoteLineConnectionControllerSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::NoteLineConnectionController*, "", "NoteLineConnectionController");
#pragma pack(pop)
