// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: ObstacleControllerBase
#include "GlobalNamespace/ObstacleControllerBase.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: StretchableObstacle
  class StretchableObstacle;
  // Forward declaring type: PlayerTransforms
  class PlayerTransforms;
  // Forward declaring type: IAudioTimeSource
  class IAudioTimeSource;
  // Forward declaring type: ColorManager
  class ColorManager;
  // Forward declaring type: ObstacleData
  class ObstacleData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x120
  #pragma pack(push, 1)
  // Autogenerated type: ObstacleController
  class ObstacleController : public GlobalNamespace::ObstacleControllerBase {
    public:
    // Nested type: GlobalNamespace::ObstacleController::Pool
    class Pool;
    // Nested type: GlobalNamespace::ObstacleController::$DissolveCoroutine$d__69
    class $DissolveCoroutine$d__69;
    // private StretchableObstacle _stretchableObstacle
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::StretchableObstacle* stretchableObstacle;
    // Field size check
    static_assert(sizeof(GlobalNamespace::StretchableObstacle*) == 0x8);
    // [SpaceAttribute] Offset: 0xE19894
    // private System.Single _endDistanceOffset
    // Size: 0x4
    // Offset: 0x30
    float endDistanceOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: endDistanceOffset and: visualWrappers
    char __padding1[0x4] = {};
    // private UnityEngine.GameObject[] _visualWrappers
    // Size: 0x8
    // Offset: 0x38
    ::Array<UnityEngine::GameObject*>* visualWrappers;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::GameObject*>*) == 0x8);
    // [InjectAttribute] Offset: 0xE198DC
    // private readonly PlayerTransforms _playerTransforms
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::PlayerTransforms* playerTransforms;
    // Field size check
    static_assert(sizeof(GlobalNamespace::PlayerTransforms*) == 0x8);
    // [InjectAttribute] Offset: 0xE198EC
    // private readonly IAudioTimeSource _audioTimeSyncController
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::IAudioTimeSource* audioTimeSyncController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IAudioTimeSource*) == 0x8);
    // [InjectAttribute] Offset: 0xE198FC
    // private readonly ColorManager _colorManager
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::ColorManager* colorManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorManager*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1990C
    // private System.Action`1<ObstacleController> finishedMovementEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action_1<GlobalNamespace::ObstacleController*>* finishedMovementEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::ObstacleController*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1991C
    // private System.Action`1<ObstacleController> passedThreeQuartersOfMove2Event
    // Size: 0x8
    // Offset: 0x60
    System::Action_1<GlobalNamespace::ObstacleController*>* passedThreeQuartersOfMove2Event;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::ObstacleController*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1992C
    // private System.Action`1<ObstacleController> passedAvoidedMarkEvent
    // Size: 0x8
    // Offset: 0x68
    System::Action_1<GlobalNamespace::ObstacleController*>* passedAvoidedMarkEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::ObstacleController*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1993C
    // private System.Action`1<ObstacleController> didDissolveEvent
    // Size: 0x8
    // Offset: 0x70
    System::Action_1<GlobalNamespace::ObstacleController*>* didDissolveEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::ObstacleController*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE1994C
    // private System.Action`2<ObstacleController,System.Single> didUpdateProgress
    // Size: 0x8
    // Offset: 0x78
    System::Action_2<GlobalNamespace::ObstacleController*, float>* didUpdateProgress;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::ObstacleController*, float>*) == 0x8);
    // private System.Single _width
    // Size: 0x4
    // Offset: 0x80
    float width;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _height
    // Size: 0x4
    // Offset: 0x84
    float height;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _length
    // Size: 0x4
    // Offset: 0x88
    float length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _startPos
    // Size: 0xC
    // Offset: 0x8C
    UnityEngine::Vector3 startPos;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _midPos
    // Size: 0xC
    // Offset: 0x98
    UnityEngine::Vector3 midPos;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _endPos
    // Size: 0xC
    // Offset: 0xA4
    UnityEngine::Vector3 endPos;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private System.Single _move1Duration
    // Size: 0x4
    // Offset: 0xB0
    float move1Duration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _move2Duration
    // Size: 0x4
    // Offset: 0xB4
    float move2Duration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _startTimeOffset
    // Size: 0x4
    // Offset: 0xB8
    float startTimeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _obstacleDuration
    // Size: 0x4
    // Offset: 0xBC
    float obstacleDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _passedThreeQuartersOfMove2Reported
    // Size: 0x1
    // Offset: 0xC0
    bool passedThreeQuartersOfMove2Reported;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _passedAvoidedMarkReported
    // Size: 0x1
    // Offset: 0xC1
    bool passedAvoidedMarkReported;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: passedAvoidedMarkReported and: passedAvoidedMarkTime
    char __padding22[0x2] = {};
    // private System.Single _passedAvoidedMarkTime
    // Size: 0x4
    // Offset: 0xC4
    float passedAvoidedMarkTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _finishMovementTime
    // Size: 0x4
    // Offset: 0xC8
    float finishMovementTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Bounds _bounds
    // Size: 0x18
    // Offset: 0xCC
    UnityEngine::Bounds bounds;
    // Field size check
    static_assert(sizeof(UnityEngine::Bounds) == 0x18);
    // private System.Boolean _dissolving
    // Size: 0x1
    // Offset: 0xE4
    bool dissolving;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: dissolving and: obstacleData
    char __padding26[0x3] = {};
    // private ObstacleData _obstacleData
    // Size: 0x8
    // Offset: 0xE8
    GlobalNamespace::ObstacleData* obstacleData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ObstacleData*) == 0x8);
    // private UnityEngine.Color _color
    // Size: 0x10
    // Offset: 0xF0
    UnityEngine::Color color;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // private UnityEngine.Quaternion _worldRotation
    // Size: 0x10
    // Offset: 0x100
    UnityEngine::Quaternion worldRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion _inverseWorldRotation
    // Size: 0x10
    // Offset: 0x110
    UnityEngine::Quaternion inverseWorldRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // Creating value type constructor for type: ObstacleController
