// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: OculusNetworkPlayerModel
#include "GlobalNamespace/OculusNetworkPlayerModel.hpp"
// Including type: INetworkPlayer
#include "GlobalNamespace/INetworkPlayer.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: Room
  class Room;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatmapDifficultyMask
  struct BeatmapDifficultyMask;
  // Forward declaring type: GameplayModifierMask
  struct GameplayModifierMask;
  // Forward declaring type: SongPackMask
  struct SongPackMask;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message`1<T>
  template<typename T>
  class Message_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x4E
  #pragma pack(push, 1)
  // Autogenerated type: OculusNetworkPlayerModel/OculusNetworkPlayer
  class OculusNetworkPlayerModel::OculusNetworkPlayer : public ::Il2CppObject/*, public GlobalNamespace::INetworkPlayer*/ {
    public:
    // private readonly OculusNetworkPlayerModel _playerModel
    // Size: 0x8
    // Offset: 0x10
    GlobalNamespace::OculusNetworkPlayerModel* playerModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OculusNetworkPlayerModel*) == 0x8);
    // private readonly System.UInt64 _id
    // Size: 0x8
    // Offset: 0x18
    uint64_t id;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private readonly System.String _userId
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* userId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.String _userName
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* userName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.Boolean _isMe
    // Size: 0x1
    // Offset: 0x30
    bool isMe;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean removed
    // Size: 0x1
    // Offset: 0x31
    bool removed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: removed and: inviteToken
    char __padding5[0x6] = {};
    // public System.String inviteToken
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* inviteToken;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public Oculus.Platform.Models.Room room
    // Size: 0x8
    // Offset: 0x40
    Oculus::Platform::Models::Room* room;
    // Field size check
    static_assert(sizeof(Oculus::Platform::Models::Room*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE2A090
    // private System.Boolean <isPlayer>k__BackingField
    // Size: 0x1
    // Offset: 0x48
    bool isPlayer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xE2A0A0
    // private System.Boolean <isSpectating>k__BackingField
    // Size: 0x1
    // Offset: 0x49
    bool isSpectating;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xE2A0B0
    // private System.Boolean <isDedicatedServer>k__BackingField
    // Size: 0x1
    // Offset: 0x4A
    bool isDedicatedServer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xE2A0C0
    // private System.Boolean <isConnected>k__BackingField
    // Size: 0x1
    // Offset: 0x4B
    bool isConnected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xE2A0D0
    // private System.Boolean <isWaitingOnJoin>k__BackingField
    // Size: 0x1
    // Offset: 0x4C
    bool isWaitingOnJoin;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xE2A0E0
    // private System.Boolean <isWaitingOnInvite>k__BackingField
    // Size: 0x1
    // Offset: 0x4D
    bool isWaitingOnInvite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: OculusNetworkPlayer
    OculusNetworkPlayer(GlobalNamespace::OculusNetworkPlayerModel* playerModel_ = {}, uint64_t id_ = {}, ::Il2CppString* userId_ = {}, ::Il2CppString* userName_ = {}, bool isMe_ = {}, bool removed_ = {}, ::Il2CppString* inviteToken_ = {}, Oculus::Platform::Models::Room* room_ = {}, bool isPlayer_ = {}, bool isSpectating_ = {}, bool isDedicatedServer_ = {}, bool isConnected_ = {}, bool isWaitingOnJoin_ = {}, bool isWaitingOnInvite_ = {}) noexcept : playerModel{playerModel_}, id{id_}, userId{userId_}, userName{userName_}, isMe{isMe_}, removed{removed_}, inviteToken{inviteToken_}, room{room_}, isPlayer{isPlayer_}, isSpectating{isSpectating_}, isDedicatedServer{isDedicatedServer_}, isConnected{isConnected_}, isWaitingOnJoin{isWaitingOnJoin_}, isWaitingOnInvite{isWaitingOnInvite_} {}
    // Creating interface conversion operator: operator GlobalNamespace::INetworkPlayer
    operator GlobalNamespace::INetworkPlayer() noexcept {
      return *reinterpret_cast<GlobalNamespace::INetworkPlayer*>(this);
    }
    // public System.UInt64 get_id()
    // Offset: 0x11E924C
    uint64_t get_id();
    // public System.String get_userId()
    // Offset: 0x11E9254
    ::Il2CppString* get_userId();
    // public System.String get_userName()
    // Offset: 0x11E925C
    ::Il2CppString* get_userName();
    // public System.Boolean get_isMe()
    // Offset: 0x11E9264
    bool get_isMe();
    // public System.Boolean get_isPartyOwner()
    // Offset: 0x11E63EC
    bool get_isPartyOwner();
    // public System.Boolean get_isRoomOwner()
    // Offset: 0x11E926C
    bool get_isRoomOwner();
    // public System.Int32 get_currentPartySize()
    // Offset: 0x11E9308
    int get_currentPartySize();
    // public System.Int32 get_maxPartySize()
    // Offset: 0x11E93D4
    int get_maxPartySize();
    // public BeatmapDifficultyMask get_difficulties()
    // Offset: 0x11E948C
    GlobalNamespace::BeatmapDifficultyMask get_difficulties();
    // public GameplayModifierMask get_modifiers()
    // Offset: 0x11E9530
    GlobalNamespace::GameplayModifierMask get_modifiers();
    // public SongPackMask get_songPacks()
    // Offset: 0x11E95D4
    GlobalNamespace::SongPackMask get_songPacks();
    // public System.Void .ctor(OculusNetworkPlayerModel playerModel, System.UInt64 id, System.String userName, System.Boolean isMe)
    // Offset: 0x11E76E0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OculusNetworkPlayerModel::OculusNetworkPlayer* New_ctor(GlobalNamespace::OculusNetworkPlayerModel* playerModel, uint64_t id, ::Il2CppString* userName, bool isMe) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OculusNetworkPlayerModel::OculusNetworkPlayer*, creationType>(playerModel, id, userName, isMe)));
    }
    // public System.Boolean get_isMyPartyOwner()
    // Offset: 0x11E967C
    bool get_isMyPartyOwner();
    // public System.Boolean get_isOpenParty()
    // Offset: 0x11E96F8
    bool get_isOpenParty();
    // public System.Boolean get_isPlayer()
    // Offset: 0x11E9718
    bool get_isPlayer();
    // public System.Void set_isPlayer(System.Boolean value)
    // Offset: 0x11E9720
    void set_isPlayer(bool value);
    // public System.Boolean get_isSpectating()
    // Offset: 0x11E972C
    bool get_isSpectating();
    // public System.Void set_isSpectating(System.Boolean value)
    // Offset: 0x11E9734
    void set_isSpectating(bool value);
    // public System.Boolean get_isDedicatedServer()
    // Offset: 0x11E9740
    bool get_isDedicatedServer();
    // public System.Void set_isDedicatedServer(System.Boolean value)
    // Offset: 0x11E9748
    void set_isDedicatedServer(bool value);
    // public System.Boolean get_isConnected()
    // Offset: 0x11E9754
    bool get_isConnected();
    // public System.Void set_isConnected(System.Boolean value)
    // Offset: 0x11E975C
    void set_isConnected(bool value);
    // public System.Boolean get_canJoin()
    // Offset: 0x11E9768
    bool get_canJoin();
    // public System.Void Join()
    // Offset: 0x11E9788
    void Join();
    // public System.Boolean get_requiresPassword()
    // Offset: 0x11E986C
    bool get_requiresPassword();
    // public System.Void Join(System.String password)
    // Offset: 0x11E9874
    void Join(::Il2CppString* password);
    // public System.Boolean get_isWaitingOnJoin()
    // Offset: 0x11E9878
    bool get_isWaitingOnJoin();
    // private System.Void set_isWaitingOnJoin(System.Boolean value)
    // Offset: 0x11E9880
    void set_isWaitingOnJoin(bool value);
    // public System.Boolean get_canInvite()
    // Offset: 0x11E988C
    bool get_canInvite();
    // public System.Void Invite()
    // Offset: 0x11E990C
    void Invite();
    // public System.Boolean get_isWaitingOnInvite()
    // Offset: 0x11E9978
    bool get_isWaitingOnInvite();
    // public System.Void set_isWaitingOnInvite(System.Boolean value)
    // Offset: 0x11E9980
    void set_isWaitingOnInvite(bool value);
    // public System.Boolean get_canKick()
    // Offset: 0x11E998C
    bool get_canKick();
    // public System.Void Kick()
    // Offset: 0x11E9A08
    void Kick();
    // public System.Boolean get_canLeave()
    // Offset: 0x11E9B24
    bool get_canLeave();
    // public System.Void Leave()
    // Offset: 0x11E9BC0
    void Leave();
    // public System.Boolean get_canBlock()
    // Offset: 0x11E9BE4
    bool get_canBlock();
    // public System.Void Block()
    // Offset: 0x11E9BEC
    void Block();
    // public System.Boolean get_canUnblock()
    // Offset: 0x11E9BF0
    bool get_canUnblock();
    // public System.Void Unblock()
    // Offset: 0x11E9BF8
    void Unblock();
    // public System.Void SendJoinResponse(System.Boolean accept)
    // Offset: 0x11E9BFC
    void SendJoinResponse(bool accept);
    // public System.Void SendInviteResponse(System.Boolean accept)
    // Offset: 0x11E9C5C
    void SendInviteResponse(bool accept);
    // public System.Boolean SameRoomAs(OculusNetworkPlayerModel/OculusNetworkPlayer other)
    // Offset: 0x11E7E90
    bool SameRoomAs(GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer* other);
    // private System.Void <Join>b__53_0(Oculus.Platform.Message`1<Oculus.Platform.Models.Room> result)
    // Offset: 0x11E9C68
    void $Join$b__53_0(Oculus::Platform::Message_1<Oculus::Platform::Models::Room*>* result);
  }; // OculusNetworkPlayerModel/OculusNetworkPlayer
  #pragma pack(pop)
  static check_size<sizeof(OculusNetworkPlayerModel::OculusNetworkPlayer), 77 + sizeof(bool)> __GlobalNamespace_OculusNetworkPlayerModel_OculusNetworkPlayerSizeCheck;
  static_assert(sizeof(OculusNetworkPlayerModel::OculusNetworkPlayer) == 0x4E);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer*, "", "OculusNetworkPlayerModel/OculusNetworkPlayer");
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_id
// Il2CppName: get_id
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_userId
// Il2CppName: get_userId
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_userName
// Il2CppName: get_userName
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isMe
// Il2CppName: get_isMe
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isPartyOwner
// Il2CppName: get_isPartyOwner
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isRoomOwner
// Il2CppName: get_isRoomOwner
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_currentPartySize
// Il2CppName: get_currentPartySize
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_maxPartySize
// Il2CppName: get_maxPartySize
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_difficulties
// Il2CppName: get_difficulties
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_modifiers
// Il2CppName: get_modifiers
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_songPacks
// Il2CppName: get_songPacks
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isMyPartyOwner
// Il2CppName: get_isMyPartyOwner
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isOpenParty
// Il2CppName: get_isOpenParty
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isPlayer
// Il2CppName: get_isPlayer
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::set_isPlayer
// Il2CppName: set_isPlayer
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isSpectating
// Il2CppName: get_isSpectating
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::set_isSpectating
// Il2CppName: set_isSpectating
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isDedicatedServer
// Il2CppName: get_isDedicatedServer
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::set_isDedicatedServer
// Il2CppName: set_isDedicatedServer
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isConnected
// Il2CppName: get_isConnected
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::set_isConnected
// Il2CppName: set_isConnected
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_canJoin
// Il2CppName: get_canJoin
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::Join
// Il2CppName: Join
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_requiresPassword
// Il2CppName: get_requiresPassword
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::Join
// Il2CppName: Join
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isWaitingOnJoin
// Il2CppName: get_isWaitingOnJoin
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::set_isWaitingOnJoin
// Il2CppName: set_isWaitingOnJoin
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_canInvite
// Il2CppName: get_canInvite
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::Invite
// Il2CppName: Invite
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_isWaitingOnInvite
// Il2CppName: get_isWaitingOnInvite
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::set_isWaitingOnInvite
// Il2CppName: set_isWaitingOnInvite
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_canKick
// Il2CppName: get_canKick
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::Kick
// Il2CppName: Kick
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_canLeave
// Il2CppName: get_canLeave
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::Leave
// Il2CppName: Leave
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_canBlock
// Il2CppName: get_canBlock
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::Block
// Il2CppName: Block
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::get_canUnblock
// Il2CppName: get_canUnblock
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::Unblock
// Il2CppName: Unblock
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::SendJoinResponse
// Il2CppName: SendJoinResponse
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::SendInviteResponse
// Il2CppName: SendInviteResponse
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::SameRoomAs
// Il2CppName: SameRoomAs
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer::$Join$b__53_0
// Il2CppName: <Join>b__53_0
// Cannot perform method pointer template specialization from operators!
