// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlatformNetworkPlayerModel
#include "GlobalNamespace/PlatformNetworkPlayerModel.hpp"
// Including type: Oculus.Platform.RoomJoinPolicy
#include "Oculus/Platform/RoomJoinPolicy.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IPlatformUserModel
  class IPlatformUserModel;
  // Skipping declaration: INetworkPlayerModel because it is already included!
  // Forward declaring type: INetworkPlayer
  class INetworkPlayer;
  // Forward declaring type: OculusConnectionManager
  class OculusConnectionManager;
  // Forward declaring type: INetworkPlayerModelPartyConfig`1<T>
  class INetworkPlayerModelPartyConfig_1;
  // Forward declaring type: IConnectedPlayer
  class IConnectedPlayer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  class Action_1;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  class Task_1;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message`1<T>
  class Message_1;
}
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: RoomInviteNotification
  class RoomInviteNotification;
  // Forward declaring type: Room
  class Room;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OculusNetworkPlayerModel
  class OculusNetworkPlayerModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(GlobalNamespace::OculusNetworkPlayerModel);
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OculusNetworkPlayerModel*, "", "OculusNetworkPlayerModel");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: OculusNetworkPlayerModel
  // [TokenAttribute] Offset: FFFFFFFF
  class OculusNetworkPlayerModel : public GlobalNamespace::PlatformNetworkPlayerModel {
    public:
    // Nested type: GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer
    class OculusNetworkPlayer;
    // Nested type: GlobalNamespace::OculusNetworkPlayerModel::$Start$d__42
    struct $Start$d__42;
    // Nested type: GlobalNamespace::OculusNetworkPlayerModel::$$c__DisplayClass50_0
    class $$c__DisplayClass50_0;
    // Nested type: GlobalNamespace::OculusNetworkPlayerModel::$$c__DisplayClass51_0
    class $$c__DisplayClass51_0;
    // Nested type: GlobalNamespace::OculusNetworkPlayerModel::$HandleRoomInviteReceived$d__51
    struct $HandleRoomInviteReceived$d__51;
    // Nested type: GlobalNamespace::OculusNetworkPlayerModel::$$c__DisplayClass55_0
    class $$c__DisplayClass55_0;
    // Nested type: GlobalNamespace::OculusNetworkPlayerModel::$$c__DisplayClass64_0
    class $$c__DisplayClass64_0;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [InjectAttribute] Offset: 0x123ED7C
    // private readonly IPlatformUserModel _platformUserModel
    // Size: 0x8
    // Offset: 0x90
    GlobalNamespace::IPlatformUserModel* platformUserModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IPlatformUserModel*) == 0x8);
    // private System.Single _lastRefreshTime
    // Size: 0x4
    // Offset: 0x98
    float lastRefreshTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _isRefreshing
    // Size: 0x1
    // Offset: 0x9C
    bool isRefreshing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isRefreshing and: localPlayer
    char __padding2[0x3] = {};
    // private OculusNetworkPlayerModel/OculusNetworkPlayer _localPlayer
    // Size: 0x8
    // Offset: 0xA0
    GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer* localPlayer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer*) == 0x8);
    // private Oculus.Platform.RoomJoinPolicy _joinPolicy
    // Size: 0x4
    // Offset: 0xA8
    Oculus::Platform::RoomJoinPolicy joinPolicy;
    // Field size check
    static_assert(sizeof(Oculus::Platform::RoomJoinPolicy) == 0x4);
    // private System.Boolean _partyEnabled
    // Size: 0x1
    // Offset: 0xAC
    bool partyEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _waitingOnRoomCreate
    // Size: 0x1
    // Offset: 0xAD
    bool waitingOnRoomCreate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: waitingOnRoomCreate and: roomDataStore
    char __padding6[0x2] = {};
    // private readonly System.Collections.Generic.Dictionary`2<System.String,System.String> _roomDataStore
    // Size: 0x8
    // Offset: 0xB0
    System::Collections::Generic::Dictionary_2<::StringW, ::StringW>* roomDataStore;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<OculusNetworkPlayerModel/OculusNetworkPlayer> _partyPlayers
    // Size: 0x8
    // Offset: 0xB8
    System::Collections::Generic::List_1<GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer*>* partyPlayers;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<OculusNetworkPlayerModel/OculusNetworkPlayer> _otherPlayers
    // Size: 0x8
    // Offset: 0xC0
    System::Collections::Generic::List_1<GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer*>* otherPlayers;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::OculusNetworkPlayerModel::OculusNetworkPlayer*>*) == 0x8);
    // private System.Action`1<System.Int32> partySizeChangedEvent
    // Size: 0x8
    // Offset: 0xC8
    System::Action_1<int>* partySizeChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<int>*) == 0x8);
    // private System.Action`1<INetworkPlayerModel> partyChangedEvent
    // Size: 0x8
    // Offset: 0xD0
    System::Action_1<GlobalNamespace::INetworkPlayerModel*>* partyChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::INetworkPlayerModel*>*) == 0x8);
    // private System.Action`1<INetworkPlayer> inviteRequestedEvent
    // Size: 0x8
    // Offset: 0xD8
    System::Action_1<GlobalNamespace::INetworkPlayer*>* inviteRequestedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::INetworkPlayer*>*) == 0x8);
    public:
    // static field const value: static private System.String kConnectionTypeKey
    static constexpr const char* kConnectionTypeKey = "connection";
    // Get static field: static private System.String kConnectionTypeKey
    static ::StringW _get_kConnectionTypeKey();
    // Set static field: static private System.String kConnectionTypeKey
    static void _set_kConnectionTypeKey(::StringW value);
    // static field const value: static private System.String kConnectionTypeOculus
    static constexpr const char* kConnectionTypeOculus = "oculus";
    // Get static field: static private System.String kConnectionTypeOculus
    static ::StringW _get_kConnectionTypeOculus();
    // Set static field: static private System.String kConnectionTypeOculus
