// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVRMixedRealityCaptureConfiguration
#include "GlobalNamespace/OVRMixedRealityCaptureConfiguration.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: OVRManager/CompositionMethod
#include "GlobalNamespace/OVRManager_CompositionMethod.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: OVRManager/CameraDevice
#include "GlobalNamespace/OVRManager_CameraDevice.hpp"
// Including type: OVRManager/DepthQuality
#include "GlobalNamespace/OVRManager_DepthQuality.hpp"
// Including type: OVRManager/VirtualGreenScreenType
#include "GlobalNamespace/OVRManager_VirtualGreenScreenType.hpp"
// Including type: OVRManager/MrcActivationMode
#include "GlobalNamespace/OVRManager_MrcActivationMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IVRPlatformHelper
  class IVRPlatformHelper;
  // Forward declaring type: InstantiateMrcCameraDelegate
  class OVRManager_InstantiateMrcCameraDelegate;
  // Forward declaring type: MrcCameraType
  struct OVRManager_MrcCameraType;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OculusMRCManager
  class OculusMRCManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OculusMRCManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OculusMRCManager*, "", "OculusMRCManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: OculusMRCManager
  // [TokenAttribute] Offset: FFFFFFFF
  class OculusMRCManager : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::OVRMixedRealityCaptureConfiguration*/ {
    public:
    public:
    // [InjectAttribute] Offset: 0x10BC5D8
    // private IVRPlatformHelper _vrPlatformHelper
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::IVRPlatformHelper* vrPlatformHelper;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IVRPlatformHelper*) == 0x8);
    // private System.Func`2<UnityEngine.GameObject,UnityEngine.GameObject> _instantiateMixedRealityBackgroundCameraGameObject
    // Size: 0x8
    // Offset: 0x20
    ::System::Func_2<::UnityEngine::GameObject*, ::UnityEngine::GameObject*>* instantiateMixedRealityBackgroundCameraGameObject;
    // Field size check
    static_assert(sizeof(::System::Func_2<::UnityEngine::GameObject*, ::UnityEngine::GameObject*>*) == 0x8);
    // private System.Func`2<UnityEngine.GameObject,UnityEngine.GameObject> _instantiateMixedRealityForegroundCameraGameObject
    // Size: 0x8
    // Offset: 0x28
    ::System::Func_2<::UnityEngine::GameObject*, ::UnityEngine::GameObject*>* instantiateMixedRealityForegroundCameraGameObject;
    // Field size check
    static_assert(sizeof(::System::Func_2<::UnityEngine::GameObject*, ::UnityEngine::GameObject*>*) == 0x8);
    // private System.Boolean <enableMixedReality>k__BackingField
    // Size: 0x1
    // Offset: 0x30
    bool enableMixedReality;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableMixedReality and: extraHiddenLayers
    char __padding3[0x3] = {};
    // private UnityEngine.LayerMask <extraHiddenLayers>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    ::UnityEngine::LayerMask extraHiddenLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.LayerMask <extraVisibleLayers>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    ::UnityEngine::LayerMask extraVisibleLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private System.Boolean <dynamicCullingMask>k__BackingField
    // Size: 0x1
    // Offset: 0x3C
    bool dynamicCullingMask;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: dynamicCullingMask and: compositionMethod
    char __padding6[0x3] = {};
    // private OVRManager/CompositionMethod <compositionMethod>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    ::GlobalNamespace::OVRManager_CompositionMethod compositionMethod;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_CompositionMethod) == 0x4);
    // private UnityEngine.Color <externalCompositionBackdropColorRift>k__BackingField
    // Size: 0x10
    // Offset: 0x44
    ::UnityEngine::Color externalCompositionBackdropColorRift;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color <externalCompositionBackdropColorQuest>k__BackingField
    // Size: 0x10
    // Offset: 0x54
    ::UnityEngine::Color externalCompositionBackdropColorQuest;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private OVRManager/CameraDevice <capturingCameraDevice>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    ::GlobalNamespace::OVRManager_CameraDevice capturingCameraDevice;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_CameraDevice) == 0x4);
    // private System.Boolean <flipCameraFrameHorizontally>k__BackingField
    // Size: 0x1
    // Offset: 0x68
    bool flipCameraFrameHorizontally;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <flipCameraFrameVertically>k__BackingField
    // Size: 0x1
    // Offset: 0x69
    bool flipCameraFrameVertically;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: flipCameraFrameVertically and: handPoseStateLatency
    char __padding12[0x2] = {};
    // private System.Single <handPoseStateLatency>k__BackingField
    // Size: 0x4
    // Offset: 0x6C
    float handPoseStateLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <sandwichCompositionRenderLatency>k__BackingField
    // Size: 0x4
    // Offset: 0x70
    float sandwichCompositionRenderLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <sandwichCompositionBufferedFrames>k__BackingField
    // Size: 0x4
    // Offset: 0x74
    int sandwichCompositionBufferedFrames;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Color <chromaKeyColor>k__BackingField
    // Size: 0x10
    // Offset: 0x78
    ::UnityEngine::Color chromaKeyColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single <chromaKeySimilarity>k__BackingField
    // Size: 0x4
    // Offset: 0x88
    float chromaKeySimilarity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <chromaKeySmoothRange>k__BackingField
    // Size: 0x4
    // Offset: 0x8C
    float chromaKeySmoothRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <chromaKeySpillRange>k__BackingField
    // Size: 0x4
    // Offset: 0x90
    float chromaKeySpillRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <useDynamicLighting>k__BackingField
    // Size: 0x1
    // Offset: 0x94
    bool useDynamicLighting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useDynamicLighting and: depthQuality
    char __padding20[0x3] = {};
    // private OVRManager/DepthQuality <depthQuality>k__BackingField
    // Size: 0x4
    // Offset: 0x98
    ::GlobalNamespace::OVRManager_DepthQuality depthQuality;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_DepthQuality) == 0x4);
    // private System.Single <dynamicLightingSmoothFactor>k__BackingField
    // Size: 0x4
    // Offset: 0x9C
    float dynamicLightingSmoothFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <dynamicLightingDepthVariationClampingValue>k__BackingField
    // Size: 0x4
    // Offset: 0xA0
    float dynamicLightingDepthVariationClampingValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private OVRManager/VirtualGreenScreenType <virtualGreenScreenType>k__BackingField
    // Size: 0x4
    // Offset: 0xA4
    ::GlobalNamespace::OVRManager_VirtualGreenScreenType virtualGreenScreenType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_VirtualGreenScreenType) == 0x4);
    // private System.Single <virtualGreenScreenTopY>k__BackingField
    // Size: 0x4
    // Offset: 0xA8
    float virtualGreenScreenTopY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <virtualGreenScreenBottomY>k__BackingField
    // Size: 0x4
    // Offset: 0xAC
    float virtualGreenScreenBottomY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <virtualGreenScreenApplyDepthCulling>k__BackingField
    // Size: 0x1
    // Offset: 0xB0
    bool virtualGreenScreenApplyDepthCulling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: virtualGreenScreenApplyDepthCulling and: virtualGreenScreenDepthTolerance
    char __padding27[0x3] = {};
    // private System.Single <virtualGreenScreenDepthTolerance>k__BackingField
    // Size: 0x4
    // Offset: 0xB4
    float virtualGreenScreenDepthTolerance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private OVRManager/MrcActivationMode <mrcActivationMode>k__BackingField
    // Size: 0x4
    // Offset: 0xB8
    ::GlobalNamespace::OVRManager_MrcActivationMode mrcActivationMode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_MrcActivationMode) == 0x4);
    // Padding between fields: mrcActivationMode and: instantiateMixedRealityCameraGameObject
    char __padding29[0x4] = {};
    // private OVRManager/InstantiateMrcCameraDelegate _instantiateMixedRealityCameraGameObject
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::OVRManager_InstantiateMrcCameraDelegate* instantiateMixedRealityCameraGameObject;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_InstantiateMrcCameraDelegate*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::OVRMixedRealityCaptureConfiguration
    operator ::GlobalNamespace::OVRMixedRealityCaptureConfiguration() noexcept {
      return *reinterpret_cast<::GlobalNamespace::OVRMixedRealityCaptureConfiguration*>(this);
    }
    // Creating interface conversion operator: i_OVRMixedRealityCaptureConfiguration
    inline ::GlobalNamespace::OVRMixedRealityCaptureConfiguration* i_OVRMixedRealityCaptureConfiguration() noexcept {
      return reinterpret_cast<::GlobalNamespace::OVRMixedRealityCaptureConfiguration*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
