// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: IBeatmapDataAssetFileModel
#include "GlobalNamespace/IBeatmapDataAssetFileModel.hpp"
// Including type: System.Single
#include "System/Single.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OculusLevelProductsModelSO
  class OculusLevelProductsModelSO;
  // Forward declaring type: IPreviewBeatmapLevel
  class IPreviewBeatmapLevel;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: AssetFileDownloadUpdate
  class AssetFileDownloadUpdate;
  // Forward declaring type: AssetDetails
  class AssetDetails;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: SemaphoreSlim
  class SemaphoreSlim;
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: TaskCompletionSource`1<TResult>
  template<typename TResult>
  class TaskCompletionSource_1;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message`1<T>
  template<typename T>
  class Message_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: OculusBeatmapDataAssetFileModel
  class OculusBeatmapDataAssetFileModel : public ::Il2CppObject/*, public GlobalNamespace::IBeatmapDataAssetFileModel*/ {
    public:
    // Nested type: GlobalNamespace::OculusBeatmapDataAssetFileModel::LevelDownloadingData
    class LevelDownloadingData;
    // Nested type: GlobalNamespace::OculusBeatmapDataAssetFileModel::$$c__DisplayClass13_0
    class $$c__DisplayClass13_0;
    // Nested type: GlobalNamespace::OculusBeatmapDataAssetFileModel::$TryDeleteAssetBundleFileForPreviewLevelAsync$d__13
    struct $TryDeleteAssetBundleFileForPreviewLevelAsync$d__13;
    // Nested type: GlobalNamespace::OculusBeatmapDataAssetFileModel::$GetAssetBundleFileForPreviewLevelAsync$d__14
    struct $GetAssetBundleFileForPreviewLevelAsync$d__14;
    // Nested type: GlobalNamespace::OculusBeatmapDataAssetFileModel::$$c__DisplayClass15_0
    class $$c__DisplayClass15_0;
    // Nested type: GlobalNamespace::OculusBeatmapDataAssetFileModel::$ReloadAssetDetailsForAllLevelsAsync$d__15
    struct $ReloadAssetDetailsForAllLevelsAsync$d__15;
    // Nested type: GlobalNamespace::OculusBeatmapDataAssetFileModel::$$c__DisplayClass16_0
    class $$c__DisplayClass16_0;
    // Nested type: GlobalNamespace::OculusBeatmapDataAssetFileModel::$GetDownloadAssetBundleFileAsync$d__16
    struct $GetDownloadAssetBundleFileAsync$d__16;
    // [CompilerGeneratedAttribute] Offset: 0xE18184
    // private System.Action`1<LevelDataAssetDownloadUpdate> levelDataAssetDownloadUpdateEvent
    // Size: 0x8
    // Offset: 0x10
    System::Action_1<GlobalNamespace::LevelDataAssetDownloadUpdate>* levelDataAssetDownloadUpdateEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::LevelDataAssetDownloadUpdate>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.UInt64,OculusBeatmapDataAssetFileModel/LevelDownloadingData> _assetIdToDownloadinData
    // Size: 0x8
    // Offset: 0x18
    System::Collections::Generic::Dictionary_2<uint64_t, GlobalNamespace::OculusBeatmapDataAssetFileModel::LevelDownloadingData*>* assetIdToDownloadinData;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<uint64_t, GlobalNamespace::OculusBeatmapDataAssetFileModel::LevelDownloadingData*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.String> _downloadedAssetBundleFiles
    // Size: 0x8
    // Offset: 0x20
    System::Collections::Generic::Dictionary_2<::Il2CppString*, ::Il2CppString*>* downloadedAssetBundleFiles;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.UInt64,Oculus.Platform.Models.AssetFileDownloadUpdate> _lastAssetFileDownloadUpdateForAssetIds
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Generic::Dictionary_2<uint64_t, Oculus::Platform::Models::AssetFileDownloadUpdate*>* lastAssetFileDownloadUpdateForAssetIds;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<uint64_t, Oculus::Platform::Models::AssetFileDownloadUpdate*>*) == 0x8);
    // private System.Single _lastAssetFileDownloadUpdateTime
    // Size: 0x4
    // Offset: 0x30
    float lastAssetFileDownloadUpdateTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastAssetFileDownloadUpdateTime and: semaphoreSlim
    char __padding4[0x4] = {};
    // private System.Threading.SemaphoreSlim _semaphoreSlim
    // Size: 0x8
    // Offset: 0x38
    System::Threading::SemaphoreSlim* semaphoreSlim;
    // Field size check
    static_assert(sizeof(System::Threading::SemaphoreSlim*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,Oculus.Platform.Models.AssetDetails> _assetFileToAssetDetails
    // Size: 0x8
    // Offset: 0x40
    System::Collections::Generic::Dictionary_2<::Il2CppString*, Oculus::Platform::Models::AssetDetails*>* assetFileToAssetDetails;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, Oculus::Platform::Models::AssetDetails*>*) == 0x8);
    // private OculusLevelProductsModelSO _oculusLevelProductsModel
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::OculusLevelProductsModelSO* oculusLevelProductsModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OculusLevelProductsModelSO*) == 0x8);
    // Creating value type constructor for type: OculusBeatmapDataAssetFileModel
    OculusBeatmapDataAssetFileModel(System::Action_1<GlobalNamespace::LevelDataAssetDownloadUpdate>* levelDataAssetDownloadUpdateEvent_ = {}, System::Collections::Generic::Dictionary_2<uint64_t, GlobalNamespace::OculusBeatmapDataAssetFileModel::LevelDownloadingData*>* assetIdToDownloadinData_ = {}, System::Collections::Generic::Dictionary_2<::Il2CppString*, ::Il2CppString*>* downloadedAssetBundleFiles_ = {}, System::Collections::Generic::Dictionary_2<uint64_t, Oculus::Platform::Models::AssetFileDownloadUpdate*>* lastAssetFileDownloadUpdateForAssetIds_ = {}, float lastAssetFileDownloadUpdateTime_ = {}, System::Threading::SemaphoreSlim* semaphoreSlim_ = {}, System::Collections::Generic::Dictionary_2<::Il2CppString*, Oculus::Platform::Models::AssetDetails*>* assetFileToAssetDetails_ = {}, GlobalNamespace::OculusLevelProductsModelSO* oculusLevelProductsModel_ = {}) noexcept : levelDataAssetDownloadUpdateEvent{levelDataAssetDownloadUpdateEvent_}, assetIdToDownloadinData{assetIdToDownloadinData_}, downloadedAssetBundleFiles{downloadedAssetBundleFiles_}, lastAssetFileDownloadUpdateForAssetIds{lastAssetFileDownloadUpdateForAssetIds_}, lastAssetFileDownloadUpdateTime{lastAssetFileDownloadUpdateTime_}, semaphoreSlim{semaphoreSlim_}, assetFileToAssetDetails{assetFileToAssetDetails_}, oculusLevelProductsModel{oculusLevelProductsModel_} {}
    // Creating interface conversion operator: operator GlobalNamespace::IBeatmapDataAssetFileModel
    operator GlobalNamespace::IBeatmapDataAssetFileModel() noexcept {
      return *reinterpret_cast<GlobalNamespace::IBeatmapDataAssetFileModel*>(this);
    }
    // static field const value: static private System.Single kMaxTimeOutBeforeFail
    static constexpr const float kMaxTimeOutBeforeFail = 120;
    // Get static field: static private System.Single kMaxTimeOutBeforeFail
    static float _get_kMaxTimeOutBeforeFail();
    // Set static field: static private System.Single kMaxTimeOutBeforeFail
    static void _set_kMaxTimeOutBeforeFail(float value);
    // public System.Void add_levelDataAssetDownloadUpdateEvent(System.Action`1<LevelDataAssetDownloadUpdate> value)
    // Offset: 0x11C50CC
    void add_levelDataAssetDownloadUpdateEvent(System::Action_1<GlobalNamespace::LevelDataAssetDownloadUpdate>* value);
    // public System.Void remove_levelDataAssetDownloadUpdateEvent(System.Action`1<LevelDataAssetDownloadUpdate> value)
    // Offset: 0x11C5170
    void remove_levelDataAssetDownloadUpdateEvent(System::Action_1<GlobalNamespace::LevelDataAssetDownloadUpdate>* value);
    // public System.Void .ctor(OculusLevelProductsModelSO oculusLevelProductsModel)
    // Offset: 0x11C5214
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OculusBeatmapDataAssetFileModel* New_ctor(GlobalNamespace::OculusLevelProductsModelSO* oculusLevelProductsModel) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::OculusBeatmapDataAssetFileModel::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OculusBeatmapDataAssetFileModel*, creationType>(oculusLevelProductsModel)));
    }
    // public System.Threading.Tasks.Task`1<System.Boolean> TryDeleteAssetBundleFileForPreviewLevelAsync(IPreviewBeatmapLevel previewBeatmapLevel, System.Threading.CancellationToken cancellationToken)
    // Offset: 0x11C5374
    System::Threading::Tasks::Task_1<bool>* TryDeleteAssetBundleFileForPreviewLevelAsync(GlobalNamespace::IPreviewBeatmapLevel* previewBeatmapLevel, System::Threading::CancellationToken cancellationToken);
    // public System.Threading.Tasks.Task`1<GetAssetBundleFileResult> GetAssetBundleFileForPreviewLevelAsync(IPreviewBeatmapLevel previewBeatmapLevel, System.Threading.CancellationToken cancellationToken)
    // Offset: 0x11C5494
    System::Threading::Tasks::Task_1<GlobalNamespace::GetAssetBundleFileResult>* GetAssetBundleFileForPreviewLevelAsync(GlobalNamespace::IPreviewBeatmapLevel* previewBeatmapLevel, System::Threading::CancellationToken cancellationToken);
    // private System.Threading.Tasks.Task`1<System.Boolean> ReloadAssetDetailsForAllLevelsAsync(System.Threading.CancellationToken cancellationToken)
    // Offset: 0x11C55B4
    System::Threading::Tasks::Task_1<bool>* ReloadAssetDetailsForAllLevelsAsync(System::Threading::CancellationToken cancellationToken);
    // private System.Threading.Tasks.Task`1<GetAssetBundleFileResult> GetDownloadAssetBundleFileAsync(System.String levelId, Oculus.Platform.Models.AssetDetails assetDetails, System.Threading.CancellationToken cancellationToken)
    // Offset: 0x11C56D8
    System::Threading::Tasks::Task_1<GlobalNamespace::GetAssetBundleFileResult>* GetDownloadAssetBundleFileAsync(::Il2CppString* levelId, Oculus::Platform::Models::AssetDetails* assetDetails, System::Threading::CancellationToken cancellationToken);
    // private System.Threading.Tasks.TaskCompletionSource`1<GetAssetBundleFileResult> GetTaskCompletionSourceForDownload(System.String levelId, Oculus.Platform.Models.AssetDetails assetDetail)
    // Offset: 0x11C57EC
    System::Threading::Tasks::TaskCompletionSource_1<GlobalNamespace::GetAssetBundleFileResult>* GetTaskCompletionSourceForDownload(::Il2CppString* levelId, Oculus::Platform::Models::AssetDetails* assetDetail);
    // private System.Void HandleAssetFileDownloadUpdate(Oculus.Platform.Message`1<Oculus.Platform.Models.AssetFileDownloadUpdate> msg)
    // Offset: 0x11C596C
    void HandleAssetFileDownloadUpdate(Oculus::Platform::Message_1<Oculus::Platform::Models::AssetFileDownloadUpdate*>* msg);
    // private System.Void <.ctor>b__12_0(Oculus.Platform.Message`1<Oculus.Platform.Models.AssetFileDownloadUpdate> msg)
    // Offset: 0x11C5CF0
    void $_ctor$b__12_0(Oculus::Platform::Message_1<Oculus::Platform::Models::AssetFileDownloadUpdate*>* msg);
  }; // OculusBeatmapDataAssetFileModel
  #pragma pack(pop)
  static check_size<sizeof(OculusBeatmapDataAssetFileModel), 72 + sizeof(GlobalNamespace::OculusLevelProductsModelSO*)> __GlobalNamespace_OculusBeatmapDataAssetFileModelSizeCheck;
  static_assert(sizeof(OculusBeatmapDataAssetFileModel) == 0x50);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OculusBeatmapDataAssetFileModel*, "", "OculusBeatmapDataAssetFileModel");
