// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: IConnectionManager
#include "GlobalNamespace/IConnectionManager.hpp"
// Including type: System.Single
#include "System/Single.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OculusNetworkPlayerModel
  class OculusNetworkPlayerModel;
  // Forward declaring type: IConnection
  class IConnection;
  // Forward declaring type: IConnectionInitParams`1<T>
  template<typename T>
  class IConnectionInitParams_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataReader
  class NetDataReader;
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message`1<T>
  template<typename T>
  class Message_1;
  // Forward declaring type: SendPolicy
  struct SendPolicy;
}
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: NetworkingPeer
  class NetworkingPeer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: OculusConnectionManager
  class OculusConnectionManager : public ::Il2CppObject/*, public GlobalNamespace::IConnectionManager*/ {
    public:
    // Nested type: GlobalNamespace::OculusConnectionManager::NetworkMode
    struct NetworkMode;
    // Nested type: GlobalNamespace::OculusConnectionManager::OculusConnection
    class OculusConnection;
    // Nested type: GlobalNamespace::OculusConnectionManager::StartServerParams
    class StartServerParams;
    // Nested type: GlobalNamespace::OculusConnectionManager::ConnectToServerParams
    class ConnectToServerParams;
    // Nested type: GlobalNamespace::OculusConnectionManager::$HandlePeerConnectionRequest$d__62
    struct $HandlePeerConnectionRequest$d__62;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OculusConnectionManager/NetworkMode
    struct NetworkMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: NetworkMode
      constexpr NetworkMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OculusConnectionManager/NetworkMode None
      static constexpr const int None = 0;
      // Get static field: static public OculusConnectionManager/NetworkMode None
      static GlobalNamespace::OculusConnectionManager::NetworkMode _get_None();
      // Set static field: static public OculusConnectionManager/NetworkMode None
      static void _set_None(GlobalNamespace::OculusConnectionManager::NetworkMode value);
      // static field const value: static public OculusConnectionManager/NetworkMode Client
      static constexpr const int Client = 1;
      // Get static field: static public OculusConnectionManager/NetworkMode Client
      static GlobalNamespace::OculusConnectionManager::NetworkMode _get_Client();
      // Set static field: static public OculusConnectionManager/NetworkMode Client
      static void _set_Client(GlobalNamespace::OculusConnectionManager::NetworkMode value);
      // static field const value: static public OculusConnectionManager/NetworkMode Server
      static constexpr const int Server = 2;
      // Get static field: static public OculusConnectionManager/NetworkMode Server
      static GlobalNamespace::OculusConnectionManager::NetworkMode _get_Server();
      // Set static field: static public OculusConnectionManager/NetworkMode Server
      static void _set_Server(GlobalNamespace::OculusConnectionManager::NetworkMode value);
    }; // OculusConnectionManager/NetworkMode
    #pragma pack(pop)
    static check_size<sizeof(OculusConnectionManager::NetworkMode), 0 + sizeof(int)> __GlobalNamespace_OculusConnectionManager_NetworkModeSizeCheck;
    static_assert(sizeof(OculusConnectionManager::NetworkMode) == 0x4);
    // private readonly System.Collections.Generic.List`1<OculusConnectionManager/OculusConnection> _connections
    // Size: 0x8
    // Offset: 0x10
    System::Collections::Generic::List_1<GlobalNamespace::OculusConnectionManager::OculusConnection*>* connections;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<GlobalNamespace::OculusConnectionManager::OculusConnection*>*) == 0x8);
    // private readonly LiteNetLib.Utils.NetDataReader _dataReader
    // Size: 0x8
    // Offset: 0x18
    LiteNetLib::Utils::NetDataReader* dataReader;
    // Field size check
    static_assert(sizeof(LiteNetLib::Utils::NetDataReader*) == 0x8);
    // private OculusNetworkPlayerModel _oculusNetworkPlayerModel
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::OculusNetworkPlayerModel* oculusNetworkPlayerModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OculusNetworkPlayerModel*) == 0x8);
    // private OculusConnectionManager/NetworkMode _mode
    // Size: 0x4
    // Offset: 0x28
    GlobalNamespace::OculusConnectionManager::NetworkMode mode;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OculusConnectionManager::NetworkMode) == 0x4);
    // private System.Single _lastPingTime
    // Size: 0x4
    // Offset: 0x2C
    float lastPingTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _connectionEstablished
    // Size: 0x1
    // Offset: 0x30
    bool connectionEstablished;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: connectionEstablished and: onConnectedEvent
    char __padding5[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xE17E90
    // private System.Action onConnectedEvent
    // Size: 0x8
    // Offset: 0x38
    System::Action* onConnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17EA0
    // private System.Action`1<DisconnectedReason> onDisconnectedEvent
    // Size: 0x8
    // Offset: 0x40
    System::Action_1<GlobalNamespace::DisconnectedReason>* onDisconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::DisconnectedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17EB0
    // private System.Action`1<ConnectionFailedReason> onConnectionFailedEvent
    // Size: 0x8
    // Offset: 0x48
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* onConnectionFailedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::ConnectionFailedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17EC0
    // private System.Action`1<IConnection> onConnectionConnectedEvent
    // Size: 0x8
    // Offset: 0x50
    System::Action_1<GlobalNamespace::IConnection*>* onConnectionConnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<GlobalNamespace::IConnection*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17ED0
    // private System.Action`2<IConnection,DisconnectedReason> onConnectionDisconnectedEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action_2<GlobalNamespace::IConnection*, GlobalNamespace::DisconnectedReason>* onConnectionDisconnectedEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::IConnection*, GlobalNamespace::DisconnectedReason>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17EE0
    // private System.Action`2<IConnection,System.Single> onLatencyUpdatedEvent
    // Size: 0x8
    // Offset: 0x60
    System::Action_2<GlobalNamespace::IConnection*, float>* onLatencyUpdatedEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::IConnection*, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17EF0
    // private System.Action`3<IConnection,LiteNetLib.Utils.NetDataReader,LiteNetLib.DeliveryMethod> onReceivedDataEvent
    // Size: 0x8
    // Offset: 0x68
    System::Action_3<GlobalNamespace::IConnection*, LiteNetLib::Utils::NetDataReader*, LiteNetLib::DeliveryMethod>* onReceivedDataEvent;
    // Field size check
    static_assert(sizeof(System::Action_3<GlobalNamespace::IConnection*, LiteNetLib::Utils::NetDataReader*, LiteNetLib::DeliveryMethod>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE17F00
    // private System.Boolean <isDisconnecting>k__BackingField
    // Size: 0x1
    // Offset: 0x70
    bool isDisconnecting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isDisconnecting and: buffer
    char __padding13[0x7] = {};
    // private System.Byte[] _buffer
    // Size: 0x8
    // Offset: 0x78
    ::Array<uint8_t>* buffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // Creating value type constructor for type: OculusConnectionManager
