// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: OVRDebugInfo
  class OVRDebugInfo : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.GameObject debugUIManager
    // Offset: 0x18
    UnityEngine::GameObject* debugUIManager;
    // private UnityEngine.GameObject debugUIObject
    // Offset: 0x20
    UnityEngine::GameObject* debugUIObject;
    // private UnityEngine.GameObject riftPresent
    // Offset: 0x28
    UnityEngine::GameObject* riftPresent;
    // private UnityEngine.GameObject fps
    // Offset: 0x30
    UnityEngine::GameObject* fps;
    // private UnityEngine.GameObject ipd
    // Offset: 0x38
    UnityEngine::GameObject* ipd;
    // private UnityEngine.GameObject fov
    // Offset: 0x40
    UnityEngine::GameObject* fov;
    // private UnityEngine.GameObject height
    // Offset: 0x48
    UnityEngine::GameObject* height;
    // private UnityEngine.GameObject depth
    // Offset: 0x50
    UnityEngine::GameObject* depth;
    // private UnityEngine.GameObject resolutionEyeTexture
    // Offset: 0x58
    UnityEngine::GameObject* resolutionEyeTexture;
    // private UnityEngine.GameObject latencies
    // Offset: 0x60
    UnityEngine::GameObject* latencies;
    // private UnityEngine.GameObject texts
    // Offset: 0x68
    UnityEngine::GameObject* texts;
    // private System.String strRiftPresent
    // Offset: 0x70
    ::CsString* strRiftPresent;
    // private System.String strFPS
    // Offset: 0x78
    ::CsString* strFPS;
    // private System.String strIPD
    // Offset: 0x80
    ::CsString* strIPD;
    // private System.String strFOV
    // Offset: 0x88
    ::CsString* strFOV;
    // private System.String strHeight
    // Offset: 0x90
    ::CsString* strHeight;
    // private System.String strDepth
    // Offset: 0x98
    ::CsString* strDepth;
    // private System.String strResolutionEyeTexture
    // Offset: 0xA0
    ::CsString* strResolutionEyeTexture;
    // private System.String strLatencies
    // Offset: 0xA8
    ::CsString* strLatencies;
    // private System.Single updateInterval
    // Offset: 0xB0
    float updateInterval;
    // private System.Single accum
    // Offset: 0xB4
    float accum;
    // private System.Int32 frames
    // Offset: 0xB8
    int frames;
    // private System.Single timeLeft
    // Offset: 0xBC
    float timeLeft;
    // private System.Boolean initUIComponent
    // Offset: 0xC0
    bool initUIComponent;
    // private System.Boolean isInited
    // Offset: 0xC1
    bool isInited;
    // private System.Single offsetY
    // Offset: 0xC4
    float offsetY;
    // private System.Single riftPresentTimeout
    // Offset: 0xC8
    float riftPresentTimeout;
    // private System.Boolean showVRVars
    // Offset: 0xCC
    bool showVRVars;
    // private System.Void Awake()
    // Offset: 0xCB7A14
    void Awake();
    // private System.Void Update()
    // Offset: 0xCB7C28
    void Update();
    // private System.Void OnDestroy()
    // Offset: 0xCB83F4
    void OnDestroy();
    // private System.Void InitUIComponents()
    // Offset: 0xCB7CF0
    void InitUIComponents();
    // private System.Void UpdateVariable()
    // Offset: 0xCB814C
    void UpdateVariable();
    // private System.Void UpdateStrings()
    // Offset: 0xCB8190
    void UpdateStrings();
    // private System.Void RiftPresentGUI(UnityEngine.GameObject guiMainOBj)
    // Offset: 0xCB8C30
    void RiftPresentGUI(UnityEngine::GameObject* guiMainOBj);
    // private System.Void UpdateDeviceDetection()
    // Offset: 0xCB810C
    void UpdateDeviceDetection();
    // private UnityEngine.GameObject VariableObjectManager(UnityEngine.GameObject gameObject, System.String name, System.Single posY, System.String str, System.Int32 fontSize)
    // Offset: 0xCB83FC
    UnityEngine::GameObject* VariableObjectManager(UnityEngine::GameObject* gameObject, ::CsString* name, float posY, ::CsString* str, int fontSize);
    // private UnityEngine.GameObject ComponentComposition(UnityEngine.GameObject GO)
    // Offset: 0xCB8DF8
    UnityEngine::GameObject* ComponentComposition(UnityEngine::GameObject* GO);
    // private System.Void UpdateIPD()
    // Offset: 0xCB85DC
    void UpdateIPD();
    // private System.Void UpdateEyeHeightOffset()
    // Offset: 0xCB86AC
    void UpdateEyeHeightOffset();
    // private System.Void UpdateEyeDepthOffset()
    // Offset: 0xCB8770
    void UpdateEyeDepthOffset();
    // private System.Void UpdateFOV()
    // Offset: 0xCB8834
    void UpdateFOV();
    // private System.Void UpdateResolutionEyeTexture()
    // Offset: 0xCB8948
    void UpdateResolutionEyeTexture();
    // private System.Void UpdateLatencyValues()
    // Offset: 0xCB8B3C
    void UpdateLatencyValues();
    // private System.Void UpdateFPS()
    // Offset: 0xCB8B40
    void UpdateFPS();
    // public System.Void .ctor()
    // Offset: 0xCB9170
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static OVRDebugInfo* New_ctor();
  }; // OVRDebugInfo
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRDebugInfo*, "", "OVRDebugInfo");
#pragma pack(pop)
