// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.KeyCode
#include "UnityEngine/KeyCode.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRCameraRig
  class OVRCameraRig;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: OVRGridCube
  class OVRGridCube : public UnityEngine::MonoBehaviour {
    public:
    // public UnityEngine.KeyCode GridKey
    // Offset: 0x18
    UnityEngine::KeyCode GridKey;
    // private UnityEngine.GameObject CubeGrid
    // Offset: 0x20
    UnityEngine::GameObject* CubeGrid;
    // private System.Boolean CubeGridOn
    // Offset: 0x28
    bool CubeGridOn;
    // private System.Boolean CubeSwitchColorOld
    // Offset: 0x29
    bool CubeSwitchColorOld;
    // private System.Boolean CubeSwitchColor
    // Offset: 0x2A
    bool CubeSwitchColor;
    // private System.Int32 gridSizeX
    // Offset: 0x2C
    int gridSizeX;
    // private System.Int32 gridSizeY
    // Offset: 0x30
    int gridSizeY;
    // private System.Int32 gridSizeZ
    // Offset: 0x34
    int gridSizeZ;
    // private System.Single gridScale
    // Offset: 0x38
    float gridScale;
    // private System.Single cubeScale
    // Offset: 0x3C
    float cubeScale;
    // private OVRCameraRig CameraController
    // Offset: 0x40
    GlobalNamespace::OVRCameraRig* CameraController;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // private System.Void Update()
    // Offset: 0xE6B344
    void Update();
    // public System.Void SetOVRCameraController(ref OVRCameraRig cameraController)
    // Offset: 0xE6B5AC
    void SetOVRCameraController(GlobalNamespace::OVRCameraRig*& cameraController);
    // private System.Void UpdateCubeGrid()
    // Offset: 0xE6B348
    void UpdateCubeGrid();
    // private System.Void CreateCubeGrid()
    // Offset: 0xE6B5B8
    void CreateCubeGrid();
    // private System.Void CubeGridSwitchColor(System.Boolean CubeSwitchColor)
    // Offset: 0xE6B978
    void CubeGridSwitchColor(bool CubeSwitchColor);
    // public System.Void .ctor()
    // Offset: 0xE6BD2C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static OVRGridCube* New_ctor();
  }; // OVRGridCube
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRGridCube*, "", "OVRGridCube");
#pragma pack(pop)
