// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVRSkeleton/IOVRSkeletonDataProvider
#include "GlobalNamespace/OVRSkeleton_IOVRSkeletonDataProvider.hpp"
// Including type: OVRSkeletonRenderer/IOVRSkeletonRendererDataProvider
#include "GlobalNamespace/OVRSkeletonRenderer_IOVRSkeletonRendererDataProvider.hpp"
// Including type: OVRMesh/IOVRMeshDataProvider
#include "GlobalNamespace/OVRMesh_IOVRMeshDataProvider.hpp"
// Including type: OVRMeshRenderer/IOVRMeshRendererDataProvider
#include "GlobalNamespace/OVRMeshRenderer_IOVRMeshRendererDataProvider.hpp"
// Including type: OVRPlugin/HandState
#include "GlobalNamespace/OVRPlugin_HandState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: TrackingConfidence because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRHand
  class OVRHand;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRHand);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRHand*, "", "OVRHand");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xC1
  #pragma pack(push, 1)
  // Autogenerated type: OVRHand
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: 10B0468
  class OVRHand : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::OVRSkeleton::IOVRSkeletonDataProvider, public ::GlobalNamespace::OVRSkeletonRenderer::IOVRSkeletonRendererDataProvider, public ::GlobalNamespace::OVRMesh::IOVRMeshDataProvider, public ::GlobalNamespace::OVRMeshRenderer::IOVRMeshRendererDataProvider*/ {
    public:
    // Nested type: ::GlobalNamespace::OVRHand::Hand
    struct Hand;
    // Nested type: ::GlobalNamespace::OVRHand::HandFinger
    struct HandFinger;
    // Nested type: ::GlobalNamespace::OVRHand::TrackingConfidence
    struct TrackingConfidence;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRHand/Hand
    // [TokenAttribute] Offset: FFFFFFFF
    struct Hand/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Hand
      constexpr Hand(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRHand/Hand None
      static constexpr const int None = -1;
      // Get static field: static public OVRHand/Hand None
      static ::GlobalNamespace::OVRHand::Hand _get_None();
      // Set static field: static public OVRHand/Hand None
      static void _set_None(::GlobalNamespace::OVRHand::Hand value);
      // static field const value: static public OVRHand/Hand HandLeft
      static constexpr const int HandLeft = 0;
      // Get static field: static public OVRHand/Hand HandLeft
      static ::GlobalNamespace::OVRHand::Hand _get_HandLeft();
      // Set static field: static public OVRHand/Hand HandLeft
      static void _set_HandLeft(::GlobalNamespace::OVRHand::Hand value);
      // static field const value: static public OVRHand/Hand HandRight
      static constexpr const int HandRight = 1;
      // Get static field: static public OVRHand/Hand HandRight
      static ::GlobalNamespace::OVRHand::Hand _get_HandRight();
      // Set static field: static public OVRHand/Hand HandRight
      static void _set_HandRight(::GlobalNamespace::OVRHand::Hand value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRHand/Hand
    #pragma pack(pop)
    static check_size<sizeof(OVRHand::Hand), 0 + sizeof(int)> __GlobalNamespace_OVRHand_HandSizeCheck;
    static_assert(sizeof(OVRHand::Hand) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRHand/TrackingConfidence
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackingConfidence/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TrackingConfidence
      constexpr TrackingConfidence(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRHand/TrackingConfidence Low
      static constexpr const int Low = 0;
      // Get static field: static public OVRHand/TrackingConfidence Low
      static ::GlobalNamespace::OVRHand::TrackingConfidence _get_Low();
      // Set static field: static public OVRHand/TrackingConfidence Low
      static void _set_Low(::GlobalNamespace::OVRHand::TrackingConfidence value);
      // static field const value: static public OVRHand/TrackingConfidence High
      static constexpr const int High = 1065353216;
      // Get static field: static public OVRHand/TrackingConfidence High
      static ::GlobalNamespace::OVRHand::TrackingConfidence _get_High();
      // Set static field: static public OVRHand/TrackingConfidence High
      static void _set_High(::GlobalNamespace::OVRHand::TrackingConfidence value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRHand/TrackingConfidence
    #pragma pack(pop)
    static check_size<sizeof(OVRHand::TrackingConfidence), 0 + sizeof(int)> __GlobalNamespace_OVRHand_TrackingConfidenceSizeCheck;
    static_assert(sizeof(OVRHand::TrackingConfidence) == 0x4);
    public:
    // private OVRHand/Hand HandType
    // Size: 0x4
    // Offset: 0x18
    ::GlobalNamespace::OVRHand::Hand HandType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRHand::Hand) == 0x4);
    // Padding between fields: HandType and: pointerPoseRoot
    char __padding0[0x4] = {};
    // private UnityEngine.Transform _pointerPoseRoot
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* pointerPoseRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.GameObject _pointerPoseGO
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* pointerPoseGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private OVRPlugin/HandState _handState
    // Size: 0x78
    // Offset: 0x30
    ::GlobalNamespace::OVRPlugin::HandState handState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::HandState) == 0x78);
    // private System.Boolean <IsDataValid>k__BackingField
    // Size: 0x1
    // Offset: 0xA8
    bool IsDataValid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsDataHighConfidence>k__BackingField
    // Size: 0x1
    // Offset: 0xA9
    bool IsDataHighConfidence;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsTracked>k__BackingField
    // Size: 0x1
    // Offset: 0xAA
    bool IsTracked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsSystemGestureInProgress>k__BackingField
    // Size: 0x1
    // Offset: 0xAB
    bool IsSystemGestureInProgress;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsPointerPoseValid>k__BackingField
    // Size: 0x1
    // Offset: 0xAC
    bool IsPointerPoseValid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsPointerPoseValid and: PointerPose
    char __padding8[0x3] = {};
    // private UnityEngine.Transform <PointerPose>k__BackingField
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Transform* PointerPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single <HandScale>k__BackingField
    // Size: 0x4
    // Offset: 0xB8
    float HandScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private OVRHand/TrackingConfidence <HandConfidence>k__BackingField
    // Size: 0x4
    // Offset: 0xBC
    ::GlobalNamespace::OVRHand::TrackingConfidence HandConfidence;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRHand::TrackingConfidence) == 0x4);
    // private System.Boolean <IsDominantHand>k__BackingField
    // Size: 0x1
    // Offset: 0xC0
    bool IsDominantHand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::OVRSkeleton::IOVRSkeletonDataProvider
    operator ::GlobalNamespace::OVRSkeleton::IOVRSkeletonDataProvider() noexcept {
      return *reinterpret_cast<::GlobalNamespace::OVRSkeleton::IOVRSkeletonDataProvider*>(this);
    }
    // Creating interface conversion operator: i_IOVRSkeletonDataProvider
    inline ::GlobalNamespace::OVRSkeleton::IOVRSkeletonDataProvider* i_IOVRSkeletonDataProvider() noexcept {
      return reinterpret_cast<::GlobalNamespace::OVRSkeleton::IOVRSkeletonDataProvider*>(this);
    }
    // Creating interface conversion operator: operator ::GlobalNamespace::OVRSkeletonRenderer::IOVRSkeletonRendererDataProvider
    operator ::GlobalNamespace::OVRSkeletonRenderer::IOVRSkeletonRendererDataProvider() noexcept {
