// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: OVRInput/OVRControllerBase
#include "GlobalNamespace/OVRInput_OVRControllerBase.hpp"
// Including type: OVRInput/RawButton
#include "GlobalNamespace/OVRInput_RawButton.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: OVRInput/OVRControllerBase/VirtualButtonMap
  class OVRInput::OVRControllerBase::VirtualButtonMap : public ::Il2CppObject {
    public:
    // public OVRInput/RawButton None
    // Offset: 0x10
    GlobalNamespace::OVRInput::RawButton None;
    // public OVRInput/RawButton One
    // Offset: 0x14
    GlobalNamespace::OVRInput::RawButton One;
    // public OVRInput/RawButton Two
    // Offset: 0x18
    GlobalNamespace::OVRInput::RawButton Two;
    // public OVRInput/RawButton Three
    // Offset: 0x1C
    GlobalNamespace::OVRInput::RawButton Three;
    // public OVRInput/RawButton Four
    // Offset: 0x20
    GlobalNamespace::OVRInput::RawButton Four;
    // public OVRInput/RawButton Start
    // Offset: 0x24
    GlobalNamespace::OVRInput::RawButton Start;
    // public OVRInput/RawButton Back
    // Offset: 0x28
    GlobalNamespace::OVRInput::RawButton Back;
    // public OVRInput/RawButton PrimaryShoulder
    // Offset: 0x2C
    GlobalNamespace::OVRInput::RawButton PrimaryShoulder;
    // public OVRInput/RawButton PrimaryIndexTrigger
    // Offset: 0x30
    GlobalNamespace::OVRInput::RawButton PrimaryIndexTrigger;
    // public OVRInput/RawButton PrimaryHandTrigger
    // Offset: 0x34
    GlobalNamespace::OVRInput::RawButton PrimaryHandTrigger;
    // public OVRInput/RawButton PrimaryThumbstick
    // Offset: 0x38
    GlobalNamespace::OVRInput::RawButton PrimaryThumbstick;
    // public OVRInput/RawButton PrimaryThumbstickUp
    // Offset: 0x3C
    GlobalNamespace::OVRInput::RawButton PrimaryThumbstickUp;
    // public OVRInput/RawButton PrimaryThumbstickDown
    // Offset: 0x40
    GlobalNamespace::OVRInput::RawButton PrimaryThumbstickDown;
    // public OVRInput/RawButton PrimaryThumbstickLeft
    // Offset: 0x44
    GlobalNamespace::OVRInput::RawButton PrimaryThumbstickLeft;
    // public OVRInput/RawButton PrimaryThumbstickRight
    // Offset: 0x48
    GlobalNamespace::OVRInput::RawButton PrimaryThumbstickRight;
    // public OVRInput/RawButton PrimaryTouchpad
    // Offset: 0x4C
    GlobalNamespace::OVRInput::RawButton PrimaryTouchpad;
    // public OVRInput/RawButton SecondaryShoulder
    // Offset: 0x50
    GlobalNamespace::OVRInput::RawButton SecondaryShoulder;
    // public OVRInput/RawButton SecondaryIndexTrigger
    // Offset: 0x54
    GlobalNamespace::OVRInput::RawButton SecondaryIndexTrigger;
    // public OVRInput/RawButton SecondaryHandTrigger
    // Offset: 0x58
    GlobalNamespace::OVRInput::RawButton SecondaryHandTrigger;
    // public OVRInput/RawButton SecondaryThumbstick
    // Offset: 0x5C
    GlobalNamespace::OVRInput::RawButton SecondaryThumbstick;
    // public OVRInput/RawButton SecondaryThumbstickUp
    // Offset: 0x60
    GlobalNamespace::OVRInput::RawButton SecondaryThumbstickUp;
    // public OVRInput/RawButton SecondaryThumbstickDown
    // Offset: 0x64
    GlobalNamespace::OVRInput::RawButton SecondaryThumbstickDown;
    // public OVRInput/RawButton SecondaryThumbstickLeft
    // Offset: 0x68
    GlobalNamespace::OVRInput::RawButton SecondaryThumbstickLeft;
    // public OVRInput/RawButton SecondaryThumbstickRight
    // Offset: 0x6C
    GlobalNamespace::OVRInput::RawButton SecondaryThumbstickRight;
    // public OVRInput/RawButton SecondaryTouchpad
    // Offset: 0x70
    GlobalNamespace::OVRInput::RawButton SecondaryTouchpad;
    // public OVRInput/RawButton DpadUp
    // Offset: 0x74
    GlobalNamespace::OVRInput::RawButton DpadUp;
    // public OVRInput/RawButton DpadDown
    // Offset: 0x78
    GlobalNamespace::OVRInput::RawButton DpadDown;
    // public OVRInput/RawButton DpadLeft
    // Offset: 0x7C
    GlobalNamespace::OVRInput::RawButton DpadLeft;
    // public OVRInput/RawButton DpadRight
    // Offset: 0x80
    GlobalNamespace::OVRInput::RawButton DpadRight;
    // public OVRInput/RawButton Up
    // Offset: 0x84
    GlobalNamespace::OVRInput::RawButton Up;
    // public OVRInput/RawButton Down
    // Offset: 0x88
    GlobalNamespace::OVRInput::RawButton Down;
    // public OVRInput/RawButton Left
    // Offset: 0x8C
    GlobalNamespace::OVRInput::RawButton Left;
    // public OVRInput/RawButton Right
    // Offset: 0x90
    GlobalNamespace::OVRInput::RawButton Right;
    // public OVRInput/RawButton ToRawMask(OVRInput/Button virtualMask)
    // Offset: 0xE76400
    GlobalNamespace::OVRInput::RawButton ToRawMask(GlobalNamespace::OVRInput::Button virtualMask);
    // public System.Void .ctor()
    // Offset: 0xE758C8
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static OVRInput::OVRControllerBase::VirtualButtonMap* New_ctor();
  }; // OVRInput/OVRControllerBase/VirtualButtonMap
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRInput::OVRControllerBase::VirtualButtonMap*, "", "OVRInput/OVRControllerBase/VirtualButtonMap");
#pragma pack(pop)
