// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// WARNING Layout: Sequential may not be correctly taken into account!
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: OVRInput
#include "GlobalNamespace/OVRInput.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: OVR.OpenVR.VRControllerState_t
#include "OVR/OpenVR/VRControllerState_t.hpp"
// Including type: OVRInput/OpenVRController
#include "GlobalNamespace/OVRInput_OpenVRController.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x68
  // Autogenerated type: OVRInput/OpenVRControllerDetails
  // [] Offset: FFFFFFFF
  struct OVRInput::OpenVRControllerDetails/*, public System::ValueType*/ {
    public:
    // public OVR.OpenVR.VRControllerState_t state
    // Size: 0x40
    // Offset: 0x0
    OVR::OpenVR::VRControllerState_t state;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::VRControllerState_t) == 0x40);
    // public OVRInput/OpenVRController controllerType
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::OVRInput::OpenVRController controllerType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRInput::OpenVRController) == 0x8);
    // public System.UInt32 deviceID
    // Size: 0x4
    // Offset: 0x48
    uint deviceID;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public UnityEngine.Vector3 localPosition
    // Size: 0xC
    // Offset: 0x4C
    UnityEngine::Vector3 localPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion localOrientation
    // Size: 0x10
    // Offset: 0x58
    UnityEngine::Quaternion localOrientation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // Creating value type constructor for type: OpenVRControllerDetails
    constexpr OpenVRControllerDetails(OVR::OpenVR::VRControllerState_t state_ = {}, GlobalNamespace::OVRInput::OpenVRController controllerType_ = {}, uint deviceID_ = {}, UnityEngine::Vector3 localPosition_ = {}, UnityEngine::Quaternion localOrientation_ = {}) noexcept : state{state_}, controllerType{controllerType_}, deviceID{deviceID_}, localPosition{localPosition_}, localOrientation{localOrientation_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
  }; // OVRInput/OpenVRControllerDetails
  static check_size<sizeof(OVRInput::OpenVRControllerDetails), 88 + sizeof(UnityEngine::Quaternion)> __GlobalNamespace_OVRInput_OpenVRControllerDetailsSizeCheck;
  static_assert(sizeof(OVRInput::OpenVRControllerDetails) == 0x68);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRInput::OpenVRControllerDetails, "", "OVRInput/OpenVRControllerDetails");
#pragma pack(pop)
