// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: OVRInput
#include "GlobalNamespace/OVRInput.hpp"
// Including type: OVRPlugin/ControllerState4
#include "GlobalNamespace/OVRPlugin_ControllerState4.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: OVRInput/OVRControllerBase
  class OVRInput::OVRControllerBase : public ::Il2CppObject {
    public:
    // Nested type: GlobalNamespace::OVRInput::OVRControllerBase::VirtualButtonMap
    class VirtualButtonMap;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerBase::VirtualTouchMap
    class VirtualTouchMap;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerBase::VirtualNearTouchMap
    class VirtualNearTouchMap;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap
    class VirtualAxis1DMap;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis2DMap
    class VirtualAxis2DMap;
    // public OVRInput/Controller controllerType
    // Offset: 0x10
    GlobalNamespace::OVRInput::Controller controllerType;
    // public OVRInput/OVRControllerBase/VirtualButtonMap buttonMap
    // Offset: 0x18
    GlobalNamespace::OVRInput::OVRControllerBase::VirtualButtonMap* buttonMap;
    // public OVRInput/OVRControllerBase/VirtualTouchMap touchMap
    // Offset: 0x20
    GlobalNamespace::OVRInput::OVRControllerBase::VirtualTouchMap* touchMap;
    // public OVRInput/OVRControllerBase/VirtualNearTouchMap nearTouchMap
    // Offset: 0x28
    GlobalNamespace::OVRInput::OVRControllerBase::VirtualNearTouchMap* nearTouchMap;
    // public OVRInput/OVRControllerBase/VirtualAxis1DMap axis1DMap
    // Offset: 0x30
    GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap* axis1DMap;
    // public OVRInput/OVRControllerBase/VirtualAxis2DMap axis2DMap
    // Offset: 0x38
    GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis2DMap* axis2DMap;
    // public OVRPlugin/ControllerState4 previousState
    // Offset: 0x40
    GlobalNamespace::OVRPlugin::ControllerState4 previousState;
    // public OVRPlugin/ControllerState4 currentState
    // Offset: 0xA0
    GlobalNamespace::OVRPlugin::ControllerState4 currentState;
    // public System.Boolean shouldApplyDeadzone
    // Offset: 0x100
    bool shouldApplyDeadzone;
    // public OVRInput/Controller Update()
    // Offset: 0xE758F0
    GlobalNamespace::OVRInput::Controller Update();
    // private OVRPlugin/ControllerState4 GetOpenVRControllerState(OVRInput/Controller controllerType)
    // Offset: 0xE75DC4
    GlobalNamespace::OVRPlugin::ControllerState4 GetOpenVRControllerState(GlobalNamespace::OVRInput::Controller controllerType);
    // public System.Void SetControllerVibration(System.Single frequency, System.Single amplitude)
    // Offset: 0xE76300
    void SetControllerVibration(float frequency, float amplitude);
    // public System.Void RecenterController()
    // Offset: 0xE76384
    void RecenterController();
    // public System.Boolean WasRecentered()
    // Offset: 0xE763E8
    bool WasRecentered();
    // public System.Byte GetRecenterCount()
    // Offset: 0xE763F0
    uint8_t GetRecenterCount();
    // public System.Byte GetBatteryPercentRemaining()
    // Offset: 0xE763F8
    uint8_t GetBatteryPercentRemaining();
    // public System.Void ConfigureButtonMap()
    // Offset: 0xFFFFFFFF
    void ConfigureButtonMap();
    // public System.Void ConfigureTouchMap()
    // Offset: 0xFFFFFFFF
    void ConfigureTouchMap();
    // public System.Void ConfigureNearTouchMap()
    // Offset: 0xFFFFFFFF
    void ConfigureNearTouchMap();
    // public System.Void ConfigureAxis1DMap()
    // Offset: 0xFFFFFFFF
    void ConfigureAxis1DMap();
    // public System.Void ConfigureAxis2DMap()
    // Offset: 0xFFFFFFFF
    void ConfigureAxis2DMap();
    // public OVRInput/RawButton ResolveToRawMask(OVRInput/Button virtualMask)
    // Offset: 0xE72B98
    GlobalNamespace::OVRInput::RawButton ResolveToRawMask(GlobalNamespace::OVRInput::Button virtualMask);
    // public OVRInput/RawTouch ResolveToRawMask(OVRInput/Touch virtualMask)
    // Offset: 0xE73254
    GlobalNamespace::OVRInput::RawTouch ResolveToRawMask(GlobalNamespace::OVRInput::Touch virtualMask);
    // public OVRInput/RawNearTouch ResolveToRawMask(OVRInput/NearTouch virtualMask)
    // Offset: 0xE73988
    GlobalNamespace::OVRInput::RawNearTouch ResolveToRawMask(GlobalNamespace::OVRInput::NearTouch virtualMask);
    // public OVRInput/RawAxis1D ResolveToRawMask(OVRInput/Axis1D virtualMask)
    // Offset: 0xE74360
    GlobalNamespace::OVRInput::RawAxis1D ResolveToRawMask(GlobalNamespace::OVRInput::Axis1D virtualMask);
    // public OVRInput/RawAxis2D ResolveToRawMask(OVRInput/Axis2D virtualMask)
    // Offset: 0xE748A8
    GlobalNamespace::OVRInput::RawAxis2D ResolveToRawMask(GlobalNamespace::OVRInput::Axis2D virtualMask);
    // public System.Void .ctor()
    // Offset: 0xE75744
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static OVRInput::OVRControllerBase* New_ctor();
  }; // OVRInput/OVRControllerBase
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRInput::OVRControllerBase*, "", "OVRInput/OVRControllerBase");
#pragma pack(pop)
