// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: OVRInput/OVRControllerBase
#include "GlobalNamespace/OVRInput_OVRControllerBase.hpp"
// Including type: OVRInput/RawAxis1D
#include "GlobalNamespace/OVRInput_RawAxis1D.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x24
  #pragma pack(push, 1)
  // Autogenerated type: OVRInput/OVRControllerBase/VirtualAxis1DMap
  class OVRInput::OVRControllerBase::VirtualAxis1DMap : public ::Il2CppObject {
    public:
    // public OVRInput/RawAxis1D None
    // Size: 0x4
    // Offset: 0x10
    GlobalNamespace::OVRInput::RawAxis1D None;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D PrimaryIndexTrigger
    // Size: 0x4
    // Offset: 0x14
    GlobalNamespace::OVRInput::RawAxis1D PrimaryIndexTrigger;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D PrimaryHandTrigger
    // Size: 0x4
    // Offset: 0x18
    GlobalNamespace::OVRInput::RawAxis1D PrimaryHandTrigger;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D SecondaryIndexTrigger
    // Size: 0x4
    // Offset: 0x1C
    GlobalNamespace::OVRInput::RawAxis1D SecondaryIndexTrigger;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D SecondaryHandTrigger
    // Size: 0x4
    // Offset: 0x20
    GlobalNamespace::OVRInput::RawAxis1D SecondaryHandTrigger;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // Creating value type constructor for type: VirtualAxis1DMap
    VirtualAxis1DMap(GlobalNamespace::OVRInput::RawAxis1D None_ = {}, GlobalNamespace::OVRInput::RawAxis1D PrimaryIndexTrigger_ = {}, GlobalNamespace::OVRInput::RawAxis1D PrimaryHandTrigger_ = {}, GlobalNamespace::OVRInput::RawAxis1D SecondaryIndexTrigger_ = {}, GlobalNamespace::OVRInput::RawAxis1D SecondaryHandTrigger_ = {}) noexcept : None{None_}, PrimaryIndexTrigger{PrimaryIndexTrigger_}, PrimaryHandTrigger{PrimaryHandTrigger_}, SecondaryIndexTrigger{SecondaryIndexTrigger_}, SecondaryHandTrigger{SecondaryHandTrigger_} {}
    // public OVRInput/RawAxis1D ToRawMask(OVRInput/Axis1D virtualMask)
    // Offset: 0x1748944
    GlobalNamespace::OVRInput::RawAxis1D ToRawMask(GlobalNamespace::OVRInput::Axis1D virtualMask);
    // public System.Void .ctor()
    // Offset: 0x1747B5C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OVRInput::OVRControllerBase::VirtualAxis1DMap* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OVRInput::OVRControllerBase::VirtualAxis1DMap*, creationType>()));
    }
  }; // OVRInput/OVRControllerBase/VirtualAxis1DMap
  #pragma pack(pop)
  static check_size<sizeof(OVRInput::OVRControllerBase::VirtualAxis1DMap), 32 + sizeof(GlobalNamespace::OVRInput::RawAxis1D)> __GlobalNamespace_OVRInput_OVRControllerBase_VirtualAxis1DMapSizeCheck;
  static_assert(sizeof(OVRInput::OVRControllerBase::VirtualAxis1DMap) == 0x24);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap*, "", "OVRInput/OVRControllerBase/VirtualAxis1DMap");
