// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: OVRPlugin/Step
#include "GlobalNamespace/OVRPlugin_Step.hpp"
// Including type: OVR.OpenVR.VRControllerState_t
#include "OVR/OpenVR/VRControllerState_t.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: OpenVRController because it is already included!
  // Skipping declaration: Controller because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRNode
  struct XRNode;
}
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
  // Forward declaring type: ETrackedDeviceProperty
  struct ETrackedDeviceProperty;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x10
  #pragma pack(push, 1)
  // Autogenerated type: OVRInput
  class OVRInput : public ::Il2CppObject {
    public:
    // Nested type: GlobalNamespace::OVRInput::Button
    struct Button;
    // Nested type: GlobalNamespace::OVRInput::RawButton
    struct RawButton;
    // Nested type: GlobalNamespace::OVRInput::Touch
    struct Touch;
    // Nested type: GlobalNamespace::OVRInput::RawTouch
    struct RawTouch;
    // Nested type: GlobalNamespace::OVRInput::NearTouch
    struct NearTouch;
    // Nested type: GlobalNamespace::OVRInput::RawNearTouch
    struct RawNearTouch;
    // Nested type: GlobalNamespace::OVRInput::Axis1D
    struct Axis1D;
    // Nested type: GlobalNamespace::OVRInput::RawAxis1D
    struct RawAxis1D;
    // Nested type: GlobalNamespace::OVRInput::Axis2D
    struct Axis2D;
    // Nested type: GlobalNamespace::OVRInput::RawAxis2D
    struct RawAxis2D;
    // Nested type: GlobalNamespace::OVRInput::OpenVRButton
    struct OpenVRButton;
    // Nested type: GlobalNamespace::OVRInput::Controller
    struct Controller;
    // Nested type: GlobalNamespace::OVRInput::Handedness
    struct Handedness;
    // Nested type: GlobalNamespace::OVRInput::OpenVRController
    struct OpenVRController;
    // Nested type: GlobalNamespace::OVRInput::OpenVRControllerDetails
    struct OpenVRControllerDetails;
    // Nested type: GlobalNamespace::OVRInput::HapticInfo
    class HapticInfo;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerBase
    class OVRControllerBase;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerTouch
    class OVRControllerTouch;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerLTouch
    class OVRControllerLTouch;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerRTouch
    class OVRControllerRTouch;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerHands
    class OVRControllerHands;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerLHand
    class OVRControllerLHand;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerRHand
    class OVRControllerRHand;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerRemote
    class OVRControllerRemote;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerGamepadPC
    class OVRControllerGamepadPC;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerGamepadMac
    class OVRControllerGamepadMac;
    // Nested type: GlobalNamespace::OVRInput::OVRControllerGamepadAndroid
    class OVRControllerGamepadAndroid;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRInput/Controller
    // [FlagsAttribute] Offset: FFFFFFFF
    struct Controller/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: Controller
      constexpr Controller(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRInput/Controller None
      static constexpr const int None = 0;
      // Get static field: static public OVRInput/Controller None
      static GlobalNamespace::OVRInput::Controller _get_None();
      // Set static field: static public OVRInput/Controller None
      static void _set_None(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller LTouch
      static constexpr const int LTouch = 1;
      // Get static field: static public OVRInput/Controller LTouch
      static GlobalNamespace::OVRInput::Controller _get_LTouch();
      // Set static field: static public OVRInput/Controller LTouch
      static void _set_LTouch(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller RTouch
      static constexpr const int RTouch = 2;
      // Get static field: static public OVRInput/Controller RTouch
      static GlobalNamespace::OVRInput::Controller _get_RTouch();
      // Set static field: static public OVRInput/Controller RTouch
      static void _set_RTouch(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller Touch
      static constexpr const int Touch = 3;
      // Get static field: static public OVRInput/Controller Touch
      static GlobalNamespace::OVRInput::Controller _get_Touch();
      // Set static field: static public OVRInput/Controller Touch
      static void _set_Touch(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller Remote
      static constexpr const int Remote = 4;
      // Get static field: static public OVRInput/Controller Remote
      static GlobalNamespace::OVRInput::Controller _get_Remote();
      // Set static field: static public OVRInput/Controller Remote
      static void _set_Remote(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller Gamepad
      static constexpr const int Gamepad = 16;
      // Get static field: static public OVRInput/Controller Gamepad
      static GlobalNamespace::OVRInput::Controller _get_Gamepad();
      // Set static field: static public OVRInput/Controller Gamepad
      static void _set_Gamepad(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller Hands
      static constexpr const int Hands = 96;
      // Get static field: static public OVRInput/Controller Hands
      static GlobalNamespace::OVRInput::Controller _get_Hands();
      // Set static field: static public OVRInput/Controller Hands
      static void _set_Hands(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller LHand
      static constexpr const int LHand = 32;
      // Get static field: static public OVRInput/Controller LHand
      static GlobalNamespace::OVRInput::Controller _get_LHand();
      // Set static field: static public OVRInput/Controller LHand
      static void _set_LHand(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller RHand
      static constexpr const int RHand = 64;
      // Get static field: static public OVRInput/Controller RHand
      static GlobalNamespace::OVRInput::Controller _get_RHand();
      // Set static field: static public OVRInput/Controller RHand
      static void _set_RHand(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller Active
      static constexpr const int Active = -2147483648;
      // Get static field: static public OVRInput/Controller Active
      static GlobalNamespace::OVRInput::Controller _get_Active();
      // Set static field: static public OVRInput/Controller Active
      static void _set_Active(GlobalNamespace::OVRInput::Controller value);
      // static field const value: static public OVRInput/Controller All
      static constexpr const int All = -1;
      // Get static field: static public OVRInput/Controller All
      static GlobalNamespace::OVRInput::Controller _get_All();
      // Set static field: static public OVRInput/Controller All
      static void _set_All(GlobalNamespace::OVRInput::Controller value);
    }; // OVRInput/Controller
    #pragma pack(pop)
    static check_size<sizeof(OVRInput::Controller), 0 + sizeof(int)> __GlobalNamespace_OVRInput_ControllerSizeCheck;
    static_assert(sizeof(OVRInput::Controller) == 0x4);
    // Size: 0x8
    #pragma pack(push, 1)
    // Autogenerated type: OVRInput/OpenVRController
    // [FlagsAttribute] Offset: FFFFFFFF
    struct OpenVRController/*, public System::Enum*/ {
      public:
      // public System.UInt64 value__
      // Size: 0x8
      // Offset: 0x0
      uint64_t value;
      // Field size check
      static_assert(sizeof(uint64_t) == 0x8);
      // Creating value type constructor for type: OpenVRController
      constexpr OpenVRController(uint64_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator uint64_t
      constexpr operator uint64_t() const noexcept {
        return value;
      }
      // static field const value: static public OVRInput/OpenVRController Unknown
      static constexpr const uint64_t Unknown = 0u;
      // Get static field: static public OVRInput/OpenVRController Unknown
      static GlobalNamespace::OVRInput::OpenVRController _get_Unknown();
      // Set static field: static public OVRInput/OpenVRController Unknown
      static void _set_Unknown(GlobalNamespace::OVRInput::OpenVRController value);
      // static field const value: static public OVRInput/OpenVRController OculusTouch
      static constexpr const uint64_t OculusTouch = 1u;
      // Get static field: static public OVRInput/OpenVRController OculusTouch
      static GlobalNamespace::OVRInput::OpenVRController _get_OculusTouch();
      // Set static field: static public OVRInput/OpenVRController OculusTouch
      static void _set_OculusTouch(GlobalNamespace::OVRInput::OpenVRController value);
      // static field const value: static public OVRInput/OpenVRController ViveController
      static constexpr const uint64_t ViveController = 2u;
      // Get static field: static public OVRInput/OpenVRController ViveController
      static GlobalNamespace::OVRInput::OpenVRController _get_ViveController();
      // Set static field: static public OVRInput/OpenVRController ViveController
      static void _set_ViveController(GlobalNamespace::OVRInput::OpenVRController value);
      // static field const value: static public OVRInput/OpenVRController WindowsMRController
      static constexpr const uint64_t WindowsMRController = 3u;
      // Get static field: static public OVRInput/OpenVRController WindowsMRController
      static GlobalNamespace::OVRInput::OpenVRController _get_WindowsMRController();
      // Set static field: static public OVRInput/OpenVRController WindowsMRController
      static void _set_WindowsMRController(GlobalNamespace::OVRInput::OpenVRController value);
    }; // OVRInput/OpenVRController
    #pragma pack(pop)
    static check_size<sizeof(OVRInput::OpenVRController), 0 + sizeof(uint64_t)> __GlobalNamespace_OVRInput_OpenVRControllerSizeCheck;
    static_assert(sizeof(OVRInput::OpenVRController) == 0x8);
    // Size: 0x68
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRInput/OpenVRControllerDetails
    struct OpenVRControllerDetails/*, public System::ValueType*/ {
      public:
      // public OVR.OpenVR.VRControllerState_t state
      // Size: 0x40
      // Offset: 0x0
      OVR::OpenVR::VRControllerState_t state;
      // Field size check
      static_assert(sizeof(OVR::OpenVR::VRControllerState_t) == 0x40);
      // public OVRInput/OpenVRController controllerType
      // Size: 0x8
      // Offset: 0x40
      GlobalNamespace::OVRInput::OpenVRController controllerType;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRInput::OpenVRController) == 0x8);
      // public System.UInt32 deviceID
      // Size: 0x4
      // Offset: 0x48
      uint deviceID;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public UnityEngine.Vector3 localPosition
      // Size: 0xC
      // Offset: 0x4C
      UnityEngine::Vector3 localPosition;
      // Field size check
      static_assert(sizeof(UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Quaternion localOrientation
      // Size: 0x10
      // Offset: 0x58
      UnityEngine::Quaternion localOrientation;
      // Field size check
      static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
      // Creating value type constructor for type: OpenVRControllerDetails
      constexpr OpenVRControllerDetails(OVR::OpenVR::VRControllerState_t state_ = {}, GlobalNamespace::OVRInput::OpenVRController controllerType_ = {}, uint deviceID_ = {}, UnityEngine::Vector3 localPosition_ = {}, UnityEngine::Quaternion localOrientation_ = {}) noexcept : state{state_}, controllerType{controllerType_}, deviceID{deviceID_}, localPosition{localPosition_}, localOrientation{localOrientation_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
    }; // OVRInput/OpenVRControllerDetails
    #pragma pack(pop)
    static check_size<sizeof(OVRInput::OpenVRControllerDetails), 88 + sizeof(UnityEngine::Quaternion)> __GlobalNamespace_OVRInput_OpenVRControllerDetailsSizeCheck;
    static_assert(sizeof(OVRInput::OpenVRControllerDetails) == 0x68);
    // Creating value type constructor for type: OVRInput
    OVRInput() noexcept {}
    // Get static field: static private readonly System.Single AXIS_AS_BUTTON_THRESHOLD
    static float _get_AXIS_AS_BUTTON_THRESHOLD();
    // Set static field: static private readonly System.Single AXIS_AS_BUTTON_THRESHOLD
    static void _set_AXIS_AS_BUTTON_THRESHOLD(float value);
    // Get static field: static private readonly System.Single AXIS_DEADZONE_THRESHOLD
    static float _get_AXIS_DEADZONE_THRESHOLD();
    // Set static field: static private readonly System.Single AXIS_DEADZONE_THRESHOLD
    static void _set_AXIS_DEADZONE_THRESHOLD(float value);
    // Get static field: static private System.Collections.Generic.List`1<OVRInput/OVRControllerBase> controllers
    static System::Collections::Generic::List_1<GlobalNamespace::OVRInput::OVRControllerBase*>* _get_controllers();
