// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVRMixedRealityCaptureConfiguration
#include "GlobalNamespace/OVRMixedRealityCaptureConfiguration.hpp"
// Including type: OVRManager/ColorSpace
#include "GlobalNamespace/OVRManager_ColorSpace.hpp"
// Including type: OVRManager/CompositionMethod
#include "GlobalNamespace/OVRManager_CompositionMethod.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: OVRManager/CameraDevice
#include "GlobalNamespace/OVRManager_CameraDevice.hpp"
// Including type: OVRManager/DepthQuality
#include "GlobalNamespace/OVRManager_DepthQuality.hpp"
// Including type: OVRManager/VirtualGreenScreenType
#include "GlobalNamespace/OVRManager_VirtualGreenScreenType.hpp"
// Including type: OVRManager/MrcActivationMode
#include "GlobalNamespace/OVRManager_MrcActivationMode.hpp"
// Including type: OVRManager/TrackingOrigin
#include "GlobalNamespace/OVRManager_TrackingOrigin.hpp"
// Including type: OVRManager/XRDevice
#include "GlobalNamespace/OVRManager_XRDevice.hpp"
// Including type: OVRPlugin/EventDataBuffer
#include "GlobalNamespace/OVRPlugin_EventDataBuffer.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Vector4
  struct Vector4;
  // Skipping declaration: Quaternion because it is already included!
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: InstantiateMrcCameraDelegate
  class OVRManager_InstantiateMrcCameraDelegate;
  // Forward declaring type: OVRDisplay
  class OVRDisplay;
  // Forward declaring type: OVRTracker
  class OVRTracker;
  // Forward declaring type: OVRBoundary
  class OVRBoundary;
  // Forward declaring type: OVRProfile
  class OVRProfile;
  // Forward declaring type: OVRMixedRealityCaptureSettings
  class OVRMixedRealityCaptureSettings;
  // Forward declaring type: XrApi
  struct OVRManager_XrApi;
  // Forward declaring type: EyeTextureFormat
  struct OVRManager_EyeTextureFormat;
  // Forward declaring type: FixedFoveatedRenderingLevel
  struct OVRManager_FixedFoveatedRenderingLevel;
  // Forward declaring type: TiledMultiResLevel
  struct OVRManager_TiledMultiResLevel;
  // Forward declaring type: SystemHeadsetType
  struct OVRManager_SystemHeadsetType;
  // Forward declaring type: OVRPose
  struct OVRPose;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: WeakReference`1<T>
  template<typename T>
  class WeakReference_1;
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRNode
  struct XRNode;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xF3
  #pragma pack(push, 1)
  // Autogenerated type: OVRManager
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRManager : public UnityEngine::MonoBehaviour/*, public GlobalNamespace::OVRMixedRealityCaptureConfiguration*/ {
    public:
    // private System.Collections.Generic.IEnumerable`1<UnityEngine.Camera> disabledCameras
    // Size: 0x8
    // Offset: 0x18
    System::Collections::Generic::IEnumerable_1<UnityEngine::Camera*>* disabledCameras;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::IEnumerable_1<UnityEngine::Camera*>*) == 0x8);
    // private System.Single prevTimeScale
    // Size: 0x4
    // Offset: 0x20
    float prevTimeScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0xDEF714
    // [TooltipAttribute] Offset: 0xDEF714
    // public System.Boolean useRecommendedMSAALevel
    // Size: 0x1
    // Offset: 0x24
    bool useRecommendedMSAALevel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDEF774
    // private System.Boolean _monoscopic
    // Size: 0x1
    // Offset: 0x25
    bool monoscopic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDEF7C0
    // public System.Boolean enableAdaptiveResolution
    // Size: 0x1
    // Offset: 0x26
    bool enableAdaptiveResolution;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableAdaptiveResolution and: colorGamut
    char __padding4[0x1] = {};
    // private OVRManager/ColorSpace _colorGamut
    // Size: 0x4
    // Offset: 0x28
    GlobalNamespace::OVRManager_ColorSpace colorGamut;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager_ColorSpace) == 0x4);
    // [RangeAttribute] Offset: 0xDEF830
    // [TooltipAttribute] Offset: 0xDEF830
    // public System.Single minRenderScale
    // Size: 0x4
    // Offset: 0x2C
    float minRenderScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xDEF884
    // [TooltipAttribute] Offset: 0xDEF884
    // public System.Single maxRenderScale
    // Size: 0x4
    // Offset: 0x30
    float maxRenderScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDEF8D8
    // private UnityEngine.Vector3 _headPoseRelativeOffsetRotation
    // Size: 0xC
    // Offset: 0x34
    UnityEngine::Vector3 headPoseRelativeOffsetRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xDEF924
    // private UnityEngine.Vector3 _headPoseRelativeOffsetTranslation
    // Size: 0xC
    // Offset: 0x40
    UnityEngine::Vector3 headPoseRelativeOffsetTranslation;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public System.Int32 profilerTcpPort
    // Size: 0x4
    // Offset: 0x4C
    int profilerTcpPort;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean expandMixedRealityCapturePropertySheet
    // Size: 0x1
    // Offset: 0x50
    bool expandMixedRealityCapturePropertySheet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDEF980
    // public System.Boolean enableMixedReality
    // Size: 0x1
    // Offset: 0x51
    bool enableMixedReality;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableMixedReality and: compositionMethod
    char __padding12[0x2] = {};
    // public OVRManager/CompositionMethod compositionMethod
    // Size: 0x4
    // Offset: 0x54
    GlobalNamespace::OVRManager_CompositionMethod compositionMethod;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager_CompositionMethod) == 0x4);
    // [TooltipAttribute] Offset: 0xDEF9DC
    // public UnityEngine.LayerMask extraHiddenLayers
    // Size: 0x4
    // Offset: 0x58
    UnityEngine::LayerMask extraHiddenLayers;
    // Field size check
    static_assert(sizeof(UnityEngine::LayerMask) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFA28
    // public UnityEngine.LayerMask extraVisibleLayers
    // Size: 0x4
    // Offset: 0x5C
    UnityEngine::LayerMask extraVisibleLayers;
    // Field size check
    static_assert(sizeof(UnityEngine::LayerMask) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFA74
    // public System.Boolean dynamicCullingMask
    // Size: 0x1
    // Offset: 0x60
    bool dynamicCullingMask;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: dynamicCullingMask and: externalCompositionBackdropColorRift
    char __padding16[0x3] = {};
    // [TooltipAttribute] Offset: 0xDEFAC0
    // public UnityEngine.Color externalCompositionBackdropColorRift
    // Size: 0x10
    // Offset: 0x64
    UnityEngine::Color externalCompositionBackdropColorRift;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // [TooltipAttribute] Offset: 0xDEFB0C
    // public UnityEngine.Color externalCompositionBackdropColorQuest
    // Size: 0x10
    // Offset: 0x74
    UnityEngine::Color externalCompositionBackdropColorQuest;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // [TooltipAttribute] Offset: 0xDEFB58
    // public OVRManager/CameraDevice capturingCameraDevice
    // Size: 0x4
    // Offset: 0x84
    GlobalNamespace::OVRManager_CameraDevice capturingCameraDevice;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager_CameraDevice) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFBA4
    // public System.Boolean flipCameraFrameHorizontally
    // Size: 0x1
    // Offset: 0x88
    bool flipCameraFrameHorizontally;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDEFBF0
    // public System.Boolean flipCameraFrameVertically
    // Size: 0x1
    // Offset: 0x89
    bool flipCameraFrameVertically;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: flipCameraFrameVertically and: handPoseStateLatency
    char __padding21[0x2] = {};
    // [TooltipAttribute] Offset: 0xDEFC3C
    // public System.Single handPoseStateLatency
    // Size: 0x4
    // Offset: 0x8C
    float handPoseStateLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFC88
    // public System.Single sandwichCompositionRenderLatency
    // Size: 0x4
    // Offset: 0x90
    float sandwichCompositionRenderLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFCD4
    // public System.Int32 sandwichCompositionBufferedFrames
    // Size: 0x4
    // Offset: 0x94
    int sandwichCompositionBufferedFrames;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFD20
    // public UnityEngine.Color chromaKeyColor
    // Size: 0x10
    // Offset: 0x98
    UnityEngine::Color chromaKeyColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // [TooltipAttribute] Offset: 0xDEFD6C
    // public System.Single chromaKeySimilarity
    // Size: 0x4
    // Offset: 0xA8
    float chromaKeySimilarity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFDB8
    // public System.Single chromaKeySmoothRange
    // Size: 0x4
    // Offset: 0xAC
    float chromaKeySmoothRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFE04
    // public System.Single chromaKeySpillRange
    // Size: 0x4
    // Offset: 0xB0
    float chromaKeySpillRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFE50
    // public System.Boolean useDynamicLighting
    // Size: 0x1
    // Offset: 0xB4
    bool useDynamicLighting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useDynamicLighting and: depthQuality
    char __padding29[0x3] = {};
    // [TooltipAttribute] Offset: 0xDEFE9C
    // public OVRManager/DepthQuality depthQuality
    // Size: 0x4
    // Offset: 0xB8
    GlobalNamespace::OVRManager_DepthQuality depthQuality;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager_DepthQuality) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFEE8
    // public System.Single dynamicLightingSmoothFactor
    // Size: 0x4
    // Offset: 0xBC
    float dynamicLightingSmoothFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFF34
    // public System.Single dynamicLightingDepthVariationClampingValue
    // Size: 0x4
    // Offset: 0xC0
    float dynamicLightingDepthVariationClampingValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFF80
    // public OVRManager/VirtualGreenScreenType virtualGreenScreenType
    // Size: 0x4
    // Offset: 0xC4
    GlobalNamespace::OVRManager_VirtualGreenScreenType virtualGreenScreenType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager_VirtualGreenScreenType) == 0x4);
    // [TooltipAttribute] Offset: 0xDEFFCC
    // public System.Single virtualGreenScreenTopY
    // Size: 0x4
    // Offset: 0xC8
    float virtualGreenScreenTopY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF0018
    // public System.Single virtualGreenScreenBottomY
    // Size: 0x4
    // Offset: 0xCC
    float virtualGreenScreenBottomY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF0064
    // public System.Boolean virtualGreenScreenApplyDepthCulling
    // Size: 0x1
    // Offset: 0xD0
    bool virtualGreenScreenApplyDepthCulling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: virtualGreenScreenApplyDepthCulling and: virtualGreenScreenDepthTolerance
    char __padding36[0x3] = {};
    // [TooltipAttribute] Offset: 0xDF00B0
    // public System.Single virtualGreenScreenDepthTolerance
    // Size: 0x4
    // Offset: 0xD4
    float virtualGreenScreenDepthTolerance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF00FC
    // public OVRManager/MrcActivationMode mrcActivationMode
    // Size: 0x4
    // Offset: 0xD8
    GlobalNamespace::OVRManager_MrcActivationMode mrcActivationMode;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager_MrcActivationMode) == 0x4);
    // Padding between fields: mrcActivationMode and: instantiateMixedRealityCameraGameObject
    char __padding38[0x4] = {};
    // public OVRManager/InstantiateMrcCameraDelegate instantiateMixedRealityCameraGameObject
    // Size: 0x8
    // Offset: 0xE0
    GlobalNamespace::OVRManager_InstantiateMrcCameraDelegate* instantiateMixedRealityCameraGameObject;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager_InstantiateMrcCameraDelegate*) == 0x8);
    // [HeaderAttribute] Offset: 0xDF0148
    // [TooltipAttribute] Offset: 0xDF0148
    // private OVRManager/TrackingOrigin _trackingOriginType
    // Size: 0x4
    // Offset: 0xE8
    GlobalNamespace::OVRManager_TrackingOrigin trackingOriginType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager_TrackingOrigin) == 0x4);
    // [TooltipAttribute] Offset: 0xDF01B8
    // public System.Boolean usePositionTracking
    // Size: 0x1
    // Offset: 0xEC
    bool usePositionTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean useRotationTracking
    // Size: 0x1
    // Offset: 0xED
    bool useRotationTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDF0200
    // public System.Boolean useIPDInPositionTracking
    // Size: 0x1
    // Offset: 0xEE
    bool useIPDInPositionTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDF0238
    // public System.Boolean resetTrackerOnLoad
    // Size: 0x1
    // Offset: 0xEF
    bool resetTrackerOnLoad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDF0270
    // public System.Boolean AllowRecenter
    // Size: 0x1
    // Offset: 0xF0
    bool AllowRecenter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDF02A8
    // public System.Boolean LateControllerUpdate
    // Size: 0x1
    // Offset: 0xF1
    bool LateControllerUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isSupportedPlatform>k__BackingField
    // Size: 0x1
    // Offset: 0xF2
    bool isSupportedPlatform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: OVRManager
