// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRMixedRealityCaptureSettings
  class OVRMixedRealityCaptureSettings;
  // Forward declaring type: OVRProfile
  class OVRProfile;
  // Forward declaring type: OVRBoundary
  class OVRBoundary;
  // Forward declaring type: OVRTracker
  class OVRTracker;
  // Forward declaring type: OVRDisplay
  class OVRDisplay;
  // Forward declaring type: OVRPose
  struct OVRPose;
  // Skipping declaration: TrackingOrigin because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Vector4
  struct Vector4;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRNode
  struct XRNode;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xF8
  // Autogenerated type: OVRManager
  // [] Offset: FFFFFFFF
  class OVRManager : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::OVRManager::TrackingOrigin
    struct TrackingOrigin;
    // Nested type: GlobalNamespace::OVRManager::EyeTextureFormat
    struct EyeTextureFormat;
    // Nested type: GlobalNamespace::OVRManager::FixedFoveatedRenderingLevel
    struct FixedFoveatedRenderingLevel;
    // Nested type: GlobalNamespace::OVRManager::TiledMultiResLevel
    struct TiledMultiResLevel;
    // Nested type: GlobalNamespace::OVRManager::XRDevice
    struct XRDevice;
    // Nested type: GlobalNamespace::OVRManager::CompositionMethod
    struct CompositionMethod;
    // Nested type: GlobalNamespace::OVRManager::CameraDevice
    struct CameraDevice;
    // Nested type: GlobalNamespace::OVRManager::DepthQuality
    struct DepthQuality;
    // Nested type: GlobalNamespace::OVRManager::VirtualGreenScreenType
    struct VirtualGreenScreenType;
    // Nested type: GlobalNamespace::OVRManager::MrcActivationMode
    struct MrcActivationMode;
    // Nested type: GlobalNamespace::OVRManager::$$c
    class $$c;
    // Size: 0x4
    // Autogenerated type: OVRManager/TrackingOrigin
    // [] Offset: FFFFFFFF
    struct TrackingOrigin/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: TrackingOrigin
      constexpr TrackingOrigin(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/TrackingOrigin EyeLevel
      static constexpr const int EyeLevel = 0;
      // Get static field: static public OVRManager/TrackingOrigin EyeLevel
      static GlobalNamespace::OVRManager::TrackingOrigin _get_EyeLevel();
      // Set static field: static public OVRManager/TrackingOrigin EyeLevel
      static void _set_EyeLevel(GlobalNamespace::OVRManager::TrackingOrigin value);
      // static field const value: static public OVRManager/TrackingOrigin FloorLevel
      static constexpr const int FloorLevel = 1;
      // Get static field: static public OVRManager/TrackingOrigin FloorLevel
      static GlobalNamespace::OVRManager::TrackingOrigin _get_FloorLevel();
      // Set static field: static public OVRManager/TrackingOrigin FloorLevel
      static void _set_FloorLevel(GlobalNamespace::OVRManager::TrackingOrigin value);
      // static field const value: static public OVRManager/TrackingOrigin Stage
      static constexpr const int Stage = 2;
      // Get static field: static public OVRManager/TrackingOrigin Stage
      static GlobalNamespace::OVRManager::TrackingOrigin _get_Stage();
      // Set static field: static public OVRManager/TrackingOrigin Stage
      static void _set_Stage(GlobalNamespace::OVRManager::TrackingOrigin value);
    }; // OVRManager/TrackingOrigin
    static check_size<sizeof(OVRManager::TrackingOrigin), 0 + sizeof(int)> __GlobalNamespace_OVRManager_TrackingOriginSizeCheck;
    static_assert(sizeof(OVRManager::TrackingOrigin) == 0x4);
    // Size: 0x4
    // Autogenerated type: OVRManager/XRDevice
    // [] Offset: FFFFFFFF
    struct XRDevice/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: XRDevice
      constexpr XRDevice(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/XRDevice Unknown
      static constexpr const int Unknown = 0;
      // Get static field: static public OVRManager/XRDevice Unknown
      static GlobalNamespace::OVRManager::XRDevice _get_Unknown();
      // Set static field: static public OVRManager/XRDevice Unknown
      static void _set_Unknown(GlobalNamespace::OVRManager::XRDevice value);
      // static field const value: static public OVRManager/XRDevice Oculus
      static constexpr const int Oculus = 1;
      // Get static field: static public OVRManager/XRDevice Oculus
      static GlobalNamespace::OVRManager::XRDevice _get_Oculus();
      // Set static field: static public OVRManager/XRDevice Oculus
      static void _set_Oculus(GlobalNamespace::OVRManager::XRDevice value);
      // static field const value: static public OVRManager/XRDevice OpenVR
      static constexpr const int OpenVR = 2;
      // Get static field: static public OVRManager/XRDevice OpenVR
      static GlobalNamespace::OVRManager::XRDevice _get_OpenVR();
      // Set static field: static public OVRManager/XRDevice OpenVR
      static void _set_OpenVR(GlobalNamespace::OVRManager::XRDevice value);
    }; // OVRManager/XRDevice
    static check_size<sizeof(OVRManager::XRDevice), 0 + sizeof(int)> __GlobalNamespace_OVRManager_XRDeviceSizeCheck;
    static_assert(sizeof(OVRManager::XRDevice) == 0x4);
    // Size: 0x4
    // Autogenerated type: OVRManager/CompositionMethod
    // [] Offset: FFFFFFFF
    struct CompositionMethod/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: CompositionMethod
      constexpr CompositionMethod(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/CompositionMethod External
      static constexpr const int External = 0;
      // Get static field: static public OVRManager/CompositionMethod External
      static GlobalNamespace::OVRManager::CompositionMethod _get_External();
      // Set static field: static public OVRManager/CompositionMethod External
      static void _set_External(GlobalNamespace::OVRManager::CompositionMethod value);
      // static field const value: static public OVRManager/CompositionMethod Direct
      static constexpr const int Direct = 1;
      // Get static field: static public OVRManager/CompositionMethod Direct
      static GlobalNamespace::OVRManager::CompositionMethod _get_Direct();
      // Set static field: static public OVRManager/CompositionMethod Direct
      static void _set_Direct(GlobalNamespace::OVRManager::CompositionMethod value);
    }; // OVRManager/CompositionMethod
    static check_size<sizeof(OVRManager::CompositionMethod), 0 + sizeof(int)> __GlobalNamespace_OVRManager_CompositionMethodSizeCheck;
    static_assert(sizeof(OVRManager::CompositionMethod) == 0x4);
    // Size: 0x4
    // Autogenerated type: OVRManager/CameraDevice
    // [] Offset: FFFFFFFF
    struct CameraDevice/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: CameraDevice
      constexpr CameraDevice(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/CameraDevice WebCamera0
      static constexpr const int WebCamera0 = 0;
      // Get static field: static public OVRManager/CameraDevice WebCamera0
      static GlobalNamespace::OVRManager::CameraDevice _get_WebCamera0();
      // Set static field: static public OVRManager/CameraDevice WebCamera0
      static void _set_WebCamera0(GlobalNamespace::OVRManager::CameraDevice value);
      // static field const value: static public OVRManager/CameraDevice WebCamera1
      static constexpr const int WebCamera1 = 1;
      // Get static field: static public OVRManager/CameraDevice WebCamera1
      static GlobalNamespace::OVRManager::CameraDevice _get_WebCamera1();
      // Set static field: static public OVRManager/CameraDevice WebCamera1
      static void _set_WebCamera1(GlobalNamespace::OVRManager::CameraDevice value);
      // static field const value: static public OVRManager/CameraDevice ZEDCamera
      static constexpr const int ZEDCamera = 2;
      // Get static field: static public OVRManager/CameraDevice ZEDCamera
      static GlobalNamespace::OVRManager::CameraDevice _get_ZEDCamera();
      // Set static field: static public OVRManager/CameraDevice ZEDCamera
      static void _set_ZEDCamera(GlobalNamespace::OVRManager::CameraDevice value);
    }; // OVRManager/CameraDevice
    static check_size<sizeof(OVRManager::CameraDevice), 0 + sizeof(int)> __GlobalNamespace_OVRManager_CameraDeviceSizeCheck;
    static_assert(sizeof(OVRManager::CameraDevice) == 0x4);
    // Size: 0x4
    // Autogenerated type: OVRManager/DepthQuality
    // [] Offset: FFFFFFFF
    struct DepthQuality/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: DepthQuality
      constexpr DepthQuality(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/DepthQuality Low
      static constexpr const int Low = 0;
      // Get static field: static public OVRManager/DepthQuality Low
      static GlobalNamespace::OVRManager::DepthQuality _get_Low();
      // Set static field: static public OVRManager/DepthQuality Low
      static void _set_Low(GlobalNamespace::OVRManager::DepthQuality value);
      // static field const value: static public OVRManager/DepthQuality Medium
      static constexpr const int Medium = 1;
      // Get static field: static public OVRManager/DepthQuality Medium
      static GlobalNamespace::OVRManager::DepthQuality _get_Medium();
      // Set static field: static public OVRManager/DepthQuality Medium
      static void _set_Medium(GlobalNamespace::OVRManager::DepthQuality value);
      // static field const value: static public OVRManager/DepthQuality High
      static constexpr const int High = 2;
      // Get static field: static public OVRManager/DepthQuality High
      static GlobalNamespace::OVRManager::DepthQuality _get_High();
      // Set static field: static public OVRManager/DepthQuality High
      static void _set_High(GlobalNamespace::OVRManager::DepthQuality value);
    }; // OVRManager/DepthQuality
    static check_size<sizeof(OVRManager::DepthQuality), 0 + sizeof(int)> __GlobalNamespace_OVRManager_DepthQualitySizeCheck;
    static_assert(sizeof(OVRManager::DepthQuality) == 0x4);
    // Size: 0x4
    // Autogenerated type: OVRManager/VirtualGreenScreenType
    // [] Offset: FFFFFFFF
    struct VirtualGreenScreenType/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: VirtualGreenScreenType
      constexpr VirtualGreenScreenType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/VirtualGreenScreenType Off
      static constexpr const int Off = 0;
      // Get static field: static public OVRManager/VirtualGreenScreenType Off
      static GlobalNamespace::OVRManager::VirtualGreenScreenType _get_Off();
      // Set static field: static public OVRManager/VirtualGreenScreenType Off
      static void _set_Off(GlobalNamespace::OVRManager::VirtualGreenScreenType value);
      // static field const value: static public OVRManager/VirtualGreenScreenType OuterBoundary
      static constexpr const int OuterBoundary = 1;
      // Get static field: static public OVRManager/VirtualGreenScreenType OuterBoundary
      static GlobalNamespace::OVRManager::VirtualGreenScreenType _get_OuterBoundary();
      // Set static field: static public OVRManager/VirtualGreenScreenType OuterBoundary
      static void _set_OuterBoundary(GlobalNamespace::OVRManager::VirtualGreenScreenType value);
      // static field const value: static public OVRManager/VirtualGreenScreenType PlayArea
      static constexpr const int PlayArea = 2;
      // Get static field: static public OVRManager/VirtualGreenScreenType PlayArea
      static GlobalNamespace::OVRManager::VirtualGreenScreenType _get_PlayArea();
      // Set static field: static public OVRManager/VirtualGreenScreenType PlayArea
      static void _set_PlayArea(GlobalNamespace::OVRManager::VirtualGreenScreenType value);
    }; // OVRManager/VirtualGreenScreenType
    static check_size<sizeof(OVRManager::VirtualGreenScreenType), 0 + sizeof(int)> __GlobalNamespace_OVRManager_VirtualGreenScreenTypeSizeCheck;
    static_assert(sizeof(OVRManager::VirtualGreenScreenType) == 0x4);
    // Size: 0x4
    // Autogenerated type: OVRManager/MrcActivationMode
    // [] Offset: FFFFFFFF
    struct MrcActivationMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: MrcActivationMode
      constexpr MrcActivationMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/MrcActivationMode Automatic
      static constexpr const int Automatic = 0;
      // Get static field: static public OVRManager/MrcActivationMode Automatic
      static GlobalNamespace::OVRManager::MrcActivationMode _get_Automatic();
      // Set static field: static public OVRManager/MrcActivationMode Automatic
      static void _set_Automatic(GlobalNamespace::OVRManager::MrcActivationMode value);
      // static field const value: static public OVRManager/MrcActivationMode Disabled
      static constexpr const int Disabled = 1;
      // Get static field: static public OVRManager/MrcActivationMode Disabled
      static GlobalNamespace::OVRManager::MrcActivationMode _get_Disabled();
      // Set static field: static public OVRManager/MrcActivationMode Disabled
      static void _set_Disabled(GlobalNamespace::OVRManager::MrcActivationMode value);
    }; // OVRManager/MrcActivationMode
    static check_size<sizeof(OVRManager::MrcActivationMode), 0 + sizeof(int)> __GlobalNamespace_OVRManager_MrcActivationModeSizeCheck;
    static_assert(sizeof(OVRManager::MrcActivationMode) == 0x4);
    // private System.Collections.Generic.IEnumerable`1<UnityEngine.Camera> disabledCameras
    // Size: 0x8
    // Offset: 0x18
    System::Collections::Generic::IEnumerable_1<UnityEngine::Camera*>* disabledCameras;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::IEnumerable_1<UnityEngine::Camera*>*) == 0x8);
    // private System.Single prevTimeScale
    // Size: 0x4
    // Offset: 0x20
    float prevTimeScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0xD85B7C
    // [TooltipAttribute] Offset: 0xD85B7C
    // public System.Boolean queueAhead
    // Size: 0x1
    // Offset: 0x24
    bool queueAhead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xD85BDC
    // public System.Boolean useRecommendedMSAALevel
    // Size: 0x1
    // Offset: 0x25
    bool useRecommendedMSAALevel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xD85C14
    // private System.Boolean _monoscopic
    // Size: 0x1
    // Offset: 0x26
    bool monoscopic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xD85C60
    // public System.Boolean enableAdaptiveResolution
    // Size: 0x1
    // Offset: 0x27
    bool enableAdaptiveResolution;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [RangeAttribute] Offset: 0xD85C98
    // [TooltipAttribute] Offset: 0xD85C98
    // public System.Single minRenderScale
    // Size: 0x4
    // Offset: 0x28
    float minRenderScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xD85CEC
    // [TooltipAttribute] Offset: 0xD85CEC
    // public System.Single maxRenderScale
    // Size: 0x4
    // Offset: 0x2C
    float maxRenderScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xD85D40
    // private UnityEngine.Vector3 _headPoseRelativeOffsetRotation
    // Size: 0xC
    // Offset: 0x30
    UnityEngine::Vector3 headPoseRelativeOffsetRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xD85D8C
    // private UnityEngine.Vector3 _headPoseRelativeOffsetTranslation
    // Size: 0xC
    // Offset: 0x3C
    UnityEngine::Vector3 headPoseRelativeOffsetTranslation;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public System.Int32 profilerTcpPort
    // Size: 0x4
    // Offset: 0x48
    int profilerTcpPort;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [HideInInspector] Offset: 0xD85DD8
    // public System.Boolean expandMixedRealityCapturePropertySheet
    // Size: 0x1
    // Offset: 0x4C
    bool expandMixedRealityCapturePropertySheet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [HideInInspector] Offset: 0xD85DE8
    // [TooltipAttribute] Offset: 0xD85DE8
    // public System.Boolean enableMixedReality
    // Size: 0x1
    // Offset: 0x4D
    bool enableMixedReality;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableMixedReality and: instantiateMixedRealityBackgroundCameraGameObject
    char __padding12[0x2] = {};
    // [CompilerGeneratedAttribute] Offset: 0xD85E34
    // private System.Func`2<UnityEngine.Camera,UnityEngine.GameObject> <instantiateMixedRealityBackgroundCameraGameObject>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    System::Func_2<UnityEngine::Camera*, UnityEngine::GameObject*>* instantiateMixedRealityBackgroundCameraGameObject;
    // Field size check
    static_assert(sizeof(System::Func_2<UnityEngine::Camera*, UnityEngine::GameObject*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD85E44
    // private System.Func`2<UnityEngine.Camera,UnityEngine.GameObject> <instantiateMixedRealityForegroundCameraGameObject>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    System::Func_2<UnityEngine::Camera*, UnityEngine::GameObject*>* instantiateMixedRealityForegroundCameraGameObject;
    // Field size check
    static_assert(sizeof(System::Func_2<UnityEngine::Camera*, UnityEngine::GameObject*>*) == 0x8);
    // [HideInInspector] Offset: 0xD85E54
    // public OVRManager/CompositionMethod compositionMethod
    // Size: 0x4
    // Offset: 0x60
    GlobalNamespace::OVRManager::CompositionMethod compositionMethod;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager::CompositionMethod) == 0x4);
    // [HideInInspector] Offset: 0xD85E64
    // [TooltipAttribute] Offset: 0xD85E64
    // public UnityEngine.LayerMask extraHiddenLayers
    // Size: 0x4
    // Offset: 0x64
    UnityEngine::LayerMask extraHiddenLayers;
    // Field size check
    static_assert(sizeof(UnityEngine::LayerMask) == 0x4);
    // [HideInInspector] Offset: 0xD85EB0
    // [TooltipAttribute] Offset: 0xD85EB0
    // public UnityEngine.Color externalCompositionBackdropColorRift
    // Size: 0x10
    // Offset: 0x68
    UnityEngine::Color externalCompositionBackdropColorRift;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // [HideInInspector] Offset: 0xD85EFC
    // [TooltipAttribute] Offset: 0xD85EFC
    // public UnityEngine.Color externalCompositionBackdropColorQuest
    // Size: 0x10
    // Offset: 0x78
    UnityEngine::Color externalCompositionBackdropColorQuest;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // [HideInInspector] Offset: 0xD85F48
    // [TooltipAttribute] Offset: 0xD85F48
    // public OVRManager/CameraDevice capturingCameraDevice
    // Size: 0x4
    // Offset: 0x88
    GlobalNamespace::OVRManager::CameraDevice capturingCameraDevice;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager::CameraDevice) == 0x4);
    // [HideInInspector] Offset: 0xD85F94
    // [TooltipAttribute] Offset: 0xD85F94
    // public System.Boolean flipCameraFrameHorizontally
    // Size: 0x1
    // Offset: 0x8C
    bool flipCameraFrameHorizontally;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [HideInInspector] Offset: 0xD85FE0
    // [TooltipAttribute] Offset: 0xD85FE0
    // public System.Boolean flipCameraFrameVertically
    // Size: 0x1
    // Offset: 0x8D
    bool flipCameraFrameVertically;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: flipCameraFrameVertically and: handPoseStateLatency
    char __padding21[0x2] = {};
    // [HideInInspector] Offset: 0xD8602C
    // [TooltipAttribute] Offset: 0xD8602C
    // public System.Single handPoseStateLatency
    // Size: 0x4
    // Offset: 0x90
    float handPoseStateLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD86078
    // [TooltipAttribute] Offset: 0xD86078
    // public System.Single sandwichCompositionRenderLatency
    // Size: 0x4
    // Offset: 0x94
    float sandwichCompositionRenderLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD860C4
    // [TooltipAttribute] Offset: 0xD860C4
    // public System.Int32 sandwichCompositionBufferedFrames
    // Size: 0x4
    // Offset: 0x98
    int sandwichCompositionBufferedFrames;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [HideInInspector] Offset: 0xD86110
    // [TooltipAttribute] Offset: 0xD86110
    // public UnityEngine.Color chromaKeyColor
    // Size: 0x10
    // Offset: 0x9C
    UnityEngine::Color chromaKeyColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // [HideInInspector] Offset: 0xD8615C
    // [TooltipAttribute] Offset: 0xD8615C
    // public System.Single chromaKeySimilarity
    // Size: 0x4
    // Offset: 0xAC
    float chromaKeySimilarity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD861A8
    // [TooltipAttribute] Offset: 0xD861A8
    // public System.Single chromaKeySmoothRange
    // Size: 0x4
    // Offset: 0xB0
    float chromaKeySmoothRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD861F4
    // [TooltipAttribute] Offset: 0xD861F4
    // public System.Single chromaKeySpillRange
    // Size: 0x4
    // Offset: 0xB4
    float chromaKeySpillRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD86240
    // [TooltipAttribute] Offset: 0xD86240
    // public System.Boolean useDynamicLighting
    // Size: 0x1
    // Offset: 0xB8
    bool useDynamicLighting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useDynamicLighting and: depthQuality
    char __padding29[0x3] = {};
    // [HideInInspector] Offset: 0xD8628C
    // [TooltipAttribute] Offset: 0xD8628C
    // public OVRManager/DepthQuality depthQuality
    // Size: 0x4
    // Offset: 0xBC
    GlobalNamespace::OVRManager::DepthQuality depthQuality;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager::DepthQuality) == 0x4);
    // [HideInInspector] Offset: 0xD862D8
    // [TooltipAttribute] Offset: 0xD862D8
    // public System.Single dynamicLightingSmoothFactor
    // Size: 0x4
    // Offset: 0xC0
    float dynamicLightingSmoothFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD86324
    // [TooltipAttribute] Offset: 0xD86324
    // public System.Single dynamicLightingDepthVariationClampingValue
    // Size: 0x4
    // Offset: 0xC4
    float dynamicLightingDepthVariationClampingValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD86370
    // [TooltipAttribute] Offset: 0xD86370
    // public OVRManager/VirtualGreenScreenType virtualGreenScreenType
    // Size: 0x4
    // Offset: 0xC8
    GlobalNamespace::OVRManager::VirtualGreenScreenType virtualGreenScreenType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager::VirtualGreenScreenType) == 0x4);
    // [HideInInspector] Offset: 0xD863BC
    // [TooltipAttribute] Offset: 0xD863BC
    // public System.Single virtualGreenScreenTopY
    // Size: 0x4
    // Offset: 0xCC
    float virtualGreenScreenTopY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD86408
    // [TooltipAttribute] Offset: 0xD86408
    // public System.Single virtualGreenScreenBottomY
    // Size: 0x4
    // Offset: 0xD0
    float virtualGreenScreenBottomY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD86454
    // [TooltipAttribute] Offset: 0xD86454
    // public System.Boolean virtualGreenScreenApplyDepthCulling
    // Size: 0x1
    // Offset: 0xD4
    bool virtualGreenScreenApplyDepthCulling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: virtualGreenScreenApplyDepthCulling and: virtualGreenScreenDepthTolerance
    char __padding36[0x3] = {};
    // [HideInInspector] Offset: 0xD864A0
    // [TooltipAttribute] Offset: 0xD864A0
    // public System.Single virtualGreenScreenDepthTolerance
    // Size: 0x4
    // Offset: 0xD8
    float virtualGreenScreenDepthTolerance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HideInInspector] Offset: 0xD864EC
    // [TooltipAttribute] Offset: 0xD864EC
    // public OVRManager/MrcActivationMode mrcActivationMode
    // Size: 0x4
    // Offset: 0xDC
    GlobalNamespace::OVRManager::MrcActivationMode mrcActivationMode;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager::MrcActivationMode) == 0x4);
    // [HeaderAttribute] Offset: 0xD86538
    // [TooltipAttribute] Offset: 0xD86538
    // private OVRManager/TrackingOrigin _trackingOriginType
    // Size: 0x4
    // Offset: 0xE0
    GlobalNamespace::OVRManager::TrackingOrigin trackingOriginType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager::TrackingOrigin) == 0x4);
    // [TooltipAttribute] Offset: 0xD865A8
    // public System.Boolean usePositionTracking
    // Size: 0x1
    // Offset: 0xE4
    bool usePositionTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [HideInInspector] Offset: 0xD865E0
    // public System.Boolean useRotationTracking
    // Size: 0x1
    // Offset: 0xE5
    bool useRotationTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xD865F0
    // public System.Boolean useIPDInPositionTracking
    // Size: 0x1
    // Offset: 0xE6
    bool useIPDInPositionTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xD86628
    // public System.Boolean resetTrackerOnLoad
    // Size: 0x1
    // Offset: 0xE7
    bool resetTrackerOnLoad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xD86660
    // public System.Boolean AllowRecenter
    // Size: 0x1
    // Offset: 0xE8
    bool AllowRecenter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xD86698
    // private System.Boolean _reorientHMDOnControllerRecenter
    // Size: 0x1
    // Offset: 0xE9
    bool reorientHMDOnControllerRecenter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xD866E4
    // public System.Boolean LateControllerUpdate
    // Size: 0x1
    // Offset: 0xEA
    bool LateControllerUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xD8671C
    // private System.Boolean <isSupportedPlatform>k__BackingField
    // Size: 0x1
    // Offset: 0xEB
    bool isSupportedPlatform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean suppressDisableMixedRealityBecauseOfNoMainCameraWarning
    // Size: 0x1
    // Offset: 0xEC
    bool suppressDisableMixedRealityBecauseOfNoMainCameraWarning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean multipleMainCameraWarningPresented
    // Size: 0x1
    // Offset: 0xED
    bool multipleMainCameraWarningPresented;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: multipleMainCameraWarningPresented and: lastFoundMainCamera
    char __padding49[0x2] = {};
    // private UnityEngine.Camera lastFoundMainCamera
    // Size: 0x8
    // Offset: 0xF0
    UnityEngine::Camera* lastFoundMainCamera;
    // Field size check
    static_assert(sizeof(UnityEngine::Camera*) == 0x8);
    // Creating value type constructor for type: OVRManager
