// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRMixedRealityCaptureSettings
  class OVRMixedRealityCaptureSettings;
  // Forward declaring type: OVRProfile
  class OVRProfile;
  // Forward declaring type: OVRBoundary
  class OVRBoundary;
  // Forward declaring type: OVRTracker
  class OVRTracker;
  // Forward declaring type: OVRDisplay
  class OVRDisplay;
  // Forward declaring type: OVRPose
  struct OVRPose;
  // Skipping declaration: TrackingOrigin because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Vector4
  struct Vector4;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRNode
  struct XRNode;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: OVRManager
  class OVRManager : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::OVRManager::TrackingOrigin
    struct TrackingOrigin;
    // Nested type: GlobalNamespace::OVRManager::EyeTextureFormat
    struct EyeTextureFormat;
    // Nested type: GlobalNamespace::OVRManager::FixedFoveatedRenderingLevel
    struct FixedFoveatedRenderingLevel;
    // Nested type: GlobalNamespace::OVRManager::TiledMultiResLevel
    struct TiledMultiResLevel;
    // Nested type: GlobalNamespace::OVRManager::XRDevice
    struct XRDevice;
    // Nested type: GlobalNamespace::OVRManager::CompositionMethod
    struct CompositionMethod;
    // Nested type: GlobalNamespace::OVRManager::CameraDevice
    struct CameraDevice;
    // Nested type: GlobalNamespace::OVRManager::DepthQuality
    struct DepthQuality;
    // Nested type: GlobalNamespace::OVRManager::VirtualGreenScreenType
    struct VirtualGreenScreenType;
    // Nested type: GlobalNamespace::OVRManager::MrcActivationMode
    struct MrcActivationMode;
    // Nested type: GlobalNamespace::OVRManager::$$c
    class $$c;
    // Autogenerated type: OVRManager/TrackingOrigin
    struct TrackingOrigin : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: TrackingOrigin
      constexpr TrackingOrigin(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/TrackingOrigin EyeLevel
      static constexpr const int EyeLevel = 0;
      // Get static field: static public OVRManager/TrackingOrigin EyeLevel
      static GlobalNamespace::OVRManager::TrackingOrigin _get_EyeLevel();
      // Set static field: static public OVRManager/TrackingOrigin EyeLevel
      static void _set_EyeLevel(GlobalNamespace::OVRManager::TrackingOrigin value);
      // static field const value: static public OVRManager/TrackingOrigin FloorLevel
      static constexpr const int FloorLevel = 1;
      // Get static field: static public OVRManager/TrackingOrigin FloorLevel
      static GlobalNamespace::OVRManager::TrackingOrigin _get_FloorLevel();
      // Set static field: static public OVRManager/TrackingOrigin FloorLevel
      static void _set_FloorLevel(GlobalNamespace::OVRManager::TrackingOrigin value);
      // static field const value: static public OVRManager/TrackingOrigin Stage
      static constexpr const int Stage = 2;
      // Get static field: static public OVRManager/TrackingOrigin Stage
      static GlobalNamespace::OVRManager::TrackingOrigin _get_Stage();
      // Set static field: static public OVRManager/TrackingOrigin Stage
      static void _set_Stage(GlobalNamespace::OVRManager::TrackingOrigin value);
    }; // OVRManager/TrackingOrigin
    // Autogenerated type: OVRManager/XRDevice
    struct XRDevice : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: XRDevice
      constexpr XRDevice(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/XRDevice Unknown
      static constexpr const int Unknown = 0;
      // Get static field: static public OVRManager/XRDevice Unknown
      static GlobalNamespace::OVRManager::XRDevice _get_Unknown();
      // Set static field: static public OVRManager/XRDevice Unknown
      static void _set_Unknown(GlobalNamespace::OVRManager::XRDevice value);
      // static field const value: static public OVRManager/XRDevice Oculus
      static constexpr const int Oculus = 1;
      // Get static field: static public OVRManager/XRDevice Oculus
      static GlobalNamespace::OVRManager::XRDevice _get_Oculus();
      // Set static field: static public OVRManager/XRDevice Oculus
      static void _set_Oculus(GlobalNamespace::OVRManager::XRDevice value);
      // static field const value: static public OVRManager/XRDevice OpenVR
      static constexpr const int OpenVR = 2;
      // Get static field: static public OVRManager/XRDevice OpenVR
      static GlobalNamespace::OVRManager::XRDevice _get_OpenVR();
      // Set static field: static public OVRManager/XRDevice OpenVR
      static void _set_OpenVR(GlobalNamespace::OVRManager::XRDevice value);
    }; // OVRManager/XRDevice
    // Autogenerated type: OVRManager/CompositionMethod
    struct CompositionMethod : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: CompositionMethod
      constexpr CompositionMethod(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/CompositionMethod External
      static constexpr const int External = 0;
      // Get static field: static public OVRManager/CompositionMethod External
      static GlobalNamespace::OVRManager::CompositionMethod _get_External();
      // Set static field: static public OVRManager/CompositionMethod External
      static void _set_External(GlobalNamespace::OVRManager::CompositionMethod value);
      // static field const value: static public OVRManager/CompositionMethod Direct
      static constexpr const int Direct = 1;
      // Get static field: static public OVRManager/CompositionMethod Direct
      static GlobalNamespace::OVRManager::CompositionMethod _get_Direct();
      // Set static field: static public OVRManager/CompositionMethod Direct
      static void _set_Direct(GlobalNamespace::OVRManager::CompositionMethod value);
    }; // OVRManager/CompositionMethod
    // Autogenerated type: OVRManager/CameraDevice
    struct CameraDevice : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: CameraDevice
      constexpr CameraDevice(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/CameraDevice WebCamera0
      static constexpr const int WebCamera0 = 0;
      // Get static field: static public OVRManager/CameraDevice WebCamera0
      static GlobalNamespace::OVRManager::CameraDevice _get_WebCamera0();
      // Set static field: static public OVRManager/CameraDevice WebCamera0
      static void _set_WebCamera0(GlobalNamespace::OVRManager::CameraDevice value);
      // static field const value: static public OVRManager/CameraDevice WebCamera1
      static constexpr const int WebCamera1 = 1;
      // Get static field: static public OVRManager/CameraDevice WebCamera1
      static GlobalNamespace::OVRManager::CameraDevice _get_WebCamera1();
      // Set static field: static public OVRManager/CameraDevice WebCamera1
      static void _set_WebCamera1(GlobalNamespace::OVRManager::CameraDevice value);
      // static field const value: static public OVRManager/CameraDevice ZEDCamera
      static constexpr const int ZEDCamera = 2;
      // Get static field: static public OVRManager/CameraDevice ZEDCamera
      static GlobalNamespace::OVRManager::CameraDevice _get_ZEDCamera();
      // Set static field: static public OVRManager/CameraDevice ZEDCamera
      static void _set_ZEDCamera(GlobalNamespace::OVRManager::CameraDevice value);
    }; // OVRManager/CameraDevice
    // Autogenerated type: OVRManager/DepthQuality
    struct DepthQuality : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: DepthQuality
      constexpr DepthQuality(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/DepthQuality Low
      static constexpr const int Low = 0;
      // Get static field: static public OVRManager/DepthQuality Low
      static GlobalNamespace::OVRManager::DepthQuality _get_Low();
      // Set static field: static public OVRManager/DepthQuality Low
      static void _set_Low(GlobalNamespace::OVRManager::DepthQuality value);
      // static field const value: static public OVRManager/DepthQuality Medium
      static constexpr const int Medium = 1;
      // Get static field: static public OVRManager/DepthQuality Medium
      static GlobalNamespace::OVRManager::DepthQuality _get_Medium();
      // Set static field: static public OVRManager/DepthQuality Medium
      static void _set_Medium(GlobalNamespace::OVRManager::DepthQuality value);
      // static field const value: static public OVRManager/DepthQuality High
      static constexpr const int High = 2;
      // Get static field: static public OVRManager/DepthQuality High
      static GlobalNamespace::OVRManager::DepthQuality _get_High();
      // Set static field: static public OVRManager/DepthQuality High
      static void _set_High(GlobalNamespace::OVRManager::DepthQuality value);
    }; // OVRManager/DepthQuality
    // Autogenerated type: OVRManager/VirtualGreenScreenType
    struct VirtualGreenScreenType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: VirtualGreenScreenType
      constexpr VirtualGreenScreenType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/VirtualGreenScreenType Off
      static constexpr const int Off = 0;
      // Get static field: static public OVRManager/VirtualGreenScreenType Off
      static GlobalNamespace::OVRManager::VirtualGreenScreenType _get_Off();
      // Set static field: static public OVRManager/VirtualGreenScreenType Off
      static void _set_Off(GlobalNamespace::OVRManager::VirtualGreenScreenType value);
      // static field const value: static public OVRManager/VirtualGreenScreenType OuterBoundary
      static constexpr const int OuterBoundary = 1;
      // Get static field: static public OVRManager/VirtualGreenScreenType OuterBoundary
      static GlobalNamespace::OVRManager::VirtualGreenScreenType _get_OuterBoundary();
      // Set static field: static public OVRManager/VirtualGreenScreenType OuterBoundary
      static void _set_OuterBoundary(GlobalNamespace::OVRManager::VirtualGreenScreenType value);
      // static field const value: static public OVRManager/VirtualGreenScreenType PlayArea
      static constexpr const int PlayArea = 2;
      // Get static field: static public OVRManager/VirtualGreenScreenType PlayArea
      static GlobalNamespace::OVRManager::VirtualGreenScreenType _get_PlayArea();
      // Set static field: static public OVRManager/VirtualGreenScreenType PlayArea
      static void _set_PlayArea(GlobalNamespace::OVRManager::VirtualGreenScreenType value);
    }; // OVRManager/VirtualGreenScreenType
    // Autogenerated type: OVRManager/MrcActivationMode
    struct MrcActivationMode : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: MrcActivationMode
      constexpr MrcActivationMode(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRManager/MrcActivationMode Automatic
      static constexpr const int Automatic = 0;
      // Get static field: static public OVRManager/MrcActivationMode Automatic
      static GlobalNamespace::OVRManager::MrcActivationMode _get_Automatic();
      // Set static field: static public OVRManager/MrcActivationMode Automatic
      static void _set_Automatic(GlobalNamespace::OVRManager::MrcActivationMode value);
      // static field const value: static public OVRManager/MrcActivationMode Disabled
      static constexpr const int Disabled = 1;
      // Get static field: static public OVRManager/MrcActivationMode Disabled
      static GlobalNamespace::OVRManager::MrcActivationMode _get_Disabled();
      // Set static field: static public OVRManager/MrcActivationMode Disabled
      static void _set_Disabled(GlobalNamespace::OVRManager::MrcActivationMode value);
    }; // OVRManager/MrcActivationMode
    // private System.Collections.Generic.IEnumerable`1<UnityEngine.Camera> disabledCameras
    // Offset: 0x18
    System::Collections::Generic::IEnumerable_1<UnityEngine::Camera*>* disabledCameras;
    // private System.Single prevTimeScale
    // Offset: 0x20
    float prevTimeScale;
    // public System.Boolean queueAhead
    // Offset: 0x24
    bool queueAhead;
    // public System.Boolean useRecommendedMSAALevel
    // Offset: 0x25
    bool useRecommendedMSAALevel;
    // private System.Boolean _monoscopic
    // Offset: 0x26
    bool monoscopic;
    // public System.Boolean enableAdaptiveResolution
    // Offset: 0x27
    bool enableAdaptiveResolution;
    // public System.Single minRenderScale
    // Offset: 0x28
    float minRenderScale;
    // public System.Single maxRenderScale
    // Offset: 0x2C
    float maxRenderScale;
    // private UnityEngine.Vector3 _headPoseRelativeOffsetRotation
    // Offset: 0x30
    UnityEngine::Vector3 headPoseRelativeOffsetRotation;
    // private UnityEngine.Vector3 _headPoseRelativeOffsetTranslation
    // Offset: 0x3C
    UnityEngine::Vector3 headPoseRelativeOffsetTranslation;
    // public System.Int32 profilerTcpPort
    // Offset: 0x48
    int profilerTcpPort;
    // public System.Boolean expandMixedRealityCapturePropertySheet
    // Offset: 0x4C
    bool expandMixedRealityCapturePropertySheet;
    // public System.Boolean enableMixedReality
    // Offset: 0x4D
    bool enableMixedReality;
    // private System.Func`2<UnityEngine.Camera,UnityEngine.GameObject> <instantiateMixedRealityBackgroundCameraGameObject>k__BackingField
    // Offset: 0x50
    System::Func_2<UnityEngine::Camera*, UnityEngine::GameObject*>* instantiateMixedRealityBackgroundCameraGameObject;
    // private System.Func`2<UnityEngine.Camera,UnityEngine.GameObject> <instantiateMixedRealityForegroundCameraGameObject>k__BackingField
    // Offset: 0x58
    System::Func_2<UnityEngine::Camera*, UnityEngine::GameObject*>* instantiateMixedRealityForegroundCameraGameObject;
    // public OVRManager/CompositionMethod compositionMethod
    // Offset: 0x60
    GlobalNamespace::OVRManager::CompositionMethod compositionMethod;
    // public UnityEngine.LayerMask extraHiddenLayers
    // Offset: 0x64
    UnityEngine::LayerMask extraHiddenLayers;
    // public UnityEngine.Color externalCompositionBackdropColorRift
    // Offset: 0x68
    UnityEngine::Color externalCompositionBackdropColorRift;
    // public UnityEngine.Color externalCompositionBackdropColorQuest
    // Offset: 0x78
    UnityEngine::Color externalCompositionBackdropColorQuest;
    // public OVRManager/CameraDevice capturingCameraDevice
    // Offset: 0x88
    GlobalNamespace::OVRManager::CameraDevice capturingCameraDevice;
    // public System.Boolean flipCameraFrameHorizontally
    // Offset: 0x8C
    bool flipCameraFrameHorizontally;
    // public System.Boolean flipCameraFrameVertically
    // Offset: 0x8D
    bool flipCameraFrameVertically;
    // public System.Single handPoseStateLatency
    // Offset: 0x90
    float handPoseStateLatency;
    // public System.Single sandwichCompositionRenderLatency
    // Offset: 0x94
    float sandwichCompositionRenderLatency;
    // public System.Int32 sandwichCompositionBufferedFrames
    // Offset: 0x98
    int sandwichCompositionBufferedFrames;
    // public UnityEngine.Color chromaKeyColor
    // Offset: 0x9C
    UnityEngine::Color chromaKeyColor;
    // public System.Single chromaKeySimilarity
    // Offset: 0xAC
    float chromaKeySimilarity;
    // public System.Single chromaKeySmoothRange
    // Offset: 0xB0
    float chromaKeySmoothRange;
    // public System.Single chromaKeySpillRange
    // Offset: 0xB4
    float chromaKeySpillRange;
    // public System.Boolean useDynamicLighting
    // Offset: 0xB8
    bool useDynamicLighting;
    // public OVRManager/DepthQuality depthQuality
    // Offset: 0xBC
    GlobalNamespace::OVRManager::DepthQuality depthQuality;
    // public System.Single dynamicLightingSmoothFactor
    // Offset: 0xC0
    float dynamicLightingSmoothFactor;
    // public System.Single dynamicLightingDepthVariationClampingValue
    // Offset: 0xC4
    float dynamicLightingDepthVariationClampingValue;
    // public OVRManager/VirtualGreenScreenType virtualGreenScreenType
    // Offset: 0xC8
    GlobalNamespace::OVRManager::VirtualGreenScreenType virtualGreenScreenType;
    // public System.Single virtualGreenScreenTopY
    // Offset: 0xCC
    float virtualGreenScreenTopY;
    // public System.Single virtualGreenScreenBottomY
    // Offset: 0xD0
    float virtualGreenScreenBottomY;
    // public System.Boolean virtualGreenScreenApplyDepthCulling
    // Offset: 0xD4
    bool virtualGreenScreenApplyDepthCulling;
    // public System.Single virtualGreenScreenDepthTolerance
    // Offset: 0xD8
    float virtualGreenScreenDepthTolerance;
    // public OVRManager/MrcActivationMode mrcActivationMode
    // Offset: 0xDC
    GlobalNamespace::OVRManager::MrcActivationMode mrcActivationMode;
    // private OVRManager/TrackingOrigin _trackingOriginType
    // Offset: 0xE0
    GlobalNamespace::OVRManager::TrackingOrigin trackingOriginType;
    // public System.Boolean usePositionTracking
    // Offset: 0xE4
    bool usePositionTracking;
    // public System.Boolean useRotationTracking
    // Offset: 0xE5
    bool useRotationTracking;
    // public System.Boolean useIPDInPositionTracking
    // Offset: 0xE6
    bool useIPDInPositionTracking;
    // public System.Boolean resetTrackerOnLoad
    // Offset: 0xE7
    bool resetTrackerOnLoad;
    // public System.Boolean AllowRecenter
    // Offset: 0xE8
    bool AllowRecenter;
    // private System.Boolean _reorientHMDOnControllerRecenter
    // Offset: 0xE9
    bool reorientHMDOnControllerRecenter;
    // public System.Boolean LateControllerUpdate
    // Offset: 0xEA
    bool LateControllerUpdate;
    // private System.Boolean <isSupportedPlatform>k__BackingField
    // Offset: 0xEB
    bool isSupportedPlatform;
    // private System.Boolean suppressDisableMixedRealityBecauseOfNoMainCameraWarning
    // Offset: 0xEC
    bool suppressDisableMixedRealityBecauseOfNoMainCameraWarning;
    // private System.Boolean multipleMainCameraWarningPresented
    // Offset: 0xED
    bool multipleMainCameraWarningPresented;
    // private UnityEngine.Camera lastFoundMainCamera
    // Offset: 0xF0
    UnityEngine::Camera* lastFoundMainCamera;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get static field: static private OVRManager <instance>k__BackingField
    static GlobalNamespace::OVRManager* _get_$instance$k__BackingField();
    // Set static field: static private OVRManager <instance>k__BackingField
    static void _set_$instance$k__BackingField(GlobalNamespace::OVRManager* value);
    // Get static field: static private OVRDisplay <display>k__BackingField
    static GlobalNamespace::OVRDisplay* _get_$display$k__BackingField();
    // Set static field: static private OVRDisplay <display>k__BackingField
    static void _set_$display$k__BackingField(GlobalNamespace::OVRDisplay* value);
    // Get static field: static private OVRTracker <tracker>k__BackingField
    static GlobalNamespace::OVRTracker* _get_$tracker$k__BackingField();
