// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: OVRPlugin/TextureRectMatrixf
#include "GlobalNamespace/OVRPlugin_TextureRectMatrixf.hpp"
// Including type: OVRPlugin/EyeTextureFormat
#include "GlobalNamespace/OVRPlugin_EyeTextureFormat.hpp"
// Including type: OVRPlugin/LayerDesc
#include "GlobalNamespace/OVRPlugin_LayerDesc.hpp"
// Including type: System.Runtime.InteropServices.GCHandle
#include "System/Runtime/InteropServices/GCHandle.hpp"
// Including type: OVRManager/XRDevice
#include "GlobalNamespace/OVRManager_XRDevice.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: OverlayShape because it is already included!
  // Forward declaring type: OVRPose
  struct OVRPose;
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRNode
  struct XRNode;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x1C5
  #pragma pack(push, 1)
  // Autogenerated type: OVROverlay
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class OVROverlay : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::OVROverlay::OverlayShape
    struct OverlayShape;
    // Nested type: GlobalNamespace::OVROverlay::OverlayType
    struct OverlayType;
    // Nested type: GlobalNamespace::OVROverlay::ExternalSurfaceObjectCreated
    class ExternalSurfaceObjectCreated;
    // Nested type: GlobalNamespace::OVROverlay::LayerTexture
    struct LayerTexture;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVROverlay/OverlayShape
    // [TokenAttribute] Offset: FFFFFFFF
    struct OverlayShape/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: OverlayShape
      constexpr OverlayShape(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVROverlay/OverlayShape Quad
      static constexpr const int Quad = 0;
      // Get static field: static public OVROverlay/OverlayShape Quad
      static GlobalNamespace::OVROverlay::OverlayShape _get_Quad();
      // Set static field: static public OVROverlay/OverlayShape Quad
      static void _set_Quad(GlobalNamespace::OVROverlay::OverlayShape value);
      // static field const value: static public OVROverlay/OverlayShape Cylinder
      static constexpr const int Cylinder = 1;
      // Get static field: static public OVROverlay/OverlayShape Cylinder
      static GlobalNamespace::OVROverlay::OverlayShape _get_Cylinder();
      // Set static field: static public OVROverlay/OverlayShape Cylinder
      static void _set_Cylinder(GlobalNamespace::OVROverlay::OverlayShape value);
      // static field const value: static public OVROverlay/OverlayShape Cubemap
      static constexpr const int Cubemap = 2;
      // Get static field: static public OVROverlay/OverlayShape Cubemap
      static GlobalNamespace::OVROverlay::OverlayShape _get_Cubemap();
      // Set static field: static public OVROverlay/OverlayShape Cubemap
      static void _set_Cubemap(GlobalNamespace::OVROverlay::OverlayShape value);
      // static field const value: static public OVROverlay/OverlayShape OffcenterCubemap
      static constexpr const int OffcenterCubemap = 4;
      // Get static field: static public OVROverlay/OverlayShape OffcenterCubemap
      static GlobalNamespace::OVROverlay::OverlayShape _get_OffcenterCubemap();
      // Set static field: static public OVROverlay/OverlayShape OffcenterCubemap
      static void _set_OffcenterCubemap(GlobalNamespace::OVROverlay::OverlayShape value);
      // static field const value: static public OVROverlay/OverlayShape Equirect
      static constexpr const int Equirect = 5;
      // Get static field: static public OVROverlay/OverlayShape Equirect
      static GlobalNamespace::OVROverlay::OverlayShape _get_Equirect();
      // Set static field: static public OVROverlay/OverlayShape Equirect
      static void _set_Equirect(GlobalNamespace::OVROverlay::OverlayShape value);
      // static field const value: static public OVROverlay/OverlayShape Fisheye
      static constexpr const int Fisheye = 9;
      // Get static field: static public OVROverlay/OverlayShape Fisheye
      static GlobalNamespace::OVROverlay::OverlayShape _get_Fisheye();
      // Set static field: static public OVROverlay/OverlayShape Fisheye
      static void _set_Fisheye(GlobalNamespace::OVROverlay::OverlayShape value);
      // Get instance field: public System.Int32 value__
      int _get_value__();
      // Set instance field: public System.Int32 value__
      void _set_value__(int value);
    }; // OVROverlay/OverlayShape
    #pragma pack(pop)
    static check_size<sizeof(OVROverlay::OverlayShape), 0 + sizeof(int)> __GlobalNamespace_OVROverlay_OverlayShapeSizeCheck;
    static_assert(sizeof(OVROverlay::OverlayShape) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVROverlay/OverlayType
    // [TokenAttribute] Offset: FFFFFFFF
    struct OverlayType/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: OverlayType
      constexpr OverlayType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVROverlay/OverlayType None
      static constexpr const int None = 0;
      // Get static field: static public OVROverlay/OverlayType None
      static GlobalNamespace::OVROverlay::OverlayType _get_None();
      // Set static field: static public OVROverlay/OverlayType None
      static void _set_None(GlobalNamespace::OVROverlay::OverlayType value);
      // static field const value: static public OVROverlay/OverlayType Underlay
      static constexpr const int Underlay = 1;
      // Get static field: static public OVROverlay/OverlayType Underlay
      static GlobalNamespace::OVROverlay::OverlayType _get_Underlay();
      // Set static field: static public OVROverlay/OverlayType Underlay
      static void _set_Underlay(GlobalNamespace::OVROverlay::OverlayType value);
      // static field const value: static public OVROverlay/OverlayType Overlay
      static constexpr const int Overlay = 2;
      // Get static field: static public OVROverlay/OverlayType Overlay
      static GlobalNamespace::OVROverlay::OverlayType _get_Overlay();
      // Set static field: static public OVROverlay/OverlayType Overlay
      static void _set_Overlay(GlobalNamespace::OVROverlay::OverlayType value);
      // Get instance field: public System.Int32 value__
      int _get_value__();
      // Set instance field: public System.Int32 value__
      void _set_value__(int value);
    }; // OVROverlay/OverlayType
    #pragma pack(pop)
    static check_size<sizeof(OVROverlay::OverlayType), 0 + sizeof(int)> __GlobalNamespace_OVROverlay_OverlayTypeSizeCheck;
    static_assert(sizeof(OVROverlay::OverlayType) == 0x4);
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVROverlay/LayerTexture
    // [TokenAttribute] Offset: FFFFFFFF
    struct LayerTexture/*, public System::ValueType*/ {
      public:
      // public UnityEngine.Texture appTexture
      // Size: 0x8
      // Offset: 0x0
      UnityEngine::Texture* appTexture;
      // Field size check
      static_assert(sizeof(UnityEngine::Texture*) == 0x8);
      // public System.IntPtr appTexturePtr
      // Size: 0x8
      // Offset: 0x8
      System::IntPtr appTexturePtr;
      // Field size check
      static_assert(sizeof(System::IntPtr) == 0x8);
      // public UnityEngine.Texture[] swapChain
      // Size: 0x8
      // Offset: 0x10
      ::Array<UnityEngine::Texture*>* swapChain;
      // Field size check
      static_assert(sizeof(::Array<UnityEngine::Texture*>*) == 0x8);
      // public System.IntPtr[] swapChainPtr
      // Size: 0x8
      // Offset: 0x18
      ::Array<System::IntPtr>* swapChainPtr;
      // Field size check
      static_assert(sizeof(::Array<System::IntPtr>*) == 0x8);
      // Creating value type constructor for type: LayerTexture
      constexpr LayerTexture(UnityEngine::Texture* appTexture_ = {}, System::IntPtr appTexturePtr_ = {}, ::Array<UnityEngine::Texture*>* swapChain_ = {}, ::Array<System::IntPtr>* swapChainPtr_ = {}) noexcept : appTexture{appTexture_}, appTexturePtr{appTexturePtr_}, swapChain{swapChain_}, swapChainPtr{swapChainPtr_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get instance field: public UnityEngine.Texture appTexture
      UnityEngine::Texture* _get_appTexture();
      // Set instance field: public UnityEngine.Texture appTexture
      void _set_appTexture(UnityEngine::Texture* value);
      // Get instance field: public System.IntPtr appTexturePtr
      System::IntPtr _get_appTexturePtr();
      // Set instance field: public System.IntPtr appTexturePtr
      void _set_appTexturePtr(System::IntPtr value);
      // Get instance field: public UnityEngine.Texture[] swapChain
      ::Array<UnityEngine::Texture*>* _get_swapChain();
      // Set instance field: public UnityEngine.Texture[] swapChain
      void _set_swapChain(::Array<UnityEngine::Texture*>* value);
      // Get instance field: public System.IntPtr[] swapChainPtr
      ::Array<System::IntPtr>* _get_swapChainPtr();
      // Set instance field: public System.IntPtr[] swapChainPtr
      void _set_swapChainPtr(::Array<System::IntPtr>* value);
    }; // OVROverlay/LayerTexture
    #pragma pack(pop)
    static check_size<sizeof(OVROverlay::LayerTexture), 24 + sizeof(::Array<System::IntPtr>*)> __GlobalNamespace_OVROverlay_LayerTextureSizeCheck;
    static_assert(sizeof(OVROverlay::LayerTexture) == 0x20);
    // [TooltipAttribute] Offset: 0xDBCE60
    // public OVROverlay/OverlayType currentOverlayType
    // Size: 0x4
    // Offset: 0x18
    GlobalNamespace::OVROverlay::OverlayType currentOverlayType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVROverlay::OverlayType) == 0x4);
    // [TooltipAttribute] Offset: 0xDBCE98
    // public System.Boolean isDynamic
    // Size: 0x1
    // Offset: 0x1C
    bool isDynamic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDBCED0
    // public System.Boolean isProtectedContent
    // Size: 0x1
    // Offset: 0x1D
    bool isProtectedContent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isProtectedContent and: srcRectLeft
    char __padding2[0x2] = {};
    // public UnityEngine.Rect srcRectLeft
    // Size: 0x10
    // Offset: 0x20
    UnityEngine::Rect srcRectLeft;
    // Field size check
    static_assert(sizeof(UnityEngine::Rect) == 0x10);
    // public UnityEngine.Rect srcRectRight
    // Size: 0x10
    // Offset: 0x30
    UnityEngine::Rect srcRectRight;
    // Field size check
    static_assert(sizeof(UnityEngine::Rect) == 0x10);
    // public UnityEngine.Rect destRectLeft
    // Size: 0x10
    // Offset: 0x40
    UnityEngine::Rect destRectLeft;
    // Field size check
    static_assert(sizeof(UnityEngine::Rect) == 0x10);
    // public UnityEngine.Rect destRectRight
    // Size: 0x10
    // Offset: 0x50
    UnityEngine::Rect destRectRight;
    // Field size check
    static_assert(sizeof(UnityEngine::Rect) == 0x10);
    // public System.Boolean invertTextureRects
    // Size: 0x1
    // Offset: 0x60
    bool invertTextureRects;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: invertTextureRects and: textureRectMatrix
    char __padding7[0x3] = {};
    // private OVRPlugin/TextureRectMatrixf textureRectMatrix
    // Size: 0x40
    // Offset: 0x64
    GlobalNamespace::OVRPlugin::TextureRectMatrixf textureRectMatrix;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRPlugin::TextureRectMatrixf) == 0x40);
    // public System.Boolean overrideTextureRectMatrix
    // Size: 0x1
    // Offset: 0xA4
    bool overrideTextureRectMatrix;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean overridePerLayerColorScaleAndOffset
    // Size: 0x1
    // Offset: 0xA5
    bool overridePerLayerColorScaleAndOffset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overridePerLayerColorScaleAndOffset and: colorScale
    char __padding10[0x2] = {};
    // public UnityEngine.Vector4 colorScale
    // Size: 0x10
    // Offset: 0xA8
    UnityEngine::Vector4 colorScale;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector4) == 0x10);
    // public UnityEngine.Vector4 colorOffset
    // Size: 0x10
    // Offset: 0xB8
    UnityEngine::Vector4 colorOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector4) == 0x10);
    // public System.Boolean useExpensiveSuperSample
    // Size: 0x1
    // Offset: 0xC8
    bool useExpensiveSuperSample;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hidden
    // Size: 0x1
    // Offset: 0xC9
    bool hidden;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDBCF08
    // public System.Boolean isExternalSurface
    // Size: 0x1
    // Offset: 0xCA
    bool isExternalSurface;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isExternalSurface and: externalSurfaceWidth
    char __padding15[0x1] = {};
    // [TooltipAttribute] Offset: 0xDBCF40
    // public System.Int32 externalSurfaceWidth
    // Size: 0x4
    // Offset: 0xCC
    int externalSurfaceWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0xDBCF78
    // public System.Int32 externalSurfaceHeight
    // Size: 0x4
    // Offset: 0xD0
    int externalSurfaceHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0xDBCFB0
    // public System.Int32 compositionDepth
    // Size: 0x4
    // Offset: 0xD4
    int compositionDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 layerCompositionDepth
    // Size: 0x4
    // Offset: 0xD8
    int layerCompositionDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0xDBCFE8
    // public System.Boolean noDepthBufferTesting
    // Size: 0x1
    // Offset: 0xDC
    bool noDepthBufferTesting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: noDepthBufferTesting and: layerTextureFormat
    char __padding20[0x3] = {};
    // public OVRPlugin/EyeTextureFormat layerTextureFormat
    // Size: 0x4
    // Offset: 0xE0
    GlobalNamespace::OVRPlugin::EyeTextureFormat layerTextureFormat;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRPlugin::EyeTextureFormat) == 0x4);
    // [TooltipAttribute] Offset: 0xDBD020
    // public OVROverlay/OverlayShape currentOverlayShape
    // Size: 0x4
    // Offset: 0xE4
    GlobalNamespace::OVROverlay::OverlayShape currentOverlayShape;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVROverlay::OverlayShape) == 0x4);
    // private OVROverlay/OverlayShape prevOverlayShape
    // Size: 0x4
    // Offset: 0xE8
    GlobalNamespace::OVROverlay::OverlayShape prevOverlayShape;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVROverlay::OverlayShape) == 0x4);
    // Padding between fields: prevOverlayShape and: textures
    char __padding23[0x4] = {};
    // [TooltipAttribute] Offset: 0xDBD058
    // public UnityEngine.Texture[] textures
    // Size: 0x8
    // Offset: 0xF0
    ::Array<UnityEngine::Texture*>* textures;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Texture*>*) == 0x8);
    // [TooltipAttribute] Offset: 0xDBD090
    // public System.Boolean isAlphaPremultiplied
    // Size: 0x1
    // Offset: 0xF8
    bool isAlphaPremultiplied;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _previewInEditor
    // Size: 0x1
    // Offset: 0xF9
    bool previewInEditor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: previewInEditor and: texturePtrs
    char __padding26[0x6] = {};
    // protected System.IntPtr[] texturePtrs
    // Size: 0x8
    // Offset: 0x100
    ::Array<System::IntPtr>* texturePtrs;
    // Field size check
    static_assert(sizeof(::Array<System::IntPtr>*) == 0x8);
    // public System.IntPtr externalSurfaceObject
    // Size: 0x8
    // Offset: 0x108
    System::IntPtr externalSurfaceObject;
    // Field size check
    static_assert(sizeof(System::IntPtr) == 0x8);
    // public OVROverlay/ExternalSurfaceObjectCreated externalSurfaceObjectCreated
    // Size: 0x8
    // Offset: 0x110
    GlobalNamespace::OVROverlay::ExternalSurfaceObjectCreated* externalSurfaceObjectCreated;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVROverlay::ExternalSurfaceObjectCreated*) == 0x8);
    // protected System.Boolean isOverridePending
    // Size: 0x1
    // Offset: 0x118
    bool isOverridePending;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isOverridePending and: layerTextures
    char __padding30[0x7] = {};
    // private OVROverlay/LayerTexture[] layerTextures
    // Size: 0x8
    // Offset: 0x120
    ::Array<GlobalNamespace::OVROverlay::LayerTexture>* layerTextures;
    // Field size check
    static_assert(sizeof(::Array<GlobalNamespace::OVROverlay::LayerTexture>*) == 0x8);
    // private OVRPlugin/LayerDesc layerDesc
    // Size: 0x4C
    // Offset: 0x128
    GlobalNamespace::OVRPlugin::LayerDesc layerDesc;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRPlugin::LayerDesc) == 0x4C);
    // Padding between fields: layerDesc and: stageCount
    char __padding32[0x4] = {};
    // private System.Int32 stageCount
    // Size: 0x4
    // Offset: 0x178
    int stageCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 layerIndex
    // Size: 0x4
    // Offset: 0x17C
    int layerIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 layerId
    // Size: 0x4
    // Offset: 0x180
    int layerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Runtime.InteropServices.GCHandle layerIdHandle
    // Size: 0x4
    // Offset: 0x184
    System::Runtime::InteropServices::GCHandle layerIdHandle;
    // Field size check
    static_assert(sizeof(System::Runtime::InteropServices::GCHandle) == 0x4);
    // private System.IntPtr layerIdPtr
    // Size: 0x8
    // Offset: 0x188
    System::IntPtr layerIdPtr;
    // Field size check
    static_assert(sizeof(System::IntPtr) == 0x8);
    // private System.Int32 frameIndex
    // Size: 0x4
    // Offset: 0x190
    int frameIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 prevFrameIndex
    // Size: 0x4
    // Offset: 0x194
    int prevFrameIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Renderer rend
    // Size: 0x8
    // Offset: 0x198
    UnityEngine::Renderer* rend;
    // Field size check
    static_assert(sizeof(UnityEngine::Renderer*) == 0x8);
    // private System.UInt64 OpenVROverlayHandle
    // Size: 0x8
    // Offset: 0x1A0
    uint64_t OpenVROverlayHandle;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private UnityEngine.Vector4 OpenVRUVOffsetAndScale
    // Size: 0x10
    // Offset: 0x1A8
    UnityEngine::Vector4 OpenVRUVOffsetAndScale;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Vector2 OpenVRMouseScale
    // Size: 0x8
    // Offset: 0x1B8
    UnityEngine::Vector2 OpenVRMouseScale;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private OVRManager/XRDevice constructedOverlayXRDevice
    // Size: 0x4
    // Offset: 0x1C0
    GlobalNamespace::OVRManager_XRDevice constructedOverlayXRDevice;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRManager_XRDevice) == 0x4);
    // private System.Boolean xrDeviceConstructed
    // Size: 0x1
    // Offset: 0x1C4
    bool xrDeviceConstructed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: OVROverlay
