// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: OVROverlay/OverlayShape
#include "GlobalNamespace/OVROverlay.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: OVROverlay because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: MeshCollider
  class MeshCollider;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Texture
  class Texture;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD1
  #pragma pack(push, 1)
  // Autogenerated type: OVROverlayMeshGenerator
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: EB2358
  // [RequireComponent] Offset: EB2358
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class OVROverlayMeshGenerator : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::OVROverlayMeshGenerator::CubeFace
    struct CubeFace;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private UnityEngine.Mesh _Mesh
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Mesh* Mesh;
    // Field size check
    static_assert(sizeof(UnityEngine::Mesh*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> _Verts
    // Size: 0x8
    // Offset: 0x20
    System::Collections::Generic::List_1<UnityEngine::Vector3>* Verts;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::Vector3>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Vector2> _UV
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Generic::List_1<UnityEngine::Vector2>* UV;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::Vector2>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> _Tris
    // Size: 0x8
    // Offset: 0x30
    System::Collections::Generic::List_1<int>* Tris;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<int>*) == 0x8);
    // private OVROverlay _Overlay
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::OVROverlay* Overlay;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVROverlay*) == 0x8);
    // private UnityEngine.MeshFilter _MeshFilter
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::MeshFilter* MeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshCollider _MeshCollider
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::MeshCollider* MeshCollider;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshCollider*) == 0x8);
    // private UnityEngine.MeshRenderer _MeshRenderer
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::MeshRenderer* MeshRenderer;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.Transform _CameraRoot
    // Size: 0x8
    // Offset: 0x58
    UnityEngine::Transform* CameraRoot;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _Transform
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::Transform* Transform;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private OVROverlay/OverlayShape _LastShape
    // Size: 0x4
    // Offset: 0x68
    GlobalNamespace::OVROverlay::OverlayShape LastShape;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVROverlay::OverlayShape) == 0x4);
    // private UnityEngine.Vector3 _LastPosition
    // Size: 0xC
    // Offset: 0x6C
    UnityEngine::Vector3 LastPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion _LastRotation
    // Size: 0x10
    // Offset: 0x78
    UnityEngine::Quaternion LastRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 _LastScale
    // Size: 0xC
    // Offset: 0x88
    UnityEngine::Vector3 LastScale;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Rect _LastDestRectLeft
    // Size: 0x10
    // Offset: 0x94
    UnityEngine::Rect LastDestRectLeft;
    // Field size check
    static_assert(sizeof(UnityEngine::Rect) == 0x10);
    // private UnityEngine.Rect _LastDestRectRight
    // Size: 0x10
    // Offset: 0xA4
    UnityEngine::Rect LastDestRectRight;
    // Field size check
    static_assert(sizeof(UnityEngine::Rect) == 0x10);
    // private UnityEngine.Rect _LastSrcRectLeft
    // Size: 0x10
    // Offset: 0xB4
    UnityEngine::Rect LastSrcRectLeft;
    // Field size check
    static_assert(sizeof(UnityEngine::Rect) == 0x10);
    // Padding between fields: LastSrcRectLeft and: LastTexture
    char __padding16[0x4] = {};
    // private UnityEngine.Texture _LastTexture
    // Size: 0x8
    // Offset: 0xC8
    UnityEngine::Texture* LastTexture;
    // Field size check
    static_assert(sizeof(UnityEngine::Texture*) == 0x8);
    // private System.Boolean _Awake
    // Size: 0x1
    // Offset: 0xD0
    bool Awake_;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get static field: static private readonly UnityEngine.Vector3[] BottomLeft
    static ::ArrayW<UnityEngine::Vector3> _get_BottomLeft();
    // Set static field: static private readonly UnityEngine.Vector3[] BottomLeft
    static void _set_BottomLeft(::ArrayW<UnityEngine::Vector3> value);
    // Get static field: static private readonly UnityEngine.Vector3[] RightVector
    static ::ArrayW<UnityEngine::Vector3> _get_RightVector();
    // Set static field: static private readonly UnityEngine.Vector3[] RightVector
    static void _set_RightVector(::ArrayW<UnityEngine::Vector3> value);
    // Get static field: static private readonly UnityEngine.Vector3[] UpVector
    static ::ArrayW<UnityEngine::Vector3> _get_UpVector();
