// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Boolean
#include "System/Boolean.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: Quatf because it is already included!
  // Skipping declaration: Posef because it is already included!
  // Skipping declaration: TrackingConfidence because it is already included!
  // Skipping declaration: HandStatus because it is already included!
  // Skipping declaration: HandFingerPinch because it is already included!
  // Forward declaring type: OVRNativeBuffer
  class OVRNativeBuffer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: IntPtr
  struct IntPtr;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector4
  struct Vector4;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x10
  #pragma pack(push, 1)
  // Autogenerated type: OVRPlugin
  // [] Offset: FFFFFFFF
  class OVRPlugin : public ::Il2CppObject {
    public:
    // Nested type: GlobalNamespace::OVRPlugin::GUID
    class GUID;
    // Nested type: GlobalNamespace::OVRPlugin::Bool
    struct Bool;
    // Nested type: GlobalNamespace::OVRPlugin::Result
    struct Result;
    // Nested type: GlobalNamespace::OVRPlugin::CameraStatus
    struct CameraStatus;
    // Nested type: GlobalNamespace::OVRPlugin::CameraAnchorType
    struct CameraAnchorType;
    // Nested type: GlobalNamespace::OVRPlugin::Eye
    struct Eye;
    // Nested type: GlobalNamespace::OVRPlugin::Tracker
    struct Tracker;
    // Nested type: GlobalNamespace::OVRPlugin::Node
    struct Node;
    // Nested type: GlobalNamespace::OVRPlugin::Controller
    struct Controller;
    // Nested type: GlobalNamespace::OVRPlugin::Handedness
    struct Handedness;
    // Nested type: GlobalNamespace::OVRPlugin::TrackingOrigin
    struct TrackingOrigin;
    // Nested type: GlobalNamespace::OVRPlugin::RecenterFlags
    struct RecenterFlags;
    // Nested type: GlobalNamespace::OVRPlugin::BatteryStatus
    struct BatteryStatus;
    // Nested type: GlobalNamespace::OVRPlugin::EyeTextureFormat
    struct EyeTextureFormat;
    // Nested type: GlobalNamespace::OVRPlugin::PlatformUI
    struct PlatformUI;
    // Nested type: GlobalNamespace::OVRPlugin::SystemRegion
    struct SystemRegion;
    // Nested type: GlobalNamespace::OVRPlugin::SystemHeadset
    struct SystemHeadset;
    // Nested type: GlobalNamespace::OVRPlugin::OverlayShape
    struct OverlayShape;
    // Nested type: GlobalNamespace::OVRPlugin::Step
    struct Step;
    // Nested type: GlobalNamespace::OVRPlugin::CameraDevice
    struct CameraDevice;
    // Nested type: GlobalNamespace::OVRPlugin::CameraDeviceDepthSensingMode
    struct CameraDeviceDepthSensingMode;
    // Nested type: GlobalNamespace::OVRPlugin::CameraDeviceDepthQuality
    struct CameraDeviceDepthQuality;
    // Nested type: GlobalNamespace::OVRPlugin::FixedFoveatedRenderingLevel
    struct FixedFoveatedRenderingLevel;
    // Nested type: GlobalNamespace::OVRPlugin::TiledMultiResLevel
    struct TiledMultiResLevel;
    // Nested type: GlobalNamespace::OVRPlugin::PerfMetrics
    struct PerfMetrics;
    // Nested type: GlobalNamespace::OVRPlugin::CameraDeviceIntrinsicsParameters
    struct CameraDeviceIntrinsicsParameters;
    // Nested type: GlobalNamespace::OVRPlugin::OverlayFlag
    struct OverlayFlag;
    // Nested type: GlobalNamespace::OVRPlugin::Vector2f
    struct Vector2f;
    // Nested type: GlobalNamespace::OVRPlugin::Vector3f
    struct Vector3f;
    // Nested type: GlobalNamespace::OVRPlugin::Vector4f
    struct Vector4f;
    // Nested type: GlobalNamespace::OVRPlugin::Vector4s
    struct Vector4s;
    // Nested type: GlobalNamespace::OVRPlugin::Quatf
    struct Quatf;
    // Nested type: GlobalNamespace::OVRPlugin::Posef
    struct Posef;
    // Nested type: GlobalNamespace::OVRPlugin::TextureRectMatrixf
    struct TextureRectMatrixf;
    // Nested type: GlobalNamespace::OVRPlugin::PoseStatef
    struct PoseStatef;
    // Nested type: GlobalNamespace::OVRPlugin::ControllerState4
    struct ControllerState4;
    // Nested type: GlobalNamespace::OVRPlugin::ControllerState2
    struct ControllerState2;
    // Nested type: GlobalNamespace::OVRPlugin::ControllerState
    struct ControllerState;
    // Nested type: GlobalNamespace::OVRPlugin::HapticsBuffer
    struct HapticsBuffer;
    // Nested type: GlobalNamespace::OVRPlugin::HapticsState
    struct HapticsState;
    // Nested type: GlobalNamespace::OVRPlugin::HapticsDesc
    struct HapticsDesc;
    // Nested type: GlobalNamespace::OVRPlugin::AppPerfFrameStats
    struct AppPerfFrameStats;
    // Nested type: GlobalNamespace::OVRPlugin::AppPerfStats
    struct AppPerfStats;
    // Nested type: GlobalNamespace::OVRPlugin::Sizei
    struct Sizei;
    // Nested type: GlobalNamespace::OVRPlugin::Sizef
    struct Sizef;
    // Nested type: GlobalNamespace::OVRPlugin::Vector2i
    struct Vector2i;
    // Nested type: GlobalNamespace::OVRPlugin::Recti
    struct Recti;
    // Nested type: GlobalNamespace::OVRPlugin::Rectf
    struct Rectf;
    // Nested type: GlobalNamespace::OVRPlugin::Frustumf
    struct Frustumf;
    // Nested type: GlobalNamespace::OVRPlugin::Frustumf2
    struct Frustumf2;
    // Nested type: GlobalNamespace::OVRPlugin::BoundaryType
    struct BoundaryType;
    // Nested type: GlobalNamespace::OVRPlugin::BoundaryTestResult
    struct BoundaryTestResult;
    // Nested type: GlobalNamespace::OVRPlugin::BoundaryGeometry
    struct BoundaryGeometry;
    // Nested type: GlobalNamespace::OVRPlugin::Colorf
    struct Colorf;
    // Nested type: GlobalNamespace::OVRPlugin::Fovf
    struct Fovf;
    // Nested type: GlobalNamespace::OVRPlugin::CameraIntrinsics
    struct CameraIntrinsics;
    // Nested type: GlobalNamespace::OVRPlugin::CameraExtrinsics
    struct CameraExtrinsics;
    // Nested type: GlobalNamespace::OVRPlugin::LayerLayout
    struct LayerLayout;
    // Nested type: GlobalNamespace::OVRPlugin::LayerFlags
    struct LayerFlags;
    // Nested type: GlobalNamespace::OVRPlugin::LayerDesc
    struct LayerDesc;
    // Nested type: GlobalNamespace::OVRPlugin::LayerSubmit
    struct LayerSubmit;
    // Nested type: GlobalNamespace::OVRPlugin::TrackingConfidence
    struct TrackingConfidence;
    // Nested type: GlobalNamespace::OVRPlugin::Hand
    struct Hand;
    // Nested type: GlobalNamespace::OVRPlugin::HandStatus
    struct HandStatus;
    // Nested type: GlobalNamespace::OVRPlugin::BoneId
    struct BoneId;
    // Nested type: GlobalNamespace::OVRPlugin::HandFinger
    struct HandFinger;
    // Nested type: GlobalNamespace::OVRPlugin::HandFingerPinch
    struct HandFingerPinch;
    // Nested type: GlobalNamespace::OVRPlugin::HandState
    struct HandState;
    // Nested type: GlobalNamespace::OVRPlugin::HandStateInternal
    struct HandStateInternal;
    // Nested type: GlobalNamespace::OVRPlugin::BoneCapsule
    struct BoneCapsule;
    // Nested type: GlobalNamespace::OVRPlugin::Bone
    struct Bone;
    // Nested type: GlobalNamespace::OVRPlugin::SkeletonConstants
    struct SkeletonConstants;
    // Nested type: GlobalNamespace::OVRPlugin::SkeletonType
    struct SkeletonType;
    // Nested type: GlobalNamespace::OVRPlugin::Skeleton
    struct Skeleton;
    // Nested type: GlobalNamespace::OVRPlugin::MeshConstants
    struct MeshConstants;
    // Nested type: GlobalNamespace::OVRPlugin::MeshType
    struct MeshType;
    // Nested type: GlobalNamespace::OVRPlugin::Mesh
    class Mesh;
    // Nested type: GlobalNamespace::OVRPlugin::ColorSpace
    struct ColorSpace;
    // Nested type: GlobalNamespace::OVRPlugin::Media
    class Media;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_0_1_0
    class OVRP_0_1_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_0_1_1
    class OVRP_0_1_1;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_0_1_2
    class OVRP_0_1_2;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_0_1_3
    class OVRP_0_1_3;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_0_5_0
    class OVRP_0_5_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_0_0
    class OVRP_1_0_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_1_0
    class OVRP_1_1_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_2_0
    class OVRP_1_2_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_3_0
    class OVRP_1_3_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_5_0
    class OVRP_1_5_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_6_0
    class OVRP_1_6_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_7_0
    class OVRP_1_7_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_8_0
    class OVRP_1_8_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_9_0
    class OVRP_1_9_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_10_0
    class OVRP_1_10_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_11_0
    class OVRP_1_11_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_12_0
    class OVRP_1_12_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_15_0
    class OVRP_1_15_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_16_0
    class OVRP_1_16_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_17_0
    class OVRP_1_17_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_18_0
    class OVRP_1_18_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_19_0
    class OVRP_1_19_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_21_0
    class OVRP_1_21_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_28_0
    class OVRP_1_28_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_29_0
    class OVRP_1_29_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_30_0
    class OVRP_1_30_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_31_0
    class OVRP_1_31_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_32_0
    class OVRP_1_32_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_34_0
    class OVRP_1_34_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_35_0
    class OVRP_1_35_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_36_0
    class OVRP_1_36_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_37_0
    class OVRP_1_37_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_38_0
    class OVRP_1_38_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_39_0
    class OVRP_1_39_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_40_0
    class OVRP_1_40_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_41_0
    class OVRP_1_41_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_42_0
    class OVRP_1_42_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_43_0
    class OVRP_1_43_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_44_0
    class OVRP_1_44_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_45_0
    class OVRP_1_45_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_46_0
    class OVRP_1_46_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_47_0
    class OVRP_1_47_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_48_0
    class OVRP_1_48_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_49_0
    class OVRP_1_49_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_50_0
    class OVRP_1_50_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_51_0
    class OVRP_1_51_0;
    // Nested type: GlobalNamespace::OVRPlugin::OVRP_1_52_0
    class OVRP_1_52_0;
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPlugin/Vector3f
    // [] Offset: FFFFFFFF
    struct Vector3f/*, public System::ValueType*/ {
      public:
      // public System.Single x
      // Size: 0x4
      // Offset: 0x0
      float x;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single y
      // Size: 0x4
      // Offset: 0x4
      float y;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single z
      // Size: 0x4
      // Offset: 0x8
      float z;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // Creating value type constructor for type: Vector3f
      constexpr Vector3f(float x_ = {}, float y_ = {}, float z_ = {}) noexcept : x{x_}, y{y_}, z{z_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get static field: static public readonly OVRPlugin/Vector3f zero
      static GlobalNamespace::OVRPlugin::Vector3f _get_zero();
      // Set static field: static public readonly OVRPlugin/Vector3f zero
      static void _set_zero(GlobalNamespace::OVRPlugin::Vector3f value);
      // static private System.Void .cctor()
      // Offset: 0x1564998
      static void _cctor();
      // public override System.String ToString()
      // Offset: 0xDF2CC8
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::Il2CppString* ToString();
    }; // OVRPlugin/Vector3f
    #pragma pack(pop)
    static check_size<sizeof(OVRPlugin::Vector3f), 8 + sizeof(float)> __GlobalNamespace_OVRPlugin_Vector3fSizeCheck;
    static_assert(sizeof(OVRPlugin::Vector3f) == 0xC);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPlugin/Quatf
    // [] Offset: FFFFFFFF
    struct Quatf/*, public System::ValueType*/ {
      public:
      // public System.Single x
      // Size: 0x4
      // Offset: 0x0
      float x;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single y
      // Size: 0x4
      // Offset: 0x4
      float y;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single z
      // Size: 0x4
      // Offset: 0x8
      float z;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single w
      // Size: 0x4
      // Offset: 0xC
      float w;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // Creating value type constructor for type: Quatf
      constexpr Quatf(float x_ = {}, float y_ = {}, float z_ = {}, float w_ = {}) noexcept : x{x_}, y{y_}, z{z_}, w{w_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get static field: static public readonly OVRPlugin/Quatf identity
      static GlobalNamespace::OVRPlugin::Quatf _get_identity();
      // Set static field: static public readonly OVRPlugin/Quatf identity
      static void _set_identity(GlobalNamespace::OVRPlugin::Quatf value);
      // static private System.Void .cctor()
      // Offset: 0x15644B4
      static void _cctor();
      // public override System.String ToString()
      // Offset: 0xDF2B8C
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::Il2CppString* ToString();
    }; // OVRPlugin/Quatf
    #pragma pack(pop)
    static check_size<sizeof(OVRPlugin::Quatf), 12 + sizeof(float)> __GlobalNamespace_OVRPlugin_QuatfSizeCheck;
    static_assert(sizeof(OVRPlugin::Quatf) == 0x10);
    // Size: 0x1C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPlugin/Posef
    // [] Offset: FFFFFFFF
    struct Posef/*, public System::ValueType*/ {
      public:
      // public OVRPlugin/Quatf Orientation
      // Size: 0x10
      // Offset: 0x0
      GlobalNamespace::OVRPlugin::Quatf Orientation;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Vector3f Position
      // Size: 0xC
      // Offset: 0x10
      GlobalNamespace::OVRPlugin::Vector3f Position;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Vector3f) == 0xC);
      // Creating value type constructor for type: Posef
      constexpr Posef(GlobalNamespace::OVRPlugin::Quatf Orientation_ = {}, GlobalNamespace::OVRPlugin::Vector3f Position_ = {}) noexcept : Orientation{Orientation_}, Position{Position_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Get static field: static public readonly OVRPlugin/Posef identity
      static GlobalNamespace::OVRPlugin::Posef _get_identity();
      // Set static field: static public readonly OVRPlugin/Posef identity
      static void _set_identity(GlobalNamespace::OVRPlugin::Posef value);
      // static private System.Void .cctor()
      // Offset: 0x156420C
      static void _cctor();
      // public override System.String ToString()
      // Offset: 0xDF2B84
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::Il2CppString* ToString();
    }; // OVRPlugin/Posef
    #pragma pack(pop)
    static check_size<sizeof(OVRPlugin::Posef), 16 + sizeof(GlobalNamespace::OVRPlugin::Vector3f)> __GlobalNamespace_OVRPlugin_PosefSizeCheck;
    static_assert(sizeof(OVRPlugin::Posef) == 0x1C);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRPlugin/TrackingConfidence
    // [] Offset: FFFFFFFF
    struct TrackingConfidence/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: TrackingConfidence
      constexpr TrackingConfidence(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRPlugin/TrackingConfidence Low
      static constexpr const int Low = 0;
      // Get static field: static public OVRPlugin/TrackingConfidence Low
      static GlobalNamespace::OVRPlugin::TrackingConfidence _get_Low();
      // Set static field: static public OVRPlugin/TrackingConfidence Low
      static void _set_Low(GlobalNamespace::OVRPlugin::TrackingConfidence value);
      // static field const value: static public OVRPlugin/TrackingConfidence High
      static constexpr const int High = 1065353216;
      // Get static field: static public OVRPlugin/TrackingConfidence High
      static GlobalNamespace::OVRPlugin::TrackingConfidence _get_High();
      // Set static field: static public OVRPlugin/TrackingConfidence High
      static void _set_High(GlobalNamespace::OVRPlugin::TrackingConfidence value);
    }; // OVRPlugin/TrackingConfidence
    #pragma pack(pop)
    static check_size<sizeof(OVRPlugin::TrackingConfidence), 0 + sizeof(int)> __GlobalNamespace_OVRPlugin_TrackingConfidenceSizeCheck;
    static_assert(sizeof(OVRPlugin::TrackingConfidence) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRPlugin/HandStatus
    // [] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct HandStatus/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: HandStatus
      constexpr HandStatus(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRPlugin/HandStatus HandTracked
      static constexpr const int HandTracked = 1;
      // Get static field: static public OVRPlugin/HandStatus HandTracked
      static GlobalNamespace::OVRPlugin::HandStatus _get_HandTracked();
      // Set static field: static public OVRPlugin/HandStatus HandTracked
      static void _set_HandTracked(GlobalNamespace::OVRPlugin::HandStatus value);
      // static field const value: static public OVRPlugin/HandStatus InputStateValid
      static constexpr const int InputStateValid = 2;
      // Get static field: static public OVRPlugin/HandStatus InputStateValid
      static GlobalNamespace::OVRPlugin::HandStatus _get_InputStateValid();
      // Set static field: static public OVRPlugin/HandStatus InputStateValid
      static void _set_InputStateValid(GlobalNamespace::OVRPlugin::HandStatus value);
      // static field const value: static public OVRPlugin/HandStatus SystemGestureInProgress
      static constexpr const int SystemGestureInProgress = 64;
      // Get static field: static public OVRPlugin/HandStatus SystemGestureInProgress
      static GlobalNamespace::OVRPlugin::HandStatus _get_SystemGestureInProgress();
      // Set static field: static public OVRPlugin/HandStatus SystemGestureInProgress
      static void _set_SystemGestureInProgress(GlobalNamespace::OVRPlugin::HandStatus value);
      // static field const value: static public OVRPlugin/HandStatus DominantHand
      static constexpr const int DominantHand = 128;
      // Get static field: static public OVRPlugin/HandStatus DominantHand
      static GlobalNamespace::OVRPlugin::HandStatus _get_DominantHand();
      // Set static field: static public OVRPlugin/HandStatus DominantHand
      static void _set_DominantHand(GlobalNamespace::OVRPlugin::HandStatus value);
      // static field const value: static public OVRPlugin/HandStatus MenuPressed
      static constexpr const int MenuPressed = 256;
      // Get static field: static public OVRPlugin/HandStatus MenuPressed
      static GlobalNamespace::OVRPlugin::HandStatus _get_MenuPressed();
      // Set static field: static public OVRPlugin/HandStatus MenuPressed
      static void _set_MenuPressed(GlobalNamespace::OVRPlugin::HandStatus value);
    }; // OVRPlugin/HandStatus
    #pragma pack(pop)
    static check_size<sizeof(OVRPlugin::HandStatus), 0 + sizeof(int)> __GlobalNamespace_OVRPlugin_HandStatusSizeCheck;
    static_assert(sizeof(OVRPlugin::HandStatus) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRPlugin/HandFingerPinch
    // [] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct HandFingerPinch/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: HandFingerPinch
      constexpr HandFingerPinch(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRPlugin/HandFingerPinch Thumb
      static constexpr const int Thumb = 1;
      // Get static field: static public OVRPlugin/HandFingerPinch Thumb
      static GlobalNamespace::OVRPlugin::HandFingerPinch _get_Thumb();
      // Set static field: static public OVRPlugin/HandFingerPinch Thumb
      static void _set_Thumb(GlobalNamespace::OVRPlugin::HandFingerPinch value);
      // static field const value: static public OVRPlugin/HandFingerPinch Index
      static constexpr const int Index = 2;
      // Get static field: static public OVRPlugin/HandFingerPinch Index
      static GlobalNamespace::OVRPlugin::HandFingerPinch _get_Index();
      // Set static field: static public OVRPlugin/HandFingerPinch Index
      static void _set_Index(GlobalNamespace::OVRPlugin::HandFingerPinch value);
      // static field const value: static public OVRPlugin/HandFingerPinch Middle
      static constexpr const int Middle = 4;
      // Get static field: static public OVRPlugin/HandFingerPinch Middle
      static GlobalNamespace::OVRPlugin::HandFingerPinch _get_Middle();
      // Set static field: static public OVRPlugin/HandFingerPinch Middle
      static void _set_Middle(GlobalNamespace::OVRPlugin::HandFingerPinch value);
      // static field const value: static public OVRPlugin/HandFingerPinch Ring
      static constexpr const int Ring = 8;
      // Get static field: static public OVRPlugin/HandFingerPinch Ring
      static GlobalNamespace::OVRPlugin::HandFingerPinch _get_Ring();
      // Set static field: static public OVRPlugin/HandFingerPinch Ring
      static void _set_Ring(GlobalNamespace::OVRPlugin::HandFingerPinch value);
      // static field const value: static public OVRPlugin/HandFingerPinch Pinky
      static constexpr const int Pinky = 16;
      // Get static field: static public OVRPlugin/HandFingerPinch Pinky
      static GlobalNamespace::OVRPlugin::HandFingerPinch _get_Pinky();
      // Set static field: static public OVRPlugin/HandFingerPinch Pinky
      static void _set_Pinky(GlobalNamespace::OVRPlugin::HandFingerPinch value);
    }; // OVRPlugin/HandFingerPinch
    #pragma pack(pop)
    static check_size<sizeof(OVRPlugin::HandFingerPinch), 0 + sizeof(int)> __GlobalNamespace_OVRPlugin_HandFingerPinchSizeCheck;
    static_assert(sizeof(OVRPlugin::HandFingerPinch) == 0x4);
    // Size: 0x200
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPlugin/HandStateInternal
    // [] Offset: FFFFFFFF
    struct HandStateInternal/*, public System::ValueType*/ {
      public:
      // public OVRPlugin/HandStatus Status
      // Size: 0x4
      // Offset: 0x0
      GlobalNamespace::OVRPlugin::HandStatus Status;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::HandStatus) == 0x4);
      // public OVRPlugin/Posef RootPose
      // Size: 0x1C
      // Offset: 0x4
      GlobalNamespace::OVRPlugin::Posef RootPose;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Posef) == 0x1C);
      // public OVRPlugin/Quatf BoneRotations_0
      // Size: 0x10
      // Offset: 0x20
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_0;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_1
      // Size: 0x10
      // Offset: 0x30
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_1;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_2
      // Size: 0x10
      // Offset: 0x40
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_2;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_3
      // Size: 0x10
      // Offset: 0x50
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_3;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_4
      // Size: 0x10
      // Offset: 0x60
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_4;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_5
      // Size: 0x10
      // Offset: 0x70
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_5;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_6
      // Size: 0x10
      // Offset: 0x80
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_6;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_7
      // Size: 0x10
      // Offset: 0x90
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_7;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_8
      // Size: 0x10
      // Offset: 0xA0
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_8;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_9
      // Size: 0x10
      // Offset: 0xB0
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_9;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_10
      // Size: 0x10
      // Offset: 0xC0
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_10;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_11
      // Size: 0x10
      // Offset: 0xD0
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_11;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_12
      // Size: 0x10
      // Offset: 0xE0
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_12;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_13
      // Size: 0x10
      // Offset: 0xF0
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_13;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_14
      // Size: 0x10
      // Offset: 0x100
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_14;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_15
      // Size: 0x10
      // Offset: 0x110
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_15;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_16
      // Size: 0x10
      // Offset: 0x120
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_16;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_17
      // Size: 0x10
      // Offset: 0x130
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_17;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_18
      // Size: 0x10
      // Offset: 0x140
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_18;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_19
      // Size: 0x10
      // Offset: 0x150
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_19;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_20
      // Size: 0x10
      // Offset: 0x160
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_20;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_21
      // Size: 0x10
      // Offset: 0x170
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_21;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_22
      // Size: 0x10
      // Offset: 0x180
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_22;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/Quatf BoneRotations_23
      // Size: 0x10
      // Offset: 0x190
      GlobalNamespace::OVRPlugin::Quatf BoneRotations_23;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Quatf) == 0x10);
      // public OVRPlugin/HandFingerPinch Pinches
      // Size: 0x4
      // Offset: 0x1A0
      GlobalNamespace::OVRPlugin::HandFingerPinch Pinches;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::HandFingerPinch) == 0x4);
      // public System.Single PinchStrength_0
      // Size: 0x4
      // Offset: 0x1A4
      float PinchStrength_0;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single PinchStrength_1
      // Size: 0x4
      // Offset: 0x1A8
      float PinchStrength_1;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single PinchStrength_2
      // Size: 0x4
      // Offset: 0x1AC
      float PinchStrength_2;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single PinchStrength_3
      // Size: 0x4
      // Offset: 0x1B0
      float PinchStrength_3;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single PinchStrength_4
      // Size: 0x4
      // Offset: 0x1B4
      float PinchStrength_4;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public OVRPlugin/Posef PointerPose
      // Size: 0x1C
      // Offset: 0x1B8
      GlobalNamespace::OVRPlugin::Posef PointerPose;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::Posef) == 0x1C);
      // public System.Single HandScale
      // Size: 0x4
      // Offset: 0x1D4
      float HandScale;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public OVRPlugin/TrackingConfidence HandConfidence
      // Size: 0x4
      // Offset: 0x1D8
      GlobalNamespace::OVRPlugin::TrackingConfidence HandConfidence;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::TrackingConfidence) == 0x4);
      // public OVRPlugin/TrackingConfidence FingerConfidences_0
      // Size: 0x4
      // Offset: 0x1DC
      GlobalNamespace::OVRPlugin::TrackingConfidence FingerConfidences_0;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::TrackingConfidence) == 0x4);
      // public OVRPlugin/TrackingConfidence FingerConfidences_1
      // Size: 0x4
      // Offset: 0x1E0
      GlobalNamespace::OVRPlugin::TrackingConfidence FingerConfidences_1;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::TrackingConfidence) == 0x4);
      // public OVRPlugin/TrackingConfidence FingerConfidences_2
      // Size: 0x4
      // Offset: 0x1E4
      GlobalNamespace::OVRPlugin::TrackingConfidence FingerConfidences_2;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::TrackingConfidence) == 0x4);
      // public OVRPlugin/TrackingConfidence FingerConfidences_3
      // Size: 0x4
      // Offset: 0x1E8
      GlobalNamespace::OVRPlugin::TrackingConfidence FingerConfidences_3;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::TrackingConfidence) == 0x4);
      // public OVRPlugin/TrackingConfidence FingerConfidences_4
      // Size: 0x4
      // Offset: 0x1EC
      GlobalNamespace::OVRPlugin::TrackingConfidence FingerConfidences_4;
      // Field size check
      static_assert(sizeof(GlobalNamespace::OVRPlugin::TrackingConfidence) == 0x4);
      // public System.Double RequestedTimeStamp
      // Size: 0x8
      // Offset: 0x1F0
      double RequestedTimeStamp;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      // public System.Double SampleTimeStamp
      // Size: 0x8
      // Offset: 0x1F8
      double SampleTimeStamp;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      // Creating value type constructor for type: HandStateInternal
