// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: OVRPlugin
#include "GlobalNamespace/OVRPlugin.hpp"
// Including type: OVRPlugin/MeshType
#include "GlobalNamespace/OVRPlugin_MeshType.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: OVRPlugin/Mesh
  class OVRPlugin::Mesh : public ::Il2CppObject {
    public:
    // public OVRPlugin/MeshType Type
    // Offset: 0x10
    GlobalNamespace::OVRPlugin::MeshType Type;
    // public System.UInt32 NumVertices
    // Offset: 0x14
    uint NumVertices;
    // public System.UInt32 NumIndices
    // Offset: 0x18
    uint NumIndices;
    // public OVRPlugin/Vector3f[] VertexPositions
    // Offset: 0x20
    ::Array<GlobalNamespace::OVRPlugin::Vector3f>* VertexPositions;
    // public System.Int16[] Indices
    // Offset: 0x28
    ::Array<int16_t>* Indices;
    // public OVRPlugin/Vector3f[] VertexNormals
    // Offset: 0x30
    ::Array<GlobalNamespace::OVRPlugin::Vector3f>* VertexNormals;
    // public OVRPlugin/Vector2f[] VertexUV0
    // Offset: 0x38
    ::Array<GlobalNamespace::OVRPlugin::Vector2f>* VertexUV0;
    // public OVRPlugin/Vector4s[] BlendIndices
    // Offset: 0x40
    ::Array<GlobalNamespace::OVRPlugin::Vector4s>* BlendIndices;
    // public OVRPlugin/Vector4f[] BlendWeights
    // Offset: 0x48
    ::Array<GlobalNamespace::OVRPlugin::Vector4f>* BlendWeights;
    // public System.Void .ctor()
    // Offset: 0xEEB7A8
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static OVRPlugin::Mesh* New_ctor();
  }; // OVRPlugin/Mesh
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRPlugin::Mesh*, "", "OVRPlugin/Mesh");
#pragma pack(pop)
