// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: OVRPlugin
#include "GlobalNamespace/OVRPlugin.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x38
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVRPlugin/AppPerfFrameStats
  // [TokenAttribute] Offset: FFFFFFFF
  struct OVRPlugin::AppPerfFrameStats/*, public System::ValueType*/ {
    public:
    // public System.Int32 HmdVsyncIndex
    // Size: 0x4
    // Offset: 0x0
    int HmdVsyncIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 AppFrameIndex
    // Size: 0x4
    // Offset: 0x4
    int AppFrameIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 AppDroppedFrameCount
    // Size: 0x4
    // Offset: 0x8
    int AppDroppedFrameCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single AppMotionToPhotonLatency
    // Size: 0x4
    // Offset: 0xC
    float AppMotionToPhotonLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single AppQueueAheadTime
    // Size: 0x4
    // Offset: 0x10
    float AppQueueAheadTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single AppCpuElapsedTime
    // Size: 0x4
    // Offset: 0x14
    float AppCpuElapsedTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single AppGpuElapsedTime
    // Size: 0x4
    // Offset: 0x18
    float AppGpuElapsedTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 CompositorFrameIndex
    // Size: 0x4
    // Offset: 0x1C
    int CompositorFrameIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 CompositorDroppedFrameCount
    // Size: 0x4
    // Offset: 0x20
    int CompositorDroppedFrameCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single CompositorLatency
    // Size: 0x4
    // Offset: 0x24
    float CompositorLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single CompositorCpuElapsedTime
    // Size: 0x4
    // Offset: 0x28
    float CompositorCpuElapsedTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single CompositorGpuElapsedTime
    // Size: 0x4
    // Offset: 0x2C
    float CompositorGpuElapsedTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single CompositorCpuStartToGpuEndElapsedTime
    // Size: 0x4
    // Offset: 0x30
    float CompositorCpuStartToGpuEndElapsedTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single CompositorGpuEndToVsyncElapsedTime
    // Size: 0x4
    // Offset: 0x34
    float CompositorGpuEndToVsyncElapsedTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: AppPerfFrameStats
    constexpr AppPerfFrameStats(int HmdVsyncIndex_ = {}, int AppFrameIndex_ = {}, int AppDroppedFrameCount_ = {}, float AppMotionToPhotonLatency_ = {}, float AppQueueAheadTime_ = {}, float AppCpuElapsedTime_ = {}, float AppGpuElapsedTime_ = {}, int CompositorFrameIndex_ = {}, int CompositorDroppedFrameCount_ = {}, float CompositorLatency_ = {}, float CompositorCpuElapsedTime_ = {}, float CompositorGpuElapsedTime_ = {}, float CompositorCpuStartToGpuEndElapsedTime_ = {}, float CompositorGpuEndToVsyncElapsedTime_ = {}) noexcept : HmdVsyncIndex{HmdVsyncIndex_}, AppFrameIndex{AppFrameIndex_}, AppDroppedFrameCount{AppDroppedFrameCount_}, AppMotionToPhotonLatency{AppMotionToPhotonLatency_}, AppQueueAheadTime{AppQueueAheadTime_}, AppCpuElapsedTime{AppCpuElapsedTime_}, AppGpuElapsedTime{AppGpuElapsedTime_}, CompositorFrameIndex{CompositorFrameIndex_}, CompositorDroppedFrameCount{CompositorDroppedFrameCount_}, CompositorLatency{CompositorLatency_}, CompositorCpuElapsedTime{CompositorCpuElapsedTime_}, CompositorGpuElapsedTime{CompositorGpuElapsedTime_}, CompositorCpuStartToGpuEndElapsedTime{CompositorCpuStartToGpuEndElapsedTime_}, CompositorGpuEndToVsyncElapsedTime{CompositorGpuEndToVsyncElapsedTime_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public System.Int32 HmdVsyncIndex
    int _get_HmdVsyncIndex();
    // Set instance field: public System.Int32 HmdVsyncIndex
    void _set_HmdVsyncIndex(int value);
    // Get instance field: public System.Int32 AppFrameIndex
    int _get_AppFrameIndex();
    // Set instance field: public System.Int32 AppFrameIndex
    void _set_AppFrameIndex(int value);
    // Get instance field: public System.Int32 AppDroppedFrameCount
    int _get_AppDroppedFrameCount();
    // Set instance field: public System.Int32 AppDroppedFrameCount
    void _set_AppDroppedFrameCount(int value);
    // Get instance field: public System.Single AppMotionToPhotonLatency
    float _get_AppMotionToPhotonLatency();
    // Set instance field: public System.Single AppMotionToPhotonLatency
    void _set_AppMotionToPhotonLatency(float value);
    // Get instance field: public System.Single AppQueueAheadTime
    float _get_AppQueueAheadTime();
    // Set instance field: public System.Single AppQueueAheadTime
    void _set_AppQueueAheadTime(float value);
    // Get instance field: public System.Single AppCpuElapsedTime
    float _get_AppCpuElapsedTime();
    // Set instance field: public System.Single AppCpuElapsedTime
    void _set_AppCpuElapsedTime(float value);
    // Get instance field: public System.Single AppGpuElapsedTime
    float _get_AppGpuElapsedTime();
    // Set instance field: public System.Single AppGpuElapsedTime
    void _set_AppGpuElapsedTime(float value);
    // Get instance field: public System.Int32 CompositorFrameIndex
    int _get_CompositorFrameIndex();
    // Set instance field: public System.Int32 CompositorFrameIndex
    void _set_CompositorFrameIndex(int value);
    // Get instance field: public System.Int32 CompositorDroppedFrameCount
    int _get_CompositorDroppedFrameCount();
    // Set instance field: public System.Int32 CompositorDroppedFrameCount
    void _set_CompositorDroppedFrameCount(int value);
    // Get instance field: public System.Single CompositorLatency
    float _get_CompositorLatency();
    // Set instance field: public System.Single CompositorLatency
    void _set_CompositorLatency(float value);
    // Get instance field: public System.Single CompositorCpuElapsedTime
    float _get_CompositorCpuElapsedTime();
    // Set instance field: public System.Single CompositorCpuElapsedTime
    void _set_CompositorCpuElapsedTime(float value);
    // Get instance field: public System.Single CompositorGpuElapsedTime
    float _get_CompositorGpuElapsedTime();
    // Set instance field: public System.Single CompositorGpuElapsedTime
    void _set_CompositorGpuElapsedTime(float value);
    // Get instance field: public System.Single CompositorCpuStartToGpuEndElapsedTime
    float _get_CompositorCpuStartToGpuEndElapsedTime();
    // Set instance field: public System.Single CompositorCpuStartToGpuEndElapsedTime
    void _set_CompositorCpuStartToGpuEndElapsedTime(float value);
    // Get instance field: public System.Single CompositorGpuEndToVsyncElapsedTime
    float _get_CompositorGpuEndToVsyncElapsedTime();
    // Set instance field: public System.Single CompositorGpuEndToVsyncElapsedTime
    void _set_CompositorGpuEndToVsyncElapsedTime(float value);
  }; // OVRPlugin/AppPerfFrameStats
  #pragma pack(pop)
  static check_size<sizeof(OVRPlugin::AppPerfFrameStats), 52 + sizeof(float)> __GlobalNamespace_OVRPlugin_AppPerfFrameStatsSizeCheck;
  static_assert(sizeof(OVRPlugin::AppPerfFrameStats) == 0x38);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRPlugin::AppPerfFrameStats, "", "OVRPlugin/AppPerfFrameStats");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
