// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: OVRPlugin
#include "GlobalNamespace/OVRPlugin.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: OVRPlugin/GUID
  class OVRPlugin::GUID : public ::Il2CppObject {
    public:
    // public System.Int32 a
    // Offset: 0x10
    int a;
    // public System.Int16 b
    // Offset: 0x14
    int16_t b;
    // public System.Int16 c
    // Offset: 0x16
    int16_t c;
    // public System.Byte d0
    // Offset: 0x18
    uint8_t d0;
    // public System.Byte d1
    // Offset: 0x19
    uint8_t d1;
    // public System.Byte d2
    // Offset: 0x1A
    uint8_t d2;
    // public System.Byte d3
    // Offset: 0x1B
    uint8_t d3;
    // public System.Byte d4
    // Offset: 0x1C
    uint8_t d4;
    // public System.Byte d5
    // Offset: 0x1D
    uint8_t d5;
    // public System.Byte d6
    // Offset: 0x1E
    uint8_t d6;
    // public System.Byte d7
    // Offset: 0x1F
    uint8_t d7;
    // public System.Void .ctor()
    // Offset: 0xEFBF84
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static OVRPlugin::GUID* New_ctor();
  }; // OVRPlugin/GUID
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRPlugin::GUID*, "", "OVRPlugin/GUID");
#pragma pack(pop)
