// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x59
  #pragma pack(push, 1)
  // Autogenerated type: OVRScreenFade
  class OVRScreenFade : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::OVRScreenFade::$Fade$d__25
    class $Fade$d__25;
    // [TooltipAttribute] Offset: 0xDD00D0
    // public System.Single fadeTime
    // Size: 0x4
    // Offset: 0x18
    float fadeTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDD0108
    // public UnityEngine.Color fadeColor
    // Size: 0x10
    // Offset: 0x1C
    UnityEngine::Color fadeColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // public System.Boolean fadeOnStart
    // Size: 0x1
    // Offset: 0x2C
    bool fadeOnStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fadeOnStart and: renderQueue
    char __padding2[0x3] = {};
    // public System.Int32 renderQueue
    // Size: 0x4
    // Offset: 0x30
    int renderQueue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single explicitFadeAlpha
    // Size: 0x4
    // Offset: 0x34
    float explicitFadeAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single animatedFadeAlpha
    // Size: 0x4
    // Offset: 0x38
    float animatedFadeAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single uiFadeAlpha
    // Size: 0x4
    // Offset: 0x3C
    float uiFadeAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.MeshRenderer fadeRenderer
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::MeshRenderer* fadeRenderer;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.MeshFilter fadeMesh
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::MeshFilter* fadeMesh;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.Material fadeMaterial
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::Material* fadeMaterial;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // private System.Boolean isFading
    // Size: 0x1
    // Offset: 0x58
    bool isFading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: OVRScreenFade
    OVRScreenFade(float fadeTime_ = {}, UnityEngine::Color fadeColor_ = {}, bool fadeOnStart_ = {}, int renderQueue_ = {}, float explicitFadeAlpha_ = {}, float animatedFadeAlpha_ = {}, float uiFadeAlpha_ = {}, UnityEngine::MeshRenderer* fadeRenderer_ = {}, UnityEngine::MeshFilter* fadeMesh_ = {}, UnityEngine::Material* fadeMaterial_ = {}, bool isFading_ = {}) noexcept : fadeTime{fadeTime_}, fadeColor{fadeColor_}, fadeOnStart{fadeOnStart_}, renderQueue{renderQueue_}, explicitFadeAlpha{explicitFadeAlpha_}, animatedFadeAlpha{animatedFadeAlpha_}, uiFadeAlpha{uiFadeAlpha_}, fadeRenderer{fadeRenderer_}, fadeMesh{fadeMesh_}, fadeMaterial{fadeMaterial_}, isFading{isFading_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // [CompilerGeneratedAttribute] Offset: 0xDD00C0
    // Get static field: static private OVRScreenFade <instance>k__BackingField
    static GlobalNamespace::OVRScreenFade* _get_$instance$k__BackingField();
    // Set static field: static private OVRScreenFade <instance>k__BackingField
    static void _set_$instance$k__BackingField(GlobalNamespace::OVRScreenFade* value);
    // static public OVRScreenFade get_instance()
    // Offset: 0x162A6AC
    static GlobalNamespace::OVRScreenFade* get_instance();
    // static private System.Void set_instance(OVRScreenFade value)
    // Offset: 0x162A6FC
    static void set_instance(GlobalNamespace::OVRScreenFade* value);
    // public System.Single get_currentAlpha()
    // Offset: 0x162A750
    float get_currentAlpha();
    // private System.Void Start()
    // Offset: 0x162A814
    void Start();
    // public System.Void FadeIn()
    // Offset: 0x162AD50
    void FadeIn();
    // public System.Void FadeOut()
    // Offset: 0x162AE08
    void FadeOut();
    // private System.Void OnLevelFinishedLoading(System.Int32 level)
    // Offset: 0x162AE3C
    void OnLevelFinishedLoading(int level);
    // private System.Void OnEnable()
    // Offset: 0x162AE70
    void OnEnable();
    // private System.Void OnDestroy()
    // Offset: 0x162AE88
    void OnDestroy();
    // public System.Void SetUIFade(System.Single level)
    // Offset: 0x162B024
    void SetUIFade(float level);
    // public System.Void SetExplicitFade(System.Single level)
    // Offset: 0x162B1BC
    void SetExplicitFade(float level);
    // private System.Collections.IEnumerator Fade(System.Single startAlpha, System.Single endAlpha)
    // Offset: 0x162AD84
    System::Collections::IEnumerator* Fade(float startAlpha, float endAlpha);
    // private System.Void SetMaterialAlpha()
    // Offset: 0x162B0A4
    void SetMaterialAlpha();
    // public System.Void .ctor()
    // Offset: 0x162B1F0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OVRScreenFade* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::OVRScreenFade::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OVRScreenFade*, creationType>()));
    }
  }; // OVRScreenFade
  #pragma pack(pop)
  static check_size<sizeof(OVRScreenFade), 88 + sizeof(bool)> __GlobalNamespace_OVRScreenFadeSizeCheck;
  static_assert(sizeof(OVRScreenFade) == 0x59);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::OVRScreenFade*, "", "OVRScreenFade");
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::get_instance
// Il2CppName: get_instance
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::set_instance
// Il2CppName: set_instance
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::get_currentAlpha
// Il2CppName: get_currentAlpha
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::Start
// Il2CppName: Start
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::FadeIn
// Il2CppName: FadeIn
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::FadeOut
// Il2CppName: FadeOut
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::OnLevelFinishedLoading
// Il2CppName: OnLevelFinishedLoading
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::OnEnable
// Il2CppName: OnEnable
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::OnDestroy
// Il2CppName: OnDestroy
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::SetUIFade
// Il2CppName: SetUIFade
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::SetExplicitFade
// Il2CppName: SetExplicitFade
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::Fade
// Il2CppName: Fade
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::SetMaterialAlpha
// Il2CppName: SetMaterialAlpha
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: GlobalNamespace::OVRScreenFade::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
