// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Camera
#include "UnityEngine/Camera.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xBA
  #pragma pack(push, 1)
  // Autogenerated type: OVRVignette
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: DBA250
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class OVRVignette : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::OVRVignette::MeshComplexityLevel
    struct MeshComplexityLevel;
    // Nested type: GlobalNamespace::OVRVignette::FalloffType
    struct FalloffType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRVignette/MeshComplexityLevel
    // [TokenAttribute] Offset: FFFFFFFF
    struct MeshComplexityLevel/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: MeshComplexityLevel
      constexpr MeshComplexityLevel(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRVignette/MeshComplexityLevel VerySimple
      static constexpr const int VerySimple = 0;
      // Get static field: static public OVRVignette/MeshComplexityLevel VerySimple
      static GlobalNamespace::OVRVignette::MeshComplexityLevel _get_VerySimple();
      // Set static field: static public OVRVignette/MeshComplexityLevel VerySimple
      static void _set_VerySimple(GlobalNamespace::OVRVignette::MeshComplexityLevel value);
      // static field const value: static public OVRVignette/MeshComplexityLevel Simple
      static constexpr const int Simple = 1;
      // Get static field: static public OVRVignette/MeshComplexityLevel Simple
      static GlobalNamespace::OVRVignette::MeshComplexityLevel _get_Simple();
      // Set static field: static public OVRVignette/MeshComplexityLevel Simple
      static void _set_Simple(GlobalNamespace::OVRVignette::MeshComplexityLevel value);
      // static field const value: static public OVRVignette/MeshComplexityLevel Normal
      static constexpr const int Normal = 2;
      // Get static field: static public OVRVignette/MeshComplexityLevel Normal
      static GlobalNamespace::OVRVignette::MeshComplexityLevel _get_Normal();
      // Set static field: static public OVRVignette/MeshComplexityLevel Normal
      static void _set_Normal(GlobalNamespace::OVRVignette::MeshComplexityLevel value);
      // static field const value: static public OVRVignette/MeshComplexityLevel Detailed
      static constexpr const int Detailed = 3;
      // Get static field: static public OVRVignette/MeshComplexityLevel Detailed
      static GlobalNamespace::OVRVignette::MeshComplexityLevel _get_Detailed();
      // Set static field: static public OVRVignette/MeshComplexityLevel Detailed
      static void _set_Detailed(GlobalNamespace::OVRVignette::MeshComplexityLevel value);
      // static field const value: static public OVRVignette/MeshComplexityLevel VeryDetailed
      static constexpr const int VeryDetailed = 4;
      // Get static field: static public OVRVignette/MeshComplexityLevel VeryDetailed
      static GlobalNamespace::OVRVignette::MeshComplexityLevel _get_VeryDetailed();
      // Set static field: static public OVRVignette/MeshComplexityLevel VeryDetailed
      static void _set_VeryDetailed(GlobalNamespace::OVRVignette::MeshComplexityLevel value);
      // Get instance field: public System.Int32 value__
      int _get_value__();
      // Set instance field: public System.Int32 value__
      void _set_value__(int value);
    }; // OVRVignette/MeshComplexityLevel
    #pragma pack(pop)
    static check_size<sizeof(OVRVignette::MeshComplexityLevel), 0 + sizeof(int)> __GlobalNamespace_OVRVignette_MeshComplexityLevelSizeCheck;
    static_assert(sizeof(OVRVignette::MeshComplexityLevel) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRVignette/FalloffType
    // [TokenAttribute] Offset: FFFFFFFF
    struct FalloffType/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: FalloffType
      constexpr FalloffType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRVignette/FalloffType Linear
      static constexpr const int Linear = 0;
      // Get static field: static public OVRVignette/FalloffType Linear
      static GlobalNamespace::OVRVignette::FalloffType _get_Linear();
      // Set static field: static public OVRVignette/FalloffType Linear
      static void _set_Linear(GlobalNamespace::OVRVignette::FalloffType value);
      // static field const value: static public OVRVignette/FalloffType Quadratic
      static constexpr const int Quadratic = 1;
      // Get static field: static public OVRVignette/FalloffType Quadratic
      static GlobalNamespace::OVRVignette::FalloffType _get_Quadratic();
      // Set static field: static public OVRVignette/FalloffType Quadratic
      static void _set_Quadratic(GlobalNamespace::OVRVignette::FalloffType value);
      // Get instance field: public System.Int32 value__
      int _get_value__();
      // Set instance field: public System.Int32 value__
      void _set_value__(int value);
    }; // OVRVignette/FalloffType
    #pragma pack(pop)
    static check_size<sizeof(OVRVignette::FalloffType), 0 + sizeof(int)> __GlobalNamespace_OVRVignette_FalloffTypeSizeCheck;
    static_assert(sizeof(OVRVignette::FalloffType) == 0x4);
    // private UnityEngine.Shader VignetteShader
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Shader* VignetteShader;
    // Field size check
    static_assert(sizeof(UnityEngine::Shader*) == 0x8);
    // [TooltipAttribute] Offset: 0xDBD868
    // private OVRVignette/MeshComplexityLevel MeshComplexity
    // Size: 0x4
    // Offset: 0x20
    GlobalNamespace::OVRVignette::MeshComplexityLevel MeshComplexity;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRVignette::MeshComplexityLevel) == 0x4);
    // [TooltipAttribute] Offset: 0xDBD8B4
    // private OVRVignette/FalloffType Falloff
    // Size: 0x4
    // Offset: 0x24
    GlobalNamespace::OVRVignette::FalloffType Falloff;
    // Field size check
    static_assert(sizeof(GlobalNamespace::OVRVignette::FalloffType) == 0x4);
    // [TooltipAttribute] Offset: 0xDBD900
    // public System.Single VignetteFieldOfView
    // Size: 0x4
    // Offset: 0x28
    float VignetteFieldOfView;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDBD938
    // public System.Single VignetteAspectRatio
    // Size: 0x4
    // Offset: 0x2C
    float VignetteAspectRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDBD970
    // public System.Single VignetteFalloffDegrees
    // Size: 0x4
    // Offset: 0x30
    float VignetteFalloffDegrees;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [ColorUsageAttribute] Offset: 0xDBD9A8
    // [TooltipAttribute] Offset: 0xDBD9A8
    // public UnityEngine.Color VignetteColor
    // Size: 0x10
    // Offset: 0x34
    UnityEngine::Color VignetteColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // Padding between fields: VignetteColor and: Camera
    char __padding6[0x4] = {};
    // private UnityEngine.Camera _Camera
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::Camera* Camera;
    // Field size check
    static_assert(sizeof(UnityEngine::Camera*) == 0x8);
    // private UnityEngine.MeshFilter _OpaqueMeshFilter
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::MeshFilter* OpaqueMeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshFilter _TransparentMeshFilter
    // Size: 0x8
    // Offset: 0x58
    UnityEngine::MeshFilter* TransparentMeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshRenderer _OpaqueMeshRenderer
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::MeshRenderer* OpaqueMeshRenderer;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.MeshRenderer _TransparentMeshRenderer
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::MeshRenderer* TransparentMeshRenderer;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.Mesh _OpaqueMesh
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::Mesh* OpaqueMesh;
    // Field size check
    static_assert(sizeof(UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Mesh _TransparentMesh
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::Mesh* TransparentMesh;
    // Field size check
    static_assert(sizeof(UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Material _OpaqueMaterial
    // Size: 0x8
    // Offset: 0x80
    UnityEngine::Material* OpaqueMaterial;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _TransparentMaterial
    // Size: 0x8
    // Offset: 0x88
    UnityEngine::Material* TransparentMaterial;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // private System.Int32 _ShaderScaleAndOffset0Property
    // Size: 0x4
    // Offset: 0x90
    int ShaderScaleAndOffset0Property;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _ShaderScaleAndOffset1Property
    // Size: 0x4
    // Offset: 0x94
    int ShaderScaleAndOffset1Property;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector4[] _TransparentScaleAndOffset0
    // Size: 0x8
    // Offset: 0x98
    ::Array<UnityEngine::Vector4>* TransparentScaleAndOffset0;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector4>*) == 0x8);
    // private UnityEngine.Vector4[] _TransparentScaleAndOffset1
    // Size: 0x8
    // Offset: 0xA0
    ::Array<UnityEngine::Vector4>* TransparentScaleAndOffset1;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector4>*) == 0x8);
    // private UnityEngine.Vector4[] _OpaqueScaleAndOffset0
    // Size: 0x8
    // Offset: 0xA8
    ::Array<UnityEngine::Vector4>* OpaqueScaleAndOffset0;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector4>*) == 0x8);
    // private UnityEngine.Vector4[] _OpaqueScaleAndOffset1
    // Size: 0x8
    // Offset: 0xB0
    ::Array<UnityEngine::Vector4>* OpaqueScaleAndOffset1;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector4>*) == 0x8);
    // private System.Boolean _OpaqueVignetteVisible
    // Size: 0x1
    // Offset: 0xB8
    bool OpaqueVignetteVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _TransparentVignetteVisible
    // Size: 0x1
    // Offset: 0xB9
    bool TransparentVignetteVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: OVRVignette
