// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PacketEncryptionLayer
#include "GlobalNamespace/PacketEncryptionLayer.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: PacketEncryptionLayer/EncryptionStatistics
  class PacketEncryptionLayer::EncryptionStatistics : public ::Il2CppObject {
    public:
    // private System.Int64 _packetsReceivedPlaintext
    // Offset: 0x10
    int64_t packetsReceivedPlaintext;
    // private System.Int64 _packetsReceivedEncrypted
    // Offset: 0x18
    int64_t packetsReceivedEncrypted;
    // private System.Int64 _packetsReceivedRejected
    // Offset: 0x20
    int64_t packetsReceivedRejected;
    // private System.Int64 _packetsSentPlaintext
    // Offset: 0x28
    int64_t packetsSentPlaintext;
    // private System.Int64 _packetsSentEncrypted
    // Offset: 0x30
    int64_t packetsSentEncrypted;
    // private System.Int64 _packetsSentRejected
    // Offset: 0x38
    int64_t packetsSentRejected;
    // private System.Int64 _encryptionProcessingTime
    // Offset: 0x40
    int64_t encryptionProcessingTime;
    // private System.Int64 _decryptionProcessingTime
    // Offset: 0x48
    int64_t decryptionProcessingTime;
    // public System.Int64 get_packetsReceivedPlaintext()
    // Offset: 0x1E50C64
    int64_t get_packetsReceivedPlaintext();
    // public System.Int64 get_packetsReceivedEncrypted()
    // Offset: 0x1E50C70
    int64_t get_packetsReceivedEncrypted();
    // public System.Int64 get_packetsReceivedRejected()
    // Offset: 0x1E50C7C
    int64_t get_packetsReceivedRejected();
    // public System.Int64 get_packetsSentPlaintext()
    // Offset: 0x1E50C88
    int64_t get_packetsSentPlaintext();
    // public System.Int64 get_packetsSentEncrypted()
    // Offset: 0x1E50C94
    int64_t get_packetsSentEncrypted();
    // public System.Int64 get_packetsSentRejected()
    // Offset: 0x1E50CA0
    int64_t get_packetsSentRejected();
    // public System.Int64 get_encryptionProcessingTime()
    // Offset: 0x1E50CAC
    int64_t get_encryptionProcessingTime();
    // public System.Int64 get_decryptionProcessingTime()
    // Offset: 0x1E50D38
    int64_t get_decryptionProcessingTime();
    // public System.Void IncrementPacketsReceivedPlaintext()
    // Offset: 0x1E4D008
    void IncrementPacketsReceivedPlaintext();
    // public System.Void IncrementPacketsReceivedEncrypted()
    // Offset: 0x1E4CFF0
    void IncrementPacketsReceivedEncrypted();
    // public System.Void IncrementPacketsReceivedRejected()
    // Offset: 0x1E4D014
    void IncrementPacketsReceivedRejected();
    // public System.Void IncrementPacketsSentPlaintext()
    // Offset: 0x1E4D99C
    void IncrementPacketsSentPlaintext();
    // public System.Void IncrementPacketsSentEncrypted()
    // Offset: 0x1E4D984
    void IncrementPacketsSentEncrypted();
    // public System.Void IncrementPacketsSentRejected()
    // Offset: 0x1E4D9A8
    void IncrementPacketsSentRejected();
    // public System.Void AddEncryptionProcessingTime(System.Int64 time)
    // Offset: 0x1E4D990
    void AddEncryptionProcessingTime(int64_t time);
    // public System.Void AddDecryptionProcessingTime(System.Int64 time)
    // Offset: 0x1E4CFFC
    void AddDecryptionProcessingTime(int64_t time);
    // public System.Void .ctor()
    // Offset: 0x1E4CB38
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static PacketEncryptionLayer::EncryptionStatistics* New_ctor();
  }; // PacketEncryptionLayer/EncryptionStatistics
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PacketEncryptionLayer::EncryptionStatistics*, "", "PacketEncryptionLayer/EncryptionStatistics");
#pragma pack(pop)
