// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PlayerAllOverallStatsData
#include "GlobalNamespace/PlayerAllOverallStatsData.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LevelCompletionResults
  class LevelCompletionResults;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: PlayerAllOverallStatsData/PlayerOverallStatsData
  class PlayerAllOverallStatsData::PlayerOverallStatsData : public ::Il2CppObject {
    public:
    // private System.Int32 <goodCutsCount>k__BackingField
    // Offset: 0x10
    int goodCutsCount;
    // private System.Int32 <badCutsCount>k__BackingField
    // Offset: 0x14
    int badCutsCount;
    // private System.Int32 <missedCutsCount>k__BackingField
    // Offset: 0x18
    int missedCutsCount;
    // private System.Int64 <totalScore>k__BackingField
    // Offset: 0x20
    int64_t totalScore;
    // private System.Int32 <playedLevelsCount>k__BackingField
    // Offset: 0x28
    int playedLevelsCount;
    // private System.Int32 <cleardLevelsCount>k__BackingField
    // Offset: 0x2C
    int cleardLevelsCount;
    // private System.Int32 <failedLevelsCount>k__BackingField
    // Offset: 0x30
    int failedLevelsCount;
    // private System.Int32 <fullComboCount>k__BackingField
    // Offset: 0x34
    int fullComboCount;
    // private System.Single <timePlayed>k__BackingField
    // Offset: 0x38
    float timePlayed;
    // private System.Int32 <handDistanceTravelled>k__BackingField
    // Offset: 0x3C
    int handDistanceTravelled;
    // private System.Int64 <cummulativeCutScoreWithoutMultiplier>k__BackingField
    // Offset: 0x40
    int64_t cummulativeCutScoreWithoutMultiplier;
    // public System.Int32 get_goodCutsCount()
    // Offset: 0xBDA084
    int get_goodCutsCount();
    // private System.Void set_goodCutsCount(System.Int32 value)
    // Offset: 0xBDA08C
    void set_goodCutsCount(int value);
    // public System.Int32 get_badCutsCount()
    // Offset: 0xBDA094
    int get_badCutsCount();
    // private System.Void set_badCutsCount(System.Int32 value)
    // Offset: 0xBDA09C
    void set_badCutsCount(int value);
    // public System.Int32 get_missedCutsCount()
    // Offset: 0xBDA0A4
    int get_missedCutsCount();
    // private System.Void set_missedCutsCount(System.Int32 value)
    // Offset: 0xBDA0AC
    void set_missedCutsCount(int value);
    // public System.Int64 get_totalScore()
    // Offset: 0xBDA0B4
    int64_t get_totalScore();
    // private System.Void set_totalScore(System.Int64 value)
    // Offset: 0xBDA0BC
    void set_totalScore(int64_t value);
    // public System.Int32 get_playedLevelsCount()
    // Offset: 0xBDA0C4
    int get_playedLevelsCount();
    // private System.Void set_playedLevelsCount(System.Int32 value)
    // Offset: 0xBDA0CC
    void set_playedLevelsCount(int value);
    // public System.Int32 get_cleardLevelsCount()
    // Offset: 0xBDA0D4
    int get_cleardLevelsCount();
    // private System.Void set_cleardLevelsCount(System.Int32 value)
    // Offset: 0xBDA0DC
    void set_cleardLevelsCount(int value);
    // public System.Int32 get_failedLevelsCount()
    // Offset: 0xBDA0E4
    int get_failedLevelsCount();
    // private System.Void set_failedLevelsCount(System.Int32 value)
    // Offset: 0xBDA0EC
    void set_failedLevelsCount(int value);
    // public System.Int32 get_fullComboCount()
    // Offset: 0xBDA0F4
    int get_fullComboCount();
    // private System.Void set_fullComboCount(System.Int32 value)
    // Offset: 0xBDA0FC
    void set_fullComboCount(int value);
    // public System.Single get_timePlayed()
    // Offset: 0xBDA104
    float get_timePlayed();
    // private System.Void set_timePlayed(System.Single value)
    // Offset: 0xBDA10C
    void set_timePlayed(float value);
    // public System.Int32 get_handDistanceTravelled()
    // Offset: 0xBDA114
    int get_handDistanceTravelled();
    // private System.Void set_handDistanceTravelled(System.Int32 value)
    // Offset: 0xBDA11C
    void set_handDistanceTravelled(int value);
    // public System.Int64 get_cummulativeCutScoreWithoutMultiplier()
    // Offset: 0xBDA124
    int64_t get_cummulativeCutScoreWithoutMultiplier();
    // private System.Void set_cummulativeCutScoreWithoutMultiplier(System.Int64 value)
    // Offset: 0xBDA12C
    void set_cummulativeCutScoreWithoutMultiplier(int64_t value);
    // public System.Int32 get_averageCutScore()
    // Offset: 0xBDA134
    int get_averageCutScore();
    // public System.Void .ctor(System.Int32 goodCutsCount, System.Int32 badCutsCount, System.Int32 missedCutsCount, System.Int64 totalScore, System.Int32 playedLevelsCount, System.Int32 cleardLevelsCount, System.Int32 failedLevelsCount, System.Int32 fullComboCount, System.Single timePlayed, System.Int32 handDistanceTravelled, System.Int64 cummulativeCutScoreWithoutMultiplier)
    // Offset: 0xBDA154
    static PlayerAllOverallStatsData::PlayerOverallStatsData* New_ctor(int goodCutsCount, int badCutsCount, int missedCutsCount, int64_t totalScore, int playedLevelsCount, int cleardLevelsCount, int failedLevelsCount, int fullComboCount, float timePlayed, int handDistanceTravelled, int64_t cummulativeCutScoreWithoutMultiplier);
    // public System.Void UpdateWithLevelCompletionResults(LevelCompletionResults levelCompletionResults)
    // Offset: 0xBD9EE0
    void UpdateWithLevelCompletionResults(GlobalNamespace::LevelCompletionResults* levelCompletionResults);
    // public System.Void .ctor()
    // Offset: 0xBD9DE4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static PlayerAllOverallStatsData::PlayerOverallStatsData* New_ctor();
  }; // PlayerAllOverallStatsData/PlayerOverallStatsData
  // static public PlayerAllOverallStatsData/PlayerOverallStatsData op_Addition(PlayerAllOverallStatsData/PlayerOverallStatsData a, PlayerAllOverallStatsData/PlayerOverallStatsData b)
  // Offset: 0xBD97EC
  GlobalNamespace::PlayerAllOverallStatsData::PlayerOverallStatsData* operator+(GlobalNamespace::PlayerAllOverallStatsData::PlayerOverallStatsData* a, GlobalNamespace::PlayerAllOverallStatsData::PlayerOverallStatsData& b);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerAllOverallStatsData::PlayerOverallStatsData*, "", "PlayerAllOverallStatsData/PlayerOverallStatsData");
#pragma pack(pop)
