// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Object
#include "System/Object.hpp"
// Including type: PlayerSaveDataV1_0_1
#include "GlobalNamespace/PlayerSaveDataV1_0_1.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: PlayerSaveDataV1_0_1/GameplayModifiers
  class PlayerSaveDataV1_0_1::GameplayModifiers : public ::CsObject {
    public:
    // Nested type: GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType
    struct EnabledObstacleType;
    // Nested type: GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType
    struct EnergyType;
    // Nested type: GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed
    struct SongSpeed;
    // Autogenerated type: PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType
    struct EnabledObstacleType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType All
      static constexpr const int All = 0;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType All
      static GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType _get_All();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType All
      static void _set_All(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType FullHeightOnly
      static constexpr const int FullHeightOnly = 1;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType FullHeightOnly
      static GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType _get_FullHeightOnly();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType FullHeightOnly
      static void _set_FullHeightOnly(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType None
      static constexpr const int None = 2;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType None
      static GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType _get_None();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType None
      static void _set_None(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType value);
      // Creating value type constructor for type: EnabledObstacleType
      EnabledObstacleType(int value_ = {}) : value{value_} {}
    }; // PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType
    // Autogenerated type: PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType
    struct EnergyType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Bar
      static constexpr const int Bar = 0;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Bar
      static GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType _get_Bar();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Bar
      static void _set_Bar(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Battery
      static constexpr const int Battery = 1;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Battery
      static GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType _get_Battery();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Battery
      static void _set_Battery(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType value);
      // Creating value type constructor for type: EnergyType
      EnergyType(int value_ = {}) : value{value_} {}
    }; // PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType
    // Autogenerated type: PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed
    struct SongSpeed : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Normal
      static constexpr const int Normal = 0;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Normal
      static GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed _get_Normal();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Normal
      static void _set_Normal(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Faster
      static constexpr const int Faster = 1;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Faster
      static GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed _get_Faster();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Faster
      static void _set_Faster(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Slower
      static constexpr const int Slower = 2;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Slower
      static GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed _get_Slower();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Slower
      static void _set_Slower(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed value);
      // Creating value type constructor for type: SongSpeed
      SongSpeed(int value_ = {}) : value{value_} {}
    }; // PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed
    // public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType energyType
    // Offset: 0x10
    GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType energyType;
    // public System.Boolean noFail
    // Offset: 0x14
    bool noFail;
    // public System.Boolean instaFail
    // Offset: 0x15
    bool instaFail;
    // public System.Boolean failOnSaberClash
    // Offset: 0x16
    bool failOnSaberClash;
    // public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType enabledObstacleType
    // Offset: 0x18
    GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType enabledObstacleType;
    // public System.Boolean fastNotes
    // Offset: 0x1C
    bool fastNotes;
    // public System.Boolean strictAngles
    // Offset: 0x1D
    bool strictAngles;
    // public System.Boolean disappearingArrows
    // Offset: 0x1E
    bool disappearingArrows;
    // public System.Boolean noBombs
    // Offset: 0x1F
    bool noBombs;
    // public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed songSpeed
    // Offset: 0x20
    GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed songSpeed;
    // public System.Void .ctor()
    // Offset: 0xC056B4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static PlayerSaveDataV1_0_1::GameplayModifiers* New_ctor();
  }; // PlayerSaveDataV1_0_1/GameplayModifiers
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers*, "", "PlayerSaveDataV1_0_1/GameplayModifiers");
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType, "", "PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType");
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType, "", "PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType");
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed, "", "PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed");
#pragma pack(pop)
