// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayerSaveDataV1_0_1
#include "GlobalNamespace/PlayerSaveDataV1_0_1.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers*, "", "PlayerSaveDataV1_0_1/GameplayModifiers");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x24
  #pragma pack(push, 1)
  // Autogenerated type: PlayerSaveDataV1_0_1/GameplayModifiers
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayerSaveDataV1_0_1::GameplayModifiers : public ::Il2CppObject {
    public:
    // Nested type: ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType
    struct EnabledObstacleType;
    // Nested type: ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType
    struct EnergyType;
    // Nested type: ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed
    struct SongSpeed;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType
    // [TokenAttribute] Offset: FFFFFFFF
    struct EnabledObstacleType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: EnabledObstacleType
      constexpr EnabledObstacleType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType All
      static constexpr const int All = 0;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType All
      static ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType _get_All();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType All
      static void _set_All(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType FullHeightOnly
      static constexpr const int FullHeightOnly = 1;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType FullHeightOnly
      static ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType _get_FullHeightOnly();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType FullHeightOnly
      static void _set_FullHeightOnly(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType None
      static constexpr const int None = 2;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType None
      static ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType _get_None();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType None
      static void _set_None(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType
    #pragma pack(pop)
    static check_size<sizeof(PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType), 0 + sizeof(int)> __GlobalNamespace_PlayerSaveDataV1_0_1_GameplayModifiers_EnabledObstacleTypeSizeCheck;
    static_assert(sizeof(PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType
    // [TokenAttribute] Offset: FFFFFFFF
    struct EnergyType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: EnergyType
      constexpr EnergyType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Bar
      static constexpr const int Bar = 0;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Bar
      static ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType _get_Bar();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Bar
      static void _set_Bar(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Battery
      static constexpr const int Battery = 1;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Battery
      static ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType _get_Battery();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType Battery
      static void _set_Battery(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType
    #pragma pack(pop)
    static check_size<sizeof(PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType), 0 + sizeof(int)> __GlobalNamespace_PlayerSaveDataV1_0_1_GameplayModifiers_EnergyTypeSizeCheck;
    static_assert(sizeof(PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed
    // [TokenAttribute] Offset: FFFFFFFF
    struct SongSpeed/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SongSpeed
      constexpr SongSpeed(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Normal
      static constexpr const int Normal = 0;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Normal
      static ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed _get_Normal();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Normal
      static void _set_Normal(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Faster
      static constexpr const int Faster = 1;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Faster
      static ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed _get_Faster();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Faster
      static void _set_Faster(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed value);
      // static field const value: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Slower
      static constexpr const int Slower = 2;
      // Get static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Slower
      static ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed _get_Slower();
      // Set static field: static public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed Slower
      static void _set_Slower(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed
    #pragma pack(pop)
    static check_size<sizeof(PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed), 0 + sizeof(int)> __GlobalNamespace_PlayerSaveDataV1_0_1_GameplayModifiers_SongSpeedSizeCheck;
    static_assert(sizeof(PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed) == 0x4);
    public:
    // public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType energyType
    // Size: 0x4
    // Offset: 0x10
    ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType energyType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType) == 0x4);
    // public System.Boolean noFail
    // Size: 0x1
    // Offset: 0x14
    bool noFail;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean instaFail
    // Size: 0x1
    // Offset: 0x15
    bool instaFail;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean failOnSaberClash
    // Size: 0x1
    // Offset: 0x16
    bool failOnSaberClash;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: failOnSaberClash and: enabledObstacleType
    char __padding3[0x1] = {};
    // public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType enabledObstacleType
    // Size: 0x4
    // Offset: 0x18
    ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType enabledObstacleType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType) == 0x4);
    // public System.Boolean fastNotes
    // Size: 0x1
    // Offset: 0x1C
    bool fastNotes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean strictAngles
    // Size: 0x1
    // Offset: 0x1D
    bool strictAngles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disappearingArrows
    // Size: 0x1
    // Offset: 0x1E
    bool disappearingArrows;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean noBombs
    // Size: 0x1
    // Offset: 0x1F
    bool noBombs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed songSpeed
    // Size: 0x4
    // Offset: 0x20
    ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed songSpeed;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed) == 0x4);
    public:
    // Get instance field reference: public PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType energyType
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType& dyn_energyType();
    // Get instance field reference: public System.Boolean noFail
    [[deprecated("Use field access instead!")]] bool& dyn_noFail();
    // Get instance field reference: public System.Boolean instaFail
    [[deprecated("Use field access instead!")]] bool& dyn_instaFail();
    // Get instance field reference: public System.Boolean failOnSaberClash
    [[deprecated("Use field access instead!")]] bool& dyn_failOnSaberClash();
    // Get instance field reference: public PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType enabledObstacleType
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType& dyn_enabledObstacleType();
    // Get instance field reference: public System.Boolean fastNotes
    [[deprecated("Use field access instead!")]] bool& dyn_fastNotes();
    // Get instance field reference: public System.Boolean strictAngles
    [[deprecated("Use field access instead!")]] bool& dyn_strictAngles();
    // Get instance field reference: public System.Boolean disappearingArrows
    [[deprecated("Use field access instead!")]] bool& dyn_disappearingArrows();
    // Get instance field reference: public System.Boolean noBombs
    [[deprecated("Use field access instead!")]] bool& dyn_noBombs();
    // Get instance field reference: public PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed songSpeed
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed& dyn_songSpeed();
    // public System.Void .ctor()
    // Offset: 0x13D8D48
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PlayerSaveDataV1_0_1::GameplayModifiers* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PlayerSaveDataV1_0_1::GameplayModifiers*, creationType>()));
    }
  }; // PlayerSaveDataV1_0_1/GameplayModifiers
  #pragma pack(pop)
  static check_size<sizeof(PlayerSaveDataV1_0_1::GameplayModifiers), 32 + sizeof(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed)> __GlobalNamespace_PlayerSaveDataV1_0_1_GameplayModifiersSizeCheck;
  static_assert(sizeof(PlayerSaveDataV1_0_1::GameplayModifiers) == 0x24);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::SongSpeed, "", "PlayerSaveDataV1_0_1/GameplayModifiers/SongSpeed");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnergyType, "", "PlayerSaveDataV1_0_1/GameplayModifiers/EnergyType");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::EnabledObstacleType, "", "PlayerSaveDataV1_0_1/GameplayModifiers/EnabledObstacleType");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::PlayerSaveDataV1_0_1::GameplayModifiers::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
