// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PlayerSaveData
#include "GlobalNamespace/PlayerSaveData.hpp"
// Including type: BeatmapDifficulty
#include "GlobalNamespace/BeatmapDifficulty.hpp"
// Including type: RankModel/Rank
#include "GlobalNamespace/RankModel_Rank.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: PlayerSaveData/PlayerLevelStatsData
  class PlayerSaveData::PlayerLevelStatsData : public ::Il2CppObject {
    public:
    // public System.String levelId
    // Offset: 0x10
    ::Il2CppString* levelId;
    // public BeatmapDifficulty difficulty
    // Offset: 0x18
    GlobalNamespace::BeatmapDifficulty difficulty;
    // public System.String beatmapCharacteristicName
    // Offset: 0x20
    ::Il2CppString* beatmapCharacteristicName;
    // public System.Int32 highScore
    // Offset: 0x28
    int highScore;
    // public System.Int32 maxCombo
    // Offset: 0x2C
    int maxCombo;
    // public System.Boolean fullCombo
    // Offset: 0x30
    bool fullCombo;
    // public RankModel/Rank maxRank
    // Offset: 0x34
    GlobalNamespace::RankModel::Rank maxRank;
    // public System.Boolean validScore
    // Offset: 0x38
    bool validScore;
    // public System.Int32 playCount
    // Offset: 0x3C
    int playCount;
    // public System.Void .ctor()
    // Offset: 0xC1B3D4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static PlayerSaveData::PlayerLevelStatsData* New_ctor();
  }; // PlayerSaveData/PlayerLevelStatsData
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerSaveData::PlayerLevelStatsData*, "", "PlayerSaveData/PlayerLevelStatsData");
#pragma pack(pop)
