// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: Vector3SO
  class Vector3SO;
  // Forward declaring type: IVRPlatformHelper
  class IVRPlatformHelper;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ButtonBinder
  class ButtonBinder;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x4C
  #pragma pack(push, 1)
  // Autogenerated type: PlayerHeightSettingsController
  // [] Offset: FFFFFFFF
  class PlayerHeightSettingsController : public UnityEngine::MonoBehaviour {
    public:
    // private TMPro.TextMeshProUGUI _text
    // Size: 0x8
    // Offset: 0x18
    TMPro::TextMeshProUGUI* text;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshProUGUI*) == 0x8);
    // private UnityEngine.UI.Button _setButton
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::UI::Button* setButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private Vector3SO _roomCenter
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::Vector3SO* roomCenter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // [InjectAttribute] Offset: 0xD2DB8C
    // private readonly IVRPlatformHelper _vrPlatformHelper
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::IVRPlatformHelper* vrPlatformHelper;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IVRPlatformHelper*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD2DB9C
    // private System.Action`1<System.Single> valueDidChangeEvent
    // Size: 0x8
    // Offset: 0x38
    System::Action_1<float>* valueDidChangeEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<float>*) == 0x8);
    // private HMUI.ButtonBinder _buttonBinder
    // Size: 0x8
    // Offset: 0x40
    HMUI::ButtonBinder* buttonBinder;
    // Field size check
    static_assert(sizeof(HMUI::ButtonBinder*) == 0x8);
    // private System.Single _value
    // Size: 0x4
    // Offset: 0x48
    float value;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: PlayerHeightSettingsController
    PlayerHeightSettingsController(TMPro::TextMeshProUGUI* text_ = {}, UnityEngine::UI::Button* setButton_ = {}, GlobalNamespace::Vector3SO* roomCenter_ = {}, GlobalNamespace::IVRPlatformHelper* vrPlatformHelper_ = {}, System::Action_1<float>* valueDidChangeEvent_ = {}, HMUI::ButtonBinder* buttonBinder_ = {}, float value_ = {}) noexcept : text{text_}, setButton{setButton_}, roomCenter{roomCenter_}, vrPlatformHelper{vrPlatformHelper_}, valueDidChangeEvent{valueDidChangeEvent_}, buttonBinder{buttonBinder_}, value{value_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_valueDidChangeEvent(System.Action`1<System.Single> value)
    // Offset: 0xF69B3C
    void add_valueDidChangeEvent(System::Action_1<float>* value);
    // public System.Void remove_valueDidChangeEvent(System.Action`1<System.Single> value)
    // Offset: 0xF69BE0
    void remove_valueDidChangeEvent(System::Action_1<float>* value);
    // public System.Single get_value()
    // Offset: 0xF69C84
    float get_value();
    // protected System.Void Awake()
    // Offset: 0xF69C8C
    void Awake();
    // public System.Void Init(System.Single playerHeight)
    // Offset: 0xF69D3C
    void Init(float playerHeight);
    // private System.Void AutoSetHeight()
    // Offset: 0xF69DE0
    void AutoSetHeight();
    // private System.Void RefreshUI()
    // Offset: 0xF69D44
    void RefreshUI();
    // public System.Void .ctor()
    // Offset: 0xF69F04
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PlayerHeightSettingsController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::PlayerHeightSettingsController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PlayerHeightSettingsController*, creationType>()));
    }
  }; // PlayerHeightSettingsController
  #pragma pack(pop)
  static check_size<sizeof(PlayerHeightSettingsController), 72 + sizeof(float)> __GlobalNamespace_PlayerHeightSettingsControllerSizeCheck;
  static_assert(sizeof(PlayerHeightSettingsController) == 0x4C);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerHeightSettingsController*, "", "PlayerHeightSettingsController");
