// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PlayerSaveDataV1_0_1
#include "GlobalNamespace/PlayerSaveDataV1_0_1.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: PlayerSaveDataV1_0_1/PlayerSpecificSettings
  class PlayerSaveDataV1_0_1::PlayerSpecificSettings : public ::Il2CppObject {
    public:
    // public System.Boolean staticLights
    // Offset: 0x10
    bool staticLights;
    // public System.Boolean leftHanded
    // Offset: 0x11
    bool leftHanded;
    // public System.Boolean swapColors
    // Offset: 0x12
    bool swapColors;
    // public System.Single playerHeight
    // Offset: 0x14
    float playerHeight;
    // public System.Boolean disableSFX
    // Offset: 0x18
    bool disableSFX;
    // public System.Boolean reduceDebris
    // Offset: 0x19
    bool reduceDebris;
    // public System.Boolean advancedHud
    // Offset: 0x1A
    bool advancedHud;
    // public System.Boolean noTextsAndHuds
    // Offset: 0x1B
    bool noTextsAndHuds;
    // public System.Void .ctor()
    // Offset: 0xC1B704
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static PlayerSaveDataV1_0_1::PlayerSpecificSettings* New_ctor();
  }; // PlayerSaveDataV1_0_1/PlayerSpecificSettings
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerSaveDataV1_0_1::PlayerSpecificSettings*, "", "PlayerSaveDataV1_0_1/PlayerSpecificSettings");
#pragma pack(pop)
