// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PlayerSaveData
#include "GlobalNamespace/PlayerSaveData.hpp"
// Including type: BeatmapDifficulty
#include "GlobalNamespace/BeatmapDifficulty.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: PlayerSaveData/LocalPlayer
  class PlayerSaveData::LocalPlayer : public ::Il2CppObject {
    public:
    // public System.String playerId
    // Offset: 0x10
    ::Il2CppString* playerId;
    // public System.String playerName
    // Offset: 0x18
    ::Il2CppString* playerName;
    // public System.Boolean shouldShowTutorialPrompt
    // Offset: 0x20
    bool shouldShowTutorialPrompt;
    // public System.Boolean shouldShow360Warning
    // Offset: 0x21
    bool shouldShow360Warning;
    // public System.Boolean agreedToEula
    // Offset: 0x22
    bool agreedToEula;
    // public BeatmapDifficulty lastSelectedBeatmapDifficulty
    // Offset: 0x24
    GlobalNamespace::BeatmapDifficulty lastSelectedBeatmapDifficulty;
    // public System.String lastSelectedBeatmapCharacteristicName
    // Offset: 0x28
    ::Il2CppString* lastSelectedBeatmapCharacteristicName;
    // public PlayerSaveData/GameplayModifiers gameplayModifiers
    // Offset: 0x30
    GlobalNamespace::PlayerSaveData::GameplayModifiers* gameplayModifiers;
    // public PlayerSaveData/PlayerSpecificSettings playerSpecificSettings
    // Offset: 0x38
    GlobalNamespace::PlayerSaveData::PlayerSpecificSettings* playerSpecificSettings;
    // public PlayerSaveData/PracticeSettings practiceSettings
    // Offset: 0x40
    GlobalNamespace::PlayerSaveData::PracticeSettings* practiceSettings;
    // public PlayerSaveData/PlayerAllOverallStatsData playerAllOverallStatsData
    // Offset: 0x48
    GlobalNamespace::PlayerSaveData::PlayerAllOverallStatsData* playerAllOverallStatsData;
    // public System.Collections.Generic.List`1<PlayerSaveData/PlayerLevelStatsData> levelsStatsData
    // Offset: 0x50
    System::Collections::Generic::List_1<GlobalNamespace::PlayerSaveData::PlayerLevelStatsData*>* levelsStatsData;
    // public System.Collections.Generic.List`1<PlayerSaveData/PlayerMissionStatsData> missionsStatsData
    // Offset: 0x58
    System::Collections::Generic::List_1<GlobalNamespace::PlayerSaveData::PlayerMissionStatsData*>* missionsStatsData;
    // public System.Collections.Generic.List`1<System.String> showedMissionHelpIds
    // Offset: 0x60
    System::Collections::Generic::List_1<::Il2CppString*>* showedMissionHelpIds;
    // public PlayerSaveData/ColorSchemesSettings colorSchemesSettings
    // Offset: 0x68
    GlobalNamespace::PlayerSaveData::ColorSchemesSettings* colorSchemesSettings;
    // public PlayerSaveData/OverrideEnvironmentSettings overrideEnvironmentSettings
    // Offset: 0x70
    GlobalNamespace::PlayerSaveData::OverrideEnvironmentSettings* overrideEnvironmentSettings;
    // public System.Collections.Generic.List`1<System.String> favoritesLevelIds
    // Offset: 0x78
    System::Collections::Generic::List_1<::Il2CppString*>* favoritesLevelIds;
    // public System.Void .ctor()
    // Offset: 0xBDC4DC
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static PlayerSaveData::LocalPlayer* New_ctor();
  }; // PlayerSaveData/LocalPlayer
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerSaveData::LocalPlayer*, "", "PlayerSaveData/LocalPlayer");
#pragma pack(pop)
