// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: PlayerSpecificSettings
  class PlayerSpecificSettings : public ::Il2CppObject {
    public:
    // private System.Boolean _staticLights
    // Offset: 0x10
    bool staticLights;
    // private System.Boolean _leftHanded
    // Offset: 0x11
    bool leftHanded;
    // private System.Single _playerHeight
    // Offset: 0x14
    float playerHeight;
    // private System.Boolean _automaticPlayerHeight
    // Offset: 0x18
    bool automaticPlayerHeight;
    // private System.Single _sfxVolume
    // Offset: 0x1C
    float sfxVolume;
    // private System.Boolean _reduceDebris
    // Offset: 0x20
    bool reduceDebris;
    // private System.Boolean _noTextsAndHuds
    // Offset: 0x21
    bool noTextsAndHuds;
    // private System.Boolean _noFailEffects
    // Offset: 0x22
    bool noFailEffects;
    // private System.Boolean _advancedHud
    // Offset: 0x23
    bool advancedHud;
    // private System.Boolean _autoRestart
    // Offset: 0x24
    bool autoRestart;
    // private System.Single _saberTrailIntensity
    // Offset: 0x28
    float saberTrailIntensity;
    // public System.Boolean get_staticLights()
    // Offset: 0xC17CC0
    bool get_staticLights();
    // public System.Void set_staticLights(System.Boolean value)
    // Offset: 0xC17CC8
    void set_staticLights(bool value);
    // public System.Boolean get_leftHanded()
    // Offset: 0xC17CD4
    bool get_leftHanded();
    // public System.Void set_leftHanded(System.Boolean value)
    // Offset: 0xC17CDC
    void set_leftHanded(bool value);
    // public System.Single get_playerHeight()
    // Offset: 0xC17CE8
    float get_playerHeight();
    // public System.Void set_playerHeight(System.Single value)
    // Offset: 0xC17CF0
    void set_playerHeight(float value);
    // public System.Boolean get_automaticPlayerHeight()
    // Offset: 0xC17CF8
    bool get_automaticPlayerHeight();
    // public System.Void set_automaticPlayerHeight(System.Boolean value)
    // Offset: 0xC17D00
    void set_automaticPlayerHeight(bool value);
    // public System.Single get_sfxVolume()
    // Offset: 0xC17D0C
    float get_sfxVolume();
    // public System.Void set_sfxVolume(System.Single value)
    // Offset: 0xC17D14
    void set_sfxVolume(float value);
    // public System.Boolean get_reduceDebris()
    // Offset: 0xC17D1C
    bool get_reduceDebris();
    // public System.Void set_reduceDebris(System.Boolean value)
    // Offset: 0xC17D24
    void set_reduceDebris(bool value);
    // public System.Boolean get_noTextsAndHuds()
    // Offset: 0xC17D30
    bool get_noTextsAndHuds();
    // public System.Void set_noTextsAndHuds(System.Boolean value)
    // Offset: 0xC17D38
    void set_noTextsAndHuds(bool value);
    // public System.Boolean get_noFailEffects()
    // Offset: 0xC17D44
    bool get_noFailEffects();
    // public System.Void set_noFailEffects(System.Boolean value)
    // Offset: 0xC17D4C
    void set_noFailEffects(bool value);
    // public System.Boolean get_advancedHud()
    // Offset: 0xC17D58
    bool get_advancedHud();
    // public System.Void set_advancedHud(System.Boolean value)
    // Offset: 0xC17D60
    void set_advancedHud(bool value);
    // public System.Boolean get_autoRestart()
    // Offset: 0xC17D6C
    bool get_autoRestart();
    // public System.Void set_autoRestart(System.Boolean value)
    // Offset: 0xC17D74
    void set_autoRestart(bool value);
    // public System.Single get_saberTrailIntensity()
    // Offset: 0xC17D80
    float get_saberTrailIntensity();
    // public System.Void set_saberTrailIntensity(System.Single value)
    // Offset: 0xC17D88
    void set_saberTrailIntensity(float value);
    // static public PlayerSpecificSettings get_defaultSettings()
    // Offset: 0xC17D90
    static GlobalNamespace::PlayerSpecificSettings* get_defaultSettings();
    // public System.Void ResetToDefault()
    // Offset: 0xC17E70
    void ResetToDefault();
    // public System.Void .ctor()
    // Offset: 0xC17E1C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static PlayerSpecificSettings* New_ctor();
  }; // PlayerSpecificSettings
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerSpecificSettings*, "", "PlayerSpecificSettings");
#pragma pack(pop)
