// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: PlayerSaveDataV1_0_1
#include "GlobalNamespace/PlayerSaveDataV1_0_1.hpp"
// Including type: BeatmapDifficulty
#include "GlobalNamespace/BeatmapDifficulty.hpp"
// Including type: RankModel/Rank
#include "GlobalNamespace/RankModel_Rank.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: PlayerSaveDataV1_0_1/PlayerLevelStatsData
  class PlayerSaveDataV1_0_1::PlayerLevelStatsData : public ::Il2CppObject {
    public:
    // public System.String levelId
    // Offset: 0x10
    ::Il2CppString* levelId;
    // public BeatmapDifficulty difficulty
    // Offset: 0x18
    GlobalNamespace::BeatmapDifficulty difficulty;
    // public System.Int32 highScore
    // Offset: 0x1C
    int highScore;
    // public System.Int32 maxCombo
    // Offset: 0x20
    int maxCombo;
    // public System.Boolean fullCombo
    // Offset: 0x24
    bool fullCombo;
    // public RankModel/Rank maxRank
    // Offset: 0x28
    GlobalNamespace::RankModel::Rank maxRank;
    // public System.Boolean validScore
    // Offset: 0x2C
    bool validScore;
    // public System.Int32 playCount
    // Offset: 0x30
    int playCount;
    // public System.Void .ctor()
    // Offset: 0xC1B63C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static PlayerSaveDataV1_0_1::PlayerLevelStatsData* New_ctor();
  }; // PlayerSaveDataV1_0_1/PlayerLevelStatsData
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::PlayerSaveDataV1_0_1::PlayerLevelStatsData*, "", "PlayerSaveDataV1_0_1/PlayerLevelStatsData");
#pragma pack(pop)
