// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: RecordingToolConfigurationProcessor
#include "GlobalNamespace/RecordingToolConfigurationProcessor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::RecordingToolConfigurationProcessor::PlaybackScreenshot);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::RecordingToolConfigurationProcessor::PlaybackScreenshot*, "", "RecordingToolConfigurationProcessor/PlaybackScreenshot");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: RecordingToolConfigurationProcessor/PlaybackScreenshot
  // [TokenAttribute] Offset: FFFFFFFF
  class RecordingToolConfigurationProcessor::PlaybackScreenshot : public ::Il2CppObject {
    public:
    public:
    // public System.String name
    // Size: 0x8
    // Offset: 0x10
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String type
    // Size: 0x8
    // Offset: 0x18
    ::StringW type;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String[] includedLayers
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::StringW> includedLayers;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.String[] excludedLayers
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::StringW> excludedLayers;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public RecordingToolConfigurationProcessor/ColorSaveData backgroundColor
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::RecordingToolConfigurationProcessor::ColorSaveData* backgroundColor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RecordingToolConfigurationProcessor::ColorSaveData*) == 0x8);
    public:
    // Get instance field reference: public System.String name
    [[deprecated("Use field access instead!")]] ::StringW& dyn_name();
    // Get instance field reference: public System.String type
    [[deprecated("Use field access instead!")]] ::StringW& dyn_type();
    // Get instance field reference: public System.String[] includedLayers
    [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_includedLayers();
    // Get instance field reference: public System.String[] excludedLayers
    [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_excludedLayers();
    // Get instance field reference: public RecordingToolConfigurationProcessor/ColorSaveData backgroundColor
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::RecordingToolConfigurationProcessor::ColorSaveData*& dyn_backgroundColor();
    // public System.Void .ctor()
    // Offset: 0x142EF08
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RecordingToolConfigurationProcessor::PlaybackScreenshot* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::RecordingToolConfigurationProcessor::PlaybackScreenshot::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RecordingToolConfigurationProcessor::PlaybackScreenshot*, creationType>()));
    }
  }; // RecordingToolConfigurationProcessor/PlaybackScreenshot
  #pragma pack(pop)
  static check_size<sizeof(RecordingToolConfigurationProcessor::PlaybackScreenshot), 48 + sizeof(::GlobalNamespace::RecordingToolConfigurationProcessor::ColorSaveData*)> __GlobalNamespace_RecordingToolConfigurationProcessor_PlaybackScreenshotSizeCheck;
  static_assert(sizeof(RecordingToolConfigurationProcessor::PlaybackScreenshot) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::RecordingToolConfigurationProcessor::PlaybackScreenshot::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
