// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Sprite
  class Sprite;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x40
  // Autogenerated type: ResultObjectiveListItem
  // [] Offset: FFFFFFFF
  class ResultObjectiveListItem : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.UI.Image _icon
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::UI::Image* icon;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Image*) == 0x8);
    // private UnityEngine.UI.Image _iconGlow
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::UI::Image* iconGlow;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Image*) == 0x8);
    // private TMPro.TextMeshProUGUI _titleText
    // Size: 0x8
    // Offset: 0x28
    TMPro::TextMeshProUGUI* titleText;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshProUGUI*) == 0x8);
    // private TMPro.TextMeshProUGUI _conditionText
    // Size: 0x8
    // Offset: 0x30
    TMPro::TextMeshProUGUI* conditionText;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshProUGUI*) == 0x8);
    // private TMPro.TextMeshProUGUI _valueText
    // Size: 0x8
    // Offset: 0x38
    TMPro::TextMeshProUGUI* valueText;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshProUGUI*) == 0x8);
    // Creating value type constructor for type: ResultObjectiveListItem
    ResultObjectiveListItem(UnityEngine::UI::Image* icon_ = {}, UnityEngine::UI::Image* iconGlow_ = {}, TMPro::TextMeshProUGUI* titleText_ = {}, TMPro::TextMeshProUGUI* conditionText_ = {}, TMPro::TextMeshProUGUI* valueText_ = {}) noexcept : icon{icon_}, iconGlow{iconGlow_}, titleText{titleText_}, conditionText{conditionText_}, valueText{valueText_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void set_iconColor(UnityEngine.Color value)
    // Offset: 0xF33A94
    void set_iconColor(UnityEngine::Color value);
    // public System.Void set_icon(UnityEngine.Sprite value)
    // Offset: 0xF33AB8
    void set_icon(UnityEngine::Sprite* value);
    // public System.Void set_iconGlow(UnityEngine.Sprite value)
    // Offset: 0xF33AD4
    void set_iconGlow(UnityEngine::Sprite* value);
    // public System.Void set_title(System.String value)
    // Offset: 0xF33AF0
    void set_title(::Il2CppString* value);
    // public System.Void set_conditionText(System.String value)
    // Offset: 0xF33B0C
    void set_conditionText(::Il2CppString* value);
    // public System.Void set_hideConditionText(System.Boolean value)
    // Offset: 0xF33B28
    void set_hideConditionText(bool value);
    // public System.Void set_valueText(System.String value)
    // Offset: 0xF33B68
    void set_valueText(::Il2CppString* value);
    // public System.Void set_hideValueText(System.Boolean value)
    // Offset: 0xF33B84
    void set_hideValueText(bool value);
    // public System.Void .ctor()
    // Offset: 0xF33BC4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ResultObjectiveListItem* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::ResultObjectiveListItem::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ResultObjectiveListItem*, creationType>()));
    }
  }; // ResultObjectiveListItem
  static check_size<sizeof(ResultObjectiveListItem), 56 + sizeof(TMPro::TextMeshProUGUI*)> __GlobalNamespace_ResultObjectiveListItemSizeCheck;
  static_assert(sizeof(ResultObjectiveListItem) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ResultObjectiveListItem*, "", "ResultObjectiveListItem");
#pragma pack(pop)
