// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LevelBar
  class LevelBar;
  // Forward declaring type: FireworksController
  class FireworksController;
  // Forward declaring type: SongPreviewPlayer
  class SongPreviewPlayer;
  // Forward declaring type: LevelCompletionResults
  class LevelCompletionResults;
  // Forward declaring type: IDifficultyBeatmap
  class IDifficultyBeatmap;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: ResultsViewController
  class ResultsViewController : public HMUI::ViewController {
    public:
    // Nested type: GlobalNamespace::ResultsViewController::$StartFireworksAfterDelay$d__30
    class $StartFireworksAfterDelay$d__30;
    // private UnityEngine.UI.Button _restartButton
    // Offset: 0x70
    UnityEngine::UI::Button* restartButton;
    // private UnityEngine.UI.Button _continueButton
    // Offset: 0x78
    UnityEngine::UI::Button* continueButton;
    // private UnityEngine.GameObject _clearedPanel
    // Offset: 0x80
    UnityEngine::GameObject* clearedPanel;
    // private TMPro.TextMeshProUGUI _scoreText
    // Offset: 0x88
    TMPro::TextMeshProUGUI* scoreText;
    // private UnityEngine.GameObject _newHighScoreText
    // Offset: 0x90
    UnityEngine::GameObject* newHighScoreText;
    // private TMPro.TextMeshProUGUI _rankText
    // Offset: 0x98
    TMPro::TextMeshProUGUI* rankText;
    // private TMPro.TextMeshProUGUI _goodCutsPercentageText
    // Offset: 0xA0
    TMPro::TextMeshProUGUI* goodCutsPercentageText;
    // private TMPro.TextMeshProUGUI _comboText
    // Offset: 0xA8
    TMPro::TextMeshProUGUI* comboText;
    // private UnityEngine.GameObject _clearedBannerGo
    // Offset: 0xB0
    UnityEngine::GameObject* clearedBannerGo;
    // private UnityEngine.GameObject _failedBannerGo
    // Offset: 0xB8
    UnityEngine::GameObject* failedBannerGo;
    // private LevelBar _levelBar
    // Offset: 0xC0
    GlobalNamespace::LevelBar* levelBar;
    // private UnityEngine.AudioClip _levelClearedAudioClip
    // Offset: 0xC8
    UnityEngine::AudioClip* levelClearedAudioClip;
    // private readonly FireworksController _fireworksController
    // Offset: 0xD0
    GlobalNamespace::FireworksController* fireworksController;
    // private readonly SongPreviewPlayer _songPreviewPlayer
    // Offset: 0xD8
    GlobalNamespace::SongPreviewPlayer* songPreviewPlayer;
    // private System.Action`1<ResultsViewController> continueButtonPressedEvent
    // Offset: 0xE0
    System::Action_1<GlobalNamespace::ResultsViewController*>* continueButtonPressedEvent;
    // private System.Action`1<ResultsViewController> restartButtonPressedEvent
    // Offset: 0xE8
    System::Action_1<GlobalNamespace::ResultsViewController*>* restartButtonPressedEvent;
    // private LevelCompletionResults _levelCompletionResults
    // Offset: 0xF0
    GlobalNamespace::LevelCompletionResults* levelCompletionResults;
    // private IDifficultyBeatmap _difficultyBeatmap
    // Offset: 0xF8
    GlobalNamespace::IDifficultyBeatmap* difficultyBeatmap;
    // private UnityEngine.Coroutine _startFireworksAfterDelayCoroutine
    // Offset: 0x100
    UnityEngine::Coroutine* startFireworksAfterDelayCoroutine;
    // private System.Boolean _newHighScore
    // Offset: 0x108
    bool newHighScore;
    // private System.Boolean _practice
    // Offset: 0x109
    bool practice;
    // public System.Void add_continueButtonPressedEvent(System.Action`1<ResultsViewController> value)
    // Offset: 0x206FB54
    void add_continueButtonPressedEvent(System::Action_1<GlobalNamespace::ResultsViewController*>* value);
    // public System.Void remove_continueButtonPressedEvent(System.Action`1<ResultsViewController> value)
    // Offset: 0x206FBF8
    void remove_continueButtonPressedEvent(System::Action_1<GlobalNamespace::ResultsViewController*>* value);
    // public System.Void add_restartButtonPressedEvent(System.Action`1<ResultsViewController> value)
    // Offset: 0x206FC9C
    void add_restartButtonPressedEvent(System::Action_1<GlobalNamespace::ResultsViewController*>* value);
    // public System.Void remove_restartButtonPressedEvent(System.Action`1<ResultsViewController> value)
    // Offset: 0x206FD40
    void remove_restartButtonPressedEvent(System::Action_1<GlobalNamespace::ResultsViewController*>* value);
    // public System.Boolean get_practice()
    // Offset: 0x206FDE4
    bool get_practice();
    // public System.Void Init(LevelCompletionResults levelCompletionResults, IDifficultyBeatmap difficultyBeatmap, System.Boolean practice, System.Boolean newHighScore)
    // Offset: 0x206FDEC
    void Init(GlobalNamespace::LevelCompletionResults* levelCompletionResults, GlobalNamespace::IDifficultyBeatmap* difficultyBeatmap, bool practice, bool newHighScore);
    // private System.Collections.IEnumerator StartFireworksAfterDelay(System.Single delay)
    // Offset: 0x2070514
    System::Collections::IEnumerator* StartFireworksAfterDelay(float delay);
    // private System.Void SetDataToUI()
    // Offset: 0x206FFD4
    void SetDataToUI();
    // private System.Void ContinueButtonPressed()
    // Offset: 0x207068C
    void ContinueButtonPressed();
    // private System.Void RestartButtonPressed()
    // Offset: 0x20706F0
    void RestartButtonPressed();
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0x206FE44
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // protected override System.Void DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    // Offset: 0x20705A0
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    void DidDeactivate(bool removedFromHierarchy, bool screenSystemDisabling);
    // public System.Void .ctor()
    // Offset: 0x2070754
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static ResultsViewController* New_ctor();
  }; // ResultsViewController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ResultsViewController*, "", "ResultsViewController");
#pragma pack(pop)
