// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: Vector3SO
  class Vector3SO;
  // Forward declaring type: FloatSO
  class FloatSO;
  // Forward declaring type: StepValuePicker
  class StepValuePicker;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: RoomAdjustSettingsViewController
  class RoomAdjustSettingsViewController : public HMUI::ViewController {
    public:
    // private Vector3SO _roomCenter
    // Size: 0x8
    // Offset: 0x70
    GlobalNamespace::Vector3SO* roomCenter;
    // Field size check
    static_assert(sizeof(GlobalNamespace::Vector3SO*) == 0x8);
    // private FloatSO _roomRotation
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::FloatSO* roomRotation;
    // Field size check
    static_assert(sizeof(GlobalNamespace::FloatSO*) == 0x8);
    // [SpaceAttribute] Offset: 0xE26984
    // private StepValuePicker _xStepValuePicker
    // Size: 0x8
    // Offset: 0x80
    GlobalNamespace::StepValuePicker* xStepValuePicker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::StepValuePicker*) == 0x8);
    // private StepValuePicker _yStepValuePicker
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::StepValuePicker* yStepValuePicker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::StepValuePicker*) == 0x8);
    // private StepValuePicker _zStepValuePicker
    // Size: 0x8
    // Offset: 0x90
    GlobalNamespace::StepValuePicker* zStepValuePicker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::StepValuePicker*) == 0x8);
    // private StepValuePicker _rotStepValuePicker
    // Size: 0x8
    // Offset: 0x98
    GlobalNamespace::StepValuePicker* rotStepValuePicker;
    // Field size check
    static_assert(sizeof(GlobalNamespace::StepValuePicker*) == 0x8);
    // private UnityEngine.UI.Button _resetButton
    // Size: 0x8
    // Offset: 0xA0
    UnityEngine::UI::Button* resetButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // Creating value type constructor for type: RoomAdjustSettingsViewController
    RoomAdjustSettingsViewController(GlobalNamespace::Vector3SO* roomCenter_ = {}, GlobalNamespace::FloatSO* roomRotation_ = {}, GlobalNamespace::StepValuePicker* xStepValuePicker_ = {}, GlobalNamespace::StepValuePicker* yStepValuePicker_ = {}, GlobalNamespace::StepValuePicker* zStepValuePicker_ = {}, GlobalNamespace::StepValuePicker* rotStepValuePicker_ = {}, UnityEngine::UI::Button* resetButton_ = {}) noexcept : roomCenter{roomCenter_}, roomRotation{roomRotation_}, xStepValuePicker{xStepValuePicker_}, yStepValuePicker{yStepValuePicker_}, zStepValuePicker{zStepValuePicker_}, rotStepValuePicker{rotStepValuePicker_}, resetButton{resetButton_} {}
    // static field const value: static private System.Single kHorizontalMoveStep
    static constexpr const float kHorizontalMoveStep = 0.1;
    // Get static field: static private System.Single kHorizontalMoveStep
    static float _get_kHorizontalMoveStep();
    // Set static field: static private System.Single kHorizontalMoveStep
    static void _set_kHorizontalMoveStep(float value);
    // static field const value: static private System.Single kVerticalMoveStep
    static constexpr const float kVerticalMoveStep = 0.05;
    // Get static field: static private System.Single kVerticalMoveStep
    static float _get_kVerticalMoveStep();
    // Set static field: static private System.Single kVerticalMoveStep
    static void _set_kVerticalMoveStep(float value);
    // static field const value: static private System.Single kRotationStep
    static constexpr const float kRotationStep = 5;
    // Get static field: static private System.Single kRotationStep
    static float _get_kRotationStep();
    // Set static field: static private System.Single kRotationStep
    static void _set_kRotationStep(float value);
    // private System.Void Move(UnityEngine.Vector3 move)
    // Offset: 0x10AF3E8
    void Move(UnityEngine::Vector3 move);
    // private System.Void Rotate(System.Single rotation)
    // Offset: 0x10AF4B8
    void Rotate(float rotation);
    // private System.Void ResetRoom()
    // Offset: 0x10AF53C
    void ResetRoom();
    // private System.Void RefreshTexts()
    // Offset: 0x10AF26C
    void RefreshTexts();
    // private System.Void <DidActivate>b__10_0()
    // Offset: 0x10AF5F8
    void $DidActivate$b__10_0();
    // private System.Void <DidActivate>b__10_1()
    // Offset: 0x10AF650
    void $DidActivate$b__10_1();
    // private System.Void <DidActivate>b__10_2()
    // Offset: 0x10AF6A8
    void $DidActivate$b__10_2();
    // private System.Void <DidActivate>b__10_3()
    // Offset: 0x10AF700
    void $DidActivate$b__10_3();
    // private System.Void <DidActivate>b__10_4()
    // Offset: 0x10AF758
    void $DidActivate$b__10_4();
    // private System.Void <DidActivate>b__10_5()
    // Offset: 0x10AF7B0
    void $DidActivate$b__10_5();
    // private System.Void <DidActivate>b__10_6()
    // Offset: 0x10AF808
    void $DidActivate$b__10_6();
    // private System.Void <DidActivate>b__10_7()
    // Offset: 0x10AF810
    void $DidActivate$b__10_7();
    // private System.Void <DidActivate>b__10_8()
    // Offset: 0x10AF818
    void $DidActivate$b__10_8();
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0x10AEFE8
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // public System.Void .ctor()
    // Offset: 0x10AF5F0
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RoomAdjustSettingsViewController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::RoomAdjustSettingsViewController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RoomAdjustSettingsViewController*, creationType>()));
    }
  }; // RoomAdjustSettingsViewController
  #pragma pack(pop)
  static check_size<sizeof(RoomAdjustSettingsViewController), 160 + sizeof(UnityEngine::UI::Button*)> __GlobalNamespace_RoomAdjustSettingsViewControllerSizeCheck;
  static_assert(sizeof(RoomAdjustSettingsViewController) == 0xA8);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::RoomAdjustSettingsViewController*, "", "RoomAdjustSettingsViewController");
