// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x3C
  #pragma pack(push, 1)
  // Autogenerated type: Rotate
  // [] Offset: FFFFFFFF
  class Rotate : public UnityEngine::MonoBehaviour {
    public:
    // public UnityEngine.Vector3 _rotationVector
    // Size: 0xC
    // Offset: 0x18
    UnityEngine::Vector3 rotationVector;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public System.Single _speed
    // Size: 0x4
    // Offset: 0x24
    float speed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform _transform
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::Transform* transform;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 _startRotationAngles
    // Size: 0xC
    // Offset: 0x30
    UnityEngine::Vector3 startRotationAngles;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // Creating value type constructor for type: Rotate
    Rotate(UnityEngine::Vector3 rotationVector_ = {}, float speed_ = {}, UnityEngine::Transform* transform_ = {}, UnityEngine::Vector3 startRotationAngles_ = {}) noexcept : rotationVector{rotationVector_}, speed{speed_}, transform{transform_}, startRotationAngles{startRotationAngles_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Awake()
    // Offset: 0x103C7D8
    void Awake();
    // protected System.Void OnBecameVisible()
    // Offset: 0x103C8B4
    void OnBecameVisible();
    // protected System.Void OnBecameInvisible()
    // Offset: 0x103C8C0
    void OnBecameInvisible();
    // protected System.Void Update()
    // Offset: 0x103C8CC
    void Update();
    // public System.Void .ctor()
    // Offset: 0x103C9D4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Rotate* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::Rotate::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Rotate*, creationType>()));
    }
  }; // Rotate
  #pragma pack(pop)
  static check_size<sizeof(Rotate), 48 + sizeof(UnityEngine::Vector3)> __GlobalNamespace_RotateSizeCheck;
  static_assert(sizeof(Rotate) == 0x3C);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::Rotate*, "", "Rotate");
