// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: SaberSound
  class SaberSound : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.Transform _saberTop
    // Offset: 0x18
    UnityEngine::Transform* saberTop;
    // private UnityEngine.AudioSource _audioSource
    // Offset: 0x20
    UnityEngine::AudioSource* audioSource;
    // private UnityEngine.AnimationCurve _pitchBySpeedCurve
    // Offset: 0x28
    UnityEngine::AnimationCurve* pitchBySpeedCurve;
    // private UnityEngine.AnimationCurve _gainBySpeedCurve
    // Offset: 0x30
    UnityEngine::AnimationCurve* gainBySpeedCurve;
    // private System.Single _speedMultiplier
    // Offset: 0x38
    float speedMultiplier;
    // private System.Single _upSmooth
    // Offset: 0x3C
    float upSmooth;
    // private System.Single _downSmooth
    // Offset: 0x40
    float downSmooth;
    // private System.Single _noSoundTopThresholdSqr
    // Offset: 0x44
    float noSoundTopThresholdSqr;
    // private UnityEngine.Vector3 _prevPos
    // Offset: 0x48
    UnityEngine::Vector3 prevPos;
    // private System.Single _speed
    // Offset: 0x54
    float speed;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0xC295A8
    void Start();
    // protected System.Void Update()
    // Offset: 0xC295E0
    void Update();
    // public System.Void .ctor()
    // Offset: 0xC29808
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static SaberSound* New_ctor();
  }; // SaberSound
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SaberSound*, "", "SaberSound");
#pragma pack(pop)
