// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MainCamera
  class MainCamera;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: SafeAreaRectChecker
  // [TokenAttribute] Offset: FFFFFFFF
  class SafeAreaRectChecker : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::SafeAreaRectChecker::InitData
    class InitData;
    // private System.Single _minAngleX
    // Size: 0x4
    // Offset: 0x18
    float minAngleX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _maxAngleX
    // Size: 0x4
    // Offset: 0x1C
    float maxAngleX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _minAngleY
    // Size: 0x4
    // Offset: 0x20
    float minAngleY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _maxAngleY
    // Size: 0x4
    // Offset: 0x24
    float maxAngleY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.GameObject _activeObjectWhenInsideSafeArea
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::GameObject* activeObjectWhenInsideSafeArea;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject _activeObjectWhenNotInsideSafeArea
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::GameObject* activeObjectWhenNotInsideSafeArea;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.RectTransform _rectTransformToCheck
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::RectTransform* rectTransformToCheck;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private readonly UnityEngine.Vector3[] _corners
    // Size: 0x8
    // Offset: 0x40
    ::Array<UnityEngine::Vector3>* corners;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector3>*) == 0x8);
    // [InjectAttribute] Offset: 0xE0BDD4
    // private readonly MainCamera _mainCamera
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::MainCamera* mainCamera;
    // Field size check
    static_assert(sizeof(GlobalNamespace::MainCamera*) == 0x8);
    // [InjectAttribute] Offset: 0xE0BDE4
    // private readonly SafeAreaRectChecker/InitData _initData
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::SafeAreaRectChecker::InitData* initData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SafeAreaRectChecker::InitData*) == 0x8);
    // Creating value type constructor for type: SafeAreaRectChecker
    SafeAreaRectChecker(float minAngleX_ = {}, float maxAngleX_ = {}, float minAngleY_ = {}, float maxAngleY_ = {}, UnityEngine::GameObject* activeObjectWhenInsideSafeArea_ = {}, UnityEngine::GameObject* activeObjectWhenNotInsideSafeArea_ = {}, UnityEngine::RectTransform* rectTransformToCheck_ = {}, ::Array<UnityEngine::Vector3>* corners_ = {}, GlobalNamespace::MainCamera* mainCamera_ = {}, GlobalNamespace::SafeAreaRectChecker::InitData* initData_ = {}) noexcept : minAngleX{minAngleX_}, maxAngleX{maxAngleX_}, minAngleY{minAngleY_}, maxAngleY{maxAngleY_}, activeObjectWhenInsideSafeArea{activeObjectWhenInsideSafeArea_}, activeObjectWhenNotInsideSafeArea{activeObjectWhenNotInsideSafeArea_}, rectTransformToCheck{rectTransformToCheck_}, corners{corners_}, mainCamera{mainCamera_}, initData{initData_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field: private System.Single _minAngleX
    float _get__minAngleX();
    // Set instance field: private System.Single _minAngleX
    void _set__minAngleX(float value);
    // Get instance field: private System.Single _maxAngleX
    float _get__maxAngleX();
    // Set instance field: private System.Single _maxAngleX
    void _set__maxAngleX(float value);
    // Get instance field: private System.Single _minAngleY
    float _get__minAngleY();
    // Set instance field: private System.Single _minAngleY
    void _set__minAngleY(float value);
    // Get instance field: private System.Single _maxAngleY
    float _get__maxAngleY();
    // Set instance field: private System.Single _maxAngleY
    void _set__maxAngleY(float value);
    // Get instance field: private UnityEngine.GameObject _activeObjectWhenInsideSafeArea
    UnityEngine::GameObject* _get__activeObjectWhenInsideSafeArea();
    // Set instance field: private UnityEngine.GameObject _activeObjectWhenInsideSafeArea
    void _set__activeObjectWhenInsideSafeArea(UnityEngine::GameObject* value);
    // Get instance field: private UnityEngine.GameObject _activeObjectWhenNotInsideSafeArea
    UnityEngine::GameObject* _get__activeObjectWhenNotInsideSafeArea();
    // Set instance field: private UnityEngine.GameObject _activeObjectWhenNotInsideSafeArea
    void _set__activeObjectWhenNotInsideSafeArea(UnityEngine::GameObject* value);
    // Get instance field: private UnityEngine.RectTransform _rectTransformToCheck
    UnityEngine::RectTransform* _get__rectTransformToCheck();
    // Set instance field: private UnityEngine.RectTransform _rectTransformToCheck
    void _set__rectTransformToCheck(UnityEngine::RectTransform* value);
    // Get instance field: private readonly UnityEngine.Vector3[] _corners
    ::Array<UnityEngine::Vector3>* _get__corners();
    // Set instance field: private readonly UnityEngine.Vector3[] _corners
    void _set__corners(::Array<UnityEngine::Vector3>* value);
    // Get instance field: private readonly MainCamera _mainCamera
    GlobalNamespace::MainCamera* _get__mainCamera();
    // Set instance field: private readonly MainCamera _mainCamera
    void _set__mainCamera(GlobalNamespace::MainCamera* value);
    // Get instance field: private readonly SafeAreaRectChecker/InitData _initData
    GlobalNamespace::SafeAreaRectChecker::InitData* _get__initData();
    // Set instance field: private readonly SafeAreaRectChecker/InitData _initData
    void _set__initData(GlobalNamespace::SafeAreaRectChecker::InitData* value);
    // public System.Void Start()
    // Offset: 0x114F178
    void Start();
    // protected System.Void Update()
    // Offset: 0x114F1EC
    void Update();
    // public System.Void .ctor()
    // Offset: 0x114F428
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SafeAreaRectChecker* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::SafeAreaRectChecker::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SafeAreaRectChecker*, creationType>()));
    }
  }; // SafeAreaRectChecker
  #pragma pack(pop)
  static check_size<sizeof(SafeAreaRectChecker), 80 + sizeof(GlobalNamespace::SafeAreaRectChecker::InitData*)> __GlobalNamespace_SafeAreaRectCheckerSizeCheck;
  static_assert(sizeof(SafeAreaRectChecker) == 0x58);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SafeAreaRectChecker*, "", "SafeAreaRectChecker");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::SafeAreaRectChecker::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::SafeAreaRectChecker::*)()>(&GlobalNamespace::SafeAreaRectChecker::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SafeAreaRectChecker*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SafeAreaRectChecker::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::SafeAreaRectChecker::*)()>(&GlobalNamespace::SafeAreaRectChecker::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SafeAreaRectChecker*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SafeAreaRectChecker::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
