// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Skipping declaration: Vector3 because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: SafeAreaRectChecker
  class SafeAreaRectChecker : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::SafeAreaRectChecker::InitData
    class InitData;
    // private System.Single _minAngleX
    // Offset: 0x18
    float minAngleX;
    // private System.Single _maxAngleX
    // Offset: 0x1C
    float maxAngleX;
    // private System.Single _minAngleY
    // Offset: 0x20
    float minAngleY;
    // private System.Single _maxAngleY
    // Offset: 0x24
    float maxAngleY;
    // private UnityEngine.Transform _cameraTransform
    // Offset: 0x28
    UnityEngine::Transform* cameraTransform;
    // private UnityEngine.GameObject _activeObjectWhenInsideSafeArea
    // Offset: 0x30
    UnityEngine::GameObject* activeObjectWhenInsideSafeArea;
    // private UnityEngine.GameObject _activeObjectWhenNotInsideSafeArea
    // Offset: 0x38
    UnityEngine::GameObject* activeObjectWhenNotInsideSafeArea;
    // private UnityEngine.RectTransform _rectTransformToCheck
    // Offset: 0x40
    UnityEngine::RectTransform* rectTransformToCheck;
    // private UnityEngine.Vector3[] _corners
    // Offset: 0x48
    ::Array<UnityEngine::Vector3>* corners;
    // private SafeAreaRectChecker/InitData _initData
    // Offset: 0x50
    GlobalNamespace::SafeAreaRectChecker::InitData* initData;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void Start()
    // Offset: 0xC2A8C8
    void Start();
    // protected System.Void Update()
    // Offset: 0xC2A93C
    void Update();
    // public System.Void .ctor()
    // Offset: 0xC2AB6C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static SafeAreaRectChecker* New_ctor();
  }; // SafeAreaRectChecker
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SafeAreaRectChecker*, "", "SafeAreaRectChecker");
#pragma pack(pop)
