// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ScoreController
  class ScoreController;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x38
  // Autogenerated type: ScoreUIController
  // [] Offset: FFFFFFFF
  class ScoreUIController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::ScoreUIController::InitData
    class InitData;
    // Nested type: GlobalNamespace::ScoreUIController::ScoreDisplayType
    struct ScoreDisplayType;
    // private TMPro.TextMeshProUGUI _scoreText
    // Size: 0x8
    // Offset: 0x18
    TMPro::TextMeshProUGUI* scoreText;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshProUGUI*) == 0x8);
    // [InjectOptionalAttribute] Offset: 0xDC7C40
    // private ScoreUIController/InitData _initData
    // Size: 0x8
    // Offset: 0x20
    GlobalNamespace::ScoreUIController::InitData* initData;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ScoreUIController::InitData*) == 0x8);
    // [InjectAttribute] Offset: 0xDC7C50
    // private ScoreController _scoreController
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::ScoreController* scoreController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ScoreController*) == 0x8);
    // private System.Text.StringBuilder _stringBuilder
    // Size: 0x8
    // Offset: 0x30
    System::Text::StringBuilder* stringBuilder;
    // Field size check
    static_assert(sizeof(System::Text::StringBuilder*) == 0x8);
    // Creating value type constructor for type: ScoreUIController
    ScoreUIController(TMPro::TextMeshProUGUI* scoreText_ = {}, GlobalNamespace::ScoreUIController::InitData* initData_ = {}, GlobalNamespace::ScoreController* scoreController_ = {}, System::Text::StringBuilder* stringBuilder_ = {}) noexcept : scoreText{scoreText_}, initData{initData_}, scoreController{scoreController_}, stringBuilder{stringBuilder_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Int32 kMaxNumberOfDigits
    static constexpr const int kMaxNumberOfDigits = 9;
    // Get static field: static private System.Int32 kMaxNumberOfDigits
    static int _get_kMaxNumberOfDigits();
    // Set static field: static private System.Int32 kMaxNumberOfDigits
    static void _set_kMaxNumberOfDigits(int value);
    // protected System.Void Start()
    // Offset: 0xFC8E9C
    void Start();
    // protected System.Void OnEnable()
    // Offset: 0xFC923C
    void OnEnable();
    // protected System.Void OnDisable()
    // Offset: 0xFC9240
    void OnDisable();
    // private System.Void RegisterForEvents()
    // Offset: 0xFC8F20
    void RegisterForEvents();
    // private System.Void UnregisterFromEvents()
    // Offset: 0xFC9244
    void UnregisterFromEvents();
    // private System.Void HandleScoreDidChangeRealtime(System.Int32 rawScore, System.Int32 modifiedScore)
    // Offset: 0xFC931C
    void HandleScoreDidChangeRealtime(int rawScore, int modifiedScore);
    // protected System.Void UpdateScore(System.Int32 rawScore, System.Int32 modifiedScore)
    // Offset: 0xFC9034
    void UpdateScore(int rawScore, int modifiedScore);
    // private System.Void Append000Number(System.Text.StringBuilder stringBuilder, System.Int32 number)
    // Offset: 0xFC9320
    void Append000Number(System::Text::StringBuilder* stringBuilder, int number);
    // public System.Void .ctor()
    // Offset: 0xFC93D0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ScoreUIController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("GlobalNamespace").WithContext("ScoreUIController").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ScoreUIController*, creationType>()));
    }
  }; // ScoreUIController
  static check_size<sizeof(ScoreUIController), 48 + sizeof(System::Text::StringBuilder*)> __GlobalNamespace_ScoreUIControllerSizeCheck;
  static_assert(sizeof(ScoreUIController) == 0x38);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ScoreUIController*, "", "ScoreUIController");
#pragma pack(pop)
