// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IScoreController
#include "GlobalNamespace/IScoreController.hpp"
// Including type: GoodCutScoringElement
#include "GlobalNamespace/GoodCutScoringElement.hpp"
// Including type: BadCutScoringElement
#include "GlobalNamespace/BadCutScoringElement.hpp"
// Including type: MissScoringElement
#include "GlobalNamespace/MissScoringElement.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GameplayModifiersModelSO
  class GameplayModifiersModelSO;
  // Forward declaring type: GameplayModifiers
  class GameplayModifiers;
  // Forward declaring type: BeatmapObjectManager
  class BeatmapObjectManager;
  // Forward declaring type: IGameEnergyCounter
  class IGameEnergyCounter;
  // Forward declaring type: AudioTimeSyncController
  class AudioTimeSyncController;
  // Forward declaring type: PlayerHeadAndObstacleInteraction
  class PlayerHeadAndObstacleInteraction;
  // Skipping declaration: ScoringElement because it is already included!
  // Forward declaring type: GameplayModifierParamsSO
  class GameplayModifierParamsSO;
  // Skipping declaration: ScoreMultiplierCounter because it is already included!
  // Forward declaring type: NoteController
  class NoteController;
  // Forward declaring type: NoteCutInfo
  struct NoteCutInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: ScoreController
  class ScoreController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::ScoreController);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::ScoreController*, "", "ScoreController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: ScoreController
  // [TokenAttribute] Offset: FFFFFFFF
  class ScoreController : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IScoreController*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private GameplayModifiersModelSO _gameplayModifiersModel
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::GameplayModifiersModelSO* gameplayModifiersModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameplayModifiersModelSO*) == 0x8);
    // [InjectAttribute] Offset: 0x125616C
    // private readonly GameplayModifiers _gameplayModifiers
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::GameplayModifiers* gameplayModifiers;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GameplayModifiers*) == 0x8);
    // [InjectAttribute] Offset: 0x125617C
    // private readonly BeatmapObjectManager _beatmapObjectManager
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::BeatmapObjectManager* beatmapObjectManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapObjectManager*) == 0x8);
    // [InjectAttribute] Offset: 0x125618C
    // private readonly IGameEnergyCounter _gameEnergyCounter
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::IGameEnergyCounter* gameEnergyCounter;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IGameEnergyCounter*) == 0x8);
    // [InjectAttribute] Offset: 0x125619C
    // private readonly AudioTimeSyncController _audioTimeSyncController
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::AudioTimeSyncController* audioTimeSyncController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AudioTimeSyncController*) == 0x8);
    // [InjectAttribute] Offset: 0x12561AC
    // private readonly GoodCutScoringElement/Pool _goodCutScoringElementPool
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::GoodCutScoringElement::Pool* goodCutScoringElementPool;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GoodCutScoringElement::Pool*) == 0x8);
    // [InjectAttribute] Offset: 0x12561BC
    // private readonly BadCutScoringElement/Pool _badCutScoringElementPool
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::BadCutScoringElement::Pool* badCutScoringElementPool;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BadCutScoringElement::Pool*) == 0x8);
    // [InjectAttribute] Offset: 0x12561CC
    // private readonly MissScoringElement/Pool _missScoringElementPool
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::MissScoringElement::Pool* missScoringElementPool;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MissScoringElement::Pool*) == 0x8);
    // [InjectAttribute] Offset: 0x12561DC
    // private readonly PlayerHeadAndObstacleInteraction _playerHeadAndObstacleInteraction
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::PlayerHeadAndObstacleInteraction* playerHeadAndObstacleInteraction;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerHeadAndObstacleInteraction*) == 0x8);
    // private System.Action`2<System.Int32,System.Int32> scoreDidChangeEvent
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_2<int, int>* scoreDidChangeEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<int, int>*) == 0x8);
    // private System.Action`2<System.Int32,System.Single> multiplierDidChangeEvent
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_2<int, float>* multiplierDidChangeEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<int, float>*) == 0x8);
    // private System.Action`1<ScoringElement> scoringForNoteStartedEvent
    // Size: 0x8
    // Offset: 0x70
    ::System::Action_1<::GlobalNamespace::ScoringElement*>* scoringForNoteStartedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::ScoringElement*>*) == 0x8);
    // private System.Action`1<ScoringElement> scoringForNoteFinishedEvent
    // Size: 0x8
    // Offset: 0x78
    ::System::Action_1<::GlobalNamespace::ScoringElement*>* scoringForNoteFinishedEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::ScoringElement*>*) == 0x8);
    // private System.Collections.Generic.List`1<GameplayModifierParamsSO> _gameplayModifierParams
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::GlobalNamespace::GameplayModifierParamsSO*>* gameplayModifierParams;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::GameplayModifierParamsSO*>*) == 0x8);
    // private System.Int32 _modifiedScore
    // Size: 0x4
    // Offset: 0x88
    int modifiedScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _multipliedScore
    // Size: 0x4
    // Offset: 0x8C
    int multipliedScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _immediateMaxPossibleMultipliedScore
    // Size: 0x4
    // Offset: 0x90
    int immediateMaxPossibleMultipliedScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _immediateMaxPossibleModifiedScore
    // Size: 0x4
    // Offset: 0x94
    int immediateMaxPossibleModifiedScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _prevMultiplierFromModifiers
    // Size: 0x4
    // Offset: 0x98
    float prevMultiplierFromModifiers;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: prevMultiplierFromModifiers and: maxScoreMultiplierCounter
    char __padding18[0x4] = {};
    // private readonly ScoreMultiplierCounter _maxScoreMultiplierCounter
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::ScoreMultiplierCounter* maxScoreMultiplierCounter;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ScoreMultiplierCounter*) == 0x8);
    // private readonly ScoreMultiplierCounter _scoreMultiplierCounter
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::ScoreMultiplierCounter* scoreMultiplierCounter;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ScoreMultiplierCounter*) == 0x8);
    // private readonly System.Collections.Generic.List`1<System.Single> _sortedNoteTimesWithoutScoringElements
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<float>* sortedNoteTimesWithoutScoringElements;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<float>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<ScoringElement> _sortedScoringElementsWithoutMultiplier
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::List_1<::GlobalNamespace::ScoringElement*>* sortedScoringElementsWithoutMultiplier;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::ScoringElement*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<ScoringElement> _scoringElementsWithMultiplier
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::GlobalNamespace::ScoringElement*>* scoringElementsWithMultiplier;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::ScoringElement*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<ScoringElement> _scoringElementsToRemove
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::List_1<::GlobalNamespace::ScoringElement*>* scoringElementsToRemove;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::ScoringElement*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IScoreController
    operator ::GlobalNamespace::IScoreController() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IScoreController*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private GameplayModifiersModelSO _gameplayModifiersModel
    ::GlobalNamespace::GameplayModifiersModelSO*& dyn__gameplayModifiersModel();
    // Get instance field reference: private readonly GameplayModifiers _gameplayModifiers
    ::GlobalNamespace::GameplayModifiers*& dyn__gameplayModifiers();
