// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LanguageSettingsController
  class LanguageSettingsController;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: SelectLanguageViewController
  class SelectLanguageViewController : public HMUI::ViewController {
    public:
    // private UnityEngine.UI.Button _continueButton
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::UI::Button* continueButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private LanguageSettingsController _languageSettingsController
    // Size: 0x8
    // Offset: 0x78
    GlobalNamespace::LanguageSettingsController* languageSettingsController;
    // Field size check
    static_assert(sizeof(GlobalNamespace::LanguageSettingsController*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE26A1C
    // private System.Action didChangeLanguageEvent
    // Size: 0x8
    // Offset: 0x80
    System::Action* didChangeLanguageEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE26A2C
    // private System.Action didPressContinueButtonEvent
    // Size: 0x8
    // Offset: 0x88
    System::Action* didPressContinueButtonEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // Creating value type constructor for type: SelectLanguageViewController
    SelectLanguageViewController(UnityEngine::UI::Button* continueButton_ = {}, GlobalNamespace::LanguageSettingsController* languageSettingsController_ = {}, System::Action* didChangeLanguageEvent_ = {}, System::Action* didPressContinueButtonEvent_ = {}) noexcept : continueButton{continueButton_}, languageSettingsController{languageSettingsController_}, didChangeLanguageEvent{didChangeLanguageEvent_}, didPressContinueButtonEvent{didPressContinueButtonEvent_} {}
    // public System.Void add_didChangeLanguageEvent(System.Action value)
    // Offset: 0x10E8568
    void add_didChangeLanguageEvent(System::Action* value);
    // public System.Void remove_didChangeLanguageEvent(System.Action value)
    // Offset: 0x10E860C
    void remove_didChangeLanguageEvent(System::Action* value);
    // public System.Void add_didPressContinueButtonEvent(System.Action value)
    // Offset: 0x10E86B0
    void add_didPressContinueButtonEvent(System::Action* value);
    // public System.Void remove_didPressContinueButtonEvent(System.Action value)
    // Offset: 0x10E8754
    void remove_didPressContinueButtonEvent(System::Action* value);
    // private System.Void HandleLanguageSettingsControllerOndropDownValueDidChange()
    // Offset: 0x10E89C0
    void HandleLanguageSettingsControllerOndropDownValueDidChange();
    // private System.Void <DidActivate>b__8_0()
    // Offset: 0x10E89DC
    void $DidActivate$b__8_0();
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0x10E87F8
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // protected override System.Void OnDestroy()
    // Offset: 0x10E88E0
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::OnDestroy()
    void OnDestroy();
    // public System.Void .ctor()
    // Offset: 0x10E89D4
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SelectLanguageViewController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::SelectLanguageViewController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SelectLanguageViewController*, creationType>()));
    }
  }; // SelectLanguageViewController
  #pragma pack(pop)
  static check_size<sizeof(SelectLanguageViewController), 136 + sizeof(System::Action*)> __GlobalNamespace_SelectLanguageViewControllerSizeCheck;
  static_assert(sizeof(SelectLanguageViewController) == 0x90);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SelectLanguageViewController*, "", "SelectLanguageViewController");
