// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: InputFieldView
  class InputFieldView;
  // Forward declaring type: UIKeyboard
  class UIKeyboard;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: INetworkPlayer
  class INetworkPlayer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: ServerPasswordEntryViewController
  // [] Offset: FFFFFFFF
  class ServerPasswordEntryViewController : public HMUI::ViewController {
    public:
    // [HeaderAttribute] Offset: 0xDD0F18
    // private HMUI.InputFieldView _passwordInput
    // Size: 0x8
    // Offset: 0x70
    HMUI::InputFieldView* passwordInput;
    // Field size check
    static_assert(sizeof(HMUI::InputFieldView*) == 0x8);
    // private HMUI.UIKeyboard _uiKeyboard
    // Size: 0x8
    // Offset: 0x78
    HMUI::UIKeyboard* uiKeyboard;
    // Field size check
    static_assert(sizeof(HMUI::UIKeyboard*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDD0F74
    // private System.Action`2<INetworkPlayer,System.String> didFinishEvent
    // Size: 0x8
    // Offset: 0x80
    System::Action_2<GlobalNamespace::INetworkPlayer*, ::Il2CppString*>* didFinishEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::INetworkPlayer*, ::Il2CppString*>*) == 0x8);
    // private INetworkPlayer _selectedNetworkPlayer
    // Size: 0x8
    // Offset: 0x88
    GlobalNamespace::INetworkPlayer* selectedNetworkPlayer;
    // Field size check
    static_assert(sizeof(GlobalNamespace::INetworkPlayer*) == 0x8);
    // Creating value type constructor for type: ServerPasswordEntryViewController
    ServerPasswordEntryViewController(HMUI::InputFieldView* passwordInput_ = {}, HMUI::UIKeyboard* uiKeyboard_ = {}, System::Action_2<GlobalNamespace::INetworkPlayer*, ::Il2CppString*>* didFinishEvent_ = {}, GlobalNamespace::INetworkPlayer* selectedNetworkPlayer_ = {}) noexcept : passwordInput{passwordInput_}, uiKeyboard{uiKeyboard_}, didFinishEvent{didFinishEvent_}, selectedNetworkPlayer{selectedNetworkPlayer_} {}
    // public System.Void add_didFinishEvent(System.Action`2<INetworkPlayer,System.String> value)
    // Offset: 0xFCADD8
    void add_didFinishEvent(System::Action_2<GlobalNamespace::INetworkPlayer*, ::Il2CppString*>* value);
    // public System.Void remove_didFinishEvent(System.Action`2<INetworkPlayer,System.String> value)
    // Offset: 0xFCAE7C
    void remove_didFinishEvent(System::Action_2<GlobalNamespace::INetworkPlayer*, ::Il2CppString*>* value);
    // public System.Void Setup(INetworkPlayer selectedPlayer)
    // Offset: 0xFCAF20
    void Setup(GlobalNamespace::INetworkPlayer* selectedPlayer);
    // private System.Void HandleJoinClicked()
    // Offset: 0xFCB0A8
    void HandleJoinClicked();
    // private System.Void HandleUIKeyboardOkButtonWasPressed()
    // Offset: 0xFCB11C
    void HandleUIKeyboardOkButtonWasPressed();
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0xFCAF28
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // protected override System.Void DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    // Offset: 0xFCAFF0
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    void DidDeactivate(bool removedFromHierarchy, bool screenSystemDisabling);
    // public System.Void .ctor()
    // Offset: 0xFCB190
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ServerPasswordEntryViewController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::ServerPasswordEntryViewController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ServerPasswordEntryViewController*, creationType>()));
    }
  }; // ServerPasswordEntryViewController
  static check_size<sizeof(ServerPasswordEntryViewController), 136 + sizeof(GlobalNamespace::INetworkPlayer*)> __GlobalNamespace_ServerPasswordEntryViewControllerSizeCheck;
  static_assert(sizeof(ServerPasswordEntryViewController) == 0x90);
}
#pragma pack(pop)
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::ServerPasswordEntryViewController*, "", "ServerPasswordEntryViewController");
