// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: SaberType
#include "GlobalNamespace/SaberType.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SaberTypeObject
  class SaberTypeObject;
  // Forward declaring type: ColorManager
  class ColorManager;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x44
  #pragma pack(push, 1)
  // Autogenerated type: SetSaberGlowColor
  // [TokenAttribute] Offset: FFFFFFFF
  class SetSaberGlowColor : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::SetSaberGlowColor::PropertyTintColorPair
    class PropertyTintColorPair;
    // [NullAllowed] Offset: 0xE3C46C
    // private SaberTypeObject _saberTypeObject
    // Size: 0x8
    // Offset: 0x18
    GlobalNamespace::SaberTypeObject* saberTypeObject;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SaberTypeObject*) == 0x8);
    // private UnityEngine.MeshRenderer _meshRenderer
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::MeshRenderer* meshRenderer;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshRenderer*) == 0x8);
    // [NullAllowed] Offset: 0xE3C4B4
    // private SetSaberGlowColor/PropertyTintColorPair[] _propertyTintColorPairs
    // Size: 0x8
    // Offset: 0x28
    ::Array<GlobalNamespace::SetSaberGlowColor::PropertyTintColorPair*>* propertyTintColorPairs;
    // Field size check
    static_assert(sizeof(::Array<GlobalNamespace::SetSaberGlowColor::PropertyTintColorPair*>*) == 0x8);
    // [InjectAttribute] Offset: 0xE3C4EC
    // private ColorManager _colorManager
    // Size: 0x8
    // Offset: 0x30
    GlobalNamespace::ColorManager* colorManager;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ColorManager*) == 0x8);
    // private UnityEngine.MaterialPropertyBlock _materialPropertyBlock
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::MaterialPropertyBlock* materialPropertyBlock;
    // Field size check
    static_assert(sizeof(UnityEngine::MaterialPropertyBlock*) == 0x8);
    // private SaberType _saberType
    // Size: 0x4
    // Offset: 0x40
    GlobalNamespace::SaberType saberType;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SaberType) == 0x4);
    // Creating value type constructor for type: SetSaberGlowColor
    SetSaberGlowColor(GlobalNamespace::SaberTypeObject* saberTypeObject_ = {}, UnityEngine::MeshRenderer* meshRenderer_ = {}, ::Array<GlobalNamespace::SetSaberGlowColor::PropertyTintColorPair*>* propertyTintColorPairs_ = {}, GlobalNamespace::ColorManager* colorManager_ = {}, UnityEngine::MaterialPropertyBlock* materialPropertyBlock_ = {}, GlobalNamespace::SaberType saberType_ = {}) noexcept : saberTypeObject{saberTypeObject_}, meshRenderer{meshRenderer_}, propertyTintColorPairs{propertyTintColorPairs_}, colorManager{colorManager_}, materialPropertyBlock{materialPropertyBlock_}, saberType{saberType_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field: private SaberTypeObject _saberTypeObject
    GlobalNamespace::SaberTypeObject* _get__saberTypeObject();
    // Set instance field: private SaberTypeObject _saberTypeObject
    void _set__saberTypeObject(GlobalNamespace::SaberTypeObject* value);
    // Get instance field: private UnityEngine.MeshRenderer _meshRenderer
    UnityEngine::MeshRenderer* _get__meshRenderer();
    // Set instance field: private UnityEngine.MeshRenderer _meshRenderer
    void _set__meshRenderer(UnityEngine::MeshRenderer* value);
    // Get instance field: private SetSaberGlowColor/PropertyTintColorPair[] _propertyTintColorPairs
    ::Array<GlobalNamespace::SetSaberGlowColor::PropertyTintColorPair*>* _get__propertyTintColorPairs();
    // Set instance field: private SetSaberGlowColor/PropertyTintColorPair[] _propertyTintColorPairs
    void _set__propertyTintColorPairs(::Array<GlobalNamespace::SetSaberGlowColor::PropertyTintColorPair*>* value);
    // Get instance field: private ColorManager _colorManager
    GlobalNamespace::ColorManager* _get__colorManager();
    // Set instance field: private ColorManager _colorManager
    void _set__colorManager(GlobalNamespace::ColorManager* value);
    // Get instance field: private UnityEngine.MaterialPropertyBlock _materialPropertyBlock
    UnityEngine::MaterialPropertyBlock* _get__materialPropertyBlock();
    // Set instance field: private UnityEngine.MaterialPropertyBlock _materialPropertyBlock
    void _set__materialPropertyBlock(UnityEngine::MaterialPropertyBlock* value);
    // Get instance field: private SaberType _saberType
    GlobalNamespace::SaberType _get__saberType();
    // Set instance field: private SaberType _saberType
    void _set__saberType(GlobalNamespace::SaberType value);
    // public System.Void set_saberType(SaberType value)
    // Offset: 0x1077A70
    void set_saberType(GlobalNamespace::SaberType value);
    // protected System.Void Start()
    // Offset: 0x1077BC0
    void Start();
    // private System.Void SetColors()
    // Offset: 0x1077A7C
    void SetColors();
    // public System.Void .ctor()
    // Offset: 0x1077C50
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SetSaberGlowColor* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::SetSaberGlowColor::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SetSaberGlowColor*, creationType>()));
    }
  }; // SetSaberGlowColor
  #pragma pack(pop)
  static check_size<sizeof(SetSaberGlowColor), 64 + sizeof(GlobalNamespace::SaberType)> __GlobalNamespace_SetSaberGlowColorSizeCheck;
  static_assert(sizeof(SetSaberGlowColor) == 0x44);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SetSaberGlowColor*, "", "SetSaberGlowColor");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::SetSaberGlowColor::set_saberType
// Il2CppName: set_saberType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::SetSaberGlowColor::*)(GlobalNamespace::SaberType)>(&GlobalNamespace::SetSaberGlowColor::set_saberType)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("", "SaberType")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SetSaberGlowColor*), "set_saberType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SetSaberGlowColor::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::SetSaberGlowColor::*)()>(&GlobalNamespace::SetSaberGlowColor::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SetSaberGlowColor*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SetSaberGlowColor::SetColors
// Il2CppName: SetColors
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::SetSaberGlowColor::*)()>(&GlobalNamespace::SetSaberGlowColor::SetColors)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SetSaberGlowColor*), "SetColors", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SetSaberGlowColor::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
