// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: ShadowFollowController
  class ShadowFollowController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::ShadowFollowController);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::ShadowFollowController*, "", "ShadowFollowController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: ShadowFollowController
  // [TokenAttribute] Offset: FFFFFFFF
  class ShadowFollowController : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Transform _shadowTransform
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Transform* shadowTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [NullAllowed] Offset: 0x111B248
    // private UnityEngine.Transform _targetTransform
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* targetTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.SpriteRenderer _shadowSpriteRenderer
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::SpriteRenderer* shadowSpriteRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpriteRenderer*) == 0x8);
    // [SpaceAttribute] Offset: 0x111B290
    // private UnityEngine.Vector2 _shadowHeightRange
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Vector2 shadowHeightRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 _shadowSizeRange
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Vector2 shadowSizeRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 _shadowAlphaRange
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Vector2 shadowAlphaRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Transform _shadowTransform
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn__shadowTransform();
    // Get instance field reference: private UnityEngine.Transform _targetTransform
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn__targetTransform();
    // Get instance field reference: private UnityEngine.SpriteRenderer _shadowSpriteRenderer
    [[deprecated("Use field access instead!")]] ::UnityEngine::SpriteRenderer*& dyn__shadowSpriteRenderer();
    // Get instance field reference: private UnityEngine.Vector2 _shadowHeightRange
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn__shadowHeightRange();
    // Get instance field reference: private UnityEngine.Vector2 _shadowSizeRange
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn__shadowSizeRange();
    // Get instance field reference: private UnityEngine.Vector2 _shadowAlphaRange
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn__shadowAlphaRange();
    // public System.Void .ctor()
    // Offset: 0x1477788
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ShadowFollowController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::ShadowFollowController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ShadowFollowController*, creationType>()));
    }
    // public System.Void SetTargetTransform(UnityEngine.Transform target)
    // Offset: 0x14775E4
    void SetTargetTransform(::UnityEngine::Transform* target);
    // protected System.Void Update()
    // Offset: 0x14775EC
    void Update();
  }; // ShadowFollowController
  #pragma pack(pop)
  static check_size<sizeof(ShadowFollowController), 64 + sizeof(::UnityEngine::Vector2)> __GlobalNamespace_ShadowFollowControllerSizeCheck;
  static_assert(sizeof(ShadowFollowController) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::ShadowFollowController::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::ShadowFollowController::SetTargetTransform
// Il2CppName: SetTargetTransform
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ShadowFollowController::*)(::UnityEngine::Transform*)>(&GlobalNamespace::ShadowFollowController::SetTargetTransform)> {
  static const MethodInfo* get() {
    static auto* target = &::il2cpp_utils::GetClassFromName("UnityEngine", "Transform")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ShadowFollowController*), "SetTargetTransform", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{target});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::ShadowFollowController::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ShadowFollowController::*)()>(&GlobalNamespace::ShadowFollowController::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ShadowFollowController*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
