// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: SimpleTemporalFiltering
  class SimpleTemporalFiltering : public ::Il2CppObject {
    public:
    // private UnityEngine.RenderTexture[] _temporalFilteringTextures
    // Size: 0x8
    // Offset: 0x10
    ::Array<UnityEngine::RenderTexture*>* temporalFilteringTextures;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::RenderTexture*>*) == 0x8);
    // private System.Int32 _prevTemporalFilteringTextureIdx
    // Size: 0x4
    // Offset: 0x18
    int prevTemporalFilteringTextureIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: prevTemporalFilteringTextureIdx and: temporalFilteringMaterial
    char __padding1[0x4] = {};
    // private UnityEngine.Material _temporalFilteringMaterial
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::Material* temporalFilteringMaterial;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // private System.Int32 _bufferTexID
    // Size: 0x4
    // Offset: 0x28
    int bufferTexID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: SimpleTemporalFiltering
    SimpleTemporalFiltering(::Array<UnityEngine::RenderTexture*>* temporalFilteringTextures_ = {}, int prevTemporalFilteringTextureIdx_ = {}, UnityEngine::Material* temporalFilteringMaterial_ = {}, int bufferTexID_ = {}) noexcept : temporalFilteringTextures{temporalFilteringTextures_}, prevTemporalFilteringTextureIdx{prevTemporalFilteringTextureIdx_}, temporalFilteringMaterial{temporalFilteringMaterial_}, bufferTexID{bufferTexID_} {}
    // public UnityEngine.RenderTexture FilterTexture(UnityEngine.RenderTexture src)
    // Offset: 0x2349AC0
    UnityEngine::RenderTexture* FilterTexture(UnityEngine::RenderTexture* src);
    // private System.Void CreateRenderTexturesIfNeeded(System.Int32 width, System.Int32 height)
    // Offset: 0x2349C68
    void CreateRenderTexturesIfNeeded(int width, int height);
    // public System.Void .ctor()
    // Offset: 0x2349A0C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SimpleTemporalFiltering* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::SimpleTemporalFiltering::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SimpleTemporalFiltering*, creationType>()));
    }
  }; // SimpleTemporalFiltering
  #pragma pack(pop)
  static check_size<sizeof(SimpleTemporalFiltering), 40 + sizeof(int)> __GlobalNamespace_SimpleTemporalFilteringSizeCheck;
  static_assert(sizeof(SimpleTemporalFiltering) == 0x2C);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SimpleTemporalFiltering*, "", "SimpleTemporalFiltering");
