// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: MenuButton because it is already included!
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x98
  // Autogenerated type: SimpleRetailDemoViewController
  // [] Offset: FFFFFFFF
  class SimpleRetailDemoViewController : public HMUI::ViewController {
    public:
    // Nested type: GlobalNamespace::SimpleRetailDemoViewController::MenuButton
    struct MenuButton;
    // Size: 0x4
    // Autogenerated type: SimpleRetailDemoViewController/MenuButton
    // [] Offset: FFFFFFFF
    struct MenuButton/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: MenuButton
      constexpr MenuButton(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SimpleRetailDemoViewController/MenuButton PlayTutorial
      static constexpr const int PlayTutorial = 0;
      // Get static field: static public SimpleRetailDemoViewController/MenuButton PlayTutorial
      static GlobalNamespace::SimpleRetailDemoViewController::MenuButton _get_PlayTutorial();
      // Set static field: static public SimpleRetailDemoViewController/MenuButton PlayTutorial
      static void _set_PlayTutorial(GlobalNamespace::SimpleRetailDemoViewController::MenuButton value);
      // static field const value: static public SimpleRetailDemoViewController/MenuButton PlayLevel1
      static constexpr const int PlayLevel1 = 1;
      // Get static field: static public SimpleRetailDemoViewController/MenuButton PlayLevel1
      static GlobalNamespace::SimpleRetailDemoViewController::MenuButton _get_PlayLevel1();
      // Set static field: static public SimpleRetailDemoViewController/MenuButton PlayLevel1
      static void _set_PlayLevel1(GlobalNamespace::SimpleRetailDemoViewController::MenuButton value);
      // static field const value: static public SimpleRetailDemoViewController/MenuButton PlayLevel2
      static constexpr const int PlayLevel2 = 2;
      // Get static field: static public SimpleRetailDemoViewController/MenuButton PlayLevel2
      static GlobalNamespace::SimpleRetailDemoViewController::MenuButton _get_PlayLevel2();
      // Set static field: static public SimpleRetailDemoViewController/MenuButton PlayLevel2
      static void _set_PlayLevel2(GlobalNamespace::SimpleRetailDemoViewController::MenuButton value);
      // static field const value: static public SimpleRetailDemoViewController/MenuButton Exit
      static constexpr const int Exit = 3;
      // Get static field: static public SimpleRetailDemoViewController/MenuButton Exit
      static GlobalNamespace::SimpleRetailDemoViewController::MenuButton _get_Exit();
      // Set static field: static public SimpleRetailDemoViewController/MenuButton Exit
      static void _set_Exit(GlobalNamespace::SimpleRetailDemoViewController::MenuButton value);
    }; // SimpleRetailDemoViewController/MenuButton
    static check_size<sizeof(SimpleRetailDemoViewController::MenuButton), 0 + sizeof(int)> __GlobalNamespace_SimpleRetailDemoViewController_MenuButtonSizeCheck;
    static_assert(sizeof(SimpleRetailDemoViewController::MenuButton) == 0x4);
    // private UnityEngine.UI.Button _tutorialButton
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::UI::Button* tutorialButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _playLevel1Button
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::UI::Button* playLevel1Button;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _playLevel2Button
    // Size: 0x8
    // Offset: 0x80
    UnityEngine::UI::Button* playLevel2Button;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _exitButton
    // Size: 0x8
    // Offset: 0x88
    UnityEngine::UI::Button* exitButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDD170C
    // private System.Action`2<SimpleRetailDemoViewController,SimpleRetailDemoViewController/MenuButton> didFinishEvent
    // Size: 0x8
    // Offset: 0x90
    System::Action_2<GlobalNamespace::SimpleRetailDemoViewController*, GlobalNamespace::SimpleRetailDemoViewController::MenuButton>* didFinishEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<GlobalNamespace::SimpleRetailDemoViewController*, GlobalNamespace::SimpleRetailDemoViewController::MenuButton>*) == 0x8);
    // Creating value type constructor for type: SimpleRetailDemoViewController
    SimpleRetailDemoViewController(UnityEngine::UI::Button* tutorialButton_ = {}, UnityEngine::UI::Button* playLevel1Button_ = {}, UnityEngine::UI::Button* playLevel2Button_ = {}, UnityEngine::UI::Button* exitButton_ = {}, System::Action_2<GlobalNamespace::SimpleRetailDemoViewController*, GlobalNamespace::SimpleRetailDemoViewController::MenuButton>* didFinishEvent_ = {}) noexcept : tutorialButton{tutorialButton_}, playLevel1Button{playLevel1Button_}, playLevel2Button{playLevel2Button_}, exitButton{exitButton_}, didFinishEvent{didFinishEvent_} {}
    // public System.Void add_didFinishEvent(System.Action`2<SimpleRetailDemoViewController,SimpleRetailDemoViewController/MenuButton> value)
    // Offset: 0xFCF65C
    void add_didFinishEvent(System::Action_2<GlobalNamespace::SimpleRetailDemoViewController*, GlobalNamespace::SimpleRetailDemoViewController::MenuButton>* value);
    // public System.Void remove_didFinishEvent(System.Action`2<SimpleRetailDemoViewController,SimpleRetailDemoViewController/MenuButton> value)
    // Offset: 0xFCF820
    void remove_didFinishEvent(System::Action_2<GlobalNamespace::SimpleRetailDemoViewController*, GlobalNamespace::SimpleRetailDemoViewController::MenuButton>* value);
    // private System.Void HandleMenuButton(SimpleRetailDemoViewController/MenuButton menuButton)
    // Offset: 0xFD00D0
    void HandleMenuButton(GlobalNamespace::SimpleRetailDemoViewController::MenuButton menuButton);
    // private System.Void <DidActivate>b__8_0()
    // Offset: 0xFD0150
    void $DidActivate$b__8_0();
    // private System.Void <DidActivate>b__8_1()
    // Offset: 0xFD0158
    void $DidActivate$b__8_1();
    // private System.Void <DidActivate>b__8_2()
    // Offset: 0xFD0160
    void $DidActivate$b__8_2();
    // private System.Void <DidActivate>b__8_3()
    // Offset: 0xFD0168
    void $DidActivate$b__8_3();
    // protected override System.Void DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    // Offset: 0xFCFF4C
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::DidActivate(System.Boolean firstActivation, System.Boolean addedToHierarchy, System.Boolean screenSystemEnabling)
    void DidActivate(bool firstActivation, bool addedToHierarchy, bool screenSystemEnabling);
    // public System.Void .ctor()
    // Offset: 0xFD0148
    // Implemented from: HMUI.ViewController
    // Base method: System.Void ViewController::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SimpleRetailDemoViewController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::SimpleRetailDemoViewController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SimpleRetailDemoViewController*, creationType>()));
    }
  }; // SimpleRetailDemoViewController
  static check_size<sizeof(SimpleRetailDemoViewController), 144 + sizeof(System::Action_2<GlobalNamespace::SimpleRetailDemoViewController*, GlobalNamespace::SimpleRetailDemoViewController::MenuButton>*)> __GlobalNamespace_SimpleRetailDemoViewControllerSizeCheck;
  static_assert(sizeof(SimpleRetailDemoViewController) == 0x98);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SimpleRetailDemoViewController*, "", "SimpleRetailDemoViewController");
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SimpleRetailDemoViewController::MenuButton, "", "SimpleRetailDemoViewController/MenuButton");
#pragma pack(pop)
