// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: BeatmapObjectData
#include "GlobalNamespace/BeatmapObjectData.hpp"
// Including type: ColorType
#include "GlobalNamespace/ColorType.hpp"
// Including type: NoteLineLayer
#include "GlobalNamespace/NoteLineLayer.hpp"
// Including type: NoteCutDirection
#include "GlobalNamespace/NoteCutDirection.hpp"
// Including type: SliderMidAnchorMode
#include "GlobalNamespace/SliderMidAnchorMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: Type because it is already included!
  // Skipping declaration: BeatmapDataItem because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: SliderData
  class SliderData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::SliderData);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::SliderData*, "", "SliderData");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: SliderData
  // [TokenAttribute] Offset: FFFFFFFF
  class SliderData : public ::GlobalNamespace::BeatmapObjectData {
    public:
    // Nested type: ::GlobalNamespace::SliderData::Type
    struct Type;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: SliderData/Type
    // [TokenAttribute] Offset: FFFFFFFF
    struct Type/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Type
      constexpr Type(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SliderData/Type Normal
      static constexpr const int Normal = 0;
      // Get static field: static public SliderData/Type Normal
      static ::GlobalNamespace::SliderData::Type _get_Normal();
      // Set static field: static public SliderData/Type Normal
      static void _set_Normal(::GlobalNamespace::SliderData::Type value);
      // static field const value: static public SliderData/Type Burst
      static constexpr const int Burst = 1;
      // Get static field: static public SliderData/Type Burst
      static ::GlobalNamespace::SliderData::Type _get_Burst();
      // Set static field: static public SliderData/Type Burst
      static void _set_Burst(::GlobalNamespace::SliderData::Type value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // SliderData/Type
    #pragma pack(pop)
    static check_size<sizeof(SliderData::Type), 0 + sizeof(int)> __GlobalNamespace_SliderData_TypeSizeCheck;
    static_assert(sizeof(SliderData::Type) == 0x4);
    public:
    // private ColorType <colorType>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    ::GlobalNamespace::ColorType colorType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ColorType) == 0x4);
    // private SliderData/Type <sliderType>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    ::GlobalNamespace::SliderData::Type sliderType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SliderData::Type) == 0x4);
    // private System.Boolean <hasHeadNote>k__BackingField
    // Size: 0x1
    // Offset: 0x28
    bool hasHeadNote;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasHeadNote and: headControlPointLengthMultiplier
    char __padding2[0x3] = {};
    // private System.Single <headControlPointLengthMultiplier>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    float headControlPointLengthMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <headLineIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    int headLineIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private NoteLineLayer <headLineLayer>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    ::GlobalNamespace::NoteLineLayer headLineLayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteLineLayer) == 0x4);
    // private NoteLineLayer <headBeforeJumpLineLayer>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    ::GlobalNamespace::NoteLineLayer headBeforeJumpLineLayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteLineLayer) == 0x4);
    // private NoteCutDirection <headCutDirection>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    ::GlobalNamespace::NoteCutDirection headCutDirection;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteCutDirection) == 0x4);
    // private System.Single <headCutDirectionAngleOffset>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    float headCutDirectionAngleOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <hasTailNote>k__BackingField
    // Size: 0x1
    // Offset: 0x44
    bool hasTailNote;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasTailNote and: tailTime
    char __padding9[0x3] = {};
    // private System.Single <tailTime>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    float tailTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <tailLineIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x4C
    int tailLineIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <tailControlPointLengthMultiplier>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    float tailControlPointLengthMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private NoteLineLayer <tailLineLayer>k__BackingField
    // Size: 0x4
    // Offset: 0x54
    ::GlobalNamespace::NoteLineLayer tailLineLayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteLineLayer) == 0x4);
    // private NoteLineLayer <tailBeforeJumpLineLayer>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    ::GlobalNamespace::NoteLineLayer tailBeforeJumpLineLayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteLineLayer) == 0x4);
    // private NoteCutDirection <tailCutDirection>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    ::GlobalNamespace::NoteCutDirection tailCutDirection;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NoteCutDirection) == 0x4);
    // private System.Single <tailCutDirectionAngleOffset>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    float tailCutDirectionAngleOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private SliderMidAnchorMode <midAnchorMode>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    ::GlobalNamespace::SliderMidAnchorMode midAnchorMode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SliderMidAnchorMode) == 0x4);
    // private System.Int32 <sliceCount>k__BackingField
    // Size: 0x4
    // Offset: 0x68
    int sliceCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <squishAmount>k__BackingField
    // Size: 0x4
    // Offset: 0x6C
    float squishAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private ColorType <colorType>k__BackingField
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::ColorType& dyn_$colorType$k__BackingField();
    // Get instance field reference: private SliderData/Type <sliderType>k__BackingField
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SliderData::Type& dyn_$sliderType$k__BackingField();
    // Get instance field reference: private System.Boolean <hasHeadNote>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$hasHeadNote$k__BackingField();
    // Get instance field reference: private System.Single <headControlPointLengthMultiplier>k__BackingField
    [[deprecated("Use field access instead!")]] float& dyn_$headControlPointLengthMultiplier$k__BackingField();
