// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: SliderControllerBase
#include "GlobalNamespace/SliderControllerBase.hpp"
// Including type: IBeatmapObjectController
#include "GlobalNamespace/IBeatmapObjectController.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SliderData
  class SliderData;
  // Forward declaring type: SliderIntensityEffect
  class SliderIntensityEffect;
  // Forward declaring type: SliderMeshController
  class SliderMeshController;
  // Forward declaring type: SliderMovement
  class SliderMovement;
  // Forward declaring type: IBeatmapObjectSpawnController
  class IBeatmapObjectSpawnController;
  // Forward declaring type: ColorManager
  class ColorManager;
  // Forward declaring type: BeatmapObjectManager
  class BeatmapObjectManager;
  // Forward declaring type: SaberManager
  class SaberManager;
  // Forward declaring type: LazyCopyHashSet`1<T>
  template<typename T>
  class LazyCopyHashSet_1;
  // Forward declaring type: ISliderDidFinishJumpEvent
  class ISliderDidFinishJumpEvent;
  // Forward declaring type: ISliderDidStartDissolvingEvent
  class ISliderDidStartDissolvingEvent;
  // Forward declaring type: ISliderDidDissolveEvent
  class ISliderDidDissolveEvent;
  // Forward declaring type: ISliderHeadDidMovePastCutMarkEvent
  class ISliderHeadDidMovePastCutMarkEvent;
  // Forward declaring type: ISliderTailDidMovePastCutMarkEvent
  class ISliderTailDidMovePastCutMarkEvent;
  // Forward declaring type: Saber
  class Saber;
  // Forward declaring type: FixedUpdateVector3SmoothValue
  class FixedUpdateVector3SmoothValue;
  // Forward declaring type: ILazyCopyHashSet`1<T>
  template<typename T>
  class ILazyCopyHashSet_1;
  // Skipping declaration: LengthType because it is already included!
  // Forward declaring type: NoteData
  class NoteData;
  // Forward declaring type: NoteController
  class NoteController;
  // Forward declaring type: NoteCutInfo
  struct NoteCutInfo;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: SliderController
  class SliderController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::SliderController);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::SliderController*, "", "SliderController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: SliderController
  // [TokenAttribute] Offset: FFFFFFFF
  class SliderController : public ::GlobalNamespace::SliderControllerBase/*, public ::GlobalNamespace::IBeatmapObjectController*/ {
    public:
    // Writing base type padding for base size: 0x29 to desired offset: 0x30
    char ___base_padding[0x7] = {};
    // Nested type: ::GlobalNamespace::SliderController::LengthType
    struct LengthType;
    // Nested type: ::GlobalNamespace::SliderController::Pool
    class Pool;
    // Nested type: ::GlobalNamespace::SliderController::$DissolveCoroutine$d__70
    class $DissolveCoroutine$d__70;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: SliderController/LengthType
    // [TokenAttribute] Offset: FFFFFFFF
    struct LengthType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LengthType
      constexpr LengthType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SliderController/LengthType Short
      static constexpr const int Short = 0;
      // Get static field: static public SliderController/LengthType Short
      static ::GlobalNamespace::SliderController::LengthType _get_Short();
      // Set static field: static public SliderController/LengthType Short
      static void _set_Short(::GlobalNamespace::SliderController::LengthType value);
      // static field const value: static public SliderController/LengthType Medium
      static constexpr const int Medium = 1;
      // Get static field: static public SliderController/LengthType Medium
      static ::GlobalNamespace::SliderController::LengthType _get_Medium();
      // Set static field: static public SliderController/LengthType Medium
      static void _set_Medium(::GlobalNamespace::SliderController::LengthType value);
      // static field const value: static public SliderController/LengthType Long
      static constexpr const int Long = 2;
      // Get static field: static public SliderController/LengthType Long
      static ::GlobalNamespace::SliderController::LengthType _get_Long();
      // Set static field: static public SliderController/LengthType Long
      static void _set_Long(::GlobalNamespace::SliderController::LengthType value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // SliderController/LengthType
    #pragma pack(pop)
    static check_size<sizeof(SliderController::LengthType), 0 + sizeof(int)> __GlobalNamespace_SliderController_LengthTypeSizeCheck;
    static_assert(sizeof(SliderController::LengthType) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // protected SliderIntensityEffect _sliderIntensityEffect
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::SliderIntensityEffect* sliderIntensityEffect;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SliderIntensityEffect*) == 0x8);
    // private SliderMeshController _sliderMeshController
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::SliderMeshController* sliderMeshController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SliderMeshController*) == 0x8);
    // private SliderMovement _sliderMovement
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::SliderMovement* sliderMovement;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SliderMovement*) == 0x8);
    // [SpaceAttribute] Offset: 0x10B560C
    // private System.Single _closeInteractionSaberPosSmoothParam
    // Size: 0x4
    // Offset: 0x48
    float closeInteractionSaberPosSmoothParam;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: closeInteractionSaberPosSmoothParam and: beatmapObjectSpawnController
    char __padding3[0x4] = {};
    // [InjectAttribute] Offset: 0x10B5644
    // private readonly IBeatmapObjectSpawnController _beatmapObjectSpawnController
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::IBeatmapObjectSpawnController* beatmapObjectSpawnController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IBeatmapObjectSpawnController*) == 0x8);
    // [InjectAttribute] Offset: 0x10B5654
    // private readonly ColorManager _colorManager
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::ColorManager* colorManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ColorManager*) == 0x8);
    // [InjectAttribute] Offset: 0x10B5664
    // private readonly BeatmapObjectManager _beatmapObjectManager
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::BeatmapObjectManager* beatmapObjectManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapObjectManager*) == 0x8);
    // [InjectAttribute] Offset: 0x10B5674
    // private readonly SaberManager _saberManager
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::SaberManager* saberManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SaberManager*) == 0x8);
    // private readonly LazyCopyHashSet`1<ISliderDidFinishJumpEvent> _sliderDidFinishMovement
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderDidFinishJumpEvent*>* sliderDidFinishMovement;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderDidFinishJumpEvent*>*) == 0x8);
    // private readonly LazyCopyHashSet`1<ISliderDidStartDissolvingEvent> _sliderDidStartDissolving
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderDidStartDissolvingEvent*>* sliderDidStartDissolving;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderDidStartDissolvingEvent*>*) == 0x8);
    // private readonly LazyCopyHashSet`1<ISliderDidDissolveEvent> _sliderDidDissolve
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderDidDissolveEvent*>* sliderDidDissolve;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderDidDissolveEvent*>*) == 0x8);
    // private readonly LazyCopyHashSet`1<ISliderHeadDidMovePastCutMarkEvent> _sliderHeadDidMovePastCutMark
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderHeadDidMovePastCutMarkEvent*>* sliderHeadDidMovePastCutMark;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderHeadDidMovePastCutMarkEvent*>*) == 0x8);
    // private readonly LazyCopyHashSet`1<ISliderTailDidMovePastCutMarkEvent> _sliderTailDidMovePastCutMark
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderTailDidMovePastCutMarkEvent*>* sliderTailDidMovePastCutMark;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LazyCopyHashSet_1<::GlobalNamespace::ISliderTailDidMovePastCutMarkEvent*>*) == 0x8);
    // private SliderController/LengthType _lengthType
    // Size: 0x4
    // Offset: 0x98
    ::GlobalNamespace::SliderController::LengthType lengthType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SliderController::LengthType) == 0x4);
    // Padding between fields: lengthType and: sliderData
    char __padding13[0x4] = {};
    // private SliderData _sliderData
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::SliderData* sliderData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SliderData*) == 0x8);
    // private Saber _saber
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::Saber* saber;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::Saber*) == 0x8);
    // private System.Single _headJumpOffsetY
    // Size: 0x4
    // Offset: 0xB0
    float headJumpOffsetY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _sliderDuration
    // Size: 0x4
    // Offset: 0xB4
    float sliderDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _initColor
    // Size: 0x10
    // Offset: 0xB8
    ::UnityEngine::Color initColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean _attractingSaber
    // Size: 0x1
    // Offset: 0xC8
    bool attractingSaber;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: attractingSaber and: randomValue
    char __padding19[0x3] = {};
    // private System.Single _randomValue
    // Size: 0x4
    // Offset: 0xCC
    float randomValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _zDistanceBetweenNotes
    // Size: 0x4
    // Offset: 0xD0
    float zDistanceBetweenNotes;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _jumpDistance
    // Size: 0x4
    // Offset: 0xD4
    float jumpDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private FixedUpdateVector3SmoothValue _closeSmoothedSaberInteractionPos
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::FixedUpdateVector3SmoothValue* closeSmoothedSaberInteractionPos;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FixedUpdateVector3SmoothValue*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IBeatmapObjectController
    operator ::GlobalNamespace::IBeatmapObjectController() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IBeatmapObjectController*>(this);
    }
    // static field const value: static private System.Single kSaberAttractPointNormalizedPosition
    static constexpr const float kSaberAttractPointNormalizedPosition = 0.7;
    // Get static field: static private System.Single kSaberAttractPointNormalizedPosition
    static float _get_kSaberAttractPointNormalizedPosition();
    // Set static field: static private System.Single kSaberAttractPointNormalizedPosition
    static void _set_kSaberAttractPointNormalizedPosition(float value);
