// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: SongPreviewPlayer
#include "GlobalNamespace/SongPreviewPlayer.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x28
  #pragma pack(push, 1)
  // Autogenerated type: SongPreviewPlayer/AudioSourceParams
  // [TokenAttribute] Offset: FFFFFFFF
  class SongPreviewPlayer::AudioSourceParams : public ::Il2CppObject {
    public:
    // private UnityEngine.Vector3 _position
    // Size: 0xC
    // Offset: 0x10
    UnityEngine::Vector3 position;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [RangeAttribute] Offset: 0xE13BFC
    // private System.Single _reverbZoneMix
    // Size: 0x4
    // Offset: 0x1C
    float reverbZoneMix;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xE13C40
    // private System.Single _spatialBlend
    // Size: 0x4
    // Offset: 0x20
    float spatialBlend;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xE13C80
    // private System.Single _spread
    // Size: 0x4
    // Offset: 0x24
    float spread;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: AudioSourceParams
    AudioSourceParams(UnityEngine::Vector3 position_ = {}, float reverbZoneMix_ = {}, float spatialBlend_ = {}, float spread_ = {}) noexcept : position{position_}, reverbZoneMix{reverbZoneMix_}, spatialBlend{spatialBlend_}, spread{spread_} {}
    // Get instance field: private UnityEngine.Vector3 _position
    UnityEngine::Vector3 _get__position();
    // Set instance field: private UnityEngine.Vector3 _position
    void _set__position(UnityEngine::Vector3 value);
    // Get instance field: private System.Single _reverbZoneMix
    float _get__reverbZoneMix();
    // Set instance field: private System.Single _reverbZoneMix
    void _set__reverbZoneMix(float value);
    // Get instance field: private System.Single _spatialBlend
    float _get__spatialBlend();
    // Set instance field: private System.Single _spatialBlend
    void _set__spatialBlend(float value);
    // Get instance field: private System.Single _spread
    float _get__spread();
    // Set instance field: private System.Single _spread
    void _set__spread(float value);
    // public UnityEngine.Vector3 get_position()
    // Offset: 0x105C3E0
    UnityEngine::Vector3 get_position();
    // public System.Single get_reverbZoneMix()
    // Offset: 0x105C3EC
    float get_reverbZoneMix();
    // public System.Single get_spatialBlend()
    // Offset: 0x105C3F4
    float get_spatialBlend();
    // public System.Single get_spread()
    // Offset: 0x105C3FC
    float get_spread();
    // public System.Void .ctor()
    // Offset: 0x105C404
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SongPreviewPlayer::AudioSourceParams* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::SongPreviewPlayer::AudioSourceParams::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SongPreviewPlayer::AudioSourceParams*, creationType>()));
    }
  }; // SongPreviewPlayer/AudioSourceParams
  #pragma pack(pop)
  static check_size<sizeof(SongPreviewPlayer::AudioSourceParams), 36 + sizeof(float)> __GlobalNamespace_SongPreviewPlayer_AudioSourceParamsSizeCheck;
  static_assert(sizeof(SongPreviewPlayer::AudioSourceParams) == 0x28);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SongPreviewPlayer::AudioSourceParams*, "", "SongPreviewPlayer/AudioSourceParams");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::SongPreviewPlayer::AudioSourceParams::get_position
// Il2CppName: get_position
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<UnityEngine::Vector3 (GlobalNamespace::SongPreviewPlayer::AudioSourceParams::*)()>(&GlobalNamespace::SongPreviewPlayer::AudioSourceParams::get_position)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SongPreviewPlayer::AudioSourceParams*), "get_position", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SongPreviewPlayer::AudioSourceParams::get_reverbZoneMix
// Il2CppName: get_reverbZoneMix
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (GlobalNamespace::SongPreviewPlayer::AudioSourceParams::*)()>(&GlobalNamespace::SongPreviewPlayer::AudioSourceParams::get_reverbZoneMix)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SongPreviewPlayer::AudioSourceParams*), "get_reverbZoneMix", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SongPreviewPlayer::AudioSourceParams::get_spatialBlend
// Il2CppName: get_spatialBlend
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (GlobalNamespace::SongPreviewPlayer::AudioSourceParams::*)()>(&GlobalNamespace::SongPreviewPlayer::AudioSourceParams::get_spatialBlend)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SongPreviewPlayer::AudioSourceParams*), "get_spatialBlend", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SongPreviewPlayer::AudioSourceParams::get_spread
// Il2CppName: get_spread
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (GlobalNamespace::SongPreviewPlayer::AudioSourceParams::*)()>(&GlobalNamespace::SongPreviewPlayer::AudioSourceParams::get_spread)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SongPreviewPlayer::AudioSourceParams*), "get_spread", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SongPreviewPlayer::AudioSourceParams::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
