// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Slider
  class Slider;
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AudioTimeSyncController
  class AudioTimeSyncController;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: SongProgressUIController
  class SongProgressUIController : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.UI.Slider _slider
    // Offset: 0x18
    UnityEngine::UI::Slider* slider;
    // private UnityEngine.UI.Image _progressImage
    // Offset: 0x20
    UnityEngine::UI::Image* progressImage;
    // private TMPro.TextMeshProUGUI _durationMinutesText
    // Offset: 0x28
    TMPro::TextMeshProUGUI* durationMinutesText;
    // private TMPro.TextMeshProUGUI _durationSecondsText
    // Offset: 0x30
    TMPro::TextMeshProUGUI* durationSecondsText;
    // private TMPro.TextMeshProUGUI _progressMinutesText
    // Offset: 0x38
    TMPro::TextMeshProUGUI* progressMinutesText;
    // private TMPro.TextMeshProUGUI _progressSecondsText
    // Offset: 0x40
    TMPro::TextMeshProUGUI* progressSecondsText;
    // private AudioTimeSyncController _audioTimeSyncController
    // Offset: 0x48
    GlobalNamespace::AudioTimeSyncController* audioTimeSyncController;
    // private System.Int32 _prevMinutes
    // Offset: 0x50
    int prevMinutes;
    // private System.Int32 _prevSeconds
    // Offset: 0x54
    int prevSeconds;
    // private System.Text.StringBuilder _stringBuilder
    // Offset: 0x58
    System::Text::StringBuilder* stringBuilder;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Start()
    // Offset: 0xB9CD5C
    void Start();
    // protected System.Void Update()
    // Offset: 0xB9CE6C
    void Update();
    // public System.Void .ctor()
    // Offset: 0xB9D030
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static SongProgressUIController* New_ctor();
  }; // SongProgressUIController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SongProgressUIController*, "", "SongProgressUIController");
#pragma pack(pop)
