// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: TubeBloomPrePassLight
  class TubeBloomPrePassLight;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: SpawnLaserAnimation
  class SpawnLaserAnimation : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.Transform _centerThresholdTransform
    // Offset: 0x18
    UnityEngine::Transform* centerThresholdTransform;
    // private UnityEngine.Transform _horizontalLasersTransform
    // Offset: 0x20
    UnityEngine::Transform* horizontalLasersTransform;
    // private TubeBloomPrePassLight _leftHorizontalLaser
    // Offset: 0x28
    GlobalNamespace::TubeBloomPrePassLight* leftHorizontalLaser;
    // private TubeBloomPrePassLight _rightHorizontalLaser
    // Offset: 0x30
    GlobalNamespace::TubeBloomPrePassLight* rightHorizontalLaser;
    // public System.Single _normalizedDistance
    // Offset: 0x38
    float normalizedDistance;
    // public System.Single _alphaMultiplier
    // Offset: 0x3C
    float alphaMultiplier;
    // public System.Single _laserLength
    // Offset: 0x40
    float laserLength;
    // private System.Single _centerDistance
    // Offset: 0x44
    float centerDistance;
    // private System.Boolean _initialized
    // Offset: 0x48
    bool initialized;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // private System.Void InitIfNeeded()
    // Offset: 0x1FF5168
    void InitIfNeeded();
    // protected System.Void LateUpdate()
    // Offset: 0x1FF5238
    void LateUpdate();
    // public System.Void .ctor()
    // Offset: 0x1FF53A8
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static SpawnLaserAnimation* New_ctor();
  }; // SpawnLaserAnimation
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SpawnLaserAnimation*, "", "SpawnLaserAnimation");
#pragma pack(pop)
