// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: LightWithIdMonoBehaviour
#include "GlobalNamespace/LightWithIdMonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
  // Forward declaring type: Color
  struct Color;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: SpriteLightWithId
  class SpriteLightWithId : public GlobalNamespace::LightWithIdMonoBehaviour {
    public:
    // private UnityEngine.SpriteRenderer _spriteRenderer
    // Offset: 0x30
    UnityEngine::SpriteRenderer* spriteRenderer;
    // private System.Boolean _hideIfAlphaOutOfRange
    // Offset: 0x38
    bool hideIfAlphaOutOfRange;
    // private System.Single _hideAlphaRangeMin
    // Offset: 0x3C
    float hideAlphaRangeMin;
    // private System.Single _hideAlphaRangeMax
    // Offset: 0x40
    float hideAlphaRangeMax;
    // private System.Single _intensity
    // Offset: 0x44
    float intensity;
    // private System.Single _minAlpha
    // Offset: 0x48
    float minAlpha;
    // private System.Boolean _setColorOnly
    // Offset: 0x4C
    bool setColorOnly;
    // private System.Boolean _setOnlyOnce
    // Offset: 0x4D
    bool setOnlyOnce;
    // public UnityEngine.Color get_color()
    // Offset: 0x1881328
    UnityEngine::Color get_color();
    // public override System.Void ColorWasSet(UnityEngine.Color color)
    // Offset: 0x1881344
    // Implemented from: LightWithIdMonoBehaviour
    // Base method: System.Void LightWithIdMonoBehaviour::ColorWasSet(UnityEngine.Color color)
    void ColorWasSet(UnityEngine::Color color);
    // public System.Void .ctor()
    // Offset: 0x18814A0
    // Implemented from: LightWithIdMonoBehaviour
    // Base method: System.Void LightWithIdMonoBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static SpriteLightWithId* New_ctor();
  }; // SpriteLightWithId
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SpriteLightWithId*, "", "SpriteLightWithId");
#pragma pack(pop)
