// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: StandardLevelBuyInfoView
  // [] Offset: FFFFFFFF
  class StandardLevelBuyInfoView : public UnityEngine::MonoBehaviour {
    public:
    // private TMPro.TextMeshProUGUI _text
    // Size: 0x8
    // Offset: 0x18
    TMPro::TextMeshProUGUI* text;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshProUGUI*) == 0x8);
    // private UnityEngine.UI.Button _buyLevelButton
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::UI::Button* buyLevelButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _openPackButton
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::UI::Button* openPackButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _buyPackButton
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::UI::Button* buyPackButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // Creating value type constructor for type: StandardLevelBuyInfoView
    StandardLevelBuyInfoView(TMPro::TextMeshProUGUI* text_ = {}, UnityEngine::UI::Button* buyLevelButton_ = {}, UnityEngine::UI::Button* openPackButton_ = {}, UnityEngine::UI::Button* buyPackButton_ = {}) noexcept : text{text_}, buyLevelButton{buyLevelButton_}, openPackButton{openPackButton_}, buyPackButton{buyPackButton_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public UnityEngine.UI.Button get_buyLevelButton()
    // Offset: 0xF3E50C
    UnityEngine::UI::Button* get_buyLevelButton();
    // public UnityEngine.UI.Button get_openPackButton()
    // Offset: 0xF3E514
    UnityEngine::UI::Button* get_openPackButton();
    // public UnityEngine.UI.Button get_buyPackButton()
    // Offset: 0xF3E51C
    UnityEngine::UI::Button* get_buyPackButton();
    // public System.Void RefreshView(System.String infoText, System.Boolean canBuyPack)
    // Offset: 0xF3E524
    void RefreshView(::Il2CppString* infoText, bool canBuyPack);
    // public System.Void .ctor()
    // Offset: 0xF3E598
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static StandardLevelBuyInfoView* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::StandardLevelBuyInfoView::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<StandardLevelBuyInfoView*, creationType>()));
    }
  }; // StandardLevelBuyInfoView
  #pragma pack(pop)
  static check_size<sizeof(StandardLevelBuyInfoView), 48 + sizeof(UnityEngine::UI::Button*)> __GlobalNamespace_StandardLevelBuyInfoViewSizeCheck;
  static_assert(sizeof(StandardLevelBuyInfoView) == 0x38);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::StandardLevelBuyInfoView*, "", "StandardLevelBuyInfoView");
