// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BasicLevelParamsPanel
  class BasicLevelParamsPanel;
  // Forward declaring type: KawaseBlurRendererSO
  class KawaseBlurRendererSO;
  // Forward declaring type: IPreviewBeatmapLevel
  class IPreviewBeatmapLevel;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: RawImage
  class RawImage;
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture2D
  class Texture2D;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: StandardLevelBuyView
  class StandardLevelBuyView : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::StandardLevelBuyView::$LoadDataAsync$d__15
    struct $LoadDataAsync$d__15;
    // private TMPro.TextMeshProUGUI _songNameText
    // Offset: 0x18
    TMPro::TextMeshProUGUI* songNameText;
    // private BasicLevelParamsPanel _levelParamsPanel
    // Offset: 0x20
    GlobalNamespace::BasicLevelParamsPanel* levelParamsPanel;
    // private UnityEngine.UI.RawImage _coverRawImage
    // Offset: 0x28
    UnityEngine::UI::RawImage* coverRawImage;
    // private UnityEngine.UI.Button _buyButton
    // Offset: 0x30
    UnityEngine::UI::Button* buyButton;
    // private KawaseBlurRendererSO _kawaseBlurRenderer
    // Offset: 0x38
    GlobalNamespace::KawaseBlurRendererSO* kawaseBlurRenderer;
    // private System.String _loadingLevelId
    // Offset: 0x40
    ::Il2CppString* loadingLevelId;
    // private System.Threading.CancellationTokenSource _cancellationTokenSource
    // Offset: 0x48
    System::Threading::CancellationTokenSource* cancellationTokenSource;
    // private UnityEngine.Texture2D _blurredCoverTexture
    // Offset: 0x50
    UnityEngine::Texture2D* blurredCoverTexture;
    // private IPreviewBeatmapLevel _previewBeatmapLevel
    // Offset: 0x58
    GlobalNamespace::IPreviewBeatmapLevel* previewBeatmapLevel;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public UnityEngine.UI.Button get_buyButton()
    // Offset: 0xB9DE44
    UnityEngine::UI::Button* get_buyButton();
    // public System.Void SetContent(IPreviewBeatmapLevel previewBeatmapLevel)
    // Offset: 0xB9DE4C
    void SetContent(GlobalNamespace::IPreviewBeatmapLevel* previewBeatmapLevel);
    // protected System.Void OnEnable()
    // Offset: 0xB9DF94
    void OnEnable();
    // protected System.Void OnDisable()
    // Offset: 0xB9DF9C
    void OnDisable();
    // protected System.Void OnDestroy()
    // Offset: 0xB9DFD4
    void OnDestroy();
    // public System.Void LoadDataAsync(IPreviewBeatmapLevel level)
    // Offset: 0xB9DEA8
    void LoadDataAsync(GlobalNamespace::IPreviewBeatmapLevel* level);
    // public System.Void .ctor()
    // Offset: 0xB9E0BC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static StandardLevelBuyView* New_ctor();
  }; // StandardLevelBuyView
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::StandardLevelBuyView*, "", "StandardLevelBuyView");
#pragma pack(pop)
