// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
// Including type: BeatmapDifficultyMask
#include "GlobalNamespace/BeatmapDifficultyMask.hpp"
// Including type: BeatmapLevelsModel
#include "GlobalNamespace/BeatmapLevelsModel.hpp"
// Including type: System.Threading.CancellationToken
#include "System/Threading/CancellationToken.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: EventBinder
  class EventBinder;
  // Forward declaring type: StandardLevelDetailView
  class StandardLevelDetailView;
  // Forward declaring type: StandardLevelBuyView
  class StandardLevelBuyView;
  // Forward declaring type: StandardLevelBuyInfoView
  class StandardLevelBuyInfoView;
  // Forward declaring type: LoadingControl
  class LoadingControl;
  // Forward declaring type: PlayerDataModel
  class PlayerDataModel;
  // Forward declaring type: AdditionalContentModel
  class AdditionalContentModel;
  // Forward declaring type: DlcPromoPanelModel
  class DlcPromoPanelModel;
  // Forward declaring type: IAnalyticsModel
  class IAnalyticsModel;
  // Forward declaring type: IBeatmapLevelPack
  class IBeatmapLevelPack;
  // Forward declaring type: IBeatmapLevel
  class IBeatmapLevel;
  // Forward declaring type: IDifficultyBeatmap
  class IDifficultyBeatmap;
  // Forward declaring type: IPreviewBeatmapLevel
  class IPreviewBeatmapLevel;
  // Forward declaring type: BeatmapCharacteristicSO
  class BeatmapCharacteristicSO;
  // Skipping declaration: ContentType because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Toggle
  class Toggle;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: StandardLevelDetailViewController
  class StandardLevelDetailViewController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::StandardLevelDetailViewController);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::StandardLevelDetailViewController*, "", "StandardLevelDetailViewController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x131
  #pragma pack(push, 1)
  // Autogenerated type: StandardLevelDetailViewController
  // [TokenAttribute] Offset: FFFFFFFF
  class StandardLevelDetailViewController : public ::HMUI::ViewController {
    public:
    // Nested type: ::GlobalNamespace::StandardLevelDetailViewController::ContentType
    struct ContentType;
    // Nested type: ::GlobalNamespace::StandardLevelDetailViewController::$LoadBeatmapLevelAsync$d__57
    struct $LoadBeatmapLevelAsync$d__57;
    // Nested type: ::GlobalNamespace::StandardLevelDetailViewController::$ShowLoadingAndDoSomething$d__62
    struct $ShowLoadingAndDoSomething$d__62;
    // Nested type: ::GlobalNamespace::StandardLevelDetailViewController::$$BuyPackButtonWasPressed$b__56_0$d
    struct $$BuyPackButtonWasPressed$b__56_0$d;
    // Nested type: ::GlobalNamespace::StandardLevelDetailViewController::$$OpenLevelProductStoreOrShowBuyInfo$b__58_0$d
    struct $$OpenLevelProductStoreOrShowBuyInfo$b__58_0$d;
    // Nested type: ::GlobalNamespace::StandardLevelDetailViewController::$$OpenLevelProductStore$b__59_0$d
    struct $$OpenLevelProductStore$b__59_0$d;
    // Nested type: ::GlobalNamespace::StandardLevelDetailViewController::$$RefreshAvailabilityIfNeeded$b__60_0$d
    struct $$RefreshAvailabilityIfNeeded$b__60_0$d;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: StandardLevelDetailViewController/ContentType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ContentType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ContentType
      constexpr ContentType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public StandardLevelDetailViewController/ContentType Loading
      static constexpr const int Loading = 0;
      // Get static field: static public StandardLevelDetailViewController/ContentType Loading
      static ::GlobalNamespace::StandardLevelDetailViewController::ContentType _get_Loading();
      // Set static field: static public StandardLevelDetailViewController/ContentType Loading
      static void _set_Loading(::GlobalNamespace::StandardLevelDetailViewController::ContentType value);
      // static field const value: static public StandardLevelDetailViewController/ContentType OwnedAndReady
      static constexpr const int OwnedAndReady = 1;
      // Get static field: static public StandardLevelDetailViewController/ContentType OwnedAndReady
      static ::GlobalNamespace::StandardLevelDetailViewController::ContentType _get_OwnedAndReady();
      // Set static field: static public StandardLevelDetailViewController/ContentType OwnedAndReady
      static void _set_OwnedAndReady(::GlobalNamespace::StandardLevelDetailViewController::ContentType value);
      // static field const value: static public StandardLevelDetailViewController/ContentType NoAllowedDifficultyBeatmap
      static constexpr const int NoAllowedDifficultyBeatmap = 2;
      // Get static field: static public StandardLevelDetailViewController/ContentType NoAllowedDifficultyBeatmap
      static ::GlobalNamespace::StandardLevelDetailViewController::ContentType _get_NoAllowedDifficultyBeatmap();
      // Set static field: static public StandardLevelDetailViewController/ContentType NoAllowedDifficultyBeatmap
      static void _set_NoAllowedDifficultyBeatmap(::GlobalNamespace::StandardLevelDetailViewController::ContentType value);
      // static field const value: static public StandardLevelDetailViewController/ContentType OwnedAndDownloading
      static constexpr const int OwnedAndDownloading = 3;
      // Get static field: static public StandardLevelDetailViewController/ContentType OwnedAndDownloading
      static ::GlobalNamespace::StandardLevelDetailViewController::ContentType _get_OwnedAndDownloading();
      // Set static field: static public StandardLevelDetailViewController/ContentType OwnedAndDownloading
      static void _set_OwnedAndDownloading(::GlobalNamespace::StandardLevelDetailViewController::ContentType value);
      // static field const value: static public StandardLevelDetailViewController/ContentType Buy
      static constexpr const int Buy = 4;
      // Get static field: static public StandardLevelDetailViewController/ContentType Buy
      static ::GlobalNamespace::StandardLevelDetailViewController::ContentType _get_Buy();
      // Set static field: static public StandardLevelDetailViewController/ContentType Buy
      static void _set_Buy(::GlobalNamespace::StandardLevelDetailViewController::ContentType value);
      // static field const value: static public StandardLevelDetailViewController/ContentType BuyInfo
      static constexpr const int BuyInfo = 5;
      // Get static field: static public StandardLevelDetailViewController/ContentType BuyInfo
      static ::GlobalNamespace::StandardLevelDetailViewController::ContentType _get_BuyInfo();
      // Set static field: static public StandardLevelDetailViewController/ContentType BuyInfo
      static void _set_BuyInfo(::GlobalNamespace::StandardLevelDetailViewController::ContentType value);
      // static field const value: static public StandardLevelDetailViewController/ContentType Error
      static constexpr const int Error = 6;
      // Get static field: static public StandardLevelDetailViewController/ContentType Error
      static ::GlobalNamespace::StandardLevelDetailViewController::ContentType _get_Error();
      // Set static field: static public StandardLevelDetailViewController/ContentType Error
      static void _set_Error(::GlobalNamespace::StandardLevelDetailViewController::ContentType value);
      // static field const value: static public StandardLevelDetailViewController/ContentType Inactive
      static constexpr const int Inactive = 7;
      // Get static field: static public StandardLevelDetailViewController/ContentType Inactive
      static ::GlobalNamespace::StandardLevelDetailViewController::ContentType _get_Inactive();
      // Set static field: static public StandardLevelDetailViewController/ContentType Inactive
      static void _set_Inactive(::GlobalNamespace::StandardLevelDetailViewController::ContentType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // StandardLevelDetailViewController/ContentType
    #pragma pack(pop)
    static check_size<sizeof(StandardLevelDetailViewController::ContentType), 0 + sizeof(int)> __GlobalNamespace_StandardLevelDetailViewController_ContentTypeSizeCheck;
    static_assert(sizeof(StandardLevelDetailViewController::ContentType) == 0x4);
    public:
    // private StandardLevelDetailView _standardLevelDetailView
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::StandardLevelDetailView* standardLevelDetailView;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::StandardLevelDetailView*) == 0x8);
    // private StandardLevelBuyView _standardLevelBuyView
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::StandardLevelBuyView* standardLevelBuyView;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::StandardLevelBuyView*) == 0x8);
    // private StandardLevelBuyInfoView _standardLevelBuyInfoView
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::StandardLevelBuyInfoView* standardLevelBuyInfoView;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::StandardLevelBuyInfoView*) == 0x8);
    // private LoadingControl _loadingControl
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::LoadingControl* loadingControl;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LoadingControl*) == 0x8);
    // private UnityEngine.GameObject _noAllowedBeatmapInfoContainer
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* noAllowedBeatmapInfoContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [InjectAttribute] Offset: 0x112CA88
    // private readonly PlayerDataModel _playerDataModel
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::PlayerDataModel* playerDataModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerDataModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112CA98
    // private readonly AdditionalContentModel _additionalContentModel
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::AdditionalContentModel* additionalContentModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AdditionalContentModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112CAA8
    // private readonly BeatmapLevelsModel _beatmapLevelsModel
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::BeatmapLevelsModel* beatmapLevelsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapLevelsModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112CAB8
    // private readonly DlcPromoPanelModel _dlcPromoPanelModel
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::DlcPromoPanelModel* dlcPromoPanelModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::DlcPromoPanelModel*) == 0x8);
    // [InjectAttribute] Offset: 0x112CAC8
    // private readonly IAnalyticsModel _analyticsModel
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::IAnalyticsModel* analyticsModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IAnalyticsModel*) == 0x8);
    // private System.Action`1<StandardLevelDetailViewController> didPressActionButtonEvent
    // Size: 0x8
    // Offset: 0xC0
    ::System::Action_1<::GlobalNamespace::StandardLevelDetailViewController*>* didPressActionButtonEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::StandardLevelDetailViewController*>*) == 0x8);
    // private System.Action`2<StandardLevelDetailViewController,IBeatmapLevelPack> didPressOpenLevelPackButtonEvent
    // Size: 0x8
    // Offset: 0xC8
    ::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, ::GlobalNamespace::IBeatmapLevelPack*>* didPressOpenLevelPackButtonEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, ::GlobalNamespace::IBeatmapLevelPack*>*) == 0x8);
    // private System.Action`2<StandardLevelDetailViewController,System.Boolean> levelFavoriteStatusDidChangeEvent
    // Size: 0x8
    // Offset: 0xD0
    ::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, bool>* levelFavoriteStatusDidChangeEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, bool>*) == 0x8);
    // private System.Action`2<StandardLevelDetailViewController,IBeatmapLevel> didPressPracticeButtonEvent
    // Size: 0x8
    // Offset: 0xD8
    ::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, ::GlobalNamespace::IBeatmapLevel*>* didPressPracticeButtonEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, ::GlobalNamespace::IBeatmapLevel*>*) == 0x8);
    // private System.Action`2<StandardLevelDetailViewController,IDifficultyBeatmap> didChangeDifficultyBeatmapEvent
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, ::GlobalNamespace::IDifficultyBeatmap*>* didChangeDifficultyBeatmapEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, ::GlobalNamespace::IDifficultyBeatmap*>*) == 0x8);
    // private System.Action`2<StandardLevelDetailViewController,StandardLevelDetailViewController/ContentType> didChangeContentEvent
    // Size: 0x8
    // Offset: 0xE8
    ::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, ::GlobalNamespace::StandardLevelDetailViewController::ContentType>* didChangeContentEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::GlobalNamespace::StandardLevelDetailViewController*, ::GlobalNamespace::StandardLevelDetailViewController::ContentType>*) == 0x8);
    // private readonly EventBinder _ownedObjectsEventBinder
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::EventBinder* ownedObjectsEventBinder;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EventBinder*) == 0x8);
    // private readonly EventBinder _eventBinder
    // Size: 0x8
    // Offset: 0xF8
    ::GlobalNamespace::EventBinder* eventBinder;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EventBinder*) == 0x8);
    // private System.Threading.CancellationTokenSource _cancellationTokenSource
    // Size: 0x8
    // Offset: 0x100
    ::System::Threading::CancellationTokenSource* cancellationTokenSource;
    // Field size check
    static_assert(sizeof(::System::Threading::CancellationTokenSource*) == 0x8);
    // private IPreviewBeatmapLevel _previewBeatmapLevel
    // Size: 0x8
    // Offset: 0x108
    ::GlobalNamespace::IPreviewBeatmapLevel* previewBeatmapLevel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IPreviewBeatmapLevel*) == 0x8);
    // private IBeatmapLevel _beatmapLevel
    // Size: 0x8
    // Offset: 0x110
    ::GlobalNamespace::IBeatmapLevel* beatmapLevel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IBeatmapLevel*) == 0x8);
    // private IBeatmapLevelPack _pack
    // Size: 0x8
    // Offset: 0x118
    ::GlobalNamespace::IBeatmapLevelPack* pack;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IBeatmapLevelPack*) == 0x8);
    // private System.Boolean _canBuyPack
    // Size: 0x1
    // Offset: 0x120
    bool canBuyPack;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private BeatmapDifficultyMask _allowedBeatmapDifficultyMask
    // Size: 0x1
    // Offset: 0x121
    ::GlobalNamespace::BeatmapDifficultyMask allowedBeatmapDifficultyMask;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeatmapDifficultyMask) == 0x1);
    // Padding between fields: allowedBeatmapDifficultyMask and: notAllowedCharacteristics
    char __padding23[0x6] = {};
    // private System.Collections.Generic.HashSet`1<BeatmapCharacteristicSO> _notAllowedCharacteristics
    // Size: 0x8
    // Offset: 0x128
    ::System::Collections::Generic::HashSet_1<::GlobalNamespace::BeatmapCharacteristicSO*>* notAllowedCharacteristics;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::GlobalNamespace::BeatmapCharacteristicSO*>*) == 0x8);
    // private System.Boolean _contentIsOwnedAndReady
    // Size: 0x1
    // Offset: 0x130
    bool contentIsOwnedAndReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // [LocalizationKeyAttribute] Offset: 0x112CAD8
    // static field const value: static private System.String kLoadingDataErrorNoInternetLocalizationKey
    static constexpr const char* kLoadingDataErrorNoInternetLocalizationKey = "ERROR_LOADING_DATA_NO_INTERNET_MESSAGE";
    // Get static field: static private System.String kLoadingDataErrorNoInternetLocalizationKey
    static ::StringW _get_kLoadingDataErrorNoInternetLocalizationKey();
    // Set static field: static private System.String kLoadingDataErrorNoInternetLocalizationKey
    static void _set_kLoadingDataErrorNoInternetLocalizationKey(::StringW value);
    // [LocalizationKeyAttribute] Offset: 0x112CAE8
    // static field const value: static private System.String kLoadingDataErrorLocalizationKey
