// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: SteamVR_TrackedObject/EIndex
#include "GlobalNamespace/SteamVR_TrackedObject.hpp"
// Including type: Valve.VR.RenderModel_ControllerMode_State_t
#include "Valve/VR/RenderModel_ControllerMode_State_t.hpp"
// Including type: SteamVR_Events
#include "GlobalNamespace/SteamVR_Events.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Skipping declaration: IntPtr because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
  // Skipping declaration: VREvent_t because it is already included!
  // Forward declaring type: CVRRenderModels
  class CVRRenderModels;
  // Forward declaring type: RenderModel_t
  struct RenderModel_t;
  // Forward declaring type: RenderModel_TextureMap_t
  struct RenderModel_TextureMap_t;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: SteamVR_RenderModel
  // [] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: CE573C
  class SteamVR_RenderModel : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::SteamVR_RenderModel::RenderModel
    class RenderModel;
    // Nested type: GlobalNamespace::SteamVR_RenderModel::RenderModelInterfaceHolder
    class RenderModelInterfaceHolder;
    // Nested type: GlobalNamespace::SteamVR_RenderModel::$SetModelAsync$d__21
    class $SetModelAsync$d__21;
    // Nested type: GlobalNamespace::SteamVR_RenderModel::$FreeRenderModel$d__24
    class $FreeRenderModel$d__24;
    // public SteamVR_TrackedObject/EIndex index
    // Size: 0x4
    // Offset: 0x18
    GlobalNamespace::SteamVR_TrackedObject::EIndex index;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SteamVR_TrackedObject::EIndex) == 0x4);
    // Padding between fields: index and: modelOverride
    char __padding0[0x4] = {};
    // [TooltipAttribute] Offset: 0xCE7188
    // public System.String modelOverride
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* modelOverride;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [TooltipAttribute] Offset: 0xCE71C0
    // public UnityEngine.Shader shader
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::Shader* shader;
    // Field size check
    static_assert(sizeof(UnityEngine::Shader*) == 0x8);
    // [TooltipAttribute] Offset: 0xCE71F8
    // public System.Boolean verbose
    // Size: 0x1
    // Offset: 0x30
    bool verbose;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xCE7230
    // public System.Boolean createComponents
    // Size: 0x1
    // Offset: 0x31
    bool createComponents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xCE7268
    // public System.Boolean updateDynamically
    // Size: 0x1
    // Offset: 0x32
    bool updateDynamically;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public Valve.VR.RenderModel_ControllerMode_State_t controllerModeState
    // Size: 0x1
    // Offset: 0x33
    Valve::VR::RenderModel_ControllerMode_State_t controllerModeState;
    // Field size check
    static_assert(sizeof(Valve::VR::RenderModel_ControllerMode_State_t) == 0x1);
    // Padding between fields: controllerModeState and: renderModelName
    char __padding6[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xCE72A0
    // private System.String <renderModelName>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* renderModelName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private SteamVR_Events/Action deviceConnectedAction
    // Size: 0x8
    // Offset: 0x40
    GlobalNamespace::SteamVR_Events::Action* deviceConnectedAction;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SteamVR_Events::Action*) == 0x8);
    // private SteamVR_Events/Action hideRenderModelsAction
    // Size: 0x8
    // Offset: 0x48
    GlobalNamespace::SteamVR_Events::Action* hideRenderModelsAction;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SteamVR_Events::Action*) == 0x8);
    // private SteamVR_Events/Action modelSkinSettingsHaveChangedAction
    // Size: 0x8
    // Offset: 0x50
    GlobalNamespace::SteamVR_Events::Action* modelSkinSettingsHaveChangedAction;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SteamVR_Events::Action*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.String> nameCache
    // Size: 0x8
    // Offset: 0x58
    System::Collections::Generic::Dictionary_2<int, ::Il2CppString*>* nameCache;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, ::Il2CppString*>*) == 0x8);
    // Creating value type constructor for type: SteamVR_RenderModel
    SteamVR_RenderModel(GlobalNamespace::SteamVR_TrackedObject::EIndex index_ = {}, ::Il2CppString* modelOverride_ = {}, UnityEngine::Shader* shader_ = {}, bool verbose_ = {}, bool createComponents_ = {}, bool updateDynamically_ = {}, Valve::VR::RenderModel_ControllerMode_State_t controllerModeState_ = {}, ::Il2CppString* renderModelName_ = {}, GlobalNamespace::SteamVR_Events::Action* deviceConnectedAction_ = {}, GlobalNamespace::SteamVR_Events::Action* hideRenderModelsAction_ = {}, GlobalNamespace::SteamVR_Events::Action* modelSkinSettingsHaveChangedAction_ = {}, System::Collections::Generic::Dictionary_2<int, ::Il2CppString*>* nameCache_ = {}) noexcept : index{index_}, modelOverride{modelOverride_}, shader{shader_}, verbose{verbose_}, createComponents{createComponents_}, updateDynamically{updateDynamically_}, controllerModeState{controllerModeState_}, renderModelName{renderModelName_}, deviceConnectedAction{deviceConnectedAction_}, hideRenderModelsAction{hideRenderModelsAction_}, modelSkinSettingsHaveChangedAction{modelSkinSettingsHaveChangedAction_}, nameCache{nameCache_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static public System.String modelOverrideWarning
    static constexpr const char* modelOverrideWarning = "Model override is really only meant to be used in the scene view for lining things up; using it at runtime is discouraged.  Use tracked device index instead to ensure the correct model is displayed for all users.";
    // Get static field: static public System.String modelOverrideWarning
    static ::Il2CppString* _get_modelOverrideWarning();
    // Set static field: static public System.String modelOverrideWarning
    static void _set_modelOverrideWarning(::Il2CppString* value);
    // static field const value: static public System.String k_localTransformName
    static constexpr const char* k_localTransformName = "attach";
    // Get static field: static public System.String k_localTransformName
    static ::Il2CppString* _get_k_localTransformName();
    // Set static field: static public System.String k_localTransformName
    static void _set_k_localTransformName(::Il2CppString* value);
    // Get static field: static public System.Collections.Hashtable models
    static System::Collections::Hashtable* _get_models();
    // Set static field: static public System.Collections.Hashtable models
    static void _set_models(System::Collections::Hashtable* value);
    // Get static field: static public System.Collections.Hashtable materials
    static System::Collections::Hashtable* _get_materials();
    // Set static field: static public System.Collections.Hashtable materials
    static void _set_materials(System::Collections::Hashtable* value);
    // public System.String get_renderModelName()
    // Offset: 0x12D9194
    ::Il2CppString* get_renderModelName();
    // private System.Void set_renderModelName(System.String value)
    // Offset: 0x12D919C
    void set_renderModelName(::Il2CppString* value);
    // private System.Void OnModelSkinSettingsHaveChanged(Valve.VR.VREvent_t vrEvent)
    // Offset: 0x12D91A4
    void OnModelSkinSettingsHaveChanged(Valve::VR::VREvent_t vrEvent);
    // private System.Void OnHideRenderModels(System.Boolean hidden)
    // Offset: 0x12D93C8
    void OnHideRenderModels(bool hidden);
    // private System.Void OnDeviceConnected(System.Int32 i, System.Boolean connected)
    // Offset: 0x12D94FC
    void OnDeviceConnected(int i, bool connected);
    // public System.Void UpdateModel()
    // Offset: 0x12D9214
    void UpdateModel();
    // private System.Collections.IEnumerator SetModelAsync(System.String renderModelName)
    // Offset: 0x12D9514
    System::Collections::IEnumerator* SetModelAsync(::Il2CppString* renderModelName);
    // private System.Boolean SetModel(System.String renderModelName)
    // Offset: 0x12D95BC
    bool SetModel(::Il2CppString* renderModelName);
    // private SteamVR_RenderModel/RenderModel LoadRenderModel(Valve.VR.CVRRenderModels renderModels, System.String renderModelName, System.String baseName)
    // Offset: 0x12DA810
    GlobalNamespace::SteamVR_RenderModel::RenderModel* LoadRenderModel(Valve::VR::CVRRenderModels* renderModels, ::Il2CppString* renderModelName, ::Il2CppString* baseName);
    // private System.Collections.IEnumerator FreeRenderModel(System.IntPtr pRenderModel)
    // Offset: 0x12DB6F8
    System::Collections::IEnumerator* FreeRenderModel(System::IntPtr pRenderModel);
    // public UnityEngine.Transform FindComponent(System.String componentName)
    // Offset: 0x12DB7CC
    UnityEngine::Transform* FindComponent(::Il2CppString* componentName);
    // private System.Void StripMesh(UnityEngine.GameObject go)
    // Offset: 0x12D9A74
    void StripMesh(UnityEngine::GameObject* go);
    // private System.Boolean LoadComponents(SteamVR_RenderModel/RenderModelInterfaceHolder holder, System.String renderModelName)
    // Offset: 0x12D9BB8
    bool LoadComponents(GlobalNamespace::SteamVR_RenderModel::RenderModelInterfaceHolder* holder, ::Il2CppString* renderModelName);
    // private System.Void OnEnable()
    // Offset: 0x12DB9A8
    void OnEnable();
    // private System.Void OnDisable()
    // Offset: 0x12DBAD0
    void OnDisable();
    // private System.Void Update()
    // Offset: 0x12DBB34
    void Update();
    // public System.Void UpdateComponents(Valve.VR.CVRRenderModels renderModels)
    // Offset: 0x12DA3CC
    void UpdateComponents(Valve::VR::CVRRenderModels* renderModels);
    // public System.Void SetDeviceIndex(System.Int32 index)
    // Offset: 0x12DBBB8
    void SetDeviceIndex(int index);
    // static private System.Void Sleep()
    // Offset: 0x12DB2F4
    static void Sleep();
    // private Valve.VR.RenderModel_t MarshalRenderModel(System.IntPtr pRenderModel)
    // Offset: 0x12DB300
    Valve::VR::RenderModel_t MarshalRenderModel(System::IntPtr pRenderModel);
    // private Valve.VR.RenderModel_TextureMap_t MarshalRenderModel_TextureMap(System.IntPtr pRenderModel)
    // Offset: 0x12DB508
    Valve::VR::RenderModel_TextureMap_t MarshalRenderModel_TextureMap(System::IntPtr pRenderModel);
    // private System.Void .ctor()
    // Offset: 0x12DB868
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SteamVR_RenderModel* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::SteamVR_RenderModel::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SteamVR_RenderModel*, creationType>()));
    }
    // static private System.Void .cctor()
    // Offset: 0x12DBC3C
    // Implemented from: UnityEngine.Object
    // Base method: System.Void Object::.cctor()
    static void _cctor();
  }; // SteamVR_RenderModel
  #pragma pack(pop)
  static check_size<sizeof(SteamVR_RenderModel), 88 + sizeof(System::Collections::Generic::Dictionary_2<int, ::Il2CppString*>*)> __GlobalNamespace_SteamVR_RenderModelSizeCheck;
  static_assert(sizeof(SteamVR_RenderModel) == 0x60);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SteamVR_RenderModel*, "", "SteamVR_RenderModel");
