// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: FileSystemWatcher
  class FileSystemWatcher;
  // Forward declaring type: FileSystemEventArgs
  class FileSystemEventArgs;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SteamVR_Camera
  class SteamVR_Camera;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xBC
  // Autogenerated type: SteamVR_ExternalCamera
  // [] Offset: FFFFFFFF
  class SteamVR_ExternalCamera : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::SteamVR_ExternalCamera::Config
    struct Config;
    // Size: 0x49
    // Autogenerated type: SteamVR_ExternalCamera/Config
    // [] Offset: FFFFFFFF
    struct Config/*, public System::ValueType*/ {
      public:
      // public System.Single x
      // Size: 0x4
      // Offset: 0x0
      float x;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single y
      // Size: 0x4
      // Offset: 0x4
      float y;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single z
      // Size: 0x4
      // Offset: 0x8
      float z;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single rx
      // Size: 0x4
      // Offset: 0xC
      float rx;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single ry
      // Size: 0x4
      // Offset: 0x10
      float ry;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single rz
      // Size: 0x4
      // Offset: 0x14
      float rz;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single fov
      // Size: 0x4
      // Offset: 0x18
      float fov;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single near
      // Size: 0x4
      // Offset: 0x1C
      float near;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single far
      // Size: 0x4
      // Offset: 0x20
      float far;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single sceneResolutionScale
      // Size: 0x4
      // Offset: 0x24
      float sceneResolutionScale;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single frameSkip
      // Size: 0x4
      // Offset: 0x28
      float frameSkip;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single nearOffset
      // Size: 0x4
      // Offset: 0x2C
      float nearOffset;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single farOffset
      // Size: 0x4
      // Offset: 0x30
      float farOffset;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single hmdOffset
      // Size: 0x4
      // Offset: 0x34
      float hmdOffset;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single r
      // Size: 0x4
      // Offset: 0x38
      float r;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single g
      // Size: 0x4
      // Offset: 0x3C
      float g;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single b
      // Size: 0x4
      // Offset: 0x40
      float b;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single a
      // Size: 0x4
      // Offset: 0x44
      float a;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Boolean disableStandardAssets
      // Size: 0x1
      // Offset: 0x48
      bool disableStandardAssets;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Creating value type constructor for type: Config
      constexpr Config(float x_ = {}, float y_ = {}, float z_ = {}, float rx_ = {}, float ry_ = {}, float rz_ = {}, float fov_ = {}, float near_ = {}, float far_ = {}, float sceneResolutionScale_ = {}, float frameSkip_ = {}, float nearOffset_ = {}, float farOffset_ = {}, float hmdOffset_ = {}, float r_ = {}, float g_ = {}, float b_ = {}, float a_ = {}, bool disableStandardAssets_ = {}) noexcept : x{x_}, y{y_}, z{z_}, rx{rx_}, ry{ry_}, rz{rz_}, fov{fov_}, near{near_}, far{far_}, sceneResolutionScale{sceneResolutionScale_}, frameSkip{frameSkip_}, nearOffset{nearOffset_}, farOffset{farOffset_}, hmdOffset{hmdOffset_}, r{r_}, g{g_}, b{b_}, a{a_}, disableStandardAssets{disableStandardAssets_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
    }; // SteamVR_ExternalCamera/Config
    static check_size<sizeof(SteamVR_ExternalCamera::Config), 72 + sizeof(bool)> __GlobalNamespace_SteamVR_ExternalCamera_ConfigSizeCheck;
    static_assert(sizeof(SteamVR_ExternalCamera::Config) == 0x49);
    // public SteamVR_ExternalCamera/Config config
    // Size: 0x49
    // Offset: 0x18
    GlobalNamespace::SteamVR_ExternalCamera::Config config;
    // Field size check
    static_assert(sizeof(GlobalNamespace::SteamVR_ExternalCamera::Config) == 0x49);
    // Padding between fields: config and: configPath
    char __padding0[0x7] = {};
    // public System.String configPath
    // Size: 0x8
    // Offset: 0x68
    ::Il2CppString* configPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.IO.FileSystemWatcher watcher
    // Size: 0x8
    // Offset: 0x70
    System::IO::FileSystemWatcher* watcher;
    // Field size check
    static_assert(sizeof(System::IO::FileSystemWatcher*) == 0x8);
    // private UnityEngine.Camera cam
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::Camera* cam;
    // Field size check
    static_assert(sizeof(UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Transform target
    // Size: 0x8
    // Offset: 0x80
    UnityEngine::Transform* target;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private UnityEngine.GameObject clipQuad
    // Size: 0x8
    // Offset: 0x88
    UnityEngine::GameObject* clipQuad;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Material clipMaterial
    // Size: 0x8
    // Offset: 0x90
    UnityEngine::Material* clipMaterial;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material colorMat
    // Size: 0x8
    // Offset: 0x98
    UnityEngine::Material* colorMat;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material alphaMat
    // Size: 0x8
    // Offset: 0xA0
    UnityEngine::Material* alphaMat;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // private UnityEngine.Camera[] cameras
    // Size: 0x8
    // Offset: 0xA8
    ::Array<UnityEngine::Camera*>* cameras;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Camera*>*) == 0x8);
    // private UnityEngine.Rect[] cameraRects
    // Size: 0x8
    // Offset: 0xB0
    ::Array<UnityEngine::Rect>* cameraRects;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Rect>*) == 0x8);
    // private System.Single sceneResolutionScale
    // Size: 0x4
    // Offset: 0xB8
    float sceneResolutionScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: SteamVR_ExternalCamera
    SteamVR_ExternalCamera(GlobalNamespace::SteamVR_ExternalCamera::Config config_ = {}, ::Il2CppString* configPath_ = {}, System::IO::FileSystemWatcher* watcher_ = {}, UnityEngine::Camera* cam_ = {}, UnityEngine::Transform* target_ = {}, UnityEngine::GameObject* clipQuad_ = {}, UnityEngine::Material* clipMaterial_ = {}, UnityEngine::Material* colorMat_ = {}, UnityEngine::Material* alphaMat_ = {}, ::Array<UnityEngine::Camera*>* cameras_ = {}, ::Array<UnityEngine::Rect>* cameraRects_ = {}, float sceneResolutionScale_ = {}) noexcept : config{config_}, configPath{configPath_}, watcher{watcher_}, cam{cam_}, target{target_}, clipQuad{clipQuad_}, clipMaterial{clipMaterial_}, colorMat{colorMat_}, alphaMat{alphaMat_}, cameras{cameras_}, cameraRects{cameraRects_}, sceneResolutionScale{sceneResolutionScale_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void ReadConfig()
    // Offset: 0x1106B38
    void ReadConfig();
    // private System.Void OnChanged(System.Object source, System.IO.FileSystemEventArgs e)
    // Offset: 0x110745C
    void OnChanged(::Il2CppObject* source, System::IO::FileSystemEventArgs* e);
    // public System.Void AttachToCamera(SteamVR_Camera vrcam)
    // Offset: 0x1107460
    void AttachToCamera(GlobalNamespace::SteamVR_Camera* vrcam);
    // public System.Single GetTargetDistance()
    // Offset: 0x1107A68
    float GetTargetDistance();
    // public System.Void RenderNear()
    // Offset: 0x1107D14
    void RenderNear();
    // public System.Void RenderFar()
    // Offset: 0x110846C
    void RenderFar();
    // private System.Void OnGUI()
    // Offset: 0x110858C
    void OnGUI();
    // private System.Void OnEnable()
    // Offset: 0x1108590
    void OnEnable();
    // private System.Void OnDisable()
    // Offset: 0x110880C
    void OnDisable();
    // public System.Void .ctor()
    // Offset: 0x1108978
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SteamVR_ExternalCamera* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::SteamVR_ExternalCamera::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SteamVR_ExternalCamera*, creationType>()));
    }
  }; // SteamVR_ExternalCamera
  static check_size<sizeof(SteamVR_ExternalCamera), 184 + sizeof(float)> __GlobalNamespace_SteamVR_ExternalCameraSizeCheck;
  static_assert(sizeof(SteamVR_ExternalCamera) == 0xBC);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SteamVR_ExternalCamera*, "", "SteamVR_ExternalCamera");
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::SteamVR_ExternalCamera::Config, "", "SteamVR_ExternalCamera/Config");
#pragma pack(pop)
