// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: Valve.VR.VRTextureBounds_t
#include "Valve/VR/VRTextureBounds_t.hpp"
// Including type: SteamVR_Utils/RigidTransform
#include "GlobalNamespace/SteamVR_Utils_RigidTransform.hpp"
// Including type: Valve.VR.ETextureType
#include "Valve/VR/ETextureType.hpp"
// Including type: Valve.VR.TrackedDevicePose_t
#include "Valve/VR/TrackedDevicePose_t.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
  // Forward declaring type: CVRSystem
  class CVRSystem;
  // Forward declaring type: CVRCompositor
  class CVRCompositor;
  // Forward declaring type: CVROverlay
  class CVROverlay;
  // Forward declaring type: EVRInitError
  struct EVRInitError;
  // Forward declaring type: ETrackedDeviceProperty
  struct ETrackedDeviceProperty;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x54
  #pragma pack(push, 1)
  // Autogenerated type: SteamVR
  class SteamVR : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // [CompilerGeneratedAttribute] Offset: 0xDD4900
    // private Valve.VR.CVRSystem <hmd>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    Valve::VR::CVRSystem* hmd;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRSystem*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDD4910
    // private Valve.VR.CVRCompositor <compositor>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    Valve::VR::CVRCompositor* compositor;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRCompositor*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDD4920
    // private Valve.VR.CVROverlay <overlay>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    Valve::VR::CVROverlay* overlay;
    // Field size check
    static_assert(sizeof(Valve::VR::CVROverlay*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDD4960
    // private System.Single <sceneWidth>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    float sceneWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xDD4970
    // private System.Single <sceneHeight>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    float sceneHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xDD4980
    // private System.Single <aspect>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    float aspect;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xDD4990
    // private System.Single <fieldOfView>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    float fieldOfView;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xDD49A0
    // private UnityEngine.Vector2 <tanHalfFov>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::Vector2 tanHalfFov;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDD49B0
    // private Valve.VR.VRTextureBounds_t[] <textureBounds>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::Array<Valve::VR::VRTextureBounds_t>* textureBounds;
    // Field size check
    static_assert(sizeof(::Array<Valve::VR::VRTextureBounds_t>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDD49C0
    // private SteamVR_Utils/RigidTransform[] <eyes>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::Array<GlobalNamespace::SteamVR_Utils::RigidTransform>* eyes;
    // Field size check
    static_assert(sizeof(::Array<GlobalNamespace::SteamVR_Utils::RigidTransform>*) == 0x8);
    // public Valve.VR.ETextureType textureType
    // Size: 0x4
    // Offset: 0x50
    Valve::VR::ETextureType textureType;
    // Field size check
    static_assert(sizeof(Valve::VR::ETextureType) == 0x4);
    // Creating value type constructor for type: SteamVR
    SteamVR(Valve::VR::CVRSystem* hmd_ = {}, Valve::VR::CVRCompositor* compositor_ = {}, Valve::VR::CVROverlay* overlay_ = {}, float sceneWidth_ = {}, float sceneHeight_ = {}, float aspect_ = {}, float fieldOfView_ = {}, UnityEngine::Vector2 tanHalfFov_ = {}, ::Array<Valve::VR::VRTextureBounds_t>* textureBounds_ = {}, ::Array<GlobalNamespace::SteamVR_Utils::RigidTransform>* eyes_ = {}, Valve::VR::ETextureType textureType_ = {}) noexcept : hmd{hmd_}, compositor{compositor_}, overlay{overlay_}, sceneWidth{sceneWidth_}, sceneHeight{sceneHeight_}, aspect{aspect_}, fieldOfView{fieldOfView_}, tanHalfFov{tanHalfFov_}, textureBounds{textureBounds_}, eyes{eyes_}, textureType{textureType_} {}
    // Creating interface conversion operator: operator System::IDisposable
