// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: SteamVR_Controller
#include "GlobalNamespace/SteamVR_Controller.hpp"
// Including type: Valve.VR.VRControllerState_t
#include "Valve/VR/VRControllerState_t.hpp"
// Including type: Valve.VR.TrackedDevicePose_t
#include "Valve/VR/TrackedDevicePose_t.hpp"
// Including type: SteamVR_Utils
#include "GlobalNamespace/SteamVR_Utils.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector3
  struct Vector3;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
  // Forward declaring type: EVRButtonId
  struct EVRButtonId;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xF6
  #pragma pack(push, 1)
  // Autogenerated type: SteamVR_Controller/Device
  // [TokenAttribute] Offset: FFFFFFFF
  class SteamVR_Controller::Device : public ::Il2CppObject {
    public:
    // private System.UInt32 <index>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    uint index;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Boolean <valid>k__BackingField
    // Size: 0x1
    // Offset: 0x14
    bool valid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: valid and: state
    char __padding1[0x3] = {};
    // private Valve.VR.VRControllerState_t state
    // Size: 0x40
    // Offset: 0x18
    Valve::VR::VRControllerState_t state;
    // Field size check
    static_assert(sizeof(Valve::VR::VRControllerState_t) == 0x40);
    // private Valve.VR.VRControllerState_t prevState
    // Size: 0x40
    // Offset: 0x58
    Valve::VR::VRControllerState_t prevState;
    // Field size check
    static_assert(sizeof(Valve::VR::VRControllerState_t) == 0x40);
    // private Valve.VR.TrackedDevicePose_t pose
    // Size: 0x4E
    // Offset: 0x98
    Valve::VR::TrackedDevicePose_t pose;
    // Field size check
    static_assert(sizeof(Valve::VR::TrackedDevicePose_t) == 0x4E);
    // Padding between fields: pose and: prevFrameCount
    char __padding4[0x2] = {};
    // private System.Int32 prevFrameCount
    // Size: 0x4
    // Offset: 0xE8
    int prevFrameCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single hairTriggerDelta
    // Size: 0x4
    // Offset: 0xEC
    float hairTriggerDelta;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single hairTriggerLimit
    // Size: 0x4
    // Offset: 0xF0
    float hairTriggerLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean hairTriggerState
    // Size: 0x1
    // Offset: 0xF4
    bool hairTriggerState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hairTriggerPrevState
    // Size: 0x1
    // Offset: 0xF5
    bool hairTriggerPrevState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: Device
    Device(uint index_ = {}, bool valid_ = {}, Valve::VR::VRControllerState_t state_ = {}, Valve::VR::VRControllerState_t prevState_ = {}, Valve::VR::TrackedDevicePose_t pose_ = {}, int prevFrameCount_ = {}, float hairTriggerDelta_ = {}, float hairTriggerLimit_ = {}, bool hairTriggerState_ = {}, bool hairTriggerPrevState_ = {}) noexcept : index{index_}, valid{valid_}, state{state_}, prevState{prevState_}, pose{pose_}, prevFrameCount{prevFrameCount_}, hairTriggerDelta{hairTriggerDelta_}, hairTriggerLimit{hairTriggerLimit_}, hairTriggerState{hairTriggerState_}, hairTriggerPrevState{hairTriggerPrevState_} {}
    // Get instance field: private System.UInt32 <index>k__BackingField
    uint _get_$index$k__BackingField();
    // Set instance field: private System.UInt32 <index>k__BackingField
