// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: TrackLaneRingsManager
  class TrackLaneRingsManager;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: TrackLaneRingsRotationEffect
  class TrackLaneRingsRotationEffect : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: GlobalNamespace::TrackLaneRingsRotationEffect::RingRotationEffect
    class RingRotationEffect;
    // private TrackLaneRingsManager _trackLaneRingsManager
    // Offset: 0x18
    GlobalNamespace::TrackLaneRingsManager* trackLaneRingsManager;
    // private System.Single _startupRotationAngle
    // Offset: 0x20
    float startupRotationAngle;
    // private System.Single _startupRotationStep
    // Offset: 0x24
    float startupRotationStep;
    // private System.Int32 _startupRotationPropagationSpeed
    // Offset: 0x28
    int startupRotationPropagationSpeed;
    // private System.Single _startupRotationFlexySpeed
    // Offset: 0x2C
    float startupRotationFlexySpeed;
    // private System.Collections.Generic.List`1<TrackLaneRingsRotationEffect/RingRotationEffect> _activeRingRotationEffects
    // Offset: 0x30
    System::Collections::Generic::List_1<GlobalNamespace::TrackLaneRingsRotationEffect::RingRotationEffect*>* activeRingRotationEffects;
    // private System.Collections.Generic.List`1<TrackLaneRingsRotationEffect/RingRotationEffect> _ringRotationEffectsPool
    // Offset: 0x38
    System::Collections::Generic::List_1<GlobalNamespace::TrackLaneRingsRotationEffect::RingRotationEffect*>* ringRotationEffectsPool;
    // private System.Collections.Generic.List`1<System.Int32> ringRotationEffectsToDelete
    // Offset: 0x40
    System::Collections::Generic::List_1<int>* ringRotationEffectsToDelete;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // protected System.Void Awake()
    // Offset: 0xC471D4
    void Awake();
    // protected System.Void Start()
    // Offset: 0xC47308
    void Start();
    // protected System.Void FixedUpdate()
    // Offset: 0xC473B4
    void FixedUpdate();
    // public System.Void AddRingRotationEffect(System.Single angle, System.Single step, System.Int32 propagationSpeed, System.Single flexySpeed)
    // Offset: 0xC47318
    void AddRingRotationEffect(float angle, float step, int propagationSpeed, float flexySpeed);
    // public System.Single GetFirstRingRotationAngle()
    // Offset: 0xC47638
    float GetFirstRingRotationAngle();
    // public System.Single GetFirstRingDestinationRotationAngle()
    // Offset: 0xC4767C
    float GetFirstRingDestinationRotationAngle();
    // private TrackLaneRingsRotationEffect/RingRotationEffect SpawnRingRotationEffect()
    // Offset: 0xC475A0
    GlobalNamespace::TrackLaneRingsRotationEffect::RingRotationEffect* SpawnRingRotationEffect();
    // private System.Void RecycleRingRotationEffect(TrackLaneRingsRotationEffect/RingRotationEffect ringRotationEffect)
    // Offset: 0xC47538
    void RecycleRingRotationEffect(GlobalNamespace::TrackLaneRingsRotationEffect::RingRotationEffect* ringRotationEffect);
    // public System.Void .ctor()
    // Offset: 0xC476C0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static TrackLaneRingsRotationEffect* New_ctor();
  }; // TrackLaneRingsRotationEffect
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::TrackLaneRingsRotationEffect*, "", "TrackLaneRingsRotationEffect");
#pragma pack(pop)
