// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TrailerToolConfigurationProcessor
#include "GlobalNamespace/TrailerToolConfigurationProcessor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::TrailerToolConfigurationProcessor::PlaybackScreenshot);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::TrailerToolConfigurationProcessor::PlaybackScreenshot*, "", "TrailerToolConfigurationProcessor/PlaybackScreenshot");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: TrailerToolConfigurationProcessor/PlaybackScreenshot
  // [TokenAttribute] Offset: FFFFFFFF
  class TrailerToolConfigurationProcessor::PlaybackScreenshot : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.String name
    // Size: 0x8
    // Offset: 0x10
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String type
    // Size: 0x8
    // Offset: 0x18
    ::StringW type;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String[] includedLayers
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::StringW> includedLayers;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.String[] excludedLayers
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::StringW> excludedLayers;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    public:
    // Get instance field reference: public System.String name
    ::StringW& dyn_name();
    // Get instance field reference: public System.String type
    ::StringW& dyn_type();
    // Get instance field reference: public System.String[] includedLayers
    ::ArrayW<::StringW>& dyn_includedLayers();
    // Get instance field reference: public System.String[] excludedLayers
    ::ArrayW<::StringW>& dyn_excludedLayers();
    // public System.Void .ctor()
    // Offset: 0x13419E0
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TrailerToolConfigurationProcessor::PlaybackScreenshot* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::TrailerToolConfigurationProcessor::PlaybackScreenshot::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TrailerToolConfigurationProcessor::PlaybackScreenshot*, creationType>()));
    }
  }; // TrailerToolConfigurationProcessor/PlaybackScreenshot
  #pragma pack(pop)
  static check_size<sizeof(TrailerToolConfigurationProcessor::PlaybackScreenshot), 40 + sizeof(::ArrayW<::StringW>)> __GlobalNamespace_TrailerToolConfigurationProcessor_PlaybackScreenshotSizeCheck;
  static_assert(sizeof(TrailerToolConfigurationProcessor::PlaybackScreenshot) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::TrailerToolConfigurationProcessor::PlaybackScreenshot::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
