// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: BloomPrePassLight
#include "GlobalNamespace/BloomPrePassLight.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BoolSO
  class BoolSO;
  // Forward declaring type: ParametricBoxController
  class ParametricBoxController;
  // Forward declaring type: Parametric3SliceSpriteController
  class Parametric3SliceSpriteController;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Vector4
  struct Vector4;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: TubeBloomPrePassLight
  class TubeBloomPrePassLight;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::TubeBloomPrePassLight);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::TubeBloomPrePassLight*, "", "TubeBloomPrePassLight");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD8
  #pragma pack(push, 1)
  // Autogenerated type: TubeBloomPrePassLight
  // [TokenAttribute] Offset: FFFFFFFF
  // [SelectionBaseAttribute] Offset: FFFFFFFF
  class TubeBloomPrePassLight : public ::GlobalNamespace::BloomPrePassLight {
    public:
    // Writing base type padding for base size: 0x2A to desired offset: 0x30
    char ___base_padding[0x6] = {};
    public:
    // private BoolSO _mainEffectPostProcessEnabled
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::BoolSO* mainEffectPostProcessEnabled;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BoolSO*) == 0x8);
    // private System.Single _width
    // Size: 0x4
    // Offset: 0x38
    float width;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideChildrenLength
    // Size: 0x1
    // Offset: 0x3C
    bool overrideChildrenLength;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideChildrenLength and: length
    char __padding2[0x3] = {};
    // private System.Single _length
    // Size: 0x4
    // Offset: 0x40
    float length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x1106D24
    // private System.Single _center
    // Size: 0x4
    // Offset: 0x44
    float center;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _color
    // Size: 0x10
    // Offset: 0x48
    ::UnityEngine::Color color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single _colorAlphaMultiplier
    // Size: 0x4
    // Offset: 0x58
    float colorAlphaMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _bloomFogIntensityMultiplier
    // Size: 0x4
    // Offset: 0x5C
    float bloomFogIntensityMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _fakeBloomIntensityMultiplier
    // Size: 0x4
    // Offset: 0x60
    float fakeBloomIntensityMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _boostToWhite
    // Size: 0x4
    // Offset: 0x64
    float boostToWhite;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [MinAttribute] Offset: 0x1106DB4
    // private System.Single _lightWidthMultiplier
    // Size: 0x4
    // Offset: 0x68
    float lightWidthMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _addWidthToLength
    // Size: 0x1
    // Offset: 0x6C
    bool addWidthToLength;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _thickenWithDistance
    // Size: 0x1
    // Offset: 0x6D
    bool thickenWithDistance;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: thickenWithDistance and: thickenCurve
    char __padding12[0x2] = {};
    // [DrawIfAttribute] Offset: 0x1106E10
    // private UnityEngine.AnimationCurve _thickenCurve
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::AnimationCurve* thickenCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // [DrawIfAttribute] Offset: 0x1106EB8
    // private System.Single _minDistance
    // Size: 0x4
    // Offset: 0x78
    float minDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [DrawIfAttribute] Offset: 0x1106F60
    // private System.Single _maxDistance
    // Size: 0x4
    // Offset: 0x7C
    float maxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [DrawIfAttribute] Offset: 0x1107008
    // private System.Single _minWidthMultiplier
    // Size: 0x4
    // Offset: 0x80
    float minWidthMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [DrawIfAttribute] Offset: 0x11070B0
    // private System.Single _maxWidthMultiplier
    // Size: 0x4
    // Offset: 0x84
    float maxWidthMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x1107158
    // private System.Single _bakedGlowWidthScale
    // Size: 0x4
    // Offset: 0x88
    float bakedGlowWidthScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _forceUseBakedGlow
    // Size: 0x1
    // Offset: 0x8C
    bool forceUseBakedGlow;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [SpaceAttribute] Offset: 0x11071A0
    // [TooltipAttribute] Offset: 0x11071A0
    // private System.Boolean _updateAlways
    // Size: 0x1
    // Offset: 0x8D
    bool updateAlways;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [SpaceAttribute] Offset: 0x11071FC
    // private System.Boolean _limitAlpha
    // Size: 0x1
    // Offset: 0x8E
    bool limitAlpha;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: limitAlpha and: minAlpha
    char __padding21[0x1] = {};
    // [DrawIfAttribute] Offset: 0x1107234
    // private System.Single _minAlpha
    // Size: 0x4
    // Offset: 0x90
    float minAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [DrawIfAttribute] Offset: 0x11072DC
    // private System.Single _maxAlpha
    // Size: 0x4
    // Offset: 0x94
    float maxAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x1107384
    // private System.Boolean _overrideChildrenAlpha
    // Size: 0x1
    // Offset: 0x98
    bool overrideChildrenAlpha;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideChildrenAlpha and: startAlpha
    char __padding24[0x3] = {};
    // [MinAttribute] Offset: 0x11073BC
    // private System.Single _startAlpha
    // Size: 0x4
    // Offset: 0x9C
    float startAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [MinAttribute] Offset: 0x11073F8
    // private System.Single _endAlpha
    // Size: 0x4
    // Offset: 0xA0
    float endAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x1107434
    // private System.Boolean _overrideChildrenWidth
    // Size: 0x1
    // Offset: 0xA4
    bool overrideChildrenWidth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideChildrenWidth and: startWidth
    char __padding27[0x3] = {};
    // [MinAttribute] Offset: 0x110746C
    // private System.Single _startWidth
    // Size: 0x4
    // Offset: 0xA8
    float startWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [MinAttribute] Offset: 0x11074A8
    // private System.Single _endWidth
    // Size: 0x4
    // Offset: 0xAC
    float endWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x11074E4
    // [NullAllowed] Offset: 0x11074E4
    // private ParametricBoxController _parametricBoxController
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::ParametricBoxController* parametricBoxController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ParametricBoxController*) == 0x8);
    // [NullAllowed] Offset: 0x110752C
    // private Parametric3SliceSpriteController _dynamic3SliceSprite
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::Parametric3SliceSpriteController* dynamic3SliceSprite;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::Parametric3SliceSpriteController*) == 0x8);
    // private System.Action didRefreshEvent
    // Size: 0x8
    // Offset: 0xC0
    ::System::Action* didRefreshEvent;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Boolean _isDirty
    // Size: 0x1
    // Offset: 0xC8
    bool isDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isDirty and: transform
    char __padding33[0x7] = {};
    // private UnityEngine.Transform _transform
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Transform* transform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    public:
    // Get instance field reference: private BoolSO _mainEffectPostProcessEnabled
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::BoolSO*& dyn__mainEffectPostProcessEnabled();
    // Get instance field reference: private System.Single _width
    [[deprecated("Use field access instead!")]] float& dyn__width();
    // Get instance field reference: private System.Boolean _overrideChildrenLength
    [[deprecated("Use field access instead!")]] bool& dyn__overrideChildrenLength();
    // Get instance field reference: private System.Single _length
    [[deprecated("Use field access instead!")]] float& dyn__length();
    // Get instance field reference: private System.Single _center
    [[deprecated("Use field access instead!")]] float& dyn__center();
