// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnifiedNetworkPlayerModel
#include "GlobalNamespace/UnifiedNetworkPlayerModel.hpp"
// Including type: INetworkPlayer
#include "GlobalNamespace/INetworkPlayer.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeatmapDifficultyMask
  struct BeatmapDifficultyMask;
  // Forward declaring type: GameplayModifierMask
  struct GameplayModifierMask;
  // Forward declaring type: SongPackMask
  struct SongPackMask;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x33
  #pragma pack(push, 1)
  // Autogenerated type: UnifiedNetworkPlayerModel/UnifiedNetworkPlayer
  // [] Offset: FFFFFFFF
  class UnifiedNetworkPlayerModel::UnifiedNetworkPlayer : public ::Il2CppObject/*, public GlobalNamespace::INetworkPlayer*/ {
    public:
    // private readonly UnifiedNetworkPlayerModel _playerModel
    // Size: 0x8
    // Offset: 0x10
    GlobalNamespace::UnifiedNetworkPlayerModel* playerModel;
    // Field size check
    static_assert(sizeof(GlobalNamespace::UnifiedNetworkPlayerModel*) == 0x8);
    // private readonly System.String _userId
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* userId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.String _userName
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* userName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.Boolean _isMe
    // Size: 0x1
    // Offset: 0x28
    bool isMe;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isConnectionOwner
    // Size: 0x1
    // Offset: 0x29
    bool isConnectionOwner;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isConnectionOwner and: sortIndex
    char __padding4[0x2] = {};
    // private System.Int32 _sortIndex
    // Size: 0x4
    // Offset: 0x2C
    int sortIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xD329C0
    // private System.Boolean <isPlayer>k__BackingField
    // Size: 0x1
    // Offset: 0x30
    bool isPlayer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xD329D0
    // private System.Boolean <isDedicatedServer>k__BackingField
    // Size: 0x1
    // Offset: 0x31
    bool isDedicatedServer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xD329E0
    // private System.Boolean <isSpectating>k__BackingField
    // Size: 0x1
    // Offset: 0x32
    bool isSpectating;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: UnifiedNetworkPlayer
    UnifiedNetworkPlayer(GlobalNamespace::UnifiedNetworkPlayerModel* playerModel_ = {}, ::Il2CppString* userId_ = {}, ::Il2CppString* userName_ = {}, bool isMe_ = {}, bool isConnectionOwner_ = {}, int sortIndex_ = {}, bool isPlayer_ = {}, bool isDedicatedServer_ = {}, bool isSpectating_ = {}) noexcept : playerModel{playerModel_}, userId{userId_}, userName{userName_}, isMe{isMe_}, isConnectionOwner{isConnectionOwner_}, sortIndex{sortIndex_}, isPlayer{isPlayer_}, isDedicatedServer{isDedicatedServer_}, isSpectating{isSpectating_} {}
    // Creating interface conversion operator: operator GlobalNamespace::INetworkPlayer
    operator GlobalNamespace::INetworkPlayer() noexcept {
      return *reinterpret_cast<GlobalNamespace::INetworkPlayer*>(this);
    }
    // public System.Void .ctor(UnifiedNetworkPlayerModel playerModel, System.String userId, System.String userName, System.Boolean isConnectionOwner, System.Boolean isMe)
    // Offset: 0x1086BE8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UnifiedNetworkPlayerModel::UnifiedNetworkPlayer* New_ctor(GlobalNamespace::UnifiedNetworkPlayerModel* playerModel, ::Il2CppString* userId, ::Il2CppString* userName, bool isConnectionOwner, bool isMe) {
      static auto ___internal__logger = ::Logger::get().WithContext("GlobalNamespace::UnifiedNetworkPlayerModel::UnifiedNetworkPlayer::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UnifiedNetworkPlayerModel::UnifiedNetworkPlayer*, creationType>(playerModel, userId, userName, isConnectionOwner, isMe)));
    }
    // public System.String get_userId()
    // Offset: 0x10895AC
    ::Il2CppString* get_userId();
    // public System.String get_userName()
    // Offset: 0x10895B4
    ::Il2CppString* get_userName();
    // public System.Boolean get_isMe()
    // Offset: 0x10895BC
    bool get_isMe();
    // public System.Int32 get_sortIndex()
    // Offset: 0x10895C4
    int get_sortIndex();
    // public System.Void set_sortIndex(System.Int32 value)
    // Offset: 0x10895CC
    void set_sortIndex(int value);
    // public System.Int32 get_currentPartySize()
    // Offset: 0x10895D4
    int get_currentPartySize();
    // public System.Int32 get_maxPartySize()
    // Offset: 0x10895F8
    int get_maxPartySize();
    // public System.Boolean get_isMyPartyOwner()
    // Offset: 0x108961C
    bool get_isMyPartyOwner();
    // public BeatmapDifficultyMask get_difficulties()
    // Offset: 0x1089624
    GlobalNamespace::BeatmapDifficultyMask get_difficulties();
    // public GameplayModifierMask get_modifiers()
    // Offset: 0x1089660
    GlobalNamespace::GameplayModifierMask get_modifiers();
    // public SongPackMask get_songPacks()
    // Offset: 0x108969C
    GlobalNamespace::SongPackMask get_songPacks();
    // public System.Boolean get_isOpenParty()
    // Offset: 0x10896D8
    bool get_isOpenParty();
    // public System.Boolean get_isConnected()
    // Offset: 0x1089708
    bool get_isConnected();
    // public System.Boolean get_isPlayer()
    // Offset: 0x1089710
    bool get_isPlayer();
    // public System.Void set_isPlayer(System.Boolean value)
    // Offset: 0x1089718
    void set_isPlayer(bool value);
    // public System.Boolean get_isDedicatedServer()
    // Offset: 0x1089724
    bool get_isDedicatedServer();
    // public System.Void set_isDedicatedServer(System.Boolean value)
    // Offset: 0x108972C
    void set_isDedicatedServer(bool value);
    // public System.Boolean get_isSpectating()
    // Offset: 0x1089738
    bool get_isSpectating();
    // public System.Void set_isSpectating(System.Boolean value)
    // Offset: 0x1089740
    void set_isSpectating(bool value);
    // public System.Boolean get_canJoin()
    // Offset: 0x108974C
    bool get_canJoin();
    // public System.Void Join()
    // Offset: 0x1089754
    void Join();
    // public System.Boolean get_requiresPassword()
    // Offset: 0x1089758
    bool get_requiresPassword();
    // public System.Void Join(System.String password)
    // Offset: 0x1089760
    void Join(::Il2CppString* password);
    // public System.Boolean get_isWaitingOnJoin()
    // Offset: 0x1089764
    bool get_isWaitingOnJoin();
    // public System.Boolean get_canInvite()
    // Offset: 0x108976C
    bool get_canInvite();
    // public System.Void Invite()
    // Offset: 0x1089774
    void Invite();
    // public System.Boolean get_isWaitingOnInvite()
    // Offset: 0x1089778
    bool get_isWaitingOnInvite();
    // public System.Boolean get_canKick()
    // Offset: 0x1089780
    bool get_canKick();
    // public System.Void Kick()
    // Offset: 0x10897C0
    void Kick();
    // public System.Boolean get_canLeave()
    // Offset: 0x10897F4
    bool get_canLeave();
    // public System.Void Leave()
    // Offset: 0x1089810
    void Leave();
    // public System.Boolean get_canBlock()
    // Offset: 0x1089834
    bool get_canBlock();
    // public System.Void Block()
    // Offset: 0x108983C
    void Block();
    // public System.Boolean get_canUnblock()
    // Offset: 0x1089840
    bool get_canUnblock();
    // public System.Void Unblock()
    // Offset: 0x1089848
    void Unblock();
    // public System.Void SendJoinResponse(System.Boolean accept)
    // Offset: 0x108984C
    void SendJoinResponse(bool accept);
    // public System.Void SendInviteResponse(System.Boolean accept)
    // Offset: 0x1089850
    void SendInviteResponse(bool accept);
    // public System.Void SetIsConnectionOwner(System.Boolean isConnectionOwner)
    // Offset: 0x1089854
    void SetIsConnectionOwner(bool isConnectionOwner);
  }; // UnifiedNetworkPlayerModel/UnifiedNetworkPlayer
  #pragma pack(pop)
  static check_size<sizeof(UnifiedNetworkPlayerModel::UnifiedNetworkPlayer), 50 + sizeof(bool)> __GlobalNamespace_UnifiedNetworkPlayerModel_UnifiedNetworkPlayerSizeCheck;
  static_assert(sizeof(UnifiedNetworkPlayerModel::UnifiedNetworkPlayer) == 0x33);
}
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::UnifiedNetworkPlayerModel::UnifiedNetworkPlayer*, "", "UnifiedNetworkPlayerModel/UnifiedNetworkPlayer");
