// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRController
  class VRController;
  // Forward declaring type: AudioTimeSyncController
  class AudioTimeSyncController;
  // Skipping declaration: Mode because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: TextAsset
  class TextAsset;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Camera
  class Camera;
  // Skipping declaration: Quaternion because it is already included!
  // Forward declaring type: AnimationClip
  class AnimationClip;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: VRControllersRecorder
  class VRControllersRecorder;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::VRControllersRecorder);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::VRControllersRecorder*, "", "VRControllersRecorder");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xA4
  #pragma pack(push, 1)
  // Autogenerated type: VRControllersRecorder
  // [TokenAttribute] Offset: FFFFFFFF
  class VRControllersRecorder : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::VRControllersRecorder::TypeSerializationBinder
    class TypeSerializationBinder;
    // Nested type: ::GlobalNamespace::VRControllersRecorder::SavedData
    class SavedData;
    // Nested type: ::GlobalNamespace::VRControllersRecorder::Mode
    struct Mode;
    // Nested type: ::GlobalNamespace::VRControllersRecorder::Keyframe
    class Keyframe;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: VRControllersRecorder/Mode
    // [TokenAttribute] Offset: FFFFFFFF
    struct Mode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Mode
      constexpr Mode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public VRControllersRecorder/Mode Record
      static constexpr const int Record = 0;
      // Get static field: static public VRControllersRecorder/Mode Record
      static ::GlobalNamespace::VRControllersRecorder::Mode _get_Record();
      // Set static field: static public VRControllersRecorder/Mode Record
      static void _set_Record(::GlobalNamespace::VRControllersRecorder::Mode value);
      // static field const value: static public VRControllersRecorder/Mode Playback
      static constexpr const int Playback = 1;
      // Get static field: static public VRControllersRecorder/Mode Playback
      static ::GlobalNamespace::VRControllersRecorder::Mode _get_Playback();
      // Set static field: static public VRControllersRecorder/Mode Playback
      static void _set_Playback(::GlobalNamespace::VRControllersRecorder::Mode value);
      // static field const value: static public VRControllersRecorder/Mode Off
      static constexpr const int Off = 2;
      // Get static field: static public VRControllersRecorder/Mode Off
      static ::GlobalNamespace::VRControllersRecorder::Mode _get_Off();
      // Set static field: static public VRControllersRecorder/Mode Off
      static void _set_Off(::GlobalNamespace::VRControllersRecorder::Mode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // VRControllersRecorder/Mode
    #pragma pack(pop)
    static check_size<sizeof(VRControllersRecorder::Mode), 0 + sizeof(int)> __GlobalNamespace_VRControllersRecorder_ModeSizeCheck;
    static_assert(sizeof(VRControllersRecorder::Mode) == 0x4);
    public:
    // [NullAllowed] Offset: 0x10E7110
    // private UnityEngine.TextAsset _recordingTextAsset
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::TextAsset* recordingTextAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // private System.String _recordingFileName
    // Size: 0x8
    // Offset: 0x20
    ::StringW recordingFileName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private VRControllersRecorder/Mode _mode
    // Size: 0x4
    // Offset: 0x28
    ::GlobalNamespace::VRControllersRecorder::Mode mode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRControllersRecorder::Mode) == 0x4);
    // [SpaceAttribute] Offset: 0x10E7168
    // private System.Boolean _dontMoveHead
    // Size: 0x1
    // Offset: 0x2C
    bool dontMoveHead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _changeToNonVRCamera
    // Size: 0x1
    // Offset: 0x2D
    bool changeToNonVRCamera;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _adjustSabersPositionBasedOnHeadPosition
    // Size: 0x1
    // Offset: 0x2E
    bool adjustSabersPositionBasedOnHeadPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: adjustSabersPositionBasedOnHeadPosition and: headRotationOffset
    char __padding5[0x1] = {};
    // private UnityEngine.Vector3 _headRotationOffset
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Vector3 headRotationOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _headPositionOffset
    // Size: 0xC
    // Offset: 0x3C
    ::UnityEngine::Vector3 headPositionOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single _headSmooth
    // Size: 0x4
    // Offset: 0x48
    float headSmooth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _cameraFOV
    // Size: 0x4
    // Offset: 0x4C
    float cameraFOV;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _controllersTimeOffset
    // Size: 0x4
    // Offset: 0x50
    float controllersTimeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _controllersSmooth
    // Size: 0x4
    // Offset: 0x54
    float controllersSmooth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x10E7220
    // private VRController _controller0
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::VRController* controller0;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRController*) == 0x8);
    // private VRController _controller1
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::VRController* controller1;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRController*) == 0x8);
    // private UnityEngine.Transform _headTransform
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* headTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Camera _camera
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Camera* camera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // [SpaceAttribute] Offset: 0x10E7288
    // private UnityEngine.Camera _recorderCamera
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Camera* recorderCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Transform _spawnRotationTransform
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Transform* spawnRotationTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [SpaceAttribute] Offset: 0x10E72D0
    // private UnityEngine.Transform _originTransform
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Transform* originTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [InjectAttribute] Offset: 0x10E7308
    // private readonly AudioTimeSyncController _audioTimeSyncController
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::AudioTimeSyncController* audioTimeSyncController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AudioTimeSyncController*) == 0x8);
    // private System.Collections.Generic.List`1<VRControllersRecorder/Keyframe> _keyframes
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<::GlobalNamespace::VRControllersRecorder::Keyframe*>* keyframes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::VRControllersRecorder::Keyframe*>*) == 0x8);
    // private System.Int32 _keyframeIndex
    // Size: 0x4
    // Offset: 0xA0
    int keyframeIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.TextAsset _recordingTextAsset
    [[deprecated("Use field access instead!")]] ::UnityEngine::TextAsset*& dyn__recordingTextAsset();
    // Get instance field reference: private System.String _recordingFileName
    [[deprecated("Use field access instead!")]] ::StringW& dyn__recordingFileName();
    // Get instance field reference: private VRControllersRecorder/Mode _mode
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::VRControllersRecorder::Mode& dyn__mode();
    // Get instance field reference: private System.Boolean _dontMoveHead
    [[deprecated("Use field access instead!")]] bool& dyn__dontMoveHead();
