// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: VRControllersRecorder/SavedData
#include "GlobalNamespace/VRControllersRecorder_SavedData.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: VRControllersRecorder/SavedData/KeyframeSerializable
  class VRControllersRecorder::SavedData::KeyframeSerializable : public ::Il2CppObject {
    public:
    // public System.Single _xPos1
    // Offset: 0x10
    float xPos1;
    // public System.Single _yPos1
    // Offset: 0x14
    float yPos1;
    // public System.Single _zPos1
    // Offset: 0x18
    float zPos1;
    // public System.Single _xPos2
    // Offset: 0x1C
    float xPos2;
    // public System.Single _yPos2
    // Offset: 0x20
    float yPos2;
    // public System.Single _zPos2
    // Offset: 0x24
    float zPos2;
    // public System.Single _xPos3
    // Offset: 0x28
    float xPos3;
    // public System.Single _yPos3
    // Offset: 0x2C
    float yPos3;
    // public System.Single _zPos3
    // Offset: 0x30
    float zPos3;
    // public System.Single _xRot1
    // Offset: 0x34
    float xRot1;
    // public System.Single _yRot1
    // Offset: 0x38
    float yRot1;
    // public System.Single _zRot1
    // Offset: 0x3C
    float zRot1;
    // public System.Single _wRot1
    // Offset: 0x40
    float wRot1;
    // public System.Single _xRot2
    // Offset: 0x44
    float xRot2;
    // public System.Single _yRot2
    // Offset: 0x48
    float yRot2;
    // public System.Single _zRot2
    // Offset: 0x4C
    float zRot2;
    // public System.Single _wRot2
    // Offset: 0x50
    float wRot2;
    // public System.Single _xRot3
    // Offset: 0x54
    float xRot3;
    // public System.Single _yRot3
    // Offset: 0x58
    float yRot3;
    // public System.Single _zRot3
    // Offset: 0x5C
    float zRot3;
    // public System.Single _wRot3
    // Offset: 0x60
    float wRot3;
    // public System.Single _time
    // Offset: 0x64
    float time;
    // public System.Void .ctor()
    // Offset: 0xC51438
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static VRControllersRecorder::SavedData::KeyframeSerializable* New_ctor();
  }; // VRControllersRecorder/SavedData/KeyframeSerializable
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::VRControllersRecorder::SavedData::KeyframeSerializable*, "", "VRControllersRecorder/SavedData/KeyframeSerializable");
#pragma pack(pop)
