// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: VRTrackersRecorder/SavedData/KeyframeSerializable
#include "GlobalNamespace/VRTrackersRecorder_SavedData_KeyframeSerializable.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Autogenerated type: VRTrackersRecorder/SavedData/KeyframeSerializable/TransformSerializable
  class VRTrackersRecorder::SavedData::KeyframeSerializable::TransformSerializable : public ::Il2CppObject {
    public:
    // public System.Single _xPos
    // Offset: 0x10
    float xPos;
    // public System.Single _yPos
    // Offset: 0x14
    float yPos;
    // public System.Single _zPos
    // Offset: 0x18
    float zPos;
    // public System.Single _xRot
    // Offset: 0x1C
    float xRot;
    // public System.Single _yRot
    // Offset: 0x20
    float yRot;
    // public System.Single _zRot
    // Offset: 0x24
    float zRot;
    // public System.Single _wRot
    // Offset: 0x28
    float wRot;
    // public System.Boolean _valid
    // Offset: 0x2C
    bool valid;
    // public System.Void .ctor()
    // Offset: 0xC54D70
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static VRTrackersRecorder::SavedData::KeyframeSerializable::TransformSerializable* New_ctor();
  }; // VRTrackersRecorder/SavedData/KeyframeSerializable/TransformSerializable
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(GlobalNamespace::VRTrackersRecorder::SavedData::KeyframeSerializable::TransformSerializable*, "", "VRTrackersRecorder/SavedData/KeyframeSerializable/TransformSerializable");
#pragma pack(pop)
