// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Object
#include "System\Object.hpp"
// Including type: Mono.Xml.SmallXmlParser/IContentHandler
#include "Mono\Xml\SmallXmlParser_IContentHandler.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Stack
  class Stack;
}
// Forward declaring namespace: System::Runtime::Remoting
namespace System::Runtime::Remoting {
  // Forward declaring type: ChannelData
  class ChannelData;
  // Forward declaring type: ProviderData
  class ProviderData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: TimeSpan
  struct TimeSpan;
}
// Completed forward declares
// Type namespace: System.Runtime.Remoting
namespace System::Runtime::Remoting {
  // Autogenerated type: System.Runtime.Remoting.ConfigHandler
  class ConfigHandler : public ::Il2CppObject, public Mono::Xml::SmallXmlParser::IContentHandler {
    public:
    // private System.Collections.ArrayList typeEntries
    // Offset: 0x10
    System::Collections::ArrayList* typeEntries;
    // private System.Collections.ArrayList channelInstances
    // Offset: 0x18
    System::Collections::ArrayList* channelInstances;
    // private System.Runtime.Remoting.ChannelData currentChannel
    // Offset: 0x20
    System::Runtime::Remoting::ChannelData* currentChannel;
    // private System.Collections.Stack currentProviderData
    // Offset: 0x28
    System::Collections::Stack* currentProviderData;
    // private System.String currentClientUrl
    // Offset: 0x30
    ::Il2CppString* currentClientUrl;
    // private System.String appName
    // Offset: 0x38
    ::Il2CppString* appName;
    // private System.String currentXmlPath
    // Offset: 0x40
    ::Il2CppString* currentXmlPath;
    // private System.Boolean onlyDelayedChannels
    // Offset: 0x48
    bool onlyDelayedChannels;
    // public System.Void .ctor(System.Boolean onlyDelayedChannels)
    // Offset: 0x1044F68
    static ConfigHandler* New_ctor(bool onlyDelayedChannels);
    // private System.Void ValidatePath(System.String element, System.String[] paths)
    // Offset: 0x1045030
    void ValidatePath(::Il2CppString* element, ::Array<::Il2CppString*>* paths);
    // private System.Boolean CheckPath(System.String path)
    // Offset: 0x104513C
    bool CheckPath(::Il2CppString* path);
    // public System.Void ParseElement(System.String name, Mono.Xml.SmallXmlParser/IAttrList attrs)
    // Offset: 0x10453DC
    void ParseElement(::Il2CppString* name, Mono::Xml::SmallXmlParser::IAttrList* attrs);
    // private System.Void ReadCustomProviderData(System.String name, Mono.Xml.SmallXmlParser/IAttrList attrs)
    // Offset: 0x1046430
    void ReadCustomProviderData(::Il2CppString* name, Mono::Xml::SmallXmlParser::IAttrList* attrs);
    // private System.Void ReadLifetine(Mono.Xml.SmallXmlParser/IAttrList attrs)
    // Offset: 0x10467A0
    void ReadLifetine(Mono::Xml::SmallXmlParser::IAttrList* attrs);
    // private System.TimeSpan ParseTime(System.String s)
    // Offset: 0x1047E44
    System::TimeSpan ParseTime(::Il2CppString* s);
    // private System.Void ReadChannel(Mono.Xml.SmallXmlParser/IAttrList attrs, System.Boolean isTemplate)
    // Offset: 0x1046D54
    void ReadChannel(Mono::Xml::SmallXmlParser::IAttrList* attrs, bool isTemplate);
    // private System.Runtime.Remoting.ProviderData ReadProvider(System.String name, Mono.Xml.SmallXmlParser/IAttrList attrs, System.Boolean isTemplate)
    // Offset: 0x1047124
    System::Runtime::Remoting::ProviderData* ReadProvider(::Il2CppString* name, Mono::Xml::SmallXmlParser::IAttrList* attrs, bool isTemplate);
    // private System.Void ReadClientActivated(Mono.Xml.SmallXmlParser/IAttrList attrs)
    // Offset: 0x1047784
    void ReadClientActivated(Mono::Xml::SmallXmlParser::IAttrList* attrs);
    // private System.Void ReadServiceActivated(Mono.Xml.SmallXmlParser/IAttrList attrs)
    // Offset: 0x10478AC
    void ReadServiceActivated(Mono::Xml::SmallXmlParser::IAttrList* attrs);
    // private System.Void ReadClientWellKnown(Mono.Xml.SmallXmlParser/IAttrList attrs)
    // Offset: 0x10474F8
    void ReadClientWellKnown(Mono::Xml::SmallXmlParser::IAttrList* attrs);
    // private System.Void ReadServiceWellKnown(Mono.Xml.SmallXmlParser/IAttrList attrs)
    // Offset: 0x10475DC
    void ReadServiceWellKnown(Mono::Xml::SmallXmlParser::IAttrList* attrs);
    // private System.Void ReadInteropXml(Mono.Xml.SmallXmlParser/IAttrList attrs, System.Boolean isElement)
    // Offset: 0x1047970
    void ReadInteropXml(Mono::Xml::SmallXmlParser::IAttrList* attrs, bool isElement);
    // private System.Void ReadPreload(Mono.Xml.SmallXmlParser/IAttrList attrs)
    // Offset: 0x1047B3C
    void ReadPreload(Mono::Xml::SmallXmlParser::IAttrList* attrs);
    // private System.String GetNotNull(Mono.Xml.SmallXmlParser/IAttrList attrs, System.String name)
    // Offset: 0x10482A8
    ::Il2CppString* GetNotNull(Mono::Xml::SmallXmlParser::IAttrList* attrs, ::Il2CppString* name);
    // private System.String ExtractAssembly(System.String type)
    // Offset: 0x10483E4
    ::Il2CppString* ExtractAssembly(::Il2CppString*& type);
    // public System.Void OnStartParsing(Mono.Xml.SmallXmlParser parser)
    // Offset: 0x1045220
    // Implemented from: Mono.Xml.SmallXmlParser/IContentHandler
    // Base method: System.Void IContentHandler::OnStartParsing(Mono.Xml.SmallXmlParser parser)
    void OnStartParsing(Mono::Xml::SmallXmlParser* parser);
    // public System.Void OnProcessingInstruction(System.String name, System.String text)
    // Offset: 0x1045224
    // Implemented from: Mono.Xml.SmallXmlParser/IContentHandler
    // Base method: System.Void IContentHandler::OnProcessingInstruction(System.String name, System.String text)
    void OnProcessingInstruction(::Il2CppString* name, ::Il2CppString* text);
    // public System.Void OnIgnorableWhitespace(System.String s)
    // Offset: 0x1045228
    // Implemented from: Mono.Xml.SmallXmlParser/IContentHandler
    // Base method: System.Void IContentHandler::OnIgnorableWhitespace(System.String s)
    void OnIgnorableWhitespace(::Il2CppString* s);
    // public System.Void OnStartElement(System.String name, Mono.Xml.SmallXmlParser/IAttrList attrs)
    // Offset: 0x104522C
    // Implemented from: Mono.Xml.SmallXmlParser/IContentHandler
    // Base method: System.Void IContentHandler::OnStartElement(System.String name, Mono.Xml.SmallXmlParser/IAttrList attrs)
    void OnStartElement(::Il2CppString* name, Mono::Xml::SmallXmlParser::IAttrList* attrs);
    // public System.Void OnEndElement(System.String name)
    // Offset: 0x1047DA0
    // Implemented from: Mono.Xml.SmallXmlParser/IContentHandler
    // Base method: System.Void IContentHandler::OnEndElement(System.String name)
    void OnEndElement(::Il2CppString* name);
    // public System.Void OnChars(System.String ch)
    // Offset: 0x10484C0
    // Implemented from: Mono.Xml.SmallXmlParser/IContentHandler
    // Base method: System.Void IContentHandler::OnChars(System.String ch)
    void OnChars(::Il2CppString* ch);
    // public System.Void OnEndParsing(Mono.Xml.SmallXmlParser parser)
    // Offset: 0x10484C4
    // Implemented from: Mono.Xml.SmallXmlParser/IContentHandler
    // Base method: System.Void IContentHandler::OnEndParsing(Mono.Xml.SmallXmlParser parser)
    void OnEndParsing(Mono::Xml::SmallXmlParser* parser);
  }; // System.Runtime.Remoting.ConfigHandler
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Remoting::ConfigHandler*, "System.Runtime.Remoting", "ConfigHandler");
#pragma pack(pop)
