// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Net.NetworkInformation.NetworkInterfaceType
#include "System/Net/NetworkInformation/NetworkInterfaceType.hpp"
// Completed includes
// Type namespace: System.Net.NetworkInformation
namespace System::Net::NetworkInformation {
  // Autogenerated type: System.Net.NetworkInformation.Win32_MIB_IFROW
  struct Win32_MIB_IFROW : public System::ValueType {
    public:
    // public System.Char[] Name
    // Offset: 0x0
    ::Array<::Il2CppChar>* Name;
    // public System.Int32 Index
    // Offset: 0x8
    int Index;
    // public System.Net.NetworkInformation.NetworkInterfaceType Type
    // Offset: 0xC
    System::Net::NetworkInformation::NetworkInterfaceType Type;
    // public System.Int32 Mtu
    // Offset: 0x10
    int Mtu;
    // public System.UInt32 Speed
    // Offset: 0x14
    uint Speed;
    // public System.Int32 PhysAddrLen
    // Offset: 0x18
    int PhysAddrLen;
    // public System.Byte[] PhysAddr
    // Offset: 0x20
    ::Array<uint8_t>* PhysAddr;
    // public System.UInt32 AdminStatus
    // Offset: 0x28
    uint AdminStatus;
    // public System.UInt32 OperStatus
    // Offset: 0x2C
    uint OperStatus;
    // public System.UInt32 LastChange
    // Offset: 0x30
    uint LastChange;
    // public System.Int32 InOctets
    // Offset: 0x34
    int InOctets;
    // public System.Int32 InUcastPkts
    // Offset: 0x38
    int InUcastPkts;
    // public System.Int32 InNUcastPkts
    // Offset: 0x3C
    int InNUcastPkts;
    // public System.Int32 InDiscards
    // Offset: 0x40
    int InDiscards;
    // public System.Int32 InErrors
    // Offset: 0x44
    int InErrors;
    // public System.Int32 InUnknownProtos
    // Offset: 0x48
    int InUnknownProtos;
    // public System.Int32 OutOctets
    // Offset: 0x4C
    int OutOctets;
    // public System.Int32 OutUcastPkts
    // Offset: 0x50
    int OutUcastPkts;
    // public System.Int32 OutNUcastPkts
    // Offset: 0x54
    int OutNUcastPkts;
    // public System.Int32 OutDiscards
    // Offset: 0x58
    int OutDiscards;
    // public System.Int32 OutErrors
    // Offset: 0x5C
    int OutErrors;
    // public System.Int32 OutQLen
    // Offset: 0x60
    int OutQLen;
    // public System.Int32 DescrLen
    // Offset: 0x64
    int DescrLen;
    // public System.Byte[] Descr
    // Offset: 0x68
    ::Array<uint8_t>* Descr;
    // Creating value type constructor for type: Win32_MIB_IFROW
    constexpr Win32_MIB_IFROW(::Array<::Il2CppChar>* Name_ = {}, int Index_ = {}, System::Net::NetworkInformation::NetworkInterfaceType Type_ = {}, int Mtu_ = {}, uint Speed_ = {}, int PhysAddrLen_ = {}, ::Array<uint8_t>* PhysAddr_ = {}, uint AdminStatus_ = {}, uint OperStatus_ = {}, uint LastChange_ = {}, int InOctets_ = {}, int InUcastPkts_ = {}, int InNUcastPkts_ = {}, int InDiscards_ = {}, int InErrors_ = {}, int InUnknownProtos_ = {}, int OutOctets_ = {}, int OutUcastPkts_ = {}, int OutNUcastPkts_ = {}, int OutDiscards_ = {}, int OutErrors_ = {}, int OutQLen_ = {}, int DescrLen_ = {}, ::Array<uint8_t>* Descr_ = {}) noexcept : Name{Name_}, Index{Index_}, Type{Type_}, Mtu{Mtu_}, Speed{Speed_}, PhysAddrLen{PhysAddrLen_}, PhysAddr{PhysAddr_}, AdminStatus{AdminStatus_}, OperStatus{OperStatus_}, LastChange{LastChange_}, InOctets{InOctets_}, InUcastPkts{InUcastPkts_}, InNUcastPkts{InNUcastPkts_}, InDiscards{InDiscards_}, InErrors{InErrors_}, InUnknownProtos{InUnknownProtos_}, OutOctets{OutOctets_}, OutUcastPkts{OutUcastPkts_}, OutNUcastPkts{OutNUcastPkts_}, OutDiscards{OutDiscards_}, OutErrors{OutErrors_}, OutQLen{OutQLen_}, DescrLen{DescrLen_}, Descr{Descr_} {}
  }; // System.Net.NetworkInformation.Win32_MIB_IFROW
  check_size<sizeof(Win32_MIB_IFROW), 104 + sizeof(void*) + ((104 + sizeof(void*)) % 8 != 0 ? (8 - (104 + sizeof(void*)) % 8) : 0)> __System_Net_NetworkInformation_Win32_MIB_IFROWSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Net::NetworkInformation::Win32_MIB_IFROW, "System.Net.NetworkInformation", "Win32_MIB_IFROW");
#pragma pack(pop)
