// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Including type: System.Net.NetworkInformation.Win32_IP_ADDR_STRING
#include "System/Net/NetworkInformation/Win32_IP_ADDR_STRING.hpp"
// Including type: System.Net.NetworkInformation.NetBiosNodeType
#include "System/Net/NetworkInformation/NetBiosNodeType.hpp"
// Completed includes
// Type namespace: System.Net.NetworkInformation
namespace System::Net::NetworkInformation {
  // Autogenerated type: System.Net.NetworkInformation.Win32_FIXED_INFO
  struct Win32_FIXED_INFO : public System::ValueType {
    public:
    // public System.String HostName
    // Offset: 0x0
    ::Il2CppString* HostName;
    // public System.String DomainName
    // Offset: 0x8
    ::Il2CppString* DomainName;
    // public System.IntPtr CurrentDnsServer
    // Offset: 0x10
    System::IntPtr CurrentDnsServer;
    // public System.Net.NetworkInformation.Win32_IP_ADDR_STRING DnsServerList
    // Offset: 0x18
    System::Net::NetworkInformation::Win32_IP_ADDR_STRING DnsServerList;
    // public System.Net.NetworkInformation.NetBiosNodeType NodeType
    // Offset: 0x38
    System::Net::NetworkInformation::NetBiosNodeType NodeType;
    // public System.String ScopeId
    // Offset: 0x40
    ::Il2CppString* ScopeId;
    // public System.UInt32 EnableRouting
    // Offset: 0x48
    uint EnableRouting;
    // public System.UInt32 EnableProxy
    // Offset: 0x4C
    uint EnableProxy;
    // public System.UInt32 EnableDns
    // Offset: 0x50
    uint EnableDns;
    // Creating value type constructor for type: Win32_FIXED_INFO
    constexpr Win32_FIXED_INFO(::Il2CppString* HostName_ = {}, ::Il2CppString* DomainName_ = {}, System::IntPtr CurrentDnsServer_ = {}, System::Net::NetworkInformation::Win32_IP_ADDR_STRING DnsServerList_ = {}, System::Net::NetworkInformation::NetBiosNodeType NodeType_ = {}, ::Il2CppString* ScopeId_ = {}, uint EnableRouting_ = {}, uint EnableProxy_ = {}, uint EnableDns_ = {}) noexcept : HostName{HostName_}, DomainName{DomainName_}, CurrentDnsServer{CurrentDnsServer_}, DnsServerList{DnsServerList_}, NodeType{NodeType_}, ScopeId{ScopeId_}, EnableRouting{EnableRouting_}, EnableProxy{EnableProxy_}, EnableDns{EnableDns_} {}
  }; // System.Net.NetworkInformation.Win32_FIXED_INFO
  check_size<sizeof(Win32_FIXED_INFO), 80 + sizeof(uint) + ((80 + sizeof(uint)) % 8 != 0 ? (8 - (80 + sizeof(uint)) % 8) : 0)> __System_Net_NetworkInformation_Win32_FIXED_INFOSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Net::NetworkInformation::Win32_FIXED_INFO, "System.Net.NetworkInformation", "Win32_FIXED_INFO");
#pragma pack(pop)
