// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem
#include "UnityEngine/TestRunner/NUnitExtensions/Runner/UnityWorkItem.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TestRunner::NUnitExtensions::Runner
namespace UnityEngine::TestRunner::NUnitExtensions::Runner {
  // Forward declaring type: WorkItemFactory
  class WorkItemFactory;
}
// Forward declaring namespace: NUnit::Framework::Internal
namespace NUnit::Framework::Internal {
  // Forward declaring type: TestSuite
  class TestSuite;
  // Forward declaring type: TestSuiteResult
  class TestSuiteResult;
}
// Forward declaring namespace: NUnit::Framework::Interfaces
namespace NUnit::Framework::Interfaces {
  // Forward declaring type: ITestFilter
  class ITestFilter;
  // Forward declaring type: ResultState
  class ResultState;
}
// Forward declaring namespace: NUnit::Framework::Internal::Commands
namespace NUnit::Framework::Internal::Commands {
  // Forward declaring type: TestCommand
  class TestCommand;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: NUnit::Framework::Internal::Execution
namespace NUnit::Framework::Internal::Execution {
  // Forward declaring type: CountdownEvent
  class CountdownEvent;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerable
  class IEnumerable;
}
// Completed forward declares
// Type namespace: UnityEngine.TestRunner.NUnitExtensions.Runner
namespace UnityEngine::TestRunner::NUnitExtensions::Runner {
  // Size: 0x98
  // Autogenerated type: UnityEngine.TestRunner.NUnitExtensions.Runner.CompositeWorkItem
  // [] Offset: FFFFFFFF
  class CompositeWorkItem : public UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem {
    public:
    // Nested type: UnityEngine::TestRunner::NUnitExtensions::Runner::CompositeWorkItem::UnityWorkItemOrderComparer
    class UnityWorkItemOrderComparer;
    // Nested type: UnityEngine::TestRunner::NUnitExtensions::Runner::CompositeWorkItem::$PerformWork$d__12
    class $PerformWork$d__12;
    // Nested type: UnityEngine::TestRunner::NUnitExtensions::Runner::CompositeWorkItem::$RunChildren$d__16
    class $RunChildren$d__16;
    // private readonly NUnit.Framework.Internal.TestSuite _suite
    // Size: 0x8
    // Offset: 0x58
    NUnit::Framework::Internal::TestSuite* suite;
    // Field size check
    static_assert(sizeof(NUnit::Framework::Internal::TestSuite*) == 0x8);
    // private readonly NUnit.Framework.Internal.TestSuiteResult _suiteResult
    // Size: 0x8
    // Offset: 0x60
    NUnit::Framework::Internal::TestSuiteResult* suiteResult;
    // Field size check
    static_assert(sizeof(NUnit::Framework::Internal::TestSuiteResult*) == 0x8);
    // private readonly NUnit.Framework.Interfaces.ITestFilter _childFilter
    // Size: 0x8
    // Offset: 0x68
    NUnit::Framework::Interfaces::ITestFilter* childFilter;
    // Field size check
    static_assert(sizeof(NUnit::Framework::Interfaces::ITestFilter*) == 0x8);
    // private NUnit.Framework.Internal.Commands.TestCommand _setupCommand
    // Size: 0x8
    // Offset: 0x70
    NUnit::Framework::Internal::Commands::TestCommand* setupCommand;
    // Field size check
    static_assert(sizeof(NUnit::Framework::Internal::Commands::TestCommand*) == 0x8);
    // private NUnit.Framework.Internal.Commands.TestCommand _teardownCommand
    // Size: 0x8
    // Offset: 0x78
    NUnit::Framework::Internal::Commands::TestCommand* teardownCommand;
    // Field size check
    static_assert(sizeof(NUnit::Framework::Internal::Commands::TestCommand*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDE67A8
    // private System.Collections.Generic.List`1<UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem> <Children>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    System::Collections::Generic::List_1<UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem*>* Children;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem*>*) == 0x8);
    // private System.Int32 _countOrder
    // Size: 0x4
    // Offset: 0x88
    int countOrder;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: countOrder and: childTestCountdown
    char __padding6[0x4] = {};
    // private NUnit.Framework.Internal.Execution.CountdownEvent _childTestCountdown
    // Size: 0x8
    // Offset: 0x90
    NUnit::Framework::Internal::Execution::CountdownEvent* childTestCountdown;
    // Field size check
    static_assert(sizeof(NUnit::Framework::Internal::Execution::CountdownEvent*) == 0x8);
    // Creating value type constructor for type: CompositeWorkItem
    CompositeWorkItem(NUnit::Framework::Internal::TestSuite* suite_ = {}, NUnit::Framework::Internal::TestSuiteResult* suiteResult_ = {}, NUnit::Framework::Interfaces::ITestFilter* childFilter_ = {}, NUnit::Framework::Internal::Commands::TestCommand* setupCommand_ = {}, NUnit::Framework::Internal::Commands::TestCommand* teardownCommand_ = {}, System::Collections::Generic::List_1<UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem*>* Children_ = {}, int countOrder_ = {}, NUnit::Framework::Internal::Execution::CountdownEvent* childTestCountdown_ = {}) noexcept : suite{suite_}, suiteResult{suiteResult_}, childFilter{childFilter_}, setupCommand{setupCommand_}, teardownCommand{teardownCommand_}, Children{Children_}, countOrder{countOrder_}, childTestCountdown{childTestCountdown_} {}
    // public System.Collections.Generic.List`1<UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem> get_Children()
    // Offset: 0x117E834
    System::Collections::Generic::List_1<UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem*>* get_Children();
    // private System.Void set_Children(System.Collections.Generic.List`1<UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem> value)
    // Offset: 0x117E83C
    void set_Children(System::Collections::Generic::List_1<UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem*>* value);
    // public System.Void .ctor(NUnit.Framework.Internal.TestSuite suite, NUnit.Framework.Interfaces.ITestFilter childFilter, UnityEngine.TestRunner.NUnitExtensions.Runner.WorkItemFactory factory)
    // Offset: 0x117E844
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CompositeWorkItem* New_ctor(NUnit::Framework::Internal::TestSuite* suite, NUnit::Framework::Interfaces::ITestFilter* childFilter, UnityEngine::TestRunner::NUnitExtensions::Runner::WorkItemFactory* factory) {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("UnityEngine::TestRunner::NUnitExtensions::Runner").WithContext("CompositeWorkItem").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CompositeWorkItem*, creationType>(suite, childFilter, factory)));
    }
    // private System.Boolean CheckForCancellation()
    // Offset: 0x117EAF0
    bool CheckForCancellation();
    // private System.Void InitializeSetUpAndTearDownCommands()
    // Offset: 0x117EBC8
    void InitializeSetUpAndTearDownCommands();
    // private System.Void PerformOneTimeSetUp()
    // Offset: 0x117F10C
    void PerformOneTimeSetUp();
    // private System.Collections.IEnumerable RunChildren()
    // Offset: 0x117F56C
    System::Collections::IEnumerable* RunChildren();
    // private System.Void CreateChildWorkItems()
    // Offset: 0x117F630
    void CreateChildWorkItems();
    // private System.Void SortChildren()
    // Offset: 0x117FDBC
    void SortChildren();
    // private System.Void SkipFixture(NUnit.Framework.Interfaces.ResultState resultState, System.String message, System.String stackTrace)
    // Offset: 0x117FE54
    void SkipFixture(NUnit::Framework::Interfaces::ResultState* resultState, ::Il2CppString* message, ::Il2CppString* stackTrace);
    // private System.Void SkipChildren(NUnit.Framework.Internal.TestSuite suite, NUnit.Framework.Interfaces.ResultState resultState, System.String message)
    // Offset: 0x117FF60
    void SkipChildren(NUnit::Framework::Internal::TestSuite* suite, NUnit::Framework::Interfaces::ResultState* resultState, ::Il2CppString* message);
    // private System.Void PerformOneTimeTearDown()
    // Offset: 0x11804BC
    void PerformOneTimeTearDown();
    // private System.String GetSkipReason()
    // Offset: 0x11804E4
    ::Il2CppString* GetSkipReason();
    // private System.String GetProviderStackTrace()
    // Offset: 0x11805DC
    ::Il2CppString* GetProviderStackTrace();
    // private System.Void CountDownChildTest()
    // Offset: 0x11806D4
    void CountDownChildTest();
    // protected override System.Collections.IEnumerable PerformWork()
    // Offset: 0x117EA2C
    // Implemented from: UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem
    // Base method: System.Collections.IEnumerable UnityWorkItem::PerformWork()
    System::Collections::IEnumerable* PerformWork();
    // public override System.Void Cancel(System.Boolean force)
    // Offset: 0x1180CE8
    // Implemented from: UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem
    // Base method: System.Void UnityWorkItem::Cancel(System.Boolean force)
    void Cancel(bool force);
  }; // UnityEngine.TestRunner.NUnitExtensions.Runner.CompositeWorkItem
  static check_size<sizeof(CompositeWorkItem), 144 + sizeof(NUnit::Framework::Internal::Execution::CountdownEvent*)> __UnityEngine_TestRunner_NUnitExtensions_Runner_CompositeWorkItemSizeCheck;
  static_assert(sizeof(CompositeWorkItem) == 0x98);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::TestRunner::NUnitExtensions::Runner::CompositeWorkItem*, "UnityEngine.TestRunner.NUnitExtensions.Runner", "CompositeWorkItem");
#pragma pack(pop)
