// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: NUnit.Framework.Internal.Execution.WorkItemState
#include "NUnit/Framework/Internal/Execution/WorkItemState.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TestRunner::NUnitExtensions::Runner
namespace UnityEngine::TestRunner::NUnitExtensions::Runner {
  // Forward declaring type: WorkItemFactory
  class WorkItemFactory;
  // Forward declaring type: UnityTestExecutionContext
  class UnityTestExecutionContext;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: EventHandler
  class EventHandler;
}
// Forward declaring namespace: NUnit::Framework::Internal
namespace NUnit::Framework::Internal {
  // Forward declaring type: Test
  class Test;
  // Forward declaring type: TestResult
  class TestResult;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: NUnit::Framework
namespace NUnit::Framework {
  // Forward declaring type: ITestAction
  class ITestAction;
}
// Forward declaring namespace: NUnit::Framework::Interfaces
namespace NUnit::Framework::Interfaces {
  // Forward declaring type: ITest
  class ITest;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerable
  class IEnumerable;
}
// Completed forward declares
// Type namespace: UnityEngine.TestRunner.NUnitExtensions.Runner
namespace UnityEngine::TestRunner::NUnitExtensions::Runner {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem
  class UnityWorkItem : public ::Il2CppObject {
    public:
    // protected readonly UnityEngine.TestRunner.NUnitExtensions.Runner.WorkItemFactory m_Factory
    // Size: 0x8
    // Offset: 0x10
    UnityEngine::TestRunner::NUnitExtensions::Runner::WorkItemFactory* m_Factory;
    // Field size check
    static_assert(sizeof(UnityEngine::TestRunner::NUnitExtensions::Runner::WorkItemFactory*) == 0x8);
    // protected System.Boolean m_ExecuteTestStartEvent
    // Size: 0x1
    // Offset: 0x18
    bool m_ExecuteTestStartEvent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_DontRunRestoringResult
    // Size: 0x1
    // Offset: 0x19
    bool m_DontRunRestoringResult;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DontRunRestoringResult and: Completed
    char __padding2[0x6] = {};
    // [CompilerGeneratedAttribute] Offset: 0xE3DDA0
    // private System.EventHandler Completed
    // Size: 0x8
    // Offset: 0x20
    System::EventHandler* Completed;
    // Field size check
    static_assert(sizeof(System::EventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE3DDB0
    // private System.Boolean <ResultedInDomainReload>k__BackingField
    // Size: 0x1
    // Offset: 0x28
    bool ResultedInDomainReload;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ResultedInDomainReload and: Context
    char __padding4[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xE3DDC0
    // private UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext <Context>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* Context;
    // Field size check
    static_assert(sizeof(UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE3DDD0
    // private NUnit.Framework.Internal.Test <Test>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    NUnit::Framework::Internal::Test* Test;
    // Field size check
    static_assert(sizeof(NUnit::Framework::Internal::Test*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE3DDE0
    // private NUnit.Framework.Internal.TestResult <Result>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    NUnit::Framework::Internal::TestResult* Result;
    // Field size check
    static_assert(sizeof(NUnit::Framework::Internal::TestResult*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE3DDF0
    // private NUnit.Framework.Internal.Execution.WorkItemState <State>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    NUnit::Framework::Internal::Execution::WorkItemState State;
    // Field size check
    static_assert(sizeof(NUnit::Framework::Internal::Execution::WorkItemState) == 0x4);
    // Padding between fields: State and: Actions
    char __padding8[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xE3DE00
    // private System.Collections.Generic.List`1<NUnit.Framework.ITestAction> <Actions>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    System::Collections::Generic::List_1<NUnit::Framework::ITestAction*>* Actions;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<NUnit::Framework::ITestAction*>*) == 0x8);
    // Creating value type constructor for type: UnityWorkItem
    UnityWorkItem(UnityEngine::TestRunner::NUnitExtensions::Runner::WorkItemFactory* m_Factory_ = {}, bool m_ExecuteTestStartEvent_ = {}, bool m_DontRunRestoringResult_ = {}, System::EventHandler* Completed_ = {}, bool ResultedInDomainReload_ = {}, UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* Context_ = {}, NUnit::Framework::Internal::Test* Test_ = {}, NUnit::Framework::Internal::TestResult* Result_ = {}, NUnit::Framework::Internal::Execution::WorkItemState State_ = {}, System::Collections::Generic::List_1<NUnit::Framework::ITestAction*>* Actions_ = {}) noexcept : m_Factory{m_Factory_}, m_ExecuteTestStartEvent{m_ExecuteTestStartEvent_}, m_DontRunRestoringResult{m_DontRunRestoringResult_}, Completed{Completed_}, ResultedInDomainReload{ResultedInDomainReload_}, Context{Context_}, Test{Test_}, Result{Result_}, State{State_}, Actions{Actions_} {}
    // static field const value: static protected System.Int32 k_DefaultTimeout
    static constexpr const int k_DefaultTimeout = 180000;
    // Get static field: static protected System.Int32 k_DefaultTimeout
    static int _get_k_DefaultTimeout();
    // Set static field: static protected System.Int32 k_DefaultTimeout
    static void _set_k_DefaultTimeout(int value);
    // public System.Boolean get_ResultedInDomainReload()
    // Offset: 0x14AF504
    bool get_ResultedInDomainReload();
    // System.Void set_ResultedInDomainReload(System.Boolean value)
    // Offset: 0x14AF50C
    void set_ResultedInDomainReload(bool value);
    // public UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext get_Context()
    // Offset: 0x14AF518
    UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* get_Context();
    // private System.Void set_Context(UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext value)
    // Offset: 0x14AF520
    void set_Context(UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* value);
    // public NUnit.Framework.Internal.Test get_Test()
    // Offset: 0x14AF528
    NUnit::Framework::Internal::Test* get_Test();
    // private System.Void set_Test(NUnit.Framework.Internal.Test value)
    // Offset: 0x14AF530
    void set_Test(NUnit::Framework::Internal::Test* value);
    // public NUnit.Framework.Internal.TestResult get_Result()
    // Offset: 0x14AF538
    NUnit::Framework::Internal::TestResult* get_Result();
    // protected System.Void set_Result(NUnit.Framework.Internal.TestResult value)
    // Offset: 0x14AF540
    void set_Result(NUnit::Framework::Internal::TestResult* value);
    // public NUnit.Framework.Internal.Execution.WorkItemState get_State()
    // Offset: 0x14AF548
    NUnit::Framework::Internal::Execution::WorkItemState get_State();
    // private System.Void set_State(NUnit.Framework.Internal.Execution.WorkItemState value)
    // Offset: 0x14AF550
    void set_State(NUnit::Framework::Internal::Execution::WorkItemState value);
    // public System.Collections.Generic.List`1<NUnit.Framework.ITestAction> get_Actions()
    // Offset: 0x14AF558
    System::Collections::Generic::List_1<NUnit::Framework::ITestAction*>* get_Actions();
    // private System.Void set_Actions(System.Collections.Generic.List`1<NUnit.Framework.ITestAction> value)
    // Offset: 0x14AF560
    void set_Actions(System::Collections::Generic::List_1<NUnit::Framework::ITestAction*>* value);
    // protected System.Void .ctor(NUnit.Framework.Internal.Test test, UnityEngine.TestRunner.NUnitExtensions.Runner.WorkItemFactory factory)
    // Offset: 0x14A6850
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UnityWorkItem* New_ctor(NUnit::Framework::Internal::Test* test, UnityEngine::TestRunner::NUnitExtensions::Runner::WorkItemFactory* factory) {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UnityWorkItem*, creationType>(test, factory)));
    }
    // static protected System.Boolean ShouldRestore(NUnit.Framework.Interfaces.ITest loadedTest)
    // Offset: 0x14AF668
    static bool ShouldRestore(NUnit::Framework::Interfaces::ITest* loadedTest);
    // protected System.Boolean ShouldExecuteStartEvent()
    // Offset: 0x14AF568
    bool ShouldExecuteStartEvent();
    // protected System.Collections.IEnumerable PerformWork()
    // Offset: 0xFFFFFFFF
    System::Collections::IEnumerable* PerformWork();
    // public System.Void InitializeContext(UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext context)
    // Offset: 0x14A9CD4
    void InitializeContext(UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* context);
    // public System.Collections.IEnumerable Execute()
    // Offset: 0x14AF890
    System::Collections::IEnumerable* Execute();
    // protected System.Void WorkItemComplete()
    // Offset: 0x14A89D8
    void WorkItemComplete();
    // public System.Void Cancel(System.Boolean force)
    // Offset: 0x14AFA0C
    void Cancel(bool force);
    // private System.Boolean <ShouldExecuteStartEvent>b__33_0(System.String x)
    // Offset: 0x14AFB24
    bool $ShouldExecuteStartEvent$b__33_0(::Il2CppString* x);
  }; // UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem
  #pragma pack(pop)
  static check_size<sizeof(UnityWorkItem), 80 + sizeof(System::Collections::Generic::List_1<NUnit::Framework::ITestAction*>*)> __UnityEngine_TestRunner_NUnitExtensions_Runner_UnityWorkItemSizeCheck;
  static_assert(sizeof(UnityWorkItem) == 0x58);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem*, "UnityEngine.TestRunner.NUnitExtensions.Runner", "UnityWorkItem");
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::get_ResultedInDomainReload
// Il2CppName: get_ResultedInDomainReload
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::set_ResultedInDomainReload
// Il2CppName: set_ResultedInDomainReload
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::get_Context
// Il2CppName: get_Context
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::set_Context
// Il2CppName: set_Context
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::get_Test
// Il2CppName: get_Test
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::set_Test
// Il2CppName: set_Test
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::get_Result
// Il2CppName: get_Result
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::set_Result
// Il2CppName: set_Result
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::get_State
// Il2CppName: get_State
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::set_State
// Il2CppName: set_State
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::get_Actions
// Il2CppName: get_Actions
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::set_Actions
// Il2CppName: set_Actions
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::ShouldRestore
// Il2CppName: ShouldRestore
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::ShouldExecuteStartEvent
// Il2CppName: ShouldExecuteStartEvent
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::PerformWork
// Il2CppName: PerformWork
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::InitializeContext
// Il2CppName: InitializeContext
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::Execute
// Il2CppName: Execute
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::WorkItemComplete
// Il2CppName: WorkItemComplete
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::Cancel
// Il2CppName: Cancel
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem::$ShouldExecuteStartEvent$b__33_0
// Il2CppName: <ShouldExecuteStartEvent>b__33_0
// Cannot perform method pointer template specialization from operators!
