// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: NUnit.Framework.Internal.ITestExecutionContext
#include "NUnit/Framework/Internal/ITestExecutionContext.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: NUnit.Framework.Internal.TestExecutionStatus
#include "NUnit/Framework/Internal/TestExecutionStatus.hpp"
// Including type: NUnit.Framework.ParallelScope
#include "NUnit/Framework/ParallelScope.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: NUnit::Framework::Internal
namespace NUnit::Framework::Internal {
  // Forward declaring type: TestResult
  class TestResult;
  // Forward declaring type: Test
  class Test;
  // Forward declaring type: Randomizer
  class Randomizer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: NUnit::Framework
namespace NUnit::Framework {
  // Forward declaring type: ITestAction
  class ITestAction;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: NUnit::Framework::Interfaces
namespace NUnit::Framework::Interfaces {
  // Forward declaring type: ITestListener
  class ITestListener;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: TextWriter
  class TextWriter;
}
// Forward declaring namespace: NUnit::Framework::Internal::Execution
namespace NUnit::Framework::Internal::Execution {
  // Forward declaring type: IWorkItemDispatcher
  class IWorkItemDispatcher;
}
// Forward declaring namespace: NUnit::Framework::Constraints
namespace NUnit::Framework::Constraints {
  // Forward declaring type: ValueFormatter
  class ValueFormatter;
}
// Forward declaring namespace: UnityEngine::TestTools
namespace UnityEngine::TestTools {
  // Forward declaring type: BeforeAfterTestCommandState
  class BeforeAfterTestCommandState;
  // Forward declaring type: EnumerableTestState
  class EnumerableTestState;
}
// Completed forward declares
// Type namespace: UnityEngine.TestRunner.NUnitExtensions.Runner
namespace UnityEngine::TestRunner::NUnitExtensions::Runner {
  // Forward declaring type: UnityTestExecutionContext
  class UnityTestExecutionContext;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext*, "UnityEngine.TestRunner.NUnitExtensions.Runner", "UnityTestExecutionContext");
// Type namespace: UnityEngine.TestRunner.NUnitExtensions.Runner
namespace UnityEngine::TestRunner::NUnitExtensions::Runner {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext
  // [TokenAttribute] Offset: FFFFFFFF
  class UnityTestExecutionContext : public ::Il2CppObject/*, public ::NUnit::Framework::Internal::ITestExecutionContext*/ {
    public:
    public:
    // private readonly UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext _priorContext
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* priorContext;
    // Field size check
    static_assert(sizeof(::UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext*) == 0x8);
    // private NUnit.Framework.Internal.TestResult _currentResult
    // Size: 0x8
    // Offset: 0x18
    ::NUnit::Framework::Internal::TestResult* currentResult;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Internal::TestResult*) == 0x8);
    // private System.Int32 _assertCount
    // Size: 0x4
    // Offset: 0x20
    int assertCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: assertCount and: Context
    char __padding2[0x4] = {};
    // private UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext <Context>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* Context;
    // Field size check
    static_assert(sizeof(::UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext*) == 0x8);
    // private NUnit.Framework.Internal.Test <CurrentTest>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::NUnit::Framework::Internal::Test* CurrentTest;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Internal::Test*) == 0x8);
    // private System.DateTime <StartTime>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::System::DateTime StartTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.Int64 <StartTicks>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    int64_t StartTicks;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Object <TestObject>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* TestObject;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.String <WorkDirectory>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::StringW WorkDirectory;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private NUnit.Framework.Internal.TestExecutionStatus _executionStatus
    // Size: 0x4
    // Offset: 0x58
    ::NUnit::Framework::Internal::TestExecutionStatus executionStatus;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Internal::TestExecutionStatus) == 0x4);
    // Padding between fields: executionStatus and: UpstreamActions
    char __padding9[0x4] = {};
    // private System.Collections.Generic.List`1<NUnit.Framework.ITestAction> <UpstreamActions>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::NUnit::Framework::ITestAction*>* UpstreamActions;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::NUnit::Framework::ITestAction*>*) == 0x8);
    // private System.Int32 <TestCaseTimeout>k__BackingField
    // Size: 0x4
    // Offset: 0x68
    int TestCaseTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: TestCaseTimeout and: CurrentCulture
    char __padding11[0x4] = {};
    // private System.Globalization.CultureInfo <CurrentCulture>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::System::Globalization::CultureInfo* CurrentCulture;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureInfo*) == 0x8);
    // private System.Globalization.CultureInfo <CurrentUICulture>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::System::Globalization::CultureInfo* CurrentUICulture;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureInfo*) == 0x8);
    // private NUnit.Framework.Interfaces.ITestListener <Listener>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::NUnit::Framework::Interfaces::ITestListener* Listener;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Interfaces::ITestListener*) == 0x8);
    // private System.IO.TextWriter <OutWriter>k__BackingField
    // Size: 0x8
    // Offset: 0x88
    ::System::IO::TextWriter* OutWriter;
    // Field size check
    static_assert(sizeof(::System::IO::TextWriter*) == 0x8);
    // private System.Boolean <StopOnError>k__BackingField
    // Size: 0x1
    // Offset: 0x90
    bool StopOnError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: StopOnError and: Dispatcher
    char __padding16[0x7] = {};
    // private NUnit.Framework.Internal.Execution.IWorkItemDispatcher <Dispatcher>k__BackingField
    // Size: 0x8
    // Offset: 0x98
    ::NUnit::Framework::Internal::Execution::IWorkItemDispatcher* Dispatcher;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Internal::Execution::IWorkItemDispatcher*) == 0x8);
    // private NUnit.Framework.ParallelScope <ParallelScope>k__BackingField
    // Size: 0x4
    // Offset: 0xA0
    ::NUnit::Framework::ParallelScope ParallelScope;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::ParallelScope) == 0x4);
    // Padding between fields: ParallelScope and: WorkerId
    char __padding18[0x4] = {};
    // private System.String <WorkerId>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::StringW WorkerId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private NUnit.Framework.Internal.Randomizer <RandomGenerator>k__BackingField
    // Size: 0x8
    // Offset: 0xB0
    ::NUnit::Framework::Internal::Randomizer* RandomGenerator;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Internal::Randomizer*) == 0x8);
    // private NUnit.Framework.Constraints.ValueFormatter <CurrentValueFormatter>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::NUnit::Framework::Constraints::ValueFormatter* CurrentValueFormatter;
    // Field size check
    static_assert(sizeof(::NUnit::Framework::Constraints::ValueFormatter*) == 0x8);
    // private System.Boolean <IsSingleThreaded>k__BackingField
    // Size: 0x1
    // Offset: 0xC0
    bool IsSingleThreaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsSingleThreaded and: SetUpTearDownState
    char __padding22[0x7] = {};
    // private UnityEngine.TestTools.BeforeAfterTestCommandState <SetUpTearDownState>k__BackingField
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::TestTools::BeforeAfterTestCommandState* SetUpTearDownState;
    // Field size check
    static_assert(sizeof(::UnityEngine::TestTools::BeforeAfterTestCommandState*) == 0x8);
    // private UnityEngine.TestTools.BeforeAfterTestCommandState <OuterUnityTestActionState>k__BackingField
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::TestTools::BeforeAfterTestCommandState* OuterUnityTestActionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::TestTools::BeforeAfterTestCommandState*) == 0x8);
    // private UnityEngine.TestTools.EnumerableTestState <EnumerableTestState>k__BackingField
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::TestTools::EnumerableTestState* EnumerableTestState;
    // Field size check
    static_assert(sizeof(::UnityEngine::TestTools::EnumerableTestState*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::NUnit::Framework::Internal::ITestExecutionContext
    operator ::NUnit::Framework::Internal::ITestExecutionContext() noexcept {
      return *reinterpret_cast<::NUnit::Framework::Internal::ITestExecutionContext*>(this);
    }
    // Creating interface conversion operator: i_ITestExecutionContext
    inline ::NUnit::Framework::Internal::ITestExecutionContext* i_ITestExecutionContext() noexcept {
      return reinterpret_cast<::NUnit::Framework::Internal::ITestExecutionContext*>(this);
    }
    // Get static field: static private UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext <CurrentContext>k__BackingField
