// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: NUnit.Framework.Internal.Execution.WorkItemState
#include "NUnit/Framework/Internal/Execution/WorkItemState.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TestRunner::NUnitExtensions::Runner
namespace UnityEngine::TestRunner::NUnitExtensions::Runner {
  // Forward declaring type: WorkItemFactory
  class WorkItemFactory;
  // Forward declaring type: UnityTestExecutionContext
  class UnityTestExecutionContext;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: EventHandler
  class EventHandler;
}
// Forward declaring namespace: NUnit::Framework::Internal
namespace NUnit::Framework::Internal {
  // Forward declaring type: Test
  class Test;
  // Forward declaring type: TestResult
  class TestResult;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: NUnit::Framework
namespace NUnit::Framework {
  // Forward declaring type: ITestAction
  class ITestAction;
}
// Forward declaring namespace: NUnit::Framework::Interfaces
namespace NUnit::Framework::Interfaces {
  // Forward declaring type: ITest
  class ITest;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerable
  class IEnumerable;
}
// Completed forward declares
// Type namespace: UnityEngine.TestRunner.NUnitExtensions.Runner
namespace UnityEngine::TestRunner::NUnitExtensions::Runner {
  // Autogenerated type: UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem
  class UnityWorkItem : public ::Il2CppObject {
    public:
    // protected readonly UnityEngine.TestRunner.NUnitExtensions.Runner.WorkItemFactory m_Factory
    // Offset: 0x10
    UnityEngine::TestRunner::NUnitExtensions::Runner::WorkItemFactory* m_Factory;
    // protected System.Boolean m_ExecuteTestStartEvent
    // Offset: 0x18
    bool m_ExecuteTestStartEvent;
    // protected System.Boolean m_DontRunRestoringResult
    // Offset: 0x19
    bool m_DontRunRestoringResult;
    // private System.EventHandler Completed
    // Offset: 0x20
    System::EventHandler* Completed;
    // private System.Boolean <ResultedInDomainReload>k__BackingField
    // Offset: 0x28
    bool ResultedInDomainReload;
    // private UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext <Context>k__BackingField
    // Offset: 0x30
    UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* Context;
    // private NUnit.Framework.Internal.Test <Test>k__BackingField
    // Offset: 0x38
    NUnit::Framework::Internal::Test* Test;
    // private NUnit.Framework.Internal.TestResult <Result>k__BackingField
    // Offset: 0x40
    NUnit::Framework::Internal::TestResult* Result;
    // private NUnit.Framework.Internal.Execution.WorkItemState <State>k__BackingField
    // Offset: 0x48
    NUnit::Framework::Internal::Execution::WorkItemState State;
    // private System.Collections.Generic.List`1<NUnit.Framework.ITestAction> <Actions>k__BackingField
    // Offset: 0x50
    System::Collections::Generic::List_1<NUnit::Framework::ITestAction*>* Actions;
    // public System.Boolean get_ResultedInDomainReload()
    // Offset: 0x1187D60
    bool get_ResultedInDomainReload();
    // System.Void set_ResultedInDomainReload(System.Boolean value)
    // Offset: 0x1187D68
    void set_ResultedInDomainReload(bool value);
    // public UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext get_Context()
    // Offset: 0x1187D74
    UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* get_Context();
    // private System.Void set_Context(UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext value)
    // Offset: 0x1187D7C
    void set_Context(UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* value);
    // public NUnit.Framework.Internal.Test get_Test()
    // Offset: 0x1187D84
    NUnit::Framework::Internal::Test* get_Test();
    // private System.Void set_Test(NUnit.Framework.Internal.Test value)
    // Offset: 0x1187D8C
    void set_Test(NUnit::Framework::Internal::Test* value);
    // public NUnit.Framework.Internal.TestResult get_Result()
    // Offset: 0x1187D94
    NUnit::Framework::Internal::TestResult* get_Result();
    // protected System.Void set_Result(NUnit.Framework.Internal.TestResult value)
    // Offset: 0x1187D9C
    void set_Result(NUnit::Framework::Internal::TestResult* value);
    // public NUnit.Framework.Internal.Execution.WorkItemState get_State()
    // Offset: 0x1187DA4
    NUnit::Framework::Internal::Execution::WorkItemState get_State();
    // private System.Void set_State(NUnit.Framework.Internal.Execution.WorkItemState value)
    // Offset: 0x1187DAC
    void set_State(NUnit::Framework::Internal::Execution::WorkItemState value);
    // public System.Collections.Generic.List`1<NUnit.Framework.ITestAction> get_Actions()
    // Offset: 0x1187DB4
    System::Collections::Generic::List_1<NUnit::Framework::ITestAction*>* get_Actions();
    // private System.Void set_Actions(System.Collections.Generic.List`1<NUnit.Framework.ITestAction> value)
    // Offset: 0x1187DBC
    void set_Actions(System::Collections::Generic::List_1<NUnit::Framework::ITestAction*>* value);
    // protected System.Void .ctor(NUnit.Framework.Internal.Test test, UnityEngine.TestRunner.NUnitExtensions.Runner.WorkItemFactory factory)
    // Offset: 0x117E928
    static UnityWorkItem* New_ctor(NUnit::Framework::Internal::Test* test, UnityEngine::TestRunner::NUnitExtensions::Runner::WorkItemFactory* factory);
    // static protected System.Boolean ShouldRestore(NUnit.Framework.Interfaces.ITest loadedTest)
    // Offset: 0x1187EC4
    static bool ShouldRestore(NUnit::Framework::Interfaces::ITest* loadedTest);
    // protected System.Boolean ShouldExecuteStartEvent()
    // Offset: 0x1187DC4
    bool ShouldExecuteStartEvent();
    // protected System.Collections.IEnumerable PerformWork()
    // Offset: 0xFFFFFFFF
    System::Collections::IEnumerable* PerformWork();
    // public System.Void InitializeContext(UnityEngine.TestRunner.NUnitExtensions.Runner.UnityTestExecutionContext context)
    // Offset: 0x1181F0C
    void InitializeContext(UnityEngine::TestRunner::NUnitExtensions::Runner::UnityTestExecutionContext* context);
    // public System.Collections.IEnumerable Execute()
    // Offset: 0x11880EC
    System::Collections::IEnumerable* Execute();
    // protected System.Void WorkItemComplete()
    // Offset: 0x1180AF0
    void WorkItemComplete();
    // public System.Void Cancel(System.Boolean force)
    // Offset: 0x1188260
    void Cancel(bool force);
    // private System.Boolean <ShouldExecuteStartEvent>b__32_0(System.String x)
    // Offset: 0x1188378
    bool $ShouldExecuteStartEvent$b__32_0(::Il2CppString* x);
  }; // UnityEngine.TestRunner.NUnitExtensions.Runner.UnityWorkItem
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::TestRunner::NUnitExtensions::Runner::UnityWorkItem*, "UnityEngine.TestRunner.NUnitExtensions.Runner", "UnityWorkItem");
#pragma pack(pop)
