// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Runtime::Remoting::Messaging
namespace System::Runtime::Remoting::Messaging {
  // Forward declaring type: CADArgHolder
  class CADArgHolder;
  // Forward declaring type: IMethodMessage
  class IMethodMessage;
  // Forward declaring type: LogicalCallContext
  class LogicalCallContext;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: MethodBase
  class MethodBase;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IDictionary
  class IDictionary;
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: System.Runtime.Remoting.Messaging
namespace System::Runtime::Remoting::Messaging {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: System.Runtime.Remoting.Messaging.CADMessageBase
  // [] Offset: FFFFFFFF
  class CADMessageBase : public ::Il2CppObject {
    public:
    // protected System.Object[] _args
    // Size: 0x8
    // Offset: 0x10
    ::Array<::Il2CppObject*>* args;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppObject*>*) == 0x8);
    // protected System.Byte[] _serializedArgs
    // Size: 0x8
    // Offset: 0x18
    ::Array<uint8_t>* serializedArgs;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // protected System.Int32 _propertyCount
    // Size: 0x4
    // Offset: 0x20
    int propertyCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: propertyCount and: callContext
    char __padding2[0x4] = {};
    // protected System.Runtime.Remoting.Messaging.CADArgHolder _callContext
    // Size: 0x8
    // Offset: 0x28
    System::Runtime::Remoting::Messaging::CADArgHolder* callContext;
    // Field size check
    static_assert(sizeof(System::Runtime::Remoting::Messaging::CADArgHolder*) == 0x8);
    // System.Byte[] serializedMethod
    // Size: 0x8
    // Offset: 0x30
    ::Array<uint8_t>* serializedMethod;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // Creating value type constructor for type: CADMessageBase
    CADMessageBase(::Array<::Il2CppObject*>* args_ = {}, ::Array<uint8_t>* serializedArgs_ = {}, int propertyCount_ = {}, System::Runtime::Remoting::Messaging::CADArgHolder* callContext_ = {}, ::Array<uint8_t>* serializedMethod_ = {}) noexcept : args{args_}, serializedArgs{serializedArgs_}, propertyCount{propertyCount_}, callContext{callContext_}, serializedMethod{serializedMethod_} {}
    // public System.Void .ctor(System.Runtime.Remoting.Messaging.IMethodMessage msg)
    // Offset: 0x18A7984
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CADMessageBase* New_ctor(System::Runtime::Remoting::Messaging::IMethodMessage* msg) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Runtime::Remoting::Messaging::CADMessageBase::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CADMessageBase*, creationType>(msg)));
    }
    // System.Reflection.MethodBase GetMethod()
    // Offset: 0x18A7D04
    System::Reflection::MethodBase* GetMethod();
    // static protected System.Type[] GetSignature(System.Reflection.MethodBase methodBase, System.Boolean load)
    // Offset: 0x18A81A8
    static ::Array<System::Type*>* GetSignature(System::Reflection::MethodBase* methodBase, bool load);
    // static System.Int32 MarshalProperties(System.Collections.IDictionary dict, ref System.Collections.ArrayList args)
    // Offset: 0x18A8358
    static int MarshalProperties(System::Collections::IDictionary* dict, System::Collections::ArrayList*& args);
    // static System.Void UnmarshalProperties(System.Collections.IDictionary dict, System.Int32 count, System.Collections.ArrayList args)
    // Offset: 0x18A8B94
    static void UnmarshalProperties(System::Collections::IDictionary* dict, int count, System::Collections::ArrayList* args);
    // static private System.Boolean IsPossibleToIgnoreMarshal(System.Object obj)
    // Offset: 0x18A8CD4
    static bool IsPossibleToIgnoreMarshal(::Il2CppObject* obj);
    // protected System.Object MarshalArgument(System.Object arg, ref System.Collections.ArrayList args)
    // Offset: 0x18A8E60
    ::Il2CppObject* MarshalArgument(::Il2CppObject* arg, System::Collections::ArrayList*& args);
    // protected System.Object UnmarshalArgument(System.Object arg, System.Collections.ArrayList args)
    // Offset: 0x18A90C0
    ::Il2CppObject* UnmarshalArgument(::Il2CppObject* arg, System::Collections::ArrayList* args);
    // System.Object[] MarshalArguments(System.Object[] arguments, ref System.Collections.ArrayList args)
    // Offset: 0x18A9788
    ::Array<::Il2CppObject*>* MarshalArguments(::Array<::Il2CppObject*>* arguments, System::Collections::ArrayList*& args);
    // System.Object[] UnmarshalArguments(System.Object[] arguments, System.Collections.ArrayList args)
    // Offset: 0x18A9898
    ::Array<::Il2CppObject*>* UnmarshalArguments(::Array<::Il2CppObject*>* arguments, System::Collections::ArrayList* args);
    // protected System.Void SaveLogicalCallContext(System.Runtime.Remoting.Messaging.IMethodMessage msg, ref System.Collections.ArrayList serializeList)
    // Offset: 0x18A99A8
    void SaveLogicalCallContext(System::Runtime::Remoting::Messaging::IMethodMessage* msg, System::Collections::ArrayList*& serializeList);
    // System.Runtime.Remoting.Messaging.LogicalCallContext GetLogicalCallContext(System.Collections.ArrayList args)
    // Offset: 0x18A9C4C
    System::Runtime::Remoting::Messaging::LogicalCallContext* GetLogicalCallContext(System::Collections::ArrayList* args);
  }; // System.Runtime.Remoting.Messaging.CADMessageBase
  #pragma pack(pop)
  static check_size<sizeof(CADMessageBase), 48 + sizeof(::Array<uint8_t>*)> __System_Runtime_Remoting_Messaging_CADMessageBaseSizeCheck;
  static_assert(sizeof(CADMessageBase) == 0x38);
}
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Remoting::Messaging::CADMessageBase*, "System.Runtime.Remoting.Messaging", "CADMessageBase");
