// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Collections.IDictionary
#include "System/Collections/IDictionary.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Runtime::Remoting::Messaging
namespace System::Runtime::Remoting::Messaging {
  // Forward declaring type: IMethodMessage
  class IMethodMessage;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: ICollection because it is already included!
  // Forward declaring type: IEnumerator
  class IEnumerator;
  // Forward declaring type: IDictionaryEnumerator
  class IDictionaryEnumerator;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Array
  class Array;
}
// Completed forward declares
// Type namespace: System.Runtime.Remoting.Messaging
namespace System::Runtime::Remoting::Messaging {
  // Size: 0x29
  #pragma pack(push, 1)
  // Autogenerated type: System.Runtime.Remoting.Messaging.MessageDictionary
  // [DefaultMemberAttribute] Offset: D7E7BC
  class MessageDictionary : public ::Il2CppObject/*, public System::Collections::IDictionary*/ {
    public:
    // Nested type: System::Runtime::Remoting::Messaging::MessageDictionary::DictionaryEnumerator
    class DictionaryEnumerator;
    // private System.Collections.IDictionary _internalProperties
    // Size: 0x8
    // Offset: 0x10
    System::Collections::IDictionary* internalProperties;
    // Field size check
    static_assert(sizeof(System::Collections::IDictionary*) == 0x8);
    // protected System.Runtime.Remoting.Messaging.IMethodMessage _message
    // Size: 0x8
    // Offset: 0x18
    System::Runtime::Remoting::Messaging::IMethodMessage* message;
    // Field size check
    static_assert(sizeof(System::Runtime::Remoting::Messaging::IMethodMessage*) == 0x8);
    // private System.String[] _methodKeys
    // Size: 0x8
    // Offset: 0x20
    ::Array<::Il2CppString*>* methodKeys;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // private System.Boolean _ownProperties
    // Size: 0x1
    // Offset: 0x28
    bool ownProperties;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: MessageDictionary
    MessageDictionary(System::Collections::IDictionary* internalProperties_ = {}, System::Runtime::Remoting::Messaging::IMethodMessage* message_ = {}, ::Array<::Il2CppString*>* methodKeys_ = {}, bool ownProperties_ = {}) noexcept : internalProperties{internalProperties_}, message{message_}, methodKeys{methodKeys_}, ownProperties{ownProperties_} {}
    // Creating interface conversion operator: operator System::Collections::IDictionary
    operator System::Collections::IDictionary() noexcept {
      return *reinterpret_cast<System::Collections::IDictionary*>(this);
    }
    // public System.Void .ctor(System.Runtime.Remoting.Messaging.IMethodMessage message)
    // Offset: 0x1A21F00
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MessageDictionary* New_ctor(System::Runtime::Remoting::Messaging::IMethodMessage* message) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Runtime::Remoting::Messaging::MessageDictionary::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MessageDictionary*, creationType>(message)));
    }
    // System.Boolean HasUserData()
    // Offset: 0x1A1E6D0
    bool HasUserData();
    // System.Collections.IDictionary get_InternalDictionary()
    // Offset: 0x1A1E7E0
    System::Collections::IDictionary* get_InternalDictionary();
    // public System.Void set_MethodKeys(System.String[] value)
    // Offset: 0x1A24FE4
    void set_MethodKeys(::Array<::Il2CppString*>* value);
    // protected System.Collections.IDictionary AllocInternalProperties()
    // Offset: 0x1A24FEC
    System::Collections::IDictionary* AllocInternalProperties();
    // public System.Collections.IDictionary GetInternalProperties()
    // Offset: 0x1A2125C
    System::Collections::IDictionary* GetInternalProperties();
    // private System.Boolean IsOverridenKey(System.String key)
    // Offset: 0x1A25054
    bool IsOverridenKey(::Il2CppString* key);
    // public System.Object get_Item(System.Object key)
    // Offset: 0x1A250EC
    ::Il2CppObject* get_Item(::Il2CppObject* key);
    // public System.Void set_Item(System.Object key, System.Object value)
    // Offset: 0x1A25244
    void set_Item(::Il2CppObject* key, ::Il2CppObject* value);
    // protected System.Object GetMethodProperty(System.String key)
    // Offset: 0x1A22318
    ::Il2CppObject* GetMethodProperty(::Il2CppString* key);
    // protected System.Void SetMethodProperty(System.String key, System.Object value)
    // Offset: 0x1A22B04
    void SetMethodProperty(::Il2CppString* key, ::Il2CppObject* value);
    // public System.Collections.ICollection get_Keys()
    // Offset: 0x1A253BC
    System::Collections::ICollection* get_Keys();
    // public System.Collections.ICollection get_Values()
    // Offset: 0x1A25768
    System::Collections::ICollection* get_Values();
    // public System.Void Add(System.Object key, System.Object value)
    // Offset: 0x1A25248
    void Add(::Il2CppObject* key, ::Il2CppObject* value);
    // public System.Boolean Contains(System.Object key)
    // Offset: 0x1A25AF8
    bool Contains(::Il2CppObject* key);
    // public System.Int32 get_Count()
    // Offset: 0x1A25C4C
    int get_Count();
    // public System.Void CopyTo(System.Array array, System.Int32 index)
    // Offset: 0x1A25D24
    void CopyTo(System::Array* array, int index);
    // private System.Collections.IEnumerator System.Collections.IEnumerable.GetEnumerator()
    // Offset: 0x1A25DF4
    System::Collections::IEnumerator* System_Collections_IEnumerable_GetEnumerator();
    // public System.Collections.IDictionaryEnumerator GetEnumerator()
    // Offset: 0x1A25F50
    System::Collections::IDictionaryEnumerator* GetEnumerator();
  }; // System.Runtime.Remoting.Messaging.MessageDictionary
  #pragma pack(pop)
  static check_size<sizeof(MessageDictionary), 40 + sizeof(bool)> __System_Runtime_Remoting_Messaging_MessageDictionarySizeCheck;
  static_assert(sizeof(MessageDictionary) == 0x29);
}
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Remoting::Messaging::MessageDictionary*, "System.Runtime.Remoting.Messaging", "MessageDictionary");
