// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: AimIK
  class AimIK;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.AimController
  class AimController : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: RootMotion::FinalIK::AimController::$TurnToTarget$d__33
    class $TurnToTarget$d__33;
    // public RootMotion.FinalIK.AimIK ik
    // Offset: 0x18
    RootMotion::FinalIK::AimIK* ik;
    // public System.Single weight
    // Offset: 0x20
    float weight;
    // public UnityEngine.Transform target
    // Offset: 0x28
    UnityEngine::Transform* target;
    // public System.Single targetSwitchSmoothTime
    // Offset: 0x30
    float targetSwitchSmoothTime;
    // public System.Single weightSmoothTime
    // Offset: 0x34
    float weightSmoothTime;
    // public System.Boolean smoothTurnTowardsTarget
    // Offset: 0x38
    bool smoothTurnTowardsTarget;
    // public System.Single maxRadiansDelta
    // Offset: 0x3C
    float maxRadiansDelta;
    // public System.Single maxMagnitudeDelta
    // Offset: 0x40
    float maxMagnitudeDelta;
    // public System.Single slerpSpeed
    // Offset: 0x44
    float slerpSpeed;
    // public UnityEngine.Vector3 pivotOffsetFromRoot
    // Offset: 0x48
    UnityEngine::Vector3 pivotOffsetFromRoot;
    // public System.Single minDistance
    // Offset: 0x54
    float minDistance;
    // public UnityEngine.Vector3 offset
    // Offset: 0x58
    UnityEngine::Vector3 offset;
    // public System.Single maxRootAngle
    // Offset: 0x64
    float maxRootAngle;
    // public System.Boolean turnToTarget
    // Offset: 0x68
    bool turnToTarget;
    // public System.Single turnToTargetTime
    // Offset: 0x6C
    float turnToTargetTime;
    // public System.Boolean useAnimatedAimDirection
    // Offset: 0x70
    bool useAnimatedAimDirection;
    // public UnityEngine.Vector3 animatedAimDirection
    // Offset: 0x74
    UnityEngine::Vector3 animatedAimDirection;
    // private UnityEngine.Transform lastTarget
    // Offset: 0x80
    UnityEngine::Transform* lastTarget;
    // private System.Single switchWeight
    // Offset: 0x88
    float switchWeight;
    // private System.Single switchWeightV
    // Offset: 0x8C
    float switchWeightV;
    // private System.Single weightV
    // Offset: 0x90
    float weightV;
    // private UnityEngine.Vector3 lastPosition
    // Offset: 0x94
    UnityEngine::Vector3 lastPosition;
    // private UnityEngine.Vector3 dir
    // Offset: 0xA0
    UnityEngine::Vector3 dir;
    // private System.Boolean lastSmoothTowardsTarget
    // Offset: 0xAC
    bool lastSmoothTowardsTarget;
    // private System.Boolean turningToTarget
    // Offset: 0xAD
    bool turningToTarget;
    // private System.Single turnToTargetMlp
    // Offset: 0xB0
    float turnToTargetMlp;
    // private System.Single turnToTargetMlpV
    // Offset: 0xB4
    float turnToTargetMlpV;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // private System.Void Start()
    // Offset: 0x13AB380
    void Start();
    // private System.Void LateUpdate()
    // Offset: 0x13AB5CC
    void LateUpdate();
    // private UnityEngine.Vector3 get_pivot()
    // Offset: 0x13AB480
    UnityEngine::Vector3 get_pivot();
    // private System.Void ApplyMinDistance()
    // Offset: 0x13ABD10
    void ApplyMinDistance();
    // private System.Void RootRotation()
    // Offset: 0x13ABEAC
    void RootRotation();
    // private System.Collections.IEnumerator TurnToTarget()
    // Offset: 0x13AC21C
    System::Collections::IEnumerator* TurnToTarget();
    // public System.Void .ctor()
    // Offset: 0x13AC2C4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static AimController* New_ctor();
  }; // RootMotion.FinalIK.AimController
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::AimController*, "RootMotion.FinalIK", "AimController");
#pragma pack(pop)
