// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.Amplifier
#include "RootMotion/FinalIK/Amplifier.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKSolverFullBodyBiped
  class IKSolverFullBodyBiped;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.Amplifier/Body
  class Amplifier::Body : public ::Il2CppObject {
    public:
    // Nested type: RootMotion::FinalIK::Amplifier::Body::EffectorLink
    class EffectorLink;
    // public UnityEngine.Transform transform
    // Offset: 0x10
    UnityEngine::Transform* transform;
    // public UnityEngine.Transform relativeTo
    // Offset: 0x18
    UnityEngine::Transform* relativeTo;
    // public RootMotion.FinalIK.Amplifier/Body/EffectorLink[] effectorLinks
    // Offset: 0x20
    ::Array<RootMotion::FinalIK::Amplifier::Body::EffectorLink*>* effectorLinks;
    // public System.Single verticalWeight
    // Offset: 0x28
    float verticalWeight;
    // public System.Single horizontalWeight
    // Offset: 0x2C
    float horizontalWeight;
    // public System.Single speed
    // Offset: 0x30
    float speed;
    // private UnityEngine.Vector3 lastRelativePos
    // Offset: 0x34
    UnityEngine::Vector3 lastRelativePos;
    // private UnityEngine.Vector3 smoothDelta
    // Offset: 0x40
    UnityEngine::Vector3 smoothDelta;
    // private System.Boolean firstUpdate
    // Offset: 0x4C
    bool firstUpdate;
    // public System.Void Update(RootMotion.FinalIK.IKSolverFullBodyBiped solver, System.Single w, System.Single deltaTime)
    // Offset: 0x13ACCE8
    void Update(RootMotion::FinalIK::IKSolverFullBodyBiped* solver, float w, float deltaTime);
    // static private UnityEngine.Vector3 Multiply(UnityEngine.Vector3 v1, UnityEngine.Vector3 v2)
    // Offset: 0x13AD154
    static UnityEngine::Vector3 Multiply(UnityEngine::Vector3 v1, UnityEngine::Vector3 v2);
    // public System.Void .ctor()
    // Offset: 0x13AD164
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static Amplifier::Body* New_ctor();
  }; // RootMotion.FinalIK.Amplifier/Body
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::Amplifier::Body*, "RootMotion.FinalIK", "Amplifier/Body");
#pragma pack(pop)
