// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKSolverLimb
  class IKSolverLimb;
  // Forward declaring type: IKSolverFABRIK
  class IKSolverFABRIK;
  // Forward declaring type: IKSolverLookAt
  class IKSolverLookAt;
  // Forward declaring type: IKSolverAim
  class IKSolverAim;
  // Forward declaring type: Constraints
  class Constraints;
  // Forward declaring type: IKSolver
  class IKSolver;
}
// Forward declaring namespace: RootMotion
namespace RootMotion {
  // Forward declaring type: BipedReferences
  class BipedReferences;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.BipedIKSolvers
  class BipedIKSolvers : public ::Il2CppObject {
    public:
    // public RootMotion.FinalIK.IKSolverLimb leftFoot
    // Offset: 0x10
    RootMotion::FinalIK::IKSolverLimb* leftFoot;
    // public RootMotion.FinalIK.IKSolverLimb rightFoot
    // Offset: 0x18
    RootMotion::FinalIK::IKSolverLimb* rightFoot;
    // public RootMotion.FinalIK.IKSolverLimb leftHand
    // Offset: 0x20
    RootMotion::FinalIK::IKSolverLimb* leftHand;
    // public RootMotion.FinalIK.IKSolverLimb rightHand
    // Offset: 0x28
    RootMotion::FinalIK::IKSolverLimb* rightHand;
    // public RootMotion.FinalIK.IKSolverFABRIK spine
    // Offset: 0x30
    RootMotion::FinalIK::IKSolverFABRIK* spine;
    // public RootMotion.FinalIK.IKSolverLookAt lookAt
    // Offset: 0x38
    RootMotion::FinalIK::IKSolverLookAt* lookAt;
    // public RootMotion.FinalIK.IKSolverAim aim
    // Offset: 0x40
    RootMotion::FinalIK::IKSolverAim* aim;
    // public RootMotion.FinalIK.Constraints pelvis
    // Offset: 0x48
    RootMotion::FinalIK::Constraints* pelvis;
    // private RootMotion.FinalIK.IKSolverLimb[] _limbs
    // Offset: 0x50
    ::Array<RootMotion::FinalIK::IKSolverLimb*>* limbs;
    // private RootMotion.FinalIK.IKSolver[] _ikSolvers
    // Offset: 0x58
    ::Array<RootMotion::FinalIK::IKSolver*>* ikSolvers;
    // public RootMotion.FinalIK.IKSolverLimb[] get_limbs()
    // Offset: 0x13AD8A8
    ::Array<RootMotion::FinalIK::IKSolverLimb*>* get_limbs();
    // public RootMotion.FinalIK.IKSolver[] get_ikSolvers()
    // Offset: 0x13AE57C
    ::Array<RootMotion::FinalIK::IKSolver*>* get_ikSolvers();
    // public System.Void AssignReferences(RootMotion.BipedReferences references)
    // Offset: 0x13ADCA4
    void AssignReferences(RootMotion::BipedReferences* references);
    // public System.Void .ctor()
    // Offset: 0x13AE3D4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static BipedIKSolvers* New_ctor();
  }; // RootMotion.FinalIK.BipedIKSolvers
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::BipedIKSolvers*, "RootMotion.FinalIK", "BipedIKSolvers");
#pragma pack(pop)
