// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.Constraints
  class Constraints : public ::Il2CppObject {
    public:
    // public UnityEngine.Transform transform
    // Offset: 0x10
    UnityEngine::Transform* transform;
    // public UnityEngine.Transform target
    // Offset: 0x18
    UnityEngine::Transform* target;
    // public UnityEngine.Vector3 positionOffset
    // Offset: 0x20
    UnityEngine::Vector3 positionOffset;
    // public UnityEngine.Vector3 position
    // Offset: 0x2C
    UnityEngine::Vector3 position;
    // public System.Single positionWeight
    // Offset: 0x38
    float positionWeight;
    // public UnityEngine.Vector3 rotationOffset
    // Offset: 0x3C
    UnityEngine::Vector3 rotationOffset;
    // public UnityEngine.Vector3 rotation
    // Offset: 0x48
    UnityEngine::Vector3 rotation;
    // public System.Single rotationWeight
    // Offset: 0x54
    float rotationWeight;
    // public System.Boolean IsValid()
    // Offset: 0x13AF450
    bool IsValid();
    // public System.Void Initiate(UnityEngine.Transform transform)
    // Offset: 0x13ADDC8
    void Initiate(UnityEngine::Transform* transform);
    // public System.Void Update()
    // Offset: 0x13ADFA8
    void Update();
    // public System.Void .ctor()
    // Offset: 0x13AE7AC
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static Constraints* New_ctor();
  }; // RootMotion.FinalIK.Constraints
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::Constraints*, "RootMotion.FinalIK", "Constraints");
#pragma pack(pop)
