// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: RootMotion.FinalIK.IKSolver
#include "RootMotion/FinalIK/IKSolver.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: FullBodyBipedIK
  class FullBodyBipedIK;
  // Forward declaring type: IKEffector
  class IKEffector;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x170
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.FBBIKHeadEffector
  class FBBIKHeadEffector : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: RootMotion::FinalIK::FBBIKHeadEffector::BendBone
    class BendBone;
    // [TooltipAttribute] Offset: 0xE08D0C
    // public RootMotion.FinalIK.FullBodyBipedIK ik
    // Size: 0x8
    // Offset: 0x18
    RootMotion::FinalIK::FullBodyBipedIK* ik;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::FullBodyBipedIK*) == 0x8);
    // [LargeHeader] Offset: 0xE08D44
    // [TooltipAttribute] Offset: 0xE08D44
    // [RangeAttribute] Offset: 0xE08D44
    // public System.Single positionWeight
    // Size: 0x4
    // Offset: 0x20
    float positionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE08DBC
    // [RangeAttribute] Offset: 0xE08DBC
    // public System.Single bodyWeight
    // Size: 0x4
    // Offset: 0x24
    float bodyWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE08E10
    // [RangeAttribute] Offset: 0xE08E10
    // public System.Single thighWeight
    // Size: 0x4
    // Offset: 0x28
    float thighWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE08E64
    // public System.Boolean handsPullBody
    // Size: 0x1
    // Offset: 0x2C
    bool handsPullBody;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: handsPullBody and: rotationWeight
    char __padding4[0x3] = {};
    // [LargeHeader] Offset: 0xE08E9C
    // [TooltipAttribute] Offset: 0xE08E9C
    // [RangeAttribute] Offset: 0xE08E9C
    // public System.Single rotationWeight
    // Size: 0x4
    // Offset: 0x30
    float rotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE08F14
    // [RangeAttribute] Offset: 0xE08F14
    // public System.Single bodyClampWeight
    // Size: 0x4
    // Offset: 0x34
    float bodyClampWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE08F68
    // [RangeAttribute] Offset: 0xE08F68
    // public System.Single headClampWeight
    // Size: 0x4
    // Offset: 0x38
    float headClampWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE08FBC
    // [RangeAttribute] Offset: 0xE08FBC
    // public System.Single bendWeight
    // Size: 0x4
    // Offset: 0x3C
    float bendWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE09010
    // public RootMotion.FinalIK.FBBIKHeadEffector/BendBone[] bendBones
    // Size: 0x8
    // Offset: 0x40
    ::Array<RootMotion::FinalIK::FBBIKHeadEffector::BendBone*>* bendBones;
    // Field size check
    static_assert(sizeof(::Array<RootMotion::FinalIK::FBBIKHeadEffector::BendBone*>*) == 0x8);
    // [LargeHeader] Offset: 0xE09048
    // [TooltipAttribute] Offset: 0xE09048
    // [RangeAttribute] Offset: 0xE09048
    // public System.Single CCDWeight
    // Size: 0x4
    // Offset: 0x48
    float CCDWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE090C0
    // [RangeAttribute] Offset: 0xE090C0
    // public System.Single roll
    // Size: 0x4
    // Offset: 0x4C
    float roll;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE09114
    // [RangeAttribute] Offset: 0xE09114
    // public System.Single damper
    // Size: 0x4
    // Offset: 0x50
    float damper;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: damper and: CCDBones
    char __padding12[0x4] = {};
    // [TooltipAttribute] Offset: 0xE0916C
    // public UnityEngine.Transform[] CCDBones
    // Size: 0x8
    // Offset: 0x58
    ::Array<UnityEngine::Transform*>* CCDBones;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Transform*>*) == 0x8);
    // [LargeHeader] Offset: 0xE091A4
    // [TooltipAttribute] Offset: 0xE091A4
    // [RangeAttribute] Offset: 0xE091A4
    // public System.Single postStretchWeight
    // Size: 0x4
    // Offset: 0x60
    float postStretchWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE0921C
    // public System.Single maxStretch
    // Size: 0x4
    // Offset: 0x64
    float maxStretch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE09254
    // public System.Single stretchDamper
    // Size: 0x4
    // Offset: 0x68
    float stretchDamper;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE0928C
    // public System.Boolean fixHead
    // Size: 0x1
    // Offset: 0x6C
    bool fixHead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fixHead and: stretchBones
    char __padding17[0x3] = {};
    // [TooltipAttribute] Offset: 0xE092C4
    // public UnityEngine.Transform[] stretchBones
    // Size: 0x8
    // Offset: 0x70
    ::Array<UnityEngine::Transform*>* stretchBones;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Transform*>*) == 0x8);
    // [LargeHeader] Offset: 0xE092FC
    // public UnityEngine.Vector3 chestDirection
    // Size: 0xC
    // Offset: 0x78
    UnityEngine::Vector3 chestDirection;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [RangeAttribute] Offset: 0xE09334
    // public System.Single chestDirectionWeight
    // Size: 0x4
    // Offset: 0x84
    float chestDirectionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Transform[] chestBones
    // Size: 0x8
    // Offset: 0x88
    ::Array<UnityEngine::Transform*>* chestBones;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Transform*>*) == 0x8);
    // public RootMotion.FinalIK.IKSolver/UpdateDelegate OnPostHeadEffectorFK
    // Size: 0x8
    // Offset: 0x90
    RootMotion::FinalIK::IKSolver::UpdateDelegate* OnPostHeadEffectorFK;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::IKSolver::UpdateDelegate*) == 0x8);
    // private UnityEngine.Vector3 offset
    // Size: 0xC
    // Offset: 0x98
    UnityEngine::Vector3 offset;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 headToBody
    // Size: 0xC
    // Offset: 0xA4
    UnityEngine::Vector3 headToBody;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 shoulderCenterToHead
    // Size: 0xC
    // Offset: 0xB0
    UnityEngine::Vector3 shoulderCenterToHead;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 headToLeftThigh
    // Size: 0xC
    // Offset: 0xBC
    UnityEngine::Vector3 headToLeftThigh;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 headToRightThigh
    // Size: 0xC
    // Offset: 0xC8
    UnityEngine::Vector3 headToRightThigh;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 leftShoulderPos
    // Size: 0xC
    // Offset: 0xD4
    UnityEngine::Vector3 leftShoulderPos;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 rightShoulderPos
    // Size: 0xC
    // Offset: 0xE0
    UnityEngine::Vector3 rightShoulderPos;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private System.Single shoulderDist
    // Size: 0x4
    // Offset: 0xEC
    float shoulderDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single leftShoulderDist
    // Size: 0x4
    // Offset: 0xF0
    float leftShoulderDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single rightShoulderDist
    // Size: 0x4
    // Offset: 0xF4
    float rightShoulderDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion chestRotation
    // Size: 0x10
    // Offset: 0xF8
    UnityEngine::Quaternion chestRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion headRotationRelativeToRoot
    // Size: 0x10
    // Offset: 0x108
    UnityEngine::Quaternion headRotationRelativeToRoot;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion[] ccdDefaultLocalRotations
    // Size: 0x8
    // Offset: 0x118
    ::Array<UnityEngine::Quaternion>* ccdDefaultLocalRotations;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Quaternion>*) == 0x8);
    // private UnityEngine.Vector3 headLocalPosition
    // Size: 0xC
    // Offset: 0x120
    UnityEngine::Vector3 headLocalPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion headLocalRotation
    // Size: 0x10
    // Offset: 0x12C
    UnityEngine::Quaternion headLocalRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // Padding between fields: headLocalRotation and: stretchLocalPositions
    char __padding37[0x4] = {};
    // private UnityEngine.Vector3[] stretchLocalPositions
    // Size: 0x8
    // Offset: 0x140
    ::Array<UnityEngine::Vector3>* stretchLocalPositions;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.Quaternion[] stretchLocalRotations
    // Size: 0x8
    // Offset: 0x148
    ::Array<UnityEngine::Quaternion>* stretchLocalRotations;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Quaternion>*) == 0x8);
    // private UnityEngine.Vector3[] chestLocalPositions
    // Size: 0x8
    // Offset: 0x150
    ::Array<UnityEngine::Vector3>* chestLocalPositions;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.Quaternion[] chestLocalRotations
    // Size: 0x8
    // Offset: 0x158
    ::Array<UnityEngine::Quaternion>* chestLocalRotations;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Quaternion>*) == 0x8);
    // private System.Int32 bendBonesCount
    // Size: 0x4
    // Offset: 0x160
    int bendBonesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 ccdBonesCount
    // Size: 0x4
    // Offset: 0x164
    int ccdBonesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 stretchBonesCount
    // Size: 0x4
    // Offset: 0x168
    int stretchBonesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chestBonesCount
    // Size: 0x4
    // Offset: 0x16C
    int chestBonesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: FBBIKHeadEffector
    FBBIKHeadEffector(RootMotion::FinalIK::FullBodyBipedIK* ik_ = {}, float positionWeight_ = {}, float bodyWeight_ = {}, float thighWeight_ = {}, bool handsPullBody_ = {}, float rotationWeight_ = {}, float bodyClampWeight_ = {}, float headClampWeight_ = {}, float bendWeight_ = {}, ::Array<RootMotion::FinalIK::FBBIKHeadEffector::BendBone*>* bendBones_ = {}, float CCDWeight_ = {}, float roll_ = {}, float damper_ = {}, ::Array<UnityEngine::Transform*>* CCDBones_ = {}, float postStretchWeight_ = {}, float maxStretch_ = {}, float stretchDamper_ = {}, bool fixHead_ = {}, ::Array<UnityEngine::Transform*>* stretchBones_ = {}, UnityEngine::Vector3 chestDirection_ = {}, float chestDirectionWeight_ = {}, ::Array<UnityEngine::Transform*>* chestBones_ = {}, RootMotion::FinalIK::IKSolver::UpdateDelegate* OnPostHeadEffectorFK_ = {}, UnityEngine::Vector3 offset_ = {}, UnityEngine::Vector3 headToBody_ = {}, UnityEngine::Vector3 shoulderCenterToHead_ = {}, UnityEngine::Vector3 headToLeftThigh_ = {}, UnityEngine::Vector3 headToRightThigh_ = {}, UnityEngine::Vector3 leftShoulderPos_ = {}, UnityEngine::Vector3 rightShoulderPos_ = {}, float shoulderDist_ = {}, float leftShoulderDist_ = {}, float rightShoulderDist_ = {}, UnityEngine::Quaternion chestRotation_ = {}, UnityEngine::Quaternion headRotationRelativeToRoot_ = {}, ::Array<UnityEngine::Quaternion>* ccdDefaultLocalRotations_ = {}, UnityEngine::Vector3 headLocalPosition_ = {}, UnityEngine::Quaternion headLocalRotation_ = {}, ::Array<UnityEngine::Vector3>* stretchLocalPositions_ = {}, ::Array<UnityEngine::Quaternion>* stretchLocalRotations_ = {}, ::Array<UnityEngine::Vector3>* chestLocalPositions_ = {}, ::Array<UnityEngine::Quaternion>* chestLocalRotations_ = {}, int bendBonesCount_ = {}, int ccdBonesCount_ = {}, int stretchBonesCount_ = {}, int chestBonesCount_ = {}) noexcept : ik{ik_}, positionWeight{positionWeight_}, bodyWeight{bodyWeight_}, thighWeight{thighWeight_}, handsPullBody{handsPullBody_}, rotationWeight{rotationWeight_}, bodyClampWeight{bodyClampWeight_}, headClampWeight{headClampWeight_}, bendWeight{bendWeight_}, bendBones{bendBones_}, CCDWeight{CCDWeight_}, roll{roll_}, damper{damper_}, CCDBones{CCDBones_}, postStretchWeight{postStretchWeight_}, maxStretch{maxStretch_}, stretchDamper{stretchDamper_}, fixHead{fixHead_}, stretchBones{stretchBones_}, chestDirection{chestDirection_}, chestDirectionWeight{chestDirectionWeight_}, chestBones{chestBones_}, OnPostHeadEffectorFK{OnPostHeadEffectorFK_}, offset{offset_}, headToBody{headToBody_}, shoulderCenterToHead{shoulderCenterToHead_}, headToLeftThigh{headToLeftThigh_}, headToRightThigh{headToRightThigh_}, leftShoulderPos{leftShoulderPos_}, rightShoulderPos{rightShoulderPos_}, shoulderDist{shoulderDist_}, leftShoulderDist{leftShoulderDist_}, rightShoulderDist{rightShoulderDist_}, chestRotation{chestRotation_}, headRotationRelativeToRoot{headRotationRelativeToRoot_}, ccdDefaultLocalRotations{ccdDefaultLocalRotations_}, headLocalPosition{headLocalPosition_}, headLocalRotation{headLocalRotation_}, stretchLocalPositions{stretchLocalPositions_}, stretchLocalRotations{stretchLocalRotations_}, chestLocalPositions{chestLocalPositions_}, chestLocalRotations{chestLocalRotations_}, bendBonesCount{bendBonesCount_}, ccdBonesCount{ccdBonesCount_}, stretchBonesCount{stretchBonesCount_}, chestBonesCount{chestBonesCount_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // private System.Void Start()
    // Offset: 0x1CB2404
    void Start();
    // private System.Void OnStoreDefaultLocalState()
    // Offset: 0x1CB2734
    void OnStoreDefaultLocalState();
    // private System.Void OnFixTransforms()
    // Offset: 0x1CB2BF4
    void OnFixTransforms();
    // private System.Void OnPreRead()
    // Offset: 0x1CB2FE8
    void OnPreRead();
    // private System.Void SpineBend()
    // Offset: 0x1CB3960
    void SpineBend();
    // private System.Void CCDPass()
    // Offset: 0x1CB3CAC
    void CCDPass();
    // private System.Void Iterate(System.Int32 iteration)
    // Offset: 0x1CB4048
    void Iterate(int iteration);
    // private System.Void OnPostUpdate()
    // Offset: 0x1CB4AB4
    void OnPostUpdate();
    // private System.Void ChestDirection()
    // Offset: 0x1CB368C
    void ChestDirection();
    // private System.Void PostStretching()
    // Offset: 0x1CB4CC4
    void PostStretching();
    // private System.Void LerpSolverPosition(RootMotion.FinalIK.IKEffector effector, UnityEngine.Vector3 position, System.Single weight, UnityEngine.Vector3 offset)
    // Offset: 0x1CB4970
    void LerpSolverPosition(RootMotion::FinalIK::IKEffector* effector, UnityEngine::Vector3 position, float weight, UnityEngine::Vector3 offset);
    // private System.Void Solve(ref UnityEngine.Vector3 pos1, ref UnityEngine.Vector3 pos2, System.Single nominalDistance)
    // Offset: 0x1CB47D4
    void Solve(UnityEngine::Vector3& pos1, UnityEngine::Vector3& pos2, float nominalDistance);
    // private System.Void OnDestroy()
    // Offset: 0x1CB5030
    void OnDestroy();
    // public System.Void .ctor()
    // Offset: 0x1CB52B0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FBBIKHeadEffector* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::FBBIKHeadEffector::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FBBIKHeadEffector*, creationType>()));
    }
  }; // RootMotion.FinalIK.FBBIKHeadEffector
  #pragma pack(pop)
  static check_size<sizeof(FBBIKHeadEffector), 364 + sizeof(int)> __RootMotion_FinalIK_FBBIKHeadEffectorSizeCheck;
  static_assert(sizeof(FBBIKHeadEffector) == 0x170);
  // Writing MetadataGetter for method: FBBIKHeadEffector::Start
  // Il2CppName: Start
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::Start)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::OnStoreDefaultLocalState
  // Il2CppName: OnStoreDefaultLocalState
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::OnStoreDefaultLocalState)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "OnStoreDefaultLocalState", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::OnFixTransforms
  // Il2CppName: OnFixTransforms
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::OnFixTransforms)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "OnFixTransforms", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::OnPreRead
  // Il2CppName: OnPreRead
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::OnPreRead)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "OnPreRead", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::SpineBend
  // Il2CppName: SpineBend
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::SpineBend)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "SpineBend", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::CCDPass
  // Il2CppName: CCDPass
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::CCDPass)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "CCDPass", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::Iterate
  // Il2CppName: Iterate
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)(int)>(&FBBIKHeadEffector::Iterate)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "Iterate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<int>()});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::OnPostUpdate
  // Il2CppName: OnPostUpdate
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::OnPostUpdate)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "OnPostUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::ChestDirection
  // Il2CppName: ChestDirection
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::ChestDirection)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "ChestDirection", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::PostStretching
  // Il2CppName: PostStretching
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::PostStretching)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "PostStretching", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::LerpSolverPosition
  // Il2CppName: LerpSolverPosition
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)(RootMotion::FinalIK::IKEffector*, UnityEngine::Vector3, float, UnityEngine::Vector3)>(&FBBIKHeadEffector::LerpSolverPosition)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "LerpSolverPosition", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<RootMotion::FinalIK::IKEffector*>(), ::il2cpp_utils::ExtractIndependentType<UnityEngine::Vector3>(), ::il2cpp_utils::ExtractIndependentType<float>(), ::il2cpp_utils::ExtractIndependentType<UnityEngine::Vector3>()});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::Solve
  // Il2CppName: Solve
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)(UnityEngine::Vector3&, UnityEngine::Vector3&, float)>(&FBBIKHeadEffector::Solve)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "Solve", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<UnityEngine::Vector3&>(), ::il2cpp_utils::ExtractIndependentType<UnityEngine::Vector3&>(), ::il2cpp_utils::ExtractIndependentType<float>()});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::OnDestroy
  // Il2CppName: OnDestroy
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::OnDestroy)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: FBBIKHeadEffector::New_ctor
  // Il2CppName: .ctor
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::New_ctor<::il2cpp_utils::CreationType::Temporary>)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), ".ctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (FBBIKHeadEffector::*)()>(&FBBIKHeadEffector::New_ctor<::il2cpp_utils::CreationType::Manual>)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(FBBIKHeadEffector*), ".ctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
}
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::FBBIKHeadEffector*, "RootMotion.FinalIK", "FBBIKHeadEffector");
