// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: RootMotion.FinalIK.IKSolver
#include "RootMotion/FinalIK/IKSolver.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: FullBodyBipedIK
  class FullBodyBipedIK;
  // Forward declaring type: IKEffector
  class IKEffector;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: FBBIKHeadEffector
  class FBBIKHeadEffector;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::RootMotion::FinalIK::FBBIKHeadEffector);
DEFINE_IL2CPP_ARG_TYPE(::RootMotion::FinalIK::FBBIKHeadEffector*, "RootMotion.FinalIK", "FBBIKHeadEffector");
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x170
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.FBBIKHeadEffector
  // [TokenAttribute] Offset: FFFFFFFF
  class FBBIKHeadEffector : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::RootMotion::FinalIK::FBBIKHeadEffector::BendBone
    class BendBone;
    public:
    // [TooltipAttribute] Offset: 0x110C39C
    // public RootMotion.FinalIK.FullBodyBipedIK ik
    // Size: 0x8
    // Offset: 0x18
    ::RootMotion::FinalIK::FullBodyBipedIK* ik;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::FullBodyBipedIK*) == 0x8);
    // [LargeHeader] Offset: 0x110C3D4
    // [TooltipAttribute] Offset: 0x110C3D4
    // [RangeAttribute] Offset: 0x110C3D4
    // public System.Single positionWeight
    // Size: 0x4
    // Offset: 0x20
    float positionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C44C
    // [RangeAttribute] Offset: 0x110C44C
    // public System.Single bodyWeight
    // Size: 0x4
    // Offset: 0x24
    float bodyWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C4A0
    // [RangeAttribute] Offset: 0x110C4A0
    // public System.Single thighWeight
    // Size: 0x4
    // Offset: 0x28
    float thighWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C4F4
    // public System.Boolean handsPullBody
    // Size: 0x1
    // Offset: 0x2C
    bool handsPullBody;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: handsPullBody and: rotationWeight
    char __padding4[0x3] = {};
    // [LargeHeader] Offset: 0x110C52C
    // [TooltipAttribute] Offset: 0x110C52C
    // [RangeAttribute] Offset: 0x110C52C
    // public System.Single rotationWeight
    // Size: 0x4
    // Offset: 0x30
    float rotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C5A4
    // [RangeAttribute] Offset: 0x110C5A4
    // public System.Single bodyClampWeight
    // Size: 0x4
    // Offset: 0x34
    float bodyClampWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C5F8
    // [RangeAttribute] Offset: 0x110C5F8
    // public System.Single headClampWeight
    // Size: 0x4
    // Offset: 0x38
    float headClampWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C64C
    // [RangeAttribute] Offset: 0x110C64C
    // public System.Single bendWeight
    // Size: 0x4
    // Offset: 0x3C
    float bendWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C6A0
    // public RootMotion.FinalIK.FBBIKHeadEffector/RootMotion.FinalIK.BendBone[] bendBones
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::RootMotion::FinalIK::FBBIKHeadEffector::BendBone*> bendBones;
    // Field size check
    static_assert(sizeof(::ArrayW<::RootMotion::FinalIK::FBBIKHeadEffector::BendBone*>) == 0x8);
    // [LargeHeader] Offset: 0x110C6D8
    // [TooltipAttribute] Offset: 0x110C6D8
    // [RangeAttribute] Offset: 0x110C6D8
    // public System.Single CCDWeight
    // Size: 0x4
    // Offset: 0x48
    float CCDWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C750
    // [RangeAttribute] Offset: 0x110C750
    // public System.Single roll
    // Size: 0x4
    // Offset: 0x4C
    float roll;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C7A4
    // [RangeAttribute] Offset: 0x110C7A4
    // public System.Single damper
    // Size: 0x4
    // Offset: 0x50
    float damper;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: damper and: CCDBones
    char __padding12[0x4] = {};
    // [TooltipAttribute] Offset: 0x110C7FC
    // public UnityEngine.Transform[] CCDBones
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::Transform*> CCDBones;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // [LargeHeader] Offset: 0x110C834
    // [TooltipAttribute] Offset: 0x110C834
    // [RangeAttribute] Offset: 0x110C834
    // public System.Single postStretchWeight
    // Size: 0x4
    // Offset: 0x60
    float postStretchWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C8AC
    // public System.Single maxStretch
    // Size: 0x4
    // Offset: 0x64
    float maxStretch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C8E4
    // public System.Single stretchDamper
    // Size: 0x4
    // Offset: 0x68
    float stretchDamper;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x110C91C
    // public System.Boolean fixHead
    // Size: 0x1
    // Offset: 0x6C
    bool fixHead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fixHead and: stretchBones
    char __padding17[0x3] = {};
    // [TooltipAttribute] Offset: 0x110C954
    // public UnityEngine.Transform[] stretchBones
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::Transform*> stretchBones;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // [LargeHeader] Offset: 0x110C98C
    // public UnityEngine.Vector3 chestDirection
    // Size: 0xC
    // Offset: 0x78
    ::UnityEngine::Vector3 chestDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [RangeAttribute] Offset: 0x110C9C4
    // public System.Single chestDirectionWeight
    // Size: 0x4
    // Offset: 0x84
    float chestDirectionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Transform[] chestBones
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::Transform*> chestBones;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // public RootMotion.FinalIK.IKSolver/RootMotion.FinalIK.UpdateDelegate OnPostHeadEffectorFK
    // Size: 0x8
    // Offset: 0x90
    ::RootMotion::FinalIK::IKSolver::UpdateDelegate* OnPostHeadEffectorFK;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::IKSolver::UpdateDelegate*) == 0x8);
    // private UnityEngine.Vector3 offset
    // Size: 0xC
    // Offset: 0x98
    ::UnityEngine::Vector3 offset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 headToBody
    // Size: 0xC
    // Offset: 0xA4
    ::UnityEngine::Vector3 headToBody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 shoulderCenterToHead
    // Size: 0xC
    // Offset: 0xB0
    ::UnityEngine::Vector3 shoulderCenterToHead;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 headToLeftThigh
    // Size: 0xC
    // Offset: 0xBC
    ::UnityEngine::Vector3 headToLeftThigh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 headToRightThigh
    // Size: 0xC
    // Offset: 0xC8
    ::UnityEngine::Vector3 headToRightThigh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 leftShoulderPos
    // Size: 0xC
    // Offset: 0xD4
    ::UnityEngine::Vector3 leftShoulderPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 rightShoulderPos
    // Size: 0xC
    // Offset: 0xE0
    ::UnityEngine::Vector3 rightShoulderPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single shoulderDist
    // Size: 0x4
    // Offset: 0xEC
    float shoulderDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single leftShoulderDist
    // Size: 0x4
    // Offset: 0xF0
    float leftShoulderDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single rightShoulderDist
    // Size: 0x4
    // Offset: 0xF4
    float rightShoulderDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion chestRotation
    // Size: 0x10
    // Offset: 0xF8
    ::UnityEngine::Quaternion chestRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion headRotationRelativeToRoot
    // Size: 0x10
    // Offset: 0x108
    ::UnityEngine::Quaternion headRotationRelativeToRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion[] ccdDefaultLocalRotations
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<::UnityEngine::Quaternion> ccdDefaultLocalRotations;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // private UnityEngine.Vector3 headLocalPosition
    // Size: 0xC
    // Offset: 0x120
    ::UnityEngine::Vector3 headLocalPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion headLocalRotation
    // Size: 0x10
    // Offset: 0x12C
    ::UnityEngine::Quaternion headLocalRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: headLocalRotation and: stretchLocalPositions
    char __padding37[0x4] = {};
    // private UnityEngine.Vector3[] stretchLocalPositions
    // Size: 0x8
    // Offset: 0x140
    ::ArrayW<::UnityEngine::Vector3> stretchLocalPositions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Quaternion[] stretchLocalRotations
    // Size: 0x8
    // Offset: 0x148
    ::ArrayW<::UnityEngine::Quaternion> stretchLocalRotations;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // private UnityEngine.Vector3[] chestLocalPositions
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::UnityEngine::Vector3> chestLocalPositions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Quaternion[] chestLocalRotations
    // Size: 0x8
    // Offset: 0x158
    ::ArrayW<::UnityEngine::Quaternion> chestLocalRotations;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // private System.Int32 bendBonesCount
    // Size: 0x4
    // Offset: 0x160
    int bendBonesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 ccdBonesCount
    // Size: 0x4
    // Offset: 0x164
    int ccdBonesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 stretchBonesCount
    // Size: 0x4
    // Offset: 0x168
    int stretchBonesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chestBonesCount
    // Size: 0x4
    // Offset: 0x16C
    int chestBonesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public RootMotion.FinalIK.FullBodyBipedIK ik
    [[deprecated("Use field access instead!")]] ::RootMotion::FinalIK::FullBodyBipedIK*& dyn_ik();
    // Get instance field reference: public System.Single positionWeight
    [[deprecated("Use field access instead!")]] float& dyn_positionWeight();
    // Get instance field reference: public System.Single bodyWeight
    [[deprecated("Use field access instead!")]] float& dyn_bodyWeight();
    // Get instance field reference: public System.Single thighWeight
    [[deprecated("Use field access instead!")]] float& dyn_thighWeight();
    // Get instance field reference: public System.Boolean handsPullBody
