// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: RootMotion.FinalIK.FBIKChain
#include "RootMotion/FinalIK/FBIKChain.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKSolverFullBody
  class IKSolverFullBody;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.ChildConstraint
  // [TokenAttribute] Offset: FFFFFFFF
  class FBIKChain::ChildConstraint : public ::Il2CppObject {
    public:
    // public System.Single pushElasticity
    // Size: 0x4
    // Offset: 0x10
    float pushElasticity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single pullElasticity
    // Size: 0x4
    // Offset: 0x14
    float pullElasticity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform bone1
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Transform* bone1;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform bone2
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::Transform* bone2;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private System.Single <nominalDistance>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    float nominalDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <isRigid>k__BackingField
    // Size: 0x1
    // Offset: 0x2C
    bool isRigid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isRigid and: crossFade
    char __padding5[0x3] = {};
    // private System.Single crossFade
    // Size: 0x4
    // Offset: 0x30
    float crossFade;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single inverseCrossFade
    // Size: 0x4
    // Offset: 0x34
    float inverseCrossFade;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 chain1Index
    // Size: 0x4
    // Offset: 0x38
    int chain1Index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chain2Index
    // Size: 0x4
    // Offset: 0x3C
    int chain2Index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: ChildConstraint
    ChildConstraint(float pushElasticity_ = {}, float pullElasticity_ = {}, UnityEngine::Transform* bone1_ = {}, UnityEngine::Transform* bone2_ = {}, float nominalDistance_ = {}, bool isRigid_ = {}, float crossFade_ = {}, float inverseCrossFade_ = {}, int chain1Index_ = {}, int chain2Index_ = {}) noexcept : pushElasticity{pushElasticity_}, pullElasticity{pullElasticity_}, bone1{bone1_}, bone2{bone2_}, nominalDistance{nominalDistance_}, isRigid{isRigid_}, crossFade{crossFade_}, inverseCrossFade{inverseCrossFade_}, chain1Index{chain1Index_}, chain2Index{chain2Index_} {}
    // Get instance field: public System.Single pushElasticity
    float _get_pushElasticity();
    // Set instance field: public System.Single pushElasticity
    void _set_pushElasticity(float value);
    // Get instance field: public System.Single pullElasticity
    float _get_pullElasticity();
    // Set instance field: public System.Single pullElasticity
    void _set_pullElasticity(float value);
    // Get instance field: private UnityEngine.Transform bone1
    UnityEngine::Transform* _get_bone1();
    // Set instance field: private UnityEngine.Transform bone1
    void _set_bone1(UnityEngine::Transform* value);
    // Get instance field: private UnityEngine.Transform bone2
    UnityEngine::Transform* _get_bone2();
    // Set instance field: private UnityEngine.Transform bone2
    void _set_bone2(UnityEngine::Transform* value);
    // Get instance field: private System.Single <nominalDistance>k__BackingField
    float _get_$nominalDistance$k__BackingField();
    // Set instance field: private System.Single <nominalDistance>k__BackingField
    void _set_$nominalDistance$k__BackingField(float value);
    // Get instance field: private System.Boolean <isRigid>k__BackingField
    bool _get_$isRigid$k__BackingField();
    // Set instance field: private System.Boolean <isRigid>k__BackingField
    void _set_$isRigid$k__BackingField(bool value);
    // Get instance field: private System.Single crossFade
    float _get_crossFade();
    // Set instance field: private System.Single crossFade
    void _set_crossFade(float value);
    // Get instance field: private System.Single inverseCrossFade
    float _get_inverseCrossFade();
    // Set instance field: private System.Single inverseCrossFade
    void _set_inverseCrossFade(float value);
    // Get instance field: private System.Int32 chain1Index
    int _get_chain1Index();
    // Set instance field: private System.Int32 chain1Index
    void _set_chain1Index(int value);
    // Get instance field: private System.Int32 chain2Index
    int _get_chain2Index();
    // Set instance field: private System.Int32 chain2Index
    void _set_chain2Index(int value);
    // public System.Single get_nominalDistance()
    // Offset: 0x1D39EC0
    float get_nominalDistance();
    // private System.Void set_nominalDistance(System.Single value)
    // Offset: 0x1D39EC8
    void set_nominalDistance(float value);
    // public System.Boolean get_isRigid()
    // Offset: 0x1D39ED0
    bool get_isRigid();
    // private System.Void set_isRigid(System.Boolean value)
    // Offset: 0x1D39ED8
    void set_isRigid(bool value);
    // public System.Void .ctor(UnityEngine.Transform bone1, UnityEngine.Transform bone2, System.Single pushElasticity, System.Single pullElasticity)
    // Offset: 0x1D39EE4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FBIKChain::ChildConstraint* New_ctor(UnityEngine::Transform* bone1, UnityEngine::Transform* bone2, float pushElasticity, float pullElasticity) {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::FBIKChain::ChildConstraint::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FBIKChain::ChildConstraint*, creationType>(bone1, bone2, pushElasticity, pullElasticity)));
    }
    // public System.Void Initiate(RootMotion.FinalIK.IKSolverFullBody solver)
    // Offset: 0x1D37C44
    void Initiate(RootMotion::FinalIK::IKSolverFullBody* solver);
    // public System.Void OnPreSolve(RootMotion.FinalIK.IKSolverFullBody solver)
    // Offset: 0x1D38184
    void OnPreSolve(RootMotion::FinalIK::IKSolverFullBody* solver);
    // public System.Void Solve(RootMotion.FinalIK.IKSolverFullBody solver)
    // Offset: 0x1D39BBC
    void Solve(RootMotion::FinalIK::IKSolverFullBody* solver);
  }; // RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.ChildConstraint
  #pragma pack(pop)
  static check_size<sizeof(FBIKChain::ChildConstraint), 60 + sizeof(int)> __RootMotion_FinalIK_FBIKChain_ChildConstraintSizeCheck;
  static_assert(sizeof(FBIKChain::ChildConstraint) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::FBIKChain::ChildConstraint*, "RootMotion.FinalIK", "FBIKChain/ChildConstraint");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: RootMotion::FinalIK::FBIKChain::ChildConstraint::get_nominalDistance
// Il2CppName: get_nominalDistance
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (RootMotion::FinalIK::FBIKChain::ChildConstraint::*)()>(&RootMotion::FinalIK::FBIKChain::ChildConstraint::get_nominalDistance)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::FBIKChain::ChildConstraint*), "get_nominalDistance", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::FBIKChain::ChildConstraint::set_nominalDistance
// Il2CppName: set_nominalDistance
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::FBIKChain::ChildConstraint::*)(float)>(&RootMotion::FinalIK::FBIKChain::ChildConstraint::set_nominalDistance)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::FBIKChain::ChildConstraint*), "set_nominalDistance", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::FBIKChain::ChildConstraint::get_isRigid
// Il2CppName: get_isRigid
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (RootMotion::FinalIK::FBIKChain::ChildConstraint::*)()>(&RootMotion::FinalIK::FBIKChain::ChildConstraint::get_isRigid)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::FBIKChain::ChildConstraint*), "get_isRigid", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::FBIKChain::ChildConstraint::set_isRigid
// Il2CppName: set_isRigid
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::FBIKChain::ChildConstraint::*)(bool)>(&RootMotion::FinalIK::FBIKChain::ChildConstraint::set_isRigid)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::FBIKChain::ChildConstraint*), "set_isRigid", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::FBIKChain::ChildConstraint::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: RootMotion::FinalIK::FBIKChain::ChildConstraint::Initiate
// Il2CppName: Initiate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::FBIKChain::ChildConstraint::*)(RootMotion::FinalIK::IKSolverFullBody*)>(&RootMotion::FinalIK::FBIKChain::ChildConstraint::Initiate)> {
  static const MethodInfo* get() {
    static auto* solver = &::il2cpp_utils::GetClassFromName("RootMotion.FinalIK", "IKSolverFullBody")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::FBIKChain::ChildConstraint*), "Initiate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{solver});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::FBIKChain::ChildConstraint::OnPreSolve
// Il2CppName: OnPreSolve
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::FBIKChain::ChildConstraint::*)(RootMotion::FinalIK::IKSolverFullBody*)>(&RootMotion::FinalIK::FBIKChain::ChildConstraint::OnPreSolve)> {
  static const MethodInfo* get() {
    static auto* solver = &::il2cpp_utils::GetClassFromName("RootMotion.FinalIK", "IKSolverFullBody")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::FBIKChain::ChildConstraint*), "OnPreSolve", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{solver});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::FBIKChain::ChildConstraint::Solve
// Il2CppName: Solve
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::FBIKChain::ChildConstraint::*)(RootMotion::FinalIK::IKSolverFullBody*)>(&RootMotion::FinalIK::FBIKChain::ChildConstraint::Solve)> {
  static const MethodInfo* get() {
    static auto* solver = &::il2cpp_utils::GetClassFromName("RootMotion.FinalIK", "IKSolverFullBody")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::FBIKChain::ChildConstraint*), "Solve", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{solver});
  }
};
