// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: RootMotion.FinalIK.IKSolver
#include "RootMotion/FinalIK/IKSolver.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKConstraintBend
  class IKConstraintBend;
  // Forward declaring type: IKSolverFullBody
  class IKSolverFullBody;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: FBIKChain
  class FBIKChain;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(RootMotion::FinalIK::FBIKChain);
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::FBIKChain*, "RootMotion.FinalIK", "FBIKChain");
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::FBIKChain::Smoothing, "RootMotion.FinalIK", "FBIKChain/Smoothing");
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x84
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.FBIKChain
  // [TokenAttribute] Offset: FFFFFFFF
  class FBIKChain : public ::Il2CppObject {
    public:
    // Nested type: RootMotion::FinalIK::FBIKChain::ChildConstraint
    class ChildConstraint;
    // Nested type: RootMotion::FinalIK::FBIKChain::Smoothing
    struct Smoothing;
    // Type namespace: RootMotion.FinalIK
    namespace RootMotion::FinalIK {
      // Forward declaring type: Smoothing
      struct Smoothing;
    }
    #include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
    DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::FBIKChain::Smoothing, "RootMotion.FinalIK", "FBIKChain/Smoothing");
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing
    // [TokenAttribute] Offset: FFFFFFFF
    struct Smoothing/*, public System::Enum*/ {
      public:
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      protected:
      #endif
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Smoothing
      constexpr Smoothing(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing None
      static constexpr const int None = 0;
      // Get static field: static public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing None
      static RootMotion::FinalIK::FBIKChain::Smoothing _get_None();
      // Set static field: static public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing None
      static void _set_None(RootMotion::FinalIK::FBIKChain::Smoothing value);
      // static field const value: static public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing Exponential
      static constexpr const int Exponential = 1;
      // Get static field: static public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing Exponential
      static RootMotion::FinalIK::FBIKChain::Smoothing _get_Exponential();
      // Set static field: static public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing Exponential
      static void _set_Exponential(RootMotion::FinalIK::FBIKChain::Smoothing value);
      // static field const value: static public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing Cubic
      static constexpr const int Cubic = 2;
      // Get static field: static public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing Cubic
      static RootMotion::FinalIK::FBIKChain::Smoothing _get_Cubic();
      // Set static field: static public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing Cubic
      static void _set_Cubic(RootMotion::FinalIK::FBIKChain::Smoothing value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing
    #pragma pack(pop)
    static check_size<sizeof(FBIKChain::Smoothing), 0 + sizeof(int)> __RootMotion_FinalIK_FBIKChain_SmoothingSizeCheck;
    static_assert(sizeof(FBIKChain::Smoothing) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // [RangeAttribute] Offset: 0xEF2B88
    // public System.Single pin
    // Size: 0x4
    // Offset: 0x10
    float pin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xEF2BA0
    // public System.Single pull
    // Size: 0x4
    // Offset: 0x14
    float pull;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xEF2BB8
    // public System.Single push
    // Size: 0x4
    // Offset: 0x18
    float push;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xEF2BD0
    // public System.Single pushParent
    // Size: 0x4
    // Offset: 0x1C
    float pushParent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xEF2BE8
    // public System.Single reach
    // Size: 0x4
    // Offset: 0x20
    float reach;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing reachSmoothing
    // Size: 0x4
    // Offset: 0x24
    RootMotion::FinalIK::FBIKChain::Smoothing reachSmoothing;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::FBIKChain::Smoothing) == 0x4);
    // public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.Smoothing pushSmoothing
    // Size: 0x4
    // Offset: 0x28
    RootMotion::FinalIK::FBIKChain::Smoothing pushSmoothing;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::FBIKChain::Smoothing) == 0x4);
    // Padding between fields: pushSmoothing and: nodes
    char __padding6[0x4] = {};
    // public RootMotion.FinalIK.IKSolver/RootMotion.FinalIK.Node[] nodes
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<RootMotion::FinalIK::IKSolver::Node*> nodes;
    // Field size check
    static_assert(sizeof(::ArrayW<RootMotion::FinalIK::IKSolver::Node*>) == 0x8);
    // public System.Int32[] children
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<int> children;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public RootMotion.FinalIK.FBIKChain/RootMotion.FinalIK.ChildConstraint[] childConstraints
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<RootMotion::FinalIK::FBIKChain::ChildConstraint*> childConstraints;
    // Field size check
    static_assert(sizeof(::ArrayW<RootMotion::FinalIK::FBIKChain::ChildConstraint*>) == 0x8);
    // public RootMotion.FinalIK.IKConstraintBend bendConstraint
    // Size: 0x8
    // Offset: 0x48
    RootMotion::FinalIK::IKConstraintBend* bendConstraint;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::IKConstraintBend*) == 0x8);
    // private System.Single rootLength
    // Size: 0x4
    // Offset: 0x50
    float rootLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean initiated
    // Size: 0x1
    // Offset: 0x54
    bool initiated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: initiated and: length
    char __padding12[0x3] = {};
    // private System.Single length
    // Size: 0x4
    // Offset: 0x58
    float length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single distance
    // Size: 0x4
    // Offset: 0x5C
    float distance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private RootMotion.FinalIK.IKSolver/RootMotion.FinalIK.Point p
    // Size: 0x8
    // Offset: 0x60
    RootMotion::FinalIK::IKSolver::Point* p;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::IKSolver::Point*) == 0x8);
    // private System.Single reachForce
    // Size: 0x4
    // Offset: 0x68
    float reachForce;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single pullParentSum
    // Size: 0x4
    // Offset: 0x6C
    float pullParentSum;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single[] crossFades
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<float> crossFades;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single sqrMag1
    // Size: 0x4
    // Offset: 0x78
    float sqrMag1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single sqrMag2
    // Size: 0x4
    // Offset: 0x7C
    float sqrMag2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single sqrMagDif
    // Size: 0x4
    // Offset: 0x80
    float sqrMagDif;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // static field const value: static private System.Single maxLimbLength
    static constexpr const float maxLimbLength = 0.99999;
    // Get static field: static private System.Single maxLimbLength
    static float _get_maxLimbLength();
    // Set static field: static private System.Single maxLimbLength
    static void _set_maxLimbLength(float value);
    // Get instance field reference: public System.Single pin
    float& dyn_pin();
    // Get instance field reference: public System.Single pull
    float& dyn_pull();
    // Get instance field reference: public System.Single push
    float& dyn_push();
    // Get instance field reference: public System.Single pushParent
    float& dyn_pushParent();
    // Get instance field reference: public System.Single reach
    float& dyn_reach();
