// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.Grounder
#include "RootMotion/FinalIK/Grounder.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IK
  class IK;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.GrounderIK
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: DF0948
  // [AddComponentMenu] Offset: DF0948
  class GrounderIK : public RootMotion::FinalIK::Grounder {
    public:
    // Writing base type padding for base size: 0x39 to desired offset: 0x40
    char ___base_padding[0x7] = {};
    // public RootMotion.FinalIK.IK[] legs
    // Size: 0x8
    // Offset: 0x40
    ::Array<RootMotion::FinalIK::IK*>* legs;
    // Field size check
    static_assert(sizeof(::Array<RootMotion::FinalIK::IK*>*) == 0x8);
    // [TooltipAttribute] Offset: 0xDF2D38
    // public UnityEngine.Transform pelvis
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::Transform* pelvis;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xDF2D70
    // public UnityEngine.Transform characterRoot
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::Transform* characterRoot;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xDF2DA8
    // [RangeAttribute] Offset: 0xDF2DA8
    // public System.Single rootRotationWeight
    // Size: 0x4
    // Offset: 0x58
    float rootRotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF2DFC
    // public System.Single rootRotationSpeed
    // Size: 0x4
    // Offset: 0x5C
    float rootRotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF2E34
    // public System.Single maxRootRotationAngle
    // Size: 0x4
    // Offset: 0x60
    float maxRootRotationAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: maxRootRotationAngle and: feet
    char __padding5[0x4] = {};
    // private UnityEngine.Transform[] feet
    // Size: 0x8
    // Offset: 0x68
    ::Array<UnityEngine::Transform*>* feet;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Transform*>*) == 0x8);
    // private UnityEngine.Quaternion[] footRotations
    // Size: 0x8
    // Offset: 0x70
    ::Array<UnityEngine::Quaternion>* footRotations;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Quaternion>*) == 0x8);
    // private UnityEngine.Vector3 animatedPelvisLocalPosition
    // Size: 0xC
    // Offset: 0x78
    UnityEngine::Vector3 animatedPelvisLocalPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 solvedPelvisLocalPosition
    // Size: 0xC
    // Offset: 0x84
    UnityEngine::Vector3 solvedPelvisLocalPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private System.Int32 solvedFeet
    // Size: 0x4
    // Offset: 0x90
    int solvedFeet;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean solved
    // Size: 0x1
    // Offset: 0x94
    bool solved;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: solved and: lastWeight
    char __padding11[0x3] = {};
    // private System.Single lastWeight
    // Size: 0x4
    // Offset: 0x98
    float lastWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastWeight and: characterRootRigidbody
    char __padding12[0x4] = {};
    // private UnityEngine.Rigidbody characterRootRigidbody
    // Size: 0x8
    // Offset: 0xA0
    UnityEngine::Rigidbody* characterRootRigidbody;
    // Field size check
    static_assert(sizeof(UnityEngine::Rigidbody*) == 0x8);
    // Creating value type constructor for type: GrounderIK
    GrounderIK(::Array<RootMotion::FinalIK::IK*>* legs_ = {}, UnityEngine::Transform* pelvis_ = {}, UnityEngine::Transform* characterRoot_ = {}, float rootRotationWeight_ = {}, float rootRotationSpeed_ = {}, float maxRootRotationAngle_ = {}, ::Array<UnityEngine::Transform*>* feet_ = {}, ::Array<UnityEngine::Quaternion>* footRotations_ = {}, UnityEngine::Vector3 animatedPelvisLocalPosition_ = {}, UnityEngine::Vector3 solvedPelvisLocalPosition_ = {}, int solvedFeet_ = {}, bool solved_ = {}, float lastWeight_ = {}, UnityEngine::Rigidbody* characterRootRigidbody_ = {}) noexcept : legs{legs_}, pelvis{pelvis_}, characterRoot{characterRoot_}, rootRotationWeight{rootRotationWeight_}, rootRotationSpeed{rootRotationSpeed_}, maxRootRotationAngle{maxRootRotationAngle_}, feet{feet_}, footRotations{footRotations_}, animatedPelvisLocalPosition{animatedPelvisLocalPosition_}, solvedPelvisLocalPosition{solvedPelvisLocalPosition_}, solvedFeet{solvedFeet_}, solved{solved_}, lastWeight{lastWeight_}, characterRootRigidbody{characterRootRigidbody_} {}
    // Get instance field: public RootMotion.FinalIK.IK[] legs
    ::Array<RootMotion::FinalIK::IK*>* _get_legs();
    // Set instance field: public RootMotion.FinalIK.IK[] legs
    void _set_legs(::Array<RootMotion::FinalIK::IK*>* value);
    // Get instance field: public UnityEngine.Transform pelvis
    UnityEngine::Transform* _get_pelvis();
    // Set instance field: public UnityEngine.Transform pelvis
    void _set_pelvis(UnityEngine::Transform* value);
    // Get instance field: public UnityEngine.Transform characterRoot
    UnityEngine::Transform* _get_characterRoot();
    // Set instance field: public UnityEngine.Transform characterRoot
    void _set_characterRoot(UnityEngine::Transform* value);
    // Get instance field: public System.Single rootRotationWeight
    float _get_rootRotationWeight();
    // Set instance field: public System.Single rootRotationWeight
    void _set_rootRotationWeight(float value);
    // Get instance field: public System.Single rootRotationSpeed
    float _get_rootRotationSpeed();
    // Set instance field: public System.Single rootRotationSpeed
    void _set_rootRotationSpeed(float value);
    // Get instance field: public System.Single maxRootRotationAngle
    float _get_maxRootRotationAngle();
    // Set instance field: public System.Single maxRootRotationAngle
    void _set_maxRootRotationAngle(float value);
    // Get instance field: private UnityEngine.Transform[] feet
    ::Array<UnityEngine::Transform*>* _get_feet();
    // Set instance field: private UnityEngine.Transform[] feet
    void _set_feet(::Array<UnityEngine::Transform*>* value);
    // Get instance field: private UnityEngine.Quaternion[] footRotations
    ::Array<UnityEngine::Quaternion>* _get_footRotations();
    // Set instance field: private UnityEngine.Quaternion[] footRotations
    void _set_footRotations(::Array<UnityEngine::Quaternion>* value);
    // Get instance field: private UnityEngine.Vector3 animatedPelvisLocalPosition
    UnityEngine::Vector3 _get_animatedPelvisLocalPosition();
    // Set instance field: private UnityEngine.Vector3 animatedPelvisLocalPosition
    void _set_animatedPelvisLocalPosition(UnityEngine::Vector3 value);
    // Get instance field: private UnityEngine.Vector3 solvedPelvisLocalPosition
    UnityEngine::Vector3 _get_solvedPelvisLocalPosition();
    // Set instance field: private UnityEngine.Vector3 solvedPelvisLocalPosition
    void _set_solvedPelvisLocalPosition(UnityEngine::Vector3 value);
    // Get instance field: private System.Int32 solvedFeet
    int _get_solvedFeet();
    // Set instance field: private System.Int32 solvedFeet
    void _set_solvedFeet(int value);
    // Get instance field: private System.Boolean solved
    bool _get_solved();
    // Set instance field: private System.Boolean solved
    void _set_solved(bool value);
    // Get instance field: private System.Single lastWeight
    float _get_lastWeight();
    // Set instance field: private System.Single lastWeight
    void _set_lastWeight(float value);
    // Get instance field: private UnityEngine.Rigidbody characterRootRigidbody
    UnityEngine::Rigidbody* _get_characterRootRigidbody();
    // Set instance field: private UnityEngine.Rigidbody characterRootRigidbody
    void _set_characterRootRigidbody(UnityEngine::Rigidbody* value);
    // private System.Boolean IsReadyToInitiate()
    // Offset: 0x1C8C6A4
    bool IsReadyToInitiate();
    // private System.Void OnDisable()
    // Offset: 0x1C8C894
    void OnDisable();
    // private System.Void Update()
    // Offset: 0x1C8C994
    void Update();
    // private System.Void Initiate()
    // Offset: 0x1C8D0DC
    void Initiate();
    // private System.Void OnSolverUpdate()
    // Offset: 0x1C8D4C0
    void OnSolverUpdate();
    // private System.Void SetLegIK(System.Int32 index)
    // Offset: 0x1C8D730
    void SetLegIK(int index);
    // private System.Void OnPostSolverUpdate()
    // Offset: 0x1C8DA50
    void OnPostSolverUpdate();
    // private System.Void OnDestroy()
    // Offset: 0x1C8DBEC
    void OnDestroy();
    // public System.Void .ctor()
    // Offset: 0x1C8DDB4
    // Implemented from: RootMotion.FinalIK.Grounder
    // Base method: System.Void Grounder::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GrounderIK* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::GrounderIK::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GrounderIK*, creationType>()));
    }
    // protected override System.Void OpenUserManual()
    // Offset: 0x1C8C5F4
    // Implemented from: RootMotion.FinalIK.Grounder
    // Base method: System.Void Grounder::OpenUserManual()
    void OpenUserManual();
    // protected override System.Void OpenScriptReference()
    // Offset: 0x1C8C640
    // Implemented from: RootMotion.FinalIK.Grounder
    // Base method: System.Void Grounder::OpenScriptReference()
    void OpenScriptReference();
    // public override System.Void ResetPosition()
    // Offset: 0x1C8C68C
    // Implemented from: RootMotion.FinalIK.Grounder
    // Base method: System.Void Grounder::ResetPosition()
    void ResetPosition();
  }; // RootMotion.FinalIK.GrounderIK
  #pragma pack(pop)
  static check_size<sizeof(GrounderIK), 160 + sizeof(UnityEngine::Rigidbody*)> __RootMotion_FinalIK_GrounderIKSizeCheck;
  static_assert(sizeof(GrounderIK) == 0xA8);
}
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::GrounderIK*, "RootMotion.FinalIK", "GrounderIK");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::IsReadyToInitiate
// Il2CppName: IsReadyToInitiate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::IsReadyToInitiate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "IsReadyToInitiate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::OnDisable
// Il2CppName: OnDisable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::OnDisable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "OnDisable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::Initiate
// Il2CppName: Initiate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::Initiate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "Initiate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::OnSolverUpdate
// Il2CppName: OnSolverUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::OnSolverUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "OnSolverUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::SetLegIK
// Il2CppName: SetLegIK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)(int)>(&RootMotion::FinalIK::GrounderIK::SetLegIK)> {
  static const MethodInfo* get() {
    static auto* index = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "SetLegIK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{index});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::OnPostSolverUpdate
// Il2CppName: OnPostSolverUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::OnPostSolverUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "OnPostSolverUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::OpenUserManual
// Il2CppName: OpenUserManual
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::OpenUserManual)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "OpenUserManual", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::OpenScriptReference
// Il2CppName: OpenScriptReference
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::OpenScriptReference)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "OpenScriptReference", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::GrounderIK::ResetPosition
// Il2CppName: ResetPosition
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::GrounderIK::*)()>(&RootMotion::FinalIK::GrounderIK::ResetPosition)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::GrounderIK*), "ResetPosition", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
