// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0xA5
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.Grounding
  // [TokenAttribute] Offset: FFFFFFFF
  class Grounding : public ::Il2CppObject {
    public:
    // Nested type: RootMotion::FinalIK::Grounding::Quality
    struct Quality;
    // Nested type: RootMotion::FinalIK::Grounding::Leg
    class Leg;
    // Nested type: RootMotion::FinalIK::Grounding::Pelvis
    class Pelvis;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality
    // [TokenAttribute] Offset: FFFFFFFF
    struct Quality/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: Quality
      constexpr Quality(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality Fastest
      static constexpr const int Fastest = 0;
      // Get static field: static public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality Fastest
      static RootMotion::FinalIK::Grounding::Quality _get_Fastest();
      // Set static field: static public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality Fastest
      static void _set_Fastest(RootMotion::FinalIK::Grounding::Quality value);
      // static field const value: static public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality Simple
      static constexpr const int Simple = 1;
      // Get static field: static public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality Simple
      static RootMotion::FinalIK::Grounding::Quality _get_Simple();
      // Set static field: static public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality Simple
      static void _set_Simple(RootMotion::FinalIK::Grounding::Quality value);
      // static field const value: static public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality Best
      static constexpr const int Best = 2;
      // Get static field: static public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality Best
      static RootMotion::FinalIK::Grounding::Quality _get_Best();
      // Set static field: static public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality Best
      static void _set_Best(RootMotion::FinalIK::Grounding::Quality value);
      // Get instance field: public System.Int32 value__
      int _get_value__();
      // Set instance field: public System.Int32 value__
      void _set_value__(int value);
    }; // RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality
    #pragma pack(pop)
    static check_size<sizeof(Grounding::Quality), 0 + sizeof(int)> __RootMotion_FinalIK_Grounding_QualitySizeCheck;
    static_assert(sizeof(Grounding::Quality) == 0x4);
    // [TooltipAttribute] Offset: 0xE9FDE8
    // public UnityEngine.LayerMask layers
    // Size: 0x4
    // Offset: 0x10
    UnityEngine::LayerMask layers;
    // Field size check
    static_assert(sizeof(UnityEngine::LayerMask) == 0x4);
    // [TooltipAttribute] Offset: 0xE9FE20
    // public System.Single maxStep
    // Size: 0x4
    // Offset: 0x14
    float maxStep;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE9FE58
    // public System.Single heightOffset
    // Size: 0x4
    // Offset: 0x18
    float heightOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE9FE90
    // public System.Single footSpeed
    // Size: 0x4
    // Offset: 0x1C
    float footSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE9FEC8
    // public System.Single footRadius
    // Size: 0x4
    // Offset: 0x20
    float footRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE9FF00
    // public System.Single footCenterOffset
    // Size: 0x4
    // Offset: 0x24
    float footCenterOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE9FF4C
    // public System.Single prediction
    // Size: 0x4
    // Offset: 0x28
    float prediction;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE9FF84
    // [RangeAttribute] Offset: 0xE9FF84
    // public System.Single footRotationWeight
    // Size: 0x4
    // Offset: 0x2C
    float footRotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE9FFD8
    // public System.Single footRotationSpeed
    // Size: 0x4
    // Offset: 0x30
    float footRotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEA0010
    // [RangeAttribute] Offset: 0xEA0010
    // public System.Single maxFootRotationAngle
    // Size: 0x4
    // Offset: 0x34
    float maxFootRotationAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEA0068
    // public System.Boolean rotateSolver
    // Size: 0x1
    // Offset: 0x38
    bool rotateSolver;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: rotateSolver and: pelvisSpeed
    char __padding10[0x3] = {};
    // [TooltipAttribute] Offset: 0xEA00A0
    // public System.Single pelvisSpeed
    // Size: 0x4
    // Offset: 0x3C
    float pelvisSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEA00D8
    // [RangeAttribute] Offset: 0xEA00D8
    // public System.Single pelvisDamper
    // Size: 0x4
    // Offset: 0x40
    float pelvisDamper;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEA012C
    // public System.Single lowerPelvisWeight
    // Size: 0x4
    // Offset: 0x44
    float lowerPelvisWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEA0164
    // public System.Single liftPelvisWeight
    // Size: 0x4
    // Offset: 0x48
    float liftPelvisWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEA019C
    // public System.Single rootSphereCastRadius
    // Size: 0x4
    // Offset: 0x4C
    float rootSphereCastRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEA01D4
    // public System.Boolean overstepFallsDown
    // Size: 0x1
    // Offset: 0x50
    bool overstepFallsDown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overstepFallsDown and: quality
    char __padding16[0x3] = {};
    // [TooltipAttribute] Offset: 0xEA020C
    // public RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Quality quality
    // Size: 0x4
    // Offset: 0x54
    RootMotion::FinalIK::Grounding::Quality quality;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::Grounding::Quality) == 0x4);
    // private RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Leg[] <legs>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::Array<RootMotion::FinalIK::Grounding::Leg*>* legs;
    // Field size check
    static_assert(sizeof(::Array<RootMotion::FinalIK::Grounding::Leg*>*) == 0x8);
    // private RootMotion.FinalIK.Grounding/RootMotion.FinalIK.Pelvis <pelvis>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    RootMotion::FinalIK::Grounding::Pelvis* pelvis;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::Grounding::Pelvis*) == 0x8);
    // private System.Boolean <isGrounded>k__BackingField
    // Size: 0x1
    // Offset: 0x68
    bool isGrounded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isGrounded and: root
    char __padding20[0x7] = {};
    // private UnityEngine.Transform <root>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::Transform* root;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private UnityEngine.RaycastHit <rootHit>k__BackingField
    // Size: 0x2C
    // Offset: 0x78
    UnityEngine::RaycastHit rootHit;
    // Field size check
    static_assert(sizeof(UnityEngine::RaycastHit) == 0x2C);
    // private System.Boolean initiated
    // Size: 0x1
    // Offset: 0xA4
    bool initiated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: Grounding
