// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.HitReactionVRIK
#include "RootMotion/FinalIK/HitReactionVRIK.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
}
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: VRIK
  class VRIK;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.HitReactionVRIK/Offset
  class HitReactionVRIK::Offset : public ::CsObject {
    public:
    // public System.String name
    // Offset: 0x10
    ::CsString* name;
    // public UnityEngine.Collider collider
    // Offset: 0x18
    UnityEngine::Collider* collider;
    // private System.Single crossFadeTime
    // Offset: 0x20
    float crossFadeTime;
    // private System.Single <crossFader>k__BackingField
    // Offset: 0x24
    float crossFader;
    // private System.Single <timer>k__BackingField
    // Offset: 0x28
    float timer;
    // private UnityEngine.Vector3 <force>k__BackingField
    // Offset: 0x2C
    UnityEngine::Vector3 force;
    // private UnityEngine.Vector3 <point>k__BackingField
    // Offset: 0x38
    UnityEngine::Vector3 point;
    // private System.Single length
    // Offset: 0x44
    float length;
    // private System.Single crossFadeSpeed
    // Offset: 0x48
    float crossFadeSpeed;
    // private System.Single lastTime
    // Offset: 0x4C
    float lastTime;
    // protected System.Single get_crossFader()
    // Offset: 0x13778C4
    float get_crossFader();
    // private System.Void set_crossFader(System.Single value)
    // Offset: 0x13778CC
    void set_crossFader(float value);
    // protected System.Single get_timer()
    // Offset: 0x13778D4
    float get_timer();
    // private System.Void set_timer(System.Single value)
    // Offset: 0x13778DC
    void set_timer(float value);
    // protected UnityEngine.Vector3 get_force()
    // Offset: 0x13778E4
    UnityEngine::Vector3 get_force();
    // private System.Void set_force(UnityEngine.Vector3 value)
    // Offset: 0x13778F0
    void set_force(UnityEngine::Vector3 value);
    // protected UnityEngine.Vector3 get_point()
    // Offset: 0x13778FC
    UnityEngine::Vector3 get_point();
    // private System.Void set_point(UnityEngine.Vector3 value)
    // Offset: 0x1377908
    void set_point(UnityEngine::Vector3 value);
    // public System.Void Hit(UnityEngine.Vector3 force, UnityEngine.AnimationCurve[] curves, UnityEngine.Vector3 point)
    // Offset: 0x137777C
    void Hit(UnityEngine::Vector3 force, ::Array<UnityEngine::AnimationCurve*>* curves, UnityEngine::Vector3 point);
    // public System.Void Apply(RootMotion.FinalIK.VRIK ik, UnityEngine.AnimationCurve[] curves, System.Single weight)
    // Offset: 0x13773E0
    void Apply(RootMotion::FinalIK::VRIK* ik, ::Array<UnityEngine::AnimationCurve*>* curves, float weight);
    // protected System.Single GetLength(UnityEngine.AnimationCurve[] curves)
    // Offset: 0xFFFFFFFF
    float GetLength(::Array<UnityEngine::AnimationCurve*>* curves);
    // protected System.Void CrossFadeStart()
    // Offset: 0xFFFFFFFF
    void CrossFadeStart();
    // protected System.Void OnApply(RootMotion.FinalIK.VRIK ik, UnityEngine.AnimationCurve[] curves, System.Single weight)
    // Offset: 0xFFFFFFFF
    void OnApply(RootMotion::FinalIK::VRIK* ik, ::Array<UnityEngine::AnimationCurve*>* curves, float weight);
    // protected System.Void .ctor()
    // Offset: 0x1377914
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static HitReactionVRIK::Offset* New_ctor();
  }; // RootMotion.FinalIK.HitReactionVRIK/Offset
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::HitReactionVRIK::Offset*, "RootMotion.FinalIK", "HitReactionVRIK/Offset");
#pragma pack(pop)
