// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: RootMotion.Warning
#include "RootMotion/Warning.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKSolverFullBody
  class IKSolverFullBody;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.IKConstraintBend
  class IKConstraintBend : public ::Il2CppObject {
    public:
    // public UnityEngine.Transform bone1
    // Offset: 0x10
    UnityEngine::Transform* bone1;
    // public UnityEngine.Transform bone2
    // Offset: 0x18
    UnityEngine::Transform* bone2;
    // public UnityEngine.Transform bone3
    // Offset: 0x20
    UnityEngine::Transform* bone3;
    // public UnityEngine.Transform bendGoal
    // Offset: 0x28
    UnityEngine::Transform* bendGoal;
    // public UnityEngine.Vector3 direction
    // Offset: 0x30
    UnityEngine::Vector3 direction;
    // public UnityEngine.Quaternion rotationOffset
    // Offset: 0x3C
    UnityEngine::Quaternion rotationOffset;
    // public System.Single weight
    // Offset: 0x4C
    float weight;
    // public UnityEngine.Vector3 defaultLocalDirection
    // Offset: 0x50
    UnityEngine::Vector3 defaultLocalDirection;
    // public UnityEngine.Vector3 defaultChildDirection
    // Offset: 0x5C
    UnityEngine::Vector3 defaultChildDirection;
    // public System.Single clampF
    // Offset: 0x68
    float clampF;
    // private System.Int32 chainIndex1
    // Offset: 0x6C
    int chainIndex1;
    // private System.Int32 nodeIndex1
    // Offset: 0x70
    int nodeIndex1;
    // private System.Int32 chainIndex2
    // Offset: 0x74
    int chainIndex2;
    // private System.Int32 nodeIndex2
    // Offset: 0x78
    int nodeIndex2;
    // private System.Int32 chainIndex3
    // Offset: 0x7C
    int chainIndex3;
    // private System.Int32 nodeIndex3
    // Offset: 0x80
    int nodeIndex3;
    // private System.Boolean <initiated>k__BackingField
    // Offset: 0x84
    bool initiated;
    // private System.Boolean limbOrientationsSet
    // Offset: 0x85
    bool limbOrientationsSet;
    // public System.Boolean IsValid(RootMotion.FinalIK.IKSolverFullBody solver, RootMotion.Warning/Logger logger)
    // Offset: 0x1381C5C
    bool IsValid(RootMotion::FinalIK::IKSolverFullBody* solver, RootMotion::Warning::Logger* logger);
    // public System.Boolean get_initiated()
    // Offset: 0x1381E24
    bool get_initiated();
    // private System.Void set_initiated(System.Boolean value)
    // Offset: 0x1381E2C
    void set_initiated(bool value);
    // public System.Void .ctor(UnityEngine.Transform bone1, UnityEngine.Transform bone2, UnityEngine.Transform bone3)
    // Offset: 0x1381EBC
    static IKConstraintBend* New_ctor(UnityEngine::Transform* bone1, UnityEngine::Transform* bone2, UnityEngine::Transform* bone3);
    // public System.Void SetBones(UnityEngine.Transform bone1, UnityEngine.Transform bone2, UnityEngine.Transform bone3)
    // Offset: 0x1381F70
    void SetBones(UnityEngine::Transform* bone1, UnityEngine::Transform* bone2, UnityEngine::Transform* bone3);
    // public System.Void Initiate(RootMotion.FinalIK.IKSolverFullBody solver)
    // Offset: 0x1381FC0
    void Initiate(RootMotion::FinalIK::IKSolverFullBody* solver);
    // public System.Void SetLimbOrientation(UnityEngine.Vector3 upper, UnityEngine.Vector3 lower, UnityEngine.Vector3 last)
    // Offset: 0x13824B0
    void SetLimbOrientation(UnityEngine::Vector3 upper, UnityEngine::Vector3 lower, UnityEngine::Vector3 last);
    // public System.Void LimitBend(System.Single solverWeight, System.Single positionWeight)
    // Offset: 0x13826E8
    void LimitBend(float solverWeight, float positionWeight);
    // public UnityEngine.Vector3 GetDir(RootMotion.FinalIK.IKSolverFullBody solver)
    // Offset: 0x1382B84
    UnityEngine::Vector3 GetDir(RootMotion::FinalIK::IKSolverFullBody* solver);
    // private UnityEngine.Vector3 OrthoToLimb(RootMotion.FinalIK.IKSolverFullBody solver, UnityEngine.Vector3 tangent)
    // Offset: 0x1382270
    UnityEngine::Vector3 OrthoToLimb(RootMotion::FinalIK::IKSolverFullBody* solver, UnityEngine::Vector3 tangent);
    // private UnityEngine.Vector3 OrthoToBone1(RootMotion.FinalIK.IKSolverFullBody solver, UnityEngine.Vector3 tangent)
    // Offset: 0x1382390
    UnityEngine::Vector3 OrthoToBone1(RootMotion::FinalIK::IKSolverFullBody* solver, UnityEngine::Vector3 tangent);
    // public System.Void .ctor()
    // Offset: 0x1381E38
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static IKConstraintBend* New_ctor();
  }; // RootMotion.FinalIK.IKConstraintBend
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::IKConstraintBend*, "RootMotion.FinalIK", "IKConstraintBend");
#pragma pack(pop)
