// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.IKMapping
#include "RootMotion/FinalIK/IKMapping.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKSolverFullBody
  class IKSolverFullBody;
  // Forward declaring type: IKSolver
  class IKSolver;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Vector3
  struct Vector3;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.IKMappingLimb
  class IKMappingLimb : public RootMotion::FinalIK::IKMapping {
    public:
    // Nested type: RootMotion::FinalIK::IKMappingLimb::BoneMapType
    struct BoneMapType;
    // public UnityEngine.Transform parentBone
    // Size: 0x8
    // Offset: 0x10
    UnityEngine::Transform* parentBone;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform bone1
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Transform* bone1;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform bone2
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::Transform* bone2;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform bone3
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::Transform* bone3;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // [RangeAttribute] Offset: 0xE08460
    // public System.Single maintainRotationWeight
    // Size: 0x4
    // Offset: 0x30
    float maintainRotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xE08478
    // public System.Single weight
    // Size: 0x4
    // Offset: 0x34
    float weight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean updatePlaneRotations
    // Size: 0x1
    // Offset: 0x38
    bool updatePlaneRotations;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: updatePlaneRotations and: boneMapParent
    char __padding6[0x7] = {};
    // private RootMotion.FinalIK.IKMapping/BoneMap boneMapParent
    // Size: 0x8
    // Offset: 0x40
    RootMotion::FinalIK::IKMapping::BoneMap* boneMapParent;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::IKMapping::BoneMap*) == 0x8);
    // private RootMotion.FinalIK.IKMapping/BoneMap boneMap1
    // Size: 0x8
    // Offset: 0x48
    RootMotion::FinalIK::IKMapping::BoneMap* boneMap1;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::IKMapping::BoneMap*) == 0x8);
    // private RootMotion.FinalIK.IKMapping/BoneMap boneMap2
    // Size: 0x8
    // Offset: 0x50
    RootMotion::FinalIK::IKMapping::BoneMap* boneMap2;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::IKMapping::BoneMap*) == 0x8);
    // private RootMotion.FinalIK.IKMapping/BoneMap boneMap3
    // Size: 0x8
    // Offset: 0x58
    RootMotion::FinalIK::IKMapping::BoneMap* boneMap3;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::IKMapping::BoneMap*) == 0x8);
    // Creating value type constructor for type: IKMappingLimb
    IKMappingLimb(UnityEngine::Transform* parentBone_ = {}, UnityEngine::Transform* bone1_ = {}, UnityEngine::Transform* bone2_ = {}, UnityEngine::Transform* bone3_ = {}, float maintainRotationWeight_ = {}, float weight_ = {}, bool updatePlaneRotations_ = {}, RootMotion::FinalIK::IKMapping::BoneMap* boneMapParent_ = {}, RootMotion::FinalIK::IKMapping::BoneMap* boneMap1_ = {}, RootMotion::FinalIK::IKMapping::BoneMap* boneMap2_ = {}, RootMotion::FinalIK::IKMapping::BoneMap* boneMap3_ = {}) noexcept : parentBone{parentBone_}, bone1{bone1_}, bone2{bone2_}, bone3{bone3_}, maintainRotationWeight{maintainRotationWeight_}, weight{weight_}, updatePlaneRotations{updatePlaneRotations_}, boneMapParent{boneMapParent_}, boneMap1{boneMap1_}, boneMap2{boneMap2_}, boneMap3{boneMap3_} {}
    // public RootMotion.FinalIK.IKMapping/BoneMap GetBoneMap(RootMotion.FinalIK.IKMappingLimb/BoneMapType boneMap)
    // Offset: 0x1C4FA00
    RootMotion::FinalIK::IKMapping::BoneMap* GetBoneMap(RootMotion::FinalIK::IKMappingLimb::BoneMapType boneMap);
    // public System.Void SetLimbOrientation(UnityEngine.Vector3 upper, UnityEngine.Vector3 lower)
    // Offset: 0x1C4FAD4
    void SetLimbOrientation(UnityEngine::Vector3 upper, UnityEngine::Vector3 lower);
    // public System.Void .ctor(UnityEngine.Transform bone1, UnityEngine.Transform bone2, UnityEngine.Transform bone3, UnityEngine.Transform parentBone)
    // Offset: 0x1C4FF30
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static IKMappingLimb* New_ctor(UnityEngine::Transform* bone1, UnityEngine::Transform* bone2, UnityEngine::Transform* bone3, UnityEngine::Transform* parentBone) {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::IKMappingLimb::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<IKMappingLimb*, creationType>(bone1, bone2, bone3, parentBone)));
    }
    // public System.Void SetBones(UnityEngine.Transform bone1, UnityEngine.Transform bone2, UnityEngine.Transform bone3, UnityEngine.Transform parentBone)
    // Offset: 0x1C50064
    void SetBones(UnityEngine::Transform* bone1, UnityEngine::Transform* bone2, UnityEngine::Transform* bone3, UnityEngine::Transform* parentBone);
    // public System.Void StoreDefaultLocalState()
    // Offset: 0x1C50070
    void StoreDefaultLocalState();
    // public System.Void FixTransforms()
    // Offset: 0x1C50118
    void FixTransforms();
    // public System.Void ReadPose()
    // Offset: 0x1C50440
    void ReadPose();
    // public System.Void WritePose(RootMotion.FinalIK.IKSolverFullBody solver, System.Boolean fullBody)
    // Offset: 0x1C504F8
    void WritePose(RootMotion::FinalIK::IKSolverFullBody* solver, bool fullBody);
    // public override System.Boolean IsValid(RootMotion.FinalIK.IKSolver solver, ref System.String message)
    // Offset: 0x1C4F97C
    // Implemented from: RootMotion.FinalIK.IKMapping
    // Base method: System.Boolean IKMapping::IsValid(RootMotion.FinalIK.IKSolver solver, ref System.String message)
    bool IsValid(RootMotion::FinalIK::IKSolver* solver, ::Il2CppString*& message);
    // public System.Void .ctor()
    // Offset: 0x1C4FE28
    // Implemented from: RootMotion.FinalIK.IKMapping
    // Base method: System.Void IKMapping::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static IKMappingLimb* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::IKMappingLimb::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<IKMappingLimb*, creationType>()));
    }
    // public override System.Void Initiate(RootMotion.FinalIK.IKSolverFullBody solver)
    // Offset: 0x1C501D0
    // Implemented from: RootMotion.FinalIK.IKMapping
    // Base method: System.Void IKMapping::Initiate(RootMotion.FinalIK.IKSolverFullBody solver)
    void Initiate(RootMotion::FinalIK::IKSolverFullBody* solver);
  }; // RootMotion.FinalIK.IKMappingLimb
  #pragma pack(pop)
  static check_size<sizeof(IKMappingLimb), 88 + sizeof(RootMotion::FinalIK::IKMapping::BoneMap*)> __RootMotion_FinalIK_IKMappingLimbSizeCheck;
  static_assert(sizeof(IKMappingLimb) == 0x60);
}
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::IKMappingLimb*, "RootMotion.FinalIK", "IKMappingLimb");
