// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.IKSolver
  class IKSolver : public ::Il2CppObject {
    public:
    // Nested type: RootMotion::FinalIK::IKSolver::Point
    class Point;
    // Nested type: RootMotion::FinalIK::IKSolver::Bone
    class Bone;
    // Nested type: RootMotion::FinalIK::IKSolver::Node
    class Node;
    // Nested type: RootMotion::FinalIK::IKSolver::UpdateDelegate
    class UpdateDelegate;
    // Nested type: RootMotion::FinalIK::IKSolver::IterationDelegate
    class IterationDelegate;
    // public UnityEngine.Vector3 IKPosition
    // Offset: 0x10
    UnityEngine::Vector3 IKPosition;
    // public System.Single IKPositionWeight
    // Offset: 0x1C
    float IKPositionWeight;
    // private System.Boolean <initiated>k__BackingField
    // Offset: 0x20
    bool initiated;
    // public RootMotion.FinalIK.IKSolver/UpdateDelegate OnPreInitiate
    // Offset: 0x28
    RootMotion::FinalIK::IKSolver::UpdateDelegate* OnPreInitiate;
    // public RootMotion.FinalIK.IKSolver/UpdateDelegate OnPostInitiate
    // Offset: 0x30
    RootMotion::FinalIK::IKSolver::UpdateDelegate* OnPostInitiate;
    // public RootMotion.FinalIK.IKSolver/UpdateDelegate OnPreUpdate
    // Offset: 0x38
    RootMotion::FinalIK::IKSolver::UpdateDelegate* OnPreUpdate;
    // public RootMotion.FinalIK.IKSolver/UpdateDelegate OnPostUpdate
    // Offset: 0x40
    RootMotion::FinalIK::IKSolver::UpdateDelegate* OnPostUpdate;
    // protected System.Boolean firstInitiation
    // Offset: 0x48
    bool firstInitiation;
    // protected UnityEngine.Transform root
    // Offset: 0x50
    UnityEngine::Transform* root;
    // public System.Boolean IsValid()
    // Offset: 0x170F48C
    bool IsValid();
    // public System.Boolean IsValid(ref System.String message)
    // Offset: 0xFFFFFFFF
    bool IsValid(::Il2CppString*& message);
    // public System.Void Initiate(UnityEngine.Transform root)
    // Offset: 0x1707A88
    void Initiate(UnityEngine::Transform* root);
    // public System.Void Update()
    // Offset: 0x17079A8
    void Update();
    // public UnityEngine.Vector3 GetIKPosition()
    // Offset: 0x170F508
    UnityEngine::Vector3 GetIKPosition();
    // public System.Void SetIKPosition(UnityEngine.Vector3 position)
    // Offset: 0x170F514
    void SetIKPosition(UnityEngine::Vector3 position);
    // public System.Single GetIKPositionWeight()
    // Offset: 0x170F520
    float GetIKPositionWeight();
    // public System.Void SetIKPositionWeight(System.Single weight)
    // Offset: 0x170F528
    void SetIKPositionWeight(float weight);
    // public UnityEngine.Transform GetRoot()
    // Offset: 0x170F5AC
    UnityEngine::Transform* GetRoot();
    // public System.Boolean get_initiated()
    // Offset: 0x170F5B4
    bool get_initiated();
    // private System.Void set_initiated(System.Boolean value)
    // Offset: 0x170F5BC
    void set_initiated(bool value);
    // public RootMotion.FinalIK.IKSolver/Point[] GetPoints()
    // Offset: 0xFFFFFFFF
    ::Array<RootMotion::FinalIK::IKSolver::Point*>* GetPoints();
    // public RootMotion.FinalIK.IKSolver/Point GetPoint(UnityEngine.Transform transform)
    // Offset: 0xFFFFFFFF
    RootMotion::FinalIK::IKSolver::Point* GetPoint(UnityEngine::Transform* transform);
    // public System.Void FixTransforms()
    // Offset: 0xFFFFFFFF
    void FixTransforms();
    // public System.Void StoreDefaultLocalState()
    // Offset: 0xFFFFFFFF
    void StoreDefaultLocalState();
    // protected System.Void OnInitiate()
    // Offset: 0xFFFFFFFF
    void OnInitiate();
    // protected System.Void OnUpdate()
    // Offset: 0xFFFFFFFF
    void OnUpdate();
    // protected System.Void LogWarning(System.String message)
    // Offset: 0x170F5C8
    void LogWarning(::Il2CppString* message);
    // static public UnityEngine.Transform ContainsDuplicateBone(RootMotion.FinalIK.IKSolver/Bone[] bones)
    // Offset: 0x170F5E0
    static UnityEngine::Transform* ContainsDuplicateBone(::Array<RootMotion::FinalIK::IKSolver::Bone*>* bones);
    // static public System.Boolean HierarchyIsValid(RootMotion.FinalIK.IKSolver/Bone[] bones)
    // Offset: 0x170F71C
    static bool HierarchyIsValid(::Array<RootMotion::FinalIK::IKSolver::Bone*>* bones);
    // static protected System.Single PreSolveBones(ref RootMotion.FinalIK.IKSolver/Bone[] bones)
    // Offset: 0x170F7C8
    static float PreSolveBones(::Array<RootMotion::FinalIK::IKSolver::Bone*>*& bones);
    // protected System.Void .ctor()
    // Offset: 0x170FB4C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static IKSolver* New_ctor();
  }; // RootMotion.FinalIK.IKSolver
  check_size<sizeof(IKSolver), 80 + sizeof(void*) + ((80 + sizeof(void*)) % 8 != 0 ? (8 - (80 + sizeof(void*)) % 8) : 0)> __RootMotion_FinalIK_IKSolverSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::IKSolver*, "RootMotion.FinalIK", "IKSolver");
#pragma pack(pop)
