// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.IKSolver
#include "RootMotion/FinalIK/IKSolver.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: RootMotion.FinalIK.IKSolverVR
#include "RootMotion/FinalIK/IKSolverVR.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.IKSolverLeg
  class IKSolverLeg : public RootMotion::FinalIK::IKSolver {
    public:
    // public System.Single IKRotationWeight
    // Offset: 0x58
    float IKRotationWeight;
    // public UnityEngine.Quaternion IKRotation
    // Offset: 0x5C
    UnityEngine::Quaternion IKRotation;
    // public RootMotion.FinalIK.IKSolver/Point pelvis
    // Offset: 0x70
    RootMotion::FinalIK::IKSolver::Point* pelvis;
    // public RootMotion.FinalIK.IKSolver/Point thigh
    // Offset: 0x78
    RootMotion::FinalIK::IKSolver::Point* thigh;
    // public RootMotion.FinalIK.IKSolver/Point calf
    // Offset: 0x80
    RootMotion::FinalIK::IKSolver::Point* calf;
    // public RootMotion.FinalIK.IKSolver/Point foot
    // Offset: 0x88
    RootMotion::FinalIK::IKSolver::Point* foot;
    // public RootMotion.FinalIK.IKSolver/Point toe
    // Offset: 0x90
    RootMotion::FinalIK::IKSolver::Point* toe;
    // public RootMotion.FinalIK.IKSolverVR/Leg leg
    // Offset: 0x98
    RootMotion::FinalIK::IKSolverVR::Leg* leg;
    // public UnityEngine.Vector3 heelOffset
    // Offset: 0xA0
    UnityEngine::Vector3 heelOffset;
    // private UnityEngine.Vector3[] positions
    // Offset: 0xB0
    ::Array<UnityEngine::Vector3>* positions;
    // private UnityEngine.Quaternion[] rotations
    // Offset: 0xB8
    ::Array<UnityEngine::Quaternion>* rotations;
    // public System.Boolean SetChain(UnityEngine.Transform pelvis, UnityEngine.Transform thigh, UnityEngine.Transform calf, UnityEngine.Transform foot, UnityEngine.Transform toe, UnityEngine.Transform root)
    // Offset: 0x1350BFC
    bool SetChain(UnityEngine::Transform* pelvis, UnityEngine::Transform* thigh, UnityEngine::Transform* calf, UnityEngine::Transform* foot, UnityEngine::Transform* toe, UnityEngine::Transform* root);
    // private System.Void Solve()
    // Offset: 0x135144C
    void Solve();
    // private System.Void Read()
    // Offset: 0x1351114
    void Read();
    // private System.Void Write()
    // Offset: 0x1351554
    void Write();
    // public override System.Boolean IsValid(ref System.String message)
    // Offset: 0x1350840
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Boolean IKSolver::IsValid(ref System.String message)
    bool IsValid(::Il2CppString*& message);
    // public override RootMotion.FinalIK.IKSolver/Point[] GetPoints()
    // Offset: 0x1350CB4
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: RootMotion.FinalIK.IKSolver/Point[] IKSolver::GetPoints()
    ::Array<RootMotion::FinalIK::IKSolver::Point*>* GetPoints();
    // public override RootMotion.FinalIK.IKSolver/Point GetPoint(UnityEngine.Transform transform)
    // Offset: 0x1350E4C
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: RootMotion.FinalIK.IKSolver/Point IKSolver::GetPoint(UnityEngine.Transform transform)
    RootMotion::FinalIK::IKSolver::Point* GetPoint(UnityEngine::Transform* transform);
    // public override System.Void StoreDefaultLocalState()
    // Offset: 0x1350FE4
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::StoreDefaultLocalState()
    void StoreDefaultLocalState();
    // public override System.Void FixTransforms()
    // Offset: 0x1351040
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::FixTransforms()
    void FixTransforms();
    // protected override System.Void OnInitiate()
    // Offset: 0x13510B0
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::OnInitiate()
    void OnInitiate();
    // protected override System.Void OnUpdate()
    // Offset: 0x1351420
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::OnUpdate()
    void OnUpdate();
    // public System.Void .ctor()
    // Offset: 0x13516E0
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::.ctor()
    // Base method: System.Void Object::.ctor()
    static IKSolverLeg* New_ctor();
  }; // RootMotion.FinalIK.IKSolverLeg
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::IKSolverLeg*, "RootMotion.FinalIK", "IKSolverLeg");
#pragma pack(pop)
