// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.IKSolver
#include "RootMotion\FinalIK\IKSolver.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine\Quaternion.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.IKSolverTrigonometric
  class IKSolverTrigonometric : public RootMotion::FinalIK::IKSolver {
    public:
    // Nested type: RootMotion::FinalIK::IKSolverTrigonometric::TrigonometricBone
    class TrigonometricBone;
    // public UnityEngine.Transform target
    // Offset: 0x58
    UnityEngine::Transform* target;
    // public System.Single IKRotationWeight
    // Offset: 0x60
    float IKRotationWeight;
    // public UnityEngine.Quaternion IKRotation
    // Offset: 0x64
    UnityEngine::Quaternion IKRotation;
    // public UnityEngine.Vector3 bendNormal
    // Offset: 0x74
    UnityEngine::Vector3 bendNormal;
    // public RootMotion.FinalIK.IKSolverTrigonometric/TrigonometricBone bone1
    // Offset: 0x80
    RootMotion::FinalIK::IKSolverTrigonometric::TrigonometricBone* bone1;
    // public RootMotion.FinalIK.IKSolverTrigonometric/TrigonometricBone bone2
    // Offset: 0x88
    RootMotion::FinalIK::IKSolverTrigonometric::TrigonometricBone* bone2;
    // public RootMotion.FinalIK.IKSolverTrigonometric/TrigonometricBone bone3
    // Offset: 0x90
    RootMotion::FinalIK::IKSolverTrigonometric::TrigonometricBone* bone3;
    // protected UnityEngine.Vector3 weightIKPosition
    // Offset: 0x98
    UnityEngine::Vector3 weightIKPosition;
    // protected System.Boolean directHierarchy
    // Offset: 0xA4
    bool directHierarchy;
    // public System.Void SetBendGoalPosition(UnityEngine.Vector3 goalPosition, System.Single weight)
    // Offset: 0x1339AE0
    void SetBendGoalPosition(UnityEngine::Vector3 goalPosition, float weight);
    // public System.Void SetBendPlaneToCurrent()
    // Offset: 0x1339CD0
    void SetBendPlaneToCurrent();
    // public System.Void SetIKRotation(UnityEngine.Quaternion rotation)
    // Offset: 0x1339E84
    void SetIKRotation(UnityEngine::Quaternion rotation);
    // public System.Void SetIKRotationWeight(System.Single weight)
    // Offset: 0x1339E90
    void SetIKRotationWeight(float weight);
    // public UnityEngine.Quaternion GetIKRotation()
    // Offset: 0x1339F14
    UnityEngine::Quaternion GetIKRotation();
    // public System.Single GetIKRotationWeight()
    // Offset: 0x1339F20
    float GetIKRotationWeight();
    // public System.Boolean SetChain(UnityEngine.Transform bone1, UnityEngine.Transform bone2, UnityEngine.Transform bone3, UnityEngine.Transform root)
    // Offset: 0x133A628
    bool SetChain(UnityEngine::Transform* bone1, UnityEngine::Transform* bone2, UnityEngine::Transform* bone3, UnityEngine::Transform* root);
    // static public System.Void Solve(UnityEngine.Transform bone1, UnityEngine.Transform bone2, UnityEngine.Transform bone3, UnityEngine.Vector3 targetPosition, UnityEngine.Vector3 bendNormal, System.Single weight)
    // Offset: 0x133A6A8
    static void Solve(UnityEngine::Transform* bone1, UnityEngine::Transform* bone2, UnityEngine::Transform* bone3, UnityEngine::Vector3 targetPosition, UnityEngine::Vector3 bendNormal, float weight);
    // static private UnityEngine.Vector3 GetDirectionToBendPoint(UnityEngine.Vector3 direction, System.Single directionMag, UnityEngine.Vector3 bendDirection, System.Single sqrMag1, System.Single sqrMag2)
    // Offset: 0x133AC50
    static UnityEngine::Vector3 GetDirectionToBendPoint(UnityEngine::Vector3 direction, float directionMag, UnityEngine::Vector3 bendDirection, float sqrMag1, float sqrMag2);
    // private System.Boolean IsDirectHierarchy()
    // Offset: 0x133B024
    bool IsDirectHierarchy();
    // private System.Void InitiateBones()
    // Offset: 0x133AFA0
    void InitiateBones();
    // protected System.Void OnInitiateVirtual()
    // Offset: 0x133BDA0
    void OnInitiateVirtual();
    // protected System.Void OnUpdateVirtual()
    // Offset: 0x133BDA4
    void OnUpdateVirtual();
    // protected System.Void OnPostSolveVirtual()
    // Offset: 0x133BDA8
    void OnPostSolveVirtual();
    // protected UnityEngine.Vector3 GetBendDirection(UnityEngine.Vector3 IKPosition, UnityEngine.Vector3 bendNormal)
    // Offset: 0x133B9D8
    UnityEngine::Vector3 GetBendDirection(UnityEngine::Vector3 IKPosition, UnityEngine::Vector3 bendNormal);
    // public override RootMotion.FinalIK.IKSolver/Point[] GetPoints()
    // Offset: 0x1339F28
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: RootMotion.FinalIK.IKSolver/Point[] IKSolver::GetPoints()
    ::Array<RootMotion::FinalIK::IKSolver::Point*>* GetPoints();
    // public override RootMotion.FinalIK.IKSolver/Point GetPoint(UnityEngine.Transform transform)
    // Offset: 0x133A050
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: RootMotion.FinalIK.IKSolver/Point IKSolver::GetPoint(UnityEngine.Transform transform)
    RootMotion::FinalIK::IKSolver::Point* GetPoint(UnityEngine::Transform* transform);
    // public override System.Void StoreDefaultLocalState()
    // Offset: 0x133A170
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::StoreDefaultLocalState()
    void StoreDefaultLocalState();
    // public override System.Void FixTransforms()
    // Offset: 0x133A1BC
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::FixTransforms()
    void FixTransforms();
    // public override System.Boolean IsValid(System.String message)
    // Offset: 0x133A21C
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Boolean IKSolver::IsValid(System.String message)
    bool IsValid(::Il2CppString*& message);
    // protected override System.Void OnInitiate()
    // Offset: 0x133AE68
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::OnInitiate()
    void OnInitiate();
    // protected override System.Void OnUpdate()
    // Offset: 0x133B2CC
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::OnUpdate()
    void OnUpdate();
    // public System.Void .ctor()
    // Offset: 0x1336FCC
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::.ctor()
    // Base method: System.Void Object::.ctor()
    static IKSolverTrigonometric* New_ctor();
  }; // RootMotion.FinalIK.IKSolverTrigonometric
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::IKSolverTrigonometric*, "RootMotion.FinalIK", "IKSolverTrigonometric");
#pragma pack(pop)
