// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: RootMotion.FinalIK.IKSolverVR
#include "RootMotion/FinalIK/IKSolverVR.hpp"
// Including type: RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.BodyPart
#include "RootMotion/FinalIK/IKSolverVR_BodyPart.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x228
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.Spine
  // [TokenAttribute] Offset: FFFFFFFF
  class IKSolverVR::Spine : public RootMotion::FinalIK::IKSolverVR::BodyPart {
    public:
    // [TooltipAttribute] Offset: 0xE297A0
    // public UnityEngine.Transform headTarget
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::Transform* headTarget;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xE297D8
    // public UnityEngine.Transform pelvisTarget
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::Transform* pelvisTarget;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xE29810
    // [RangeAttribute] Offset: 0xE29810
    // public System.Single positionWeight
    // Size: 0x4
    // Offset: 0x58
    float positionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29864
    // [RangeAttribute] Offset: 0xE29864
    // public System.Single rotationWeight
    // Size: 0x4
    // Offset: 0x5C
    float rotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE298B8
    // [RangeAttribute] Offset: 0xE298B8
    // public System.Single pelvisPositionWeight
    // Size: 0x4
    // Offset: 0x60
    float pelvisPositionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE2990C
    // [RangeAttribute] Offset: 0xE2990C
    // public System.Single pelvisRotationWeight
    // Size: 0x4
    // Offset: 0x64
    float pelvisRotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29960
    // public UnityEngine.Transform chestGoal
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::Transform* chestGoal;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xE29998
    // [RangeAttribute] Offset: 0xE29998
    // public System.Single chestGoalWeight
    // Size: 0x4
    // Offset: 0x70
    float chestGoalWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE299EC
    // public System.Single minHeadHeight
    // Size: 0x4
    // Offset: 0x74
    float minHeadHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29A24
    // [RangeAttribute] Offset: 0xE29A24
    // public System.Single bodyPosStiffness
    // Size: 0x4
    // Offset: 0x78
    float bodyPosStiffness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29A78
    // [RangeAttribute] Offset: 0xE29A78
    // public System.Single bodyRotStiffness
    // Size: 0x4
    // Offset: 0x7C
    float bodyRotStiffness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29ACC
    // [FormerlySerializedAsAttribute] Offset: 0xE29ACC
    // [RangeAttribute] Offset: 0xE29ACC
    // public System.Single neckStiffness
    // Size: 0x4
    // Offset: 0x80
    float neckStiffness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29B44
    // [RangeAttribute] Offset: 0xE29B44
    // public System.Single rotateChestByHands
    // Size: 0x4
    // Offset: 0x84
    float rotateChestByHands;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29B98
    // [RangeAttribute] Offset: 0xE29B98
    // public System.Single chestClampWeight
    // Size: 0x4
    // Offset: 0x88
    float chestClampWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29BEC
    // [RangeAttribute] Offset: 0xE29BEC
    // public System.Single headClampWeight
    // Size: 0x4
    // Offset: 0x8C
    float headClampWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29C40
    // public System.Single moveBodyBackWhenCrouching
    // Size: 0x4
    // Offset: 0x90
    float moveBodyBackWhenCrouching;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29C78
    // [RangeAttribute] Offset: 0xE29C78
    // public System.Single maintainPelvisPosition
    // Size: 0x4
    // Offset: 0x94
    float maintainPelvisPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29CCC
    // [RangeAttribute] Offset: 0xE29CCC
    // public System.Single maxRootAngle
    // Size: 0x4
    // Offset: 0x98
    float maxRootAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE29D24
    // [RangeAttribute] Offset: 0xE29D24
    // public System.Single rootHeadingOffset
    // Size: 0x4
    // Offset: 0x9C
    float rootHeadingOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 IKPositionHead
    // Size: 0xC
    // Offset: 0xA0
    UnityEngine::Vector3 IKPositionHead;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion IKRotationHead
    // Size: 0x10
    // Offset: 0xAC
    UnityEngine::Quaternion IKRotationHead;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 IKPositionPelvis
    // Size: 0xC
    // Offset: 0xBC
    UnityEngine::Vector3 IKPositionPelvis;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion IKRotationPelvis
    // Size: 0x10
    // Offset: 0xC8
    UnityEngine::Quaternion IKRotationPelvis;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 goalPositionChest
    // Size: 0xC
    // Offset: 0xD8
    UnityEngine::Vector3 goalPositionChest;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 pelvisPositionOffset
    // Size: 0xC
    // Offset: 0xE4
    UnityEngine::Vector3 pelvisPositionOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 chestPositionOffset
    // Size: 0xC
    // Offset: 0xF0
    UnityEngine::Vector3 chestPositionOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 headPositionOffset
    // Size: 0xC
    // Offset: 0xFC
    UnityEngine::Vector3 headPositionOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion pelvisRotationOffset
    // Size: 0x10
    // Offset: 0x108
    UnityEngine::Quaternion pelvisRotationOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion chestRotationOffset
    // Size: 0x10
    // Offset: 0x118
    UnityEngine::Quaternion chestRotationOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion headRotationOffset
    // Size: 0x10
    // Offset: 0x128
    UnityEngine::Quaternion headRotationOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 faceDirection
    // Size: 0xC
    // Offset: 0x138
    UnityEngine::Vector3 faceDirection;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 locomotionHeadPositionOffset
    // Size: 0xC
    // Offset: 0x144
    UnityEngine::Vector3 locomotionHeadPositionOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 headPosition
    // Size: 0xC
    // Offset: 0x150
    UnityEngine::Vector3 headPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion <anchorRotation>k__BackingField
    // Size: 0x10
    // Offset: 0x15C
    UnityEngine::Quaternion anchorRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion <anchorRelativeToHead>k__BackingField
    // Size: 0x10
    // Offset: 0x16C
    UnityEngine::Quaternion anchorRelativeToHead;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion headRotation
    // Size: 0x10
    // Offset: 0x17C
    UnityEngine::Quaternion headRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion pelvisRotation
    // Size: 0x10
    // Offset: 0x18C
    UnityEngine::Quaternion pelvisRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion anchorRelativeToPelvis
    // Size: 0x10
    // Offset: 0x19C
    UnityEngine::Quaternion anchorRelativeToPelvis;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion pelvisRelativeRotation
    // Size: 0x10
    // Offset: 0x1AC
    UnityEngine::Quaternion pelvisRelativeRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion chestRelativeRotation
    // Size: 0x10
    // Offset: 0x1BC
    UnityEngine::Quaternion chestRelativeRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 headDeltaPosition
    // Size: 0xC
    // Offset: 0x1CC
    UnityEngine::Vector3 headDeltaPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion pelvisDeltaRotation
    // Size: 0x10
    // Offset: 0x1D8
    UnityEngine::Quaternion pelvisDeltaRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion chestTargetRotation
    // Size: 0x10
    // Offset: 0x1E8
    UnityEngine::Quaternion chestTargetRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // private System.Int32 pelvisIndex
    // Size: 0x4
    // Offset: 0x1F8
    int pelvisIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 spineIndex
    // Size: 0x4
    // Offset: 0x1FC
    int spineIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chestIndex
    // Size: 0x4
    // Offset: 0x200
    int chestIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 neckIndex
    // Size: 0x4
    // Offset: 0x204
    int neckIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 headIndex
    // Size: 0x4
    // Offset: 0x208
    int headIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single length
    // Size: 0x4
    // Offset: 0x20C
    float length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean hasChest
    // Size: 0x1
    // Offset: 0x210
    bool hasChest;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasNeck
    // Size: 0x1
    // Offset: 0x211
    bool hasNeck;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasLegs
    // Size: 0x1
    // Offset: 0x212
    bool hasLegs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasLegs and: headHeight
    char __padding51[0x1] = {};
    // private System.Single headHeight
    // Size: 0x4
    // Offset: 0x214
    float headHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single sizeMlp
    // Size: 0x4
    // Offset: 0x218
    float sizeMlp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 chestForward
    // Size: 0xC
    // Offset: 0x21C
    UnityEngine::Vector3 chestForward;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // Creating value type constructor for type: Spine
