// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.IKSolver
#include "RootMotion/FinalIK/IKSolver.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: RootMotion.FinalIK.IKSolverVR
#include "RootMotion/FinalIK/IKSolverVR.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.IKSolverArm
  class IKSolverArm : public RootMotion::FinalIK::IKSolver {
    public:
    // public System.Single IKRotationWeight
    // Offset: 0x58
    float IKRotationWeight;
    // public UnityEngine.Quaternion IKRotation
    // Offset: 0x5C
    UnityEngine::Quaternion IKRotation;
    // public RootMotion.FinalIK.IKSolver/Point chest
    // Offset: 0x70
    RootMotion::FinalIK::IKSolver::Point* chest;
    // public RootMotion.FinalIK.IKSolver/Point shoulder
    // Offset: 0x78
    RootMotion::FinalIK::IKSolver::Point* shoulder;
    // public RootMotion.FinalIK.IKSolver/Point upperArm
    // Offset: 0x80
    RootMotion::FinalIK::IKSolver::Point* upperArm;
    // public RootMotion.FinalIK.IKSolver/Point forearm
    // Offset: 0x88
    RootMotion::FinalIK::IKSolver::Point* forearm;
    // public RootMotion.FinalIK.IKSolver/Point hand
    // Offset: 0x90
    RootMotion::FinalIK::IKSolver::Point* hand;
    // public System.Boolean isLeft
    // Offset: 0x98
    bool isLeft;
    // public RootMotion.FinalIK.IKSolverVR/Arm arm
    // Offset: 0xA0
    RootMotion::FinalIK::IKSolverVR::Arm* arm;
    // private UnityEngine.Vector3[] positions
    // Offset: 0xA8
    ::Array<UnityEngine::Vector3>* positions;
    // private UnityEngine.Quaternion[] rotations
    // Offset: 0xB0
    ::Array<UnityEngine::Quaternion>* rotations;
    // public System.Boolean SetChain(UnityEngine.Transform chest, UnityEngine.Transform shoulder, UnityEngine.Transform upperArm, UnityEngine.Transform forearm, UnityEngine.Transform hand, UnityEngine.Transform root)
    // Offset: 0x1345594
    bool SetChain(UnityEngine::Transform* chest, UnityEngine::Transform* shoulder, UnityEngine::Transform* upperArm, UnityEngine::Transform* forearm, UnityEngine::Transform* hand, UnityEngine::Transform* root);
    // private System.Void Solve()
    // Offset: 0x1345DE4
    void Solve();
    // private System.Void Read()
    // Offset: 0x1345AAC
    void Read();
    // private System.Void Write()
    // Offset: 0x1345E50
    void Write();
    // public override System.Boolean IsValid(ref System.String message)
    // Offset: 0x13451D8
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Boolean IKSolver::IsValid(ref System.String message)
    bool IsValid(::Il2CppString*& message);
    // public override RootMotion.FinalIK.IKSolver/Point[] GetPoints()
    // Offset: 0x134564C
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: RootMotion.FinalIK.IKSolver/Point[] IKSolver::GetPoints()
    ::Array<RootMotion::FinalIK::IKSolver::Point*>* GetPoints();
    // public override RootMotion.FinalIK.IKSolver/Point GetPoint(UnityEngine.Transform transform)
    // Offset: 0x13457E4
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: RootMotion.FinalIK.IKSolver/Point IKSolver::GetPoint(UnityEngine.Transform transform)
    RootMotion::FinalIK::IKSolver::Point* GetPoint(UnityEngine::Transform* transform);
    // public override System.Void StoreDefaultLocalState()
    // Offset: 0x134597C
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::StoreDefaultLocalState()
    void StoreDefaultLocalState();
    // public override System.Void FixTransforms()
    // Offset: 0x13459D8
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::FixTransforms()
    void FixTransforms();
    // protected override System.Void OnInitiate()
    // Offset: 0x1345A48
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::OnInitiate()
    void OnInitiate();
    // protected override System.Void OnUpdate()
    // Offset: 0x1345DB8
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::OnUpdate()
    void OnUpdate();
    // public System.Void .ctor()
    // Offset: 0x1345FDC
    // Implemented from: RootMotion.FinalIK.IKSolver
    // Base method: System.Void IKSolver::.ctor()
    // Base method: System.Void Object::.ctor()
    static IKSolverArm* New_ctor();
  }; // RootMotion.FinalIK.IKSolverArm
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::IKSolverArm*, "RootMotion.FinalIK", "IKSolverArm");
#pragma pack(pop)
