// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: RootMotion.FinalIK.IKSolver
#include "RootMotion/FinalIK/IKSolver.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: RootMotion.FinalIK.VRIK
#include "RootMotion/FinalIK/VRIK.hpp"
// Including type: UnityEngine.Keyframe
#include "UnityEngine/Keyframe.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKSolverVR
  class IKSolverVR;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::RootMotion::FinalIK::IKSolverVR);
DEFINE_IL2CPP_ARG_TYPE(::RootMotion::FinalIK::IKSolverVR*, "RootMotion.FinalIK", "IKSolverVR");
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x178
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.IKSolverVR
  // [TokenAttribute] Offset: FFFFFFFF
  class IKSolverVR : public ::RootMotion::FinalIK::IKSolver {
    public:
    // Nested type: ::RootMotion::FinalIK::IKSolverVR::Arm
    class Arm;
    // Nested type: ::RootMotion::FinalIK::IKSolverVR::BodyPart
    class BodyPart;
    // Nested type: ::RootMotion::FinalIK::IKSolverVR::Footstep
    class Footstep;
    // Nested type: ::RootMotion::FinalIK::IKSolverVR::Leg
    class Leg;
    // Nested type: ::RootMotion::FinalIK::IKSolverVR::Locomotion
    class Locomotion;
    // Nested type: ::RootMotion::FinalIK::IKSolverVR::Spine
    class Spine;
    // Nested type: ::RootMotion::FinalIK::IKSolverVR::PositionOffset
    struct PositionOffset;
    // Nested type: ::RootMotion::FinalIK::IKSolverVR::RotationOffset
    struct RotationOffset;
    // Nested type: ::RootMotion::FinalIK::IKSolverVR::VirtualBone
    class VirtualBone;
    public:
    // private UnityEngine.Transform[] solverTransforms
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::Transform*> solverTransforms;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // private System.Boolean hasChest
    // Size: 0x1
    // Offset: 0x60
    bool hasChest;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasNeck
    // Size: 0x1
    // Offset: 0x61
    bool hasNeck;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasShoulders
    // Size: 0x1
    // Offset: 0x62
    bool hasShoulders;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasToes
    // Size: 0x1
    // Offset: 0x63
    bool hasToes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasLegs
    // Size: 0x1
    // Offset: 0x64
    bool hasLegs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasLegs and: readPositions
    char __padding5[0x3] = {};
    // private UnityEngine.Vector3[] readPositions
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::UnityEngine::Vector3> readPositions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Quaternion[] readRotations
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::Quaternion> readRotations;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // private UnityEngine.Vector3[] solvedPositions
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::Vector3> solvedPositions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Quaternion[] solvedRotations
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::UnityEngine::Quaternion> solvedRotations;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // private UnityEngine.Quaternion[] defaultLocalRotations
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::Quaternion> defaultLocalRotations;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // private UnityEngine.Vector3[] defaultLocalPositions
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::UnityEngine::Vector3> defaultLocalPositions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector3 rootV
    // Size: 0xC
    // Offset: 0x98
    ::UnityEngine::Vector3 rootV;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 rootVelocity
    // Size: 0xC
    // Offset: 0xA4
    ::UnityEngine::Vector3 rootVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 bodyOffset
    // Size: 0xC
    // Offset: 0xB0
    ::UnityEngine::Vector3 bodyOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Int32 supportLegIndex
    // Size: 0x4
    // Offset: 0xBC
    int supportLegIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 lastLOD
    // Size: 0x4
    // Offset: 0xC0
    int lastLOD;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0x114674C
    // [RangeAttribute] Offset: 0x114674C
    // public System.Int32 LOD
    // Size: 0x4
    // Offset: 0xC4
    int LOD;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0x11467A0
    // public System.Boolean plantFeet
    // Size: 0x1
    // Offset: 0xC8
    bool plantFeet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: plantFeet and: rootBone
    char __padding18[0x7] = {};
    // private RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.VirtualBone <rootBone>k__BackingField
    // Size: 0x8
    // Offset: 0xD0
    ::RootMotion::FinalIK::IKSolverVR::VirtualBone* rootBone;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::IKSolverVR::VirtualBone*) == 0x8);
    // [TooltipAttribute] Offset: 0x11467E8
    // public RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.Spine spine
    // Size: 0x8
    // Offset: 0xD8
    ::RootMotion::FinalIK::IKSolverVR::Spine* spine;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::IKSolverVR::Spine*) == 0x8);
    // [TooltipAttribute] Offset: 0x1146820
    // public RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.Arm leftArm
    // Size: 0x8
    // Offset: 0xE0
    ::RootMotion::FinalIK::IKSolverVR::Arm* leftArm;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::IKSolverVR::Arm*) == 0x8);
    // [TooltipAttribute] Offset: 0x1146858
    // public RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.Arm rightArm
    // Size: 0x8
    // Offset: 0xE8
    ::RootMotion::FinalIK::IKSolverVR::Arm* rightArm;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::IKSolverVR::Arm*) == 0x8);
    // [TooltipAttribute] Offset: 0x1146890
    // public RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.Leg leftLeg
    // Size: 0x8
    // Offset: 0xF0
    ::RootMotion::FinalIK::IKSolverVR::Leg* leftLeg;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::IKSolverVR::Leg*) == 0x8);
    // [TooltipAttribute] Offset: 0x11468C8
    // public RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.Leg rightLeg
    // Size: 0x8
    // Offset: 0xF8
    ::RootMotion::FinalIK::IKSolverVR::Leg* rightLeg;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::IKSolverVR::Leg*) == 0x8);
    // [TooltipAttribute] Offset: 0x1146900
    // public RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.Locomotion locomotion
    // Size: 0x8
    // Offset: 0x100
    ::RootMotion::FinalIK::IKSolverVR::Locomotion* locomotion;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::IKSolverVR::Locomotion*) == 0x8);
    // private RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.Leg[] legs
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::RootMotion::FinalIK::IKSolverVR::Leg*> legs;
    // Field size check
    static_assert(sizeof(::ArrayW<::RootMotion::FinalIK::IKSolverVR::Leg*>) == 0x8);
    // private RootMotion.FinalIK.IKSolverVR/RootMotion.FinalIK.Arm[] arms
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::RootMotion::FinalIK::IKSolverVR::Arm*> arms;
    // Field size check
    static_assert(sizeof(::ArrayW<::RootMotion::FinalIK::IKSolverVR::Arm*>) == 0x8);
    // private UnityEngine.Vector3 headPosition
    // Size: 0xC
    // Offset: 0x118
    ::UnityEngine::Vector3 headPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 headDeltaPosition
    // Size: 0xC
    // Offset: 0x124
    ::UnityEngine::Vector3 headDeltaPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 raycastOriginPelvis
    // Size: 0xC
    // Offset: 0x130
    ::UnityEngine::Vector3 raycastOriginPelvis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastOffset
    // Size: 0xC
    // Offset: 0x13C
    ::UnityEngine::Vector3 lastOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 debugPos1
    // Size: 0xC
    // Offset: 0x148
    ::UnityEngine::Vector3 debugPos1;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 debugPos2
    // Size: 0xC
    // Offset: 0x154
    ::UnityEngine::Vector3 debugPos2;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 debugPos3
    // Size: 0xC
    // Offset: 0x160
    ::UnityEngine::Vector3 debugPos3;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 debugPos4
    // Size: 0xC
    // Offset: 0x16C
    ::UnityEngine::Vector3 debugPos4;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Get instance field reference: private UnityEngine.Transform[] solverTransforms
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Transform*>& dyn_solverTransforms();
    // Get instance field reference: private System.Boolean hasChest
    [[deprecated("Use field access instead!")]] bool& dyn_hasChest();
    // Get instance field reference: private System.Boolean hasNeck
    [[deprecated("Use field access instead!")]] bool& dyn_hasNeck();
    // Get instance field reference: private System.Boolean hasShoulders
    [[deprecated("Use field access instead!")]] bool& dyn_hasShoulders();
    // Get instance field reference: private System.Boolean hasToes
    [[deprecated("Use field access instead!")]] bool& dyn_hasToes();
    // Get instance field reference: private System.Boolean hasLegs
