// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.IKSolverVR
#include "RootMotion/FinalIK/IKSolverVR.hpp"
// Including type: RootMotion.FinalIK.IKSolverVR/BodyPart
#include "RootMotion/FinalIK/IKSolverVR_BodyPart.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.IKSolverVR/Leg
  class IKSolverVR::Leg : public RootMotion::FinalIK::IKSolverVR::BodyPart {
    public:
    // public UnityEngine.Transform target
    // Offset: 0x48
    UnityEngine::Transform* target;
    // public UnityEngine.Transform bendGoal
    // Offset: 0x50
    UnityEngine::Transform* bendGoal;
    // public System.Single positionWeight
    // Offset: 0x58
    float positionWeight;
    // public System.Single rotationWeight
    // Offset: 0x5C
    float rotationWeight;
    // public System.Single bendGoalWeight
    // Offset: 0x60
    float bendGoalWeight;
    // public System.Single swivelOffset
    // Offset: 0x64
    float swivelOffset;
    // public System.Single bendToTargetWeight
    // Offset: 0x68
    float bendToTargetWeight;
    // public System.Single legLengthMlp
    // Offset: 0x6C
    float legLengthMlp;
    // public UnityEngine.AnimationCurve stretchCurve
    // Offset: 0x70
    UnityEngine::AnimationCurve* stretchCurve;
    // public UnityEngine.Vector3 IKPosition
    // Offset: 0x78
    UnityEngine::Vector3 IKPosition;
    // public UnityEngine.Quaternion IKRotation
    // Offset: 0x84
    UnityEngine::Quaternion IKRotation;
    // public UnityEngine.Vector3 footPositionOffset
    // Offset: 0x94
    UnityEngine::Vector3 footPositionOffset;
    // public UnityEngine.Vector3 heelPositionOffset
    // Offset: 0xA0
    UnityEngine::Vector3 heelPositionOffset;
    // public UnityEngine.Quaternion footRotationOffset
    // Offset: 0xAC
    UnityEngine::Quaternion footRotationOffset;
    // public System.Single currentMag
    // Offset: 0xBC
    float currentMag;
    // public System.Boolean useAnimatedBendNormal
    // Offset: 0xC0
    bool useAnimatedBendNormal;
    // private UnityEngine.Vector3 <position>k__BackingField
    // Offset: 0xC4
    UnityEngine::Vector3 position;
    // private UnityEngine.Quaternion <rotation>k__BackingField
    // Offset: 0xD0
    UnityEngine::Quaternion rotation;
    // private System.Boolean <hasToes>k__BackingField
    // Offset: 0xE0
    bool hasToes;
    // private UnityEngine.Vector3 <thighRelativeToPelvis>k__BackingField
    // Offset: 0xE4
    UnityEngine::Vector3 thighRelativeToPelvis;
    // private UnityEngine.Vector3 footPosition
    // Offset: 0xF0
    UnityEngine::Vector3 footPosition;
    // private UnityEngine.Quaternion footRotation
    // Offset: 0xFC
    UnityEngine::Quaternion footRotation;
    // private UnityEngine.Vector3 bendNormal
    // Offset: 0x10C
    UnityEngine::Vector3 bendNormal;
    // private UnityEngine.Quaternion calfRelToThigh
    // Offset: 0x118
    UnityEngine::Quaternion calfRelToThigh;
    // private UnityEngine.Quaternion thighRelToFoot
    // Offset: 0x128
    UnityEngine::Quaternion thighRelToFoot;
    // private UnityEngine.Vector3 bendNormalRelToPelvis
    // Offset: 0x138
    UnityEngine::Vector3 bendNormalRelToPelvis;
    // private UnityEngine.Vector3 bendNormalRelToTarget
    // Offset: 0x144
    UnityEngine::Vector3 bendNormalRelToTarget;
    // public UnityEngine.Vector3 get_position()
    // Offset: 0x14416F8
    UnityEngine::Vector3 get_position();
    // private System.Void set_position(UnityEngine.Vector3 value)
    // Offset: 0x1441704
    void set_position(UnityEngine::Vector3 value);
    // public UnityEngine.Quaternion get_rotation()
    // Offset: 0x1441710
    UnityEngine::Quaternion get_rotation();
    // private System.Void set_rotation(UnityEngine.Quaternion value)
    // Offset: 0x144171C
    void set_rotation(UnityEngine::Quaternion value);
    // public System.Boolean get_hasToes()
    // Offset: 0x1441728
    bool get_hasToes();
    // private System.Void set_hasToes(System.Boolean value)
    // Offset: 0x1441730
    void set_hasToes(bool value);
    // public RootMotion.FinalIK.IKSolverVR/VirtualBone get_thigh()
    // Offset: 0x144173C
    RootMotion::FinalIK::IKSolverVR::VirtualBone* get_thigh();
    // private RootMotion.FinalIK.IKSolverVR/VirtualBone get_calf()
    // Offset: 0x1441770
    RootMotion::FinalIK::IKSolverVR::VirtualBone* get_calf();
    // private RootMotion.FinalIK.IKSolverVR/VirtualBone get_foot()
    // Offset: 0x14417A8
    RootMotion::FinalIK::IKSolverVR::VirtualBone* get_foot();
    // private RootMotion.FinalIK.IKSolverVR/VirtualBone get_toes()
    // Offset: 0x14417E0
    RootMotion::FinalIK::IKSolverVR::VirtualBone* get_toes();
    // public RootMotion.FinalIK.IKSolverVR/VirtualBone get_lastBone()
    // Offset: 0x1441818
    RootMotion::FinalIK::IKSolverVR::VirtualBone* get_lastBone();
    // public UnityEngine.Vector3 get_thighRelativeToPelvis()
    // Offset: 0x1441858
    UnityEngine::Vector3 get_thighRelativeToPelvis();
    // private System.Void set_thighRelativeToPelvis(UnityEngine.Vector3 value)
    // Offset: 0x1441864
    void set_thighRelativeToPelvis(UnityEngine::Vector3 value);
    // private System.Void ApplyPositionOffset(UnityEngine.Vector3 offset, System.Single weight)
    // Offset: 0x144265C
    void ApplyPositionOffset(UnityEngine::Vector3 offset, float weight);
    // private System.Void ApplyRotationOffset(UnityEngine.Quaternion offset, System.Single weight)
    // Offset: 0x1442424
    void ApplyRotationOffset(UnityEngine::Quaternion offset, float weight);
    // public System.Void Solve(System.Boolean stretch)
    // Offset: 0x1442D18
    void Solve(bool stretch);
    // private System.Void FixTwistRotations()
    // Offset: 0x1443464
    void FixTwistRotations();
    // private System.Void Stretching()
    // Offset: 0x1442F38
    void Stretching();
    // protected override System.Void OnRead(UnityEngine.Vector3[] positions, UnityEngine.Quaternion[] rotations, System.Boolean hasChest, System.Boolean hasNeck, System.Boolean hasShoulders, System.Boolean hasToes, System.Boolean hasLegs, System.Int32 rootIndex, System.Int32 index)
    // Offset: 0x1441870
    // Implemented from: RootMotion.FinalIK.IKSolverVR/BodyPart
    // Base method: System.Void BodyPart::OnRead(UnityEngine.Vector3[] positions, UnityEngine.Quaternion[] rotations, System.Boolean hasChest, System.Boolean hasNeck, System.Boolean hasShoulders, System.Boolean hasToes, System.Boolean hasLegs, System.Int32 rootIndex, System.Int32 index)
    void OnRead(::Array<UnityEngine::Vector3>* positions, ::Array<UnityEngine::Quaternion>* rotations, bool hasChest, bool hasNeck, bool hasShoulders, bool hasToes, bool hasLegs, int rootIndex, int index);
    // public override System.Void PreSolve()
    // Offset: 0x1441E78
    // Implemented from: RootMotion.FinalIK.IKSolverVR/BodyPart
    // Base method: System.Void BodyPart::PreSolve()
    void PreSolve();
    // public override System.Void ApplyOffsets()
    // Offset: 0x1442760
    // Implemented from: RootMotion.FinalIK.IKSolverVR/BodyPart
    // Base method: System.Void BodyPart::ApplyOffsets()
    void ApplyOffsets();
    // public override System.Void Write(ref UnityEngine.Vector3[] solvedPositions, ref UnityEngine.Quaternion[] solvedRotations)
    // Offset: 0x14438CC
    // Implemented from: RootMotion.FinalIK.IKSolverVR/BodyPart
    // Base method: System.Void BodyPart::Write(ref UnityEngine.Vector3[] solvedPositions, ref UnityEngine.Quaternion[] solvedRotations)
    void Write(::Array<UnityEngine::Vector3>*& solvedPositions, ::Array<UnityEngine::Quaternion>*& solvedRotations);
    // public override System.Void ResetOffsets()
    // Offset: 0x1443AE8
    // Implemented from: RootMotion.FinalIK.IKSolverVR/BodyPart
    // Base method: System.Void BodyPart::ResetOffsets()
    void ResetOffsets();
    // public System.Void .ctor()
    // Offset: 0x1443B98
    // Implemented from: RootMotion.FinalIK.IKSolverVR/BodyPart
    // Base method: System.Void BodyPart::.ctor()
    // Base method: System.Void Object::.ctor()
    static IKSolverVR::Leg* New_ctor();
  }; // RootMotion.FinalIK.IKSolverVR/Leg
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::IKSolverVR::Leg*, "RootMotion.FinalIK", "IKSolverVR/Leg");
#pragma pack(pop)
