// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.Inertia
#include "RootMotion/FinalIK/Inertia.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKSolverFullBodyBiped
  class IKSolverFullBodyBiped;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.Inertia/Body
  class Inertia::Body : public ::Il2CppObject {
    public:
    // Nested type: RootMotion::FinalIK::Inertia::Body::EffectorLink
    class EffectorLink;
    // public UnityEngine.Transform transform
    // Offset: 0x10
    UnityEngine::Transform* transform;
    // public RootMotion.FinalIK.Inertia/Body/EffectorLink[] effectorLinks
    // Offset: 0x18
    ::Array<RootMotion::FinalIK::Inertia::Body::EffectorLink*>* effectorLinks;
    // public System.Single speed
    // Offset: 0x20
    float speed;
    // public System.Single acceleration
    // Offset: 0x24
    float acceleration;
    // public System.Single matchVelocity
    // Offset: 0x28
    float matchVelocity;
    // public System.Single gravity
    // Offset: 0x2C
    float gravity;
    // private UnityEngine.Vector3 delta
    // Offset: 0x30
    UnityEngine::Vector3 delta;
    // private UnityEngine.Vector3 lazyPoint
    // Offset: 0x3C
    UnityEngine::Vector3 lazyPoint;
    // private UnityEngine.Vector3 direction
    // Offset: 0x48
    UnityEngine::Vector3 direction;
    // private UnityEngine.Vector3 lastPosition
    // Offset: 0x54
    UnityEngine::Vector3 lastPosition;
    // private System.Boolean firstUpdate
    // Offset: 0x60
    bool firstUpdate;
    // public System.Void Reset()
    // Offset: 0x144ABBC
    void Reset();
    // public System.Void Update(RootMotion.FinalIK.IKSolverFullBodyBiped solver, System.Single weight, System.Single deltaTime)
    // Offset: 0x144AD54
    void Update(RootMotion::FinalIK::IKSolverFullBodyBiped* solver, float weight, float deltaTime);
    // public System.Void .ctor()
    // Offset: 0x144B0D4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static Inertia::Body* New_ctor();
  }; // RootMotion.FinalIK.Inertia/Body
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::Inertia::Body*, "RootMotion.FinalIK", "Inertia/Body");
#pragma pack(pop)
