// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: LookAtIK
  class LookAtIK;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.InteractionLookAt
  class InteractionLookAt : public ::Il2CppObject {
    public:
    // public RootMotion.FinalIK.LookAtIK ik
    // Offset: 0x10
    RootMotion::FinalIK::LookAtIK* ik;
    // public System.Single lerpSpeed
    // Offset: 0x18
    float lerpSpeed;
    // public System.Single weightSpeed
    // Offset: 0x1C
    float weightSpeed;
    // public System.Boolean isPaused
    // Offset: 0x20
    bool isPaused;
    // private UnityEngine.Transform lookAtTarget
    // Offset: 0x28
    UnityEngine::Transform* lookAtTarget;
    // private System.Single stopLookTime
    // Offset: 0x30
    float stopLookTime;
    // private System.Single weight
    // Offset: 0x34
    float weight;
    // private System.Boolean firstFBBIKSolve
    // Offset: 0x38
    bool firstFBBIKSolve;
    // public System.Void Look(UnityEngine.Transform target, System.Single time)
    // Offset: 0x144E31C
    void Look(UnityEngine::Transform* target, float time);
    // public System.Void OnFixTransforms()
    // Offset: 0x144E4A0
    void OnFixTransforms();
    // public System.Void Update()
    // Offset: 0x144E548
    void Update();
    // public System.Void SolveSpine()
    // Offset: 0x144E79C
    void SolveSpine();
    // public System.Void SolveHead()
    // Offset: 0x144E894
    void SolveHead();
    // public System.Void .ctor()
    // Offset: 0x144E960
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static InteractionLookAt* New_ctor();
  }; // RootMotion.FinalIK.InteractionLookAt
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::InteractionLookAt*, "RootMotion.FinalIK", "InteractionLookAt");
#pragma pack(pop)
