// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: RootMotion.FinalIK.InteractionTrigger
#include "RootMotion/FinalIK/InteractionTrigger.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: FullBodyBipedIK
  class FullBodyBipedIK;
  // Forward declaring type: InteractionLookAt
  class InteractionLookAt;
  // Forward declaring type: InteractionEffector
  class InteractionEffector;
  // Forward declaring type: FullBodyBipedEffector
  struct FullBodyBipedEffector;
  // Forward declaring type: InteractionObject
  class InteractionObject;
  // Forward declaring type: InteractionTarget
  class InteractionTarget;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0xF0
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.InteractionSystem
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: EF0FD4
  // [AddComponentMenu] Offset: EF0FD4
  class InteractionSystem : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: RootMotion::FinalIK::InteractionSystem::InteractionDelegate
    class InteractionDelegate;
    // Nested type: RootMotion::FinalIK::InteractionSystem::InteractionEventDelegate
    class InteractionEventDelegate;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    private:
    #endif
    // [TooltipAttribute] Offset: 0xEF383C
    // public System.String targetTag
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* targetTag;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [TooltipAttribute] Offset: 0xEF3874
    // public System.Single fadeInTime
    // Size: 0x4
    // Offset: 0x20
    float fadeInTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEF38AC
    // public System.Single speed
    // Size: 0x4
    // Offset: 0x24
    float speed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEF38E4
    // public System.Single resetToDefaultsSpeed
    // Size: 0x4
    // Offset: 0x28
    float resetToDefaultsSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: resetToDefaultsSpeed and: characterCollider
    char __padding3[0x4] = {};
    // [HeaderAttribute] Offset: 0xEF391C
    // [TooltipAttribute] Offset: 0xEF391C
    // [FormerlySerializedAsAttribute] Offset: 0xEF391C
    // public UnityEngine.Collider characterCollider
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::Collider* characterCollider;
    // Field size check
    static_assert(sizeof(UnityEngine::Collider*) == 0x8);
    // [TooltipAttribute] Offset: 0xEF39A0
    // [FormerlySerializedAsAttribute] Offset: 0xEF39A0
    // public UnityEngine.Transform FPSCamera
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::Transform* FPSCamera;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xEF3A00
    // public UnityEngine.LayerMask camRaycastLayers
    // Size: 0x4
    // Offset: 0x40
    UnityEngine::LayerMask camRaycastLayers;
    // Field size check
    static_assert(sizeof(UnityEngine::LayerMask) == 0x4);
    // [TooltipAttribute] Offset: 0xEF3A38
    // public System.Single camRaycastDistance
    // Size: 0x4
    // Offset: 0x44
    float camRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.List`1<RootMotion.FinalIK.InteractionTrigger> <triggersInRange>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    System::Collections::Generic::List_1<RootMotion::FinalIK::InteractionTrigger*>* triggersInRange;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<RootMotion::FinalIK::InteractionTrigger*>*) == 0x8);
    // private System.Collections.Generic.List`1<RootMotion.FinalIK.InteractionTrigger> inContact
    // Size: 0x8
    // Offset: 0x50
    System::Collections::Generic::List_1<RootMotion::FinalIK::InteractionTrigger*>* inContact;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<RootMotion::FinalIK::InteractionTrigger*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> bestRangeIndexes
    // Size: 0x8
    // Offset: 0x58
    System::Collections::Generic::List_1<int>* bestRangeIndexes;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<int>*) == 0x8);
    // public RootMotion.FinalIK.InteractionSystem/RootMotion.FinalIK.InteractionDelegate OnInteractionStart
    // Size: 0x8
    // Offset: 0x60
    RootMotion::FinalIK::InteractionSystem::InteractionDelegate* OnInteractionStart;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::InteractionSystem::InteractionDelegate*) == 0x8);
    // public RootMotion.FinalIK.InteractionSystem/RootMotion.FinalIK.InteractionDelegate OnInteractionPause
    // Size: 0x8
    // Offset: 0x68
    RootMotion::FinalIK::InteractionSystem::InteractionDelegate* OnInteractionPause;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::InteractionSystem::InteractionDelegate*) == 0x8);
    // public RootMotion.FinalIK.InteractionSystem/RootMotion.FinalIK.InteractionDelegate OnInteractionPickUp
    // Size: 0x8
    // Offset: 0x70
    RootMotion::FinalIK::InteractionSystem::InteractionDelegate* OnInteractionPickUp;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::InteractionSystem::InteractionDelegate*) == 0x8);
    // public RootMotion.FinalIK.InteractionSystem/RootMotion.FinalIK.InteractionDelegate OnInteractionResume
    // Size: 0x8
    // Offset: 0x78
    RootMotion::FinalIK::InteractionSystem::InteractionDelegate* OnInteractionResume;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::InteractionSystem::InteractionDelegate*) == 0x8);
    // public RootMotion.FinalIK.InteractionSystem/RootMotion.FinalIK.InteractionDelegate OnInteractionStop
    // Size: 0x8
    // Offset: 0x80
    RootMotion::FinalIK::InteractionSystem::InteractionDelegate* OnInteractionStop;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::InteractionSystem::InteractionDelegate*) == 0x8);
    // public RootMotion.FinalIK.InteractionSystem/RootMotion.FinalIK.InteractionEventDelegate OnInteractionEvent
    // Size: 0x8
    // Offset: 0x88
    RootMotion::FinalIK::InteractionSystem::InteractionEventDelegate* OnInteractionEvent;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::InteractionSystem::InteractionEventDelegate*) == 0x8);
    // public UnityEngine.RaycastHit raycastHit
    // Size: 0x2C
    // Offset: 0x90
    UnityEngine::RaycastHit raycastHit;
    // Field size check
    static_assert(sizeof(UnityEngine::RaycastHit) == 0x2C);
    // Padding between fields: raycastHit and: fullBody
    char __padding17[0x4] = {};
    // [SpaceAttribute] Offset: 0xEF3A80
    // [TooltipAttribute] Offset: 0xEF3A80
    // private RootMotion.FinalIK.FullBodyBipedIK fullBody
    // Size: 0x8
    // Offset: 0xC0
    RootMotion::FinalIK::FullBodyBipedIK* fullBody;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::FullBodyBipedIK*) == 0x8);
    // [TooltipAttribute] Offset: 0xEF3AE0
    // public RootMotion.FinalIK.InteractionLookAt lookAt
    // Size: 0x8
    // Offset: 0xC8
    RootMotion::FinalIK::InteractionLookAt* lookAt;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::InteractionLookAt*) == 0x8);
    // private RootMotion.FinalIK.InteractionEffector[] interactionEffectors
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<RootMotion::FinalIK::InteractionEffector*> interactionEffectors;
    // Field size check
    static_assert(sizeof(::ArrayW<RootMotion::FinalIK::InteractionEffector*>) == 0x8);
    // private System.Boolean initiated
    // Size: 0x1
    // Offset: 0xD8
    bool initiated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: initiated and: lastCollider
    char __padding21[0x7] = {};
    // private UnityEngine.Collider lastCollider
    // Size: 0x8
    // Offset: 0xE0
    UnityEngine::Collider* lastCollider;
    // Field size check
    static_assert(sizeof(UnityEngine::Collider*) == 0x8);
    // private UnityEngine.Collider c
    // Size: 0x8
    // Offset: 0xE8
    UnityEngine::Collider* c;
    // Field size check
    static_assert(sizeof(UnityEngine::Collider*) == 0x8);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String targetTag
    ::Il2CppString*& dyn_targetTag();
    // Get instance field reference: public System.Single fadeInTime
    float& dyn_fadeInTime();
    // Get instance field reference: public System.Single speed
    float& dyn_speed();
    // Get instance field reference: public System.Single resetToDefaultsSpeed
    float& dyn_resetToDefaultsSpeed();
    // Get instance field reference: public UnityEngine.Collider characterCollider
    UnityEngine::Collider*& dyn_characterCollider();
    // Get instance field reference: public UnityEngine.Transform FPSCamera
    UnityEngine::Transform*& dyn_FPSCamera();
