// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKSolverFullBodyBiped
  class IKSolverFullBodyBiped;
  // Forward declaring type: InteractionSystem
  class InteractionSystem;
  // Forward declaring type: InteractionTarget
  class InteractionTarget;
  // Forward declaring type: FullBodyBipedEffector
  struct FullBodyBipedEffector;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.InteractionObject
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: EF0BDC
  // [AddComponentMenu] Offset: EF0BDC
  class InteractionObject : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: RootMotion::FinalIK::InteractionObject::InteractionEvent
    class InteractionEvent;
    // Nested type: RootMotion::FinalIK::InteractionObject::Message
    class Message;
    // Nested type: RootMotion::FinalIK::InteractionObject::AnimatorEvent
    class AnimatorEvent;
    // Nested type: RootMotion::FinalIK::InteractionObject::WeightCurve
    class WeightCurve;
    // Nested type: RootMotion::FinalIK::InteractionObject::Multiplier
    class Multiplier;
    // Size: 0x20
    #pragma pack(push, 1)
    // Autogenerated type: RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve
    // [TokenAttribute] Offset: FFFFFFFF
    class WeightCurve : public ::Il2CppObject {
      public:
      // Nested type: RootMotion::FinalIK::InteractionObject::WeightCurve::Type
      struct Type;
      // Size: 0x4
      #pragma pack(push, 1)
      // Autogenerated type: RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type
      // [TokenAttribute] Offset: FFFFFFFF
      struct Type/*, public System::Enum*/ {
        public:
        #ifdef USE_CODEGEN_FIELDS
        public:
        #else
        protected:
        #endif
        // public System.Int32 value__
        // Size: 0x4
        // Offset: 0x0
        int value;
        // Field size check
        static_assert(sizeof(int) == 0x4);
        public:
        // Creating value type constructor for type: Type
        constexpr Type(int value_ = {}) noexcept : value{value_} {}
        // Creating interface conversion operator: operator System::Enum
        operator System::Enum() noexcept {
          return *reinterpret_cast<System::Enum*>(this);
        }
        // Creating conversion operator: operator int
        constexpr operator int() const noexcept {
          return value;
        }
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionWeight
        static constexpr const int PositionWeight = 0;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionWeight
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_PositionWeight();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionWeight
        static void _set_PositionWeight(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type RotationWeight
        static constexpr const int RotationWeight = 1;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type RotationWeight
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_RotationWeight();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type RotationWeight
        static void _set_RotationWeight(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionOffsetX
        static constexpr const int PositionOffsetX = 2;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionOffsetX
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_PositionOffsetX();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionOffsetX
        static void _set_PositionOffsetX(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionOffsetY
        static constexpr const int PositionOffsetY = 3;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionOffsetY
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_PositionOffsetY();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionOffsetY
        static void _set_PositionOffsetY(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionOffsetZ
        static constexpr const int PositionOffsetZ = 4;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionOffsetZ
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_PositionOffsetZ();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PositionOffsetZ
        static void _set_PositionOffsetZ(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type Pull
        static constexpr const int Pull = 5;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type Pull
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_Pull();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type Pull
        static void _set_Pull(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type Reach
        static constexpr const int Reach = 6;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type Reach
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_Reach();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type Reach
        static void _set_Reach(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type RotateBoneWeight
        static constexpr const int RotateBoneWeight = 7;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type RotateBoneWeight
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_RotateBoneWeight();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type RotateBoneWeight
        static void _set_RotateBoneWeight(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type Push
        static constexpr const int Push = 8;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type Push
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_Push();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type Push
        static void _set_Push(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PushParent
        static constexpr const int PushParent = 9;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PushParent
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_PushParent();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PushParent
        static void _set_PushParent(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PoserWeight
        static constexpr const int PoserWeight = 10;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PoserWeight
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_PoserWeight();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type PoserWeight
        static void _set_PoserWeight(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // static field const value: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type BendGoalWeight
        static constexpr const int BendGoalWeight = 11;
        // Get static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type BendGoalWeight
        static RootMotion::FinalIK::InteractionObject::WeightCurve::Type _get_BendGoalWeight();
        // Set static field: static public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type BendGoalWeight
        static void _set_BendGoalWeight(RootMotion::FinalIK::InteractionObject::WeightCurve::Type value);
        // Get instance field reference: public System.Int32 value__
        int& dyn_value__();
      }; // RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type
      #pragma pack(pop)
      static check_size<sizeof(InteractionObject::WeightCurve::Type), 0 + sizeof(int)> __RootMotion_FinalIK_InteractionObject_WeightCurve_TypeSizeCheck;
      static_assert(sizeof(InteractionObject::WeightCurve::Type) == 0x4);
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      protected:
      #endif
      // [TooltipAttribute] Offset: 0xEF6540
      // public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type type
      // Size: 0x4
      // Offset: 0x10
      RootMotion::FinalIK::InteractionObject::WeightCurve::Type type;
      // Field size check
      static_assert(sizeof(RootMotion::FinalIK::InteractionObject::WeightCurve::Type) == 0x4);
      // Padding between fields: type and: curve
      char __padding0[0x4] = {};
      // [TooltipAttribute] Offset: 0xEF6578
      // public UnityEngine.AnimationCurve curve
      // Size: 0x8
      // Offset: 0x18
      UnityEngine::AnimationCurve* curve;
      // Field size check
      static_assert(sizeof(UnityEngine::AnimationCurve*) == 0x8);
      public:
      // Get instance field reference: public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type type
      RootMotion::FinalIK::InteractionObject::WeightCurve::Type& dyn_type();
      // Get instance field reference: public UnityEngine.AnimationCurve curve
      UnityEngine::AnimationCurve*& dyn_curve();
      // public System.Single GetValue(System.Single timer)
      // Offset: 0x1FD2810
      float GetValue(float timer);
      // public System.Void .ctor()
      // Offset: 0x1FD33A8
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static InteractionObject::WeightCurve* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::InteractionObject::WeightCurve::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<InteractionObject::WeightCurve*, creationType>()));
      }
    }; // RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve
    #pragma pack(pop)
    static check_size<sizeof(InteractionObject::WeightCurve), 24 + sizeof(UnityEngine::AnimationCurve*)> __RootMotion_FinalIK_InteractionObject_WeightCurveSizeCheck;
    static_assert(sizeof(InteractionObject::WeightCurve) == 0x20);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // [TooltipAttribute] Offset: 0xEF33DC
    // public UnityEngine.Transform otherLookAtTarget
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Transform* otherLookAtTarget;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xEF3414
    // public UnityEngine.Transform otherTargetsRoot
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::Transform* otherTargetsRoot;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xEF344C
    // public UnityEngine.Transform positionOffsetSpace
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::Transform* positionOffsetSpace;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve[] weightCurves
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<RootMotion::FinalIK::InteractionObject::WeightCurve*> weightCurves;
    // Field size check
    static_assert(sizeof(::ArrayW<RootMotion::FinalIK::InteractionObject::WeightCurve*>) == 0x8);
    // public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.Multiplier[] multipliers
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<RootMotion::FinalIK::InteractionObject::Multiplier*> multipliers;
    // Field size check
    static_assert(sizeof(::ArrayW<RootMotion::FinalIK::InteractionObject::Multiplier*>) == 0x8);
    // public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.InteractionEvent[] events
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<RootMotion::FinalIK::InteractionObject::InteractionEvent*> events;
    // Field size check
    static_assert(sizeof(::ArrayW<RootMotion::FinalIK::InteractionObject::InteractionEvent*>) == 0x8);
    // private System.Single <length>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    float length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: length and: lastUsedInteractionSystem
    char __padding6[0x4] = {};
    // private RootMotion.FinalIK.InteractionSystem <lastUsedInteractionSystem>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    RootMotion::FinalIK::InteractionSystem* lastUsedInteractionSystem;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::InteractionSystem*) == 0x8);
    // private RootMotion.FinalIK.InteractionTarget[] targets
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<RootMotion::FinalIK::InteractionTarget*> targets;
    // Field size check
    static_assert(sizeof(::ArrayW<RootMotion::FinalIK::InteractionTarget*>) == 0x8);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.Transform otherLookAtTarget
    UnityEngine::Transform*& dyn_otherLookAtTarget();
    // Get instance field reference: public UnityEngine.Transform otherTargetsRoot
    UnityEngine::Transform*& dyn_otherTargetsRoot();
    // Get instance field reference: public UnityEngine.Transform positionOffsetSpace
    UnityEngine::Transform*& dyn_positionOffsetSpace();
    // Get instance field reference: public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve[] weightCurves
    ::ArrayW<RootMotion::FinalIK::InteractionObject::WeightCurve*>& dyn_weightCurves();
    // Get instance field reference: public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.Multiplier[] multipliers
    ::ArrayW<RootMotion::FinalIK::InteractionObject::Multiplier*>& dyn_multipliers();
    // Get instance field reference: public RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.InteractionEvent[] events
    ::ArrayW<RootMotion::FinalIK::InteractionObject::InteractionEvent*>& dyn_events();
    // Get instance field reference: private System.Single <length>k__BackingField
    float& dyn_$length$k__BackingField();
    // Get instance field reference: private RootMotion.FinalIK.InteractionSystem <lastUsedInteractionSystem>k__BackingField
    RootMotion::FinalIK::InteractionSystem*& dyn_$lastUsedInteractionSystem$k__BackingField();
    // Get instance field reference: private RootMotion.FinalIK.InteractionTarget[] targets
    ::ArrayW<RootMotion::FinalIK::InteractionTarget*>& dyn_targets();
    // public System.Single get_length()
    // Offset: 0x1FD22E0
    float get_length();
    // private System.Void set_length(System.Single value)
    // Offset: 0x1FD22E8
    void set_length(float value);
    // public RootMotion.FinalIK.InteractionSystem get_lastUsedInteractionSystem()
    // Offset: 0x1FD22F0
    RootMotion::FinalIK::InteractionSystem* get_lastUsedInteractionSystem();
    // private System.Void set_lastUsedInteractionSystem(RootMotion.FinalIK.InteractionSystem value)
    // Offset: 0x1FD22F8
    void set_lastUsedInteractionSystem(RootMotion::FinalIK::InteractionSystem* value);
    // public UnityEngine.Transform get_lookAtTarget()
    // Offset: 0x1FD2514
    UnityEngine::Transform* get_lookAtTarget();
    // public UnityEngine.Transform get_targetsRoot()
    // Offset: 0x1FD16B4
    UnityEngine::Transform* get_targetsRoot();
    // private System.Void OpenUserManual()
    // Offset: 0x1FD2080
    void OpenUserManual();
    // private System.Void OpenScriptReference()
    // Offset: 0x1FD20CC
    void OpenScriptReference();
    // private System.Void OpenTutorial1()
    // Offset: 0x1FD2118
    void OpenTutorial1();
    // private System.Void OpenTutorial2()
    // Offset: 0x1FD2164
    void OpenTutorial2();
    // private System.Void OpenTutorial3()
    // Offset: 0x1FD21B0
    void OpenTutorial3();
    // private System.Void OpenTutorial4()
    // Offset: 0x1FD21FC
    void OpenTutorial4();
    // private System.Void SupportGroup()
    // Offset: 0x1FD2248
    void SupportGroup();
    // private System.Void ASThread()
    // Offset: 0x1FD2294
    void ASThread();
    // public System.Void Initiate()
    // Offset: 0x1FD2300
    void Initiate();
    // public RootMotion.FinalIK.InteractionTarget GetTarget(RootMotion.FinalIK.FullBodyBipedEffector effectorType, RootMotion.FinalIK.InteractionSystem interactionSystem)
    // Offset: 0x1FD25A4
    RootMotion::FinalIK::InteractionTarget* GetTarget(RootMotion::FinalIK::FullBodyBipedEffector effectorType, RootMotion::FinalIK::InteractionSystem* interactionSystem);
    // public System.Boolean CurveUsed(RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type type)
    // Offset: 0x1FCFA88
    bool CurveUsed(RootMotion::FinalIK::InteractionObject::WeightCurve::Type type);
    // public RootMotion.FinalIK.InteractionTarget[] GetTargets()
    // Offset: 0x1FD2728
    ::ArrayW<RootMotion::FinalIK::InteractionTarget*> GetTargets();
    // public UnityEngine.Transform GetTarget(RootMotion.FinalIK.FullBodyBipedEffector effectorType, System.String tag)
    // Offset: 0x1FCF93C
    UnityEngine::Transform* GetTarget(RootMotion::FinalIK::FullBodyBipedEffector effectorType, ::Il2CppString* tag);
    // public System.Void OnStartInteraction(RootMotion.FinalIK.InteractionSystem interactionSystem)
    // Offset: 0x1FCFA80
    void OnStartInteraction(RootMotion::FinalIK::InteractionSystem* interactionSystem);
    // public System.Void Apply(RootMotion.FinalIK.IKSolverFullBodyBiped solver, RootMotion.FinalIK.FullBodyBipedEffector effector, RootMotion.FinalIK.InteractionTarget target, System.Single timer, System.Single weight)
    // Offset: 0x1FD0724
    void Apply(RootMotion::FinalIK::IKSolverFullBodyBiped* solver, RootMotion::FinalIK::FullBodyBipedEffector effector, RootMotion::FinalIK::InteractionTarget* target, float timer, float weight);
    // public System.Single GetValue(RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type weightCurveType, RootMotion.FinalIK.InteractionTarget target, System.Single timer)
    // Offset: 0x1FD0F7C
    float GetValue(RootMotion::FinalIK::InteractionObject::WeightCurve::Type weightCurveType, RootMotion::FinalIK::InteractionTarget* target, float timer);
    // private System.Void Start()
    // Offset: 0x1FD2F2C
    void Start();
    // private System.Void Apply(RootMotion.FinalIK.IKSolverFullBodyBiped solver, RootMotion.FinalIK.FullBodyBipedEffector effector, RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type type, System.Single value, System.Single weight)
    // Offset: 0x1FD282C
    void Apply(RootMotion::FinalIK::IKSolverFullBodyBiped* solver, RootMotion::FinalIK::FullBodyBipedEffector effector, RootMotion::FinalIK::InteractionObject::WeightCurve::Type type, float value, float weight);
    // private UnityEngine.Transform GetTarget(RootMotion.FinalIK.FullBodyBipedEffector effectorType)
    // Offset: 0x1FD2730
    UnityEngine::Transform* GetTarget(RootMotion::FinalIK::FullBodyBipedEffector effectorType);
    // private System.Int32 GetWeightCurveIndex(RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type weightCurveType)
    // Offset: 0x1FD2E88
    int GetWeightCurveIndex(RootMotion::FinalIK::InteractionObject::WeightCurve::Type weightCurveType);
    // private System.Int32 GetMultiplierIndex(RootMotion.FinalIK.InteractionObject/RootMotion.FinalIK.WeightCurve/RootMotion.FinalIK.Type weightCurveType)
    // Offset: 0x1FD2F30
    int GetMultiplierIndex(RootMotion::FinalIK::InteractionObject::WeightCurve::Type weightCurveType);
    // public System.Void .ctor()
    // Offset: 0x1FD2F98
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static InteractionObject* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::InteractionObject::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<InteractionObject*, creationType>()));
    }
  }; // RootMotion.FinalIK.InteractionObject
  #pragma pack(pop)
  static check_size<sizeof(InteractionObject), 88 + sizeof(::ArrayW<RootMotion::FinalIK::InteractionTarget*>)> __RootMotion_FinalIK_InteractionObjectSizeCheck;
  static_assert(sizeof(InteractionObject) == 0x60);
}
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::InteractionObject*, "RootMotion.FinalIK", "InteractionObject");
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::InteractionObject::WeightCurve*, "RootMotion.FinalIK", "InteractionObject/WeightCurve");
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::InteractionObject::WeightCurve::Type, "RootMotion.FinalIK", "InteractionObject/WeightCurve/Type");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: RootMotion::FinalIK::InteractionObject::get_length
// Il2CppName: get_length
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (RootMotion::FinalIK::InteractionObject::*)()>(&RootMotion::FinalIK::InteractionObject::get_length)> {
  static const MethodInfo* get() {
