// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.OffsetModifier
#include "RootMotion/FinalIK/OffsetModifier.hpp"
// Including type: RootMotion.FinalIK.FullBodyBipedEffector
#include "RootMotion/FinalIK/FullBodyBipedEffector.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IKEffector
  class IKEffector;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Quaternion
  struct Quaternion;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x34
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.OffsetModifier/RootMotion.FinalIK.OffsetLimits
  // [TokenAttribute] Offset: FFFFFFFF
  class OffsetModifier::OffsetLimits : public ::Il2CppObject {
    public:
    // [TooltipAttribute] Offset: 0xDF844C
    // public RootMotion.FinalIK.FullBodyBipedEffector effector
    // Size: 0x4
    // Offset: 0x10
    RootMotion::FinalIK::FullBodyBipedEffector effector;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::FullBodyBipedEffector) == 0x4);
    // [TooltipAttribute] Offset: 0xDF8484
    // public System.Single spring
    // Size: 0x4
    // Offset: 0x14
    float spring;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF84BC
    // public System.Boolean x
    // Size: 0x1
    // Offset: 0x18
    bool x;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDF84F4
    // public System.Boolean y
    // Size: 0x1
    // Offset: 0x19
    bool y;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xDF852C
    // public System.Boolean z
    // Size: 0x1
    // Offset: 0x1A
    bool z;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: z and: minX
    char __padding4[0x1] = {};
    // [TooltipAttribute] Offset: 0xDF8564
    // public System.Single minX
    // Size: 0x4
    // Offset: 0x1C
    float minX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF859C
    // public System.Single maxX
    // Size: 0x4
    // Offset: 0x20
    float maxX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF85D4
    // public System.Single minY
    // Size: 0x4
    // Offset: 0x24
    float minY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF860C
    // public System.Single maxY
    // Size: 0x4
    // Offset: 0x28
    float maxY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF8644
    // public System.Single minZ
    // Size: 0x4
    // Offset: 0x2C
    float minZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF867C
    // public System.Single maxZ
    // Size: 0x4
    // Offset: 0x30
    float maxZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: OffsetLimits
    OffsetLimits(RootMotion::FinalIK::FullBodyBipedEffector effector_ = {}, float spring_ = {}, bool x_ = {}, bool y_ = {}, bool z_ = {}, float minX_ = {}, float maxX_ = {}, float minY_ = {}, float maxY_ = {}, float minZ_ = {}, float maxZ_ = {}) noexcept : effector{effector_}, spring{spring_}, x{x_}, y{y_}, z{z_}, minX{minX_}, maxX{maxX_}, minY{minY_}, maxY{maxY_}, minZ{minZ_}, maxZ{maxZ_} {}
    // Get instance field: public RootMotion.FinalIK.FullBodyBipedEffector effector
    RootMotion::FinalIK::FullBodyBipedEffector _get_effector();
    // Set instance field: public RootMotion.FinalIK.FullBodyBipedEffector effector
    void _set_effector(RootMotion::FinalIK::FullBodyBipedEffector value);
    // Get instance field: public System.Single spring
    float _get_spring();
    // Set instance field: public System.Single spring
    void _set_spring(float value);
    // Get instance field: public System.Boolean x
    bool _get_x();
    // Set instance field: public System.Boolean x
    void _set_x(bool value);
    // Get instance field: public System.Boolean y
    bool _get_y();
    // Set instance field: public System.Boolean y
    void _set_y(bool value);
    // Get instance field: public System.Boolean z
    bool _get_z();
    // Set instance field: public System.Boolean z
    void _set_z(bool value);
    // Get instance field: public System.Single minX
    float _get_minX();
    // Set instance field: public System.Single minX
    void _set_minX(float value);
    // Get instance field: public System.Single maxX
    float _get_maxX();
    // Set instance field: public System.Single maxX
    void _set_maxX(float value);
    // Get instance field: public System.Single minY
    float _get_minY();
    // Set instance field: public System.Single minY
    void _set_minY(float value);
    // Get instance field: public System.Single maxY
    float _get_maxY();
    // Set instance field: public System.Single maxY
    void _set_maxY(float value);
    // Get instance field: public System.Single minZ
    float _get_minZ();
    // Set instance field: public System.Single minZ
    void _set_minZ(float value);
    // Get instance field: public System.Single maxZ
    float _get_maxZ();
    // Set instance field: public System.Single maxZ
    void _set_maxZ(float value);
    // public System.Void Apply(RootMotion.FinalIK.IKEffector e, UnityEngine.Quaternion rootRotation)
    // Offset: 0x1AB6084
    void Apply(RootMotion::FinalIK::IKEffector* e, UnityEngine::Quaternion rootRotation);
    // private System.Single SpringAxis(System.Single value, System.Single min, System.Single max)
    // Offset: 0x1AB659C
    float SpringAxis(float value, float min, float max);
    // private System.Single Spring(System.Single value, System.Single limit, System.Boolean negative)
    // Offset: 0x1AB65CC
    float Spring(float value, float limit, bool negative);
    // public System.Void .ctor()
    // Offset: 0x1AB66A4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OffsetModifier::OffsetLimits* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::OffsetModifier::OffsetLimits::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OffsetModifier::OffsetLimits*, creationType>()));
    }
  }; // RootMotion.FinalIK.OffsetModifier/RootMotion.FinalIK.OffsetLimits
  #pragma pack(pop)
  static check_size<sizeof(OffsetModifier::OffsetLimits), 48 + sizeof(float)> __RootMotion_FinalIK_OffsetModifier_OffsetLimitsSizeCheck;
  static_assert(sizeof(OffsetModifier::OffsetLimits) == 0x34);
}
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::OffsetModifier::OffsetLimits*, "RootMotion.FinalIK", "OffsetModifier/OffsetLimits");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: RootMotion::FinalIK::OffsetModifier::OffsetLimits::Apply
// Il2CppName: Apply
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::OffsetModifier::OffsetLimits::*)(RootMotion::FinalIK::IKEffector*, UnityEngine::Quaternion)>(&RootMotion::FinalIK::OffsetModifier::OffsetLimits::Apply)> {
  static const MethodInfo* get() {
    static auto* e = &::il2cpp_utils::GetClassFromName("RootMotion.FinalIK", "IKEffector")->byval_arg;
    static auto* rootRotation = &::il2cpp_utils::GetClassFromName("UnityEngine", "Quaternion")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::OffsetModifier::OffsetLimits*), "Apply", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{e, rootRotation});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::OffsetModifier::OffsetLimits::SpringAxis
// Il2CppName: SpringAxis
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (RootMotion::FinalIK::OffsetModifier::OffsetLimits::*)(float, float, float)>(&RootMotion::FinalIK::OffsetModifier::OffsetLimits::SpringAxis)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* min = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* max = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::OffsetModifier::OffsetLimits*), "SpringAxis", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value, min, max});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::OffsetModifier::OffsetLimits::Spring
// Il2CppName: Spring
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (RootMotion::FinalIK::OffsetModifier::OffsetLimits::*)(float, float, bool)>(&RootMotion::FinalIK::OffsetModifier::OffsetLimits::Spring)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* limit = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* negative = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::OffsetModifier::OffsetLimits*), "Spring", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value, limit, negative});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::OffsetModifier::OffsetLimits::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
