// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.RagdollUtility
#include "RootMotion/FinalIK/RagdollUtility.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Joint
  class Joint;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Autogenerated type: RootMotion.FinalIK.RagdollUtility/Rigidbone
  class RagdollUtility::Rigidbone : public ::Il2CppObject {
    public:
    // public UnityEngine.Rigidbody r
    // Offset: 0x10
    UnityEngine::Rigidbody* r;
    // public UnityEngine.Transform t
    // Offset: 0x18
    UnityEngine::Transform* t;
    // public UnityEngine.Collider collider
    // Offset: 0x20
    UnityEngine::Collider* collider;
    // public UnityEngine.Joint joint
    // Offset: 0x28
    UnityEngine::Joint* joint;
    // public UnityEngine.Rigidbody c
    // Offset: 0x30
    UnityEngine::Rigidbody* c;
    // public System.Boolean updateAnchor
    // Offset: 0x38
    bool updateAnchor;
    // public UnityEngine.Vector3 deltaPosition
    // Offset: 0x3C
    UnityEngine::Vector3 deltaPosition;
    // public UnityEngine.Quaternion deltaRotation
    // Offset: 0x48
    UnityEngine::Quaternion deltaRotation;
    // public System.Single deltaTime
    // Offset: 0x58
    float deltaTime;
    // public UnityEngine.Vector3 lastPosition
    // Offset: 0x5C
    UnityEngine::Vector3 lastPosition;
    // public UnityEngine.Quaternion lastRotation
    // Offset: 0x68
    UnityEngine::Quaternion lastRotation;
    // public System.Void .ctor(UnityEngine.Rigidbody r)
    // Offset: 0x1235030
    static RagdollUtility::Rigidbone* New_ctor(UnityEngine::Rigidbody* r);
    // public System.Void RecordVelocity()
    // Offset: 0x1235CA8
    void RecordVelocity();
    // public System.Void WakeUp(System.Single velocityWeight, System.Single angularVelocityWeight)
    // Offset: 0x1235A8C
    void WakeUp(float velocityWeight, float angularVelocityWeight);
  }; // RootMotion.FinalIK.RagdollUtility/Rigidbone
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::RagdollUtility::Rigidbone*, "RootMotion.FinalIK", "RagdollUtility/Rigidbone");
#pragma pack(pop)
