// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: RootMotion.FinalIK.RagdollUtility
#include "RootMotion/FinalIK/RagdollUtility.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Joint
  class Joint;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.RagdollUtility/RootMotion.FinalIK.Rigidbone
  // [TokenAttribute] Offset: FFFFFFFF
  class RagdollUtility::Rigidbone : public ::Il2CppObject {
    public:
    // public UnityEngine.Rigidbody r
    // Size: 0x8
    // Offset: 0x10
    UnityEngine::Rigidbody* r;
    // Field size check
    static_assert(sizeof(UnityEngine::Rigidbody*) == 0x8);
    // public UnityEngine.Transform t
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Transform* t;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Collider collider
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::Collider* collider;
    // Field size check
    static_assert(sizeof(UnityEngine::Collider*) == 0x8);
    // public UnityEngine.Joint joint
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::Joint* joint;
    // Field size check
    static_assert(sizeof(UnityEngine::Joint*) == 0x8);
    // public UnityEngine.Rigidbody c
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::Rigidbody* c;
    // Field size check
    static_assert(sizeof(UnityEngine::Rigidbody*) == 0x8);
    // public System.Boolean updateAnchor
    // Size: 0x1
    // Offset: 0x38
    bool updateAnchor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: updateAnchor and: deltaPosition
    char __padding5[0x3] = {};
    // public UnityEngine.Vector3 deltaPosition
    // Size: 0xC
    // Offset: 0x3C
    UnityEngine::Vector3 deltaPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion deltaRotation
    // Size: 0x10
    // Offset: 0x48
    UnityEngine::Quaternion deltaRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // public System.Single deltaTime
    // Size: 0x4
    // Offset: 0x58
    float deltaTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 lastPosition
    // Size: 0xC
    // Offset: 0x5C
    UnityEngine::Vector3 lastPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion lastRotation
    // Size: 0x10
    // Offset: 0x68
    UnityEngine::Quaternion lastRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // Creating value type constructor for type: Rigidbone
    Rigidbone(UnityEngine::Rigidbody* r_ = {}, UnityEngine::Transform* t_ = {}, UnityEngine::Collider* collider_ = {}, UnityEngine::Joint* joint_ = {}, UnityEngine::Rigidbody* c_ = {}, bool updateAnchor_ = {}, UnityEngine::Vector3 deltaPosition_ = {}, UnityEngine::Quaternion deltaRotation_ = {}, float deltaTime_ = {}, UnityEngine::Vector3 lastPosition_ = {}, UnityEngine::Quaternion lastRotation_ = {}) noexcept : r{r_}, t{t_}, collider{collider_}, joint{joint_}, c{c_}, updateAnchor{updateAnchor_}, deltaPosition{deltaPosition_}, deltaRotation{deltaRotation_}, deltaTime{deltaTime_}, lastPosition{lastPosition_}, lastRotation{lastRotation_} {}
    // Get instance field: public UnityEngine.Rigidbody r
    UnityEngine::Rigidbody* _get_r();
    // Set instance field: public UnityEngine.Rigidbody r
    void _set_r(UnityEngine::Rigidbody* value);
    // Get instance field: public UnityEngine.Transform t
    UnityEngine::Transform* _get_t();
    // Set instance field: public UnityEngine.Transform t
    void _set_t(UnityEngine::Transform* value);
    // Get instance field: public UnityEngine.Collider collider
    UnityEngine::Collider* _get_collider();
    // Set instance field: public UnityEngine.Collider collider
    void _set_collider(UnityEngine::Collider* value);
    // Get instance field: public UnityEngine.Joint joint
    UnityEngine::Joint* _get_joint();
    // Set instance field: public UnityEngine.Joint joint
    void _set_joint(UnityEngine::Joint* value);
    // Get instance field: public UnityEngine.Rigidbody c
    UnityEngine::Rigidbody* _get_c();
    // Set instance field: public UnityEngine.Rigidbody c
    void _set_c(UnityEngine::Rigidbody* value);
    // Get instance field: public System.Boolean updateAnchor
    bool _get_updateAnchor();
    // Set instance field: public System.Boolean updateAnchor
    void _set_updateAnchor(bool value);
    // Get instance field: public UnityEngine.Vector3 deltaPosition
    UnityEngine::Vector3 _get_deltaPosition();
    // Set instance field: public UnityEngine.Vector3 deltaPosition
    void _set_deltaPosition(UnityEngine::Vector3 value);
    // Get instance field: public UnityEngine.Quaternion deltaRotation
    UnityEngine::Quaternion _get_deltaRotation();
    // Set instance field: public UnityEngine.Quaternion deltaRotation
    void _set_deltaRotation(UnityEngine::Quaternion value);
    // Get instance field: public System.Single deltaTime
    float _get_deltaTime();
    // Set instance field: public System.Single deltaTime
    void _set_deltaTime(float value);
    // Get instance field: public UnityEngine.Vector3 lastPosition
    UnityEngine::Vector3 _get_lastPosition();
    // Set instance field: public UnityEngine.Vector3 lastPosition
    void _set_lastPosition(UnityEngine::Vector3 value);
    // Get instance field: public UnityEngine.Quaternion lastRotation
    UnityEngine::Quaternion _get_lastRotation();
    // Set instance field: public UnityEngine.Quaternion lastRotation
    void _set_lastRotation(UnityEngine::Quaternion value);
    // public System.Void .ctor(UnityEngine.Rigidbody r)
    // Offset: 0x1AB7D84
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RagdollUtility::Rigidbone* New_ctor(UnityEngine::Rigidbody* r) {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::RagdollUtility::Rigidbone::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RagdollUtility::Rigidbone*, creationType>(r)));
    }
    // public System.Void RecordVelocity()
    // Offset: 0x1AB8990
    void RecordVelocity();
    // public System.Void WakeUp(System.Single velocityWeight, System.Single angularVelocityWeight)
    // Offset: 0x1AB8774
    void WakeUp(float velocityWeight, float angularVelocityWeight);
  }; // RootMotion.FinalIK.RagdollUtility/RootMotion.FinalIK.Rigidbone
  #pragma pack(pop)
  static check_size<sizeof(RagdollUtility::Rigidbone), 104 + sizeof(UnityEngine::Quaternion)> __RootMotion_FinalIK_RagdollUtility_RigidboneSizeCheck;
  static_assert(sizeof(RagdollUtility::Rigidbone) == 0x78);
}
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::RagdollUtility::Rigidbone*, "RootMotion.FinalIK", "RagdollUtility/Rigidbone");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::Rigidbone::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::Rigidbone::RecordVelocity
// Il2CppName: RecordVelocity
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::Rigidbone::*)()>(&RootMotion::FinalIK::RagdollUtility::Rigidbone::RecordVelocity)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility::Rigidbone*), "RecordVelocity", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::Rigidbone::WakeUp
// Il2CppName: WakeUp
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::Rigidbone::*)(float, float)>(&RootMotion::FinalIK::RagdollUtility::Rigidbone::WakeUp)> {
  static const MethodInfo* get() {
    static auto* velocityWeight = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* angularVelocityWeight = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility::Rigidbone*), "WakeUp", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{velocityWeight, angularVelocityWeight});
  }
};
