// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.AnimatorUpdateMode
#include "UnityEngine/AnimatorUpdateMode.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: IK
  class IK;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Animator
  class Animator;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.RagdollUtility
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: DF0FE0
  class RagdollUtility : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: RootMotion::FinalIK::RagdollUtility::Rigidbone
    class Rigidbone;
    // Nested type: RootMotion::FinalIK::RagdollUtility::Child
    class Child;
    // Nested type: RootMotion::FinalIK::RagdollUtility::$DisableRagdollSmooth$d__21
    class $DisableRagdollSmooth$d__21;
    // [TooltipAttribute] Offset: 0xDF4C44
    // public RootMotion.FinalIK.IK ik
    // Size: 0x8
    // Offset: 0x18
    RootMotion::FinalIK::IK* ik;
    // Field size check
    static_assert(sizeof(RootMotion::FinalIK::IK*) == 0x8);
    // [TooltipAttribute] Offset: 0xDF4C7C
    // public System.Single ragdollToAnimationTime
    // Size: 0x4
    // Offset: 0x20
    float ragdollToAnimationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF4CB4
    // public System.Boolean applyIkOnRagdoll
    // Size: 0x1
    // Offset: 0x24
    bool applyIkOnRagdoll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: applyIkOnRagdoll and: applyVelocity
    char __padding2[0x3] = {};
    // [TooltipAttribute] Offset: 0xDF4CEC
    // public System.Single applyVelocity
    // Size: 0x4
    // Offset: 0x28
    float applyVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xDF4D24
    // public System.Single applyAngularVelocity
    // Size: 0x4
    // Offset: 0x2C
    float applyAngularVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Animator animator
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::Animator* animator;
    // Field size check
    static_assert(sizeof(UnityEngine::Animator*) == 0x8);
    // private RootMotion.FinalIK.RagdollUtility/RootMotion.FinalIK.Rigidbone[] rigidbones
    // Size: 0x8
    // Offset: 0x38
    ::Array<RootMotion::FinalIK::RagdollUtility::Rigidbone*>* rigidbones;
    // Field size check
    static_assert(sizeof(::Array<RootMotion::FinalIK::RagdollUtility::Rigidbone*>*) == 0x8);
    // private RootMotion.FinalIK.RagdollUtility/RootMotion.FinalIK.Child[] children
    // Size: 0x8
    // Offset: 0x40
    ::Array<RootMotion::FinalIK::RagdollUtility::Child*>* children;
    // Field size check
    static_assert(sizeof(::Array<RootMotion::FinalIK::RagdollUtility::Child*>*) == 0x8);
    // private System.Boolean enableRagdollFlag
    // Size: 0x1
    // Offset: 0x48
    bool enableRagdollFlag;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableRagdollFlag and: animatorUpdateMode
    char __padding8[0x3] = {};
    // private UnityEngine.AnimatorUpdateMode animatorUpdateMode
    // Size: 0x4
    // Offset: 0x4C
    UnityEngine::AnimatorUpdateMode animatorUpdateMode;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimatorUpdateMode) == 0x4);
    // private RootMotion.FinalIK.IK[] allIKComponents
    // Size: 0x8
    // Offset: 0x50
    ::Array<RootMotion::FinalIK::IK*>* allIKComponents;
    // Field size check
    static_assert(sizeof(::Array<RootMotion::FinalIK::IK*>*) == 0x8);
    // private System.Boolean[] fixTransforms
    // Size: 0x8
    // Offset: 0x58
    ::Array<bool>* fixTransforms;
    // Field size check
    static_assert(sizeof(::Array<bool>*) == 0x8);
    // private System.Single ragdollWeight
    // Size: 0x4
    // Offset: 0x60
    float ragdollWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ragdollWeightV
    // Size: 0x4
    // Offset: 0x64
    float ragdollWeightV;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean fixedFrame
    // Size: 0x1
    // Offset: 0x68
    bool fixedFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fixedFrame and: disabledIKComponents
    char __padding14[0x7] = {};
    // private System.Boolean[] disabledIKComponents
    // Size: 0x8
    // Offset: 0x70
    ::Array<bool>* disabledIKComponents;
    // Field size check
    static_assert(sizeof(::Array<bool>*) == 0x8);
    // Creating value type constructor for type: RagdollUtility
    RagdollUtility(RootMotion::FinalIK::IK* ik_ = {}, float ragdollToAnimationTime_ = {}, bool applyIkOnRagdoll_ = {}, float applyVelocity_ = {}, float applyAngularVelocity_ = {}, UnityEngine::Animator* animator_ = {}, ::Array<RootMotion::FinalIK::RagdollUtility::Rigidbone*>* rigidbones_ = {}, ::Array<RootMotion::FinalIK::RagdollUtility::Child*>* children_ = {}, bool enableRagdollFlag_ = {}, UnityEngine::AnimatorUpdateMode animatorUpdateMode_ = {}, ::Array<RootMotion::FinalIK::IK*>* allIKComponents_ = {}, ::Array<bool>* fixTransforms_ = {}, float ragdollWeight_ = {}, float ragdollWeightV_ = {}, bool fixedFrame_ = {}, ::Array<bool>* disabledIKComponents_ = {}) noexcept : ik{ik_}, ragdollToAnimationTime{ragdollToAnimationTime_}, applyIkOnRagdoll{applyIkOnRagdoll_}, applyVelocity{applyVelocity_}, applyAngularVelocity{applyAngularVelocity_}, animator{animator_}, rigidbones{rigidbones_}, children{children_}, enableRagdollFlag{enableRagdollFlag_}, animatorUpdateMode{animatorUpdateMode_}, allIKComponents{allIKComponents_}, fixTransforms{fixTransforms_}, ragdollWeight{ragdollWeight_}, ragdollWeightV{ragdollWeightV_}, fixedFrame{fixedFrame_}, disabledIKComponents{disabledIKComponents_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field: public RootMotion.FinalIK.IK ik
    RootMotion::FinalIK::IK* _get_ik();
    // Set instance field: public RootMotion.FinalIK.IK ik
    void _set_ik(RootMotion::FinalIK::IK* value);
    // Get instance field: public System.Single ragdollToAnimationTime
    float _get_ragdollToAnimationTime();
    // Set instance field: public System.Single ragdollToAnimationTime
    void _set_ragdollToAnimationTime(float value);
    // Get instance field: public System.Boolean applyIkOnRagdoll
    bool _get_applyIkOnRagdoll();
    // Set instance field: public System.Boolean applyIkOnRagdoll
    void _set_applyIkOnRagdoll(bool value);
    // Get instance field: public System.Single applyVelocity
    float _get_applyVelocity();
    // Set instance field: public System.Single applyVelocity
    void _set_applyVelocity(float value);
    // Get instance field: public System.Single applyAngularVelocity
    float _get_applyAngularVelocity();
    // Set instance field: public System.Single applyAngularVelocity
    void _set_applyAngularVelocity(float value);
    // Get instance field: private UnityEngine.Animator animator
    UnityEngine::Animator* _get_animator();
    // Set instance field: private UnityEngine.Animator animator
    void _set_animator(UnityEngine::Animator* value);
    // Get instance field: private RootMotion.FinalIK.RagdollUtility/RootMotion.FinalIK.Rigidbone[] rigidbones
    ::Array<RootMotion::FinalIK::RagdollUtility::Rigidbone*>* _get_rigidbones();
    // Set instance field: private RootMotion.FinalIK.RagdollUtility/RootMotion.FinalIK.Rigidbone[] rigidbones
    void _set_rigidbones(::Array<RootMotion::FinalIK::RagdollUtility::Rigidbone*>* value);
    // Get instance field: private RootMotion.FinalIK.RagdollUtility/RootMotion.FinalIK.Child[] children
    ::Array<RootMotion::FinalIK::RagdollUtility::Child*>* _get_children();
    // Set instance field: private RootMotion.FinalIK.RagdollUtility/RootMotion.FinalIK.Child[] children
    void _set_children(::Array<RootMotion::FinalIK::RagdollUtility::Child*>* value);
    // Get instance field: private System.Boolean enableRagdollFlag
    bool _get_enableRagdollFlag();
    // Set instance field: private System.Boolean enableRagdollFlag
    void _set_enableRagdollFlag(bool value);
    // Get instance field: private UnityEngine.AnimatorUpdateMode animatorUpdateMode
    UnityEngine::AnimatorUpdateMode _get_animatorUpdateMode();
    // Set instance field: private UnityEngine.AnimatorUpdateMode animatorUpdateMode
    void _set_animatorUpdateMode(UnityEngine::AnimatorUpdateMode value);
    // Get instance field: private RootMotion.FinalIK.IK[] allIKComponents
    ::Array<RootMotion::FinalIK::IK*>* _get_allIKComponents();
    // Set instance field: private RootMotion.FinalIK.IK[] allIKComponents
    void _set_allIKComponents(::Array<RootMotion::FinalIK::IK*>* value);
    // Get instance field: private System.Boolean[] fixTransforms
    ::Array<bool>* _get_fixTransforms();
    // Set instance field: private System.Boolean[] fixTransforms
    void _set_fixTransforms(::Array<bool>* value);
    // Get instance field: private System.Single ragdollWeight
    float _get_ragdollWeight();
    // Set instance field: private System.Single ragdollWeight
    void _set_ragdollWeight(float value);
    // Get instance field: private System.Single ragdollWeightV
    float _get_ragdollWeightV();
    // Set instance field: private System.Single ragdollWeightV
    void _set_ragdollWeightV(float value);
    // Get instance field: private System.Boolean fixedFrame
    bool _get_fixedFrame();
    // Set instance field: private System.Boolean fixedFrame
    void _set_fixedFrame(bool value);
    // Get instance field: private System.Boolean[] disabledIKComponents
    ::Array<bool>* _get_disabledIKComponents();
    // Set instance field: private System.Boolean[] disabledIKComponents
    void _set_disabledIKComponents(::Array<bool>* value);
    // private System.Boolean get_isRagdoll()
    // Offset: 0x1AB7848
    bool get_isRagdoll();
    // private System.Boolean get_ikUsed()
    // Offset: 0x1AB832C
    bool get_ikUsed();
    // public System.Void EnableRagdoll()
    // Offset: 0x1AB7810
    void EnableRagdoll();
    // public System.Void DisableRagdoll()
    // Offset: 0x1AB78C0
    void DisableRagdoll();
    // public System.Void Start()
    // Offset: 0x1AB79F0
    void Start();
    // private System.Collections.IEnumerator DisableRagdollSmooth()
    // Offset: 0x1AB7980
    System::Collections::IEnumerator* DisableRagdollSmooth();
    // private System.Void Update()
    // Offset: 0x1AB7F6C
    void Update();
    // private System.Void FixedUpdate()
    // Offset: 0x1AB81B8
    void FixedUpdate();
    // private System.Void LateUpdate()
    // Offset: 0x1AB8270
    void LateUpdate();
    // private System.Void AfterLastIK()
    // Offset: 0x1AB84B0
    void AfterLastIK();
    // private System.Void AfterAnimation()
    // Offset: 0x1AB82F0
    void AfterAnimation();
    // private System.Void OnFinalPose()
    // Offset: 0x1AB846C
    void OnFinalPose();
    // private System.Void RagdollEnabler()
    // Offset: 0x1AB854C
    void RagdollEnabler();
    // private System.Void RecordVelocities()
    // Offset: 0x1AB84E4
    void RecordVelocities();
    // private System.Void StoreLocalState()
    // Offset: 0x1AB7918
    void StoreLocalState();
    // private System.Void FixTransforms(System.Single weight)
    // Offset: 0x1AB81F8
    void FixTransforms(float weight);
    // private System.Void OnDestroy()
    // Offset: 0x1AB8CF0
    void OnDestroy();
    // public System.Void .ctor()
    // Offset: 0x1AB8DF4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RagdollUtility* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::RagdollUtility::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RagdollUtility*, creationType>()));
    }
  }; // RootMotion.FinalIK.RagdollUtility
  #pragma pack(pop)
  static check_size<sizeof(RagdollUtility), 112 + sizeof(::Array<bool>*)> __RootMotion_FinalIK_RagdollUtilitySizeCheck;
  static_assert(sizeof(RagdollUtility) == 0x78);
}
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::RagdollUtility*, "RootMotion.FinalIK", "RagdollUtility");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::get_isRagdoll
// Il2CppName: get_isRagdoll
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::get_isRagdoll)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "get_isRagdoll", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::get_ikUsed
// Il2CppName: get_ikUsed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::get_ikUsed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "get_ikUsed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::EnableRagdoll
// Il2CppName: EnableRagdoll
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::EnableRagdoll)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "EnableRagdoll", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::DisableRagdoll
// Il2CppName: DisableRagdoll
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::DisableRagdoll)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "DisableRagdoll", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::DisableRagdollSmooth
// Il2CppName: DisableRagdollSmooth
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::Collections::IEnumerator* (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::DisableRagdollSmooth)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "DisableRagdollSmooth", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::FixedUpdate
// Il2CppName: FixedUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::FixedUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "FixedUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::LateUpdate
// Il2CppName: LateUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::LateUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "LateUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::AfterLastIK
// Il2CppName: AfterLastIK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::AfterLastIK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "AfterLastIK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::AfterAnimation
// Il2CppName: AfterAnimation
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::AfterAnimation)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "AfterAnimation", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::OnFinalPose
// Il2CppName: OnFinalPose
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::OnFinalPose)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "OnFinalPose", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::RagdollEnabler
// Il2CppName: RagdollEnabler
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::RagdollEnabler)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "RagdollEnabler", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::RecordVelocities
// Il2CppName: RecordVelocities
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::RecordVelocities)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "RecordVelocities", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::StoreLocalState
// Il2CppName: StoreLocalState
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::StoreLocalState)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "StoreLocalState", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::FixTransforms
// Il2CppName: FixTransforms
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)(float)>(&RootMotion::FinalIK::RagdollUtility::FixTransforms)> {
  static const MethodInfo* get() {
    static auto* weight = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "FixTransforms", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{weight});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::RagdollUtility::*)()>(&RootMotion::FinalIK::RagdollUtility::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::RagdollUtility*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::RagdollUtility::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
