// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: RootMotion.FinalIK.VRIKCalibrator
#include "RootMotion/FinalIK/VRIKCalibrator.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.VRIKCalibrator/RootMotion.FinalIK.Settings
  // [TokenAttribute] Offset: FFFFFFFF
  class VRIKCalibrator::Settings : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // [TooltipAttribute] Offset: 0xEF76D0
    // public System.Single scaleMlp
    // Size: 0x4
    // Offset: 0x10
    float scaleMlp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEF7708
    // public UnityEngine.Vector3 headTrackerForward
    // Size: 0xC
    // Offset: 0x14
    UnityEngine::Vector3 headTrackerForward;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xEF7740
    // public UnityEngine.Vector3 headTrackerUp
    // Size: 0xC
    // Offset: 0x20
    UnityEngine::Vector3 headTrackerUp;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xEF7778
    // public UnityEngine.Vector3 bodyTrackerForward
    // Size: 0xC
    // Offset: 0x2C
    UnityEngine::Vector3 bodyTrackerForward;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xEF77B0
    // public UnityEngine.Vector3 bodyTrackerUp
    // Size: 0xC
    // Offset: 0x38
    UnityEngine::Vector3 bodyTrackerUp;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xEF77E8
    // public UnityEngine.Vector3 handTrackerForward
    // Size: 0xC
    // Offset: 0x44
    UnityEngine::Vector3 handTrackerForward;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xEF7820
    // public UnityEngine.Vector3 handTrackerUp
    // Size: 0xC
    // Offset: 0x50
    UnityEngine::Vector3 handTrackerUp;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xEF7858
    // public UnityEngine.Vector3 footTrackerForward
    // Size: 0xC
    // Offset: 0x5C
    UnityEngine::Vector3 footTrackerForward;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xEF7890
    // public UnityEngine.Vector3 footTrackerUp
    // Size: 0xC
    // Offset: 0x68
    UnityEngine::Vector3 footTrackerUp;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [SpaceAttribute] Offset: 0xEF78C8
    // [TooltipAttribute] Offset: 0xEF78C8
    // public UnityEngine.Vector3 headOffset
    // Size: 0xC
    // Offset: 0x74
    UnityEngine::Vector3 headOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xEF7918
    // public UnityEngine.Vector3 handOffset
    // Size: 0xC
    // Offset: 0x80
    UnityEngine::Vector3 handOffset;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xEF7950
    // public System.Single footForwardOffset
    // Size: 0x4
    // Offset: 0x8C
    float footForwardOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEF7988
    // public System.Single footInwardOffset
    // Size: 0x4
    // Offset: 0x90
    float footInwardOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xEF79C0
    // [RangeAttribute] Offset: 0xEF79C0
    // public System.Single footHeadingOffset
    // Size: 0x4
    // Offset: 0x94
    float footHeadingOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xEF7A1C
    // public System.Single pelvisPositionWeight
    // Size: 0x4
    // Offset: 0x98
    float pelvisPositionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xEF7A34
    // public System.Single pelvisRotationWeight
    // Size: 0x4
    // Offset: 0x9C
    float pelvisRotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public System.Single scaleMlp
    float& dyn_scaleMlp();
    // Get instance field reference: public UnityEngine.Vector3 headTrackerForward
    UnityEngine::Vector3& dyn_headTrackerForward();
    // Get instance field reference: public UnityEngine.Vector3 headTrackerUp
    UnityEngine::Vector3& dyn_headTrackerUp();
    // Get instance field reference: public UnityEngine.Vector3 bodyTrackerForward
    UnityEngine::Vector3& dyn_bodyTrackerForward();
    // Get instance field reference: public UnityEngine.Vector3 bodyTrackerUp
    UnityEngine::Vector3& dyn_bodyTrackerUp();
    // Get instance field reference: public UnityEngine.Vector3 handTrackerForward
    UnityEngine::Vector3& dyn_handTrackerForward();
    // Get instance field reference: public UnityEngine.Vector3 handTrackerUp
    UnityEngine::Vector3& dyn_handTrackerUp();
    // Get instance field reference: public UnityEngine.Vector3 footTrackerForward
    UnityEngine::Vector3& dyn_footTrackerForward();
    // Get instance field reference: public UnityEngine.Vector3 footTrackerUp
    UnityEngine::Vector3& dyn_footTrackerUp();
    // Get instance field reference: public UnityEngine.Vector3 headOffset
    UnityEngine::Vector3& dyn_headOffset();
    // Get instance field reference: public UnityEngine.Vector3 handOffset
    UnityEngine::Vector3& dyn_handOffset();
    // Get instance field reference: public System.Single footForwardOffset
    float& dyn_footForwardOffset();
    // Get instance field reference: public System.Single footInwardOffset
    float& dyn_footInwardOffset();
    // Get instance field reference: public System.Single footHeadingOffset
    float& dyn_footHeadingOffset();
    // Get instance field reference: public System.Single pelvisPositionWeight
    float& dyn_pelvisPositionWeight();
    // Get instance field reference: public System.Single pelvisRotationWeight
    float& dyn_pelvisRotationWeight();
    // public System.Void .ctor()
    // Offset: 0x1C4E138
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static VRIKCalibrator::Settings* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("RootMotion::FinalIK::VRIKCalibrator::Settings::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<VRIKCalibrator::Settings*, creationType>()));
    }
  }; // RootMotion.FinalIK.VRIKCalibrator/RootMotion.FinalIK.Settings
  #pragma pack(pop)
  static check_size<sizeof(VRIKCalibrator::Settings), 156 + sizeof(float)> __RootMotion_FinalIK_VRIKCalibrator_SettingsSizeCheck;
  static_assert(sizeof(VRIKCalibrator::Settings) == 0xA0);
}
DEFINE_IL2CPP_ARG_TYPE(RootMotion::FinalIK::VRIKCalibrator::Settings*, "RootMotion.FinalIK", "VRIKCalibrator/Settings");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: RootMotion::FinalIK::VRIKCalibrator::Settings::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
