// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: RootMotion.FinalIK.VRIKCalibrator
#include "RootMotion/FinalIK/VRIKCalibrator.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::RootMotion::FinalIK::VRIKCalibrator::Settings);
DEFINE_IL2CPP_ARG_TYPE(::RootMotion::FinalIK::VRIKCalibrator::Settings*, "RootMotion.FinalIK", "VRIKCalibrator/Settings");
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.VRIKCalibrator/RootMotion.FinalIK.Settings
  // [TokenAttribute] Offset: FFFFFFFF
  class VRIKCalibrator::Settings : public ::Il2CppObject {
    public:
    public:
    // [TooltipAttribute] Offset: 0x10FDB30
    // public System.Single scaleMlp
    // Size: 0x4
    // Offset: 0x10
    float scaleMlp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x10FDB68
    // public UnityEngine.Vector3 headTrackerForward
    // Size: 0xC
    // Offset: 0x14
    ::UnityEngine::Vector3 headTrackerForward;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x10FDBA0
    // public UnityEngine.Vector3 headTrackerUp
    // Size: 0xC
    // Offset: 0x20
    ::UnityEngine::Vector3 headTrackerUp;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x10FDBD8
    // public UnityEngine.Vector3 bodyTrackerForward
    // Size: 0xC
    // Offset: 0x2C
    ::UnityEngine::Vector3 bodyTrackerForward;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x10FDC10
    // public UnityEngine.Vector3 bodyTrackerUp
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 bodyTrackerUp;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x10FDC48
    // public UnityEngine.Vector3 handTrackerForward
    // Size: 0xC
    // Offset: 0x44
    ::UnityEngine::Vector3 handTrackerForward;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x10FDC80
    // public UnityEngine.Vector3 handTrackerUp
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 handTrackerUp;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x10FDCB8
    // public UnityEngine.Vector3 footTrackerForward
    // Size: 0xC
    // Offset: 0x5C
    ::UnityEngine::Vector3 footTrackerForward;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x10FDCF0
    // public UnityEngine.Vector3 footTrackerUp
    // Size: 0xC
    // Offset: 0x68
    ::UnityEngine::Vector3 footTrackerUp;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [SpaceAttribute] Offset: 0x10FDD28
    // [TooltipAttribute] Offset: 0x10FDD28
    // public UnityEngine.Vector3 headOffset
    // Size: 0xC
    // Offset: 0x74
    ::UnityEngine::Vector3 headOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x10FDD78
    // public UnityEngine.Vector3 handOffset
    // Size: 0xC
    // Offset: 0x80
    ::UnityEngine::Vector3 handOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x10FDDB0
    // public System.Single footForwardOffset
    // Size: 0x4
    // Offset: 0x8C
    float footForwardOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x10FDDE8
    // public System.Single footInwardOffset
    // Size: 0x4
    // Offset: 0x90
    float footInwardOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x10FDE20
    // [RangeAttribute] Offset: 0x10FDE20
    // public System.Single footHeadingOffset
    // Size: 0x4
    // Offset: 0x94
    float footHeadingOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x10FDE7C
    // public System.Single pelvisPositionWeight
    // Size: 0x4
    // Offset: 0x98
    float pelvisPositionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x10FDE94
    // public System.Single pelvisRotationWeight
    // Size: 0x4
    // Offset: 0x9C
    float pelvisRotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public System.Single scaleMlp
    [[deprecated("Use field access instead!")]] float& dyn_scaleMlp();
    // Get instance field reference: public UnityEngine.Vector3 headTrackerForward
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_headTrackerForward();
    // Get instance field reference: public UnityEngine.Vector3 headTrackerUp
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_headTrackerUp();
    // Get instance field reference: public UnityEngine.Vector3 bodyTrackerForward
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_bodyTrackerForward();
    // Get instance field reference: public UnityEngine.Vector3 bodyTrackerUp
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_bodyTrackerUp();
    // Get instance field reference: public UnityEngine.Vector3 handTrackerForward
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_handTrackerForward();
    // Get instance field reference: public UnityEngine.Vector3 handTrackerUp
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_handTrackerUp();
    // Get instance field reference: public UnityEngine.Vector3 footTrackerForward
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_footTrackerForward();
    // Get instance field reference: public UnityEngine.Vector3 footTrackerUp
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_footTrackerUp();
    // Get instance field reference: public UnityEngine.Vector3 headOffset
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_headOffset();
    // Get instance field reference: public UnityEngine.Vector3 handOffset
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_handOffset();
    // Get instance field reference: public System.Single footForwardOffset
    [[deprecated("Use field access instead!")]] float& dyn_footForwardOffset();
    // Get instance field reference: public System.Single footInwardOffset
    [[deprecated("Use field access instead!")]] float& dyn_footInwardOffset();
    // Get instance field reference: public System.Single footHeadingOffset
    [[deprecated("Use field access instead!")]] float& dyn_footHeadingOffset();
    // Get instance field reference: public System.Single pelvisPositionWeight
    [[deprecated("Use field access instead!")]] float& dyn_pelvisPositionWeight();
    // Get instance field reference: public System.Single pelvisRotationWeight
    [[deprecated("Use field access instead!")]] float& dyn_pelvisRotationWeight();
    // public System.Void .ctor()
    // Offset: 0x1FC9BF0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static VRIKCalibrator::Settings* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::RootMotion::FinalIK::VRIKCalibrator::Settings::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<VRIKCalibrator::Settings*, creationType>()));
    }
  }; // RootMotion.FinalIK.VRIKCalibrator/RootMotion.FinalIK.Settings
  #pragma pack(pop)
  static check_size<sizeof(VRIKCalibrator::Settings), 156 + sizeof(float)> __RootMotion_FinalIK_VRIKCalibrator_SettingsSizeCheck;
  static_assert(sizeof(VRIKCalibrator::Settings) == 0xA0);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: RootMotion::FinalIK::VRIKCalibrator::Settings::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
