// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Photon.Pun.ViewSynchronization
#include "Photon/Pun/ViewSynchronization.hpp"
// Including type: Photon.Pun.OwnershipOption
#include "Photon/Pun/OwnershipOption.hpp"
// Including type: Photon.Pun.RpcTarget
#include "Photon/Pun/RpcTarget.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Component because it is already included!
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: IOnPhotonViewPreNetDestroy
  class IOnPhotonViewPreNetDestroy;
  // Forward declaring type: IOnPhotonViewOwnerChange
  class IOnPhotonViewOwnerChange;
  // Forward declaring type: IOnPhotonViewControllerChange
  class IOnPhotonViewControllerChange;
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
  // Forward declaring type: IPhotonViewCallback
  class IPhotonViewCallback;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: Photon.Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonView
  class PhotonView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Pun::PhotonView);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Pun::PhotonView*, "Photon.Pun", "PhotonView");
// Type namespace: Photon.Pun
namespace Photon::Pun {
  // Size: 0xB8
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Pun.PhotonView
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 954A94
  class PhotonView : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Photon::Pun::PhotonView::ObservableSearch
    struct ObservableSearch;
    // Nested type: ::Photon::Pun::PhotonView::CallbackTargetChange
    struct CallbackTargetChange;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Photon.Pun.PhotonView/Photon.Pun.ObservableSearch
    // [TokenAttribute] Offset: FFFFFFFF
    struct ObservableSearch/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ObservableSearch
      constexpr ObservableSearch(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch Manual
      static constexpr const int Manual = 0;
      // Get static field: static public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch Manual
      static ::Photon::Pun::PhotonView::ObservableSearch _get_Manual();
      // Set static field: static public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch Manual
      static void _set_Manual(::Photon::Pun::PhotonView::ObservableSearch value);
      // static field const value: static public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch AutoFindActive
      static constexpr const int AutoFindActive = 1;
      // Get static field: static public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch AutoFindActive
      static ::Photon::Pun::PhotonView::ObservableSearch _get_AutoFindActive();
      // Set static field: static public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch AutoFindActive
      static void _set_AutoFindActive(::Photon::Pun::PhotonView::ObservableSearch value);
      // static field const value: static public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch AutoFindAll
      static constexpr const int AutoFindAll = 2;
      // Get static field: static public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch AutoFindAll
      static ::Photon::Pun::PhotonView::ObservableSearch _get_AutoFindAll();
      // Set static field: static public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch AutoFindAll
      static void _set_AutoFindAll(::Photon::Pun::PhotonView::ObservableSearch value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Photon.Pun.PhotonView/Photon.Pun.ObservableSearch
    #pragma pack(pop)
    static check_size<sizeof(PhotonView::ObservableSearch), 0 + sizeof(int)> __Photon_Pun_PhotonView_ObservableSearchSizeCheck;
    static_assert(sizeof(PhotonView::ObservableSearch) == 0x4);
    // Size: 0x11
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Photon.Pun.PhotonView/Photon.Pun.CallbackTargetChange
    // [TokenAttribute] Offset: FFFFFFFF
    struct CallbackTargetChange/*, public ::System::ValueType*/ {
      public:
      public:
      // public Photon.Pun.IPhotonViewCallback obj
      // Size: 0x8
      // Offset: 0x0
      ::Photon::Pun::IPhotonViewCallback* obj;
      // Field size check
      static_assert(sizeof(::Photon::Pun::IPhotonViewCallback*) == 0x8);
      // public System.Type type
      // Size: 0x8
      // Offset: 0x8
      ::System::Type* type;
      // Field size check
      static_assert(sizeof(::System::Type*) == 0x8);
      // public System.Boolean add
      // Size: 0x1
      // Offset: 0x10
      bool add;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: CallbackTargetChange
      constexpr CallbackTargetChange(::Photon::Pun::IPhotonViewCallback* obj_ = {}, ::System::Type* type_ = {}, bool add_ = {}) noexcept : obj{obj_}, type{type_}, add{add_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Photon.Pun.IPhotonViewCallback obj
      [[deprecated("Use field access instead!")]] ::Photon::Pun::IPhotonViewCallback*& dyn_obj();
      // Get instance field reference: public System.Type type
      [[deprecated("Use field access instead!")]] ::System::Type*& dyn_type();
      // Get instance field reference: public System.Boolean add
      [[deprecated("Use field access instead!")]] bool& dyn_add();
      // public System.Void .ctor(Photon.Pun.IPhotonViewCallback obj, System.Type type, System.Boolean add)
      // Offset: 0xA78C8C
      // ABORTED: conflicts with another method.  CallbackTargetChange(::Photon::Pun::IPhotonViewCallback* obj, ::System::Type* type, bool add);
    }; // Photon.Pun.PhotonView/Photon.Pun.CallbackTargetChange
    #pragma pack(pop)
    static check_size<sizeof(PhotonView::CallbackTargetChange), 16 + sizeof(bool)> __Photon_Pun_PhotonView_CallbackTargetChangeSizeCheck;
    static_assert(sizeof(PhotonView::CallbackTargetChange) == 0x11);
    public:
    // [FormerlySerializedAsAttribute] Offset: 0x954DC4
    // public System.Byte Group
    // Size: 0x1
    // Offset: 0x18
    uint8_t Group;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: Group and: prefixField
    char __padding0[0x3] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x954DFC
    // public System.Int32 prefixField
    // Size: 0x4
    // Offset: 0x1C
    int prefixField;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Object[] instantiationDataField
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::Il2CppObject*> instantiationDataField;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppObject*>) == 0x8);
    // protected internal System.Collections.Generic.List`1<System.Object> lastOnSerializeDataSent
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::Il2CppObject*>* lastOnSerializeDataSent;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Il2CppObject*>*) == 0x8);
    // protected internal System.Collections.Generic.List`1<System.Object> syncValues
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::Il2CppObject*>* syncValues;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Il2CppObject*>*) == 0x8);
    // protected internal System.Object[] lastOnSerializeDataReceived
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::Il2CppObject*> lastOnSerializeDataReceived;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppObject*>) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x954E34
    // public Photon.Pun.ViewSynchronization Synchronization
    // Size: 0x4
    // Offset: 0x40
    ::Photon::Pun::ViewSynchronization Synchronization;
    // Field size check
    static_assert(sizeof(::Photon::Pun::ViewSynchronization) == 0x4);
    // protected internal System.Boolean mixedModeIsReliable
    // Size: 0x1
    // Offset: 0x44
    bool mixedModeIsReliable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: mixedModeIsReliable and: OwnershipTransfer
    char __padding7[0x3] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x954E6C
    // public Photon.Pun.OwnershipOption OwnershipTransfer
    // Size: 0x4
    // Offset: 0x48
    ::Photon::Pun::OwnershipOption OwnershipTransfer;
    // Field size check
    static_assert(sizeof(::Photon::Pun::OwnershipOption) == 0x4);
    // public Photon.Pun.PhotonView/Photon.Pun.ObservableSearch observableSearch
    // Size: 0x4
    // Offset: 0x4C
    ::Photon::Pun::PhotonView::ObservableSearch observableSearch;
    // Field size check
    static_assert(sizeof(::Photon::Pun::PhotonView::ObservableSearch) == 0x4);
    // public System.Collections.Generic.List`1<UnityEngine.Component> ObservedComponents
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::UnityEngine::Component*>* ObservedComponents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Component*>*) == 0x8);
    // UnityEngine.MonoBehaviour[] RpcMonoBehaviours
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::MonoBehaviour*> RpcMonoBehaviours;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::MonoBehaviour*>) == 0x8);
    // private System.Boolean <IsMine>k__BackingField
    // Size: 0x1
    // Offset: 0x60
    bool IsMine;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsMine and: Controller
    char __padding12[0x7] = {};
    // private Photon.Realtime.Player <Controller>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::Photon::Realtime::Player* Controller;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private System.Int32 <CreatorActorNr>k__BackingField
    // Size: 0x4
    // Offset: 0x70
    int CreatorActorNr;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <AmOwner>k__BackingField
    // Size: 0x1
    // Offset: 0x74
    bool AmOwner;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AmOwner and: Owner
    char __padding15[0x3] = {};
    // private Photon.Realtime.Player <Owner>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::Photon::Realtime::Player* Owner;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private System.Int32 ownerActorNr
    // Size: 0x4
    // Offset: 0x80
    int ownerActorNr;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 controllerActorNr
    // Size: 0x4
    // Offset: 0x84
    int controllerActorNr;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x954EF4
    // public System.Int32 sceneViewId
    // Size: 0x4
    // Offset: 0x88
    int sceneViewId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 viewIdField
    // Size: 0x4
    // Offset: 0x8C
    int viewIdField;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x954F50
    // public System.Int32 InstantiationId
    // Size: 0x4
    // Offset: 0x90
    int InstantiationId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean isRuntimeInstantiated
    // Size: 0x1
    // Offset: 0x94
    bool isRuntimeInstantiated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected internal System.Boolean removedFromLocalViewList
    // Size: 0x1
    // Offset: 0x95
    bool removedFromLocalViewList;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: removedFromLocalViewList and: CallbackChangeQueue
    char __padding23[0x2] = {};
    // private System.Collections.Generic.Queue`1<Photon.Pun.PhotonView/Photon.Pun.CallbackTargetChange> CallbackChangeQueue
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::Queue_1<::Photon::Pun::PhotonView::CallbackTargetChange>* CallbackChangeQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::Photon::Pun::PhotonView::CallbackTargetChange>*) == 0x8);
    // private System.Collections.Generic.List`1<Photon.Pun.IOnPhotonViewPreNetDestroy> OnPreNetDestroyCallbacks
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::Photon::Pun::IOnPhotonViewPreNetDestroy*>* OnPreNetDestroyCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Pun::IOnPhotonViewPreNetDestroy*>*) == 0x8);
    // private System.Collections.Generic.List`1<Photon.Pun.IOnPhotonViewOwnerChange> OnOwnerChangeCallbacks
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::List_1<::Photon::Pun::IOnPhotonViewOwnerChange*>* OnOwnerChangeCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Pun::IOnPhotonViewOwnerChange*>*) == 0x8);
    // private System.Collections.Generic.List`1<Photon.Pun.IOnPhotonViewControllerChange> OnControllerChangeCallbacks
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<::Photon::Pun::IOnPhotonViewControllerChange*>* OnControllerChangeCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Pun::IOnPhotonViewControllerChange*>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Byte Group
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Group();
    // Get instance field reference: public System.Int32 prefixField
    [[deprecated("Use field access instead!")]] int& dyn_prefixField();
    // Get instance field reference: System.Object[] instantiationDataField
    [[deprecated("Use field access instead!")]] ::ArrayW<::Il2CppObject*>& dyn_instantiationDataField();
