// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPun
#include "Photon/Pun/MonoBehaviourPun.hpp"
// Including type: Photon.Pun.IPunObservable
#include "Photon/Pun/IPunObservable.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Completed forward declares
// Type namespace: Photon.Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonRigidbodyView
  class PhotonRigidbodyView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Pun::PhotonRigidbodyView);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Pun::PhotonRigidbodyView*, "Photon.Pun", "PhotonRigidbodyView");
// Type namespace: Photon.Pun
namespace Photon::Pun {
  // Size: 0x54
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Pun.PhotonRigidbodyView
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 954BE4
  // [AddComponentMenu] Offset: 954BE4
  class PhotonRigidbodyView : public ::Photon::Pun::MonoBehaviourPun/*, public ::Photon::Pun::IPunObservable*/ {
    public:
    public:
    // private System.Single m_Distance
    // Size: 0x4
    // Offset: 0x20
    float m_Distance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_Angle
    // Size: 0x4
    // Offset: 0x24
    float m_Angle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Rigidbody m_Body
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Rigidbody* m_Body;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Vector3 m_NetworkPosition
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Vector3 m_NetworkPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_NetworkRotation
    // Size: 0x10
    // Offset: 0x3C
    ::UnityEngine::Quaternion m_NetworkRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public System.Boolean m_SynchronizeVelocity
    // Size: 0x1
    // Offset: 0x4C
    bool m_SynchronizeVelocity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean m_SynchronizeAngularVelocity
    // Size: 0x1
    // Offset: 0x4D
    bool m_SynchronizeAngularVelocity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean m_TeleportEnabled
    // Size: 0x1
    // Offset: 0x4E
    bool m_TeleportEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_TeleportEnabled and: m_TeleportIfDistanceGreaterThan
    char __padding7[0x1] = {};
    // public System.Single m_TeleportIfDistanceGreaterThan
    // Size: 0x4
    // Offset: 0x50
    float m_TeleportIfDistanceGreaterThan;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Photon::Pun::IPunObservable
    operator ::Photon::Pun::IPunObservable() noexcept {
      return *reinterpret_cast<::Photon::Pun::IPunObservable*>(this);
    }
    // Get instance field reference: private System.Single m_Distance
    [[deprecated("Use field access instead!")]] float& dyn_m_Distance();
    // Get instance field reference: private System.Single m_Angle
    [[deprecated("Use field access instead!")]] float& dyn_m_Angle();
    // Get instance field reference: private UnityEngine.Rigidbody m_Body
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn_m_Body();
    // Get instance field reference: private UnityEngine.Vector3 m_NetworkPosition
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_NetworkPosition();
    // Get instance field reference: private UnityEngine.Quaternion m_NetworkRotation
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_m_NetworkRotation();
    // Get instance field reference: public System.Boolean m_SynchronizeVelocity
    [[deprecated("Use field access instead!")]] bool& dyn_m_SynchronizeVelocity();
    // Get instance field reference: public System.Boolean m_SynchronizeAngularVelocity
    [[deprecated("Use field access instead!")]] bool& dyn_m_SynchronizeAngularVelocity();
    // Get instance field reference: public System.Boolean m_TeleportEnabled
    [[deprecated("Use field access instead!")]] bool& dyn_m_TeleportEnabled();
    // Get instance field reference: public System.Single m_TeleportIfDistanceGreaterThan
    [[deprecated("Use field access instead!")]] float& dyn_m_TeleportIfDistanceGreaterThan();
    // public System.Void Awake()
    // Offset: 0x1B758BC
    void Awake();
    // public System.Void FixedUpdate()
    // Offset: 0x1B7591C
    void FixedUpdate();
    // public System.Void OnPhotonSerializeView(Photon.Pun.PhotonStream stream, Photon.Pun.PhotonMessageInfo info)
    // Offset: 0x1B75B28
    void OnPhotonSerializeView(::Photon::Pun::PhotonStream* stream, ::Photon::Pun::PhotonMessageInfo info);
    // public System.Void .ctor()
    // Offset: 0x1B76014
    // Implemented from: Photon.Pun.MonoBehaviourPun
    // Base method: System.Void MonoBehaviourPun::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PhotonRigidbodyView* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Photon::Pun::PhotonRigidbodyView::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PhotonRigidbodyView*, creationType>()));
    }
  }; // Photon.Pun.PhotonRigidbodyView
  #pragma pack(pop)
  static check_size<sizeof(PhotonRigidbodyView), 80 + sizeof(float)> __Photon_Pun_PhotonRigidbodyViewSizeCheck;
  static_assert(sizeof(PhotonRigidbodyView) == 0x54);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Photon::Pun::PhotonRigidbodyView::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Pun::PhotonRigidbodyView::*)()>(&Photon::Pun::PhotonRigidbodyView::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Pun::PhotonRigidbodyView*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Pun::PhotonRigidbodyView::FixedUpdate
// Il2CppName: FixedUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Pun::PhotonRigidbodyView::*)()>(&Photon::Pun::PhotonRigidbodyView::FixedUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Pun::PhotonRigidbodyView*), "FixedUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Pun::PhotonRigidbodyView::OnPhotonSerializeView
// Il2CppName: OnPhotonSerializeView
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Pun::PhotonRigidbodyView::*)(::Photon::Pun::PhotonStream*, ::Photon::Pun::PhotonMessageInfo)>(&Photon::Pun::PhotonRigidbodyView::OnPhotonSerializeView)> {
  static const MethodInfo* get() {
    static auto* stream = &::il2cpp_utils::GetClassFromName("Photon.Pun", "PhotonStream")->byval_arg;
    static auto* info = &::il2cpp_utils::GetClassFromName("Photon.Pun", "PhotonMessageInfo")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Photon::Pun::PhotonRigidbodyView*), "OnPhotonSerializeView", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{stream, info});
  }
};
// Writing MetadataGetter for method: Photon::Pun::PhotonRigidbodyView::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
