// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.AddressableAssets.AddressablesImpl
#include "UnityEngine/AddressableAssets/AddressablesImpl.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::AddressableAssets::ResourceLocators
namespace UnityEngine::AddressableAssets::ResourceLocators {
  // Forward declaring type: IResourceLocator
  class IResourceLocator;
}
// Forward declaring namespace: UnityEngine::ResourceManagement::ResourceLocations
namespace UnityEngine::ResourceManagement::ResourceLocations {
  // Forward declaring type: IResourceLocation
  class IResourceLocation;
}
// Completed forward declares
// Type namespace: UnityEngine.AddressableAssets
namespace UnityEngine::AddressableAssets {
  // Size: 0x29
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.AddressableAssets.AddressablesImpl/ResourceLocatorInfo
  class AddressablesImpl::ResourceLocatorInfo : public ::Il2CppObject {
    public:
    // [CompilerGeneratedAttribute] Offset: 0xE01820
    // private UnityEngine.AddressableAssets.ResourceLocators.IResourceLocator <Locator>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator* Locator;
    // Field size check
    static_assert(sizeof(UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE01830
    // private System.String <LocalHash>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* LocalHash;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE01840
    // private UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation <CatalogLocation>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* CatalogLocation;
    // Field size check
    static_assert(sizeof(UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xE01850
    // private System.Boolean <ContentUpdateAvailable>k__BackingField
    // Size: 0x1
    // Offset: 0x28
    bool ContentUpdateAvailable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: ResourceLocatorInfo
    ResourceLocatorInfo(UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator* Locator_ = {}, ::Il2CppString* LocalHash_ = {}, UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* CatalogLocation_ = {}, bool ContentUpdateAvailable_ = {}) noexcept : Locator{Locator_}, LocalHash{LocalHash_}, CatalogLocation{CatalogLocation_}, ContentUpdateAvailable{ContentUpdateAvailable_} {}
    // public UnityEngine.AddressableAssets.ResourceLocators.IResourceLocator get_Locator()
    // Offset: 0x13D4F50
    UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator* get_Locator();
    // private System.Void set_Locator(UnityEngine.AddressableAssets.ResourceLocators.IResourceLocator value)
    // Offset: 0x13D4F58
    void set_Locator(UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator* value);
    // public System.String get_LocalHash()
    // Offset: 0x13D4F60
    ::Il2CppString* get_LocalHash();
    // private System.Void set_LocalHash(System.String value)
    // Offset: 0x13D4F68
    void set_LocalHash(::Il2CppString* value);
    // public UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation get_CatalogLocation()
    // Offset: 0x13D4F70
    UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* get_CatalogLocation();
    // private System.Void set_CatalogLocation(UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation value)
    // Offset: 0x13D4F78
    void set_CatalogLocation(UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* value);
    // public System.Boolean get_ContentUpdateAvailable()
    // Offset: 0x13D4F80
    bool get_ContentUpdateAvailable();
    // System.Void set_ContentUpdateAvailable(System.Boolean value)
    // Offset: 0x13D4F88
    void set_ContentUpdateAvailable(bool value);
    // public System.Void .ctor(UnityEngine.AddressableAssets.ResourceLocators.IResourceLocator loc, System.String localHash, UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation remoteCatalogLocation)
    // Offset: 0x13CE68C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AddressablesImpl::ResourceLocatorInfo* New_ctor(UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator* loc, ::Il2CppString* localHash, UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* remoteCatalogLocation) {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::AddressableAssets::AddressablesImpl::ResourceLocatorInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AddressablesImpl::ResourceLocatorInfo*, creationType>(loc, localHash, remoteCatalogLocation)));
    }
    // public UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation get_HashLocation()
    // Offset: 0x13D4F94
    UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* get_HashLocation();
    // public System.Boolean get_CanUpdateContent()
    // Offset: 0x13D50BC
    bool get_CanUpdateContent();
    // System.Void UpdateContent(UnityEngine.AddressableAssets.ResourceLocators.IResourceLocator locator, System.String hash, UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation loc)
    // Offset: 0x13D527C
    void UpdateContent(UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator* locator, ::Il2CppString* hash, UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* loc);
  }; // UnityEngine.AddressableAssets.AddressablesImpl/ResourceLocatorInfo
  #pragma pack(pop)
  static check_size<sizeof(AddressablesImpl::ResourceLocatorInfo), 40 + sizeof(bool)> __UnityEngine_AddressableAssets_AddressablesImpl_ResourceLocatorInfoSizeCheck;
  static_assert(sizeof(AddressablesImpl::ResourceLocatorInfo) == 0x29);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::AddressableAssets::AddressablesImpl::ResourceLocatorInfo*, "UnityEngine.AddressableAssets", "AddressablesImpl/ResourceLocatorInfo");
