// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Linq.Expressions.Interpreter.RuntimeLabel
#include "System/Linq/Expressions/Interpreter/RuntimeLabel.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Linq::Expressions::Interpreter
namespace System::Linq::Expressions::Interpreter {
  // Forward declaring type: Instruction
  class Instruction;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
struct Il2CppObject;
// Completed il2cpp-utils forward declares
// Type namespace: System.Linq.Expressions.Interpreter
namespace System::Linq::Expressions::Interpreter {
  // Forward declaring type: InstructionArray
  struct InstructionArray;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Linq::Expressions::Interpreter::InstructionArray, "System.Linq.Expressions.Interpreter", "InstructionArray");
// Type namespace: System.Linq.Expressions.Interpreter
namespace System::Linq::Expressions::Interpreter {
  // Size: 0x28
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Linq.Expressions.Interpreter.InstructionArray
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerTypeProxyAttribute] Offset: 119DC20
  struct InstructionArray/*, public System::ValueType*/ {
    public:
    // Nested type: System::Linq::Expressions::Interpreter::InstructionArray::DebugView
    class DebugView;
    public:
    // readonly System.Int32 MaxStackDepth
    // Size: 0x4
    // Offset: 0x0
    int MaxStackDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // readonly System.Int32 MaxContinuationDepth
    // Size: 0x4
    // Offset: 0x4
    int MaxContinuationDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // readonly System.Linq.Expressions.Interpreter.Instruction[] Instructions
    // Size: 0x8
    // Offset: 0x8
    ::ArrayW<System::Linq::Expressions::Interpreter::Instruction*> Instructions;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Linq::Expressions::Interpreter::Instruction*>) == 0x8);
    // readonly System.Object[] Objects
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::Il2CppObject*> Objects;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppObject*>) == 0x8);
    // readonly System.Linq.Expressions.Interpreter.RuntimeLabel[] Labels
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<System::Linq::Expressions::Interpreter::RuntimeLabel> Labels;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Linq::Expressions::Interpreter::RuntimeLabel>) == 0x8);
    // readonly System.Collections.Generic.List`1<System.Collections.Generic.KeyValuePair`2<System.Int32,System.Object>> DebugCookies
    // Size: 0x8
    // Offset: 0x20
    System::Collections::Generic::List_1<System::Collections::Generic::KeyValuePair_2<int, ::Il2CppObject*>>* DebugCookies;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<System::Collections::Generic::KeyValuePair_2<int, ::Il2CppObject*>>*) == 0x8);
    public:
    // Creating value type constructor for type: InstructionArray
    constexpr InstructionArray(int MaxStackDepth_ = {}, int MaxContinuationDepth_ = {}, ::ArrayW<System::Linq::Expressions::Interpreter::Instruction*> Instructions_ = ::ArrayW<System::Linq::Expressions::Interpreter::Instruction*>(static_cast<void*>(nullptr)), ::ArrayW<::Il2CppObject*> Objects_ = ::ArrayW<::Il2CppObject*>(static_cast<void*>(nullptr)), ::ArrayW<System::Linq::Expressions::Interpreter::RuntimeLabel> Labels_ = ::ArrayW<System::Linq::Expressions::Interpreter::RuntimeLabel>(static_cast<void*>(nullptr)), System::Collections::Generic::List_1<System::Collections::Generic::KeyValuePair_2<int, ::Il2CppObject*>>* DebugCookies_ = {}) noexcept : MaxStackDepth{MaxStackDepth_}, MaxContinuationDepth{MaxContinuationDepth_}, Instructions{Instructions_}, Objects{Objects_}, Labels{Labels_}, DebugCookies{DebugCookies_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field reference: readonly System.Int32 MaxStackDepth
    int& dyn_MaxStackDepth();
    // Get instance field reference: readonly System.Int32 MaxContinuationDepth
    int& dyn_MaxContinuationDepth();
    // Get instance field reference: readonly System.Linq.Expressions.Interpreter.Instruction[] Instructions
    ::ArrayW<System::Linq::Expressions::Interpreter::Instruction*>& dyn_Instructions();
    // Get instance field reference: readonly System.Object[] Objects
    ::ArrayW<::Il2CppObject*>& dyn_Objects();
    // Get instance field reference: readonly System.Linq.Expressions.Interpreter.RuntimeLabel[] Labels
    ::ArrayW<System::Linq::Expressions::Interpreter::RuntimeLabel>& dyn_Labels();
    // Get instance field reference: readonly System.Collections.Generic.List`1<System.Collections.Generic.KeyValuePair`2<System.Int32,System.Object>> DebugCookies
    System::Collections::Generic::List_1<System::Collections::Generic::KeyValuePair_2<int, ::Il2CppObject*>>*& dyn_DebugCookies();
    // System.Void .ctor(System.Int32 maxStackDepth, System.Int32 maxContinuationDepth, System.Linq.Expressions.Interpreter.Instruction[] instructions, System.Object[] objects, System.Linq.Expressions.Interpreter.RuntimeLabel[] labels, System.Collections.Generic.List`1<System.Collections.Generic.KeyValuePair`2<System.Int32,System.Object>> debugCookies)
    // Offset: 0x1BF84D0
    // ABORTED: conflicts with another method.  InstructionArray(int maxStackDepth, int maxContinuationDepth, ::ArrayW<System::Linq::Expressions::Interpreter::Instruction*> instructions, ::ArrayW<::Il2CppObject*> objects, ::ArrayW<System::Linq::Expressions::Interpreter::RuntimeLabel> labels, System::Collections::Generic::List_1<System::Collections::Generic::KeyValuePair_2<int, ::Il2CppObject*>>* debugCookies);
  }; // System.Linq.Expressions.Interpreter.InstructionArray
  #pragma pack(pop)
  static check_size<sizeof(InstructionArray), 32 + sizeof(System::Collections::Generic::List_1<System::Collections::Generic::KeyValuePair_2<int, ::Il2CppObject*>>*)> __System_Linq_Expressions_Interpreter_InstructionArraySizeCheck;
  static_assert(sizeof(InstructionArray) == 0x28);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Linq::Expressions::Interpreter::InstructionArray::InstructionArray
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
