// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
// Including type: System.Linq.Expressions.Interpreter.RuntimeLabel
#include "System/Linq/Expressions/Interpreter/RuntimeLabel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Linq::Expressions::Interpreter
namespace System::Linq::Expressions::Interpreter {
  // Forward declaring type: Instruction
  class Instruction;
  // Forward declaring type: BranchLabel
  class BranchLabel;
  // Forward declaring type: InstructionArray
  struct InstructionArray;
  // Forward declaring type: ByRefUpdater
  class ByRefUpdater;
  // Forward declaring type: LightDelegateCreator
  class LightDelegateCreator;
  // Forward declaring type: OffsetInstruction
  class OffsetInstruction;
  // Forward declaring type: EnterTryFaultInstruction
  class EnterTryFaultInstruction;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: FieldInfo
  class FieldInfo;
  // Forward declaring type: ConstructorInfo
  class ConstructorInfo;
  // Forward declaring type: ParameterInfo
  class ParameterInfo;
  // Forward declaring type: MethodInfo
  class MethodInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: TypeCode
  struct TypeCode;
}
// Forward declaring namespace: System::Runtime::CompilerServices
namespace System::Runtime::CompilerServices {
  // Forward declaring type: StrongBox`1<T>
  template<typename T>
  class StrongBox_1;
}
// Completed forward declares
// Type namespace: System.Linq.Expressions.Interpreter
namespace System::Linq::Expressions::Interpreter {
  // Forward declaring type: InstructionList
  class InstructionList;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Linq::Expressions::Interpreter::InstructionList);
DEFINE_IL2CPP_ARG_TYPE(System::Linq::Expressions::Interpreter::InstructionList*, "System.Linq.Expressions.Interpreter", "InstructionList");
// Type namespace: System.Linq.Expressions.Interpreter
namespace System::Linq::Expressions::Interpreter {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: System.Linq.Expressions.Interpreter.InstructionList
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerTypeProxyAttribute] Offset: 119DC84
  class InstructionList : public ::Il2CppObject {
    public:
    // Nested type: System::Linq::Expressions::Interpreter::InstructionList::DebugView
    class DebugView;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly System.Collections.Generic.List`1<System.Linq.Expressions.Interpreter.Instruction> _instructions
    // Size: 0x8
    // Offset: 0x10
    System::Collections::Generic::List_1<System::Linq::Expressions::Interpreter::Instruction*>* instructions;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<System::Linq::Expressions::Interpreter::Instruction*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Object> _objects
    // Size: 0x8
    // Offset: 0x18
    System::Collections::Generic::List_1<::Il2CppObject*>* objects;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<::Il2CppObject*>*) == 0x8);
    // private System.Int32 _currentStackDepth
    // Size: 0x4
    // Offset: 0x20
    int currentStackDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _maxStackDepth
    // Size: 0x4
    // Offset: 0x24
    int maxStackDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _currentContinuationsDepth
    // Size: 0x4
    // Offset: 0x28
    int currentContinuationsDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _maxContinuationDepth
    // Size: 0x4
    // Offset: 0x2C
    int maxContinuationDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _runtimeLabelCount
    // Size: 0x4
    // Offset: 0x30
    int runtimeLabelCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: runtimeLabelCount and: labels
    char __padding6[0x4] = {};
    // private System.Collections.Generic.List`1<System.Linq.Expressions.Interpreter.BranchLabel> _labels
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Generic::List_1<System::Linq::Expressions::Interpreter::BranchLabel*>* labels;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<System::Linq::Expressions::Interpreter::BranchLabel*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Collections.Generic.KeyValuePair`2<System.Int32,System.Object>> _debugCookies
    // Size: 0x8
    // Offset: 0x40
    System::Collections::Generic::List_1<System::Collections::Generic::KeyValuePair_2<int, ::Il2CppObject*>>* debugCookies;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<System::Collections::Generic::KeyValuePair_2<int, ::Il2CppObject*>>*) == 0x8);
    public:
    // Get static field: static private System.Linq.Expressions.Interpreter.Instruction s_null
    static System::Linq::Expressions::Interpreter::Instruction* _get_s_null();
    // Set static field: static private System.Linq.Expressions.Interpreter.Instruction s_null
    static void _set_s_null(System::Linq::Expressions::Interpreter::Instruction* value);
    // Get static field: static private System.Linq.Expressions.Interpreter.Instruction s_true
    static System::Linq::Expressions::Interpreter::Instruction* _get_s_true();
    // Set static field: static private System.Linq.Expressions.Interpreter.Instruction s_true
