// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include <stdint.h>
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Analytics.DataPrivacy
#include "UnityEngine/Analytics/DataPrivacy.hpp"
// Completed includes
// Begin il2cpp-utils forward declares
struct CsString;
// Completed il2cpp-utils forward declares
// Type namespace: UnityEngine.Analytics
namespace UnityEngine::Analytics {
  // Autogenerated type: UnityEngine.Analytics.DataPrivacy/UserPostData
  struct DataPrivacy::UserPostData : public System::ValueType {
    public:
    // public System.String appid
    // Offset: 0x0
    ::CsString* appid;
    // public System.String userid
    // Offset: 0x8
    ::CsString* userid;
    // public System.Int64 sessionid
    // Offset: 0x10
    int64_t sessionid;
    // public System.String platform
    // Offset: 0x18
    ::CsString* platform;
    // public System.UInt32 platformid
    // Offset: 0x20
    uint platformid;
    // public System.String sdk_ver
    // Offset: 0x28
    ::CsString* sdk_ver;
    // public System.Boolean debug_device
    // Offset: 0x30
    bool debug_device;
    // public System.String deviceid
    // Offset: 0x38
    ::CsString* deviceid;
    // public System.String plugin_ver
    // Offset: 0x40
    ::CsString* plugin_ver;
    // Creating value type constructor for type: UserPostData
    UserPostData(::CsString* appid_ = {}, ::CsString* userid_ = {}, int64_t sessionid_ = {}, ::CsString* platform_ = {}, uint platformid_ = {}, ::CsString* sdk_ver_ = {}, bool debug_device_ = {}, ::CsString* deviceid_ = {}, ::CsString* plugin_ver_ = {}) : appid{appid_}, userid{userid_}, sessionid{sessionid_}, platform{platform_}, platformid{platformid_}, sdk_ver{sdk_ver_}, debug_device{debug_device_}, deviceid{deviceid_}, plugin_ver{plugin_ver_} {}
  }; // UnityEngine.Analytics.DataPrivacy/UserPostData
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Analytics::DataPrivacy::UserPostData, "UnityEngine.Analytics", "DataPrivacy/UserPostData");
#pragma pack(pop)
