// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.InputActionMap
#include "UnityEngine/InputSystem/InputActionMap.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.InputSystem.InputActionMap/UnityEngine.InputSystem.ReadActionJson
#include "UnityEngine/InputSystem/InputActionMap_ReadActionJson.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputActionMap::ReadMapJson, "UnityEngine.InputSystem", "InputActionMap/ReadMapJson");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0x20
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.InputActionMap/UnityEngine.InputSystem.ReadMapJson
  // [TokenAttribute] Offset: FFFFFFFF
  struct InputActionMap::ReadMapJson/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.String name
    // Size: 0x8
    // Offset: 0x0
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String id
    // Size: 0x8
    // Offset: 0x8
    ::StringW id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.InputSystem.InputActionMap/UnityEngine.InputSystem.ReadActionJson[] actions
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::UnityEngine::InputSystem::InputActionMap::ReadActionJson> actions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputActionMap::ReadActionJson>) == 0x8);
    // public UnityEngine.InputSystem.InputActionMap/UnityEngine.InputSystem.BindingJson[] bindings
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::InputSystem::InputActionMap::BindingJson> bindings;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputActionMap::BindingJson>) == 0x8);
    public:
    // Creating value type constructor for type: ReadMapJson
    constexpr ReadMapJson(::StringW name_ = {}, ::StringW id_ = {}, ::ArrayW<::UnityEngine::InputSystem::InputActionMap::ReadActionJson> actions_ = ::ArrayW<::UnityEngine::InputSystem::InputActionMap::ReadActionJson>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::InputSystem::InputActionMap::BindingJson> bindings_ = ::ArrayW<::UnityEngine::InputSystem::InputActionMap::BindingJson>(static_cast<void*>(nullptr))) noexcept : name{name_}, id{id_}, actions{actions_}, bindings{bindings_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.String name
    [[deprecated("Use field access instead!")]] ::StringW& dyn_name();
    // Get instance field reference: public System.String id
    [[deprecated("Use field access instead!")]] ::StringW& dyn_id();
    // Get instance field reference: public UnityEngine.InputSystem.InputActionMap/UnityEngine.InputSystem.ReadActionJson[] actions
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::InputActionMap::ReadActionJson>& dyn_actions();
    // Get instance field reference: public UnityEngine.InputSystem.InputActionMap/UnityEngine.InputSystem.BindingJson[] bindings
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::InputActionMap::BindingJson>& dyn_bindings();
  }; // UnityEngine.InputSystem.InputActionMap/UnityEngine.InputSystem.ReadMapJson
  #pragma pack(pop)
  static check_size<sizeof(InputActionMap::ReadMapJson), 24 + sizeof(::ArrayW<::UnityEngine::InputSystem::InputActionMap::BindingJson>)> __UnityEngine_InputSystem_InputActionMap_ReadMapJsonSizeCheck;
  static_assert(sizeof(InputActionMap::ReadMapJson) == 0x20);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
