// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.InputControl
#include "UnityEngine/InputSystem/InputControl.hpp"
// Including type: UnityEngine.InputSystem.Layouts.InputDeviceDescription
#include "UnityEngine/InputSystem/Layouts/InputDeviceDescription.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Forward declaring namespace: UnityEngine::InputSystem::LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: IInputDeviceCommandInfo
  class IInputDeviceCommandInfo;
}
// Forward declaring namespace: System
namespace System {
  // Skipping declaration: ValueType because it is already included!
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputDevice
  class InputDevice;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputDevice);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputDevice*, "UnityEngine.InputSystem", "InputDevice");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0x150
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.InputDevice
  // [TokenAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: FFFFFFFF
  class InputDevice : public ::UnityEngine::InputSystem::InputControl {
    public:
    // Writing base type padding for base size: 0xD4 to desired offset: 0xD8
    char ___base_padding[0x4] = {};
    // Nested type: ::UnityEngine::InputSystem::InputDevice::DeviceFlags
    struct DeviceFlags;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct DeviceFlags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: DeviceFlags
      constexpr DeviceFlags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags UpdateBeforeRender
      static constexpr const int UpdateBeforeRender = 1;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags UpdateBeforeRender
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_UpdateBeforeRender();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags UpdateBeforeRender
      static void _set_UpdateBeforeRender(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags HasStateCallbacks
      static constexpr const int HasStateCallbacks = 2;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags HasStateCallbacks
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_HasStateCallbacks();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags HasStateCallbacks
      static void _set_HasStateCallbacks(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags HasControlsWithDefaultState
      static constexpr const int HasControlsWithDefaultState = 4;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags HasControlsWithDefaultState
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_HasControlsWithDefaultState();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags HasControlsWithDefaultState
      static void _set_HasControlsWithDefaultState(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags Remote
      static constexpr const int Remote = 8;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags Remote
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_Remote();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags Remote
      static void _set_Remote(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags Native
      static constexpr const int Native = 16;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags Native
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_Native();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags Native
      static void _set_Native(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags Disabled
      static constexpr const int Disabled = 32;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags Disabled
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_Disabled();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags Disabled
      static void _set_Disabled(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags DisabledStateHasBeenQueried
      static constexpr const int DisabledStateHasBeenQueried = 64;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags DisabledStateHasBeenQueried
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_DisabledStateHasBeenQueried();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags DisabledStateHasBeenQueried
      static void _set_DisabledStateHasBeenQueried(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags
    #pragma pack(pop)
    static check_size<sizeof(InputDevice::DeviceFlags), 0 + sizeof(int)> __UnityEngine_InputSystem_InputDevice_DeviceFlagsSizeCheck;
    static_assert(sizeof(InputDevice::DeviceFlags) == 0x4);
    public:
    // UnityEngine.InputSystem.InputDevice/UnityEngine.InputSystem.DeviceFlags m_DeviceFlags
    // Size: 0x4
    // Offset: 0xD8
    ::UnityEngine::InputSystem::InputDevice::DeviceFlags m_DeviceFlags;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputDevice::DeviceFlags) == 0x4);
    // System.Int32 m_DeviceId
    // Size: 0x4
    // Offset: 0xDC
    int m_DeviceId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_ParticipantId
    // Size: 0x4
    // Offset: 0xE0
    int m_ParticipantId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_DeviceIndex
    // Size: 0x4
    // Offset: 0xE4
    int m_DeviceIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.Layouts.InputDeviceDescription m_Description
    // Size: 0x38
    // Offset: 0xE8
    ::UnityEngine::InputSystem::Layouts::InputDeviceDescription m_Description;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Layouts::InputDeviceDescription) == 0x38);
    // System.Double m_LastUpdateTimeInternal
    // Size: 0x8
    // Offset: 0x120
    double m_LastUpdateTimeInternal;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // System.UInt32 m_CurrentUpdateStepCount
    // Size: 0x4
    // Offset: 0x128
    uint m_CurrentUpdateStepCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: m_CurrentUpdateStepCount and: m_AliasesForEachControl
    char __padding6[0x4] = {};
    // UnityEngine.InputSystem.Utilities.InternedString[] m_AliasesForEachControl
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString> m_AliasesForEachControl;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>) == 0x8);
    // UnityEngine.InputSystem.Utilities.InternedString[] m_UsagesForEachControl
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString> m_UsagesForEachControl;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>) == 0x8);
    // UnityEngine.InputSystem.InputControl[] m_UsageToControl
    // Size: 0x8
    // Offset: 0x140
    ::ArrayW<::UnityEngine::InputSystem::InputControl*> m_UsageToControl;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputControl*>) == 0x8);
    // UnityEngine.InputSystem.InputControl[] m_ChildrenForEachControl
    // Size: 0x8
    // Offset: 0x148
    ::ArrayW<::UnityEngine::InputSystem::InputControl*> m_ChildrenForEachControl;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputControl*>) == 0x8);
    public:
    // static field const value: static public System.Int32 InvalidDeviceId
    static constexpr const int InvalidDeviceId = 0;
    // Get static field: static public System.Int32 InvalidDeviceId
    static int _get_InvalidDeviceId();
    // Set static field: static public System.Int32 InvalidDeviceId
    static void _set_InvalidDeviceId(int value);
    // static field const value: static System.Int32 kLocalParticipantId
    static constexpr const int kLocalParticipantId = 0;
    // Get static field: static System.Int32 kLocalParticipantId
    static int _get_kLocalParticipantId();
    // Set static field: static System.Int32 kLocalParticipantId
    static void _set_kLocalParticipantId(int value);
