// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputStateBlock
#include "UnityEngine/InputSystem/LowLevel/InputStateBlock.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InternedString
#include "UnityEngine/InputSystem/Utilities/InternedString.hpp"
// Including type: UnityEngine.InputSystem.Utilities.PrimitiveValue
#include "UnityEngine/InputSystem/Utilities/PrimitiveValue.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputDevice
  class InputDevice;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputControl
  class InputControl;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputControl);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputControl*, "UnityEngine.InputSystem", "InputControl");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0xD4
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.InputControl
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: 9575D4
  // [DebuggerDisplayAttribute] Offset: 9575D4
  // [PreserveAttribute] Offset: FFFFFFFF
  class InputControl : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputControl::ControlFlags
    struct ControlFlags;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct ControlFlags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ControlFlags
      constexpr ControlFlags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags ConfigUpToDate
      static constexpr const int ConfigUpToDate = 1;
      // Get static field: static public UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags ConfigUpToDate
      static ::UnityEngine::InputSystem::InputControl::ControlFlags _get_ConfigUpToDate();
      // Set static field: static public UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags ConfigUpToDate
      static void _set_ConfigUpToDate(::UnityEngine::InputSystem::InputControl::ControlFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags IsNoisy
      static constexpr const int IsNoisy = 2;
      // Get static field: static public UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags IsNoisy
      static ::UnityEngine::InputSystem::InputControl::ControlFlags _get_IsNoisy();
      // Set static field: static public UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags IsNoisy
      static void _set_IsNoisy(::UnityEngine::InputSystem::InputControl::ControlFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags IsSynthetic
      static constexpr const int IsSynthetic = 4;
      // Get static field: static public UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags IsSynthetic
      static ::UnityEngine::InputSystem::InputControl::ControlFlags _get_IsSynthetic();
      // Set static field: static public UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags IsSynthetic
      static void _set_IsSynthetic(::UnityEngine::InputSystem::InputControl::ControlFlags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags
    #pragma pack(pop)
    static check_size<sizeof(InputControl::ControlFlags), 0 + sizeof(int)> __UnityEngine_InputSystem_InputControl_ControlFlagsSizeCheck;
    static_assert(sizeof(InputControl::ControlFlags) == 0x4);
    public:
    // protected internal UnityEngine.InputSystem.LowLevel.InputStateBlock m_StateBlock
    // Size: 0x10
    // Offset: 0x10
    ::UnityEngine::InputSystem::LowLevel::InputStateBlock m_StateBlock;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputStateBlock) == 0x10);
    // UnityEngine.InputSystem.Utilities.InternedString m_Name
    // Size: 0x10
    // Offset: 0x20
    ::UnityEngine::InputSystem::Utilities::InternedString m_Name;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
    // System.String m_Path
    // Size: 0x8
    // Offset: 0x30
    ::StringW m_Path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_DisplayName
    // Size: 0x8
    // Offset: 0x38
    ::StringW m_DisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_DisplayNameFromLayout
    // Size: 0x8
    // Offset: 0x40
    ::StringW m_DisplayNameFromLayout;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_ShortDisplayName
    // Size: 0x8
    // Offset: 0x48
    ::StringW m_ShortDisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_ShortDisplayNameFromLayout
    // Size: 0x8
    // Offset: 0x50
    ::StringW m_ShortDisplayNameFromLayout;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // UnityEngine.InputSystem.Utilities.InternedString m_Layout
    // Size: 0x10
    // Offset: 0x58
    ::UnityEngine::InputSystem::Utilities::InternedString m_Layout;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
    // UnityEngine.InputSystem.Utilities.InternedString m_Variants
    // Size: 0x10
    // Offset: 0x68
    ::UnityEngine::InputSystem::Utilities::InternedString m_Variants;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
    // UnityEngine.InputSystem.InputDevice m_Device
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::InputSystem::InputDevice* m_Device;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputDevice*) == 0x8);
    // UnityEngine.InputSystem.InputControl m_Parent
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::InputSystem::InputControl* m_Parent;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputControl*) == 0x8);
    // System.Int32 m_UsageCount
    // Size: 0x4
    // Offset: 0x88
    int m_UsageCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_UsageStartIndex
    // Size: 0x4
    // Offset: 0x8C
    int m_UsageStartIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_AliasCount
    // Size: 0x4
    // Offset: 0x90
    int m_AliasCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_AliasStartIndex
    // Size: 0x4
    // Offset: 0x94
    int m_AliasStartIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_ChildCount
    // Size: 0x4
    // Offset: 0x98
    int m_ChildCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_ChildStartIndex
    // Size: 0x4
    // Offset: 0x9C
    int m_ChildStartIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.InputControl/UnityEngine.InputSystem.ControlFlags m_ControlFlags
    // Size: 0x4
    // Offset: 0xA0
    ::UnityEngine::InputSystem::InputControl::ControlFlags m_ControlFlags;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputControl::ControlFlags) == 0x4);
    // Padding between fields: m_ControlFlags and: m_DefaultState
    char __padding17[0x4] = {};
    // UnityEngine.InputSystem.Utilities.PrimitiveValue m_DefaultState
    // Size: 0xC
    // Offset: 0xA8
    ::UnityEngine::InputSystem::Utilities::PrimitiveValue m_DefaultState;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::PrimitiveValue) == 0xC);
    // Padding between fields: m_DefaultState and: m_MinValue
    char __padding18[0x4] = {};
    // UnityEngine.InputSystem.Utilities.PrimitiveValue m_MinValue
    // Size: 0xC
    // Offset: 0xB8
    ::UnityEngine::InputSystem::Utilities::PrimitiveValue m_MinValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::PrimitiveValue) == 0xC);
    // Padding between fields: m_MinValue and: m_MaxValue
    char __padding19[0x4] = {};
    // UnityEngine.InputSystem.Utilities.PrimitiveValue m_MaxValue
    // Size: 0xC
    // Offset: 0xC8
    ::UnityEngine::InputSystem::Utilities::PrimitiveValue m_MaxValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::PrimitiveValue) == 0xC);
    public:
    // Get instance field reference: protected internal UnityEngine.InputSystem.LowLevel.InputStateBlock m_StateBlock
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::LowLevel::InputStateBlock& dyn_m_StateBlock();
    // Get instance field reference: UnityEngine.InputSystem.Utilities.InternedString m_Name
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::InternedString& dyn_m_Name();
    // Get instance field reference: System.String m_Path
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_Path();
    // Get instance field reference: System.String m_DisplayName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_DisplayName();
