// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.InputSystem.InputActionType
#include "UnityEngine/InputSystem/InputActionType.hpp"
// Including type: UnityEngine.InputSystem.InputBinding
#include "UnityEngine/InputSystem/InputBinding.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
// Including type: UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext
#include "UnityEngine/InputSystem/InputAction_CallbackContext.hpp"
// Including type: UnityEngine.InputSystem.InputActionState
#include "UnityEngine/InputSystem/InputActionState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionMap
  class InputActionMap;
  // Forward declaring type: InputControl
  class InputControl;
  // Forward declaring type: InputActionPhase
  struct InputActionPhase;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Guid
  struct Guid;
  // Skipping declaration: ValueType because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputAction
  class InputAction;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputAction);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputAction*, "UnityEngine.InputSystem", "InputAction");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.InputAction
  // [TokenAttribute] Offset: FFFFFFFF
  class InputAction : public ::Il2CppObject/*, public ::System::ICloneable, public ::System::IDisposable*/ {
    public:
    public:
    // [TooltipAttribute] Offset: 0x95A544
    // System.String m_Name
    // Size: 0x8
    // Offset: 0x10
    ::StringW m_Name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // UnityEngine.InputSystem.InputActionType m_Type
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::InputSystem::InputActionType m_Type;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionType) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x95A5A0
    // [TooltipAttribute] Offset: 0x95A5A0
    // System.String m_ExpectedControlType
    // Size: 0x8
    // Offset: 0x20
    ::StringW m_ExpectedControlType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [TooltipAttribute] Offset: 0x95A610
    // System.String m_Id
    // Size: 0x8
    // Offset: 0x28
    ::StringW m_Id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_Processors
    // Size: 0x8
    // Offset: 0x30
    ::StringW m_Processors;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_Interactions
    // Size: 0x8
    // Offset: 0x38
    ::StringW m_Interactions;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // UnityEngine.InputSystem.InputBinding[] m_SingletonActionBindings
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::InputSystem::InputBinding> m_SingletonActionBindings;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputBinding>) == 0x8);
    // System.Nullable`1<UnityEngine.InputSystem.InputBinding> m_BindingMask
    // Size: 0xFFFFFFFF
    // Offset: 0x48
    ::System::Nullable_1<::UnityEngine::InputSystem::InputBinding> m_BindingMask;
    // System.Int32 m_BindingsStartIndex
    // Size: 0x4
    // Offset: 0xA8
    int m_BindingsStartIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_BindingsCount
    // Size: 0x4
    // Offset: 0xAC
    int m_BindingsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_ControlStartIndex
    // Size: 0x4
    // Offset: 0xB0
    int m_ControlStartIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_ControlCount
    // Size: 0x4
    // Offset: 0xB4
    int m_ControlCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_ActionIndexInState
    // Size: 0x4
    // Offset: 0xB8
    int m_ActionIndexInState;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.InputActionMap m_ActionMap
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::InputSystem::InputActionMap* m_ActionMap;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionMap*) == 0x8);
    // UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext>> m_OnStarted
    // Size: 0xFFFFFFFF
    // Offset: 0xC8
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*> m_OnStarted;
    // UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext>> m_OnCanceled
    // Size: 0xFFFFFFFF
    // Offset: 0xE0
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*> m_OnCanceled;
    // UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext>> m_OnPerformed
    // Size: 0xFFFFFFFF
    // Offset: 0xF8
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*> m_OnPerformed;
    public:
    // Creating interface conversion operator: operator ::System::ICloneable
    operator ::System::ICloneable() noexcept {
      return *reinterpret_cast<::System::ICloneable*>(this);
    }
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: System.String m_Name
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_Name();
    // Get instance field reference: UnityEngine.InputSystem.InputActionType m_Type
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionType& dyn_m_Type();
    // Get instance field reference: System.String m_ExpectedControlType
