// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Skipping declaration: UpdateMode because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputSettings
  class InputSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputSettings);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputSettings*, "UnityEngine.InputSystem", "InputSettings");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.InputSettings
  // [TokenAttribute] Offset: FFFFFFFF
  class InputSettings : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputSettings::UpdateMode
    struct UpdateMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateMode
      constexpr UpdateMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode ProcessEventsInDynamicUpdate
      static constexpr const int ProcessEventsInDynamicUpdate = 1;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode ProcessEventsInDynamicUpdate
      static ::UnityEngine::InputSystem::InputSettings::UpdateMode _get_ProcessEventsInDynamicUpdate();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode ProcessEventsInDynamicUpdate
      static void _set_ProcessEventsInDynamicUpdate(::UnityEngine::InputSystem::InputSettings::UpdateMode value);
      // static field const value: static public UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode ProcessEventsInFixedUpdate
      static constexpr const int ProcessEventsInFixedUpdate = 2;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode ProcessEventsInFixedUpdate
      static ::UnityEngine::InputSystem::InputSettings::UpdateMode _get_ProcessEventsInFixedUpdate();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode ProcessEventsInFixedUpdate
      static void _set_ProcessEventsInFixedUpdate(::UnityEngine::InputSystem::InputSettings::UpdateMode value);
      // static field const value: static public UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode ProcessEventsManually
      static constexpr const int ProcessEventsManually = 3;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode ProcessEventsManually
      static ::UnityEngine::InputSystem::InputSettings::UpdateMode _get_ProcessEventsManually();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode ProcessEventsManually
      static void _set_ProcessEventsManually(::UnityEngine::InputSystem::InputSettings::UpdateMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode
    #pragma pack(pop)
    static check_size<sizeof(InputSettings::UpdateMode), 0 + sizeof(int)> __UnityEngine_InputSystem_InputSettings_UpdateModeSizeCheck;
    static_assert(sizeof(InputSettings::UpdateMode) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0x95AD3C
    // private System.String[] m_SupportedDevices
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::StringW> m_SupportedDevices;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [TooltipAttribute] Offset: 0x95AD88
    // private UnityEngine.InputSystem.InputSettings/UnityEngine.InputSystem.UpdateMode m_UpdateMode
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::InputSystem::InputSettings::UpdateMode m_UpdateMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputSettings::UpdateMode) == 0x4);
    // private System.Boolean m_CompensateForScreenOrientation
    // Size: 0x1
    // Offset: 0x24
    bool m_CompensateForScreenOrientation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_FilterNoiseOnCurrent
    // Size: 0x1
    // Offset: 0x25
    bool m_FilterNoiseOnCurrent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_FilterNoiseOnCurrent and: m_DefaultDeadzoneMin
    char __padding3[0x2] = {};
    // private System.Single m_DefaultDeadzoneMin
    // Size: 0x4
    // Offset: 0x28
    float m_DefaultDeadzoneMin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultDeadzoneMax
    // Size: 0x4
    // Offset: 0x2C
    float m_DefaultDeadzoneMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultButtonPressPoint
    // Size: 0x4
    // Offset: 0x30
    float m_DefaultButtonPressPoint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultTapTime
    // Size: 0x4
    // Offset: 0x34
    float m_DefaultTapTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultSlowTapTime
    // Size: 0x4
    // Offset: 0x38
    float m_DefaultSlowTapTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultHoldTime
    // Size: 0x4
    // Offset: 0x3C
    float m_DefaultHoldTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TapRadius
    // Size: 0x4
    // Offset: 0x40
    float m_TapRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MultiTapDelayTime
    // Size: 0x4
    // Offset: 0x44
    float m_MultiTapDelayTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static System.Int32 s_OldUnsupportedFixedAndDynamicUpdateSetting
    static constexpr const int s_OldUnsupportedFixedAndDynamicUpdateSetting = 0;
    // Get static field: static System.Int32 s_OldUnsupportedFixedAndDynamicUpdateSetting
    static int _get_s_OldUnsupportedFixedAndDynamicUpdateSetting();
    // Set static field: static System.Int32 s_OldUnsupportedFixedAndDynamicUpdateSetting
    static void _set_s_OldUnsupportedFixedAndDynamicUpdateSetting(int value);
    // Get instance field reference: private System.String[] m_SupportedDevices
    [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_m_SupportedDevices();
