// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.InputActionRebindingExtensions
#include "UnityEngine/InputSystem/InputActionRebindingExtensions.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: UnityEngine.InputSystem.InputBinding
#include "UnityEngine/InputSystem/InputBinding.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InternedString
#include "UnityEngine/InputSystem/Utilities/InternedString.hpp"
// Including type: UnityEngine.InputSystem.InputControlList`1
#include "UnityEngine/InputSystem/InputControlList_1.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputEventPtr
#include "UnityEngine/InputSystem/LowLevel/InputEventPtr.hpp"
// Including type: UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Cache
#include "UnityEngine/InputSystem/Layouts/InputControlLayout.hpp"
// Including type: System.Single
#include "System/Single.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputAction
  class InputAction;
  // Forward declaring type: InputControl
  class InputControl;
  // Forward declaring type: InputDevice
  class InputDevice;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Func`3<T1, T2, TResult>
  template<typename T1, typename T2, typename TResult>
  class Func_3;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation*, "UnityEngine.InputSystem", "InputActionRebindingExtensions/RebindingOperation");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation
  // [TokenAttribute] Offset: FFFFFFFF
  class InputActionRebindingExtensions::RebindingOperation : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags
    struct Flags;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct Flags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Flags
      constexpr Flags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags Started
      static constexpr const int Started = 1;
      // Get static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags Started
      static ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags _get_Started();
      // Set static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags Started
      static void _set_Started(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags Completed
      static constexpr const int Completed = 2;
      // Get static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags Completed
      static ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags _get_Completed();
      // Set static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags Completed
      static void _set_Completed(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags Canceled
      static constexpr const int Canceled = 4;
      // Get static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags Canceled
      static ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags _get_Canceled();
      // Set static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags Canceled
      static void _set_Canceled(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags OnEventHooked
      static constexpr const int OnEventHooked = 8;
      // Get static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags OnEventHooked
      static ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags _get_OnEventHooked();
      // Set static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags OnEventHooked
      static void _set_OnEventHooked(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags OnAfterUpdateHooked
      static constexpr const int OnAfterUpdateHooked = 16;
      // Get static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags OnAfterUpdateHooked
      static ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags _get_OnAfterUpdateHooked();
      // Set static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags OnAfterUpdateHooked
      static void _set_OnAfterUpdateHooked(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags DontIgnoreNoisyControls
      static constexpr const int DontIgnoreNoisyControls = 64;
      // Get static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags DontIgnoreNoisyControls
      static ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags _get_DontIgnoreNoisyControls();
      // Set static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags DontIgnoreNoisyControls
      static void _set_DontIgnoreNoisyControls(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags DontGeneralizePathOfSelectedControl
      static constexpr const int DontGeneralizePathOfSelectedControl = 128;
      // Get static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags DontGeneralizePathOfSelectedControl
      static ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags _get_DontGeneralizePathOfSelectedControl();
      // Set static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags DontGeneralizePathOfSelectedControl
      static void _set_DontGeneralizePathOfSelectedControl(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags AddNewBinding
      static constexpr const int AddNewBinding = 256;
      // Get static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags AddNewBinding
      static ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags _get_AddNewBinding();
      // Set static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags AddNewBinding
      static void _set_AddNewBinding(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags SuppressMatchingEvents
      static constexpr const int SuppressMatchingEvents = 512;
      // Get static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags SuppressMatchingEvents
      static ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags _get_SuppressMatchingEvents();
      // Set static field: static public UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags SuppressMatchingEvents
      static void _set_SuppressMatchingEvents(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags
    #pragma pack(pop)
    static check_size<sizeof(InputActionRebindingExtensions::RebindingOperation::Flags), 0 + sizeof(int)> __UnityEngine_InputSystem_InputActionRebindingExtensions_RebindingOperation_FlagsSizeCheck;
    static_assert(sizeof(InputActionRebindingExtensions::RebindingOperation::Flags) == 0x4);
    public:
    // private UnityEngine.InputSystem.InputAction m_ActionToRebind
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::InputSystem::InputAction* m_ActionToRebind;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputAction*) == 0x8);
    // private System.Nullable`1<UnityEngine.InputSystem.InputBinding> m_BindingMask
    // Size: 0xFFFFFFFF
    // Offset: 0x18
    ::System::Nullable_1<::UnityEngine::InputSystem::InputBinding> m_BindingMask;
    // private System.Type m_ControlType
    // Size: 0x8
    // Offset: 0x78
    ::System::Type* m_ControlType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private UnityEngine.InputSystem.Utilities.InternedString m_ExpectedLayout
    // Size: 0x10
    // Offset: 0x80
    ::UnityEngine::InputSystem::Utilities::InternedString m_ExpectedLayout;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
    // private System.Int32 m_IncludePathCount
    // Size: 0x4
    // Offset: 0x90
    int m_IncludePathCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String[] m_IncludePaths
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::StringW> m_IncludePaths;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.Int32 m_ExcludePathCount
    // Size: 0x4
    // Offset: 0xA0
    int m_ExcludePathCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String[] m_ExcludePaths
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::StringW> m_ExcludePaths;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.Int32 m_TargetBindingIndex
    // Size: 0x4
    // Offset: 0xB0
    int m_TargetBindingIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String m_BindingGroupForNewBinding
    // Size: 0x8
    // Offset: 0xB8
    ::StringW m_BindingGroupForNewBinding;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_CancelBinding
    // Size: 0x8
    // Offset: 0xC0
    ::StringW m_CancelBinding;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single m_MagnitudeThreshold
    // Size: 0x4
    // Offset: 0xC8
    float m_MagnitudeThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single[] m_Scores
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<float> m_Scores;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single[] m_Magnitudes
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<float> m_Magnitudes;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Double m_LastMatchTime
    // Size: 0x8
    // Offset: 0xE0
    double m_LastMatchTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double m_StartTime
    // Size: 0x8
    // Offset: 0xE8
    double m_StartTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Single m_Timeout
    // Size: 0x4
    // Offset: 0xF0
    float m_Timeout;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_WaitSecondsAfterMatch
    // Size: 0x4
    // Offset: 0xF4
    float m_WaitSecondsAfterMatch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.InputSystem.InputControlList`1<UnityEngine.InputSystem.InputControl> m_Candidates
    // Size: 0xFFFFFFFF
    // Offset: 0xF8
    ::UnityEngine::InputSystem::InputControlList_1<::UnityEngine::InputSystem::InputControl*> m_Candidates;
    // private System.Action`1<UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation> m_OnComplete
    // Size: 0x8
    // Offset: 0x118
    ::System::Action_1<::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation*>* m_OnComplete;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation*>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation> m_OnCancel
    // Size: 0x8
    // Offset: 0x120
    ::System::Action_1<::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation*>* m_OnCancel;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation*>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation> m_OnPotentialMatch
    // Size: 0x8
    // Offset: 0x128
    ::System::Action_1<::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation*>* m_OnPotentialMatch;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation*>*) == 0x8);
    // private System.Func`2<UnityEngine.InputSystem.InputControl,System.String> m_OnGeneratePath
    // Size: 0x8
    // Offset: 0x130
    ::System::Func_2<::UnityEngine::InputSystem::InputControl*, ::StringW>* m_OnGeneratePath;
    // Field size check
    static_assert(sizeof(::System::Func_2<::UnityEngine::InputSystem::InputControl*, ::StringW>*) == 0x8);
    // private System.Func`3<UnityEngine.InputSystem.InputControl,UnityEngine.InputSystem.LowLevel.InputEventPtr,System.Single> m_OnComputeScore
    // Size: 0x8
    // Offset: 0x138
    ::System::Func_3<::UnityEngine::InputSystem::InputControl*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr, float>* m_OnComputeScore;
    // Field size check
    static_assert(sizeof(::System::Func_3<::UnityEngine::InputSystem::InputControl*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr, float>*) == 0x8);
    // private System.Action`2<UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation,System.String> m_OnApplyBinding
    // Size: 0x8
    // Offset: 0x140
    ::System::Action_2<::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation*, ::StringW>* m_OnApplyBinding;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation*, ::StringW>*) == 0x8);
    // private System.Action`2<UnityEngine.InputSystem.LowLevel.InputEventPtr,UnityEngine.InputSystem.InputDevice> m_OnEventDelegate
    // Size: 0x8
    // Offset: 0x148
    ::System::Action_2<::UnityEngine::InputSystem::LowLevel::InputEventPtr, ::UnityEngine::InputSystem::InputDevice*>* m_OnEventDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::InputSystem::LowLevel::InputEventPtr, ::UnityEngine::InputSystem::InputDevice*>*) == 0x8);
    // private System.Action m_OnAfterUpdateDelegate
    // Size: 0x8
    // Offset: 0x150
    ::System::Action* m_OnAfterUpdateDelegate;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Cache m_LayoutCache
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::InputSystem::Layouts::InputControlLayout::Cache m_LayoutCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Layouts::InputControlLayout::Cache) == 0x8);
    // private System.Text.StringBuilder m_PathBuilder
    // Size: 0x8
    // Offset: 0x160
    ::System::Text::StringBuilder* m_PathBuilder;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private UnityEngine.InputSystem.InputActionRebindingExtensions/UnityEngine.InputSystem.RebindingOperation/UnityEngine.InputSystem.Flags m_Flags
    // Size: 0x4
    // Offset: 0x168
    ::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags m_Flags;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionRebindingExtensions::RebindingOperation::Flags) == 0x4);
    // private System.Int32 m_StartingActuationsCount
    // Size: 0x4
    // Offset: 0x16C
    int m_StartingActuationsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single[] m_StaringActuationMagnitudes
    // Size: 0x8
    // Offset: 0x170
    ::ArrayW<float> m_StaringActuationMagnitudes;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private UnityEngine.InputSystem.InputControl[] m_StartingActuationControls
    // Size: 0x8
    // Offset: 0x178
    ::ArrayW<::UnityEngine::InputSystem::InputControl*> m_StartingActuationControls;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputControl*>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // static field const value: static public System.Single kDefaultMagnitudeThreshold
    static constexpr const float kDefaultMagnitudeThreshold = 0.2;
    // Get static field: static public System.Single kDefaultMagnitudeThreshold
    static float _get_kDefaultMagnitudeThreshold();
    // Set static field: static public System.Single kDefaultMagnitudeThreshold
    static void _set_kDefaultMagnitudeThreshold(float value);
    // Get instance field reference: private UnityEngine.InputSystem.InputAction m_ActionToRebind
