// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Collection
#include "UnityEngine/InputSystem/Layouts/InputControlLayout.hpp"
// Including type: UnityEngine.InputSystem.Utilities.TypeTable
#include "UnityEngine/InputSystem/Utilities/TypeTable.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputUpdateType
#include "UnityEngine/InputSystem/LowLevel/InputUpdateType.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputStateBuffers
#include "UnityEngine/InputSystem/LowLevel/InputStateBuffers.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
// Including type: UnityEngine.InputSystem.InputDeviceChange
#include "UnityEngine/InputSystem/InputDeviceChange.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputEventPtr
#include "UnityEngine/InputSystem/LowLevel/InputEventPtr.hpp"
// Including type: UnityEngine.InputSystem.InputControlLayoutChange
#include "UnityEngine/InputSystem/InputControlLayoutChange.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputMetrics
#include "UnityEngine/InputSystem/LowLevel/InputMetrics.hpp"

  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Skipping declaration: StateChangeMonitorListener because it is already included!
  // Forward declaring type: InputSettings
  class InputSettings;
  // Skipping declaration: InputControl because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Skipping declaration: IEnumerable`1 because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::Layouts
namespace UnityEngine::InputSystem::Layouts {
  // Forward declaring type: InputDeviceFindControlLayoutDelegate
  class InputDeviceFindControlLayoutDelegate;
  // Skipping declaration: InputControlLayout because it is already included!
  // Skipping declaration: InputDeviceMatcher because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: InputDeviceCommandDelegate
  class InputDeviceCommandDelegate;
  // Forward declaring type: InputDeviceExecuteCommandDelegate
  class InputDeviceExecuteCommandDelegate;
  // Forward declaring type: IInputRuntime
  class IInputRuntime;
  // Forward declaring type: IInputStateChangeMonitor
  class IInputStateChangeMonitor;
  // Forward declaring type: IInputEventTypeInfo
  class IInputEventTypeInfo;
  // Forward declaring type: InputEventBuffer
  struct InputEventBuffer;
  // Forward declaring type: InputEvent
  struct InputEvent;
  // Skipping declaration: InputStateBlock because it is already included!
  // Forward declaring type: InputDeviceCommand
  struct InputDeviceCommand;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputManager
  class InputManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputManager);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputManager*, "UnityEngine.InputSystem", "InputManager");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.InputManager
  // [TokenAttribute] Offset: FFFFFFFF
  class InputManager : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputManager::AvailableDevice
    struct AvailableDevice;
    // Nested type: ::UnityEngine::InputSystem::InputManager::StateChangeMonitorListener
    struct StateChangeMonitorListener;
    // Nested type: ::UnityEngine::InputSystem::InputManager::StateChangeMonitorsForDevice
    struct StateChangeMonitorsForDevice;
    // Nested type: ::UnityEngine::InputSystem::InputManager::StateChangeMonitorTimeout
    struct StateChangeMonitorTimeout;
    // Nested type: ::UnityEngine::InputSystem::InputManager::$ListControlLayouts$d__68
    class $ListControlLayouts$d__68;
    // Nested type: ::UnityEngine::InputSystem::InputManager::$$c
    class $$c;
    // Size: 0x3E
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.AvailableDevice
    // [TokenAttribute] Offset: FFFFFFFF
    struct AvailableDevice/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.InputSystem.Layouts.InputDeviceDescription description
      // Size: 0x38
      // Offset: 0x0
      ::UnityEngine::InputSystem::Layouts::InputDeviceDescription description;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Layouts::InputDeviceDescription) == 0x38);
      // public System.Int32 deviceId
      // Size: 0x4
      // Offset: 0x38
      int deviceId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Boolean isNative
      // Size: 0x1
      // Offset: 0x3C
      bool isNative;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean isRemoved
      // Size: 0x1
      // Offset: 0x3D
      bool isRemoved;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: AvailableDevice
      constexpr AvailableDevice(::UnityEngine::InputSystem::Layouts::InputDeviceDescription description_ = {}, int deviceId_ = {}, bool isNative_ = {}, bool isRemoved_ = {}) noexcept : description{description_}, deviceId{deviceId_}, isNative{isNative_}, isRemoved{isRemoved_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.InputSystem.Layouts.InputDeviceDescription description
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Layouts::InputDeviceDescription& dyn_description();
      // Get instance field reference: public System.Int32 deviceId
      [[deprecated("Use field access instead!")]] int& dyn_deviceId();
      // Get instance field reference: public System.Boolean isNative
      [[deprecated("Use field access instead!")]] bool& dyn_isNative();
      // Get instance field reference: public System.Boolean isRemoved
      [[deprecated("Use field access instead!")]] bool& dyn_isRemoved();
    }; // UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.AvailableDevice
    #pragma pack(pop)
    static check_size<sizeof(InputManager::AvailableDevice), 61 + sizeof(bool)> __UnityEngine_InputSystem_InputManager_AvailableDeviceSizeCheck;
    static_assert(sizeof(InputManager::AvailableDevice) == 0x3E);
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorListener
    // [TokenAttribute] Offset: FFFFFFFF
    struct StateChangeMonitorListener/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.InputSystem.InputControl control
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::InputSystem::InputControl* control;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::InputControl*) == 0x8);
      // public UnityEngine.InputSystem.LowLevel.IInputStateChangeMonitor monitor
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor* monitor;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor*) == 0x8);
      // public System.Int64 monitorIndex
      // Size: 0x8
      // Offset: 0x10
      int64_t monitorIndex;
      // Field size check
      static_assert(sizeof(int64_t) == 0x8);
      public:
      // Creating value type constructor for type: StateChangeMonitorListener
      constexpr StateChangeMonitorListener(::UnityEngine::InputSystem::InputControl* control_ = {}, ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor* monitor_ = {}, int64_t monitorIndex_ = {}) noexcept : control{control_}, monitor{monitor_}, monitorIndex{monitorIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.InputSystem.InputControl control
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputControl*& dyn_control();
      // Get instance field reference: public UnityEngine.InputSystem.LowLevel.IInputStateChangeMonitor monitor
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor*& dyn_monitor();
      // Get instance field reference: public System.Int64 monitorIndex
      [[deprecated("Use field access instead!")]] int64_t& dyn_monitorIndex();
    }; // UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorListener
    #pragma pack(pop)
    static check_size<sizeof(InputManager::StateChangeMonitorListener), 16 + sizeof(int64_t)> __UnityEngine_InputSystem_InputManager_StateChangeMonitorListenerSizeCheck;
    static_assert(sizeof(InputManager::StateChangeMonitorListener) == 0x18);
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorsForDevice
    // [TokenAttribute] Offset: FFFFFFFF
    struct StateChangeMonitorsForDevice/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.InputSystem.Utilities.MemoryHelpers/UnityEngine.InputSystem.Utilities.BitRegion[] memoryRegions
      // Size: 0x8
      // Offset: 0x0
      ::ArrayW<::UnityEngine::InputSystem::Utilities::MemoryHelpers::BitRegion> memoryRegions;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::Utilities::MemoryHelpers::BitRegion>) == 0x8);
      // public UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorListener[] listeners
      // Size: 0x8
      // Offset: 0x8
      ::ArrayW<::UnityEngine::InputSystem::InputManager::StateChangeMonitorListener> listeners;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputManager::StateChangeMonitorListener>) == 0x8);
      // public UnityEngine.InputSystem.DynamicBitfield signalled
      // Size: 0xFFFFFFFF
      // Offset: 0x10
      ::UnityEngine::InputSystem::DynamicBitfield signalled;
      public:
      // Creating value type constructor for type: StateChangeMonitorsForDevice
      constexpr StateChangeMonitorsForDevice(::ArrayW<::UnityEngine::InputSystem::Utilities::MemoryHelpers::BitRegion> memoryRegions_ = ::ArrayW<::UnityEngine::InputSystem::Utilities::MemoryHelpers::BitRegion>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::InputSystem::InputManager::StateChangeMonitorListener> listeners_ = ::ArrayW<::UnityEngine::InputSystem::InputManager::StateChangeMonitorListener>(static_cast<void*>(nullptr)), ::UnityEngine::InputSystem::DynamicBitfield signalled_ = {}) noexcept : memoryRegions{memoryRegions_}, listeners{listeners_}, signalled{signalled_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.InputSystem.Utilities.MemoryHelpers/UnityEngine.InputSystem.Utilities.BitRegion[] memoryRegions
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::Utilities::MemoryHelpers::BitRegion>& dyn_memoryRegions();
      // Get instance field reference: public UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorListener[] listeners
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::InputManager::StateChangeMonitorListener>& dyn_listeners();
      // Get instance field reference: public UnityEngine.InputSystem.DynamicBitfield signalled
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::DynamicBitfield& dyn_signalled();
      // public System.Int32 get_count()
      // Offset: 0xA42088
      int get_count();
      // public System.Void Add(UnityEngine.InputSystem.InputControl control, UnityEngine.InputSystem.LowLevel.IInputStateChangeMonitor monitor, System.Int64 monitorIndex)
      // Offset: 0xA42090
      void Add(::UnityEngine::InputSystem::InputControl* control, ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor* monitor, int64_t monitorIndex);
      // public System.Void Remove(UnityEngine.InputSystem.LowLevel.IInputStateChangeMonitor monitor, System.Int64 monitorIndex)
      // Offset: 0xA42098
      void Remove(::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor* monitor, int64_t monitorIndex);
      // public System.Void Clear()
      // Offset: 0xA420A0
      void Clear();
    }; // UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorsForDevice
    // WARNING Not writing size check since size may be invalid!
    // Size: 0x24
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorTimeout
    // [TokenAttribute] Offset: FFFFFFFF
    struct StateChangeMonitorTimeout/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.InputSystem.InputControl control
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::InputSystem::InputControl* control;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::InputControl*) == 0x8);
      // public System.Double time
      // Size: 0x8
      // Offset: 0x8
      double time;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      // public UnityEngine.InputSystem.LowLevel.IInputStateChangeMonitor monitor
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor* monitor;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor*) == 0x8);
      // public System.Int64 monitorIndex
      // Size: 0x8
      // Offset: 0x18
      int64_t monitorIndex;
      // Field size check
      static_assert(sizeof(int64_t) == 0x8);
      // public System.Int32 timerIndex
      // Size: 0x4
      // Offset: 0x20
      int timerIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StateChangeMonitorTimeout
      constexpr StateChangeMonitorTimeout(::UnityEngine::InputSystem::InputControl* control_ = {}, double time_ = {}, ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor* monitor_ = {}, int64_t monitorIndex_ = {}, int timerIndex_ = {}) noexcept : control{control_}, time{time_}, monitor{monitor_}, monitorIndex{monitorIndex_}, timerIndex{timerIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.InputSystem.InputControl control
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputControl*& dyn_control();
      // Get instance field reference: public System.Double time
      [[deprecated("Use field access instead!")]] double& dyn_time();
      // Get instance field reference: public UnityEngine.InputSystem.LowLevel.IInputStateChangeMonitor monitor
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor*& dyn_monitor();
      // Get instance field reference: public System.Int64 monitorIndex
      [[deprecated("Use field access instead!")]] int64_t& dyn_monitorIndex();
      // Get instance field reference: public System.Int32 timerIndex
      [[deprecated("Use field access instead!")]] int& dyn_timerIndex();
    }; // UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorTimeout
    #pragma pack(pop)
    static check_size<sizeof(InputManager::StateChangeMonitorTimeout), 32 + sizeof(int)> __UnityEngine_InputSystem_InputManager_StateChangeMonitorTimeoutSizeCheck;
    static_assert(sizeof(InputManager::StateChangeMonitorTimeout) == 0x24);
    public:
    // System.Int32 m_LayoutRegistrationVersion
    // Size: 0x4
    // Offset: 0x10
    int m_LayoutRegistrationVersion;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_PollingFrequency
    // Size: 0x4
    // Offset: 0x14
    float m_PollingFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Collection m_Layouts
    // Size: 0x38
    // Offset: 0x18
    ::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection m_Layouts;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection) == 0x38);
    // private UnityEngine.InputSystem.Utilities.TypeTable m_Processors
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::InputSystem::Utilities::TypeTable m_Processors;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::TypeTable) == 0x8);
    // private UnityEngine.InputSystem.Utilities.TypeTable m_Interactions
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::InputSystem::Utilities::TypeTable m_Interactions;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::TypeTable) == 0x8);
    // private UnityEngine.InputSystem.Utilities.TypeTable m_Composites
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::InputSystem::Utilities::TypeTable m_Composites;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::TypeTable) == 0x8);
    // private System.Int32 m_DevicesCount
    // Size: 0x4
    // Offset: 0x68
    int m_DevicesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.InputSystem.InputDevice[] m_Devices
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::InputSystem::InputDevice*> m_Devices;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputDevice*>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,UnityEngine.InputSystem.InputDevice> m_DevicesById
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::InputSystem::InputDevice*>* m_DevicesById;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::InputSystem::InputDevice*>*) == 0x8);
    // System.Int32 m_AvailableDeviceCount
    // Size: 0x4
    // Offset: 0x80
    int m_AvailableDeviceCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.AvailableDevice[] m_AvailableDevices
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::InputSystem::InputManager::AvailableDevice> m_AvailableDevices;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputManager::AvailableDevice>) == 0x8);
    // System.Int32 m_DisconnectedDevicesCount
    // Size: 0x4
    // Offset: 0x90
    int m_DisconnectedDevicesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.InputDevice[] m_DisconnectedDevices
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::UnityEngine::InputSystem::InputDevice*> m_DisconnectedDevices;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputDevice*>) == 0x8);
    // private UnityEngine.InputSystem.LowLevel.InputUpdateType m_UpdateMask
    // Size: 0x4
    // Offset: 0xA0
    ::UnityEngine::InputSystem::LowLevel::InputUpdateType m_UpdateMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputUpdateType) == 0x4);
    // UnityEngine.InputSystem.LowLevel.InputStateBuffers m_StateBuffers
    // Size: 0x28
    // Offset: 0xA8
    ::UnityEngine::InputSystem::LowLevel::InputStateBuffers m_StateBuffers;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputStateBuffers) == 0x28);
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`2<UnityEngine.InputSystem.InputDevice,UnityEngine.InputSystem.InputDeviceChange>> m_DeviceChangeListeners
    // Size: 0xFFFFFFFF
    // Offset: 0xD0
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_2<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::InputDeviceChange>*> m_DeviceChangeListeners;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`2<UnityEngine.InputSystem.InputDevice,UnityEngine.InputSystem.LowLevel.InputEventPtr>> m_DeviceStateChangeListeners
    // Size: 0xFFFFFFFF
    // Offset: 0xE8
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_2<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr>*> m_DeviceStateChangeListeners;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.Layouts.InputDeviceFindControlLayoutDelegate> m_DeviceFindLayoutCallbacks
    // Size: 0xFFFFFFFF
    // Offset: 0x100
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::Layouts::InputDeviceFindControlLayoutDelegate*> m_DeviceFindLayoutCallbacks;
    // UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.LowLevel.InputDeviceCommandDelegate> m_DeviceCommandCallbacks
    // Size: 0xFFFFFFFF
    // Offset: 0x118
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::LowLevel::InputDeviceCommandDelegate*> m_DeviceCommandCallbacks;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`2<System.String,UnityEngine.InputSystem.InputControlLayoutChange>> m_LayoutChangeListeners
    // Size: 0xFFFFFFFF
    // Offset: 0x130
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_2<::StringW, ::UnityEngine::InputSystem::InputControlLayoutChange>*> m_LayoutChangeListeners;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`2<UnityEngine.InputSystem.LowLevel.InputEventPtr,UnityEngine.InputSystem.InputDevice>> m_EventListeners
    // Size: 0xFFFFFFFF
    // Offset: 0x148
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_2<::UnityEngine::InputSystem::LowLevel::InputEventPtr, ::UnityEngine::InputSystem::InputDevice*>*> m_EventListeners;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action> m_BeforeUpdateListeners
    // Size: 0xFFFFFFFF
    // Offset: 0x160
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action*> m_BeforeUpdateListeners;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action> m_AfterUpdateListeners
    // Size: 0xFFFFFFFF
    // Offset: 0x178
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action*> m_AfterUpdateListeners;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action> m_SettingsChangedListeners
    // Size: 0xFFFFFFFF
    // Offset: 0x190
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action*> m_SettingsChangedListeners;
    // private System.Boolean m_NativeBeforeUpdateHooked
    // Size: 0x1
    // Offset: 0x1A8
    bool m_NativeBeforeUpdateHooked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HaveDevicesWithStateCallbackReceivers
    // Size: 0x1
    // Offset: 0x1A9
    bool m_HaveDevicesWithStateCallbackReceivers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HasFocus
    // Size: 0x1
    // Offset: 0x1AA
    bool m_HasFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.InputSystem.LowLevel.InputDeviceExecuteCommandDelegate m_DeviceFindExecuteCommandDelegate
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::InputSystem::LowLevel::InputDeviceExecuteCommandDelegate* m_DeviceFindExecuteCommandDelegate;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputDeviceExecuteCommandDelegate*) == 0x8);
    // private System.Int32 m_DeviceFindExecuteCommandDeviceId
    // Size: 0x4
    // Offset: 0x1B8
    int m_DeviceFindExecuteCommandDeviceId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.LowLevel.IInputRuntime m_Runtime
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::InputSystem::LowLevel::IInputRuntime* m_Runtime;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::IInputRuntime*) == 0x8);
    // UnityEngine.InputSystem.LowLevel.InputMetrics m_Metrics
    // Size: 0x38
    // Offset: 0x1C8
    ::UnityEngine::InputSystem::LowLevel::InputMetrics m_Metrics;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputMetrics) == 0x38);
    // UnityEngine.InputSystem.InputSettings m_Settings
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::InputSystem::InputSettings* m_Settings;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputSettings*) == 0x8);
    // UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorsForDevice[] m_StateChangeMonitors
    // Size: 0x8
    // Offset: 0x208
    ::ArrayW<::UnityEngine::InputSystem::InputManager::StateChangeMonitorsForDevice> m_StateChangeMonitors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputManager::StateChangeMonitorsForDevice>) == 0x8);
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.InputManager/UnityEngine.InputSystem.StateChangeMonitorTimeout> m_StateChangeMonitorTimeouts
    // Size: 0xFFFFFFFF
    // Offset: 0x210
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::InputManager::StateChangeMonitorTimeout> m_StateChangeMonitorTimeouts;
    public:
    // Get instance field reference: System.Int32 m_LayoutRegistrationVersion
    [[deprecated("Use field access instead!")]] int& dyn_m_LayoutRegistrationVersion();
    // Get instance field reference: private System.Single m_PollingFrequency
    [[deprecated("Use field access instead!")]] float& dyn_m_PollingFrequency();
    // Get instance field reference: UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Collection m_Layouts
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection& dyn_m_Layouts();
    // Get instance field reference: private UnityEngine.InputSystem.Utilities.TypeTable m_Processors
