// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IEquatable`1
#include "System/IEquatable_1.hpp"
// Including type: System.Char
#include "System/Char.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputControl
  class InputControl;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Guid
  struct Guid;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputBinding
  struct InputBinding;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputBinding, "UnityEngine.InputSystem", "InputBinding");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0x58
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.InputBinding
  // [TokenAttribute] Offset: FFFFFFFF
  struct InputBinding/*, public ::System::ValueType, public ::System::IEquatable_1<::UnityEngine::InputSystem::InputBinding>*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputBinding::DisplayStringOptions
    struct DisplayStringOptions;
    // Nested type: ::UnityEngine::InputSystem::InputBinding::MatchOptions
    struct MatchOptions;
    // Nested type: ::UnityEngine::InputSystem::InputBinding::Flags
    struct Flags;
    // Nested type: ::UnityEngine::InputSystem::InputBinding::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct Flags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Flags
      constexpr Flags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags None
      static ::UnityEngine::InputSystem::InputBinding::Flags _get_None();
      // Set static field: static public UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags None
      static void _set_None(::UnityEngine::InputSystem::InputBinding::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags Composite
      static constexpr const int Composite = 4;
      // Get static field: static public UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags Composite
      static ::UnityEngine::InputSystem::InputBinding::Flags _get_Composite();
      // Set static field: static public UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags Composite
      static void _set_Composite(::UnityEngine::InputSystem::InputBinding::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags PartOfComposite
      static constexpr const int PartOfComposite = 8;
      // Get static field: static public UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags PartOfComposite
      static ::UnityEngine::InputSystem::InputBinding::Flags _get_PartOfComposite();
      // Set static field: static public UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags PartOfComposite
      static void _set_PartOfComposite(::UnityEngine::InputSystem::InputBinding::Flags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags
    #pragma pack(pop)
    static check_size<sizeof(InputBinding::Flags), 0 + sizeof(int)> __UnityEngine_InputSystem_InputBinding_FlagsSizeCheck;
    static_assert(sizeof(InputBinding::Flags) == 0x4);
    public:
    // private System.String m_Name
    // Size: 0x8
    // Offset: 0x0
    ::StringW m_Name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_Id
    // Size: 0x8
    // Offset: 0x8
    ::StringW m_Id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_Path
    // Size: 0x8
    // Offset: 0x10
    ::StringW m_Path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_Interactions
    // Size: 0x8
    // Offset: 0x18
    ::StringW m_Interactions;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_Processors
    // Size: 0x8
    // Offset: 0x20
    ::StringW m_Processors;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_Groups
    // Size: 0x8
    // Offset: 0x28
    ::StringW m_Groups;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_Action
    // Size: 0x8
    // Offset: 0x30
    ::StringW m_Action;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // UnityEngine.InputSystem.InputBinding/UnityEngine.InputSystem.Flags m_Flags
    // Size: 0x4
    // Offset: 0x38
    ::UnityEngine::InputSystem::InputBinding::Flags m_Flags;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputBinding::Flags) == 0x4);
    // Padding between fields: m_Flags and: m_OverridePath
    char __padding7[0x4] = {};
    // private System.String m_OverridePath
    // Size: 0x8
    // Offset: 0x40
    ::StringW m_OverridePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_OverrideInteractions
    // Size: 0x8
    // Offset: 0x48
    ::StringW m_OverrideInteractions;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_OverrideProcessors
    // Size: 0x8
    // Offset: 0x50
    ::StringW m_OverrideProcessors;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating value type constructor for type: InputBinding
    constexpr InputBinding(::StringW m_Name_ = {}, ::StringW m_Id_ = {}, ::StringW m_Path_ = {}, ::StringW m_Interactions_ = {}, ::StringW m_Processors_ = {}, ::StringW m_Groups_ = {}, ::StringW m_Action_ = {}, ::UnityEngine::InputSystem::InputBinding::Flags m_Flags_ = {}, ::StringW m_OverridePath_ = {}, ::StringW m_OverrideInteractions_ = {}, ::StringW m_OverrideProcessors_ = {}) noexcept : m_Name{m_Name_}, m_Id{m_Id_}, m_Path{m_Path_}, m_Interactions{m_Interactions_}, m_Processors{m_Processors_}, m_Groups{m_Groups_}, m_Action{m_Action_}, m_Flags{m_Flags_}, m_OverridePath{m_OverridePath_}, m_OverrideInteractions{m_OverrideInteractions_}, m_OverrideProcessors{m_OverrideProcessors_} {}
    // Creating interface conversion operator: operator ::System::ValueType
