// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.InputActionState
#include "UnityEngine/InputSystem/InputActionState.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputActionState::BindingState, "UnityEngine.InputSystem", "InputActionState/BindingState");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0x14
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.InputActionState/UnityEngine.InputSystem.BindingState
  // [TokenAttribute] Offset: FFFFFFFF
  struct InputActionState::BindingState/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputActionState::BindingState::Flags
    struct Flags;
    public:
    // private System.Byte m_ControlCount
    // Size: 0x1
    // Offset: 0x0
    uint8_t m_ControlCount;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_InteractionCount
    // Size: 0x1
    // Offset: 0x1
    uint8_t m_InteractionCount;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_ProcessorCount
    // Size: 0x1
    // Offset: 0x2
    uint8_t m_ProcessorCount;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_MapIndex
    // Size: 0x1
    // Offset: 0x3
    uint8_t m_MapIndex;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_Flags
    // Size: 0x1
    // Offset: 0x4
    uint8_t m_Flags;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_PartIndex
    // Size: 0x1
    // Offset: 0x5
    uint8_t m_PartIndex;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.UInt16 m_ActionIndex
    // Size: 0x2
    // Offset: 0x6
    uint16_t m_ActionIndex;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.UInt16 m_CompositeOrCompositeBindingIndex
    // Size: 0x2
    // Offset: 0x8
    uint16_t m_CompositeOrCompositeBindingIndex;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.UInt16 m_ProcessorStartIndex
    // Size: 0x2
    // Offset: 0xA
    uint16_t m_ProcessorStartIndex;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.UInt16 m_InteractionStartIndex
    // Size: 0x2
    // Offset: 0xC
    uint16_t m_InteractionStartIndex;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.UInt16 m_ControlStartIndex
    // Size: 0x2
    // Offset: 0xE
    uint16_t m_ControlStartIndex;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.Int32 m_TriggerEventIdForComposite
    // Size: 0x4
    // Offset: 0x10
    int m_TriggerEventIdForComposite;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: BindingState
