// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.InputSystem.PlayerNotifications
#include "UnityEngine/InputSystem/PlayerNotifications.hpp"
// Including type: UnityEngine.InputSystem.Users.InputUser
#include "UnityEngine/InputSystem/Users/InputUser.hpp"
// Including type: UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext
#include "UnityEngine/InputSystem/InputAction_CallbackContext.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionAsset
  class InputActionAsset;
  // Forward declaring type: InputValue
  class InputValue;
  // Forward declaring type: InputActionMap
  class InputActionMap;
  // Forward declaring type: InputControl
  class InputControl;
  // Forward declaring type: InputDevice
  class InputDevice;
  // Skipping declaration: InputControlScheme because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::UI
namespace UnityEngine::InputSystem::UI {
  // Forward declaring type: InputSystemUIInputModule
  class InputSystemUIInputModule;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: PlayerInput
  class PlayerInput;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::PlayerInput);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::PlayerInput*, "UnityEngine.InputSystem", "PlayerInput");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.PlayerInput
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 95802C
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class PlayerInput : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::InputSystem::PlayerInput::ActionEvent
    class ActionEvent;
    // Nested type: ::UnityEngine::InputSystem::PlayerInput::DeviceLostEvent
    class DeviceLostEvent;
    // Nested type: ::UnityEngine::InputSystem::PlayerInput::DeviceRegainedEvent
    class DeviceRegainedEvent;
    // Nested type: ::UnityEngine::InputSystem::PlayerInput::ControlsChangedEvent
    class ControlsChangedEvent;
    public:
    // [TooltipAttribute] Offset: 0x95AE74
    // UnityEngine.InputSystem.InputActionAsset m_Actions
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::InputSystem::InputActionAsset* m_Actions;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionAsset*) == 0x8);
    // [TooltipAttribute] Offset: 0x95AEC0
    // UnityEngine.InputSystem.PlayerNotifications m_NotificationBehavior
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::InputSystem::PlayerNotifications m_NotificationBehavior;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::PlayerNotifications) == 0x4);
    // [TooltipAttribute] Offset: 0x95AF0C
    // UnityEngine.InputSystem.UI.InputSystemUIInputModule m_UIInputModule
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::InputSystem::UI::InputSystemUIInputModule* m_UIInputModule;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::UI::InputSystemUIInputModule*) == 0x8);
    // [TooltipAttribute] Offset: 0x95AF58
    // UnityEngine.InputSystem.PlayerInput/UnityEngine.InputSystem.DeviceLostEvent m_DeviceLostEvent
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::InputSystem::PlayerInput::DeviceLostEvent* m_DeviceLostEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::PlayerInput::DeviceLostEvent*) == 0x8);
    // UnityEngine.InputSystem.PlayerInput/UnityEngine.InputSystem.DeviceRegainedEvent m_DeviceRegainedEvent
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::InputSystem::PlayerInput::DeviceRegainedEvent* m_DeviceRegainedEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::PlayerInput::DeviceRegainedEvent*) == 0x8);
    // UnityEngine.InputSystem.PlayerInput/UnityEngine.InputSystem.ControlsChangedEvent m_ControlsChangedEvent
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::InputSystem::PlayerInput::ControlsChangedEvent* m_ControlsChangedEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::PlayerInput::ControlsChangedEvent*) == 0x8);
    // UnityEngine.InputSystem.PlayerInput/UnityEngine.InputSystem.ActionEvent[] m_ActionEvents
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::InputSystem::PlayerInput::ActionEvent*> m_ActionEvents;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::PlayerInput::ActionEvent*>) == 0x8);
    // System.Boolean m_NeverAutoSwitchControlSchemes
    // Size: 0x1
    // Offset: 0x50
    bool m_NeverAutoSwitchControlSchemes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.String m_DefaultControlScheme
    // Size: 0x8
    // Offset: 0x58
    ::StringW m_DefaultControlScheme;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_DefaultActionMap
    // Size: 0x8
    // Offset: 0x60
    ::StringW m_DefaultActionMap;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Int32 m_SplitScreenIndex
    // Size: 0x4
    // Offset: 0x68
    int m_SplitScreenIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0x95B014
    // UnityEngine.Camera m_Camera
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Camera* m_Camera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.InputSystem.InputValue m_InputValueObject
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::InputSystem::InputValue* m_InputValueObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputValue*) == 0x8);
    // UnityEngine.InputSystem.InputActionMap m_CurrentActionMap
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::InputSystem::InputActionMap* m_CurrentActionMap;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionMap*) == 0x8);
    // private System.Int32 m_PlayerIndex
    // Size: 0x4
    // Offset: 0x88
    int m_PlayerIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_InputActive
    // Size: 0x1
    // Offset: 0x8C
    bool m_InputActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Enabled
    // Size: 0x1
    // Offset: 0x8D
    bool m_Enabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ActionsInitialized
    // Size: 0x1
    // Offset: 0x8E
    bool m_ActionsInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Collections.Generic.Dictionary`2<System.String,System.String> m_ActionMessageNames
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>* m_ActionMessageNames;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*) == 0x8);
    // private UnityEngine.InputSystem.Users.InputUser m_InputUser
    // Size: 0x4
    // Offset: 0x98
    ::UnityEngine::InputSystem::Users::InputUser m_InputUser;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Users::InputUser) == 0x4);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_ActionTriggeredDelegate
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_ActionTriggeredDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.PlayerInput>> m_DeviceLostCallbacks
    // Size: 0xFFFFFFFF
    // Offset: 0xA8
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::PlayerInput*>*> m_DeviceLostCallbacks;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.PlayerInput>> m_DeviceRegainedCallbacks
    // Size: 0xFFFFFFFF
    // Offset: 0xC0
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::PlayerInput*>*> m_DeviceRegainedCallbacks;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.PlayerInput>> m_ControlsChangedCallbacks
    // Size: 0xFFFFFFFF
    // Offset: 0xD8
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::PlayerInput*>*> m_ControlsChangedCallbacks;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext>> m_ActionTriggeredCallbacks
    // Size: 0xFFFFFFFF
    // Offset: 0xF0
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*> m_ActionTriggeredCallbacks;
    // private System.Action`2<UnityEngine.InputSystem.InputControl,UnityEngine.InputSystem.LowLevel.InputEventPtr> m_UnpairedDeviceUsedDelegate
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_2<::UnityEngine::InputSystem::InputControl*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr>* m_UnpairedDeviceUsedDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::InputSystem::InputControl*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr>*) == 0x8);
    // private System.Boolean m_OnUnpairedDeviceUsedHooked
    // Size: 0x1
    // Offset: 0x110
    bool m_OnUnpairedDeviceUsedHooked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Action`2<UnityEngine.InputSystem.InputDevice,UnityEngine.InputSystem.InputDeviceChange> m_DeviceChangeDelegate
    // Size: 0x8
    // Offset: 0x118
    ::System::Action_2<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::InputDeviceChange>* m_DeviceChangeDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::InputDeviceChange>*) == 0x8);
    // private System.Boolean m_OnDeviceChangeHooked
    // Size: 0x1
    // Offset: 0x120
    bool m_OnDeviceChangeHooked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.String DeviceLostMessage
    static constexpr const char* DeviceLostMessage = "OnDeviceLost";
    // Get static field: static public System.String DeviceLostMessage
    static ::StringW _get_DeviceLostMessage();
    // Set static field: static public System.String DeviceLostMessage
    static void _set_DeviceLostMessage(::StringW value);
    // static field const value: static public System.String DeviceRegainedMessage
    static constexpr const char* DeviceRegainedMessage = "OnDeviceRegained";
    // Get static field: static public System.String DeviceRegainedMessage
    static ::StringW _get_DeviceRegainedMessage();
