// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.InputSystem.PlayerNotifications
#include "UnityEngine/InputSystem/PlayerNotifications.hpp"
// Including type: UnityEngine.InputSystem.PlayerJoinBehavior
#include "UnityEngine/InputSystem/PlayerJoinBehavior.hpp"
// Including type: UnityEngine.InputSystem.InputActionProperty
#include "UnityEngine/InputSystem/InputActionProperty.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext
#include "UnityEngine/InputSystem/InputAction_CallbackContext.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputEventPtr
#include "UnityEngine/InputSystem/LowLevel/InputEventPtr.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputControl
  class InputControl;
  // Forward declaring type: PlayerInput
  class PlayerInput;
  // Forward declaring type: InputDevice
  class InputDevice;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: PlayerInputManager
  class PlayerInputManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::PlayerInputManager);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::PlayerInputManager*, "UnityEngine.InputSystem", "PlayerInputManager");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.PlayerInputManager
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 958078
  class PlayerInputManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::InputSystem::PlayerInputManager::PlayerJoinedEvent
    class PlayerJoinedEvent;
    // Nested type: ::UnityEngine::InputSystem::PlayerInputManager::PlayerLeftEvent
    class PlayerLeftEvent;
    public:
    // UnityEngine.InputSystem.PlayerNotifications m_NotificationBehavior
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::InputSystem::PlayerNotifications m_NotificationBehavior;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::PlayerNotifications) == 0x4);
    // System.Int32 m_MaxPlayerCount
    // Size: 0x4
    // Offset: 0x1C
    int m_MaxPlayerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean m_AllowJoining
    // Size: 0x1
    // Offset: 0x20
    bool m_AllowJoining;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // UnityEngine.InputSystem.PlayerJoinBehavior m_JoinBehavior
    // Size: 0x4
    // Offset: 0x24
    ::UnityEngine::InputSystem::PlayerJoinBehavior m_JoinBehavior;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::PlayerJoinBehavior) == 0x4);
    // UnityEngine.InputSystem.PlayerInputManager/UnityEngine.InputSystem.PlayerJoinedEvent m_PlayerJoinedEvent
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::InputSystem::PlayerInputManager::PlayerJoinedEvent* m_PlayerJoinedEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::PlayerInputManager::PlayerJoinedEvent*) == 0x8);
    // UnityEngine.InputSystem.PlayerInputManager/UnityEngine.InputSystem.PlayerLeftEvent m_PlayerLeftEvent
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::InputSystem::PlayerInputManager::PlayerLeftEvent* m_PlayerLeftEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::PlayerInputManager::PlayerLeftEvent*) == 0x8);
    // UnityEngine.InputSystem.InputActionProperty m_JoinAction
    // Size: 0x18
    // Offset: 0x38
    ::UnityEngine::InputSystem::InputActionProperty m_JoinAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // UnityEngine.GameObject m_PlayerPrefab
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* m_PlayerPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // System.Boolean m_SplitScreen
    // Size: 0x1
    // Offset: 0x58
    bool m_SplitScreen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean m_MaintainAspectRatioInSplitScreen
    // Size: 0x1
    // Offset: 0x59
    bool m_MaintainAspectRatioInSplitScreen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Int32 m_FixedNumberOfSplitScreens
    // Size: 0x4
    // Offset: 0x5C
    int m_FixedNumberOfSplitScreens;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.Rect m_SplitScreenRect
    // Size: 0x10
    // Offset: 0x60
    ::UnityEngine::Rect m_SplitScreenRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private System.Boolean m_JoinActionDelegateHooked
    // Size: 0x1
    // Offset: 0x70
    bool m_JoinActionDelegateHooked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UnpairedDeviceUsedDelegateHooked
    // Size: 0x1
    // Offset: 0x71
    bool m_UnpairedDeviceUsedDelegateHooked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_JoinActionDelegate
    // Size: 0x8
    // Offset: 0x78
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_JoinActionDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`2<UnityEngine.InputSystem.InputControl,UnityEngine.InputSystem.LowLevel.InputEventPtr> m_UnpairedDeviceUsedDelegate
    // Size: 0x8
    // Offset: 0x80
    ::System::Action_2<::UnityEngine::InputSystem::InputControl*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr>* m_UnpairedDeviceUsedDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::InputSystem::InputControl*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr>*) == 0x8);
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.PlayerInput>> m_PlayerJoinedCallbacks
    // Size: 0xFFFFFFFF
    // Offset: 0x88
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::PlayerInput*>*> m_PlayerJoinedCallbacks;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.PlayerInput>> m_PlayerLeftCallbacks
    // Size: 0xFFFFFFFF
    // Offset: 0xA0
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::PlayerInput*>*> m_PlayerLeftCallbacks;
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.String PlayerJoinedMessage
    static constexpr const char* PlayerJoinedMessage = "OnPlayerJoined";
    // Get static field: static public System.String PlayerJoinedMessage
    static ::StringW _get_PlayerJoinedMessage();
    // Set static field: static public System.String PlayerJoinedMessage
    static void _set_PlayerJoinedMessage(::StringW value);
    // static field const value: static public System.String PlayerLeftMessage
    static constexpr const char* PlayerLeftMessage = "OnPlayerLeft";
    // Get static field: static public System.String PlayerLeftMessage
    static ::StringW _get_PlayerLeftMessage();
