// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle
#include "UnityEngine/ResourceManagement/AsyncOperations/AsyncOperationHandle.hpp"
// Including type: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle`1
#include "UnityEngine/ResourceManagement/AsyncOperations/AsyncOperationHandle_1.hpp"
// Including type: UnityEngine.ResourceManagement.ResourceProviders.SceneInstance
#include "UnityEngine/ResourceManagement/ResourceProviders/SceneInstance.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Action`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Action_4;

// Forward declaring namespace: UnityEngine::Networking
namespace UnityEngine::Networking {
  // Forward declaring type: CertificateHandler
  class CertificateHandler;
}
// Forward declaring namespace: UnityEngine::ResourceManagement
namespace UnityEngine::ResourceManagement {
  // Forward declaring type: IUpdateReceiver
  class IUpdateReceiver;
  // Skipping declaration: DiagnosticEventContext because it is already included!
}
// Forward declaring namespace: UnityEngine::ResourceManagement::ResourceLocations
namespace UnityEngine::ResourceManagement::ResourceLocations {
  // Forward declaring type: IResourceLocation
  class IResourceLocation;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ListWithEvents`1<T>
  template<typename T>
  class ListWithEvents_1;
  // Forward declaring type: DelegateList`1<T>
  template<typename T>
  class DelegateList_1;
}
// Forward declaring namespace: UnityEngine::ResourceManagement::ResourceProviders
namespace UnityEngine::ResourceManagement::ResourceProviders {
  // Forward declaring type: IResourceProvider
  class IResourceProvider;
  // Forward declaring type: ISceneProvider
  class ISceneProvider;
  // Forward declaring type: IInstanceProvider
  class IInstanceProvider;
  // Forward declaring type: InstantiationParameters
  struct InstantiationParameters;
}
// Forward declaring namespace: UnityEngine::ResourceManagement::Util
namespace UnityEngine::ResourceManagement::Util {
  // Forward declaring type: IAllocationStrategy
  class IAllocationStrategy;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Forward declaring namespace: UnityEngine::ResourceManagement::AsyncOperations
namespace UnityEngine::ResourceManagement::AsyncOperations {
  // Forward declaring type: IAsyncOperation
  class IAsyncOperation;
  // Forward declaring type: AsyncOperationBase`1<TObject>
  template<typename TObject>
  class AsyncOperationBase_1;
  // Forward declaring type: GroupOperation
  class GroupOperation;
}
// Forward declaring namespace: UnityEngine::SceneManagement
namespace UnityEngine::SceneManagement {
  // Forward declaring type: LoadSceneMode
  struct LoadSceneMode;
  // Skipping declaration: Scene because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: UnityEngine.ResourceManagement
namespace UnityEngine::ResourceManagement {
  // Size: 0xB8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.ResourceManagement.ResourceManager
  class ResourceManager : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // Nested type: UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType
    struct DiagnosticEventType;
    // Nested type: UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventContext
    struct DiagnosticEventContext;
    // Nested type: UnityEngine::ResourceManagement::ResourceManager::CompletedOperation_1<TObject>
    template<typename TObject>
    class CompletedOperation_1;
    // Nested type: UnityEngine::ResourceManagement::ResourceManager::InstanceOperation
    class InstanceOperation;
    // Nested type: UnityEngine::ResourceManagement::ResourceManager::$$c__DisplayClass83_0_1<TObject>
    template<typename TObject>
    class $$c__DisplayClass83_0_1;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType
    struct DiagnosticEventType/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: DiagnosticEventType
      constexpr DiagnosticEventType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationFail
      static constexpr const int AsyncOperationFail = 0;
      // Get static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationFail
      static UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType _get_AsyncOperationFail();
      // Set static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationFail
      static void _set_AsyncOperationFail(UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType value);
      // static field const value: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationCreate
      static constexpr const int AsyncOperationCreate = 1;
      // Get static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationCreate
      static UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType _get_AsyncOperationCreate();
      // Set static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationCreate
      static void _set_AsyncOperationCreate(UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType value);
      // static field const value: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationPercentComplete
      static constexpr const int AsyncOperationPercentComplete = 2;
      // Get static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationPercentComplete
      static UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType _get_AsyncOperationPercentComplete();
      // Set static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationPercentComplete
      static void _set_AsyncOperationPercentComplete(UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType value);
      // static field const value: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationComplete
      static constexpr const int AsyncOperationComplete = 3;
      // Get static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationComplete
      static UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType _get_AsyncOperationComplete();
      // Set static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationComplete
      static void _set_AsyncOperationComplete(UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType value);
      // static field const value: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationReferenceCount
      static constexpr const int AsyncOperationReferenceCount = 4;
      // Get static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationReferenceCount
      static UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType _get_AsyncOperationReferenceCount();
      // Set static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationReferenceCount
      static void _set_AsyncOperationReferenceCount(UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType value);
      // static field const value: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationDestroy
      static constexpr const int AsyncOperationDestroy = 5;
      // Get static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationDestroy
      static UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType _get_AsyncOperationDestroy();
      // Set static field: static public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType AsyncOperationDestroy
      static void _set_AsyncOperationDestroy(UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType value);
    }; // UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType
    #pragma pack(pop)
    static check_size<sizeof(ResourceManager::DiagnosticEventType), 0 + sizeof(int)> __UnityEngine_ResourceManagement_ResourceManager_DiagnosticEventTypeSizeCheck;
    static_assert(sizeof(ResourceManager::DiagnosticEventType) == 0x4);
    // Size: 0x38
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventContext
    struct DiagnosticEventContext/*, public System::ValueType*/ {
      public:
      // [CompilerGeneratedAttribute] Offset: 0xDFADAC
      // private readonly UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle <OperationHandle>k__BackingField
      // Size: 0x18
      // Offset: 0x0
      UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle OperationHandle;
      // Field size check
      static_assert(sizeof(UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle) == 0x18);
      // [CompilerGeneratedAttribute] Offset: 0xDFADBC
      // private readonly UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType <Type>k__BackingField
      // Size: 0x4
      // Offset: 0x18
      UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType Type;
      // Field size check
      static_assert(sizeof(UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType) == 0x4);
      // [CompilerGeneratedAttribute] Offset: 0xDFADCC
      // private readonly System.Int32 <EventValue>k__BackingField
      // Size: 0x4
      // Offset: 0x1C
      int EventValue;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // [CompilerGeneratedAttribute] Offset: 0xDFADDC
      // private readonly UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation <Location>k__BackingField
      // Size: 0x8
      // Offset: 0x20
      UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* Location;
      // Field size check
      static_assert(sizeof(UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*) == 0x8);
      // [CompilerGeneratedAttribute] Offset: 0xDFADEC
      // private readonly System.Object <Context>k__BackingField
      // Size: 0x8
      // Offset: 0x28
      ::Il2CppObject* Context;
      // Field size check
      static_assert(sizeof(::Il2CppObject*) == 0x8);
      // [CompilerGeneratedAttribute] Offset: 0xDFADFC
      // private readonly System.String <Error>k__BackingField
      // Size: 0x8
      // Offset: 0x30
      ::Il2CppString* Error;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // Creating value type constructor for type: DiagnosticEventContext
      constexpr DiagnosticEventContext(UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle OperationHandle_ = {}, UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType Type_ = {}, int EventValue_ = {}, UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* Location_ = {}, ::Il2CppObject* Context_ = {}, ::Il2CppString* Error_ = {}) noexcept : OperationHandle{OperationHandle_}, Type{Type_}, EventValue{EventValue_}, Location{Location_}, Context{Context_}, Error{Error_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // public UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle get_OperationHandle()
      // Offset: 0xF01DB0
      UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle get_OperationHandle();
      // public UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType get_Type()
      // Offset: 0xF01DC4
      UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType get_Type();
      // public System.Int32 get_EventValue()
      // Offset: 0xF01DCC
      int get_EventValue();
      // public UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation get_Location()
      // Offset: 0xF01DD4
      UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* get_Location();
      // public System.Object get_Context()
      // Offset: 0xF01DDC
      ::Il2CppObject* get_Context();
      // public System.String get_Error()
      // Offset: 0xF01DE4
      ::Il2CppString* get_Error();
      // public System.Void .ctor(UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle op, UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType type, System.Int32 eventValue, System.String error, System.Object context)
      // Offset: 0xF01DEC
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      DiagnosticEventContext(UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op, UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType type, int eventValue, ::Il2CppString* error, ::Il2CppObject* context) {
        static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventContext::.ctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(op), ::il2cpp_utils::ExtractType(type), ::il2cpp_utils::ExtractType(eventValue), ::il2cpp_utils::ExtractType(error), ::il2cpp_utils::ExtractType(context)})));
        ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, op, type, eventValue, error, context);
      }
    }; // UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventContext
    #pragma pack(pop)
    static check_size<sizeof(ResourceManager::DiagnosticEventContext), 48 + sizeof(::Il2CppString*)> __UnityEngine_ResourceManagement_ResourceManager_DiagnosticEventContextSizeCheck;
    static_assert(sizeof(ResourceManager::DiagnosticEventContext) == 0x38);
    // System.Boolean postProfilerEvents
    // Size: 0x1
    // Offset: 0x10
    bool postProfilerEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: postProfilerEvents and: InternalIdTransformFunc
    char __padding0[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xDFAD8C
    // private System.Func`2<UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation,System.String> <InternalIdTransformFunc>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    System::Func_2<UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*, ::Il2CppString*>* InternalIdTransformFunc;
    // Field size check
    static_assert(sizeof(System::Func_2<UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*, ::Il2CppString*>*) == 0x8);
    // System.Boolean CallbackHooksEnabled
    // Size: 0x1
    // Offset: 0x20
    bool CallbackHooksEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CallbackHooksEnabled and: m_ResourceProviders
    char __padding2[0x7] = {};
    // private ListWithEvents`1<UnityEngine.ResourceManagement.ResourceProviders.IResourceProvider> m_ResourceProviders
    // Size: 0x8
    // Offset: 0x28
    GlobalNamespace::ListWithEvents_1<UnityEngine::ResourceManagement::ResourceProviders::IResourceProvider*>* m_ResourceProviders;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ListWithEvents_1<UnityEngine::ResourceManagement::ResourceProviders::IResourceProvider*>*) == 0x8);
    // private UnityEngine.ResourceManagement.Util.IAllocationStrategy m_allocator
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::ResourceManagement::Util::IAllocationStrategy* m_allocator;
    // Field size check
    static_assert(sizeof(UnityEngine::ResourceManagement::Util::IAllocationStrategy*) == 0x8);
    // private ListWithEvents`1<UnityEngine.ResourceManagement.IUpdateReceiver> m_UpdateReceivers
    // Size: 0x8
    // Offset: 0x38
    GlobalNamespace::ListWithEvents_1<UnityEngine::ResourceManagement::IUpdateReceiver*>* m_UpdateReceivers;
    // Field size check
    static_assert(sizeof(GlobalNamespace::ListWithEvents_1<UnityEngine::ResourceManagement::IUpdateReceiver*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.ResourceManagement.IUpdateReceiver> m_UpdateReceiversToRemove
    // Size: 0x8
    // Offset: 0x40
    System::Collections::Generic::List_1<UnityEngine::ResourceManagement::IUpdateReceiver*>* m_UpdateReceiversToRemove;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::ResourceManagement::IUpdateReceiver*>*) == 0x8);
    // private System.Boolean m_UpdatingReceivers
    // Size: 0x1
    // Offset: 0x48
    bool m_UpdatingReceivers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UpdatingReceivers and: m_providerMap
    char __padding7[0x7] = {};
    // private System.Collections.Generic.Dictionary`2<System.Int32,UnityEngine.ResourceManagement.ResourceProviders.IResourceProvider> m_providerMap
    // Size: 0x8
    // Offset: 0x50
    System::Collections::Generic::Dictionary_2<int, UnityEngine::ResourceManagement::ResourceProviders::IResourceProvider*>* m_providerMap;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, UnityEngine::ResourceManagement::ResourceProviders::IResourceProvider*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,UnityEngine.ResourceManagement.AsyncOperations.IAsyncOperation> m_AssetOperationCache
    // Size: 0x8
    // Offset: 0x58
    System::Collections::Generic::Dictionary_2<int, UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>* m_AssetOperationCache;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>*) == 0x8);
    // private System.Collections.Generic.HashSet`1<UnityEngine.ResourceManagement.ResourceManager/InstanceOperation> m_TrackedInstanceOperations
    // Size: 0x8
    // Offset: 0x60
    System::Collections::Generic::HashSet_1<UnityEngine::ResourceManagement::ResourceManager::InstanceOperation*>* m_TrackedInstanceOperations;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<UnityEngine::ResourceManagement::ResourceManager::InstanceOperation*>*) == 0x8);
    // private DelegateList`1<System.Single> m_UpdateCallbacks
    // Size: 0x8
    // Offset: 0x68
    GlobalNamespace::DelegateList_1<float>* m_UpdateCallbacks;
    // Field size check
    static_assert(sizeof(GlobalNamespace::DelegateList_1<float>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.ResourceManagement.AsyncOperations.IAsyncOperation> m_DeferredCompleteCallbacks
    // Size: 0x8
    // Offset: 0x70
    System::Collections::Generic::List_1<UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>* m_DeferredCompleteCallbacks;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>*) == 0x8);
    // private System.Action`4<UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle,UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventType,System.Int32,System.Object> m_obsoleteDiagnosticsHandler
    // Size: 0x8
    // Offset: 0x78
    System::Action_4<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle, UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType, int, ::Il2CppObject*>* m_obsoleteDiagnosticsHandler;
    // Field size check
    static_assert(sizeof(System::Action_4<UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle, UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventType, int, ::Il2CppObject*>*) == 0x8);
    // private System.Action`1<UnityEngine.ResourceManagement.ResourceManager/DiagnosticEventContext> m_diagnosticsHandler
    // Size: 0x8
    // Offset: 0x80
    System::Action_1<UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventContext>* m_diagnosticsHandler;
    // Field size check
    static_assert(sizeof(System::Action_1<UnityEngine::ResourceManagement::ResourceManager::DiagnosticEventContext>*) == 0x8);
    // private System.Action`1<UnityEngine.ResourceManagement.AsyncOperations.IAsyncOperation> m_ReleaseOpNonCached
    // Size: 0x8
    // Offset: 0x88
    System::Action_1<UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>* m_ReleaseOpNonCached;
    // Field size check
    static_assert(sizeof(System::Action_1<UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>*) == 0x8);
    // private System.Action`1<UnityEngine.ResourceManagement.AsyncOperations.IAsyncOperation> m_ReleaseOpCached
    // Size: 0x8
    // Offset: 0x90
    System::Action_1<UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>* m_ReleaseOpCached;
    // Field size check
    static_assert(sizeof(System::Action_1<UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>*) == 0x8);
    // private System.Action`1<UnityEngine.ResourceManagement.AsyncOperations.IAsyncOperation> m_ReleaseInstanceOp
    // Size: 0x8
    // Offset: 0x98
    System::Action_1<UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>* m_ReleaseInstanceOp;
    // Field size check
    static_assert(sizeof(System::Action_1<UnityEngine::ResourceManagement::AsyncOperations::IAsyncOperation*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDFAD9C
    // private UnityEngine.Networking.CertificateHandler <CertificateHandlerInstance>k__BackingField
    // Size: 0x8
    // Offset: 0xA0
    UnityEngine::Networking::CertificateHandler* CertificateHandlerInstance;
    // Field size check
    static_assert(sizeof(UnityEngine::Networking::CertificateHandler*) == 0x8);
    // private System.Boolean m_RegisteredForCallbacks
    // Size: 0x1
    // Offset: 0xA8
    bool m_RegisteredForCallbacks;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_RegisteredForCallbacks and: m_ProviderOperationTypeCache
    char __padding19[0x7] = {};
    // private System.Collections.Generic.Dictionary`2<System.Type,System.Type> m_ProviderOperationTypeCache
    // Size: 0x8
    // Offset: 0xB0
    System::Collections::Generic::Dictionary_2<System::Type*, System::Type*>* m_ProviderOperationTypeCache;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<System::Type*, System::Type*>*) == 0x8);
    // Creating value type constructor for type: ResourceManager
