// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.Object
#include "System/Object.hpp"
// Including type: RootMotion.BipedNaming
#include "RootMotion/BipedNaming.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion
namespace RootMotion {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: Vector3
  struct Vector3;
  // Forward declaring type: Quaternion
  struct Quaternion;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
struct CsObject;
template<class T>
struct Array;
struct CsString;
// Completed il2cpp-utils forward declares
// Type namespace: RootMotion
namespace RootMotion {
  // Autogenerated type: RootMotion.BipedReferences
  class BipedReferences : public ::CsObject {
    public:
    // Nested type: RootMotion::BipedReferences::AutoDetectParams
    struct AutoDetectParams;
    // public UnityEngine.Transform root
    // Offset: 0x10
    UnityEngine::Transform* root;
    // public UnityEngine.Transform pelvis
    // Offset: 0x18
    UnityEngine::Transform* pelvis;
    // public UnityEngine.Transform leftThigh
    // Offset: 0x20
    UnityEngine::Transform* leftThigh;
    // public UnityEngine.Transform leftCalf
    // Offset: 0x28
    UnityEngine::Transform* leftCalf;
    // public UnityEngine.Transform leftFoot
    // Offset: 0x30
    UnityEngine::Transform* leftFoot;
    // public UnityEngine.Transform rightThigh
    // Offset: 0x38
    UnityEngine::Transform* rightThigh;
    // public UnityEngine.Transform rightCalf
    // Offset: 0x40
    UnityEngine::Transform* rightCalf;
    // public UnityEngine.Transform rightFoot
    // Offset: 0x48
    UnityEngine::Transform* rightFoot;
    // public UnityEngine.Transform leftUpperArm
    // Offset: 0x50
    UnityEngine::Transform* leftUpperArm;
    // public UnityEngine.Transform leftForearm
    // Offset: 0x58
    UnityEngine::Transform* leftForearm;
    // public UnityEngine.Transform leftHand
    // Offset: 0x60
    UnityEngine::Transform* leftHand;
    // public UnityEngine.Transform rightUpperArm
    // Offset: 0x68
    UnityEngine::Transform* rightUpperArm;
    // public UnityEngine.Transform rightForearm
    // Offset: 0x70
    UnityEngine::Transform* rightForearm;
    // public UnityEngine.Transform rightHand
    // Offset: 0x78
    UnityEngine::Transform* rightHand;
    // public UnityEngine.Transform head
    // Offset: 0x80
    UnityEngine::Transform* head;
    // public UnityEngine.Transform[] spine
    // Offset: 0x88
    ::Array<UnityEngine::Transform*>* spine;
    // public UnityEngine.Transform[] eyes
    // Offset: 0x90
    ::Array<UnityEngine::Transform*>* eyes;
    // public System.Boolean get_isFilled()
    // Offset: 0x138D220
    bool get_isFilled();
    // public System.Boolean get_isEmpty()
    // Offset: 0x138D60C
    bool get_isEmpty();
    // public System.Boolean IsEmpty(System.Boolean includeRoot)
    // Offset: 0x138D61C
    bool IsEmpty(bool includeRoot);
    // public System.Boolean Contains(UnityEngine.Transform t, System.Boolean ignoreRoot)
    // Offset: 0x138DA48
    bool Contains(UnityEngine::Transform* t, bool ignoreRoot);
    // static public System.Boolean AutoDetectReferences(RootMotion.BipedReferences references, UnityEngine.Transform root, RootMotion.BipedReferences/AutoDetectParams autoDetectParams)
    // Offset: 0x138DE80
    static bool AutoDetectReferences(RootMotion::BipedReferences*& references, UnityEngine::Transform* root, RootMotion::BipedReferences::AutoDetectParams autoDetectParams);
    // static public System.Void DetectReferencesByNaming(RootMotion.BipedReferences references, UnityEngine.Transform root, RootMotion.BipedReferences/AutoDetectParams autoDetectParams)
    // Offset: 0x138E58C
    static void DetectReferencesByNaming(RootMotion::BipedReferences*& references, UnityEngine::Transform* root, RootMotion::BipedReferences::AutoDetectParams autoDetectParams);
    // static public System.Void AssignHumanoidReferences(RootMotion.BipedReferences references, UnityEngine.Animator animator, RootMotion.BipedReferences/AutoDetectParams autoDetectParams)
    // Offset: 0x138E0FC
    static void AssignHumanoidReferences(RootMotion::BipedReferences*& references, UnityEngine::Animator* animator, RootMotion::BipedReferences::AutoDetectParams autoDetectParams);
    // static public System.Boolean SetupError(RootMotion.BipedReferences references, System.String errorMessage)
    // Offset: 0x138EDC0
    static bool SetupError(RootMotion::BipedReferences* references, ::CsString*& errorMessage);
    // static public System.Boolean SetupWarning(RootMotion.BipedReferences references, System.String warningMessage)
    // Offset: 0x138EEC0
    static bool SetupWarning(RootMotion::BipedReferences* references, ::CsString*& warningMessage);
    // static private System.Boolean IsNeckBone(UnityEngine.Transform bone, UnityEngine.Transform leftUpperArm)
    // Offset: 0x138F474
    static bool IsNeckBone(UnityEngine::Transform* bone, UnityEngine::Transform* leftUpperArm);
    // static private System.Boolean AddBoneToEyes(UnityEngine.Transform bone, RootMotion.BipedReferences references, RootMotion.BipedReferences/AutoDetectParams autoDetectParams)
    // Offset: 0x138F264
    static bool AddBoneToEyes(UnityEngine::Transform* bone, RootMotion::BipedReferences*& references, RootMotion::BipedReferences::AutoDetectParams autoDetectParams);
    // static private System.Boolean AddBoneToSpine(UnityEngine.Transform bone, RootMotion.BipedReferences references, RootMotion.BipedReferences/AutoDetectParams autoDetectParams)
    // Offset: 0x138F0DC
    static bool AddBoneToSpine(UnityEngine::Transform* bone, RootMotion::BipedReferences*& references, RootMotion::BipedReferences::AutoDetectParams autoDetectParams);
    // static private System.Void DetectLimb(RootMotion.BipedNaming/BoneType boneType, RootMotion.BipedNaming/BoneSide boneSide, UnityEngine.Transform firstBone, UnityEngine.Transform secondBone, UnityEngine.Transform lastBone, UnityEngine.Transform[] transforms)
    // Offset: 0x138EF60
    static void DetectLimb(RootMotion::BipedNaming::BoneType boneType, RootMotion::BipedNaming::BoneSide boneSide, UnityEngine::Transform*& firstBone, UnityEngine::Transform*& secondBone, UnityEngine::Transform*& lastBone, ::Array<UnityEngine::Transform*>* transforms);
    // static private System.Void AddBoneToHierarchy(UnityEngine.Transform[] bones, UnityEngine.Transform transform)
    // Offset: 0x138F368
    static void AddBoneToHierarchy(::Array<UnityEngine::Transform*>*& bones, UnityEngine::Transform* transform);
    // static private System.Boolean LimbError(UnityEngine.Transform bone1, UnityEngine.Transform bone2, UnityEngine.Transform bone3, System.String errorMessage)
    // Offset: 0x138F570
    static bool LimbError(UnityEngine::Transform* bone1, UnityEngine::Transform* bone2, UnityEngine::Transform* bone3, ::CsString*& errorMessage);
    // static private System.Boolean LimbWarning(UnityEngine.Transform bone1, UnityEngine.Transform bone2, UnityEngine.Transform bone3, System.String warningMessage)
    // Offset: 0x13900D4
    static bool LimbWarning(UnityEngine::Transform* bone1, UnityEngine::Transform* bone2, UnityEngine::Transform* bone3, ::CsString*& warningMessage);
    // static private System.Boolean SpineError(RootMotion.BipedReferences references, System.String errorMessage)
    // Offset: 0x138FBA0
    static bool SpineError(RootMotion::BipedReferences* references, ::CsString*& errorMessage);
    // static private System.Boolean SpineWarning(RootMotion.BipedReferences references, System.String warningMessage)
    // Offset: 0x139041C
    static bool SpineWarning(RootMotion::BipedReferences* references, ::CsString*& warningMessage);
    // static private System.Boolean EyesError(RootMotion.BipedReferences references, System.String errorMessage)
    // Offset: 0x138FEEC
    static bool EyesError(RootMotion::BipedReferences* references, ::CsString*& errorMessage);
    // static private System.Boolean EyesWarning(RootMotion.BipedReferences references, System.String warningMessage)
    // Offset: 0x1390424
    static bool EyesWarning(RootMotion::BipedReferences* references, ::CsString*& warningMessage);
    // static private System.Boolean RootHeightWarning(RootMotion.BipedReferences references, System.String warningMessage)
    // Offset: 0x139042C
    static bool RootHeightWarning(RootMotion::BipedReferences* references, ::CsString*& warningMessage);
    // static private System.Boolean FacingAxisWarning(RootMotion.BipedReferences references, System.String warningMessage)
    // Offset: 0x13905F8
    static bool FacingAxisWarning(RootMotion::BipedReferences* references, ::CsString*& warningMessage);
    // static private System.Single GetVerticalOffset(UnityEngine.Vector3 p1, UnityEngine.Vector3 p2, UnityEngine.Quaternion rotation)
    // Offset: 0x139081C
    static float GetVerticalOffset(UnityEngine::Vector3 p1, UnityEngine::Vector3 p2, UnityEngine::Quaternion rotation);
    // public System.Void .ctor()
    // Offset: 0x138E074
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static BipedReferences* New_ctor();
  }; // RootMotion.BipedReferences
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::BipedReferences*, "RootMotion", "BipedReferences");
#pragma pack(pop)
