// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.MarshalByRefObject
#include "System/MarshalByRefObject.hpp"
// Including type: System.Runtime.Remoting.Lifetime.ILease
#include "System/Runtime/Remoting/Lifetime/ILease.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.Runtime.Remoting.Lifetime.LeaseState
#include "System/Runtime/Remoting/Lifetime/LeaseState.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Runtime::Remoting::Lifetime
namespace System::Runtime::Remoting::Lifetime {
  // Forward declaring type: ISponsor
  class ISponsor;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Queue
  class Queue;
}
// Completed forward declares
// Type namespace: System.Runtime.Remoting.Lifetime
namespace System::Runtime::Remoting::Lifetime {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: System.Runtime.Remoting.Lifetime.Lease
  // [TokenAttribute] Offset: FFFFFFFF
  class Lease : public System::MarshalByRefObject/*, public System::Runtime::Remoting::Lifetime::ILease*/ {
    public:
    // Nested type: System::Runtime::Remoting::Lifetime::Lease::RenewalDelegate
    class RenewalDelegate;
    // private System.DateTime _leaseExpireTime
    // Size: 0x8
    // Offset: 0x18
    System::DateTime leaseExpireTime;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // private System.Runtime.Remoting.Lifetime.LeaseState _currentState
    // Size: 0x4
    // Offset: 0x20
    System::Runtime::Remoting::Lifetime::LeaseState currentState;
    // Field size check
    static_assert(sizeof(System::Runtime::Remoting::Lifetime::LeaseState) == 0x4);
    // Padding between fields: currentState and: initialLeaseTime
    char __padding1[0x4] = {};
    // private System.TimeSpan _initialLeaseTime
    // Size: 0x8
    // Offset: 0x28
    System::TimeSpan initialLeaseTime;
    // Field size check
    static_assert(sizeof(System::TimeSpan) == 0x8);
    // private System.TimeSpan _renewOnCallTime
    // Size: 0x8
    // Offset: 0x30
    System::TimeSpan renewOnCallTime;
    // Field size check
    static_assert(sizeof(System::TimeSpan) == 0x8);
    // private System.TimeSpan _sponsorshipTimeout
    // Size: 0x8
    // Offset: 0x38
    System::TimeSpan sponsorshipTimeout;
    // Field size check
    static_assert(sizeof(System::TimeSpan) == 0x8);
    // private System.Collections.ArrayList _sponsors
    // Size: 0x8
    // Offset: 0x40
    System::Collections::ArrayList* sponsors;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Collections.Queue _renewingSponsors
    // Size: 0x8
    // Offset: 0x48
    System::Collections::Queue* renewingSponsors;
    // Field size check
    static_assert(sizeof(System::Collections::Queue*) == 0x8);
    // private System.Runtime.Remoting.Lifetime.Lease/System.Runtime.Remoting.Lifetime.RenewalDelegate _renewalDelegate
    // Size: 0x8
    // Offset: 0x50
    System::Runtime::Remoting::Lifetime::Lease::RenewalDelegate* renewalDelegate;
    // Field size check
    static_assert(sizeof(System::Runtime::Remoting::Lifetime::Lease::RenewalDelegate*) == 0x8);
    // Creating value type constructor for type: Lease
    Lease(System::DateTime leaseExpireTime_ = {}, System::Runtime::Remoting::Lifetime::LeaseState currentState_ = {}, System::TimeSpan initialLeaseTime_ = {}, System::TimeSpan renewOnCallTime_ = {}, System::TimeSpan sponsorshipTimeout_ = {}, System::Collections::ArrayList* sponsors_ = {}, System::Collections::Queue* renewingSponsors_ = {}, System::Runtime::Remoting::Lifetime::Lease::RenewalDelegate* renewalDelegate_ = {}) noexcept : leaseExpireTime{leaseExpireTime_}, currentState{currentState_}, initialLeaseTime{initialLeaseTime_}, renewOnCallTime{renewOnCallTime_}, sponsorshipTimeout{sponsorshipTimeout_}, sponsors{sponsors_}, renewingSponsors{renewingSponsors_}, renewalDelegate{renewalDelegate_} {}
    // Creating interface conversion operator: operator System::Runtime::Remoting::Lifetime::ILease
    operator System::Runtime::Remoting::Lifetime::ILease() noexcept {
      return *reinterpret_cast<System::Runtime::Remoting::Lifetime::ILease*>(this);
    }
    // Deleting conversion operator: operator ::Il2CppObject*
    constexpr operator ::Il2CppObject*() const noexcept = delete;
    // Get instance field: private System.DateTime _leaseExpireTime
    System::DateTime _get__leaseExpireTime();
    // Set instance field: private System.DateTime _leaseExpireTime
    void _set__leaseExpireTime(System::DateTime value);
    // Get instance field: private System.Runtime.Remoting.Lifetime.LeaseState _currentState
    System::Runtime::Remoting::Lifetime::LeaseState _get__currentState();
    // Set instance field: private System.Runtime.Remoting.Lifetime.LeaseState _currentState
    void _set__currentState(System::Runtime::Remoting::Lifetime::LeaseState value);
    // Get instance field: private System.TimeSpan _initialLeaseTime
    System::TimeSpan _get__initialLeaseTime();
    // Set instance field: private System.TimeSpan _initialLeaseTime
    void _set__initialLeaseTime(System::TimeSpan value);
    // Get instance field: private System.TimeSpan _renewOnCallTime
    System::TimeSpan _get__renewOnCallTime();
    // Set instance field: private System.TimeSpan _renewOnCallTime
    void _set__renewOnCallTime(System::TimeSpan value);
    // Get instance field: private System.TimeSpan _sponsorshipTimeout
    System::TimeSpan _get__sponsorshipTimeout();
    // Set instance field: private System.TimeSpan _sponsorshipTimeout
    void _set__sponsorshipTimeout(System::TimeSpan value);
    // Get instance field: private System.Collections.ArrayList _sponsors
    System::Collections::ArrayList* _get__sponsors();
    // Set instance field: private System.Collections.ArrayList _sponsors
    void _set__sponsors(System::Collections::ArrayList* value);
    // Get instance field: private System.Collections.Queue _renewingSponsors
    System::Collections::Queue* _get__renewingSponsors();
    // Set instance field: private System.Collections.Queue _renewingSponsors
    void _set__renewingSponsors(System::Collections::Queue* value);
    // Get instance field: private System.Runtime.Remoting.Lifetime.Lease/System.Runtime.Remoting.Lifetime.RenewalDelegate _renewalDelegate
    System::Runtime::Remoting::Lifetime::Lease::RenewalDelegate* _get__renewalDelegate();
    // Set instance field: private System.Runtime.Remoting.Lifetime.Lease/System.Runtime.Remoting.Lifetime.RenewalDelegate _renewalDelegate
    void _set__renewalDelegate(System::Runtime::Remoting::Lifetime::Lease::RenewalDelegate* value);
    // public System.TimeSpan get_CurrentLeaseTime()
    // Offset: 0x1A438BC
    System::TimeSpan get_CurrentLeaseTime();
    // public System.Runtime.Remoting.Lifetime.LeaseState get_CurrentState()
    // Offset: 0x1A43934
    System::Runtime::Remoting::Lifetime::LeaseState get_CurrentState();
    // public System.TimeSpan get_RenewOnCallTime()
    // Offset: 0x1A43948
    System::TimeSpan get_RenewOnCallTime();
    // public System.Void Activate()
    // Offset: 0x1A4393C
    void Activate();
    // public System.TimeSpan Renew(System.TimeSpan renewalTime)
    // Offset: 0x1A43950
    System::TimeSpan Renew(System::TimeSpan renewalTime);
    // public System.Void Unregister(System.Runtime.Remoting.Lifetime.ISponsor obj)
    // Offset: 0x1A439EC
    void Unregister(System::Runtime::Remoting::Lifetime::ISponsor* obj);
    // System.Void UpdateState()
    // Offset: 0x1A43AFC
    void UpdateState();
    // private System.Void CheckNextSponsor()
    // Offset: 0x1A43C48
    void CheckNextSponsor();
    // private System.Void ProcessSponsorResponse(System.Object state, System.Boolean timedOut)
    // Offset: 0x1A43EAC
    void ProcessSponsorResponse(::Il2CppObject* state, bool timedOut);
    // public System.Void .ctor()
    // Offset: 0x1A43724
    // Implemented from: System.MarshalByRefObject
    // Base method: System.Void MarshalByRefObject::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Lease* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Runtime::Remoting::Lifetime::Lease::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Lease*, creationType>()));
    }
  }; // System.Runtime.Remoting.Lifetime.Lease
  #pragma pack(pop)
  static check_size<sizeof(Lease), 80 + sizeof(System::Runtime::Remoting::Lifetime::Lease::RenewalDelegate*)> __System_Runtime_Remoting_Lifetime_LeaseSizeCheck;
  static_assert(sizeof(Lease) == 0x58);
}
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Remoting::Lifetime::Lease*, "System.Runtime.Remoting.Lifetime", "Lease");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::get_CurrentLeaseTime
// Il2CppName: get_CurrentLeaseTime
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::TimeSpan (System::Runtime::Remoting::Lifetime::Lease::*)()>(&System::Runtime::Remoting::Lifetime::Lease::get_CurrentLeaseTime)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Runtime::Remoting::Lifetime::Lease*), "get_CurrentLeaseTime", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::get_CurrentState
// Il2CppName: get_CurrentState
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::Runtime::Remoting::Lifetime::LeaseState (System::Runtime::Remoting::Lifetime::Lease::*)()>(&System::Runtime::Remoting::Lifetime::Lease::get_CurrentState)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Runtime::Remoting::Lifetime::Lease*), "get_CurrentState", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::get_RenewOnCallTime
// Il2CppName: get_RenewOnCallTime
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::TimeSpan (System::Runtime::Remoting::Lifetime::Lease::*)()>(&System::Runtime::Remoting::Lifetime::Lease::get_RenewOnCallTime)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Runtime::Remoting::Lifetime::Lease*), "get_RenewOnCallTime", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::Activate
// Il2CppName: Activate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Runtime::Remoting::Lifetime::Lease::*)()>(&System::Runtime::Remoting::Lifetime::Lease::Activate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Runtime::Remoting::Lifetime::Lease*), "Activate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::Renew
// Il2CppName: Renew
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::TimeSpan (System::Runtime::Remoting::Lifetime::Lease::*)(System::TimeSpan)>(&System::Runtime::Remoting::Lifetime::Lease::Renew)> {
  static const MethodInfo* get() {
    static auto* renewalTime = &::il2cpp_utils::GetClassFromName("System", "TimeSpan")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Runtime::Remoting::Lifetime::Lease*), "Renew", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{renewalTime});
  }
};
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::Unregister
// Il2CppName: Unregister
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Runtime::Remoting::Lifetime::Lease::*)(System::Runtime::Remoting::Lifetime::ISponsor*)>(&System::Runtime::Remoting::Lifetime::Lease::Unregister)> {
  static const MethodInfo* get() {
    static auto* obj = &::il2cpp_utils::GetClassFromName("System.Runtime.Remoting.Lifetime", "ISponsor")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Runtime::Remoting::Lifetime::Lease*), "Unregister", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{obj});
  }
};
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::UpdateState
// Il2CppName: UpdateState
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Runtime::Remoting::Lifetime::Lease::*)()>(&System::Runtime::Remoting::Lifetime::Lease::UpdateState)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Runtime::Remoting::Lifetime::Lease*), "UpdateState", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::CheckNextSponsor
// Il2CppName: CheckNextSponsor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Runtime::Remoting::Lifetime::Lease::*)()>(&System::Runtime::Remoting::Lifetime::Lease::CheckNextSponsor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Runtime::Remoting::Lifetime::Lease*), "CheckNextSponsor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::ProcessSponsorResponse
// Il2CppName: ProcessSponsorResponse
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Runtime::Remoting::Lifetime::Lease::*)(::Il2CppObject*, bool)>(&System::Runtime::Remoting::Lifetime::Lease::ProcessSponsorResponse)> {
  static const MethodInfo* get() {
    static auto* state = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    static auto* timedOut = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Runtime::Remoting::Lifetime::Lease*), "ProcessSponsorResponse", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{state, timedOut});
  }
};
// Writing MetadataGetter for method: System::Runtime::Remoting::Lifetime::Lease::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
