// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Collections.Generic.ICollection`1
#include "System/Collections/Generic/ICollection_1.hpp"
// Including type: System.Collections.Generic.IReadOnlyCollection`1
#include "System/Collections/Generic/IReadOnlyCollection_1.hpp"
// Including type: System.Runtime.Serialization.ISerializable
#include "System/Runtime/Serialization/ISerializable.hpp"
// Including type: System.Runtime.Serialization.IDeserializationCallback
#include "System/Runtime/Serialization/IDeserializationCallback.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Runtime.Serialization.StreamingContext
#include "System/Runtime/Serialization/StreamingContext.hpp"
// Including type: System.Collections.Generic.IEnumerator`1
#include "System/Collections/Generic/IEnumerator_1.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Skipping declaration: Slot because it is already included!
  // Skipping declaration: Enumerator because it is already included!
  // Forward declaring type: IEqualityComparer`1<T>
  template<typename T>
  class IEqualityComparer_1;
  // Skipping declaration: IEnumerable`1 because it is already included!
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
}
// Completed forward declares
// Type namespace: System.Collections.Generic
namespace System::Collections::Generic {
  // WARNING Size may be invalid!
  // Autogenerated type: System.Collections.Generic.HashSet`1
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerDisplayAttribute] Offset: D77AB0
  // [DebuggerTypeProxyAttribute] Offset: D77AB0
  template<typename T>
  class HashSet_1 : public ::Il2CppObject/*, public System::Collections::Generic::ICollection_1<T>, public System::Collections::Generic::IReadOnlyCollection_1<T>, public System::Runtime::Serialization::ISerializable, public System::Runtime::Serialization::IDeserializationCallback*/ {
    public:
    // Nested type: System::Collections::Generic::HashSet_1::Slot<T>
    struct Slot;
    // Nested type: System::Collections::Generic::HashSet_1::Enumerator<T>
    struct Enumerator;
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Collections.Generic.HashSet`1/System.Collections.Generic.Slot
    // [TokenAttribute] Offset: FFFFFFFF
    struct Slot : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public System::ValueType*/ {
      public:
      using declaring_type = HashSet_1<T>*;
      static constexpr std::string_view NESTED_NAME = "Slot";
      // System.Int32 hashCode
      // Size: 0x4
      // Offset: 0x0
      int hashCode;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 next
      // Size: 0x4
      // Offset: 0x0
      int next;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // T value
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      T value;
      // Creating value type constructor for type: Slot
      constexpr Slot(int hashCode_ = {}, int next_ = {}, T value_ = {}) noexcept : hashCode{hashCode_}, next{next_}, value{value_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Int32 hashCode
      int _get_hashCode() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Slot::_get_hashCode");
        static auto ___internal__instance = *this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(___internal__instance, "hashCode"));
      }
      // Autogenerated instance field setter
      // Set instance field: System.Int32 hashCode
      void _set_hashCode(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Slot::_set_hashCode");
        static auto ___internal__instance = *this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "hashCode", value));
      }
      // Autogenerated instance field getter
      // Get instance field: System.Int32 next
      int _get_next() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Slot::_get_next");
        static auto ___internal__instance = *this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(___internal__instance, "next"));
      }
      // Autogenerated instance field setter
      // Set instance field: System.Int32 next
      void _set_next(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Slot::_set_next");
        static auto ___internal__instance = *this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "next", value));
      }
      // Autogenerated instance field getter
      // Get instance field: T value
      T _get_value() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Slot::_get_value");
        static auto ___internal__instance = *this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<T>(___internal__instance, "value"));
      }
      // Autogenerated instance field setter
      // Set instance field: T value
      void _set_value(T value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Slot::_set_value");
        static auto ___internal__instance = *this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "value", value));
      }
    }; // System.Collections.Generic.HashSet`1/System.Collections.Generic.Slot
    // Could not write size check! Type: System.Collections.Generic.HashSet`1/System.Collections.Generic.Slot is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Collections.Generic.HashSet`1/System.Collections.Generic.Enumerator
    // [TokenAttribute] Offset: FFFFFFFF
    struct Enumerator : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public System::ValueType, public System::Collections::Generic::IEnumerator_1<T>*/ {
      public:
      using declaring_type = HashSet_1<T>*;
      static constexpr std::string_view NESTED_NAME = "Enumerator";
      // private System.Collections.Generic.HashSet`1<T> _set
      // Size: 0x8
      // Offset: 0x0
      System::Collections::Generic::HashSet_1<T>* set;
      // Field size check
      static_assert(sizeof(System::Collections::Generic::HashSet_1<T>*) == 0x8);
      // private System.Int32 _index
      // Size: 0x4
      // Offset: 0x0
      int index;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 _version
      // Size: 0x4
      // Offset: 0x0
      int version;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private T _current
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      T current;
      // Creating value type constructor for type: Enumerator
      constexpr Enumerator(System::Collections::Generic::HashSet_1<T>* set_ = {}, int index_ = {}, int version_ = {}, T current_ = {}) noexcept : set{set_}, index{index_}, version{version_}, current{current_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // Creating interface conversion operator: operator System::Collections::Generic::IEnumerator_1<T>
      operator System::Collections::Generic::IEnumerator_1<T>() noexcept {
        return *reinterpret_cast<System::Collections::Generic::IEnumerator_1<T>*>(this);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Collections.Generic.HashSet`1<T> _set
      System::Collections::Generic::HashSet_1<T>* _get__set() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::_get__set");
        static auto ___internal__instance = *this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<System::Collections::Generic::HashSet_1<T>*>(___internal__instance, "_set"));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Collections.Generic.HashSet`1<T> _set
      void _set__set(System::Collections::Generic::HashSet_1<T>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::_set__set");
        static auto ___internal__instance = *this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_set", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 _index
      int _get__index() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::_get__index");
        static auto ___internal__instance = *this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(___internal__instance, "_index"));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 _index
      void _set__index(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::_set__index");
        static auto ___internal__instance = *this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_index", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 _version
      int _get__version() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::_get__version");
        static auto ___internal__instance = *this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(___internal__instance, "_version"));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 _version
      void _set__version(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::_set__version");
        static auto ___internal__instance = *this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_version", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private T _current
      T _get__current() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::_get__current");
        static auto ___internal__instance = *this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<T>(___internal__instance, "_current"));
      }
      // Autogenerated instance field setter
      // Set instance field: private T _current
      void _set__current(T value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::_set__current");
        static auto ___internal__instance = *this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_current", value));
      }
      // public T get_Current()
      // Offset: 0xFFFFFFFF
      T get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::get_Current");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "get_Current", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodThrow<T, false>(*this, ___internal__method);
      }
      // private System.Object System.Collections.IEnumerator.get_Current()
      // Offset: 0xFFFFFFFF
      ::Il2CppObject* System_Collections_IEnumerator_get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::System.Collections.IEnumerator.get_Current");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "System.Collections.IEnumerator.get_Current", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodThrow<::Il2CppObject*, false>(*this, ___internal__method);
      }
      // System.Void .ctor(System.Collections.Generic.HashSet`1<T> set)
      // Offset: 0xFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      Enumerator(System::Collections::Generic::HashSet_1<T>* set) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::.ctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(set)})));
        ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, set);
      }
      // public System.Void Dispose()
      // Offset: 0xFFFFFFFF
      void Dispose() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::Dispose");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "Dispose", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method);
      }
      // public System.Boolean MoveNext()
      // Offset: 0xFFFFFFFF
      bool MoveNext() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::MoveNext");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "MoveNext", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodThrow<bool, false>(*this, ___internal__method);
      }
      // private System.Void System.Collections.IEnumerator.Reset()
      // Offset: 0xFFFFFFFF
      void System_Collections_IEnumerator_Reset() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Generic::HashSet_1::Enumerator::System.Collections.IEnumerator.Reset");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, "System.Collections.IEnumerator.Reset", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method);
      }
    }; // System.Collections.Generic.HashSet`1/System.Collections.Generic.Enumerator
    // Could not write size check! Type: System.Collections.Generic.HashSet`1/System.Collections.Generic.Enumerator is generic, or has no fields that are valid for size checks!
    // private System.Int32[] _buckets
    // Size: 0x8
    // Offset: 0x0
    ::Array<int>* buckets;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Collections.Generic.HashSet`1/System.Collections.Generic.Slot<T>[] _slots
    // Size: 0x8
    // Offset: 0x0
    ::Array<typename System::Collections::Generic::HashSet_1<T>::Slot>* slots;
    // Field size check
    static_assert(sizeof(::Array<typename System::Collections::Generic::HashSet_1<T>::Slot>*) == 0x8);
    // private System.Int32 _count
    // Size: 0x4
    // Offset: 0x0
    int count;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _lastIndex
    // Size: 0x4
    // Offset: 0x0
    int lastIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _freeList
    // Size: 0x4
    // Offset: 0x0
    int freeList;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.IEqualityComparer`1<T> _comparer
    // Size: 0x8
    // Offset: 0x0
    System::Collections::Generic::IEqualityComparer_1<T>* comparer;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::IEqualityComparer_1<T>*) == 0x8);
    // private System.Int32 _version
    // Size: 0x4
    // Offset: 0x0
    int version;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Runtime.Serialization.SerializationInfo _siInfo
    // Size: 0x8
    // Offset: 0x0
    System::Runtime::Serialization::SerializationInfo* siInfo;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::SerializationInfo*) == 0x8);
    // Creating value type constructor for type: HashSet_1
    HashSet_1(::Array<int>* buckets_ = {}, ::Array<typename System::Collections::Generic::HashSet_1<T>::Slot>* slots_ = {}, int count_ = {}, int lastIndex_ = {}, int freeList_ = {}, System::Collections::Generic::IEqualityComparer_1<T>* comparer_ = {}, int version_ = {}, System::Runtime::Serialization::SerializationInfo* siInfo_ = {}) noexcept : buckets{buckets_}, slots{slots_}, count{count_}, lastIndex{lastIndex_}, freeList{freeList_}, comparer{comparer_}, version{version_}, siInfo{siInfo_} {}
    // Creating interface conversion operator: operator System::Collections::Generic::ICollection_1<T>
    operator System::Collections::Generic::ICollection_1<T>() noexcept {
      return *reinterpret_cast<System::Collections::Generic::ICollection_1<T>*>(this);
    }
