// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include <stdint.h>
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IntPtr
  struct IntPtr;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
template<class T>
struct Array;
// Completed il2cpp-utils forward declares
// Type namespace: System.Net.NetworkInformation.MacOsStructs
namespace System::Net::NetworkInformation::MacOsStructs {
  // Autogenerated type: System.Net.NetworkInformation.MacOsStructs.sockaddr_dl
  struct sockaddr_dl : public System::ValueType {
    public:
    // public System.Byte sdl_len
    // Offset: 0x0
    uint8_t sdl_len;
    // public System.Byte sdl_family
    // Offset: 0x1
    uint8_t sdl_family;
    // public System.UInt16 sdl_index
    // Offset: 0x2
    uint16_t sdl_index;
    // public System.Byte sdl_type
    // Offset: 0x4
    uint8_t sdl_type;
    // public System.Byte sdl_nlen
    // Offset: 0x5
    uint8_t sdl_nlen;
    // public System.Byte sdl_alen
    // Offset: 0x6
    uint8_t sdl_alen;
    // public System.Byte sdl_slen
    // Offset: 0x7
    uint8_t sdl_slen;
    // public System.Byte[] sdl_data
    // Offset: 0x8
    ::Array<uint8_t>* sdl_data;
    // Creating value type constructor for type: sockaddr_dl
    constexpr sockaddr_dl(uint8_t sdl_len_ = {}, uint8_t sdl_family_ = {}, uint16_t sdl_index_ = {}, uint8_t sdl_type_ = {}, uint8_t sdl_nlen_ = {}, uint8_t sdl_alen_ = {}, uint8_t sdl_slen_ = {}, ::Array<uint8_t>* sdl_data_ = {}) noexcept : sdl_len{sdl_len_}, sdl_family{sdl_family_}, sdl_index{sdl_index_}, sdl_type{sdl_type_}, sdl_nlen{sdl_nlen_}, sdl_alen{sdl_alen_}, sdl_slen{sdl_slen_}, sdl_data{sdl_data_} {}
    // System.Void Read(System.IntPtr ptr)
    // Offset: 0xDA8AB8
    void Read(System::IntPtr ptr);
  }; // System.Net.NetworkInformation.MacOsStructs.sockaddr_dl
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Net::NetworkInformation::MacOsStructs::sockaddr_dl, "System.Net.NetworkInformation.MacOsStructs", "sockaddr_dl");
#pragma pack(pop)
