// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Completed includes
// Type namespace: UnityEngine.Experimental.U2D
namespace UnityEngine::Experimental::U2D {
  // Autogenerated type: UnityEngine.Experimental.U2D.SpriteIntermediateRendererInfo
  struct SpriteIntermediateRendererInfo : public System::ValueType {
    public:
    // public System.Int32 SpriteID
    // Offset: 0x0
    int SpriteID;
    // public System.Int32 TextureID
    // Offset: 0x4
    int TextureID;
    // public System.Int32 MaterialID
    // Offset: 0x8
    int MaterialID;
    // public UnityEngine.Color Color
    // Offset: 0xC
    UnityEngine::Color Color;
    // public UnityEngine.Matrix4x4 Transform
    // Offset: 0x1C
    UnityEngine::Matrix4x4 Transform;
    // public UnityEngine.Bounds Bounds
    // Offset: 0x5C
    UnityEngine::Bounds Bounds;
    // public System.Int32 Layer
    // Offset: 0x74
    int Layer;
    // public System.Int32 SortingLayer
    // Offset: 0x78
    int SortingLayer;
    // public System.Int32 SortingOrder
    // Offset: 0x7C
    int SortingOrder;
    // public System.UInt64 SceneCullingMask
    // Offset: 0x80
    uint64_t SceneCullingMask;
    // public System.IntPtr IndexData
    // Offset: 0x88
    System::IntPtr IndexData;
    // public System.IntPtr VertexData
    // Offset: 0x90
    System::IntPtr VertexData;
    // public System.Int32 IndexCount
    // Offset: 0x98
    int IndexCount;
    // public System.Int32 VertexCount
    // Offset: 0x9C
    int VertexCount;
    // public System.Int32 ShaderChannelMask
    // Offset: 0xA0
    int ShaderChannelMask;
    // Creating value type constructor for type: SpriteIntermediateRendererInfo
    constexpr SpriteIntermediateRendererInfo(int SpriteID_ = {}, int TextureID_ = {}, int MaterialID_ = {}, UnityEngine::Color Color_ = {}, UnityEngine::Matrix4x4 Transform_ = {}, UnityEngine::Bounds Bounds_ = {}, int Layer_ = {}, int SortingLayer_ = {}, int SortingOrder_ = {}, uint64_t SceneCullingMask_ = {}, System::IntPtr IndexData_ = {}, System::IntPtr VertexData_ = {}, int IndexCount_ = {}, int VertexCount_ = {}, int ShaderChannelMask_ = {}) noexcept : SpriteID{SpriteID_}, TextureID{TextureID_}, MaterialID{MaterialID_}, Color{Color_}, Transform{Transform_}, Bounds{Bounds_}, Layer{Layer_}, SortingLayer{SortingLayer_}, SortingOrder{SortingOrder_}, SceneCullingMask{SceneCullingMask_}, IndexData{IndexData_}, VertexData{VertexData_}, IndexCount{IndexCount_}, VertexCount{VertexCount_}, ShaderChannelMask{ShaderChannelMask_} {}
  }; // UnityEngine.Experimental.U2D.SpriteIntermediateRendererInfo
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Experimental::U2D::SpriteIntermediateRendererInfo, "UnityEngine.Experimental.U2D", "SpriteIntermediateRendererInfo");
#pragma pack(pop)
