// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Newtonsoft::Json::Utilities
namespace Newtonsoft::Json::Utilities {
  // Forward declaring type: MethodCall`2<T, TResult>
  template<typename T, typename TResult>
  class MethodCall_2;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: MethodInfo
  class MethodInfo;
  // Forward declaring type: Assembly
  class Assembly;
  // Forward declaring type: BindingFlags
  struct BindingFlags;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: Newtonsoft::Json::Serialization
namespace Newtonsoft::Json::Serialization {
  // Forward declaring type: ObjectConstructor`1<T>
  template<typename T>
  class ObjectConstructor_1;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json.Utilities
namespace Newtonsoft::Json::Utilities {
  // Forward declaring type: FSharpUtils
  class FSharpUtils;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Newtonsoft::Json::Utilities::FSharpUtils);
DEFINE_IL2CPP_ARG_TYPE(::Newtonsoft::Json::Utilities::FSharpUtils*, "Newtonsoft.Json.Utilities", "FSharpUtils");
// Type namespace: Newtonsoft.Json.Utilities
namespace Newtonsoft::Json::Utilities {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: Newtonsoft.Json.Utilities.FSharpUtils
  // [TokenAttribute] Offset: FFFFFFFF
  // [NullableContextAttribute] Offset: 1201FF4
  // [NullableAttribute] Offset: 1201FF4
  class FSharpUtils : public ::Il2CppObject {
    public:
    // Nested type: ::Newtonsoft::Json::Utilities::FSharpUtils::$$c__DisplayClass52_0
    class $$c__DisplayClass52_0;
    // Nested type: ::Newtonsoft::Json::Utilities::FSharpUtils::$$c__DisplayClass55_0_2<TKey, TValue>
    template<typename TKey, typename TValue>
    class $$c__DisplayClass55_0_2;
    // Nested type: ::Newtonsoft::Json::Utilities::FSharpUtils::$$c__55_2<TKey, TValue>
    template<typename TKey, typename TValue>
    class $$c__55_2;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Reflection.MethodInfo _ofSeq
    // Size: 0x8
    // Offset: 0x10
    ::System::Reflection::MethodInfo* ofSeq;
    // Field size check
    static_assert(sizeof(::System::Reflection::MethodInfo*) == 0x8);
    // private System.Type _mapType
    // Size: 0x8
    // Offset: 0x18
    ::System::Type* mapType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private System.Reflection.Assembly <FSharpCoreAssembly>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::System::Reflection::Assembly* FSharpCoreAssembly;
    // Field size check
    static_assert(sizeof(::System::Reflection::Assembly*) == 0x8);
    // [NullableAttribute] Offset: 0x1204930
    // private Newtonsoft.Json.Utilities.MethodCall`2<System.Object,System.Object> <IsUnion>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>* IsUnion;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    // [NullableAttribute] Offset: 0x12049B4
    // private Newtonsoft.Json.Utilities.MethodCall`2<System.Object,System.Object> <GetUnionCases>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>* GetUnionCases;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    // [NullableAttribute] Offset: 0x1204A38
    // private Newtonsoft.Json.Utilities.MethodCall`2<System.Object,System.Object> <PreComputeUnionTagReader>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>* PreComputeUnionTagReader;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    // [NullableAttribute] Offset: 0x1204ABC
    // private Newtonsoft.Json.Utilities.MethodCall`2<System.Object,System.Object> <PreComputeUnionReader>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>* PreComputeUnionReader;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    // [NullableAttribute] Offset: 0x1204B40
    // private Newtonsoft.Json.Utilities.MethodCall`2<System.Object,System.Object> <PreComputeUnionConstructor>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>* PreComputeUnionConstructor;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    // private System.Func`2<System.Object,System.Object> <GetUnionCaseInfoDeclaringType>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::System::Func_2<::Il2CppObject*, ::Il2CppObject*>* GetUnionCaseInfoDeclaringType;
    // Field size check
    static_assert(sizeof(::System::Func_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    // private System.Func`2<System.Object,System.Object> <GetUnionCaseInfoName>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::System::Func_2<::Il2CppObject*, ::Il2CppObject*>* GetUnionCaseInfoName;
    // Field size check
    static_assert(sizeof(::System::Func_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    // private System.Func`2<System.Object,System.Object> <GetUnionCaseInfoTag>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::System::Func_2<::Il2CppObject*, ::Il2CppObject*>* GetUnionCaseInfoTag;
    // Field size check
    static_assert(sizeof(::System::Func_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    // [NullableAttribute] Offset: 0x1204BF4
    // private Newtonsoft.Json.Utilities.MethodCall`2<System.Object,System.Object> <GetUnionCaseInfoFields>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>* GetUnionCaseInfoFields;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Utilities::MethodCall_2<::Il2CppObject*, ::Il2CppObject*>*) == 0x8);
    public:
    // Get static field: static private readonly System.Object Lock
    static ::Il2CppObject* _get_Lock();
    // Set static field: static private readonly System.Object Lock
    static void _set_Lock(::Il2CppObject* value);
    // [NullableAttribute] Offset: 0x120490C
    // Get static field: static private Newtonsoft.Json.Utilities.FSharpUtils _instance
    static ::Newtonsoft::Json::Utilities::FSharpUtils* _get__instance();
    // Set static field: static private Newtonsoft.Json.Utilities.FSharpUtils _instance
    static void _set__instance(::Newtonsoft::Json::Utilities::FSharpUtils* value);
    // Get instance field reference: private System.Reflection.MethodInfo _ofSeq
