// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: TMPro.ITweenValue
#include "TMPro/ITweenValue.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Skipping declaration: ColorTweenMode because it is already included!
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityAction`1<T0>
  template<typename T0>
  class UnityAction_1;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Size: 0x31
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: TMPro.ColorTween
  struct ColorTween/*, public System::ValueType, public TMPro::ITweenValue*/ {
    public:
    // Nested type: TMPro::ColorTween::ColorTweenMode
    struct ColorTweenMode;
    // Nested type: TMPro::ColorTween::ColorTweenCallback
    class ColorTweenCallback;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TMPro.ColorTween/ColorTweenMode
    struct ColorTweenMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ColorTweenMode
      constexpr ColorTweenMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.ColorTween/ColorTweenMode All
      static constexpr const int All = 0;
      // Get static field: static public TMPro.ColorTween/ColorTweenMode All
      static TMPro::ColorTween::ColorTweenMode _get_All();
      // Set static field: static public TMPro.ColorTween/ColorTweenMode All
      static void _set_All(TMPro::ColorTween::ColorTweenMode value);
      // static field const value: static public TMPro.ColorTween/ColorTweenMode RGB
      static constexpr const int RGB = 1;
      // Get static field: static public TMPro.ColorTween/ColorTweenMode RGB
      static TMPro::ColorTween::ColorTweenMode _get_RGB();
      // Set static field: static public TMPro.ColorTween/ColorTweenMode RGB
      static void _set_RGB(TMPro::ColorTween::ColorTweenMode value);
      // static field const value: static public TMPro.ColorTween/ColorTweenMode Alpha
      static constexpr const int Alpha = 2;
      // Get static field: static public TMPro.ColorTween/ColorTweenMode Alpha
      static TMPro::ColorTween::ColorTweenMode _get_Alpha();
      // Set static field: static public TMPro.ColorTween/ColorTweenMode Alpha
      static void _set_Alpha(TMPro::ColorTween::ColorTweenMode value);
    }; // TMPro.ColorTween/ColorTweenMode
    #pragma pack(pop)
    static check_size<sizeof(ColorTween::ColorTweenMode), 0 + sizeof(int)> __TMPro_ColorTween_ColorTweenModeSizeCheck;
    static_assert(sizeof(ColorTween::ColorTweenMode) == 0x4);
    // private TMPro.ColorTween/ColorTweenCallback m_Target
    // Size: 0x8
    // Offset: 0x0
    TMPro::ColorTween::ColorTweenCallback* m_Target;
    // Field size check
    static_assert(sizeof(TMPro::ColorTween::ColorTweenCallback*) == 0x8);
    // private UnityEngine.Color m_StartColor
    // Size: 0x10
    // Offset: 0x8
    UnityEngine::Color m_StartColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // private UnityEngine.Color m_TargetColor
    // Size: 0x10
    // Offset: 0x18
    UnityEngine::Color m_TargetColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // private TMPro.ColorTween/ColorTweenMode m_TweenMode
    // Size: 0x4
    // Offset: 0x28
    TMPro::ColorTween::ColorTweenMode m_TweenMode;
    // Field size check
    static_assert(sizeof(TMPro::ColorTween::ColorTweenMode) == 0x4);
    // private System.Single m_Duration
    // Size: 0x4
    // Offset: 0x2C
    float m_Duration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_IgnoreTimeScale
    // Size: 0x1
    // Offset: 0x30
    bool m_IgnoreTimeScale;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: ColorTween
    constexpr ColorTween(TMPro::ColorTween::ColorTweenCallback* m_Target_ = {}, UnityEngine::Color m_StartColor_ = {}, UnityEngine::Color m_TargetColor_ = {}, TMPro::ColorTween::ColorTweenMode m_TweenMode_ = {}, float m_Duration_ = {}, bool m_IgnoreTimeScale_ = {}) noexcept : m_Target{m_Target_}, m_StartColor{m_StartColor_}, m_TargetColor{m_TargetColor_}, m_TweenMode{m_TweenMode_}, m_Duration{m_Duration_}, m_IgnoreTimeScale{m_IgnoreTimeScale_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator TMPro::ITweenValue
    operator TMPro::ITweenValue() noexcept {
      return *reinterpret_cast<TMPro::ITweenValue*>(this);
    }
    // public UnityEngine.Color get_startColor()
    // Offset: 0xEE4D9C
    UnityEngine::Color get_startColor();
    // public System.Void set_startColor(UnityEngine.Color value)
    // Offset: 0xEE4DA8
    void set_startColor(UnityEngine::Color value);
    // public UnityEngine.Color get_targetColor()
    // Offset: 0xEE4DB4
    UnityEngine::Color get_targetColor();
    // public System.Void set_targetColor(UnityEngine.Color value)
    // Offset: 0xEE4DC0
    void set_targetColor(UnityEngine::Color value);
    // public TMPro.ColorTween/ColorTweenMode get_tweenMode()
    // Offset: 0xEE4DCC
    TMPro::ColorTween::ColorTweenMode get_tweenMode();
    // public System.Void set_tweenMode(TMPro.ColorTween/ColorTweenMode value)
    // Offset: 0xEE4DD4
    void set_tweenMode(TMPro::ColorTween::ColorTweenMode value);
    // public System.Single get_duration()
    // Offset: 0xEE4DDC
    float get_duration();
    // public System.Void set_duration(System.Single value)
    // Offset: 0xEE4DE4
    void set_duration(float value);
    // public System.Boolean get_ignoreTimeScale()
    // Offset: 0xEE4DEC
    bool get_ignoreTimeScale();
    // public System.Void set_ignoreTimeScale(System.Boolean value)
    // Offset: 0xEE4DF4
    void set_ignoreTimeScale(bool value);
    // public System.Void TweenValue(System.Single floatPercentage)
    // Offset: 0xEE4E00
    void TweenValue(float floatPercentage);
    // public System.Void AddOnChangedCallback(UnityEngine.Events.UnityAction`1<UnityEngine.Color> callback)
    // Offset: 0xEE4E08
    void AddOnChangedCallback(UnityEngine::Events::UnityAction_1<UnityEngine::Color>* callback);
    // public System.Boolean GetIgnoreTimescale()
    // Offset: 0xEE4E10
    bool GetIgnoreTimescale();
    // public System.Single GetDuration()
    // Offset: 0xEE4E18
    float GetDuration();
    // public System.Boolean ValidTarget()
    // Offset: 0xEE4E20
    bool ValidTarget();
  }; // TMPro.ColorTween
  #pragma pack(pop)
  static check_size<sizeof(ColorTween), 48 + sizeof(bool)> __TMPro_ColorTweenSizeCheck;
  static_assert(sizeof(ColorTween) == 0x31);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(TMPro::ColorTween, "TMPro", "ColorTween");
DEFINE_IL2CPP_ARG_TYPE(TMPro::ColorTween::ColorTweenMode, "TMPro", "ColorTween/ColorTweenMode");
// Writing MetadataGetter for method: ColorTween::get_startColor
// Il2CppName: get_startColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<UnityEngine::Color (ColorTween::*)()>(&ColorTween::get_startColor)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "get_startColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: ColorTween::set_startColor
// Il2CppName: set_startColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (ColorTween::*)(UnityEngine::Color)>(&ColorTween::set_startColor)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "set_startColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<UnityEngine::Color>()});
  }
};
// Writing MetadataGetter for method: ColorTween::get_targetColor
// Il2CppName: get_targetColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<UnityEngine::Color (ColorTween::*)()>(&ColorTween::get_targetColor)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "get_targetColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: ColorTween::set_targetColor
// Il2CppName: set_targetColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (ColorTween::*)(UnityEngine::Color)>(&ColorTween::set_targetColor)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "set_targetColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<UnityEngine::Color>()});
  }
};
// Writing MetadataGetter for method: ColorTween::get_tweenMode
// Il2CppName: get_tweenMode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<TMPro::ColorTween::ColorTweenMode (ColorTween::*)()>(&ColorTween::get_tweenMode)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "get_tweenMode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: ColorTween::set_tweenMode
// Il2CppName: set_tweenMode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (ColorTween::*)(TMPro::ColorTween::ColorTweenMode)>(&ColorTween::set_tweenMode)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "set_tweenMode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<TMPro::ColorTween::ColorTweenMode>()});
  }
};
// Writing MetadataGetter for method: ColorTween::get_duration
// Il2CppName: get_duration
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (ColorTween::*)()>(&ColorTween::get_duration)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "get_duration", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: ColorTween::set_duration
// Il2CppName: set_duration
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (ColorTween::*)(float)>(&ColorTween::set_duration)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "set_duration", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<float>()});
  }
};
// Writing MetadataGetter for method: ColorTween::get_ignoreTimeScale
// Il2CppName: get_ignoreTimeScale
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (ColorTween::*)()>(&ColorTween::get_ignoreTimeScale)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "get_ignoreTimeScale", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: ColorTween::set_ignoreTimeScale
// Il2CppName: set_ignoreTimeScale
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (ColorTween::*)(bool)>(&ColorTween::set_ignoreTimeScale)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "set_ignoreTimeScale", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<bool>()});
  }
};
// Writing MetadataGetter for method: ColorTween::TweenValue
// Il2CppName: TweenValue
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (ColorTween::*)(float)>(&ColorTween::TweenValue)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "TweenValue", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<float>()});
  }
};
// Writing MetadataGetter for method: ColorTween::AddOnChangedCallback
// Il2CppName: AddOnChangedCallback
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (ColorTween::*)(UnityEngine::Events::UnityAction_1<UnityEngine::Color>*)>(&ColorTween::AddOnChangedCallback)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "AddOnChangedCallback", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<UnityEngine::Events::UnityAction_1<UnityEngine::Color>*>()});
  }
};
// Writing MetadataGetter for method: ColorTween::GetIgnoreTimescale
// Il2CppName: GetIgnoreTimescale
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (ColorTween::*)()>(&ColorTween::GetIgnoreTimescale)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "GetIgnoreTimescale", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: ColorTween::GetDuration
// Il2CppName: GetDuration
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (ColorTween::*)()>(&ColorTween::GetDuration)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "GetDuration", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: ColorTween::ValidTarget
// Il2CppName: ValidTarget
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (ColorTween::*)()>(&ColorTween::ValidTarget)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(ColorTween), "ValidTarget", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
