// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: TMPro
namespace TMPro {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: TMPro.FaceInfo_Legacy
  class FaceInfo_Legacy : public ::Il2CppObject {
    public:
    // public System.String Name
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* Name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.Single PointSize
    // Size: 0x4
    // Offset: 0x18
    float PointSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Scale
    // Size: 0x4
    // Offset: 0x1C
    float Scale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 CharacterCount
    // Size: 0x4
    // Offset: 0x20
    int CharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single LineHeight
    // Size: 0x4
    // Offset: 0x24
    float LineHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Baseline
    // Size: 0x4
    // Offset: 0x28
    float Baseline;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Ascender
    // Size: 0x4
    // Offset: 0x2C
    float Ascender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single CapHeight
    // Size: 0x4
    // Offset: 0x30
    float CapHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Descender
    // Size: 0x4
    // Offset: 0x34
    float Descender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single CenterLine
    // Size: 0x4
    // Offset: 0x38
    float CenterLine;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single SuperscriptOffset
    // Size: 0x4
    // Offset: 0x3C
    float SuperscriptOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single SubscriptOffset
    // Size: 0x4
    // Offset: 0x40
    float SubscriptOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single SubSize
    // Size: 0x4
    // Offset: 0x44
    float SubSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Underline
    // Size: 0x4
    // Offset: 0x48
    float Underline;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single UnderlineThickness
    // Size: 0x4
    // Offset: 0x4C
    float UnderlineThickness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single strikethrough
    // Size: 0x4
    // Offset: 0x50
    float strikethrough;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single strikethroughThickness
    // Size: 0x4
    // Offset: 0x54
    float strikethroughThickness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single TabWidth
    // Size: 0x4
    // Offset: 0x58
    float TabWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Padding
    // Size: 0x4
    // Offset: 0x5C
    float Padding;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single AtlasWidth
    // Size: 0x4
    // Offset: 0x60
    float AtlasWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single AtlasHeight
    // Size: 0x4
    // Offset: 0x64
    float AtlasHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: FaceInfo_Legacy
    FaceInfo_Legacy(::Il2CppString* Name_ = {}, float PointSize_ = {}, float Scale_ = {}, int CharacterCount_ = {}, float LineHeight_ = {}, float Baseline_ = {}, float Ascender_ = {}, float CapHeight_ = {}, float Descender_ = {}, float CenterLine_ = {}, float SuperscriptOffset_ = {}, float SubscriptOffset_ = {}, float SubSize_ = {}, float Underline_ = {}, float UnderlineThickness_ = {}, float strikethrough_ = {}, float strikethroughThickness_ = {}, float TabWidth_ = {}, float Padding_ = {}, float AtlasWidth_ = {}, float AtlasHeight_ = {}) noexcept : Name{Name_}, PointSize{PointSize_}, Scale{Scale_}, CharacterCount{CharacterCount_}, LineHeight{LineHeight_}, Baseline{Baseline_}, Ascender{Ascender_}, CapHeight{CapHeight_}, Descender{Descender_}, CenterLine{CenterLine_}, SuperscriptOffset{SuperscriptOffset_}, SubscriptOffset{SubscriptOffset_}, SubSize{SubSize_}, Underline{Underline_}, UnderlineThickness{UnderlineThickness_}, strikethrough{strikethrough_}, strikethroughThickness{strikethroughThickness_}, TabWidth{TabWidth_}, Padding{Padding_}, AtlasWidth{AtlasWidth_}, AtlasHeight{AtlasHeight_} {}
    // public System.Void .ctor()
    // Offset: 0x10E32C8
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FaceInfo_Legacy* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("TMPro::FaceInfo_Legacy::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FaceInfo_Legacy*, creationType>()));
    }
  }; // TMPro.FaceInfo_Legacy
  #pragma pack(pop)
  static check_size<sizeof(FaceInfo_Legacy), 100 + sizeof(float)> __TMPro_FaceInfo_LegacySizeCheck;
  static_assert(sizeof(FaceInfo_Legacy) == 0x68);
}
DEFINE_IL2CPP_ARG_TYPE(TMPro::FaceInfo_Legacy*, "TMPro", "FaceInfo_Legacy");
// Writing includes for template specializations
// Writing MetadataGetter for method: TMPro::FaceInfo_Legacy::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
