// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Type namespace: TMPro
namespace TMPro {
  // Autogenerated type: TMPro.FaceInfo_Legacy
  class FaceInfo_Legacy : public ::Il2CppObject {
    public:
    // public System.String Name
    // Offset: 0x10
    ::Il2CppString* Name;
    // public System.Single PointSize
    // Offset: 0x18
    float PointSize;
    // public System.Single Scale
    // Offset: 0x1C
    float Scale;
    // public System.Int32 CharacterCount
    // Offset: 0x20
    int CharacterCount;
    // public System.Single LineHeight
    // Offset: 0x24
    float LineHeight;
    // public System.Single Baseline
    // Offset: 0x28
    float Baseline;
    // public System.Single Ascender
    // Offset: 0x2C
    float Ascender;
    // public System.Single CapHeight
    // Offset: 0x30
    float CapHeight;
    // public System.Single Descender
    // Offset: 0x34
    float Descender;
    // public System.Single CenterLine
    // Offset: 0x38
    float CenterLine;
    // public System.Single SuperscriptOffset
    // Offset: 0x3C
    float SuperscriptOffset;
    // public System.Single SubscriptOffset
    // Offset: 0x40
    float SubscriptOffset;
    // public System.Single SubSize
    // Offset: 0x44
    float SubSize;
    // public System.Single Underline
    // Offset: 0x48
    float Underline;
    // public System.Single UnderlineThickness
    // Offset: 0x4C
    float UnderlineThickness;
    // public System.Single strikethrough
    // Offset: 0x50
    float strikethrough;
    // public System.Single strikethroughThickness
    // Offset: 0x54
    float strikethroughThickness;
    // public System.Single TabWidth
    // Offset: 0x58
    float TabWidth;
    // public System.Single Padding
    // Offset: 0x5C
    float Padding;
    // public System.Single AtlasWidth
    // Offset: 0x60
    float AtlasWidth;
    // public System.Single AtlasHeight
    // Offset: 0x64
    float AtlasHeight;
    // public System.Void .ctor()
    // Offset: 0xB504EC
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static FaceInfo_Legacy* New_ctor();
  }; // TMPro.FaceInfo_Legacy
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(TMPro::FaceInfo_Legacy*, "TMPro", "FaceInfo_Legacy");
#pragma pack(pop)
