// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: TMPro.ITweenValue
#include "TMPro/ITweenValue.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityAction`1<T0>
  template<typename T0>
  class UnityAction_1;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Size: 0x15
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: TMPro.FloatTween
  struct FloatTween/*, public System::ValueType, public TMPro::ITweenValue*/ {
    public:
    // Nested type: TMPro::FloatTween::FloatTweenCallback
    class FloatTweenCallback;
    // private TMPro.FloatTween/FloatTweenCallback m_Target
    // Size: 0x8
    // Offset: 0x0
    TMPro::FloatTween::FloatTweenCallback* m_Target;
    // Field size check
    static_assert(sizeof(TMPro::FloatTween::FloatTweenCallback*) == 0x8);
    // private System.Single m_StartValue
    // Size: 0x4
    // Offset: 0x8
    float m_StartValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TargetValue
    // Size: 0x4
    // Offset: 0xC
    float m_TargetValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_Duration
    // Size: 0x4
    // Offset: 0x10
    float m_Duration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_IgnoreTimeScale
    // Size: 0x1
    // Offset: 0x14
    bool m_IgnoreTimeScale;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: FloatTween
    constexpr FloatTween(TMPro::FloatTween::FloatTweenCallback* m_Target_ = {}, float m_StartValue_ = {}, float m_TargetValue_ = {}, float m_Duration_ = {}, bool m_IgnoreTimeScale_ = {}) noexcept : m_Target{m_Target_}, m_StartValue{m_StartValue_}, m_TargetValue{m_TargetValue_}, m_Duration{m_Duration_}, m_IgnoreTimeScale{m_IgnoreTimeScale_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator TMPro::ITweenValue
    operator TMPro::ITweenValue() noexcept {
      return *reinterpret_cast<TMPro::ITweenValue*>(this);
    }
    // public System.Single get_startValue()
    // Offset: 0xDF41A4
    float get_startValue();
    // public System.Void set_startValue(System.Single value)
    // Offset: 0xDF41AC
    void set_startValue(float value);
    // public System.Single get_targetValue()
    // Offset: 0xDF41B4
    float get_targetValue();
    // public System.Void set_targetValue(System.Single value)
    // Offset: 0xDF41BC
    void set_targetValue(float value);
    // public System.Single get_duration()
    // Offset: 0xDF41C4
    float get_duration();
    // public System.Void set_duration(System.Single value)
    // Offset: 0xDF41CC
    void set_duration(float value);
    // public System.Boolean get_ignoreTimeScale()
    // Offset: 0xDF41D4
    bool get_ignoreTimeScale();
    // public System.Void set_ignoreTimeScale(System.Boolean value)
    // Offset: 0xDF41DC
    void set_ignoreTimeScale(bool value);
    // public System.Void TweenValue(System.Single floatPercentage)
    // Offset: 0xDF41E8
    void TweenValue(float floatPercentage);
    // public System.Void AddOnChangedCallback(UnityEngine.Events.UnityAction`1<System.Single> callback)
    // Offset: 0xDF41F0
    void AddOnChangedCallback(UnityEngine::Events::UnityAction_1<float>* callback);
    // public System.Boolean GetIgnoreTimescale()
    // Offset: 0xDF41F8
    bool GetIgnoreTimescale();
    // public System.Single GetDuration()
    // Offset: 0xDF4200
    float GetDuration();
    // public System.Boolean ValidTarget()
    // Offset: 0xDF4208
    bool ValidTarget();
  }; // TMPro.FloatTween
  #pragma pack(pop)
  static check_size<sizeof(FloatTween), 20 + sizeof(bool)> __TMPro_FloatTweenSizeCheck;
  static_assert(sizeof(FloatTween) == 0x15);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(TMPro::FloatTween, "TMPro", "FloatTween");
