// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: TMPro.TextContainerAnchors
#include "TMPro/TextContainerAnchors.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshPro
  class TextMeshPro;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Autogenerated type: TMPro.TextContainer
  class TextContainer : public UnityEngine::EventSystems::UIBehaviour {
    public:
    // private System.Boolean m_hasChanged
    // Offset: 0x18
    bool m_hasChanged;
    // private UnityEngine.Vector2 m_pivot
    // Offset: 0x1C
    UnityEngine::Vector2 m_pivot;
    // private TMPro.TextContainerAnchors m_anchorPosition
    // Offset: 0x24
    TMPro::TextContainerAnchors m_anchorPosition;
    // private UnityEngine.Rect m_rect
    // Offset: 0x28
    UnityEngine::Rect m_rect;
    // private System.Boolean m_isDefaultWidth
    // Offset: 0x38
    bool m_isDefaultWidth;
    // private System.Boolean m_isDefaultHeight
    // Offset: 0x39
    bool m_isDefaultHeight;
    // private System.Boolean m_isAutoFitting
    // Offset: 0x3A
    bool m_isAutoFitting;
    // private UnityEngine.Vector3[] m_corners
    // Offset: 0x40
    ::Array<UnityEngine::Vector3>* m_corners;
    // private UnityEngine.Vector3[] m_worldCorners
    // Offset: 0x48
    ::Array<UnityEngine::Vector3>* m_worldCorners;
    // private UnityEngine.Vector4 m_margins
    // Offset: 0x50
    UnityEngine::Vector4 m_margins;
    // private UnityEngine.RectTransform m_rectTransform
    // Offset: 0x60
    UnityEngine::RectTransform* m_rectTransform;
    // private TMPro.TextMeshPro m_textMeshPro
    // Offset: 0x68
    TMPro::TextMeshPro* m_textMeshPro;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get static field: static private UnityEngine.Vector2 k_defaultSize
    static UnityEngine::Vector2 _get_k_defaultSize();
    // Set static field: static private UnityEngine.Vector2 k_defaultSize
    static void _set_k_defaultSize(UnityEngine::Vector2 value);
    // public System.Boolean get_hasChanged()
    // Offset: 0xDC9EDC
    bool get_hasChanged();
    // public System.Void set_hasChanged(System.Boolean value)
    // Offset: 0xDC9EE4
    void set_hasChanged(bool value);
    // public UnityEngine.Vector2 get_pivot()
    // Offset: 0xDC9EF0
    UnityEngine::Vector2 get_pivot();
    // public System.Void set_pivot(UnityEngine.Vector2 value)
    // Offset: 0xDC9EF8
    void set_pivot(UnityEngine::Vector2 value);
    // public TMPro.TextContainerAnchors get_anchorPosition()
    // Offset: 0xDCA424
    TMPro::TextContainerAnchors get_anchorPosition();
    // public System.Void set_anchorPosition(TMPro.TextContainerAnchors value)
    // Offset: 0xDCA42C
    void set_anchorPosition(TMPro::TextContainerAnchors value);
    // public UnityEngine.Rect get_rect()
    // Offset: 0xDCA580
    UnityEngine::Rect get_rect();
    // public System.Void set_rect(UnityEngine.Rect value)
    // Offset: 0xDCA58C
    void set_rect(UnityEngine::Rect value);
    // public UnityEngine.Vector2 get_size()
    // Offset: 0xDCA618
    UnityEngine::Vector2 get_size();
    // public System.Void set_size(UnityEngine.Vector2 value)
    // Offset: 0xDCA67C
    void set_size(UnityEngine::Vector2 value);
    // public System.Single get_width()
    // Offset: 0xDCA7EC
    float get_width();
    // public System.Void set_width(System.Single value)
    // Offset: 0xDCA7F8
    void set_width(float value);
    // public System.Single get_height()
    // Offset: 0xDCA86C
    float get_height();
    // public System.Void set_height(System.Single value)
    // Offset: 0xDCA878
    void set_height(float value);
    // public System.Boolean get_isDefaultWidth()
    // Offset: 0xDCA8E8
    bool get_isDefaultWidth();
    // public System.Boolean get_isDefaultHeight()
    // Offset: 0xDCA8F0
    bool get_isDefaultHeight();
    // public System.Boolean get_isAutoFitting()
    // Offset: 0xDCA8F8
    bool get_isAutoFitting();
    // public System.Void set_isAutoFitting(System.Boolean value)
    // Offset: 0xDCA900
    void set_isAutoFitting(bool value);
    // public UnityEngine.Vector3[] get_corners()
    // Offset: 0xDCA90C
    ::Array<UnityEngine::Vector3>* get_corners();
    // public UnityEngine.Vector3[] get_worldCorners()
    // Offset: 0xDCA914
    ::Array<UnityEngine::Vector3>* get_worldCorners();
    // public UnityEngine.Vector4 get_margins()
    // Offset: 0xDCA91C
    UnityEngine::Vector4 get_margins();
    // public System.Void set_margins(UnityEngine.Vector4 value)
    // Offset: 0xDCA928
    void set_margins(UnityEngine::Vector4 value);
    // public UnityEngine.RectTransform get_rectTransform()
    // Offset: 0xDCAA1C
    UnityEngine::RectTransform* get_rectTransform();
    // public TMPro.TextMeshPro get_textMeshPro()
    // Offset: 0xDCAAC8
    TMPro::TextMeshPro* get_textMeshPro();
    // private System.Void OnContainerChanged()
    // Offset: 0xDCA2E8
    void OnContainerChanged();
    // private System.Void SetRect(UnityEngine.Vector2 size)
    // Offset: 0xDCA768
    void SetRect(UnityEngine::Vector2 size);
    // private System.Void UpdateCorners()
    // Offset: 0xDCAC34
    void UpdateCorners();
    // private UnityEngine.Vector2 GetPivot(TMPro.TextContainerAnchors anchor)
    // Offset: 0xDCA470
    UnityEngine::Vector2 GetPivot(TMPro::TextContainerAnchors anchor);
    // private TMPro.TextContainerAnchors GetAnchorPosition(UnityEngine.Vector2 pivot)
    // Offset: 0xDC9FC4
    TMPro::TextContainerAnchors GetAnchorPosition(UnityEngine::Vector2 pivot);
    // protected override System.Void Awake()
    // Offset: 0xDCAB74
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::Awake()
    void Awake();
    // protected override System.Void OnEnable()
    // Offset: 0xDCAC2C
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnEnable()
    void OnEnable();
    // protected override System.Void OnDisable()
    // Offset: 0xDCAC30
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnDisable()
    void OnDisable();
    // protected override System.Void OnRectTransformDimensionsChange()
    // Offset: 0xDCAEA4
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnRectTransformDimensionsChange()
    void OnRectTransformDimensionsChange();
    // public System.Void .ctor()
    // Offset: 0xDCB040
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static TextContainer* New_ctor();
    // static private System.Void .cctor()
    // Offset: 0xDCB0D0
    // Implemented from: UnityEngine.Object
    // Base method: System.Void Object::.cctor()
    static void _cctor();
  }; // TMPro.TextContainer
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(TMPro::TextContainer*, "TMPro", "TextContainer");
#pragma pack(pop)
