// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TMPro.TMP_Text
#include "TMPro/TMP_Text.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: TMPro.MaskingTypes
#include "TMPro/MaskingTypes.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Skipping declaration: Vector4 because it is already included!
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Material
  class Material;
  // Skipping declaration: Color32 because it is already included!
  // Forward declaring type: Bounds
  struct Bounds;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_SubMesh
  class TMP_SubMesh;
  // Forward declaring type: TextContainer
  class TextContainer;
  // Forward declaring type: TMP_TextInfo
  class TMP_TextInfo;
  // Forward declaring type: TMP_VertexDataUpdateFlags
  struct TMP_VertexDataUpdateFlags;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshPro
  class TextMeshPro;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::TMPro::TextMeshPro);
DEFINE_IL2CPP_ARG_TYPE(::TMPro::TextMeshPro*, "TMPro", "TextMeshPro");
// Type namespace: TMPro
namespace TMPro {
  // WARNING Size may be invalid!
  // Autogenerated type: TMPro.TextMeshPro
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [RequireComponent] Offset: 108FFE0
  // [RequireComponent] Offset: 108FFE0
  // [AddComponentMenu] Offset: 108FFE0
  // [ExecuteAlways] Offset: FFFFFFFF
  class TextMeshPro : public ::TMPro::TMP_Text/*, public ::UnityEngine::UI::ILayoutElement*/ {
    public:
    public:
    // private System.Boolean m_hasFontAssetChanged
    // Size: 0x1
    // Offset: 0xB30
    bool m_hasFontAssetChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_previousLossyScaleY
    // Size: 0x4
    // Offset: 0xB34
    float m_previousLossyScaleY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Renderer m_renderer
    // Size: 0x8
    // Offset: 0xB38
    ::UnityEngine::Renderer* m_renderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private UnityEngine.MeshFilter m_meshFilter
    // Size: 0x8
    // Offset: 0xB40
    ::UnityEngine::MeshFilter* m_meshFilter;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // private System.Boolean m_isFirstAllocation
    // Size: 0x1
    // Offset: 0xB48
    bool m_isFirstAllocation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 m_max_characters
    // Size: 0x4
    // Offset: 0xB4C
    int m_max_characters;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_max_numberOfLines
    // Size: 0x4
    // Offset: 0xB50
    int m_max_numberOfLines;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected TMPro.TMP_SubMesh[] m_subTextObjects
    // Size: 0x8
    // Offset: 0xB58
    ::ArrayW<::TMPro::TMP_SubMesh*> m_subTextObjects;
    // Field size check
    static_assert(sizeof(::ArrayW<::TMPro::TMP_SubMesh*>) == 0x8);
    // private System.Boolean m_isMaskingEnabled
    // Size: 0x1
    // Offset: 0xB60
    bool m_isMaskingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isMaskUpdateRequired
    // Size: 0x1
    // Offset: 0xB61
    bool isMaskUpdateRequired;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private TMPro.MaskingTypes m_maskType
    // Size: 0x4
    // Offset: 0xB64
    ::TMPro::MaskingTypes m_maskType;
    // Field size check
    static_assert(sizeof(::TMPro::MaskingTypes) == 0x4);
    // private UnityEngine.Matrix4x4 m_EnvMapMatrix
    // Size: 0x40
    // Offset: 0xB68
    ::UnityEngine::Matrix4x4 m_EnvMapMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Vector3[] m_RectTransformCorners
    // Size: 0x8
    // Offset: 0xBA8
    ::ArrayW<::UnityEngine::Vector3> m_RectTransformCorners;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Boolean m_isRegisteredForEvents
    // Size: 0x1
    // Offset: 0xBB0
    bool m_isRegisteredForEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 loopCountA
    // Size: 0x4
    // Offset: 0xBB4
    int loopCountA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_currentAutoSizeMode
    // Size: 0x1
    // Offset: 0xBB8
    bool m_currentAutoSizeMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UI::ILayoutElement
    operator ::UnityEngine::UI::ILayoutElement() noexcept {
      return *reinterpret_cast<::UnityEngine::UI::ILayoutElement*>(this);
    }
    // Get instance field reference: private System.Boolean m_hasFontAssetChanged
    [[deprecated("Use field access instead!")]] bool& dyn_m_hasFontAssetChanged();
    // Get instance field reference: private System.Single m_previousLossyScaleY
    [[deprecated("Use field access instead!")]] float& dyn_m_previousLossyScaleY();
    // Get instance field reference: private UnityEngine.Renderer m_renderer
    [[deprecated("Use field access instead!")]] ::UnityEngine::Renderer*& dyn_m_renderer();
    // Get instance field reference: private UnityEngine.MeshFilter m_meshFilter
