// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: TMPro.TextContainerAnchors
#include "TMPro/TextContainerAnchors.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshPro
  class TextMeshPro;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: TMPro.TextContainer
  // [] Offset: FFFFFFFF
  // [RequireComponent] Offset: D8B2C8
  // [AddComponentMenu] Offset: D8B2C8
  class TextContainer : public UnityEngine::EventSystems::UIBehaviour {
    public:
    // private System.Boolean m_hasChanged
    // Size: 0x1
    // Offset: 0x18
    bool m_hasChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_hasChanged and: m_pivot
    char __padding0[0x3] = {};
    // private UnityEngine.Vector2 m_pivot
    // Size: 0x8
    // Offset: 0x1C
    UnityEngine::Vector2 m_pivot;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private TMPro.TextContainerAnchors m_anchorPosition
    // Size: 0x4
    // Offset: 0x24
    TMPro::TextContainerAnchors m_anchorPosition;
    // Field size check
    static_assert(sizeof(TMPro::TextContainerAnchors) == 0x4);
    // private UnityEngine.Rect m_rect
    // Size: 0x10
    // Offset: 0x28
    UnityEngine::Rect m_rect;
    // Field size check
    static_assert(sizeof(UnityEngine::Rect) == 0x10);
    // private System.Boolean m_isDefaultWidth
    // Size: 0x1
    // Offset: 0x38
    bool m_isDefaultWidth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_isDefaultHeight
    // Size: 0x1
    // Offset: 0x39
    bool m_isDefaultHeight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_isAutoFitting
    // Size: 0x1
    // Offset: 0x3A
    bool m_isAutoFitting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isAutoFitting and: m_corners
    char __padding6[0x5] = {};
    // private UnityEngine.Vector3[] m_corners
    // Size: 0x8
    // Offset: 0x40
    ::Array<UnityEngine::Vector3>* m_corners;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.Vector3[] m_worldCorners
    // Size: 0x8
    // Offset: 0x48
    ::Array<UnityEngine::Vector3>* m_worldCorners;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.Vector4 m_margins
    // Size: 0x10
    // Offset: 0x50
    UnityEngine::Vector4 m_margins;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector4) == 0x10);
    // private UnityEngine.RectTransform m_rectTransform
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::RectTransform* m_rectTransform;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private TMPro.TextMeshPro m_textMeshPro
    // Size: 0x8
    // Offset: 0x68
    TMPro::TextMeshPro* m_textMeshPro;
    // Field size check
    static_assert(sizeof(TMPro::TextMeshPro*) == 0x8);
    // Creating value type constructor for type: TextContainer
    TextContainer(bool m_hasChanged_ = {}, UnityEngine::Vector2 m_pivot_ = {}, TMPro::TextContainerAnchors m_anchorPosition_ = {}, UnityEngine::Rect m_rect_ = {}, bool m_isDefaultWidth_ = {}, bool m_isDefaultHeight_ = {}, bool m_isAutoFitting_ = {}, ::Array<UnityEngine::Vector3>* m_corners_ = {}, ::Array<UnityEngine::Vector3>* m_worldCorners_ = {}, UnityEngine::Vector4 m_margins_ = {}, UnityEngine::RectTransform* m_rectTransform_ = {}, TMPro::TextMeshPro* m_textMeshPro_ = {}) noexcept : m_hasChanged{m_hasChanged_}, m_pivot{m_pivot_}, m_anchorPosition{m_anchorPosition_}, m_rect{m_rect_}, m_isDefaultWidth{m_isDefaultWidth_}, m_isDefaultHeight{m_isDefaultHeight_}, m_isAutoFitting{m_isAutoFitting_}, m_corners{m_corners_}, m_worldCorners{m_worldCorners_}, m_margins{m_margins_}, m_rectTransform{m_rectTransform_}, m_textMeshPro{m_textMeshPro_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get static field: static private UnityEngine.Vector2 k_defaultSize
    static UnityEngine::Vector2 _get_k_defaultSize();
    // Set static field: static private UnityEngine.Vector2 k_defaultSize
    static void _set_k_defaultSize(UnityEngine::Vector2 value);
    // public System.Boolean get_hasChanged()
    // Offset: 0x113A4DC
    bool get_hasChanged();
    // public System.Void set_hasChanged(System.Boolean value)
    // Offset: 0x113A4E4
    void set_hasChanged(bool value);
    // public UnityEngine.Vector2 get_pivot()
    // Offset: 0x113A4F0
    UnityEngine::Vector2 get_pivot();
    // public System.Void set_pivot(UnityEngine.Vector2 value)
    // Offset: 0x113A4F8
    void set_pivot(UnityEngine::Vector2 value);
    // public TMPro.TextContainerAnchors get_anchorPosition()
    // Offset: 0x113AA24
    TMPro::TextContainerAnchors get_anchorPosition();
    // public System.Void set_anchorPosition(TMPro.TextContainerAnchors value)
    // Offset: 0x113AA2C
    void set_anchorPosition(TMPro::TextContainerAnchors value);
    // public UnityEngine.Rect get_rect()
    // Offset: 0x113AB80
    UnityEngine::Rect get_rect();
    // public System.Void set_rect(UnityEngine.Rect value)
    // Offset: 0x113AB8C
    void set_rect(UnityEngine::Rect value);
    // public UnityEngine.Vector2 get_size()
    // Offset: 0x113AC18
    UnityEngine::Vector2 get_size();
    // public System.Void set_size(UnityEngine.Vector2 value)
    // Offset: 0x113AC7C
    void set_size(UnityEngine::Vector2 value);
    // public System.Single get_width()
    // Offset: 0x113ADEC
    float get_width();
    // public System.Void set_width(System.Single value)
    // Offset: 0x113ADF8
    void set_width(float value);
    // public System.Single get_height()
    // Offset: 0x113AE6C
    float get_height();
    // public System.Void set_height(System.Single value)
    // Offset: 0x113AE78
    void set_height(float value);
    // public System.Boolean get_isDefaultWidth()
    // Offset: 0x113AEE8
    bool get_isDefaultWidth();
    // public System.Boolean get_isDefaultHeight()
    // Offset: 0x113AEF0
    bool get_isDefaultHeight();
    // public System.Boolean get_isAutoFitting()
    // Offset: 0x113AEF8
    bool get_isAutoFitting();
    // public System.Void set_isAutoFitting(System.Boolean value)
    // Offset: 0x113AF00
    void set_isAutoFitting(bool value);
    // public UnityEngine.Vector3[] get_corners()
    // Offset: 0x113AF0C
    ::Array<UnityEngine::Vector3>* get_corners();
    // public UnityEngine.Vector3[] get_worldCorners()
    // Offset: 0x113AF14
    ::Array<UnityEngine::Vector3>* get_worldCorners();
    // public UnityEngine.Vector4 get_margins()
    // Offset: 0x113AF1C
    UnityEngine::Vector4 get_margins();
    // public System.Void set_margins(UnityEngine.Vector4 value)
    // Offset: 0x113AF28
    void set_margins(UnityEngine::Vector4 value);
    // public UnityEngine.RectTransform get_rectTransform()
    // Offset: 0x113B01C
    UnityEngine::RectTransform* get_rectTransform();
    // public TMPro.TextMeshPro get_textMeshPro()
    // Offset: 0x113B0C8
    TMPro::TextMeshPro* get_textMeshPro();
    // private System.Void OnContainerChanged()
    // Offset: 0x113A8E8
    void OnContainerChanged();
    // private System.Void SetRect(UnityEngine.Vector2 size)
    // Offset: 0x113AD68
    void SetRect(UnityEngine::Vector2 size);
    // private System.Void UpdateCorners()
    // Offset: 0x113B234
    void UpdateCorners();
    // private UnityEngine.Vector2 GetPivot(TMPro.TextContainerAnchors anchor)
    // Offset: 0x113AA70
    UnityEngine::Vector2 GetPivot(TMPro::TextContainerAnchors anchor);
    // private TMPro.TextContainerAnchors GetAnchorPosition(UnityEngine.Vector2 pivot)
    // Offset: 0x113A5C4
    TMPro::TextContainerAnchors GetAnchorPosition(UnityEngine::Vector2 pivot);
    // protected override System.Void Awake()
    // Offset: 0x113B174
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::Awake()
    void Awake();
    // protected override System.Void OnEnable()
    // Offset: 0x113B22C
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnEnable()
    void OnEnable();
    // protected override System.Void OnDisable()
    // Offset: 0x113B230
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnDisable()
    void OnDisable();
    // protected override System.Void OnRectTransformDimensionsChange()
    // Offset: 0x113B4A4
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnRectTransformDimensionsChange()
    void OnRectTransformDimensionsChange();
    // public System.Void .ctor()
    // Offset: 0x113B640
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TextContainer* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("TMPro::TextContainer::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TextContainer*, creationType>()));
    }
    // static private System.Void .cctor()
    // Offset: 0x113B6D0
    // Implemented from: UnityEngine.Object
    // Base method: System.Void Object::.cctor()
    static void _cctor();
  }; // TMPro.TextContainer
  static check_size<sizeof(TextContainer), 104 + sizeof(TMPro::TextMeshPro*)> __TMPro_TextContainerSizeCheck;
  static_assert(sizeof(TextContainer) == 0x70);
}
#pragma pack(pop)
DEFINE_IL2CPP_ARG_TYPE(TMPro::TextContainer*, "TMPro", "TextContainer");
