// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TMPro.TextElementType
#include "TMPro/TextElementType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TextCore
namespace UnityEngine::TextCore {
  // Forward declaring type: Glyph
  class Glyph;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_TextElement
  class TMP_TextElement;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::TMPro::TMP_TextElement);
DEFINE_IL2CPP_ARG_TYPE(::TMPro::TMP_TextElement*, "TMPro", "TMP_TextElement");
// Type namespace: TMPro
namespace TMPro {
  // Size: 0x28
  #pragma pack(push, 1)
  // Autogenerated type: TMPro.TMP_TextElement
  // [TokenAttribute] Offset: FFFFFFFF
  class TMP_TextElement : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // protected TMPro.TextElementType m_ElementType
    // Size: 0x1
    // Offset: 0x10
    ::TMPro::TextElementType m_ElementType;
    // Field size check
    static_assert(sizeof(::TMPro::TextElementType) == 0x1);
    // Padding between fields: m_ElementType and: m_Unicode
    char __padding0[0x3] = {};
    // private System.UInt32 m_Unicode
    // Size: 0x4
    // Offset: 0x14
    uint m_Unicode;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private UnityEngine.TextCore.Glyph m_Glyph
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::TextCore::Glyph* m_Glyph;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Glyph*) == 0x8);
    // private System.UInt32 m_GlyphIndex
    // Size: 0x4
    // Offset: 0x20
    uint m_GlyphIndex;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Single m_Scale
    // Size: 0x4
    // Offset: 0x24
    float m_Scale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: protected TMPro.TextElementType m_ElementType
    ::TMPro::TextElementType& dyn_m_ElementType();
    // Get instance field reference: private System.UInt32 m_Unicode
    uint& dyn_m_Unicode();
    // Get instance field reference: private UnityEngine.TextCore.Glyph m_Glyph
    ::UnityEngine::TextCore::Glyph*& dyn_m_Glyph();
    // Get instance field reference: private System.UInt32 m_GlyphIndex
    uint& dyn_m_GlyphIndex();
    // Get instance field reference: private System.Single m_Scale
    float& dyn_m_Scale();
    // public TMPro.TextElementType get_elementType()
    // Offset: 0x1837130
    ::TMPro::TextElementType get_elementType();
    // public System.UInt32 get_unicode()
    // Offset: 0x1837138
    uint get_unicode();
    // public System.Void set_unicode(System.UInt32 value)
    // Offset: 0x1837140
    void set_unicode(uint value);
    // public UnityEngine.TextCore.Glyph get_glyph()
    // Offset: 0x1837148
    ::UnityEngine::TextCore::Glyph* get_glyph();
    // public System.Void set_glyph(UnityEngine.TextCore.Glyph value)
    // Offset: 0x1837150
    void set_glyph(::UnityEngine::TextCore::Glyph* value);
    // public System.UInt32 get_glyphIndex()
    // Offset: 0x1837158
    uint get_glyphIndex();
    // public System.Void set_glyphIndex(System.UInt32 value)
    // Offset: 0x1837160
    void set_glyphIndex(uint value);
    // public System.Single get_scale()
    // Offset: 0x1837168
    float get_scale();
    // public System.Void set_scale(System.Single value)
    // Offset: 0x1837170
    void set_scale(float value);
    // public System.Void .ctor()
    // Offset: 0x1837178
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TMP_TextElement* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::TMPro::TMP_TextElement::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TMP_TextElement*, creationType>()));
    }
  }; // TMPro.TMP_TextElement
  #pragma pack(pop)
  static check_size<sizeof(TMP_TextElement), 36 + sizeof(float)> __TMPro_TMP_TextElementSizeCheck;
  static_assert(sizeof(TMP_TextElement) == 0x28);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: TMPro::TMP_TextElement::get_elementType
// Il2CppName: get_elementType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::TMPro::TextElementType (TMPro::TMP_TextElement::*)()>(&TMPro::TMP_TextElement::get_elementType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(TMPro::TMP_TextElement*), "get_elementType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: TMPro::TMP_TextElement::get_unicode
// Il2CppName: get_unicode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<uint (TMPro::TMP_TextElement::*)()>(&TMPro::TMP_TextElement::get_unicode)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(TMPro::TMP_TextElement*), "get_unicode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: TMPro::TMP_TextElement::set_unicode
// Il2CppName: set_unicode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (TMPro::TMP_TextElement::*)(uint)>(&TMPro::TMP_TextElement::set_unicode)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "UInt32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(TMPro::TMP_TextElement*), "set_unicode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: TMPro::TMP_TextElement::get_glyph
// Il2CppName: get_glyph
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::TextCore::Glyph* (TMPro::TMP_TextElement::*)()>(&TMPro::TMP_TextElement::get_glyph)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(TMPro::TMP_TextElement*), "get_glyph", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: TMPro::TMP_TextElement::set_glyph
// Il2CppName: set_glyph
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (TMPro::TMP_TextElement::*)(::UnityEngine::TextCore::Glyph*)>(&TMPro::TMP_TextElement::set_glyph)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine.TextCore", "Glyph")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(TMPro::TMP_TextElement*), "set_glyph", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: TMPro::TMP_TextElement::get_glyphIndex
// Il2CppName: get_glyphIndex
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<uint (TMPro::TMP_TextElement::*)()>(&TMPro::TMP_TextElement::get_glyphIndex)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(TMPro::TMP_TextElement*), "get_glyphIndex", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: TMPro::TMP_TextElement::set_glyphIndex
// Il2CppName: set_glyphIndex
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (TMPro::TMP_TextElement::*)(uint)>(&TMPro::TMP_TextElement::set_glyphIndex)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "UInt32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(TMPro::TMP_TextElement*), "set_glyphIndex", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: TMPro::TMP_TextElement::get_scale
// Il2CppName: get_scale
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (TMPro::TMP_TextElement::*)()>(&TMPro::TMP_TextElement::get_scale)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(TMPro::TMP_TextElement*), "get_scale", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: TMPro::TMP_TextElement::set_scale
// Il2CppName: set_scale
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (TMPro::TMP_TextElement::*)(float)>(&TMPro::TMP_TextElement::set_scale)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(TMPro::TMP_TextElement*), "set_scale", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: TMPro::TMP_TextElement::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
