// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_FontAsset
  class TMP_FontAsset;
  // Forward declaring type: TMP_SpriteAsset
  class TMP_SpriteAsset;
  // Forward declaring type: TMP_StyleSheet
  class TMP_StyleSheet;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: TextAsset
  class TextAsset;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: TMPro.TMP_Settings
  class TMP_Settings : public UnityEngine::ScriptableObject {
    public:
    // Nested type: TMPro::TMP_Settings::LineBreakingTable
    class LineBreakingTable;
    // private System.Boolean m_enableWordWrapping
    // Size: 0x1
    // Offset: 0x18
    bool m_enableWordWrapping;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_enableKerning
    // Size: 0x1
    // Offset: 0x19
    bool m_enableKerning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_enableExtraPadding
    // Size: 0x1
    // Offset: 0x1A
    bool m_enableExtraPadding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_enableTintAllSprites
    // Size: 0x1
    // Offset: 0x1B
    bool m_enableTintAllSprites;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_enableParseEscapeCharacters
    // Size: 0x1
    // Offset: 0x1C
    bool m_enableParseEscapeCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_EnableRaycastTarget
    // Size: 0x1
    // Offset: 0x1D
    bool m_EnableRaycastTarget;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_GetFontFeaturesAtRuntime
    // Size: 0x1
    // Offset: 0x1E
    bool m_GetFontFeaturesAtRuntime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_GetFontFeaturesAtRuntime and: m_missingGlyphCharacter
    char __padding6[0x1] = {};
    // private System.Int32 m_missingGlyphCharacter
    // Size: 0x4
    // Offset: 0x20
    int m_missingGlyphCharacter;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_warningsDisabled
    // Size: 0x1
    // Offset: 0x24
    bool m_warningsDisabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_warningsDisabled and: m_defaultFontAsset
    char __padding8[0x3] = {};
    // private TMPro.TMP_FontAsset m_defaultFontAsset
    // Size: 0x8
    // Offset: 0x28
    TMPro::TMP_FontAsset* m_defaultFontAsset;
    // Field size check
    static_assert(sizeof(TMPro::TMP_FontAsset*) == 0x8);
    // private System.String m_defaultFontAssetPath
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppString* m_defaultFontAssetPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Single m_defaultFontSize
    // Size: 0x4
    // Offset: 0x38
    float m_defaultFontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_defaultAutoSizeMinRatio
    // Size: 0x4
    // Offset: 0x3C
    float m_defaultAutoSizeMinRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_defaultAutoSizeMaxRatio
    // Size: 0x4
    // Offset: 0x40
    float m_defaultAutoSizeMaxRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 m_defaultTextMeshProTextContainerSize
    // Size: 0x8
    // Offset: 0x44
    UnityEngine::Vector2 m_defaultTextMeshProTextContainerSize;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_defaultTextMeshProUITextContainerSize
    // Size: 0x8
    // Offset: 0x4C
    UnityEngine::Vector2 m_defaultTextMeshProUITextContainerSize;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private System.Boolean m_autoSizeTextContainer
    // Size: 0x1
    // Offset: 0x54
    bool m_autoSizeTextContainer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_autoSizeTextContainer and: m_fallbackFontAssets
    char __padding16[0x3] = {};
    // private System.Collections.Generic.List`1<TMPro.TMP_FontAsset> m_fallbackFontAssets
    // Size: 0x8
    // Offset: 0x58
    System::Collections::Generic::List_1<TMPro::TMP_FontAsset*>* m_fallbackFontAssets;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<TMPro::TMP_FontAsset*>*) == 0x8);
    // private System.Boolean m_matchMaterialPreset
    // Size: 0x1
    // Offset: 0x60
    bool m_matchMaterialPreset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_matchMaterialPreset and: m_defaultSpriteAsset
    char __padding18[0x7] = {};
    // private TMPro.TMP_SpriteAsset m_defaultSpriteAsset
    // Size: 0x8
    // Offset: 0x68
    TMPro::TMP_SpriteAsset* m_defaultSpriteAsset;
    // Field size check
    static_assert(sizeof(TMPro::TMP_SpriteAsset*) == 0x8);
    // private System.String m_defaultSpriteAssetPath
    // Size: 0x8
    // Offset: 0x70
    ::Il2CppString* m_defaultSpriteAssetPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String m_defaultColorGradientPresetsPath
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppString* m_defaultColorGradientPresetsPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean m_enableEmojiSupport
    // Size: 0x1
    // Offset: 0x80
    bool m_enableEmojiSupport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_enableEmojiSupport and: m_defaultStyleSheet
    char __padding22[0x7] = {};
    // private TMPro.TMP_StyleSheet m_defaultStyleSheet
    // Size: 0x8
    // Offset: 0x88
    TMPro::TMP_StyleSheet* m_defaultStyleSheet;
    // Field size check
    static_assert(sizeof(TMPro::TMP_StyleSheet*) == 0x8);
    // private UnityEngine.TextAsset m_leadingCharacters
    // Size: 0x8
    // Offset: 0x90
    UnityEngine::TextAsset* m_leadingCharacters;
    // Field size check
    static_assert(sizeof(UnityEngine::TextAsset*) == 0x8);
    // private UnityEngine.TextAsset m_followingCharacters
    // Size: 0x8
    // Offset: 0x98
    UnityEngine::TextAsset* m_followingCharacters;
    // Field size check
    static_assert(sizeof(UnityEngine::TextAsset*) == 0x8);
    // private TMPro.TMP_Settings/LineBreakingTable m_linebreakingRules
    // Size: 0x8
    // Offset: 0xA0
    TMPro::TMP_Settings::LineBreakingTable* m_linebreakingRules;
    // Field size check
    static_assert(sizeof(TMPro::TMP_Settings::LineBreakingTable*) == 0x8);
    // Creating value type constructor for type: TMP_Settings
