// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UI.Selectable
#include "UnityEngine/UI/Selectable.hpp"
// Including type: UnityEngine.EventSystems.IPointerClickHandler
#include "UnityEngine/EventSystems/IPointerClickHandler.hpp"
// Including type: UnityEngine.EventSystems.ISubmitHandler
#include "UnityEngine/EventSystems/ISubmitHandler.hpp"
// Including type: UnityEngine.EventSystems.IUpdateSelectedHandler
#include "UnityEngine/EventSystems/IUpdateSelectedHandler.hpp"
// Including type: UnityEngine.EventSystems.IBeginDragHandler
#include "UnityEngine/EventSystems/IBeginDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IDragHandler
#include "UnityEngine/EventSystems/IDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IEndDragHandler
#include "UnityEngine/EventSystems/IEndDragHandler.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.EventSystems.IScrollHandler
#include "UnityEngine/EventSystems/IScrollHandler.hpp"
// Including type: UnityEngine.TouchScreenKeyboardType

// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: BaseInput
  class BaseInput;
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Forward declaring type: BaseEventData
  class BaseEventData;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_InputField
  class TMP_InputField;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::TMPro::TMP_InputField);
DEFINE_IL2CPP_ARG_TYPE(::TMPro::TMP_InputField*, "TMPro", "TMP_InputField");
// Type namespace: TMPro
namespace TMPro {
  // Size: 0x2B0
  #pragma pack(push, 1)
  // Autogenerated type: TMPro.TMP_InputField
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 10DCD20
  class TMP_InputField : public ::UnityEngine::UI::Selectable/*, public ::UnityEngine::EventSystems::IPointerClickHandler, public ::UnityEngine::EventSystems::ISubmitHandler, public ::UnityEngine::EventSystems::IUpdateSelectedHandler, public ::UnityEngine::EventSystems::IBeginDragHandler, public ::UnityEngine::EventSystems::IDragHandler, public ::UnityEngine::EventSystems::IEndDragHandler, public ::UnityEngine::UI::ICanvasElement, public ::UnityEngine::UI::ILayoutElement, public ::UnityEngine::EventSystems::IScrollHandler*/ {
    public:
    // Nested type: ::TMPro::TMP_InputField::ContentType
    struct ContentType;
    // Nested type: ::TMPro::TMP_InputField::InputType
    struct InputType;
    // Nested type: ::TMPro::TMP_InputField::CharacterValidation
    struct CharacterValidation;
    // Nested type: ::TMPro::TMP_InputField::LineType
    struct LineType;
    // Nested type: ::TMPro::TMP_InputField::OnValidateInput
    class OnValidateInput;
    // Nested type: ::TMPro::TMP_InputField::SubmitEvent
    class SubmitEvent;
    // Nested type: ::TMPro::TMP_InputField::OnChangeEvent
    class OnChangeEvent;
    // Nested type: ::TMPro::TMP_InputField::SelectionEvent
    class SelectionEvent;
    // Nested type: ::TMPro::TMP_InputField::TextSelectionEvent
    class TextSelectionEvent;
    // Nested type: ::TMPro::TMP_InputField::TouchScreenKeyboardEvent
    class TouchScreenKeyboardEvent;
    // Nested type: ::TMPro::TMP_InputField::EditState
    struct EditState;
    // Nested type: ::TMPro::TMP_InputField::$CaretBlink$d__267
    class $CaretBlink$d__267;
    // Nested type: ::TMPro::TMP_InputField::$MouseDragOutsideRect$d__285
    class $MouseDragOutsideRect$d__285;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TMPro.TMP_InputField/TMPro.ContentType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ContentType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ContentType
      constexpr ContentType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType Standard
      static constexpr const int Standard = 0;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType Standard
      static ::TMPro::TMP_InputField::ContentType _get_Standard();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType Standard
      static void _set_Standard(::TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType Autocorrected
      static constexpr const int Autocorrected = 1;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType Autocorrected
      static ::TMPro::TMP_InputField::ContentType _get_Autocorrected();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType Autocorrected
      static void _set_Autocorrected(::TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType IntegerNumber
      static constexpr const int IntegerNumber = 2;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType IntegerNumber
      static ::TMPro::TMP_InputField::ContentType _get_IntegerNumber();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType IntegerNumber
      static void _set_IntegerNumber(::TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType DecimalNumber
      static constexpr const int DecimalNumber = 3;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType DecimalNumber
      static ::TMPro::TMP_InputField::ContentType _get_DecimalNumber();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType DecimalNumber
      static void _set_DecimalNumber(::TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType Alphanumeric
      static constexpr const int Alphanumeric = 4;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType Alphanumeric
      static ::TMPro::TMP_InputField::ContentType _get_Alphanumeric();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType Alphanumeric
      static void _set_Alphanumeric(::TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType Name
      static constexpr const int Name = 5;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType Name
      static ::TMPro::TMP_InputField::ContentType _get_Name();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType Name
      static void _set_Name(::TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType EmailAddress
      static constexpr const int EmailAddress = 6;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType EmailAddress
      static ::TMPro::TMP_InputField::ContentType _get_EmailAddress();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType EmailAddress
      static void _set_EmailAddress(::TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType Password
      static constexpr const int Password = 7;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType Password
      static ::TMPro::TMP_InputField::ContentType _get_Password();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType Password
      static void _set_Password(::TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType Pin
      static constexpr const int Pin = 8;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType Pin
      static ::TMPro::TMP_InputField::ContentType _get_Pin();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType Pin
      static void _set_Pin(::TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.ContentType Custom
      static constexpr const int Custom = 9;
      // Get static field: static public TMPro.TMP_InputField/TMPro.ContentType Custom
      static ::TMPro::TMP_InputField::ContentType _get_Custom();
      // Set static field: static public TMPro.TMP_InputField/TMPro.ContentType Custom
      static void _set_Custom(::TMPro::TMP_InputField::ContentType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // TMPro.TMP_InputField/TMPro.ContentType
    #pragma pack(pop)
    static check_size<sizeof(TMP_InputField::ContentType), 0 + sizeof(int)> __TMPro_TMP_InputField_ContentTypeSizeCheck;
    static_assert(sizeof(TMP_InputField::ContentType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TMPro.TMP_InputField/TMPro.InputType
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputType
      constexpr InputType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.TMP_InputField/TMPro.InputType Standard
      static constexpr const int Standard = 0;
      // Get static field: static public TMPro.TMP_InputField/TMPro.InputType Standard
      static ::TMPro::TMP_InputField::InputType _get_Standard();
      // Set static field: static public TMPro.TMP_InputField/TMPro.InputType Standard
      static void _set_Standard(::TMPro::TMP_InputField::InputType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.InputType AutoCorrect
      static constexpr const int AutoCorrect = 1;
      // Get static field: static public TMPro.TMP_InputField/TMPro.InputType AutoCorrect
      static ::TMPro::TMP_InputField::InputType _get_AutoCorrect();
      // Set static field: static public TMPro.TMP_InputField/TMPro.InputType AutoCorrect
      static void _set_AutoCorrect(::TMPro::TMP_InputField::InputType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.InputType Password
      static constexpr const int Password = 2;
      // Get static field: static public TMPro.TMP_InputField/TMPro.InputType Password
      static ::TMPro::TMP_InputField::InputType _get_Password();
      // Set static field: static public TMPro.TMP_InputField/TMPro.InputType Password
      static void _set_Password(::TMPro::TMP_InputField::InputType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // TMPro.TMP_InputField/TMPro.InputType
    #pragma pack(pop)
    static check_size<sizeof(TMP_InputField::InputType), 0 + sizeof(int)> __TMPro_TMP_InputField_InputTypeSizeCheck;
    static_assert(sizeof(TMP_InputField::InputType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TMPro.TMP_InputField/TMPro.CharacterValidation
    // [TokenAttribute] Offset: FFFFFFFF
    struct CharacterValidation/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CharacterValidation
      constexpr CharacterValidation(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.TMP_InputField/TMPro.CharacterValidation None
      static constexpr const int None = 0;
      // Get static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation None
      static ::TMPro::TMP_InputField::CharacterValidation _get_None();
      // Set static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation None
      static void _set_None(::TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.CharacterValidation Digit
      static constexpr const int Digit = 1;
      // Get static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Digit
      static ::TMPro::TMP_InputField::CharacterValidation _get_Digit();
      // Set static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Digit
      static void _set_Digit(::TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.CharacterValidation Integer
      static constexpr const int Integer = 2;
      // Get static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Integer
      static ::TMPro::TMP_InputField::CharacterValidation _get_Integer();
      // Set static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Integer
      static void _set_Integer(::TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.CharacterValidation Decimal
      static constexpr const int Decimal = 3;
      // Get static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Decimal
      static ::TMPro::TMP_InputField::CharacterValidation _get_Decimal();
      // Set static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Decimal
      static void _set_Decimal(::TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.CharacterValidation Alphanumeric
      static constexpr const int Alphanumeric = 4;
      // Get static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Alphanumeric
      static ::TMPro::TMP_InputField::CharacterValidation _get_Alphanumeric();
      // Set static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Alphanumeric
      static void _set_Alphanumeric(::TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.CharacterValidation Name
      static constexpr const int Name = 5;
      // Get static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Name
      static ::TMPro::TMP_InputField::CharacterValidation _get_Name();
      // Set static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Name
      static void _set_Name(::TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.CharacterValidation Regex
      static constexpr const int Regex = 6;
      // Get static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Regex
      static ::TMPro::TMP_InputField::CharacterValidation _get_Regex();
      // Set static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation Regex
      static void _set_Regex(::TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.CharacterValidation EmailAddress
      static constexpr const int EmailAddress = 7;
      // Get static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation EmailAddress
      static ::TMPro::TMP_InputField::CharacterValidation _get_EmailAddress();
      // Set static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation EmailAddress
      static void _set_EmailAddress(::TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.CharacterValidation CustomValidator
      static constexpr const int CustomValidator = 8;
      // Get static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation CustomValidator
      static ::TMPro::TMP_InputField::CharacterValidation _get_CustomValidator();
      // Set static field: static public TMPro.TMP_InputField/TMPro.CharacterValidation CustomValidator
      static void _set_CustomValidator(::TMPro::TMP_InputField::CharacterValidation value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // TMPro.TMP_InputField/TMPro.CharacterValidation
    #pragma pack(pop)
    static check_size<sizeof(TMP_InputField::CharacterValidation), 0 + sizeof(int)> __TMPro_TMP_InputField_CharacterValidationSizeCheck;
    static_assert(sizeof(TMP_InputField::CharacterValidation) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TMPro.TMP_InputField/TMPro.LineType
    // [TokenAttribute] Offset: FFFFFFFF
    struct LineType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LineType
      constexpr LineType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.TMP_InputField/TMPro.LineType SingleLine
      static constexpr const int SingleLine = 0;
      // Get static field: static public TMPro.TMP_InputField/TMPro.LineType SingleLine
      static ::TMPro::TMP_InputField::LineType _get_SingleLine();
      // Set static field: static public TMPro.TMP_InputField/TMPro.LineType SingleLine
      static void _set_SingleLine(::TMPro::TMP_InputField::LineType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.LineType MultiLineSubmit
      static constexpr const int MultiLineSubmit = 1;
      // Get static field: static public TMPro.TMP_InputField/TMPro.LineType MultiLineSubmit
      static ::TMPro::TMP_InputField::LineType _get_MultiLineSubmit();
      // Set static field: static public TMPro.TMP_InputField/TMPro.LineType MultiLineSubmit
      static void _set_MultiLineSubmit(::TMPro::TMP_InputField::LineType value);
      // static field const value: static public TMPro.TMP_InputField/TMPro.LineType MultiLineNewline
      static constexpr const int MultiLineNewline = 2;
      // Get static field: static public TMPro.TMP_InputField/TMPro.LineType MultiLineNewline
      static ::TMPro::TMP_InputField::LineType _get_MultiLineNewline();
      // Set static field: static public TMPro.TMP_InputField/TMPro.LineType MultiLineNewline
      static void _set_MultiLineNewline(::TMPro::TMP_InputField::LineType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // TMPro.TMP_InputField/TMPro.LineType
    #pragma pack(pop)
    static check_size<sizeof(TMP_InputField::LineType), 0 + sizeof(int)> __TMPro_TMP_InputField_LineTypeSizeCheck;
    static_assert(sizeof(TMP_InputField::LineType) == 0x4);
    public:
    // protected UnityEngine.TouchScreenKeyboard m_SoftKeyboard
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::TouchScreenKeyboard* m_SoftKeyboard;
    // Field size check
    static_assert(sizeof(::UnityEngine::TouchScreenKeyboard*) == 0x8);
    // protected UnityEngine.RectTransform m_TextViewport
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::RectTransform* m_TextViewport;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // protected TMPro.TMP_Text m_TextComponent
    // Size: 0x8
    // Offset: 0x108
    ::TMPro::TMP_Text* m_TextComponent;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_Text*) == 0x8);
    // protected UnityEngine.RectTransform m_TextComponentRectTransform
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::RectTransform* m_TextComponentRectTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // protected UnityEngine.UI.Graphic m_Placeholder
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::UI::Graphic* m_Placeholder;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Graphic*) == 0x8);
    // protected UnityEngine.UI.Scrollbar m_VerticalScrollbar
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::UI::Scrollbar* m_VerticalScrollbar;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Scrollbar*) == 0x8);
    // protected TMPro.TMP_ScrollbarEventHandler m_VerticalScrollbarEventHandler
    // Size: 0x8
    // Offset: 0x128
    ::TMPro::TMP_ScrollbarEventHandler* m_VerticalScrollbarEventHandler;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_ScrollbarEventHandler*) == 0x8);
    // private System.Boolean m_IsDrivenByLayoutComponents
    // Size: 0x1
    // Offset: 0x130
    bool m_IsDrivenByLayoutComponents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_IsDrivenByLayoutComponents and: m_ScrollPosition
    char __padding7[0x3] = {};
    // private System.Single m_ScrollPosition
    // Size: 0x4
    // Offset: 0x134
    float m_ScrollPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_ScrollSensitivity
    // Size: 0x4
    // Offset: 0x138
    float m_ScrollSensitivity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private TMPro.TMP_InputField/TMPro.ContentType m_ContentType
    // Size: 0x4
    // Offset: 0x13C
    ::TMPro::TMP_InputField::ContentType m_ContentType;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::ContentType) == 0x4);
    // private TMPro.TMP_InputField/TMPro.InputType m_InputType
    // Size: 0x4
    // Offset: 0x140
    ::TMPro::TMP_InputField::InputType m_InputType;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::InputType) == 0x4);
    // private System.Char m_AsteriskChar
    // Size: 0x2
    // Offset: 0x144
    ::Il2CppChar m_AsteriskChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // Padding between fields: m_AsteriskChar and: m_KeyboardType
    char __padding12[0x2] = {};
    // private UnityEngine.TouchScreenKeyboardType m_KeyboardType
    // Size: 0x4
    // Offset: 0x148
    ::UnityEngine::TouchScreenKeyboardType m_KeyboardType;
    // Field size check
    static_assert(sizeof(::UnityEngine::TouchScreenKeyboardType) == 0x4);
    // private TMPro.TMP_InputField/TMPro.LineType m_LineType
    // Size: 0x4
    // Offset: 0x14C
    ::TMPro::TMP_InputField::LineType m_LineType;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::LineType) == 0x4);
    // private System.Boolean m_HideMobileInput
    // Size: 0x1
    // Offset: 0x150
    bool m_HideMobileInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HideSoftKeyboard
    // Size: 0x1
    // Offset: 0x151
    bool m_HideSoftKeyboard;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HideSoftKeyboard and: m_CharacterValidation
    char __padding16[0x2] = {};
    // private TMPro.TMP_InputField/TMPro.CharacterValidation m_CharacterValidation
    // Size: 0x4
    // Offset: 0x154
    ::TMPro::TMP_InputField::CharacterValidation m_CharacterValidation;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::CharacterValidation) == 0x4);
    // private System.String m_RegexValue
    // Size: 0x8
    // Offset: 0x158
    ::StringW m_RegexValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single m_GlobalPointSize
    // Size: 0x4
    // Offset: 0x160
    float m_GlobalPointSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_CharacterLimit
    // Size: 0x4
    // Offset: 0x164
    int m_CharacterLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private TMPro.TMP_InputField/TMPro.SubmitEvent m_OnEndEdit
    // Size: 0x8
    // Offset: 0x168
    ::TMPro::TMP_InputField::SubmitEvent* m_OnEndEdit;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::SubmitEvent*) == 0x8);
    // private TMPro.TMP_InputField/TMPro.SubmitEvent m_OnSubmit
    // Size: 0x8
    // Offset: 0x170
    ::TMPro::TMP_InputField::SubmitEvent* m_OnSubmit;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::SubmitEvent*) == 0x8);
    // private TMPro.TMP_InputField/TMPro.SelectionEvent m_OnSelect
    // Size: 0x8
    // Offset: 0x178
    ::TMPro::TMP_InputField::SelectionEvent* m_OnSelect;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::SelectionEvent*) == 0x8);
    // private TMPro.TMP_InputField/TMPro.SelectionEvent m_OnDeselect
    // Size: 0x8
    // Offset: 0x180
    ::TMPro::TMP_InputField::SelectionEvent* m_OnDeselect;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::SelectionEvent*) == 0x8);
    // private TMPro.TMP_InputField/TMPro.TextSelectionEvent m_OnTextSelection
    // Size: 0x8
    // Offset: 0x188
    ::TMPro::TMP_InputField::TextSelectionEvent* m_OnTextSelection;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::TextSelectionEvent*) == 0x8);
    // private TMPro.TMP_InputField/TMPro.TextSelectionEvent m_OnEndTextSelection
    // Size: 0x8
    // Offset: 0x190
    ::TMPro::TMP_InputField::TextSelectionEvent* m_OnEndTextSelection;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::TextSelectionEvent*) == 0x8);
    // private TMPro.TMP_InputField/TMPro.OnChangeEvent m_OnValueChanged
    // Size: 0x8
    // Offset: 0x198
    ::TMPro::TMP_InputField::OnChangeEvent* m_OnValueChanged;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::OnChangeEvent*) == 0x8);
    // private TMPro.TMP_InputField/TMPro.TouchScreenKeyboardEvent m_OnTouchScreenKeyboardStatusChanged
    // Size: 0x8
    // Offset: 0x1A0
    ::TMPro::TMP_InputField::TouchScreenKeyboardEvent* m_OnTouchScreenKeyboardStatusChanged;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::TouchScreenKeyboardEvent*) == 0x8);
    // private TMPro.TMP_InputField/TMPro.OnValidateInput m_OnValidateInput
    // Size: 0x8
    // Offset: 0x1A8
    ::TMPro::TMP_InputField::OnValidateInput* m_OnValidateInput;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputField::OnValidateInput*) == 0x8);
    // private UnityEngine.Color m_CaretColor
    // Size: 0x10
    // Offset: 0x1B0
    ::UnityEngine::Color m_CaretColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean m_CustomCaretColor
    // Size: 0x1
    // Offset: 0x1C0
    bool m_CustomCaretColor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CustomCaretColor and: m_SelectionColor
    char __padding31[0x3] = {};
    // private UnityEngine.Color m_SelectionColor
    // Size: 0x10
    // Offset: 0x1C4
    ::UnityEngine::Color m_SelectionColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: m_SelectionColor and: m_Text
    char __padding32[0x4] = {};
    // [TextAreaAttribute] Offset: 0x10DD7E0
    // protected System.String m_Text
    // Size: 0x8
    // Offset: 0x1D8
    ::StringW m_Text;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [RangeAttribute] Offset: 0x10DD820
    // private System.Single m_CaretBlinkRate
    // Size: 0x4
    // Offset: 0x1E0
    float m_CaretBlinkRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x10DD860
    // private System.Int32 m_CaretWidth
    // Size: 0x4
    // Offset: 0x1E4
    int m_CaretWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_ReadOnly
    // Size: 0x1
    // Offset: 0x1E8
    bool m_ReadOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_RichText
    // Size: 0x1
    // Offset: 0x1E9
    bool m_RichText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_RichText and: m_StringPosition
    char __padding37[0x2] = {};
    // protected System.Int32 m_StringPosition
    // Size: 0x4
    // Offset: 0x1EC
    int m_StringPosition;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_StringSelectPosition
    // Size: 0x4
    // Offset: 0x1F0
    int m_StringSelectPosition;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_CaretPosition
    // Size: 0x4
    // Offset: 0x1F4
    int m_CaretPosition;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_CaretSelectPosition
    // Size: 0x4
    // Offset: 0x1F8
    int m_CaretSelectPosition;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_CaretSelectPosition and: caretRectTrans
    char __padding41[0x4] = {};
    // private UnityEngine.RectTransform caretRectTrans
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::RectTransform* caretRectTrans;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // protected UnityEngine.UIVertex[] m_CursorVerts
    // Size: 0x8
    // Offset: 0x208
    ::ArrayW<::UnityEngine::UIVertex> m_CursorVerts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIVertex>) == 0x8);
    // private UnityEngine.CanvasRenderer m_CachedInputRenderer
    // Size: 0x8
    // Offset: 0x210
    ::UnityEngine::CanvasRenderer* m_CachedInputRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::CanvasRenderer*) == 0x8);
    // private UnityEngine.Vector2 m_LastPosition
    // Size: 0x8
    // Offset: 0x218
    ::UnityEngine::Vector2 m_LastPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // protected UnityEngine.Mesh m_Mesh
    // Size: 0x8
    // Offset: 0x220
    ::UnityEngine::Mesh* m_Mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private System.Boolean m_AllowInput
    // Size: 0x1
    // Offset: 0x228
    bool m_AllowInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ShouldActivateNextUpdate
    // Size: 0x1
    // Offset: 0x229
    bool m_ShouldActivateNextUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UpdateDrag
    // Size: 0x1
    // Offset: 0x22A
    bool m_UpdateDrag;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_DragPositionOutOfBounds
    // Size: 0x1
    // Offset: 0x22B
    bool m_DragPositionOutOfBounds;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_CaretVisible
    // Size: 0x1
    // Offset: 0x22C
    bool m_CaretVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CaretVisible and: m_BlinkCoroutine
    char __padding51[0x3] = {};
    // private UnityEngine.Coroutine m_BlinkCoroutine
    // Size: 0x8
    // Offset: 0x230
    ::UnityEngine::Coroutine* m_BlinkCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Single m_BlinkStartTime
    // Size: 0x4
    // Offset: 0x238
    float m_BlinkStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_BlinkStartTime and: m_DragCoroutine
    char __padding53[0x4] = {};
    // private UnityEngine.Coroutine m_DragCoroutine
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::Coroutine* m_DragCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.String m_OriginalText
    // Size: 0x8
    // Offset: 0x248
    ::StringW m_OriginalText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_WasCanceled
    // Size: 0x1
    // Offset: 0x250
    bool m_WasCanceled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HasDoneFocusTransition
    // Size: 0x1
    // Offset: 0x251
    bool m_HasDoneFocusTransition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasDoneFocusTransition and: m_WaitForSecondsRealtime
    char __padding57[0x6] = {};
    // private UnityEngine.WaitForSecondsRealtime m_WaitForSecondsRealtime
    // Size: 0x8
    // Offset: 0x258
    ::UnityEngine::WaitForSecondsRealtime* m_WaitForSecondsRealtime;
    // Field size check
    static_assert(sizeof(::UnityEngine::WaitForSecondsRealtime*) == 0x8);
    // private System.Boolean m_PreventCallback
    // Size: 0x1
    // Offset: 0x260
    bool m_PreventCallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_TouchKeyboardAllowsInPlaceEditing
    // Size: 0x1
    // Offset: 0x261
    bool m_TouchKeyboardAllowsInPlaceEditing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsTextComponentUpdateRequired
    // Size: 0x1
    // Offset: 0x262
    bool m_IsTextComponentUpdateRequired;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsScrollbarUpdateRequired
    // Size: 0x1
    // Offset: 0x263
    bool m_IsScrollbarUpdateRequired;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsUpdatingScrollbarValues
    // Size: 0x1
    // Offset: 0x264
    bool m_IsUpdatingScrollbarValues;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_isLastKeyBackspace
    // Size: 0x1
    // Offset: 0x265
    bool m_isLastKeyBackspace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isLastKeyBackspace and: m_PointerDownClickStartTime
    char __padding64[0x2] = {};
    // private System.Single m_PointerDownClickStartTime
    // Size: 0x4
    // Offset: 0x268
    float m_PointerDownClickStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_KeyDownStartTime
    // Size: 0x4
    // Offset: 0x26C
    float m_KeyDownStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DoubleClickDelay
    // Size: 0x4
    // Offset: 0x270
    float m_DoubleClickDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_DoubleClickDelay and: m_GlobalFontAsset
    char __padding67[0x4] = {};
    // protected TMPro.TMP_FontAsset m_GlobalFontAsset
    // Size: 0x8
    // Offset: 0x278
    ::TMPro::TMP_FontAsset* m_GlobalFontAsset;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_FontAsset*) == 0x8);
    // protected System.Boolean m_OnFocusSelectAll
    // Size: 0x1
    // Offset: 0x280
    bool m_OnFocusSelectAll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isSelectAll
    // Size: 0x1
    // Offset: 0x281
    bool m_isSelectAll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_ResetOnDeActivation
    // Size: 0x1
    // Offset: 0x282
    bool m_ResetOnDeActivation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SelectionStillActive
    // Size: 0x1
    // Offset: 0x283
    bool m_SelectionStillActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ReleaseSelection
    // Size: 0x1
    // Offset: 0x284
    bool m_ReleaseSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ReleaseSelection and: m_SelectedObject
    char __padding73[0x3] = {};
    // private UnityEngine.GameObject m_SelectedObject
    // Size: 0x8
    // Offset: 0x288
    ::UnityEngine::GameObject* m_SelectedObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean m_RestoreOriginalTextOnEscape
    // Size: 0x1
    // Offset: 0x290
    bool m_RestoreOriginalTextOnEscape;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isRichTextEditingAllowed
    // Size: 0x1
    // Offset: 0x291
    bool m_isRichTextEditingAllowed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isRichTextEditingAllowed and: m_LineLimit
    char __padding76[0x2] = {};
    // protected System.Int32 m_LineLimit
    // Size: 0x4
    // Offset: 0x294
    int m_LineLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected TMPro.TMP_InputValidator m_InputValidator
    // Size: 0x8
    // Offset: 0x298
    ::TMPro::TMP_InputValidator* m_InputValidator;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_InputValidator*) == 0x8);
    // private System.Boolean m_isSelected
    // Size: 0x1
    // Offset: 0x2A0
    bool m_isSelected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsStringPositionDirty
    // Size: 0x1
    // Offset: 0x2A1
    bool m_IsStringPositionDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsCaretPositionDirty
    // Size: 0x1
    // Offset: 0x2A2
    bool m_IsCaretPositionDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_forceRectTransformAdjustment
    // Size: 0x1
    // Offset: 0x2A3
    bool m_forceRectTransformAdjustment;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_forceRectTransformAdjustment and: m_ProcessingEvent
    char __padding82[0x4] = {};
    // private UnityEngine.Event m_ProcessingEvent
    // Size: 0x8
    // Offset: 0x2A8
    ::UnityEngine::Event* m_ProcessingEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Event*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::EventSystems::IPointerClickHandler
    operator ::UnityEngine::EventSystems::IPointerClickHandler() noexcept {
      return *reinterpret_cast<::UnityEngine::EventSystems::IPointerClickHandler*>(this);
    }
    // Creating interface conversion operator: i_IPointerClickHandler
    inline ::UnityEngine::EventSystems::IPointerClickHandler* i_IPointerClickHandler() noexcept {
      return reinterpret_cast<::UnityEngine::EventSystems::IPointerClickHandler*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::EventSystems::ISubmitHandler
    operator ::UnityEngine::EventSystems::ISubmitHandler() noexcept {
      return *reinterpret_cast<::UnityEngine::EventSystems::ISubmitHandler*>(this);
    }
