// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: TMPro.TextAlignmentOptions
#include "TMPro/TextAlignmentOptions.hpp"
// Including type: TMPro.Extents
#include "TMPro/Extents.hpp"
// Completed includes
// Type namespace: TMPro
namespace TMPro {
  // Autogenerated type: TMPro.TMP_LineInfo
  struct TMP_LineInfo : public System::ValueType {
    public:
    // System.Int32 controlCharacterCount
    // Offset: 0x0
    int controlCharacterCount;
    // public System.Int32 characterCount
    // Offset: 0x4
    int characterCount;
    // public System.Int32 visibleCharacterCount
    // Offset: 0x8
    int visibleCharacterCount;
    // public System.Int32 spaceCount
    // Offset: 0xC
    int spaceCount;
    // public System.Int32 wordCount
    // Offset: 0x10
    int wordCount;
    // public System.Int32 firstCharacterIndex
    // Offset: 0x14
    int firstCharacterIndex;
    // public System.Int32 firstVisibleCharacterIndex
    // Offset: 0x18
    int firstVisibleCharacterIndex;
    // public System.Int32 lastCharacterIndex
    // Offset: 0x1C
    int lastCharacterIndex;
    // public System.Int32 lastVisibleCharacterIndex
    // Offset: 0x20
    int lastVisibleCharacterIndex;
    // public System.Single length
    // Offset: 0x24
    float length;
    // public System.Single lineHeight
    // Offset: 0x28
    float lineHeight;
    // public System.Single ascender
    // Offset: 0x2C
    float ascender;
    // public System.Single baseline
    // Offset: 0x30
    float baseline;
    // public System.Single descender
    // Offset: 0x34
    float descender;
    // public System.Single maxAdvance
    // Offset: 0x38
    float maxAdvance;
    // public System.Single width
    // Offset: 0x3C
    float width;
    // public System.Single marginLeft
    // Offset: 0x40
    float marginLeft;
    // public System.Single marginRight
    // Offset: 0x44
    float marginRight;
    // public TMPro.TextAlignmentOptions alignment
    // Offset: 0x48
    TMPro::TextAlignmentOptions alignment;
    // public TMPro.Extents lineExtents
    // Offset: 0x4C
    TMPro::Extents lineExtents;
    // Creating value type constructor for type: TMP_LineInfo
    constexpr TMP_LineInfo(int controlCharacterCount_ = {}, int characterCount_ = {}, int visibleCharacterCount_ = {}, int spaceCount_ = {}, int wordCount_ = {}, int firstCharacterIndex_ = {}, int firstVisibleCharacterIndex_ = {}, int lastCharacterIndex_ = {}, int lastVisibleCharacterIndex_ = {}, float length_ = {}, float lineHeight_ = {}, float ascender_ = {}, float baseline_ = {}, float descender_ = {}, float maxAdvance_ = {}, float width_ = {}, float marginLeft_ = {}, float marginRight_ = {}, TMPro::TextAlignmentOptions alignment_ = {}, TMPro::Extents lineExtents_ = {}) noexcept : controlCharacterCount{controlCharacterCount_}, characterCount{characterCount_}, visibleCharacterCount{visibleCharacterCount_}, spaceCount{spaceCount_}, wordCount{wordCount_}, firstCharacterIndex{firstCharacterIndex_}, firstVisibleCharacterIndex{firstVisibleCharacterIndex_}, lastCharacterIndex{lastCharacterIndex_}, lastVisibleCharacterIndex{lastVisibleCharacterIndex_}, length{length_}, lineHeight{lineHeight_}, ascender{ascender_}, baseline{baseline_}, descender{descender_}, maxAdvance{maxAdvance_}, width{width_}, marginLeft{marginLeft_}, marginRight{marginRight_}, alignment{alignment_}, lineExtents{lineExtents_} {}
  }; // TMPro.TMP_LineInfo
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(TMPro::TMP_LineInfo, "TMPro", "TMP_LineInfo");
#pragma pack(pop)
