// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.UI.MaskableGraphic
#include "UnityEngine/UI/MaskableGraphic.hpp"
// Including type: TMPro.TMP_RichTextTagStack`1
#include "TMPro/TMP_RichTextTagStack_1.hpp"
// Including type: TMPro.MaterialReference
#include "TMPro/MaterialReference.hpp"
// Including type: TMPro.ColorMode
#include "TMPro/ColorMode.hpp"
// Including type: TMPro.VertexGradient
#include "TMPro/VertexGradient.hpp"
// Including type: TMPro.FontWeight
#include "TMPro/FontWeight.hpp"
// Including type: TMPro.FontStyles
#include "TMPro/FontStyles.hpp"
// Including type: TMPro.TMP_FontStyleStack
#include "TMPro/TMP_FontStyleStack.hpp"
// Including type: TMPro.TextAlignmentOptions
#include "TMPro/TextAlignmentOptions.hpp"
// Including type: TMPro.TextOverflowModes
#include "TMPro/TextOverflowModes.hpp"
// Including type: TMPro.TextureMappingOptions
#include "TMPro/TextureMappingOptions.hpp"
// Including type: TMPro.TextRenderFlags
#include "TMPro/TextRenderFlags.hpp"
// Including type: TMPro.VertexSortingOrder
#include "TMPro/VertexSortingOrder.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: TMPro.WordWrapState
#include "TMPro/WordWrapState.hpp"
// Including type: TMPro.TMP_TextElementType
#include "TMPro/TMP_TextElementType.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: RichTextTagAttribute
  struct RichTextTagAttribute;
  // Forward declaring type: TMP_FontAsset
  class TMP_FontAsset;
  // Forward declaring type: TMP_ColorGradient
  class TMP_ColorGradient;
  // Forward declaring type: TMP_SpriteAsset
  class TMP_SpriteAsset;
  // Forward declaring type: TMP_TextInfo
  class TMP_TextInfo;
  // Forward declaring type: TMP_SpriteAnimator
  class TMP_SpriteAnimator;
  // Forward declaring type: TMP_CharacterInfo
  struct TMP_CharacterInfo;
  // Forward declaring type: TMP_TextElement
  class TMP_TextElement;
  // Forward declaring type: TMP_Character
  class TMP_Character;
  // Forward declaring type: TMP_VertexDataUpdateFlags
  struct TMP_VertexDataUpdateFlags;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Bounds
  struct Bounds;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: LayoutElement
  class LayoutElement;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Autogenerated type: TMPro.TMP_Text
  class TMP_Text : public UnityEngine::UI::MaskableGraphic {
    public:
    // Nested type: TMPro::TMP_Text::TextInputSources
    struct TextInputSources;
    // Nested type: TMPro::TMP_Text::UnicodeChar
    struct UnicodeChar;
    // Autogenerated type: TMPro.TMP_Text/TextInputSources
    struct TextInputSources : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // static field const value: static public TMPro.TMP_Text/TextInputSources Text
      static constexpr const int Text = 0;
      // Get static field: static public TMPro.TMP_Text/TextInputSources Text
      static TMPro::TMP_Text::TextInputSources _get_Text();
      // Set static field: static public TMPro.TMP_Text/TextInputSources Text
      static void _set_Text(TMPro::TMP_Text::TextInputSources value);
      // static field const value: static public TMPro.TMP_Text/TextInputSources SetText
      static constexpr const int SetText = 1;
      // Get static field: static public TMPro.TMP_Text/TextInputSources SetText
      static TMPro::TMP_Text::TextInputSources _get_SetText();
      // Set static field: static public TMPro.TMP_Text/TextInputSources SetText
      static void _set_SetText(TMPro::TMP_Text::TextInputSources value);
      // static field const value: static public TMPro.TMP_Text/TextInputSources SetCharArray
      static constexpr const int SetCharArray = 2;
      // Get static field: static public TMPro.TMP_Text/TextInputSources SetCharArray
      static TMPro::TMP_Text::TextInputSources _get_SetCharArray();
      // Set static field: static public TMPro.TMP_Text/TextInputSources SetCharArray
      static void _set_SetCharArray(TMPro::TMP_Text::TextInputSources value);
      // static field const value: static public TMPro.TMP_Text/TextInputSources String
      static constexpr const int String = 3;
      // Get static field: static public TMPro.TMP_Text/TextInputSources String
      static TMPro::TMP_Text::TextInputSources _get_String();
      // Set static field: static public TMPro.TMP_Text/TextInputSources String
      static void _set_String(TMPro::TMP_Text::TextInputSources value);
      // Creating value type constructor for type: TextInputSources
      TextInputSources(int value_ = {}) : value{value_} {}
    }; // TMPro.TMP_Text/TextInputSources
    // protected System.String m_text
    // Offset: 0xC0
    ::Il2CppString* m_text;
    // protected System.Boolean m_isRightToLeft
    // Offset: 0xC8
    bool m_isRightToLeft;
    // protected TMPro.TMP_FontAsset m_fontAsset
    // Offset: 0xD0
    TMPro::TMP_FontAsset* m_fontAsset;
    // protected TMPro.TMP_FontAsset m_currentFontAsset
    // Offset: 0xD8
    TMPro::TMP_FontAsset* m_currentFontAsset;
    // protected System.Boolean m_isSDFShader
    // Offset: 0xE0
    bool m_isSDFShader;
    // protected UnityEngine.Material m_sharedMaterial
    // Offset: 0xE8
    UnityEngine::Material* m_sharedMaterial;
    // protected UnityEngine.Material m_currentMaterial
    // Offset: 0xF0
    UnityEngine::Material* m_currentMaterial;
    // protected TMPro.MaterialReference[] m_materialReferences
    // Offset: 0xF8
    ::Array<TMPro::MaterialReference>* m_materialReferences;
    // protected System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_materialReferenceIndexLookup
    // Offset: 0x100
    System::Collections::Generic::Dictionary_2<int, int>* m_materialReferenceIndexLookup;
    // protected TMPro.TMP_RichTextTagStack`1<TMPro.MaterialReference> m_materialReferenceStack
    // Offset: 0x108
    TMPro::TMP_RichTextTagStack_1<TMPro::MaterialReference> m_materialReferenceStack;
    // protected System.Int32 m_currentMaterialIndex
    // Offset: 0x150
    int m_currentMaterialIndex;
    // protected UnityEngine.Material[] m_fontSharedMaterials
    // Offset: 0x158
    ::Array<UnityEngine::Material*>* m_fontSharedMaterials;
    // protected UnityEngine.Material m_fontMaterial
    // Offset: 0x160
    UnityEngine::Material* m_fontMaterial;
    // protected UnityEngine.Material[] m_fontMaterials
    // Offset: 0x168
    ::Array<UnityEngine::Material*>* m_fontMaterials;
    // protected System.Boolean m_isMaterialDirty
    // Offset: 0x170
    bool m_isMaterialDirty;
    // protected UnityEngine.Color32 m_fontColor32
    // Offset: 0x174
    UnityEngine::Color32 m_fontColor32;
    // protected UnityEngine.Color m_fontColor
    // Offset: 0x178
    UnityEngine::Color m_fontColor;
    // protected UnityEngine.Color32 m_underlineColor
    // Offset: 0x188
    UnityEngine::Color32 m_underlineColor;
    // protected UnityEngine.Color32 m_strikethroughColor
    // Offset: 0x18C
    UnityEngine::Color32 m_strikethroughColor;
    // protected UnityEngine.Color32 m_highlightColor
    // Offset: 0x190
    UnityEngine::Color32 m_highlightColor;
    // protected UnityEngine.Vector4 m_highlightPadding
    // Offset: 0x194
    UnityEngine::Vector4 m_highlightPadding;
    // protected System.Boolean m_enableVertexGradient
    // Offset: 0x1A4
    bool m_enableVertexGradient;
    // protected TMPro.ColorMode m_colorMode
    // Offset: 0x1A8
    TMPro::ColorMode m_colorMode;
    // protected TMPro.VertexGradient m_fontColorGradient
    // Offset: 0x1AC
    TMPro::VertexGradient m_fontColorGradient;
    // protected TMPro.TMP_ColorGradient m_fontColorGradientPreset
    // Offset: 0x1F0
    TMPro::TMP_ColorGradient* m_fontColorGradientPreset;
    // protected TMPro.TMP_SpriteAsset m_spriteAsset
    // Offset: 0x1F8
    TMPro::TMP_SpriteAsset* m_spriteAsset;
    // protected System.Boolean m_tintAllSprites
    // Offset: 0x200
    bool m_tintAllSprites;
    // protected System.Boolean m_tintSprite
    // Offset: 0x201
    bool m_tintSprite;
    // protected UnityEngine.Color32 m_spriteColor
    // Offset: 0x204
    UnityEngine::Color32 m_spriteColor;
    // protected System.Boolean m_overrideHtmlColors
    // Offset: 0x208
    bool m_overrideHtmlColors;
    // protected UnityEngine.Color32 m_faceColor
    // Offset: 0x20C
    UnityEngine::Color32 m_faceColor;
    // protected UnityEngine.Color32 m_outlineColor
    // Offset: 0x210
    UnityEngine::Color32 m_outlineColor;
    // protected System.Single m_outlineWidth
    // Offset: 0x214
    float m_outlineWidth;
    // protected System.Single m_fontSize
    // Offset: 0x218
    float m_fontSize;
    // protected System.Single m_currentFontSize
    // Offset: 0x21C
    float m_currentFontSize;
    // protected System.Single m_fontSizeBase
    // Offset: 0x220
    float m_fontSizeBase;
    // protected TMPro.TMP_RichTextTagStack`1<System.Single> m_sizeStack
    // Offset: 0x228
    TMPro::TMP_RichTextTagStack_1<float> m_sizeStack;
    // protected TMPro.FontWeight m_fontWeight
    // Offset: 0x240
    TMPro::FontWeight m_fontWeight;
    // protected TMPro.FontWeight m_FontWeightInternal
    // Offset: 0x244
    TMPro::FontWeight m_FontWeightInternal;
    // protected TMPro.TMP_RichTextTagStack`1<TMPro.FontWeight> m_FontWeightStack
    // Offset: 0x248
    TMPro::TMP_RichTextTagStack_1<TMPro::FontWeight> m_FontWeightStack;
    // protected System.Boolean m_enableAutoSizing
    // Offset: 0x260
    bool m_enableAutoSizing;
    // protected System.Single m_maxFontSize
    // Offset: 0x264
    float m_maxFontSize;
    // protected System.Single m_minFontSize
    // Offset: 0x268
    float m_minFontSize;
    // protected System.Single m_fontSizeMin
    // Offset: 0x26C
    float m_fontSizeMin;
    // protected System.Single m_fontSizeMax
    // Offset: 0x270
    float m_fontSizeMax;
    // protected TMPro.FontStyles m_fontStyle
    // Offset: 0x274
    TMPro::FontStyles m_fontStyle;
    // protected TMPro.FontStyles m_FontStyleInternal
    // Offset: 0x278
    TMPro::FontStyles m_FontStyleInternal;
    // protected TMPro.TMP_FontStyleStack m_fontStyleStack
    // Offset: 0x27C
    TMPro::TMP_FontStyleStack m_fontStyleStack;
    // protected System.Boolean m_isUsingBold
    // Offset: 0x286
    bool m_isUsingBold;
    // protected TMPro.TextAlignmentOptions m_textAlignment
    // Offset: 0x288
    TMPro::TextAlignmentOptions m_textAlignment;
    // protected TMPro.TextAlignmentOptions m_lineJustification
    // Offset: 0x28C
    TMPro::TextAlignmentOptions m_lineJustification;
    // protected TMPro.TMP_RichTextTagStack`1<TMPro.TextAlignmentOptions> m_lineJustificationStack
    // Offset: 0x290
    TMPro::TMP_RichTextTagStack_1<TMPro::TextAlignmentOptions> m_lineJustificationStack;
    // protected UnityEngine.Vector3[] m_textContainerLocalCorners
    // Offset: 0x2A8
    ::Array<UnityEngine::Vector3>* m_textContainerLocalCorners;
    // protected System.Single m_characterSpacing
    // Offset: 0x2B0
    float m_characterSpacing;
    // protected System.Single m_cSpacing
    // Offset: 0x2B4
    float m_cSpacing;
    // protected System.Single m_monoSpacing
    // Offset: 0x2B8
    float m_monoSpacing;
    // protected System.Single m_wordSpacing
    // Offset: 0x2BC
    float m_wordSpacing;
    // protected System.Single m_lineSpacing
    // Offset: 0x2C0
    float m_lineSpacing;
    // protected System.Single m_lineSpacingDelta
    // Offset: 0x2C4
    float m_lineSpacingDelta;
    // protected System.Single m_lineHeight
    // Offset: 0x2C8
    float m_lineHeight;
    // protected System.Single m_lineSpacingMax
    // Offset: 0x2CC
    float m_lineSpacingMax;
    // protected System.Single m_paragraphSpacing
    // Offset: 0x2D0
    float m_paragraphSpacing;
    // protected System.Single m_charWidthMaxAdj
    // Offset: 0x2D4
    float m_charWidthMaxAdj;
    // protected System.Single m_charWidthAdjDelta
    // Offset: 0x2D8
    float m_charWidthAdjDelta;
    // protected System.Boolean m_enableWordWrapping
    // Offset: 0x2DC
    bool m_enableWordWrapping;
    // protected System.Boolean m_isCharacterWrappingEnabled
    // Offset: 0x2DD
    bool m_isCharacterWrappingEnabled;
    // protected System.Boolean m_isNonBreakingSpace
    // Offset: 0x2DE
    bool m_isNonBreakingSpace;
    // protected System.Boolean m_isIgnoringAlignment
    // Offset: 0x2DF
    bool m_isIgnoringAlignment;
    // protected System.Single m_wordWrappingRatios
    // Offset: 0x2E0
    float m_wordWrappingRatios;
    // protected TMPro.TextOverflowModes m_overflowMode
    // Offset: 0x2E4
    TMPro::TextOverflowModes m_overflowMode;
    // protected System.Int32 m_firstOverflowCharacterIndex
    // Offset: 0x2E8
    int m_firstOverflowCharacterIndex;
    // protected TMPro.TMP_Text m_linkedTextComponent
    // Offset: 0x2F0
    TMPro::TMP_Text* m_linkedTextComponent;
    // protected System.Boolean m_isLinkedTextComponent
    // Offset: 0x2F8
    bool m_isLinkedTextComponent;
    // protected System.Boolean m_isTextTruncated
    // Offset: 0x2F9
    bool m_isTextTruncated;
    // protected System.Boolean m_enableKerning
    // Offset: 0x2FA
    bool m_enableKerning;
    // protected System.Boolean m_enableExtraPadding
    // Offset: 0x2FB
    bool m_enableExtraPadding;
    // protected System.Boolean checkPaddingRequired
    // Offset: 0x2FC
    bool checkPaddingRequired;
    // protected System.Boolean m_isRichText
    // Offset: 0x2FD
    bool m_isRichText;
    // protected System.Boolean m_parseCtrlCharacters
    // Offset: 0x2FE
    bool m_parseCtrlCharacters;
    // protected System.Boolean m_isOverlay
    // Offset: 0x2FF
    bool m_isOverlay;
    // protected System.Boolean m_isOrthographic
    // Offset: 0x300
    bool m_isOrthographic;
    // protected System.Boolean m_isCullingEnabled
    // Offset: 0x301
    bool m_isCullingEnabled;
    // protected System.Boolean m_ignoreRectMaskCulling
    // Offset: 0x302
    bool m_ignoreRectMaskCulling;
    // protected System.Boolean m_ignoreCulling
    // Offset: 0x303
    bool m_ignoreCulling;
    // protected TMPro.TextureMappingOptions m_horizontalMapping
    // Offset: 0x304
    TMPro::TextureMappingOptions m_horizontalMapping;
    // protected TMPro.TextureMappingOptions m_verticalMapping
    // Offset: 0x308
    TMPro::TextureMappingOptions m_verticalMapping;
    // protected System.Single m_uvLineOffset
    // Offset: 0x30C
    float m_uvLineOffset;
    // protected TMPro.TextRenderFlags m_renderMode
    // Offset: 0x310
    TMPro::TextRenderFlags m_renderMode;
    // protected TMPro.VertexSortingOrder m_geometrySortingOrder
    // Offset: 0x314
    TMPro::VertexSortingOrder m_geometrySortingOrder;
    // protected System.Boolean m_VertexBufferAutoSizeReduction
    // Offset: 0x318
    bool m_VertexBufferAutoSizeReduction;
    // protected System.Int32 m_firstVisibleCharacter
    // Offset: 0x31C
    int m_firstVisibleCharacter;
    // protected System.Int32 m_maxVisibleCharacters
    // Offset: 0x320
    int m_maxVisibleCharacters;
    // protected System.Int32 m_maxVisibleWords
    // Offset: 0x324
    int m_maxVisibleWords;
    // protected System.Int32 m_maxVisibleLines
    // Offset: 0x328
    int m_maxVisibleLines;
    // protected System.Boolean m_useMaxVisibleDescender
    // Offset: 0x32C
    bool m_useMaxVisibleDescender;
    // protected System.Int32 m_pageToDisplay
    // Offset: 0x330
    int m_pageToDisplay;
    // protected System.Boolean m_isNewPage
    // Offset: 0x334
    bool m_isNewPage;
    // protected UnityEngine.Vector4 m_margin
    // Offset: 0x338
    UnityEngine::Vector4 m_margin;
    // protected System.Single m_marginLeft
    // Offset: 0x348
    float m_marginLeft;
    // protected System.Single m_marginRight
    // Offset: 0x34C
    float m_marginRight;
    // protected System.Single m_marginWidth
    // Offset: 0x350
    float m_marginWidth;
    // protected System.Single m_marginHeight
    // Offset: 0x354
    float m_marginHeight;
    // protected System.Single m_width
    // Offset: 0x358
    float m_width;
    // protected TMPro.TMP_TextInfo m_textInfo
    // Offset: 0x360
    TMPro::TMP_TextInfo* m_textInfo;
    // protected System.Boolean m_havePropertiesChanged
    // Offset: 0x368
    bool m_havePropertiesChanged;
    // protected System.Boolean m_isUsingLegacyAnimationComponent
    // Offset: 0x369
    bool m_isUsingLegacyAnimationComponent;
    // protected UnityEngine.Transform m_transform
    // Offset: 0x370
    UnityEngine::Transform* m_transform;
    // protected UnityEngine.RectTransform m_rectTransform
    // Offset: 0x378
    UnityEngine::RectTransform* m_rectTransform;
    // private System.Boolean <autoSizeTextContainer>k__BackingField
    // Offset: 0x380
    bool autoSizeTextContainer;
    // protected System.Boolean m_autoSizeTextContainer
    // Offset: 0x381
    bool m_autoSizeTextContainer;
    // protected UnityEngine.Mesh m_mesh
    // Offset: 0x388
    UnityEngine::Mesh* m_mesh;
    // protected System.Boolean m_isVolumetricText
    // Offset: 0x390
    bool m_isVolumetricText;
    // protected TMPro.TMP_SpriteAnimator m_spriteAnimator
    // Offset: 0x398
    TMPro::TMP_SpriteAnimator* m_spriteAnimator;
    // protected System.Single m_flexibleHeight
    // Offset: 0x3A0
    float m_flexibleHeight;
    // protected System.Single m_flexibleWidth
    // Offset: 0x3A4
    float m_flexibleWidth;
    // protected System.Single m_minWidth
    // Offset: 0x3A8
    float m_minWidth;
    // protected System.Single m_minHeight
    // Offset: 0x3AC
    float m_minHeight;
    // protected System.Single m_maxWidth
    // Offset: 0x3B0
    float m_maxWidth;
    // protected System.Single m_maxHeight
    // Offset: 0x3B4
    float m_maxHeight;
    // protected UnityEngine.UI.LayoutElement m_LayoutElement
    // Offset: 0x3B8
    UnityEngine::UI::LayoutElement* m_LayoutElement;
    // protected System.Single m_preferredWidth
    // Offset: 0x3C0
    float m_preferredWidth;
    // protected System.Single m_renderedWidth
    // Offset: 0x3C4
    float m_renderedWidth;
    // protected System.Boolean m_isPreferredWidthDirty
    // Offset: 0x3C8
    bool m_isPreferredWidthDirty;
    // protected System.Single m_preferredHeight
    // Offset: 0x3CC
    float m_preferredHeight;
    // protected System.Single m_renderedHeight
    // Offset: 0x3D0
    float m_renderedHeight;
    // protected System.Boolean m_isPreferredHeightDirty
    // Offset: 0x3D4
    bool m_isPreferredHeightDirty;
    // protected System.Boolean m_isCalculatingPreferredValues
    // Offset: 0x3D5
    bool m_isCalculatingPreferredValues;
    // private System.Int32 m_recursiveCount
    // Offset: 0x3D8
    int m_recursiveCount;
    // protected System.Int32 m_layoutPriority
    // Offset: 0x3DC
    int m_layoutPriority;
    // protected System.Boolean m_isCalculateSizeRequired
    // Offset: 0x3E0
    bool m_isCalculateSizeRequired;
    // protected System.Boolean m_isLayoutDirty
    // Offset: 0x3E1
    bool m_isLayoutDirty;
    // protected System.Boolean m_verticesAlreadyDirty
    // Offset: 0x3E2
    bool m_verticesAlreadyDirty;
    // protected System.Boolean m_layoutAlreadyDirty
    // Offset: 0x3E3
    bool m_layoutAlreadyDirty;
    // protected System.Boolean m_isAwake
    // Offset: 0x3E4
    bool m_isAwake;
    // System.Boolean m_isWaitingOnResourceLoad
    // Offset: 0x3E5
    bool m_isWaitingOnResourceLoad;
    // System.Boolean m_isInputParsingRequired
    // Offset: 0x3E6
    bool m_isInputParsingRequired;
    // TMPro.TMP_Text/TextInputSources m_inputSource
    // Offset: 0x3E8
    TMPro::TMP_Text::TextInputSources m_inputSource;
    // protected System.String old_text
    // Offset: 0x3F0
    ::Il2CppString* old_text;
    // protected System.Single m_fontScale
    // Offset: 0x3F8
    float m_fontScale;
    // protected System.Single m_fontScaleMultiplier
    // Offset: 0x3FC
    float m_fontScaleMultiplier;
    // protected System.Char[] m_htmlTag
    // Offset: 0x400
    ::Array<::Il2CppChar>* m_htmlTag;
    // protected TMPro.RichTextTagAttribute[] m_xmlAttribute
    // Offset: 0x408
    ::Array<TMPro::RichTextTagAttribute>* m_xmlAttribute;
    // protected System.Single[] m_attributeParameterValues
    // Offset: 0x410
    ::Array<float>* m_attributeParameterValues;
    // protected System.Single tag_LineIndent
    // Offset: 0x418
    float tag_LineIndent;
    // protected System.Single tag_Indent
    // Offset: 0x41C
    float tag_Indent;
    // protected TMPro.TMP_RichTextTagStack`1<System.Single> m_indentStack
    // Offset: 0x420
    TMPro::TMP_RichTextTagStack_1<float> m_indentStack;
    // protected System.Boolean tag_NoParsing
    // Offset: 0x438
    bool tag_NoParsing;
    // protected System.Boolean m_isParsingText
    // Offset: 0x439
    bool m_isParsingText;
    // protected UnityEngine.Matrix4x4 m_FXMatrix
    // Offset: 0x43C
    UnityEngine::Matrix4x4 m_FXMatrix;
    // protected System.Boolean m_isFXMatrixSet
    // Offset: 0x47C
    bool m_isFXMatrixSet;
    // protected TMPro.TMP_Text/UnicodeChar[] m_TextParsingBuffer
    // Offset: 0x480
    ::Array<TMPro::TMP_Text::UnicodeChar>* m_TextParsingBuffer;
    // private TMPro.TMP_CharacterInfo[] m_internalCharacterInfo
    // Offset: 0x488
    ::Array<TMPro::TMP_CharacterInfo>* m_internalCharacterInfo;
    // protected System.Char[] m_input_CharArray
    // Offset: 0x490
    ::Array<::Il2CppChar>* m_input_CharArray;
    // private System.Int32 m_charArray_Length
    // Offset: 0x498
    int m_charArray_Length;
    // protected System.Int32 m_totalCharacterCount
    // Offset: 0x49C
    int m_totalCharacterCount;
    // protected TMPro.WordWrapState m_SavedWordWrapState
    // Offset: 0x4A0
    TMPro::WordWrapState m_SavedWordWrapState;
    // protected TMPro.WordWrapState m_SavedLineState
    // Offset: 0x730
    TMPro::WordWrapState m_SavedLineState;
    // protected System.Int32 m_characterCount
    // Offset: 0x9C0
    int m_characterCount;
    // protected System.Int32 m_firstCharacterOfLine
    // Offset: 0x9C4
    int m_firstCharacterOfLine;
    // protected System.Int32 m_firstVisibleCharacterOfLine
    // Offset: 0x9C8
    int m_firstVisibleCharacterOfLine;
    // protected System.Int32 m_lastCharacterOfLine
    // Offset: 0x9CC
    int m_lastCharacterOfLine;
    // protected System.Int32 m_lastVisibleCharacterOfLine
    // Offset: 0x9D0
    int m_lastVisibleCharacterOfLine;
    // protected System.Int32 m_lineNumber
    // Offset: 0x9D4
    int m_lineNumber;
    // protected System.Int32 m_lineVisibleCharacterCount
    // Offset: 0x9D8
    int m_lineVisibleCharacterCount;
    // protected System.Int32 m_pageNumber
    // Offset: 0x9DC
    int m_pageNumber;
    // protected System.Single m_maxAscender
    // Offset: 0x9E0
    float m_maxAscender;
    // protected System.Single m_maxCapHeight
    // Offset: 0x9E4
    float m_maxCapHeight;
    // protected System.Single m_maxDescender
    // Offset: 0x9E8
    float m_maxDescender;
    // protected System.Single m_maxLineAscender
    // Offset: 0x9EC
    float m_maxLineAscender;
    // protected System.Single m_maxLineDescender
    // Offset: 0x9F0
    float m_maxLineDescender;
    // protected System.Single m_startOfLineAscender
    // Offset: 0x9F4
    float m_startOfLineAscender;
    // protected System.Single m_lineOffset
    // Offset: 0x9F8
    float m_lineOffset;
    // protected TMPro.Extents m_meshExtents
    // Offset: 0x9FC
    TMPro::Extents m_meshExtents;
    // protected UnityEngine.Color32 m_htmlColor
    // Offset: 0xA0C
    UnityEngine::Color32 m_htmlColor;
    // protected TMPro.TMP_RichTextTagStack`1<UnityEngine.Color32> m_colorStack
    // Offset: 0xA10
    TMPro::TMP_RichTextTagStack_1<UnityEngine::Color32> m_colorStack;
    // protected TMPro.TMP_RichTextTagStack`1<UnityEngine.Color32> m_underlineColorStack
    // Offset: 0xA28
    TMPro::TMP_RichTextTagStack_1<UnityEngine::Color32> m_underlineColorStack;
    // protected TMPro.TMP_RichTextTagStack`1<UnityEngine.Color32> m_strikethroughColorStack
    // Offset: 0xA40
    TMPro::TMP_RichTextTagStack_1<UnityEngine::Color32> m_strikethroughColorStack;
    // protected TMPro.TMP_RichTextTagStack`1<UnityEngine.Color32> m_highlightColorStack
    // Offset: 0xA58
    TMPro::TMP_RichTextTagStack_1<UnityEngine::Color32> m_highlightColorStack;
    // protected TMPro.TMP_ColorGradient m_colorGradientPreset
    // Offset: 0xA70
    TMPro::TMP_ColorGradient* m_colorGradientPreset;
    // protected TMPro.TMP_RichTextTagStack`1<TMPro.TMP_ColorGradient> m_colorGradientStack
    // Offset: 0xA78
    TMPro::TMP_RichTextTagStack_1<TMPro::TMP_ColorGradient*> m_colorGradientStack;
    // protected System.Single m_tabSpacing
    // Offset: 0xA90
    float m_tabSpacing;
    // protected System.Single m_spacing
    // Offset: 0xA94
    float m_spacing;
    // protected TMPro.TMP_RichTextTagStack`1<System.Int32> m_styleStack
    // Offset: 0xA98
    TMPro::TMP_RichTextTagStack_1<int> m_styleStack;
    // protected TMPro.TMP_RichTextTagStack`1<System.Int32> m_actionStack
    // Offset: 0xAB0
    TMPro::TMP_RichTextTagStack_1<int> m_actionStack;
    // protected System.Single m_padding
    // Offset: 0xAC8
    float m_padding;
    // protected System.Single m_baselineOffset
    // Offset: 0xACC
    float m_baselineOffset;
    // protected TMPro.TMP_RichTextTagStack`1<System.Single> m_baselineOffsetStack
    // Offset: 0xAD0
    TMPro::TMP_RichTextTagStack_1<float> m_baselineOffsetStack;
    // protected System.Single m_xAdvance
    // Offset: 0xAE8
    float m_xAdvance;
    // protected TMPro.TMP_TextElementType m_textElementType
    // Offset: 0xAEC
    TMPro::TMP_TextElementType m_textElementType;
    // protected TMPro.TMP_TextElement m_cached_TextElement
    // Offset: 0xAF0
    TMPro::TMP_TextElement* m_cached_TextElement;
    // protected TMPro.TMP_Character m_cached_Underline_Character
    // Offset: 0xAF8
    TMPro::TMP_Character* m_cached_Underline_Character;
    // protected TMPro.TMP_Character m_cached_Ellipsis_Character
    // Offset: 0xB00
    TMPro::TMP_Character* m_cached_Ellipsis_Character;
    // protected TMPro.TMP_SpriteAsset m_defaultSpriteAsset
    // Offset: 0xB08
    TMPro::TMP_SpriteAsset* m_defaultSpriteAsset;
    // protected TMPro.TMP_SpriteAsset m_currentSpriteAsset
    // Offset: 0xB10
    TMPro::TMP_SpriteAsset* m_currentSpriteAsset;
    // protected System.Int32 m_spriteCount
    // Offset: 0xB18
    int m_spriteCount;
    // protected System.Int32 m_spriteIndex
    // Offset: 0xB1C
    int m_spriteIndex;
    // protected System.Int32 m_spriteAnimationID
    // Offset: 0xB20
    int m_spriteAnimationID;
    // protected System.Boolean m_ignoreActiveState
    // Offset: 0xB24
    bool m_ignoreActiveState;
    // private readonly System.Single[] k_Power
    // Offset: 0xB28
    ::Array<float>* k_Power;
    // Get static field: static protected UnityEngine.Color32 s_colorWhite
    static UnityEngine::Color32 _get_s_colorWhite();
    // Set static field: static protected UnityEngine.Color32 s_colorWhite
    static void _set_s_colorWhite(UnityEngine::Color32 value);
    // Get static field: static protected UnityEngine.Vector2 k_LargePositiveVector2
    static UnityEngine::Vector2 _get_k_LargePositiveVector2();
    // Set static field: static protected UnityEngine.Vector2 k_LargePositiveVector2
    static void _set_k_LargePositiveVector2(UnityEngine::Vector2 value);
    // Get static field: static protected UnityEngine.Vector2 k_LargeNegativeVector2
    static UnityEngine::Vector2 _get_k_LargeNegativeVector2();
    // Set static field: static protected UnityEngine.Vector2 k_LargeNegativeVector2
    static void _set_k_LargeNegativeVector2(UnityEngine::Vector2 value);
