// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Type namespace: TMPro
namespace TMPro {
  // Autogenerated type: TMPro.TMP_TextElement_Legacy
  class TMP_TextElement_Legacy : public ::Il2CppObject {
    public:
    // public System.Int32 id
    // Offset: 0x10
    int id;
    // public System.Single x
    // Offset: 0x14
    float x;
    // public System.Single y
    // Offset: 0x18
    float y;
    // public System.Single width
    // Offset: 0x1C
    float width;
    // public System.Single height
    // Offset: 0x20
    float height;
    // public System.Single xOffset
    // Offset: 0x24
    float xOffset;
    // public System.Single yOffset
    // Offset: 0x28
    float yOffset;
    // public System.Single xAdvance
    // Offset: 0x2C
    float xAdvance;
    // public System.Single scale
    // Offset: 0x30
    float scale;
    // public System.Void .ctor()
    // Offset: 0xDC2C48
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static TMP_TextElement_Legacy* New_ctor();
  }; // TMPro.TMP_TextElement_Legacy
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(TMPro::TMP_TextElement_Legacy*, "TMPro", "TMP_TextElement_Legacy");
#pragma pack(pop)
