// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: TMPro.TMP_TextElementType
#include "TMPro/TMP_TextElementType.hpp"
// Including type: TMPro.TMP_Vertex
#include "TMPro/TMP_Vertex.hpp"
// Including type: TMPro.FontStyles
#include "TMPro/FontStyles.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_TextElement
  class TMP_TextElement;
  // Forward declaring type: TMP_FontAsset
  class TMP_FontAsset;
  // Forward declaring type: TMP_SpriteAsset
  class TMP_SpriteAsset;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Size: 0x151
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: TMPro.TMP_CharacterInfo
  // [TokenAttribute] Offset: FFFFFFFF
  struct TMP_CharacterInfo/*, public System::ValueType*/ {
    public:
    // public System.Char character
    // Size: 0x2
    // Offset: 0x0
    ::Il2CppChar character;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // Padding between fields: character and: index
    char __padding0[0x2] = {};
    // public System.Int32 index
    // Size: 0x4
    // Offset: 0x4
    int index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 stringLength
    // Size: 0x4
    // Offset: 0x8
    int stringLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public TMPro.TMP_TextElementType elementType
    // Size: 0x4
    // Offset: 0xC
    TMPro::TMP_TextElementType elementType;
    // Field size check
    static_assert(sizeof(TMPro::TMP_TextElementType) == 0x4);
    // public TMPro.TMP_TextElement textElement
    // Size: 0x8
    // Offset: 0x10
    TMPro::TMP_TextElement* textElement;
    // Field size check
    static_assert(sizeof(TMPro::TMP_TextElement*) == 0x8);
    // public TMPro.TMP_FontAsset fontAsset
    // Size: 0x8
    // Offset: 0x18
    TMPro::TMP_FontAsset* fontAsset;
    // Field size check
    static_assert(sizeof(TMPro::TMP_FontAsset*) == 0x8);
    // public TMPro.TMP_SpriteAsset spriteAsset
    // Size: 0x8
    // Offset: 0x20
    TMPro::TMP_SpriteAsset* spriteAsset;
    // Field size check
    static_assert(sizeof(TMPro::TMP_SpriteAsset*) == 0x8);
    // public System.Int32 spriteIndex
    // Size: 0x4
    // Offset: 0x28
    int spriteIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: spriteIndex and: material
    char __padding7[0x4] = {};
    // public UnityEngine.Material material
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::Material* material;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // public System.Int32 materialReferenceIndex
    // Size: 0x4
    // Offset: 0x38
    int materialReferenceIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean isUsingAlternateTypeface
    // Size: 0x1
    // Offset: 0x3C
    bool isUsingAlternateTypeface;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isUsingAlternateTypeface and: pointSize
    char __padding10[0x3] = {};
    // public System.Single pointSize
    // Size: 0x4
    // Offset: 0x40
    float pointSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 lineNumber
    // Size: 0x4
    // Offset: 0x44
    int lineNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 pageNumber
    // Size: 0x4
    // Offset: 0x48
    int pageNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 vertexIndex
    // Size: 0x4
    // Offset: 0x4C
    int vertexIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public TMPro.TMP_Vertex vertex_BL
    // Size: 0x28
    // Offset: 0x50
    TMPro::TMP_Vertex vertex_BL;
    // Field size check
    static_assert(sizeof(TMPro::TMP_Vertex) == 0x28);
    // public TMPro.TMP_Vertex vertex_TL
    // Size: 0x28
    // Offset: 0x78
    TMPro::TMP_Vertex vertex_TL;
    // Field size check
    static_assert(sizeof(TMPro::TMP_Vertex) == 0x28);
    // public TMPro.TMP_Vertex vertex_TR
    // Size: 0x28
    // Offset: 0xA0
    TMPro::TMP_Vertex vertex_TR;
    // Field size check
    static_assert(sizeof(TMPro::TMP_Vertex) == 0x28);
    // public TMPro.TMP_Vertex vertex_BR
    // Size: 0x28
    // Offset: 0xC8
    TMPro::TMP_Vertex vertex_BR;
    // Field size check
    static_assert(sizeof(TMPro::TMP_Vertex) == 0x28);
    // public UnityEngine.Vector3 topLeft
    // Size: 0xC
    // Offset: 0xF0
    UnityEngine::Vector3 topLeft;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 bottomLeft
    // Size: 0xC
    // Offset: 0xFC
    UnityEngine::Vector3 bottomLeft;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 topRight
    // Size: 0xC
    // Offset: 0x108
    UnityEngine::Vector3 topRight;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 bottomRight
    // Size: 0xC
    // Offset: 0x114
    UnityEngine::Vector3 bottomRight;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public System.Single origin
    // Size: 0x4
    // Offset: 0x120
    float origin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ascender
    // Size: 0x4
    // Offset: 0x124
    float ascender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single baseLine
    // Size: 0x4
    // Offset: 0x128
    float baseLine;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single descender
    // Size: 0x4
    // Offset: 0x12C
    float descender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single xAdvance
    // Size: 0x4
    // Offset: 0x130
    float xAdvance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single aspectRatio
    // Size: 0x4
    // Offset: 0x134
    float aspectRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single scale
    // Size: 0x4
    // Offset: 0x138
    float scale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Color32 color
    // Size: 0x4
    // Offset: 0x13C
    UnityEngine::Color32 color;
    // Field size check
    static_assert(sizeof(UnityEngine::Color32) == 0x4);
    // public UnityEngine.Color32 underlineColor
    // Size: 0x4
    // Offset: 0x140
    UnityEngine::Color32 underlineColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color32) == 0x4);
    // public UnityEngine.Color32 strikethroughColor
    // Size: 0x4
    // Offset: 0x144
    UnityEngine::Color32 strikethroughColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color32) == 0x4);
    // public UnityEngine.Color32 highlightColor
    // Size: 0x4
    // Offset: 0x148
    UnityEngine::Color32 highlightColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color32) == 0x4);
    // public TMPro.FontStyles style
    // Size: 0x4
    // Offset: 0x14C
    TMPro::FontStyles style;
    // Field size check
    static_assert(sizeof(TMPro::FontStyles) == 0x4);
    // public System.Boolean isVisible
    // Size: 0x1
    // Offset: 0x150
    bool isVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: TMP_CharacterInfo
    constexpr TMP_CharacterInfo(::Il2CppChar character_ = {}, int index_ = {}, int stringLength_ = {}, TMPro::TMP_TextElementType elementType_ = {}, TMPro::TMP_TextElement* textElement_ = {}, TMPro::TMP_FontAsset* fontAsset_ = {}, TMPro::TMP_SpriteAsset* spriteAsset_ = {}, int spriteIndex_ = {}, UnityEngine::Material* material_ = {}, int materialReferenceIndex_ = {}, bool isUsingAlternateTypeface_ = {}, float pointSize_ = {}, int lineNumber_ = {}, int pageNumber_ = {}, int vertexIndex_ = {}, TMPro::TMP_Vertex vertex_BL_ = {}, TMPro::TMP_Vertex vertex_TL_ = {}, TMPro::TMP_Vertex vertex_TR_ = {}, TMPro::TMP_Vertex vertex_BR_ = {}, UnityEngine::Vector3 topLeft_ = {}, UnityEngine::Vector3 bottomLeft_ = {}, UnityEngine::Vector3 topRight_ = {}, UnityEngine::Vector3 bottomRight_ = {}, float origin_ = {}, float ascender_ = {}, float baseLine_ = {}, float descender_ = {}, float xAdvance_ = {}, float aspectRatio_ = {}, float scale_ = {}, UnityEngine::Color32 color_ = {}, UnityEngine::Color32 underlineColor_ = {}, UnityEngine::Color32 strikethroughColor_ = {}, UnityEngine::Color32 highlightColor_ = {}, TMPro::FontStyles style_ = {}, bool isVisible_ = {}) noexcept : character{character_}, index{index_}, stringLength{stringLength_}, elementType{elementType_}, textElement{textElement_}, fontAsset{fontAsset_}, spriteAsset{spriteAsset_}, spriteIndex{spriteIndex_}, material{material_}, materialReferenceIndex{materialReferenceIndex_}, isUsingAlternateTypeface{isUsingAlternateTypeface_}, pointSize{pointSize_}, lineNumber{lineNumber_}, pageNumber{pageNumber_}, vertexIndex{vertexIndex_}, vertex_BL{vertex_BL_}, vertex_TL{vertex_TL_}, vertex_TR{vertex_TR_}, vertex_BR{vertex_BR_}, topLeft{topLeft_}, bottomLeft{bottomLeft_}, topRight{topRight_}, bottomRight{bottomRight_}, origin{origin_}, ascender{ascender_}, baseLine{baseLine_}, descender{descender_}, xAdvance{xAdvance_}, aspectRatio{aspectRatio_}, scale{scale_}, color{color_}, underlineColor{underlineColor_}, strikethroughColor{strikethroughColor_}, highlightColor{highlightColor_}, style{style_}, isVisible{isVisible_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public System.Char character
    ::Il2CppChar _get_character();
    // Set instance field: public System.Char character
    void _set_character(::Il2CppChar value);
    // Get instance field: public System.Int32 index
    int _get_index();
    // Set instance field: public System.Int32 index
    void _set_index(int value);
    // Get instance field: public System.Int32 stringLength
    int _get_stringLength();
    // Set instance field: public System.Int32 stringLength
    void _set_stringLength(int value);
    // Get instance field: public TMPro.TMP_TextElementType elementType
    TMPro::TMP_TextElementType _get_elementType();
    // Set instance field: public TMPro.TMP_TextElementType elementType
    void _set_elementType(TMPro::TMP_TextElementType value);
    // Get instance field: public TMPro.TMP_TextElement textElement
    TMPro::TMP_TextElement* _get_textElement();
    // Set instance field: public TMPro.TMP_TextElement textElement
    void _set_textElement(TMPro::TMP_TextElement* value);
    // Get instance field: public TMPro.TMP_FontAsset fontAsset
    TMPro::TMP_FontAsset* _get_fontAsset();
    // Set instance field: public TMPro.TMP_FontAsset fontAsset
    void _set_fontAsset(TMPro::TMP_FontAsset* value);
    // Get instance field: public TMPro.TMP_SpriteAsset spriteAsset
    TMPro::TMP_SpriteAsset* _get_spriteAsset();
    // Set instance field: public TMPro.TMP_SpriteAsset spriteAsset
    void _set_spriteAsset(TMPro::TMP_SpriteAsset* value);
    // Get instance field: public System.Int32 spriteIndex
    int _get_spriteIndex();
    // Set instance field: public System.Int32 spriteIndex
    void _set_spriteIndex(int value);
    // Get instance field: public UnityEngine.Material material
    UnityEngine::Material* _get_material();
    // Set instance field: public UnityEngine.Material material
    void _set_material(UnityEngine::Material* value);
    // Get instance field: public System.Int32 materialReferenceIndex
    int _get_materialReferenceIndex();
    // Set instance field: public System.Int32 materialReferenceIndex
    void _set_materialReferenceIndex(int value);
    // Get instance field: public System.Boolean isUsingAlternateTypeface
    bool _get_isUsingAlternateTypeface();
    // Set instance field: public System.Boolean isUsingAlternateTypeface
    void _set_isUsingAlternateTypeface(bool value);
    // Get instance field: public System.Single pointSize
    float _get_pointSize();
    // Set instance field: public System.Single pointSize
    void _set_pointSize(float value);
    // Get instance field: public System.Int32 lineNumber
    int _get_lineNumber();
    // Set instance field: public System.Int32 lineNumber
    void _set_lineNumber(int value);
    // Get instance field: public System.Int32 pageNumber
    int _get_pageNumber();
    // Set instance field: public System.Int32 pageNumber
    void _set_pageNumber(int value);
    // Get instance field: public System.Int32 vertexIndex
    int _get_vertexIndex();
    // Set instance field: public System.Int32 vertexIndex
    void _set_vertexIndex(int value);
    // Get instance field: public TMPro.TMP_Vertex vertex_BL
    TMPro::TMP_Vertex _get_vertex_BL();
    // Set instance field: public TMPro.TMP_Vertex vertex_BL
    void _set_vertex_BL(TMPro::TMP_Vertex value);
    // Get instance field: public TMPro.TMP_Vertex vertex_TL
    TMPro::TMP_Vertex _get_vertex_TL();
    // Set instance field: public TMPro.TMP_Vertex vertex_TL
    void _set_vertex_TL(TMPro::TMP_Vertex value);
    // Get instance field: public TMPro.TMP_Vertex vertex_TR
    TMPro::TMP_Vertex _get_vertex_TR();
    // Set instance field: public TMPro.TMP_Vertex vertex_TR
    void _set_vertex_TR(TMPro::TMP_Vertex value);
    // Get instance field: public TMPro.TMP_Vertex vertex_BR
    TMPro::TMP_Vertex _get_vertex_BR();
    // Set instance field: public TMPro.TMP_Vertex vertex_BR
    void _set_vertex_BR(TMPro::TMP_Vertex value);
    // Get instance field: public UnityEngine.Vector3 topLeft
    UnityEngine::Vector3 _get_topLeft();
    // Set instance field: public UnityEngine.Vector3 topLeft
    void _set_topLeft(UnityEngine::Vector3 value);
    // Get instance field: public UnityEngine.Vector3 bottomLeft
    UnityEngine::Vector3 _get_bottomLeft();
    // Set instance field: public UnityEngine.Vector3 bottomLeft
    void _set_bottomLeft(UnityEngine::Vector3 value);
    // Get instance field: public UnityEngine.Vector3 topRight
    UnityEngine::Vector3 _get_topRight();
    // Set instance field: public UnityEngine.Vector3 topRight
    void _set_topRight(UnityEngine::Vector3 value);
    // Get instance field: public UnityEngine.Vector3 bottomRight
    UnityEngine::Vector3 _get_bottomRight();
    // Set instance field: public UnityEngine.Vector3 bottomRight
    void _set_bottomRight(UnityEngine::Vector3 value);
    // Get instance field: public System.Single origin
    float _get_origin();
    // Set instance field: public System.Single origin
    void _set_origin(float value);
    // Get instance field: public System.Single ascender
    float _get_ascender();
    // Set instance field: public System.Single ascender
    void _set_ascender(float value);
    // Get instance field: public System.Single baseLine
    float _get_baseLine();
    // Set instance field: public System.Single baseLine
    void _set_baseLine(float value);
    // Get instance field: public System.Single descender
    float _get_descender();
    // Set instance field: public System.Single descender
    void _set_descender(float value);
    // Get instance field: public System.Single xAdvance
    float _get_xAdvance();
    // Set instance field: public System.Single xAdvance
    void _set_xAdvance(float value);
    // Get instance field: public System.Single aspectRatio
    float _get_aspectRatio();
    // Set instance field: public System.Single aspectRatio
    void _set_aspectRatio(float value);
    // Get instance field: public System.Single scale
    float _get_scale();
    // Set instance field: public System.Single scale
    void _set_scale(float value);
    // Get instance field: public UnityEngine.Color32 color
    UnityEngine::Color32 _get_color();
    // Set instance field: public UnityEngine.Color32 color
    void _set_color(UnityEngine::Color32 value);
    // Get instance field: public UnityEngine.Color32 underlineColor
    UnityEngine::Color32 _get_underlineColor();
    // Set instance field: public UnityEngine.Color32 underlineColor
    void _set_underlineColor(UnityEngine::Color32 value);
    // Get instance field: public UnityEngine.Color32 strikethroughColor
    UnityEngine::Color32 _get_strikethroughColor();
    // Set instance field: public UnityEngine.Color32 strikethroughColor
    void _set_strikethroughColor(UnityEngine::Color32 value);
    // Get instance field: public UnityEngine.Color32 highlightColor
    UnityEngine::Color32 _get_highlightColor();
    // Set instance field: public UnityEngine.Color32 highlightColor
    void _set_highlightColor(UnityEngine::Color32 value);
    // Get instance field: public TMPro.FontStyles style
    TMPro::FontStyles _get_style();
    // Set instance field: public TMPro.FontStyles style
    void _set_style(TMPro::FontStyles value);
    // Get instance field: public System.Boolean isVisible
    bool _get_isVisible();
    // Set instance field: public System.Boolean isVisible
    void _set_isVisible(bool value);
  }; // TMPro.TMP_CharacterInfo
  #pragma pack(pop)
  static check_size<sizeof(TMP_CharacterInfo), 336 + sizeof(bool)> __TMPro_TMP_CharacterInfoSizeCheck;
  static_assert(sizeof(TMP_CharacterInfo) == 0x151);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(TMPro::TMP_CharacterInfo, "TMPro", "TMP_CharacterInfo");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
