// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
// Including type: UnityEngine.UI.Selectable
#include "UnityEngine/UI/Selectable.hpp"
// Including type: UnityEngine.EventSystems.IUpdateSelectedHandler
#include "UnityEngine/EventSystems/IUpdateSelectedHandler.hpp"
// Including type: UnityEngine.EventSystems.IBeginDragHandler
#include "UnityEngine/EventSystems/IBeginDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IDragHandler
#include "UnityEngine/EventSystems/IDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IEndDragHandler
#include "UnityEngine/EventSystems/IEndDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IPointerClickHandler
#include "UnityEngine/EventSystems/IPointerClickHandler.hpp"
// Including type: UnityEngine.EventSystems.ISubmitHandler
#include "UnityEngine/EventSystems/ISubmitHandler.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.EventSystems.IScrollHandler
#include "UnityEngine/EventSystems/IScrollHandler.hpp"
// Including type: UnityEngine.TouchScreenKeyboardType
#include "UnityEngine/TouchScreenKeyboardType.hpp"

  class TMP_InputValidator;
  // Skipping declaration: ContentType because it is already included!
  // Skipping declaration: LineType because it is already included!
  // Skipping declaration: InputType because it is already included!
  // Skipping declaration: CharacterValidation because it is already included!
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Graphic
  class Graphic;
  // Forward declaring type: Scrollbar
  class Scrollbar;
  // Forward declaring type: VertexHelper
  class VertexHelper;
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: BaseInput
  class BaseInput;
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Forward declaring type: BaseEventData
  class BaseEventData;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Autogenerated type: TMPro.TMP_InputField
  class TMP_InputField : public UnityEngine::UI::Selectable, public UnityEngine::EventSystems::IUpdateSelectedHandler, public UnityEngine::EventSystems::IBeginDragHandler, public UnityEngine::EventSystems::IDragHandler, public UnityEngine::EventSystems::IEndDragHandler, public UnityEngine::EventSystems::IPointerClickHandler, public UnityEngine::EventSystems::ISubmitHandler, public UnityEngine::UI::ICanvasElement, public UnityEngine::UI::ILayoutElement, public UnityEngine::EventSystems::IScrollHandler {
    public:
    // Nested type: TMPro::TMP_InputField::ContentType
    struct ContentType;
    // Nested type: TMPro::TMP_InputField::InputType
    struct InputType;
    // Nested type: TMPro::TMP_InputField::CharacterValidation
    struct CharacterValidation;
    // Nested type: TMPro::TMP_InputField::LineType
    struct LineType;
    // Nested type: TMPro::TMP_InputField::OnValidateInput
    class OnValidateInput;
    // Nested type: TMPro::TMP_InputField::SubmitEvent
    class SubmitEvent;
    // Nested type: TMPro::TMP_InputField::OnChangeEvent
    class OnChangeEvent;
    // Nested type: TMPro::TMP_InputField::SelectionEvent
    class SelectionEvent;
    // Nested type: TMPro::TMP_InputField::TextSelectionEvent
    class TextSelectionEvent;
    // Nested type: TMPro::TMP_InputField::TouchScreenKeyboardEvent
    class TouchScreenKeyboardEvent;
    // Nested type: TMPro::TMP_InputField::EditState
    struct EditState;
    // Nested type: TMPro::TMP_InputField::$CaretBlink$d__267
    class $CaretBlink$d__267;
    // Nested type: TMPro::TMP_InputField::$MouseDragOutsideRect$d__285
    class $MouseDragOutsideRect$d__285;
    // Autogenerated type: TMPro.TMP_InputField/ContentType
    struct ContentType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: ContentType
      constexpr ContentType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.TMP_InputField/ContentType Standard
      static constexpr const int Standard = 0;
      // Get static field: static public TMPro.TMP_InputField/ContentType Standard
      static TMPro::TMP_InputField::ContentType _get_Standard();
      // Set static field: static public TMPro.TMP_InputField/ContentType Standard
      static void _set_Standard(TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/ContentType Autocorrected
      static constexpr const int Autocorrected = 1;
      // Get static field: static public TMPro.TMP_InputField/ContentType Autocorrected
      static TMPro::TMP_InputField::ContentType _get_Autocorrected();
      // Set static field: static public TMPro.TMP_InputField/ContentType Autocorrected
      static void _set_Autocorrected(TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/ContentType IntegerNumber
      static constexpr const int IntegerNumber = 2;
      // Get static field: static public TMPro.TMP_InputField/ContentType IntegerNumber
      static TMPro::TMP_InputField::ContentType _get_IntegerNumber();
      // Set static field: static public TMPro.TMP_InputField/ContentType IntegerNumber
      static void _set_IntegerNumber(TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/ContentType DecimalNumber
      static constexpr const int DecimalNumber = 3;
      // Get static field: static public TMPro.TMP_InputField/ContentType DecimalNumber
      static TMPro::TMP_InputField::ContentType _get_DecimalNumber();
      // Set static field: static public TMPro.TMP_InputField/ContentType DecimalNumber
      static void _set_DecimalNumber(TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/ContentType Alphanumeric
      static constexpr const int Alphanumeric = 4;
      // Get static field: static public TMPro.TMP_InputField/ContentType Alphanumeric
      static TMPro::TMP_InputField::ContentType _get_Alphanumeric();
      // Set static field: static public TMPro.TMP_InputField/ContentType Alphanumeric
      static void _set_Alphanumeric(TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/ContentType Name
      static constexpr const int Name = 5;
      // Get static field: static public TMPro.TMP_InputField/ContentType Name
      static TMPro::TMP_InputField::ContentType _get_Name();
      // Set static field: static public TMPro.TMP_InputField/ContentType Name
      static void _set_Name(TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/ContentType EmailAddress
      static constexpr const int EmailAddress = 6;
      // Get static field: static public TMPro.TMP_InputField/ContentType EmailAddress
      static TMPro::TMP_InputField::ContentType _get_EmailAddress();
      // Set static field: static public TMPro.TMP_InputField/ContentType EmailAddress
      static void _set_EmailAddress(TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/ContentType Password
      static constexpr const int Password = 7;
      // Get static field: static public TMPro.TMP_InputField/ContentType Password
      static TMPro::TMP_InputField::ContentType _get_Password();
      // Set static field: static public TMPro.TMP_InputField/ContentType Password
      static void _set_Password(TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/ContentType Pin
      static constexpr const int Pin = 8;
      // Get static field: static public TMPro.TMP_InputField/ContentType Pin
      static TMPro::TMP_InputField::ContentType _get_Pin();
      // Set static field: static public TMPro.TMP_InputField/ContentType Pin
      static void _set_Pin(TMPro::TMP_InputField::ContentType value);
      // static field const value: static public TMPro.TMP_InputField/ContentType Custom
      static constexpr const int Custom = 9;
      // Get static field: static public TMPro.TMP_InputField/ContentType Custom
      static TMPro::TMP_InputField::ContentType _get_Custom();
      // Set static field: static public TMPro.TMP_InputField/ContentType Custom
      static void _set_Custom(TMPro::TMP_InputField::ContentType value);
    }; // TMPro.TMP_InputField/ContentType
    // Autogenerated type: TMPro.TMP_InputField/InputType
    struct InputType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: InputType
      constexpr InputType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.TMP_InputField/InputType Standard
      static constexpr const int Standard = 0;
      // Get static field: static public TMPro.TMP_InputField/InputType Standard
      static TMPro::TMP_InputField::InputType _get_Standard();
      // Set static field: static public TMPro.TMP_InputField/InputType Standard
      static void _set_Standard(TMPro::TMP_InputField::InputType value);
      // static field const value: static public TMPro.TMP_InputField/InputType AutoCorrect
      static constexpr const int AutoCorrect = 1;
      // Get static field: static public TMPro.TMP_InputField/InputType AutoCorrect
      static TMPro::TMP_InputField::InputType _get_AutoCorrect();
      // Set static field: static public TMPro.TMP_InputField/InputType AutoCorrect
      static void _set_AutoCorrect(TMPro::TMP_InputField::InputType value);
      // static field const value: static public TMPro.TMP_InputField/InputType Password
      static constexpr const int Password = 2;
      // Get static field: static public TMPro.TMP_InputField/InputType Password
      static TMPro::TMP_InputField::InputType _get_Password();
      // Set static field: static public TMPro.TMP_InputField/InputType Password
      static void _set_Password(TMPro::TMP_InputField::InputType value);
    }; // TMPro.TMP_InputField/InputType
    // Autogenerated type: TMPro.TMP_InputField/CharacterValidation
    struct CharacterValidation : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: CharacterValidation
      constexpr CharacterValidation(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.TMP_InputField/CharacterValidation None
      static constexpr const int None = 0;
      // Get static field: static public TMPro.TMP_InputField/CharacterValidation None
      static TMPro::TMP_InputField::CharacterValidation _get_None();
      // Set static field: static public TMPro.TMP_InputField/CharacterValidation None
      static void _set_None(TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/CharacterValidation Digit
      static constexpr const int Digit = 1;
      // Get static field: static public TMPro.TMP_InputField/CharacterValidation Digit
      static TMPro::TMP_InputField::CharacterValidation _get_Digit();
      // Set static field: static public TMPro.TMP_InputField/CharacterValidation Digit
      static void _set_Digit(TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/CharacterValidation Integer
      static constexpr const int Integer = 2;
      // Get static field: static public TMPro.TMP_InputField/CharacterValidation Integer
      static TMPro::TMP_InputField::CharacterValidation _get_Integer();
      // Set static field: static public TMPro.TMP_InputField/CharacterValidation Integer
      static void _set_Integer(TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/CharacterValidation Decimal
      static constexpr const int Decimal = 3;
      // Get static field: static public TMPro.TMP_InputField/CharacterValidation Decimal
      static TMPro::TMP_InputField::CharacterValidation _get_Decimal();
      // Set static field: static public TMPro.TMP_InputField/CharacterValidation Decimal
      static void _set_Decimal(TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/CharacterValidation Alphanumeric
      static constexpr const int Alphanumeric = 4;
      // Get static field: static public TMPro.TMP_InputField/CharacterValidation Alphanumeric
      static TMPro::TMP_InputField::CharacterValidation _get_Alphanumeric();
      // Set static field: static public TMPro.TMP_InputField/CharacterValidation Alphanumeric
      static void _set_Alphanumeric(TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/CharacterValidation Name
      static constexpr const int Name = 5;
      // Get static field: static public TMPro.TMP_InputField/CharacterValidation Name
      static TMPro::TMP_InputField::CharacterValidation _get_Name();
      // Set static field: static public TMPro.TMP_InputField/CharacterValidation Name
      static void _set_Name(TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/CharacterValidation Regex
      static constexpr const int Regex = 6;
      // Get static field: static public TMPro.TMP_InputField/CharacterValidation Regex
      static TMPro::TMP_InputField::CharacterValidation _get_Regex();
      // Set static field: static public TMPro.TMP_InputField/CharacterValidation Regex
      static void _set_Regex(TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/CharacterValidation EmailAddress
      static constexpr const int EmailAddress = 7;
      // Get static field: static public TMPro.TMP_InputField/CharacterValidation EmailAddress
      static TMPro::TMP_InputField::CharacterValidation _get_EmailAddress();
      // Set static field: static public TMPro.TMP_InputField/CharacterValidation EmailAddress
      static void _set_EmailAddress(TMPro::TMP_InputField::CharacterValidation value);
      // static field const value: static public TMPro.TMP_InputField/CharacterValidation CustomValidator
      static constexpr const int CustomValidator = 8;
      // Get static field: static public TMPro.TMP_InputField/CharacterValidation CustomValidator
      static TMPro::TMP_InputField::CharacterValidation _get_CustomValidator();
      // Set static field: static public TMPro.TMP_InputField/CharacterValidation CustomValidator
      static void _set_CustomValidator(TMPro::TMP_InputField::CharacterValidation value);
    }; // TMPro.TMP_InputField/CharacterValidation
    // Autogenerated type: TMPro.TMP_InputField/LineType
    struct LineType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: LineType
      constexpr LineType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.TMP_InputField/LineType SingleLine
      static constexpr const int SingleLine = 0;
      // Get static field: static public TMPro.TMP_InputField/LineType SingleLine
      static TMPro::TMP_InputField::LineType _get_SingleLine();
      // Set static field: static public TMPro.TMP_InputField/LineType SingleLine
      static void _set_SingleLine(TMPro::TMP_InputField::LineType value);
      // static field const value: static public TMPro.TMP_InputField/LineType MultiLineSubmit
      static constexpr const int MultiLineSubmit = 1;
      // Get static field: static public TMPro.TMP_InputField/LineType MultiLineSubmit
      static TMPro::TMP_InputField::LineType _get_MultiLineSubmit();
      // Set static field: static public TMPro.TMP_InputField/LineType MultiLineSubmit
      static void _set_MultiLineSubmit(TMPro::TMP_InputField::LineType value);
      // static field const value: static public TMPro.TMP_InputField/LineType MultiLineNewline
      static constexpr const int MultiLineNewline = 2;
      // Get static field: static public TMPro.TMP_InputField/LineType MultiLineNewline
      static TMPro::TMP_InputField::LineType _get_MultiLineNewline();
      // Set static field: static public TMPro.TMP_InputField/LineType MultiLineNewline
      static void _set_MultiLineNewline(TMPro::TMP_InputField::LineType value);
    }; // TMPro.TMP_InputField/LineType
    // protected UnityEngine.TouchScreenKeyboard m_SoftKeyboard
    // Offset: 0xF0
    UnityEngine::TouchScreenKeyboard* m_SoftKeyboard;
    // protected UnityEngine.RectTransform m_TextViewport
    // Offset: 0xF8
    UnityEngine::RectTransform* m_TextViewport;
    // protected TMPro.TMP_Text m_TextComponent
    // Offset: 0x100
    TMPro::TMP_Text* m_TextComponent;
    // protected UnityEngine.RectTransform m_TextComponentRectTransform
    // Offset: 0x108
    UnityEngine::RectTransform* m_TextComponentRectTransform;
    // protected UnityEngine.UI.Graphic m_Placeholder
    // Offset: 0x110
    UnityEngine::UI::Graphic* m_Placeholder;
    // protected UnityEngine.UI.Scrollbar m_VerticalScrollbar
    // Offset: 0x118
    UnityEngine::UI::Scrollbar* m_VerticalScrollbar;
    // protected TMPro.TMP_ScrollbarEventHandler m_VerticalScrollbarEventHandler
    // Offset: 0x120
    TMPro::TMP_ScrollbarEventHandler* m_VerticalScrollbarEventHandler;
    // private System.Boolean m_IsDrivenByLayoutComponents
    // Offset: 0x128
    bool m_IsDrivenByLayoutComponents;
    // private System.Single m_ScrollPosition
    // Offset: 0x12C
    float m_ScrollPosition;
    // protected System.Single m_ScrollSensitivity
    // Offset: 0x130
    float m_ScrollSensitivity;
    // private TMPro.TMP_InputField/ContentType m_ContentType
    // Offset: 0x134
    TMPro::TMP_InputField::ContentType m_ContentType;
    // private TMPro.TMP_InputField/InputType m_InputType
    // Offset: 0x138
    TMPro::TMP_InputField::InputType m_InputType;
    // private System.Char m_AsteriskChar
    // Offset: 0x13C
    ::Il2CppChar m_AsteriskChar;
    // private UnityEngine.TouchScreenKeyboardType m_KeyboardType
    // Offset: 0x140
    UnityEngine::TouchScreenKeyboardType m_KeyboardType;
    // private TMPro.TMP_InputField/LineType m_LineType
    // Offset: 0x144
    TMPro::TMP_InputField::LineType m_LineType;
    // private System.Boolean m_HideMobileInput
    // Offset: 0x148
    bool m_HideMobileInput;
    // private System.Boolean m_HideSoftKeyboard
    // Offset: 0x149
    bool m_HideSoftKeyboard;
    // private TMPro.TMP_InputField/CharacterValidation m_CharacterValidation
    // Offset: 0x14C
    TMPro::TMP_InputField::CharacterValidation m_CharacterValidation;
    // private System.String m_RegexValue
    // Offset: 0x150
    ::Il2CppString* m_RegexValue;
    // private System.Single m_GlobalPointSize
    // Offset: 0x158
    float m_GlobalPointSize;
    // private System.Int32 m_CharacterLimit
    // Offset: 0x15C
    int m_CharacterLimit;
    // private TMPro.TMP_InputField/SubmitEvent m_OnEndEdit
    // Offset: 0x160
    TMPro::TMP_InputField::SubmitEvent* m_OnEndEdit;
    // private TMPro.TMP_InputField/SubmitEvent m_OnSubmit
    // Offset: 0x168
    TMPro::TMP_InputField::SubmitEvent* m_OnSubmit;
    // private TMPro.TMP_InputField/SelectionEvent m_OnSelect
    // Offset: 0x170
    TMPro::TMP_InputField::SelectionEvent* m_OnSelect;
    // private TMPro.TMP_InputField/SelectionEvent m_OnDeselect
    // Offset: 0x178
    TMPro::TMP_InputField::SelectionEvent* m_OnDeselect;
    // private TMPro.TMP_InputField/TextSelectionEvent m_OnTextSelection
    // Offset: 0x180
    TMPro::TMP_InputField::TextSelectionEvent* m_OnTextSelection;
    // private TMPro.TMP_InputField/TextSelectionEvent m_OnEndTextSelection
    // Offset: 0x188
    TMPro::TMP_InputField::TextSelectionEvent* m_OnEndTextSelection;
    // private TMPro.TMP_InputField/OnChangeEvent m_OnValueChanged
    // Offset: 0x190
    TMPro::TMP_InputField::OnChangeEvent* m_OnValueChanged;
    // private TMPro.TMP_InputField/TouchScreenKeyboardEvent m_OnTouchScreenKeyboardStatusChanged
    // Offset: 0x198
    TMPro::TMP_InputField::TouchScreenKeyboardEvent* m_OnTouchScreenKeyboardStatusChanged;
    // private TMPro.TMP_InputField/OnValidateInput m_OnValidateInput
    // Offset: 0x1A0
    TMPro::TMP_InputField::OnValidateInput* m_OnValidateInput;
    // private UnityEngine.Color m_CaretColor
    // Offset: 0x1A8
    UnityEngine::Color m_CaretColor;
    // private System.Boolean m_CustomCaretColor
    // Offset: 0x1B8
    bool m_CustomCaretColor;
    // private UnityEngine.Color m_SelectionColor
    // Offset: 0x1BC
    UnityEngine::Color m_SelectionColor;
    // protected System.String m_Text
    // Offset: 0x1D0
    ::Il2CppString* m_Text;
    // private System.Single m_CaretBlinkRate
    // Offset: 0x1D8
    float m_CaretBlinkRate;
    // private System.Int32 m_CaretWidth
    // Offset: 0x1DC
    int m_CaretWidth;
    // private System.Boolean m_ReadOnly
    // Offset: 0x1E0
    bool m_ReadOnly;
    // private System.Boolean m_RichText
    // Offset: 0x1E1
    bool m_RichText;
    // protected System.Int32 m_StringPosition
    // Offset: 0x1E4
    int m_StringPosition;
    // protected System.Int32 m_StringSelectPosition
    // Offset: 0x1E8
    int m_StringSelectPosition;
    // protected System.Int32 m_CaretPosition
    // Offset: 0x1EC
    int m_CaretPosition;
    // protected System.Int32 m_CaretSelectPosition
    // Offset: 0x1F0
    int m_CaretSelectPosition;
    // private UnityEngine.RectTransform caretRectTrans
    // Offset: 0x1F8
    UnityEngine::RectTransform* caretRectTrans;
    // protected UnityEngine.UIVertex[] m_CursorVerts
    // Offset: 0x200
    ::Array<UnityEngine::UIVertex>* m_CursorVerts;
    // private UnityEngine.CanvasRenderer m_CachedInputRenderer
    // Offset: 0x208
    UnityEngine::CanvasRenderer* m_CachedInputRenderer;
    // private UnityEngine.Vector2 m_LastPosition
    // Offset: 0x210
    UnityEngine::Vector2 m_LastPosition;
    // protected UnityEngine.Mesh m_Mesh
    // Offset: 0x218
    UnityEngine::Mesh* m_Mesh;
    // private System.Boolean m_AllowInput
    // Offset: 0x220
    bool m_AllowInput;
    // private System.Boolean m_ShouldActivateNextUpdate
    // Offset: 0x221
    bool m_ShouldActivateNextUpdate;
    // private System.Boolean m_UpdateDrag
    // Offset: 0x222
    bool m_UpdateDrag;
    // private System.Boolean m_DragPositionOutOfBounds
    // Offset: 0x223
    bool m_DragPositionOutOfBounds;
    // protected System.Boolean m_CaretVisible
    // Offset: 0x224
    bool m_CaretVisible;
    // private UnityEngine.Coroutine m_BlinkCoroutine
    // Offset: 0x228
    UnityEngine::Coroutine* m_BlinkCoroutine;
    // private System.Single m_BlinkStartTime
    // Offset: 0x230
    float m_BlinkStartTime;
    // private UnityEngine.Coroutine m_DragCoroutine
    // Offset: 0x238
    UnityEngine::Coroutine* m_DragCoroutine;
    // private System.String m_OriginalText
    // Offset: 0x240
    ::Il2CppString* m_OriginalText;
    // private System.Boolean m_WasCanceled
    // Offset: 0x248
    bool m_WasCanceled;
    // private System.Boolean m_HasDoneFocusTransition
    // Offset: 0x249
    bool m_HasDoneFocusTransition;
    // private UnityEngine.WaitForSecondsRealtime m_WaitForSecondsRealtime
    // Offset: 0x250
    UnityEngine::WaitForSecondsRealtime* m_WaitForSecondsRealtime;
    // private System.Boolean m_PreventCallback
    // Offset: 0x258
    bool m_PreventCallback;
    // private System.Boolean m_TouchKeyboardAllowsInPlaceEditing
    // Offset: 0x259
    bool m_TouchKeyboardAllowsInPlaceEditing;
    // private System.Boolean m_IsTextComponentUpdateRequired
    // Offset: 0x25A
    bool m_IsTextComponentUpdateRequired;
    // private System.Boolean m_IsScrollbarUpdateRequired
    // Offset: 0x25B
    bool m_IsScrollbarUpdateRequired;
    // private System.Boolean m_IsUpdatingScrollbarValues
    // Offset: 0x25C
    bool m_IsUpdatingScrollbarValues;
    // private System.Boolean m_isLastKeyBackspace
    // Offset: 0x25D
    bool m_isLastKeyBackspace;
    // private System.Single m_PointerDownClickStartTime
    // Offset: 0x260
    float m_PointerDownClickStartTime;
    // private System.Single m_KeyDownStartTime
    // Offset: 0x264
    float m_KeyDownStartTime;
    // private System.Single m_DoubleClickDelay
    // Offset: 0x268
    float m_DoubleClickDelay;
    // protected TMPro.TMP_FontAsset m_GlobalFontAsset
    // Offset: 0x270
    TMPro::TMP_FontAsset* m_GlobalFontAsset;
    // protected System.Boolean m_OnFocusSelectAll
    // Offset: 0x278
    bool m_OnFocusSelectAll;
    // protected System.Boolean m_isSelectAll
    // Offset: 0x279
    bool m_isSelectAll;
    // protected System.Boolean m_ResetOnDeActivation
    // Offset: 0x27A
    bool m_ResetOnDeActivation;
    // private System.Boolean m_SelectionStillActive
    // Offset: 0x27B
    bool m_SelectionStillActive;
    // private System.Boolean m_ReleaseSelection
    // Offset: 0x27C
    bool m_ReleaseSelection;
    // private UnityEngine.GameObject m_SelectedObject
    // Offset: 0x280
    UnityEngine::GameObject* m_SelectedObject;
    // private System.Boolean m_RestoreOriginalTextOnEscape
    // Offset: 0x288
    bool m_RestoreOriginalTextOnEscape;
    // protected System.Boolean m_isRichTextEditingAllowed
    // Offset: 0x289
    bool m_isRichTextEditingAllowed;
    // protected System.Int32 m_LineLimit
    // Offset: 0x28C
    int m_LineLimit;
    // protected TMPro.TMP_InputValidator m_InputValidator
    // Offset: 0x290
    TMPro::TMP_InputValidator* m_InputValidator;
    // private System.Boolean m_isSelected
    // Offset: 0x298
    bool m_isSelected;
    // private System.Boolean m_IsStringPositionDirty
    // Offset: 0x299
    bool m_IsStringPositionDirty;
    // private System.Boolean m_IsCaretPositionDirty
    // Offset: 0x29A
    bool m_IsCaretPositionDirty;
    // private System.Boolean m_forceRectTransformAdjustment
    // Offset: 0x29B
    bool m_forceRectTransformAdjustment;
    // private UnityEngine.Event m_ProcessingEvent
    // Offset: 0x2A0
    UnityEngine::Event* m_ProcessingEvent;
    // Get static field: static private readonly System.Char[] kSeparators
    static ::Array<::Il2CppChar>* _get_kSeparators();
    // Set static field: static private readonly System.Char[] kSeparators
    static void _set_kSeparators(::Array<::Il2CppChar>* value);
    // static field const value: static private System.Single kHScrollSpeed
    static constexpr const float kHScrollSpeed = 0.05;
    // Get static field: static private System.Single kHScrollSpeed
    static float _get_kHScrollSpeed();
    // Set static field: static private System.Single kHScrollSpeed
    static void _set_kHScrollSpeed(float value);
    // static field const value: static private System.Single kVScrollSpeed
    static constexpr const float kVScrollSpeed = 0.1;
    // Get static field: static private System.Single kVScrollSpeed
    static float _get_kVScrollSpeed();
    // Set static field: static private System.Single kVScrollSpeed
