// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: TMPro.FontStyles
#include "TMPro/FontStyles.hpp"
// Including type: TMPro.TMP_LineInfo
#include "TMPro/TMP_LineInfo.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
// Including type: TMPro.TMP_FontStyleStack
#include "TMPro/TMP_FontStyleStack.hpp"
// Including type: TMPro.TMP_RichTextTagStack`1
#include "TMPro/TMP_RichTextTagStack_1.hpp"
// Including type: TMPro.FontWeight
#include "TMPro/FontWeight.hpp"
// Including type: TMPro.MaterialReference
#include "TMPro/MaterialReference.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_TextInfo
  class TMP_TextInfo;
  // Forward declaring type: TMP_ColorGradient
  class TMP_ColorGradient;
  // Forward declaring type: TMP_FontAsset
  class TMP_FontAsset;
  // Forward declaring type: TMP_SpriteAsset
  class TMP_SpriteAsset;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: TMPro.WordWrapState
  // [TokenAttribute] Offset: FFFFFFFF
  struct WordWrapState/*, public System::ValueType*/ {
    public:
    // public System.Int32 previous_WordBreak
    // Size: 0x4
    // Offset: 0x0
    int previous_WordBreak;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 total_CharacterCount
    // Size: 0x4
    // Offset: 0x4
    int total_CharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 visible_CharacterCount
    // Size: 0x4
    // Offset: 0x8
    int visible_CharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 visible_SpriteCount
    // Size: 0x4
    // Offset: 0xC
    int visible_SpriteCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 visible_LinkCount
    // Size: 0x4
    // Offset: 0x10
    int visible_LinkCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 firstCharacterIndex
    // Size: 0x4
    // Offset: 0x14
    int firstCharacterIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 firstVisibleCharacterIndex
    // Size: 0x4
    // Offset: 0x18
    int firstVisibleCharacterIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 lastCharacterIndex
    // Size: 0x4
    // Offset: 0x1C
    int lastCharacterIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 lastVisibleCharIndex
    // Size: 0x4
    // Offset: 0x20
    int lastVisibleCharIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 lineNumber
    // Size: 0x4
    // Offset: 0x24
    int lineNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single maxCapHeight
    // Size: 0x4
    // Offset: 0x28
    float maxCapHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxAscender
    // Size: 0x4
    // Offset: 0x2C
    float maxAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxDescender
    // Size: 0x4
    // Offset: 0x30
    float maxDescender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxLineAscender
    // Size: 0x4
    // Offset: 0x34
    float maxLineAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxLineDescender
    // Size: 0x4
    // Offset: 0x38
    float maxLineDescender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single previousLineAscender
    // Size: 0x4
    // Offset: 0x3C
    float previousLineAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single xAdvance
    // Size: 0x4
    // Offset: 0x40
    float xAdvance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single preferredWidth
    // Size: 0x4
    // Offset: 0x44
    float preferredWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single preferredHeight
    // Size: 0x4
    // Offset: 0x48
    float preferredHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single previousLineScale
    // Size: 0x4
    // Offset: 0x4C
    float previousLineScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 wordCount
    // Size: 0x4
    // Offset: 0x50
    int wordCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public TMPro.FontStyles fontStyle
    // Size: 0x4
    // Offset: 0x54
    TMPro::FontStyles fontStyle;
    // Field size check
    static_assert(sizeof(TMPro::FontStyles) == 0x4);
    // public System.Single fontScale
    // Size: 0x4
    // Offset: 0x58
    float fontScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single fontScaleMultiplier
    // Size: 0x4
    // Offset: 0x5C
    float fontScaleMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single currentFontSize
    // Size: 0x4
    // Offset: 0x60
    float currentFontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single baselineOffset
    // Size: 0x4
    // Offset: 0x64
    float baselineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lineOffset
    // Size: 0x4
    // Offset: 0x68
    float lineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public TMPro.TMP_TextInfo textInfo
    // Size: 0x8
    // Offset: 0x70
    TMPro::TMP_TextInfo* textInfo;
    // Field size check
    static_assert(sizeof(TMPro::TMP_TextInfo*) == 0x8);
    // public TMPro.TMP_LineInfo lineInfo
    // Size: 0x5C
    // Offset: 0x78
    TMPro::TMP_LineInfo lineInfo;
    // Field size check
    static_assert(sizeof(TMPro::TMP_LineInfo) == 0x5C);
    // public UnityEngine.Color32 vertexColor
    // Size: 0x4
    // Offset: 0xD4
    UnityEngine::Color32 vertexColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color32) == 0x4);
    // public UnityEngine.Color32 underlineColor
    // Size: 0x4
    // Offset: 0xD8
    UnityEngine::Color32 underlineColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color32) == 0x4);
    // public UnityEngine.Color32 strikethroughColor
    // Size: 0x4
    // Offset: 0xDC
    UnityEngine::Color32 strikethroughColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color32) == 0x4);
    // public UnityEngine.Color32 highlightColor
    // Size: 0x4
    // Offset: 0xE0
    UnityEngine::Color32 highlightColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color32) == 0x4);
    // public TMPro.TMP_FontStyleStack basicStyleStack
    // Size: 0xA
    // Offset: 0xE4
    TMPro::TMP_FontStyleStack basicStyleStack;
    // Field size check
    static_assert(sizeof(TMPro::TMP_FontStyleStack) == 0xA);
    // public TMPro.TMP_RichTextTagStack`1<UnityEngine.Color32> colorStack
    // Size: 0xFFFFFFFF
    // Offset: 0xF0
    TMPro::TMP_RichTextTagStack_1<UnityEngine::Color32> colorStack;
    // public TMPro.TMP_RichTextTagStack`1<UnityEngine.Color32> underlineColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x108
    TMPro::TMP_RichTextTagStack_1<UnityEngine::Color32> underlineColorStack;
    // public TMPro.TMP_RichTextTagStack`1<UnityEngine.Color32> strikethroughColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x120
    TMPro::TMP_RichTextTagStack_1<UnityEngine::Color32> strikethroughColorStack;
    // public TMPro.TMP_RichTextTagStack`1<UnityEngine.Color32> highlightColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x138
    TMPro::TMP_RichTextTagStack_1<UnityEngine::Color32> highlightColorStack;
    // public TMPro.TMP_RichTextTagStack`1<TMPro.TMP_ColorGradient> colorGradientStack
    // Size: 0xFFFFFFFF
    // Offset: 0x150
    TMPro::TMP_RichTextTagStack_1<TMPro::TMP_ColorGradient*> colorGradientStack;
    // public TMPro.TMP_RichTextTagStack`1<System.Single> sizeStack
    // Size: 0xFFFFFFFF
    // Offset: 0x168
    TMPro::TMP_RichTextTagStack_1<float> sizeStack;
    // public TMPro.TMP_RichTextTagStack`1<System.Single> indentStack
    // Size: 0xFFFFFFFF
    // Offset: 0x180
    TMPro::TMP_RichTextTagStack_1<float> indentStack;
    // public TMPro.TMP_RichTextTagStack`1<TMPro.FontWeight> fontWeightStack
    // Size: 0xFFFFFFFF
    // Offset: 0x198
    TMPro::TMP_RichTextTagStack_1<TMPro::FontWeight> fontWeightStack;
    // public TMPro.TMP_RichTextTagStack`1<System.Int32> styleStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1B0
    TMPro::TMP_RichTextTagStack_1<int> styleStack;
    // public TMPro.TMP_RichTextTagStack`1<System.Single> baselineStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1C8
    TMPro::TMP_RichTextTagStack_1<float> baselineStack;
    // public TMPro.TMP_RichTextTagStack`1<System.Int32> actionStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1E0
    TMPro::TMP_RichTextTagStack_1<int> actionStack;
    // public TMPro.TMP_RichTextTagStack`1<TMPro.MaterialReference> materialReferenceStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1F8
    TMPro::TMP_RichTextTagStack_1<TMPro::MaterialReference> materialReferenceStack;
    // public TMPro.TMP_RichTextTagStack`1<TMPro.TextAlignmentOptions> lineJustificationStack
    // Size: 0xFFFFFFFF
    // Offset: 0x240
    TMPro::TMP_RichTextTagStack_1<TMPro::TextAlignmentOptions> lineJustificationStack;
    // public System.Int32 spriteAnimationID
    // Size: 0x4
    // Offset: 0x258
    int spriteAnimationID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public TMPro.TMP_FontAsset currentFontAsset
    // Size: 0x8
    // Offset: 0x260
    TMPro::TMP_FontAsset* currentFontAsset;
    // Field size check
    static_assert(sizeof(TMPro::TMP_FontAsset*) == 0x8);
    // public TMPro.TMP_SpriteAsset currentSpriteAsset
    // Size: 0x8
    // Offset: 0x268
    TMPro::TMP_SpriteAsset* currentSpriteAsset;
    // Field size check
    static_assert(sizeof(TMPro::TMP_SpriteAsset*) == 0x8);
    // public UnityEngine.Material currentMaterial
    // Size: 0x8
    // Offset: 0x270
    UnityEngine::Material* currentMaterial;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // public System.Int32 currentMaterialIndex
    // Size: 0x4
    // Offset: 0x278
    int currentMaterialIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public TMPro.Extents meshExtents
    // Size: 0x10
    // Offset: 0x27C
    TMPro::Extents meshExtents;
    // Field size check
    static_assert(sizeof(TMPro::Extents) == 0x10);
    // public System.Boolean tagNoParsing
    // Size: 0x1
    // Offset: 0x28C
    bool tagNoParsing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isNonBreakingSpace
    // Size: 0x1
    // Offset: 0x28D
    bool isNonBreakingSpace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: WordWrapState
