// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Newtonsoft.Json.JsonReader
#include "Newtonsoft/Json/JsonReader.hpp"
// Including type: Newtonsoft.Json.Bson.BsonType
#include "Newtonsoft/Json/Bson/BsonType.hpp"
// Including type: System.DateTimeKind
#include "System/DateTimeKind.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Newtonsoft::Json::Bson
namespace Newtonsoft::Json::Bson {
  // Forward declaring type: BsonBinaryType
  struct BsonBinaryType;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryReader
  class BinaryReader;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Newtonsoft.Json.Bson
namespace Newtonsoft::Json::Bson {
  // Forward declaring type: BsonReader
  class BsonReader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Newtonsoft::Json::Bson::BsonReader);
DEFINE_IL2CPP_ARG_TYPE(::Newtonsoft::Json::Bson::BsonReader*, "Newtonsoft.Json.Bson", "BsonReader");
// Type namespace: Newtonsoft.Json.Bson
namespace Newtonsoft::Json::Bson {
  // WARNING Size may be invalid!
  // Autogenerated type: Newtonsoft.Json.Bson.BsonReader
  // [TokenAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: FFFFFFFF
  class BsonReader : public ::Newtonsoft::Json::JsonReader {
    public:
    // Nested type: ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState
    struct BsonReaderState;
    // Nested type: ::Newtonsoft::Json::Bson::BsonReader::ContainerContext
    class ContainerContext;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState
    // [TokenAttribute] Offset: FFFFFFFF
    struct BsonReaderState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BsonReaderState
      constexpr BsonReaderState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState Normal
      static constexpr const int Normal = 0;
      // Get static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState Normal
      static ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState _get_Normal();
      // Set static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState Normal
      static void _set_Normal(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState value);
      // static field const value: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState ReferenceStart
      static constexpr const int ReferenceStart = 1;
      // Get static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState ReferenceStart
      static ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState _get_ReferenceStart();
      // Set static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState ReferenceStart
      static void _set_ReferenceStart(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState value);
      // static field const value: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState ReferenceRef
      static constexpr const int ReferenceRef = 2;
      // Get static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState ReferenceRef
      static ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState _get_ReferenceRef();
      // Set static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState ReferenceRef
      static void _set_ReferenceRef(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState value);
      // static field const value: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState ReferenceId
      static constexpr const int ReferenceId = 3;
      // Get static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState ReferenceId
      static ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState _get_ReferenceId();
      // Set static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState ReferenceId
      static void _set_ReferenceId(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState value);
      // static field const value: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeStart
      static constexpr const int CodeWScopeStart = 4;
      // Get static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeStart
      static ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState _get_CodeWScopeStart();
      // Set static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeStart
      static void _set_CodeWScopeStart(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState value);
      // static field const value: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeCode
      static constexpr const int CodeWScopeCode = 5;
      // Get static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeCode
      static ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState _get_CodeWScopeCode();
      // Set static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeCode
      static void _set_CodeWScopeCode(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState value);
      // static field const value: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeScope
      static constexpr const int CodeWScopeScope = 6;
      // Get static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeScope
      static ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState _get_CodeWScopeScope();
      // Set static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeScope
      static void _set_CodeWScopeScope(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState value);
      // static field const value: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeScopeObject
      static constexpr const int CodeWScopeScopeObject = 7;
      // Get static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeScopeObject
      static ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState _get_CodeWScopeScopeObject();
      // Set static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeScopeObject
      static void _set_CodeWScopeScopeObject(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState value);
      // static field const value: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeScopeEnd
      static constexpr const int CodeWScopeScopeEnd = 8;
      // Get static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeScopeEnd
      static ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState _get_CodeWScopeScopeEnd();
      // Set static field: static public Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState CodeWScopeScopeEnd
      static void _set_CodeWScopeScopeEnd(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState
    #pragma pack(pop)
    static check_size<sizeof(BsonReader::BsonReaderState), 0 + sizeof(int)> __Newtonsoft_Json_Bson_BsonReader_BsonReaderStateSizeCheck;
    static_assert(sizeof(BsonReader::BsonReaderState) == 0x4);
    public:
    // private readonly System.IO.BinaryReader _reader
    // Size: 0x8
    // Offset: 0x78
    ::System::IO::BinaryReader* reader;
    // Field size check
    static_assert(sizeof(::System::IO::BinaryReader*) == 0x8);
    // private readonly System.Collections.Generic.List`1<Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.ContainerContext> _stack
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::Newtonsoft::Json::Bson::BsonReader::ContainerContext*>* stack;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Newtonsoft::Json::Bson::BsonReader::ContainerContext*>*) == 0x8);
    // private System.Byte[] _byteBuffer
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<uint8_t> byteBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Char[] _charBuffer
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::Il2CppChar> charBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
    // private Newtonsoft.Json.Bson.BsonType _currentElementType
    // Size: 0x1
    // Offset: 0x98
    ::Newtonsoft::Json::Bson::BsonType currentElementType;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Bson::BsonType) == 0x1);
    // private Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.BsonReaderState _bsonReaderState
    // Size: 0x4
    // Offset: 0x9C
    ::Newtonsoft::Json::Bson::BsonReader::BsonReaderState bsonReaderState;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Bson::BsonReader::BsonReaderState) == 0x4);
    // private Newtonsoft.Json.Bson.BsonReader/Newtonsoft.Json.Bson.ContainerContext _currentContext
    // Size: 0x8
    // Offset: 0xA0
    ::Newtonsoft::Json::Bson::BsonReader::ContainerContext* currentContext;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Bson::BsonReader::ContainerContext*) == 0x8);
    // private System.Boolean _readRootValueAsArray
    // Size: 0x1
    // Offset: 0xA8
    bool readRootValueAsArray;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _jsonNet35BinaryCompatibility
    // Size: 0x1
    // Offset: 0xA9
    bool jsonNet35BinaryCompatibility;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.DateTimeKind _dateTimeKindHandling
    // Size: 0x4
    // Offset: 0xAC
    ::System::DateTimeKind dateTimeKindHandling;
    // Field size check
    static_assert(sizeof(::System::DateTimeKind) == 0x4);
    public:
    // Get static field: static private readonly System.Byte[] SeqRange1
    static ::ArrayW<uint8_t> _get_SeqRange1();
    // Set static field: static private readonly System.Byte[] SeqRange1
    static void _set_SeqRange1(::ArrayW<uint8_t> value);
    // Get static field: static private readonly System.Byte[] SeqRange2
    static ::ArrayW<uint8_t> _get_SeqRange2();
    // Set static field: static private readonly System.Byte[] SeqRange2
    static void _set_SeqRange2(::ArrayW<uint8_t> value);
    // Get static field: static private readonly System.Byte[] SeqRange3
    static ::ArrayW<uint8_t> _get_SeqRange3();
    // Set static field: static private readonly System.Byte[] SeqRange3
    static void _set_SeqRange3(::ArrayW<uint8_t> value);
    // Get static field: static private readonly System.Byte[] SeqRange4
    static ::ArrayW<uint8_t> _get_SeqRange4();
