// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Including type: Oculus.Platform.Message
#include "Oculus/Platform/Message.hpp"
// Including type: Oculus.Platform.KeyValuePairType
#include "Oculus/Platform/KeyValuePairType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: LaunchResult
  struct LaunchResult;
  // Forward declaring type: VoipMuteState
  struct VoipMuteState;
  // Forward declaring type: SendPolicy

  // Forward declaring type: PermissionType
  struct PermissionType;
  // Forward declaring type: AchievementType
  struct AchievementType;
  // Forward declaring type: ChallengeCreationType
  struct ChallengeCreationType;
  // Forward declaring type: ChallengeVisibility
  struct ChallengeVisibility;
  // Forward declaring type: CloudStorageDataStatus
  struct CloudStorageDataStatus;
  // Forward declaring type: CloudStorageUpdateStatus
  struct CloudStorageUpdateStatus;
  // Forward declaring type: LaunchType
  struct LaunchType;
  // Forward declaring type: ServiceProvider
  struct ServiceProvider;
  // Forward declaring type: LivestreamingStartStatus
  struct LivestreamingStartStatus;
  // Forward declaring type: NetSyncDisconnectReason
  struct NetSyncDisconnectReason;
  // Forward declaring type: NetSyncConnectionStatus
  struct NetSyncConnectionStatus;
  // Forward declaring type: PeerConnectionState
  struct PeerConnectionState;
  // Forward declaring type: PartyUpdateAction
  struct PartyUpdateAction;
  // Forward declaring type: PlatformInitializeResult
  struct PlatformInitializeResult;
  // Forward declaring type: RoomJoinability
  struct RoomJoinability;
  // Forward declaring type: RoomType
  struct RoomType;
  // Forward declaring type: SdkAccountType
  struct SdkAccountType;
  // Forward declaring type: ShareMediaStatus
  struct ShareMediaStatus;
  // Forward declaring type: PermissionGrantStatus
  struct PermissionGrantStatus;
  // Forward declaring type: UserPresenceStatus
  struct UserPresenceStatus;
  // Forward declaring type: AbuseReportType
  struct AbuseReportType;
  // Forward declaring type: AbuseReportVideoMode
  struct AbuseReportVideoMode;
  // Forward declaring type: ChallengeViewerFilter
  struct ChallengeViewerFilter;
  // Forward declaring type: RichPresenceExtraContext
  struct RichPresenceExtraContext;
  // Forward declaring type: UserOrdering
  struct UserOrdering;
  // Forward declaring type: TimeWindow
  struct TimeWindow;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Array
  class Array;
  // Forward declaring type: DateTime
  struct DateTime;
  // Forward declaring type: UIntPtr
  struct UIntPtr;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: UTF8Encoding
  class UTF8Encoding;
}
// Completed forward declares
// Type namespace: Oculus.Platform
namespace Oculus::Platform {
  // Forward declaring type: CAPI
  class CAPI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Platform::CAPI);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Platform::CAPI*, "Oculus.Platform", "CAPI");
// Type namespace: Oculus.Platform
namespace Oculus::Platform {
  // Size: 0x10
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Platform.CAPI
  // [TokenAttribute] Offset: FFFFFFFF
  class CAPI : public ::Il2CppObject {
    public:
    // Nested type: ::Oculus::Platform::CAPI::ovrKeyValuePair
    struct ovrKeyValuePair;
    // Nested type: ::Oculus::Platform::CAPI::ovrNetSyncVec3
    struct ovrNetSyncVec3;
    // Nested type: ::Oculus::Platform::CAPI::ovrMatchmakingCriterion
    struct ovrMatchmakingCriterion;
    // Nested type: ::Oculus::Platform::CAPI::ovrMatchmakingCustomQueryData
    struct ovrMatchmakingCustomQueryData;
    // Nested type: ::Oculus::Platform::CAPI::OculusInitParams
    struct OculusInitParams;
    // Nested type: ::Oculus::Platform::CAPI::FilterCallback
    class FilterCallback;
    // Size: 0x28
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Oculus.Platform.CAPI/Oculus.Platform.ovrKeyValuePair
    // [TokenAttribute] Offset: FFFFFFFF
    struct ovrKeyValuePair/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String key_
      // Size: 0x8
      // Offset: 0x0
      ::StringW key;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // private Oculus.Platform.KeyValuePairType valueType_
      // Size: 0x4
      // Offset: 0x8
      ::Oculus::Platform::KeyValuePairType valueType;
      // Field size check
      static_assert(sizeof(::Oculus::Platform::KeyValuePairType) == 0x4);
      // Padding between fields: valueType and: stringValue
      char __padding1[0x4] = {};
      // public System.String stringValue_
      // Size: 0x8
      // Offset: 0x10
      ::StringW stringValue;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Int32 intValue_
      // Size: 0x4
      // Offset: 0x18
      int intValue;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: intValue and: doubleValue
      char __padding3[0x4] = {};
      // public System.Double doubleValue_
      // Size: 0x8
      // Offset: 0x20
      double doubleValue;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      public:
      // Creating value type constructor for type: ovrKeyValuePair
      constexpr ovrKeyValuePair(::StringW key_ = {}, ::Oculus::Platform::KeyValuePairType valueType_ = {}, ::StringW stringValue_ = {}, int intValue_ = {}, double doubleValue_ = {}) noexcept : key{key_}, valueType{valueType_}, stringValue{stringValue_}, intValue{intValue_}, doubleValue{doubleValue_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.String key_
      [[deprecated("Use field access instead!")]] ::StringW& dyn_key_();
      // Get instance field reference: private Oculus.Platform.KeyValuePairType valueType_
      [[deprecated("Use field access instead!")]] ::Oculus::Platform::KeyValuePairType& dyn_valueType_();
      // Get instance field reference: public System.String stringValue_
      [[deprecated("Use field access instead!")]] ::StringW& dyn_stringValue_();
      // Get instance field reference: public System.Int32 intValue_
      [[deprecated("Use field access instead!")]] int& dyn_intValue_();
      // Get instance field reference: public System.Double doubleValue_
      [[deprecated("Use field access instead!")]] double& dyn_doubleValue_();
      // public System.Void .ctor(System.String key, System.String value)
      // Offset: 0x19D6924
      ovrKeyValuePair(::StringW key, ::StringW value);
      // public System.Void .ctor(System.String key, System.Int32 value)
      // Offset: 0x19D693C
      ovrKeyValuePair(::StringW key, int value);
      // public System.Void .ctor(System.String key, System.Double value)
      // Offset: 0x19D6958
      ovrKeyValuePair(::StringW key, double value);
    }; // Oculus.Platform.CAPI/Oculus.Platform.ovrKeyValuePair
    #pragma pack(pop)
    static check_size<sizeof(CAPI::ovrKeyValuePair), 32 + sizeof(double)> __Oculus_Platform_CAPI_ovrKeyValuePairSizeCheck;
    static_assert(sizeof(CAPI::ovrKeyValuePair) == 0x28);
    // static field const value: static public System.String DLL_NAME
    static constexpr const char* DLL_NAME = "ovrplatformloader";
    // Get static field: static public System.String DLL_NAME
    static ::StringW _get_DLL_NAME();
    // Set static field: static public System.String DLL_NAME
    static void _set_DLL_NAME(::StringW value);
    // Get static field: static private System.Text.UTF8Encoding nativeStringEncoding
    static ::System::Text::UTF8Encoding* _get_nativeStringEncoding();
    // Set static field: static private System.Text.UTF8Encoding nativeStringEncoding
    static void _set_nativeStringEncoding(::System::Text::UTF8Encoding* value);
    // static field const value: static public System.Int32 VoipFilterBufferSize
    static constexpr const int VoipFilterBufferSize = 480;
    // Get static field: static public System.Int32 VoipFilterBufferSize
    static int _get_VoipFilterBufferSize();
