// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Including type: Oculus.Platform.Message
#include "Oculus/Platform/Message.hpp"
// Including type: Oculus.Platform.KeyValuePairType
#include "Oculus/Platform/KeyValuePairType.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: LaunchResult
  struct LaunchResult;
  // Forward declaring type: VoipMuteState
  struct VoipMuteState;
  // Forward declaring type: SendPolicy
  struct SendPolicy;
  // Forward declaring type: SystemVoipStatus
  struct SystemVoipStatus;
  // Forward declaring type: VoipDtxState

  struct MediaContentType;
  // Forward declaring type: NetSyncVoipMicSource
  struct NetSyncVoipMicSource;
  // Forward declaring type: NetSyncVoipStreamMode
  struct NetSyncVoipStreamMode;
  // Forward declaring type: RoomJoinPolicy
  struct RoomJoinPolicy;
  // Forward declaring type: RoomMembershipLockStatus
  struct RoomMembershipLockStatus;
  // Forward declaring type: PermissionType
  struct PermissionType;
  // Forward declaring type: AchievementType
  struct AchievementType;
  // Forward declaring type: ChallengeCreationType
  struct ChallengeCreationType;
  // Forward declaring type: ChallengeVisibility
  struct ChallengeVisibility;
  // Forward declaring type: CloudStorageDataStatus
  struct CloudStorageDataStatus;
  // Forward declaring type: CloudStorageUpdateStatus
  struct CloudStorageUpdateStatus;
  // Forward declaring type: LaunchType
  struct LaunchType;
  // Forward declaring type: ServiceProvider
  struct ServiceProvider;
  // Forward declaring type: LivestreamingStartStatus
  struct LivestreamingStartStatus;
  // Forward declaring type: NetSyncDisconnectReason
  struct NetSyncDisconnectReason;
  // Forward declaring type: NetSyncConnectionStatus
  struct NetSyncConnectionStatus;
  // Forward declaring type: PeerConnectionState
  struct PeerConnectionState;
  // Forward declaring type: PartyUpdateAction
  struct PartyUpdateAction;
  // Forward declaring type: PlatformInitializeResult
  struct PlatformInitializeResult;
  // Forward declaring type: RoomJoinability
  struct RoomJoinability;
  // Forward declaring type: RoomType
  struct RoomType;
  // Forward declaring type: SdkAccountType
  struct SdkAccountType;
  // Forward declaring type: ShareMediaStatus
  struct ShareMediaStatus;
  // Forward declaring type: PermissionGrantStatus
  struct PermissionGrantStatus;
  // Forward declaring type: UserPresenceStatus
  struct UserPresenceStatus;
  // Forward declaring type: AbuseReportType
  struct AbuseReportType;
  // Forward declaring type: AbuseReportVideoMode
  struct AbuseReportVideoMode;
  // Forward declaring type: ChallengeViewerFilter
  struct ChallengeViewerFilter;
  // Forward declaring type: RichPresenceExtraContext
  struct RichPresenceExtraContext;
  // Forward declaring type: UserOrdering
  struct UserOrdering;
  // Forward declaring type: TimeWindow
  struct TimeWindow;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Array
  class Array;
  // Forward declaring type: DateTime
  struct DateTime;
  // Forward declaring type: UIntPtr
  struct UIntPtr;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: UTF8Encoding
  class UTF8Encoding;
}
// Completed forward declares
// Type namespace: Oculus.Platform
namespace Oculus::Platform {
  // Size: 0x10
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Platform.CAPI
  class CAPI : public ::Il2CppObject {
    public:
    // Nested type: Oculus::Platform::CAPI::ovrKeyValuePair
    struct ovrKeyValuePair;
    // Nested type: Oculus::Platform::CAPI::ovrNetSyncVec3
    struct ovrNetSyncVec3;
    // Nested type: Oculus::Platform::CAPI::ovrMatchmakingCriterion
    struct ovrMatchmakingCriterion;
    // Nested type: Oculus::Platform::CAPI::ovrMatchmakingCustomQueryData
    struct ovrMatchmakingCustomQueryData;
    // Nested type: Oculus::Platform::CAPI::OculusInitParams
    struct OculusInitParams;
    // Nested type: Oculus::Platform::CAPI::FilterCallback
    class FilterCallback;
    // Size: 0x28
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Oculus.Platform.CAPI/ovrKeyValuePair
    struct ovrKeyValuePair/*, public System::ValueType*/ {
      public:
      // public System.String key_
      // Size: 0x8
      // Offset: 0x0
      ::Il2CppString* key;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // private Oculus.Platform.KeyValuePairType valueType_
      // Size: 0x4
      // Offset: 0x8
      Oculus::Platform::KeyValuePairType valueType;
      // Field size check
      static_assert(sizeof(Oculus::Platform::KeyValuePairType) == 0x4);
      // Padding between fields: valueType and: stringValue
      char __padding1[0x4] = {};
      // public System.String stringValue_
      // Size: 0x8
      // Offset: 0x10
      ::Il2CppString* stringValue;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // public System.Int32 intValue_
      // Size: 0x4
      // Offset: 0x18
      int intValue;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: intValue and: doubleValue
      char __padding3[0x4] = {};
      // public System.Double doubleValue_
      // Size: 0x8
      // Offset: 0x20
      double doubleValue;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      // Creating value type constructor for type: ovrKeyValuePair
      constexpr ovrKeyValuePair(::Il2CppString* key_ = {}, Oculus::Platform::KeyValuePairType valueType_ = {}, ::Il2CppString* stringValue_ = {}, int intValue_ = {}, double doubleValue_ = {}) noexcept : key{key_}, valueType{valueType_}, stringValue{stringValue_}, intValue{intValue_}, doubleValue{doubleValue_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
      // public System.Void .ctor(System.String key, System.String value)
      // Offset: 0xEF02CC
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      ovrKeyValuePair(::Il2CppString* key, ::Il2CppString* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Oculus::Platform::CAPI::ovrKeyValuePair::.ctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(key), ::il2cpp_utils::ExtractType(value)})));
        ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, key, value);
      }
      // public System.Void .ctor(System.String key, System.Int32 value)
      // Offset: 0xEF02E4
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      ovrKeyValuePair(::Il2CppString* key, int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Oculus::Platform::CAPI::ovrKeyValuePair::.ctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(key), ::il2cpp_utils::ExtractType(value)})));
        ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, key, value);
      }
      // public System.Void .ctor(System.String key, System.Double value)
      // Offset: 0xEF0300
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      ovrKeyValuePair(::Il2CppString* key, double value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Oculus::Platform::CAPI::ovrKeyValuePair::.ctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(key), ::il2cpp_utils::ExtractType(value)})));
        ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, key, value);
      }
    }; // Oculus.Platform.CAPI/ovrKeyValuePair
    #pragma pack(pop)
    static check_size<sizeof(CAPI::ovrKeyValuePair), 32 + sizeof(double)> __Oculus_Platform_CAPI_ovrKeyValuePairSizeCheck;
    static_assert(sizeof(CAPI::ovrKeyValuePair) == 0x28);
    // Creating value type constructor for type: CAPI
    CAPI() noexcept {}
    // static field const value: static public System.String DLL_NAME
    static constexpr const char* DLL_NAME = "ovrplatformloader";
    // Get static field: static public System.String DLL_NAME
    static ::Il2CppString* _get_DLL_NAME();
    // Set static field: static public System.String DLL_NAME
    static void _set_DLL_NAME(::Il2CppString* value);
    // Get static field: static private System.Text.UTF8Encoding nativeStringEncoding
    static System::Text::UTF8Encoding* _get_nativeStringEncoding();
    // Set static field: static private System.Text.UTF8Encoding nativeStringEncoding
    static void _set_nativeStringEncoding(System::Text::UTF8Encoding* value);
    // static field const value: static public System.Int32 VoipFilterBufferSize
    static constexpr const int VoipFilterBufferSize = 480;
