// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.VisualElement
#include "UnityEngine/UIElements/VisualElement.hpp"
// Including type: UnityEngine.GUILayoutUtility
#include "UnityEngine/GUILayoutUtility.hpp"
// Including type: UnityEngine.UIElements.ContextType
#include "UnityEngine/UIElements/ContextType.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Event
  class Event;
  // Forward declaring type: ObjectGUIState
  class ObjectGUIState;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: FocusChangeDirection
  class FocusChangeDirection;
  // Forward declaring type: EventBase
  class EventBase;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: IMGUIContainer
  class IMGUIContainer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::IMGUIContainer);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::IMGUIContainer*, "UnityEngine.UIElements", "IMGUIContainer");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x26C
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.IMGUIContainer
  // [TokenAttribute] Offset: FFFFFFFF
  class IMGUIContainer : public ::UnityEngine::UIElements::VisualElement {
    public:
    // Nested type: ::UnityEngine::UIElements::IMGUIContainer::GUIGlobals
    struct GUIGlobals;
    // Size: 0x78
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.IMGUIContainer/UnityEngine.UIElements.GUIGlobals
    // [TokenAttribute] Offset: FFFFFFFF
    struct GUIGlobals/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Matrix4x4 matrix
      // Size: 0x40
      // Offset: 0x0
      ::UnityEngine::Matrix4x4 matrix;
      // Field size check
      static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
      // public UnityEngine.Color color
      // Size: 0x10
      // Offset: 0x40
      ::UnityEngine::Color color;
      // Field size check
      static_assert(sizeof(::UnityEngine::Color) == 0x10);
      // public UnityEngine.Color contentColor
      // Size: 0x10
      // Offset: 0x50
      ::UnityEngine::Color contentColor;
      // Field size check
      static_assert(sizeof(::UnityEngine::Color) == 0x10);
      // public UnityEngine.Color backgroundColor
      // Size: 0x10
      // Offset: 0x60
      ::UnityEngine::Color backgroundColor;
      // Field size check
      static_assert(sizeof(::UnityEngine::Color) == 0x10);
      // public System.Boolean enabled
      // Size: 0x1
      // Offset: 0x70
      bool enabled;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean changed
      // Size: 0x1
      // Offset: 0x71
      bool changed;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: changed and: displayIndex
      char __padding5[0x2] = {};
      // public System.Int32 displayIndex
      // Size: 0x4
      // Offset: 0x74
      int displayIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GUIGlobals
      constexpr GUIGlobals(::UnityEngine::Matrix4x4 matrix_ = {}, ::UnityEngine::Color color_ = {}, ::UnityEngine::Color contentColor_ = {}, ::UnityEngine::Color backgroundColor_ = {}, bool enabled_ = {}, bool changed_ = {}, int displayIndex_ = {}) noexcept : matrix{matrix_}, color{color_}, contentColor{contentColor_}, backgroundColor{backgroundColor_}, enabled{enabled_}, changed{changed_}, displayIndex{displayIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Matrix4x4 matrix
      [[deprecated("Use field access instead!")]] ::UnityEngine::Matrix4x4& dyn_matrix();
      // Get instance field reference: public UnityEngine.Color color
      [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_color();
      // Get instance field reference: public UnityEngine.Color contentColor
      [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_contentColor();
      // Get instance field reference: public UnityEngine.Color backgroundColor
      [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_backgroundColor();
      // Get instance field reference: public System.Boolean enabled
      [[deprecated("Use field access instead!")]] bool& dyn_enabled();
      // Get instance field reference: public System.Boolean changed
      [[deprecated("Use field access instead!")]] bool& dyn_changed();
      // Get instance field reference: public System.Int32 displayIndex
      [[deprecated("Use field access instead!")]] int& dyn_displayIndex();
    }; // UnityEngine.UIElements.IMGUIContainer/UnityEngine.UIElements.GUIGlobals
    #pragma pack(pop)
    static check_size<sizeof(IMGUIContainer::GUIGlobals), 116 + sizeof(int)> __UnityEngine_UIElements_IMGUIContainer_GUIGlobalsSizeCheck;
    static_assert(sizeof(IMGUIContainer::GUIGlobals) == 0x78);
    public:
    // private System.Action m_OnGUIHandler
    // Size: 0x8
    // Offset: 0x158
    ::System::Action* m_OnGUIHandler;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private UnityEngine.ObjectGUIState m_ObjectGUIState
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::ObjectGUIState* m_ObjectGUIState;
    // Field size check
    static_assert(sizeof(::UnityEngine::ObjectGUIState*) == 0x8);
    // System.Boolean useOwnerObjectGUIState
    // Size: 0x1
    // Offset: 0x168
    bool useOwnerObjectGUIState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useOwnerObjectGUIState and: lastWorldClip
    char __padding2[0x3] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x940398
    // private UnityEngine.Rect <lastWorldClip>k__BackingField
    // Size: 0x10
    // Offset: 0x16C
    ::UnityEngine::Rect lastWorldClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // Padding between fields: lastWorldClip and: m_Cache
    char __padding3[0x4] = {};
    // private UnityEngine.GUILayoutUtility/UnityEngine.LayoutCache m_Cache
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::GUILayoutUtility::LayoutCache* m_Cache;
    // Field size check
    static_assert(sizeof(::UnityEngine::GUILayoutUtility::LayoutCache*) == 0x8);
    // private UnityEngine.Rect m_CachedClippingRect
    // Size: 0x10
    // Offset: 0x188
    ::UnityEngine::Rect m_CachedClippingRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Matrix4x4 m_CachedTransform
    // Size: 0x40
    // Offset: 0x198
    ::UnityEngine::Matrix4x4 m_CachedTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // [DebuggerBrowsableAttribute] Offset: 0x9403D4
    // private UnityEngine.UIElements.ContextType <contextType>k__BackingField
    // Size: 0x4
    // Offset: 0x1D8
    ::UnityEngine::UIElements::ContextType contextType;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ContextType) == 0x4);
    // private System.Boolean lostFocus
    // Size: 0x1
    // Offset: 0x1DC
    bool lostFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean receivedFocus
    // Size: 0x1
    // Offset: 0x1DD
    bool receivedFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: receivedFocus and: focusChangeDirection
    char __padding9[0x2] = {};
    // private UnityEngine.UIElements.FocusChangeDirection focusChangeDirection
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::UIElements::FocusChangeDirection* focusChangeDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::FocusChangeDirection*) == 0x8);
    // private System.Boolean hasFocusableControls
    // Size: 0x1
    // Offset: 0x1E8
    bool hasFocusableControls;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasFocusableControls and: newKeyboardFocusControlID
    char __padding11[0x3] = {};
    // private System.Int32 newKeyboardFocusControlID
    // Size: 0x4
    // Offset: 0x1EC
    int newKeyboardFocusControlID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x940410
    // private System.Boolean <focusOnlyIfHasFocusableControls>k__BackingField
    // Size: 0x1
    // Offset: 0x1F0
    bool focusOnlyIfHasFocusableControls;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: focusOnlyIfHasFocusableControls and: m_GUIGlobals
    char __padding13[0x3] = {};
    // private UnityEngine.UIElements.IMGUIContainer/UnityEngine.UIElements.GUIGlobals m_GUIGlobals
    // Size: 0x78
    // Offset: 0x1F4
    ::UnityEngine::UIElements::IMGUIContainer::GUIGlobals m_GUIGlobals;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IMGUIContainer::GUIGlobals) == 0x78);
    public:
    // Get static field: static public readonly System.String ussClassName
    static ::StringW _get_ussClassName();
    // Set static field: static public readonly System.String ussClassName
    static void _set_ussClassName(::StringW value);
    // Get instance field reference: private System.Action m_OnGUIHandler
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_m_OnGUIHandler();
    // Get instance field reference: private UnityEngine.ObjectGUIState m_ObjectGUIState
    [[deprecated("Use field access instead!")]] ::UnityEngine::ObjectGUIState*& dyn_m_ObjectGUIState();
    // Get instance field reference: System.Boolean useOwnerObjectGUIState
    [[deprecated("Use field access instead!")]] bool& dyn_useOwnerObjectGUIState();
