// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.Focusable
#include "UnityEngine/UIElements/Focusable.hpp"
// Including type: UnityEngine.UIElements.ITransform
#include "UnityEngine/UIElements/ITransform.hpp"
// Including type: UnityEngine.UIElements.IResolvedStyle
#include "UnityEngine/UIElements/IResolvedStyle.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.UIElements.PseudoStates
#include "UnityEngine/UIElements/PseudoStates.hpp"
// Including type: UnityEngine.UIElements.PickingMode
#include "UnityEngine/UIElements/PickingMode.hpp"
// Including type: UnityEngine.UIElements.ComputedStyle
#include "UnityEngine/UIElements/ComputedStyle.hpp"
// Including type: UnityEngine.PropertyName
#include "UnityEngine/PropertyName.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Yoga
namespace UnityEngine::Yoga {
  // Forward declaring type: YogaNode
  class YogaNode;
}
// Forward declaring namespace: UnityEngine::UIElements::StyleSheets
namespace UnityEngine::UIElements::StyleSheets {
  // Forward declaring type: VisualElementStylesData
  class VisualElementStylesData;
  // Forward declaring type: InheritedStylesData
  class InheritedStylesData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: BaseVisualElementPanel
  class BaseVisualElementPanel;
  // Skipping declaration: Hierarchy because it is already included!
  // Forward declaring type: IPanel
  class IPanel;
  // Skipping declaration: Visibility because it is already included!
  // Skipping declaration: DisplayStyle because it is already included!
  // Forward declaring type: VersionChangeType
  struct VersionChangeType;
  // Forward declaring type: FocusController
  class FocusController;
  // Forward declaring type: EventBase
  class EventBase;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector2
  struct Vector2;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::VisualElement);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::VisualElement*, "UnityEngine.UIElements", "VisualElement");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x158
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.VisualElement
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: 940044
  class VisualElement : public ::UnityEngine::UIElements::Focusable/*, public ::UnityEngine::UIElements::ITransform, public ::UnityEngine::UIElements::IResolvedStyle*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::VisualElement::Hierarchy
    struct Hierarchy;
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.VisualElement/UnityEngine.UIElements.Hierarchy
    // [TokenAttribute] Offset: FFFFFFFF
    // [DefaultMemberAttribute] Offset: 94007C
    struct Hierarchy/*, public ::System::ValueType*/ {
      public:
      public:
      // private readonly UnityEngine.UIElements.VisualElement m_Owner
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UIElements::VisualElement* m_Owner;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
      public:
      // Creating value type constructor for type: Hierarchy
      constexpr Hierarchy(::UnityEngine::UIElements::VisualElement* m_Owner_ = {}) noexcept : m_Owner{m_Owner_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating conversion operator: operator ::UnityEngine::UIElements::VisualElement*
      constexpr operator ::UnityEngine::UIElements::VisualElement*() const noexcept {
        return m_Owner;
      }
      // Get instance field reference: private readonly UnityEngine.UIElements.VisualElement m_Owner
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::VisualElement*& dyn_m_Owner();
      // public UnityEngine.UIElements.VisualElement get_parent()
      // Offset: 0xA7C6BC
      ::UnityEngine::UIElements::VisualElement* get_parent();
      // public System.Int32 get_childCount()
      // Offset: 0xA7C6D8
      int get_childCount();
      // public UnityEngine.UIElements.VisualElement get_Item(System.Int32 key)
      // Offset: 0xA7C6E0
      ::UnityEngine::UIElements::VisualElement* get_Item(int key);
      // public System.Boolean Equals(UnityEngine.UIElements.VisualElement/UnityEngine.UIElements.Hierarchy other)
      // Offset: 0xA7C6E8
      bool Equals(::UnityEngine::UIElements::VisualElement::Hierarchy other);
      // public override System.Boolean Equals(System.Object obj)
      // Offset: 0xA7C6F8
      // Implemented from: System.ValueType
      // Base method: System.Boolean ValueType::Equals(System.Object obj)
      bool Equals(::Il2CppObject* obj);
      // public override System.Int32 GetHashCode()
      // Offset: 0xA7C700
      // Implemented from: System.ValueType
      // Base method: System.Int32 ValueType::GetHashCode()
      int GetHashCode();
    }; // UnityEngine.UIElements.VisualElement/UnityEngine.UIElements.Hierarchy
    #pragma pack(pop)
    static check_size<sizeof(VisualElement::Hierarchy), 0 + sizeof(::UnityEngine::UIElements::VisualElement*)> __UnityEngine_UIElements_VisualElement_HierarchySizeCheck;
    static_assert(sizeof(VisualElement::Hierarchy) == 0x8);
    public:
    // [DebuggerBrowsableAttribute] Offset: 0x94071C
    // private System.Boolean <isCompositeRoot>k__BackingField
    // Size: 0x1
    // Offset: 0x1A
    bool isCompositeRoot;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isCompositeRoot and: m_Position
    char __padding0[0x1] = {};
    // private UnityEngine.Vector3 m_Position
    // Size: 0xC
    // Offset: 0x1C
    ::UnityEngine::Vector3 m_Position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_Rotation
    // Size: 0x10
    // Offset: 0x28
    ::UnityEngine::Quaternion m_Rotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 m_Scale
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 m_Scale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [DebuggerBrowsableAttribute] Offset: 0x940758
    // private System.Boolean <isLayoutManual>k__BackingField
    // Size: 0x1
    // Offset: 0x44
    bool isLayoutManual;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isLayoutManual and: m_Layout
    char __padding4[0x3] = {};
    // private UnityEngine.Rect m_Layout
    // Size: 0x10
    // Offset: 0x48
    ::UnityEngine::Rect m_Layout;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // System.Boolean isBoundingBoxDirty
    // Size: 0x1
    // Offset: 0x58
    bool isBoundingBoxDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isBoundingBoxDirty and: m_BoundingBox
    char __padding6[0x3] = {};
    // private UnityEngine.Rect m_BoundingBox
    // Size: 0x10
    // Offset: 0x5C
    ::UnityEngine::Rect m_BoundingBox;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // System.Boolean isWorldBoundingBoxDirty
    // Size: 0x1
    // Offset: 0x6C
    bool isWorldBoundingBoxDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isWorldBoundingBoxDirty and: m_WorldBoundingBox
    char __padding8[0x3] = {};
    // private UnityEngine.Rect m_WorldBoundingBox
    // Size: 0x10
    // Offset: 0x70
    ::UnityEngine::Rect m_WorldBoundingBox;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // [DebuggerBrowsableAttribute] Offset: 0x940794
    // private System.Boolean <isWorldTransformDirty>k__BackingField
    // Size: 0x1
    // Offset: 0x80
    bool isWorldTransformDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [DebuggerBrowsableAttribute] Offset: 0x9407D0
    // private System.Boolean <isWorldTransformInverseDirty>k__BackingField
    // Size: 0x1
    // Offset: 0x81
    bool isWorldTransformInverseDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isWorldTransformInverseDirty and: m_WorldTransformCache
    char __padding11[0x2] = {};
    // private UnityEngine.Matrix4x4 m_WorldTransformCache
    // Size: 0x40
    // Offset: 0x84
    ::UnityEngine::Matrix4x4 m_WorldTransformCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Matrix4x4 m_WorldTransformInverseCache
    // Size: 0x40
    // Offset: 0xC4
    ::UnityEngine::Matrix4x4 m_WorldTransformInverseCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.UIElements.PseudoStates m_PseudoStates
    // Size: 0x4
    // Offset: 0x104
    ::UnityEngine::UIElements::PseudoStates m_PseudoStates;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PseudoStates) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94080C
    // private UnityEngine.UIElements.PickingMode <pickingMode>k__BackingField
    // Size: 0x4
    // Offset: 0x108
    ::UnityEngine::UIElements::PickingMode pickingMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PickingMode) == 0x4);
    // Padding between fields: pickingMode and: yogaNode
    char __padding15[0x4] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x940848
    // private UnityEngine.Yoga.YogaNode <yogaNode>k__BackingField
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Yoga::YogaNode* yogaNode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Yoga::YogaNode*) == 0x8);
    // UnityEngine.UIElements.StyleSheets.VisualElementStylesData m_Style
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::UIElements::StyleSheets::VisualElementStylesData* m_Style;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleSheets::VisualElementStylesData*) == 0x8);
    // private UnityEngine.UIElements.StyleSheets.InheritedStylesData m_InheritedStylesData
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::UIElements::StyleSheets::InheritedStylesData* m_InheritedStylesData;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleSheets::InheritedStylesData*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x940884
    // private UnityEngine.UIElements.ComputedStyle <computedStyle>k__BackingField
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::UIElements::ComputedStyle computedStyle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ComputedStyle) == 0x8);
    // System.Int32 imguiContainerDescendantCount
    // Size: 0x4
    // Offset: 0x130
    int imguiContainerDescendantCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: imguiContainerDescendantCount and: hierarchy
    char __padding20[0x4] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x9408C0
    // private UnityEngine.UIElements.VisualElement/UnityEngine.UIElements.Hierarchy <hierarchy>k__BackingField
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::UIElements::VisualElement::Hierarchy hierarchy;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement::Hierarchy) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_PhysicalParent
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::UIElements::VisualElement* m_PhysicalParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.VisualElement> m_Children
    // Size: 0x8
    // Offset: 0x148
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>* m_Children;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x9408FC
    // private UnityEngine.UIElements.BaseVisualElementPanel <elementPanel>k__BackingField
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::UIElements::BaseVisualElementPanel* elementPanel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::BaseVisualElementPanel*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::ITransform
    operator ::UnityEngine::UIElements::ITransform() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::ITransform*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::IResolvedStyle
    operator ::UnityEngine::UIElements::IResolvedStyle() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::IResolvedStyle*>(this);
    }
    // Get static field: static private System.Collections.Generic.List`1<System.String> s_EmptyClassList
    static ::System::Collections::Generic::List_1<::StringW>* _get_s_EmptyClassList();
