// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR
namespace OVR {
  // Forward declaring type: SoundGroup
  class SoundGroup;
  // Forward declaring type: SoundFX
  class SoundFX;
  // Forward declaring type: SoundEmitter
  class SoundEmitter;
  // Forward declaring type: MixerSnapshot
  class MixerSnapshot;
  // Forward declaring type: EmitterChannel
  struct EmitterChannel;
  // Forward declaring type: SoundPriority
  struct SoundPriority;
}
// Forward declaring namespace: UnityEngine::Audio
namespace UnityEngine::Audio {
  // Forward declaring type: AudioMixer
  class AudioMixer;
  // Forward declaring type: AudioMixerGroup
  class AudioMixerGroup;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: FastList`1<T>
  template<typename T>
  class FastList_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: OVR
namespace OVR {
  // Forward declaring type: AudioManager
  class AudioManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::OVR::AudioManager);
DEFINE_IL2CPP_ARG_TYPE(::OVR::AudioManager*, "OVR", "AudioManager");
// Type namespace: OVR
namespace OVR {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: OVR.AudioManager
  // [TokenAttribute] Offset: FFFFFFFF
  class AudioManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::OVR::AudioManager::Fade
    struct Fade;
    // Nested type: ::OVR::AudioManager::$$c__DisplayClass77_0
    class $$c__DisplayClass77_0;
    // Nested type: ::OVR::AudioManager::$$c
    class $$c;
    public:
    // [TooltipAttribute] Offset: 0x994CD8
    // public System.Boolean makePersistent
    // Size: 0x1
    // Offset: 0x18
    bool makePersistent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x994D10
    // public System.Boolean enableSpatializedAudio
    // Size: 0x1
    // Offset: 0x19
    bool enableSpatializedAudio;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x994D48
    // public System.Boolean enableSpatializedFastOverride
    // Size: 0x1
    // Offset: 0x1A
    bool enableSpatializedFastOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableSpatializedFastOverride and: audioMixer
    char __padding2[0x5] = {};
    // [TooltipAttribute] Offset: 0x994D80
    // public UnityEngine.Audio.AudioMixer audioMixer
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Audio::AudioMixer* audioMixer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Audio::AudioMixer*) == 0x8);
    // [TooltipAttribute] Offset: 0x994DB8
    // public UnityEngine.Audio.AudioMixerGroup defaultMixerGroup
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Audio::AudioMixerGroup* defaultMixerGroup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Audio::AudioMixerGroup*) == 0x8);
    // [TooltipAttribute] Offset: 0x994DF0
    // public UnityEngine.Audio.AudioMixerGroup reservedMixerGroup
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Audio::AudioMixerGroup* reservedMixerGroup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Audio::AudioMixerGroup*) == 0x8);
    // [TooltipAttribute] Offset: 0x994E28
    // public UnityEngine.Audio.AudioMixerGroup voiceChatMixerGroup
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Audio::AudioMixerGroup* voiceChatMixerGroup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Audio::AudioMixerGroup*) == 0x8);
    // [TooltipAttribute] Offset: 0x994E60
    // public System.Boolean verboseLogging
    // Size: 0x1
    // Offset: 0x40
    bool verboseLogging;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: verboseLogging and: maxSoundEmitters
    char __padding7[0x3] = {};
    // [TooltipAttribute] Offset: 0x994E98
    // public System.Int32 maxSoundEmitters
    // Size: 0x4
    // Offset: 0x44
    int maxSoundEmitters;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0x994ED0
    // public System.Single volumeSoundFX
    // Size: 0x4
    // Offset: 0x48
    float volumeSoundFX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x994F08
    // public System.Single soundFxFadeSecs
    // Size: 0x4
    // Offset: 0x4C
    float soundFxFadeSecs;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single audioMinFallOffDistance
    // Size: 0x4
    // Offset: 0x50
    float audioMinFallOffDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single audioMaxFallOffDistance
    // Size: 0x4
    // Offset: 0x54
    float audioMaxFallOffDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public OVR.SoundGroup[] soundGroupings
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::OVR::SoundGroup*> soundGroupings;
    // Field size check
    static_assert(sizeof(::ArrayW<::OVR::SoundGroup*>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,OVR.SoundFX> soundFXCache
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::Dictionary_2<::StringW, ::OVR::SoundFX*>* soundFXCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::OVR::SoundFX*>*) == 0x8);
    // private System.Single audioMaxFallOffDistanceSqr
    // Size: 0x4
    // Offset: 0x68
    float audioMaxFallOffDistanceSqr;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: audioMaxFallOffDistanceSqr and: soundEmitters
    char __padding15[0x4] = {};
    // private OVR.SoundEmitter[] soundEmitters
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::OVR::SoundEmitter*> soundEmitters;
    // Field size check
    static_assert(sizeof(::ArrayW<::OVR::SoundEmitter*>) == 0x8);
    // private FastList`1<OVR.SoundEmitter> playingEmitters
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::FastList_1<::OVR::SoundEmitter*>* playingEmitters;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FastList_1<::OVR::SoundEmitter*>*) == 0x8);
    // private FastList`1<OVR.SoundEmitter> nextFreeEmitters
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::FastList_1<::OVR::SoundEmitter*>* nextFreeEmitters;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FastList_1<::OVR::SoundEmitter*>*) == 0x8);
    // private OVR.MixerSnapshot currentSnapshot
    // Size: 0x8
    // Offset: 0x88
    ::OVR::MixerSnapshot* currentSnapshot;
    // Field size check
    static_assert(sizeof(::OVR::MixerSnapshot*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private OVR.AudioManager theAudioManager
    static ::OVR::AudioManager* _get_theAudioManager();
    // Set static field: static private OVR.AudioManager theAudioManager
    static void _set_theAudioManager(::OVR::AudioManager* value);
    // Get static field: static private FastList`1<System.String> names
    static ::GlobalNamespace::FastList_1<::StringW>* _get_names();
    // Set static field: static private FastList`1<System.String> names
    static void _set_names(::GlobalNamespace::FastList_1<::StringW>* value);
    // Get static field: static private System.String[] defaultSound
    static ::ArrayW<::StringW> _get_defaultSound();
