// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVR.EmitterChannel
#include "OVR/EmitterChannel.hpp"
// Including type: OVR.SoundPriority
#include "OVR/SoundPriority.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioVelocityUpdateMode
  struct AudioVelocityUpdateMode;
}
// Forward declaring namespace: OVR
namespace OVR {
  // Forward declaring type: SoundGroup
  class SoundGroup;
  // Forward declaring type: Fade
  struct Fade;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ONSPAudioSource
  class ONSPAudioSource;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::Audio
namespace UnityEngine::Audio {
  // Forward declaring type: AudioMixerGroup
  class AudioMixerGroup;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: OVR
namespace OVR {
  // Forward declaring type: SoundEmitter
  class SoundEmitter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::OVR::SoundEmitter);
DEFINE_IL2CPP_ARG_TYPE(::OVR::SoundEmitter*, "OVR", "SoundEmitter");
// Type namespace: OVR
namespace OVR {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: OVR.SoundEmitter
  // [TokenAttribute] Offset: FFFFFFFF
  class SoundEmitter : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::OVR::SoundEmitter::FadeState
    struct FadeState;
    // Nested type: ::OVR::SoundEmitter::$DelayedSyncTo$d__57
    class $DelayedSyncTo$d__57;
    // Nested type: ::OVR::SoundEmitter::$FadeSoundChannelTo$d__63
    class $FadeSoundChannelTo$d__63;
    // Nested type: ::OVR::SoundEmitter::$FadeSoundChannel$d__64
    class $FadeSoundChannel$d__64;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVR.SoundEmitter/OVR.FadeState
    // [TokenAttribute] Offset: FFFFFFFF
    struct FadeState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: FadeState
      constexpr FadeState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVR.SoundEmitter/OVR.FadeState Null
      static constexpr const int Null = 0;
      // Get static field: static public OVR.SoundEmitter/OVR.FadeState Null
      static ::OVR::SoundEmitter::FadeState _get_Null();
      // Set static field: static public OVR.SoundEmitter/OVR.FadeState Null
      static void _set_Null(::OVR::SoundEmitter::FadeState value);
      // static field const value: static public OVR.SoundEmitter/OVR.FadeState FadingIn
      static constexpr const int FadingIn = 1;
      // Get static field: static public OVR.SoundEmitter/OVR.FadeState FadingIn
      static ::OVR::SoundEmitter::FadeState _get_FadingIn();
      // Set static field: static public OVR.SoundEmitter/OVR.FadeState FadingIn
      static void _set_FadingIn(::OVR::SoundEmitter::FadeState value);
      // static field const value: static public OVR.SoundEmitter/OVR.FadeState FadingOut
      static constexpr const int FadingOut = 2;
      // Get static field: static public OVR.SoundEmitter/OVR.FadeState FadingOut
      static ::OVR::SoundEmitter::FadeState _get_FadingOut();
      // Set static field: static public OVR.SoundEmitter/OVR.FadeState FadingOut
      static void _set_FadingOut(::OVR::SoundEmitter::FadeState value);
      // static field const value: static public OVR.SoundEmitter/OVR.FadeState Ducking
      static constexpr const int Ducking = 3;
      // Get static field: static public OVR.SoundEmitter/OVR.FadeState Ducking
      static ::OVR::SoundEmitter::FadeState _get_Ducking();
      // Set static field: static public OVR.SoundEmitter/OVR.FadeState Ducking
      static void _set_Ducking(::OVR::SoundEmitter::FadeState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVR.SoundEmitter/OVR.FadeState
    #pragma pack(pop)
    static check_size<sizeof(SoundEmitter::FadeState), 0 + sizeof(int)> __OVR_SoundEmitter_FadeStateSizeCheck;
    static_assert(sizeof(SoundEmitter::FadeState) == 0x4);
    public:
    // public OVR.EmitterChannel channel
    // Size: 0x4
    // Offset: 0x18
    ::OVR::EmitterChannel channel;
    // Field size check
    static_assert(sizeof(::OVR::EmitterChannel) == 0x4);
    // public System.Boolean disableSpatialization
    // Size: 0x1
    // Offset: 0x1C
    bool disableSpatialization;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableSpatialization and: state
    char __padding1[0x3] = {};
    // private OVR.SoundEmitter/OVR.FadeState state
    // Size: 0x4
    // Offset: 0x20
    ::OVR::SoundEmitter::FadeState state;
    // Field size check
    static_assert(sizeof(::OVR::SoundEmitter::FadeState) == 0x4);
    // Padding between fields: state and: audioSource
    char __padding2[0x4] = {};
    // public UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public OVR.SoundPriority priority
    // Size: 0x4
    // Offset: 0x30
    ::OVR::SoundPriority priority;
    // Field size check
    static_assert(sizeof(::OVR::SoundPriority) == 0x4);
    // Padding between fields: priority and: osp
    char __padding4[0x4] = {};
    // public ONSPAudioSource osp
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::ONSPAudioSource* osp;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ONSPAudioSource*) == 0x8);
    // public System.Single endPlayTime
    // Size: 0x4
    // Offset: 0x40
    float endPlayTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: endPlayTime and: lastParentTransform
    char __padding6[0x4] = {};
    // private UnityEngine.Transform lastParentTransform
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* lastParentTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Single defaultVolume
    // Size: 0x4
    // Offset: 0x50
    float defaultVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: defaultVolume and: defaultParent
    char __padding8[0x4] = {};
    // public UnityEngine.Transform defaultParent
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* defaultParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Int32 originalIdx
    // Size: 0x4
    // Offset: 0x60
    int originalIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: originalIdx and: onFinished
    char __padding10[0x4] = {};
    // public System.Action onFinished
    // Size: 0x8
    // Offset: 0x68
    ::System::Action* onFinished;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action`1<System.Object> onFinishedObject
    // Size: 0x8
    // Offset: 0x70
    ::System::Action_1<::Il2CppObject*>* onFinishedObject;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Il2CppObject*>*) == 0x8);
    // public System.Object onFinishedParam
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppObject* onFinishedParam;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public OVR.SoundGroup playingSoundGroup
    // Size: 0x8
    // Offset: 0x80
    ::OVR::SoundGroup* playingSoundGroup;
    // Field size check
    static_assert(sizeof(::OVR::SoundGroup*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public OVR.EmitterChannel channel
    [[deprecated("Use field access instead!")]] ::OVR::EmitterChannel& dyn_channel();
    // Get instance field reference: public System.Boolean disableSpatialization
    [[deprecated("Use field access instead!")]] bool& dyn_disableSpatialization();
    // Get instance field reference: private OVR.SoundEmitter/OVR.FadeState state
    [[deprecated("Use field access instead!")]] ::OVR::SoundEmitter::FadeState& dyn_state();
    // Get instance field reference: public UnityEngine.AudioSource audioSource
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_audioSource();
