// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: MasterServer.MessageHandler
#include "MasterServer/MessageHandler.hpp"
// Including type: System.Threading.CancellationToken
#include "System/Threading/CancellationToken.hpp"
// Including type: System.Runtime.CompilerServices.IAsyncStateMachine
#include "System/Runtime/CompilerServices/IAsyncStateMachine.hpp"
// Including type: System.Runtime.CompilerServices.AsyncTaskMethodBuilder
#include "System/Runtime/CompilerServices/AsyncTaskMethodBuilder.hpp"
// Including type: System.Runtime.CompilerServices.TaskAwaiter`1
#include "System/Runtime/CompilerServices/TaskAwaiter_1.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MasterServer
namespace MasterServer {
  // Skipping declaration: <<WrapOnSendFailedAwaitResponse>b__0>d because it is already included!
  // Forward declaring type: IMasterServerMessage
  class IMasterServerMessage;
  // Forward declaring type: IMasterServerReliableRequest
  class IMasterServerReliableRequest;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`5<T1, T2, T3, T4, TResult>
  template<typename T1, typename T2, typename T3, typename T4, typename TResult>
  class Func_5;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Completed forward declares
// Type namespace: MasterServer
namespace MasterServer {
  // Autogenerated type: MasterServer.MessageHandler/<>c__DisplayClass101_0`1
  template<typename T>
  class MessageHandler::$$c__DisplayClass101_0_1 : public ::Il2CppObject {
    public:
    // Nested type: MasterServer::MessageHandler::$$c__DisplayClass101_0_1::$$WrapOnSendFailedAwaitResponse$b__0$d<T>
    struct $$WrapOnSendFailedAwaitResponse$b__0$d;
    // Autogenerated type: MasterServer.MessageHandler/<>c__DisplayClass101_0`1/<<WrapOnSendFailedAwaitResponse>b__0>d
    struct $$WrapOnSendFailedAwaitResponse$b__0$d : public System::ValueType, public System::Runtime::CompilerServices::IAsyncStateMachine, public ::il2cpp_utils::il2cpp_type_check::NestedType {
      public:
      using declaring_type = MessageHandler::$$c__DisplayClass101_0_1<T>*;
      static constexpr std::string_view NESTED_NAME = "$$WrapOnSendFailedAwaitResponse$b__0$d";
      // public System.Int32 <>1__state
      // Offset: 0x0
      int $$1__state;
      // public System.Runtime.CompilerServices.AsyncTaskMethodBuilder <>t__builder
      // Offset: 0x0
      System::Runtime::CompilerServices::AsyncTaskMethodBuilder $$t__builder;
      // public MasterServer.MessageHandler/<>c__DisplayClass101_0`1<T> <>4__this
      // Offset: 0x0
      MasterServer::MessageHandler::$$c__DisplayClass101_0_1<T>* $$4__this;
      // public System.UInt32 protocolVersion
      // Offset: 0x0
      uint protocolVersion;
      // public System.Net.IPEndPoint remoteEndPoint
      // Offset: 0x0
      System::Net::IPEndPoint* remoteEndPoint;
      // public MasterServer.IMasterServerReliableRequest message
      // Offset: 0x0
      MasterServer::IMasterServerReliableRequest* message;
      // public System.Threading.CancellationToken cancellationToken
      // Offset: 0x0
      System::Threading::CancellationToken cancellationToken;
      // private MasterServer.MessageHandler/RequestResponseWaiter <>7__wrap1
      // Offset: 0x0
      MasterServer::MessageHandler::RequestResponseWaiter* $$7__wrap1;
      // private System.Runtime.CompilerServices.TaskAwaiter`1<T> <>u__1
      // Offset: 0x0
      System::Runtime::CompilerServices::TaskAwaiter_1<T> $$u__1;
      // Creating value type constructor for type: $$WrapOnSendFailedAwaitResponse$b__0$d
      constexpr $$WrapOnSendFailedAwaitResponse$b__0$d(int $$1__state_ = {}, System::Runtime::CompilerServices::AsyncTaskMethodBuilder $$t__builder_ = {}, MasterServer::MessageHandler::$$c__DisplayClass101_0_1<T>* $$4__this_ = {}, uint protocolVersion_ = {}, System::Net::IPEndPoint* remoteEndPoint_ = {}, MasterServer::IMasterServerReliableRequest* message_ = {}, System::Threading::CancellationToken cancellationToken_ = {}, MasterServer::MessageHandler::RequestResponseWaiter* $$7__wrap1_ = {}, System::Runtime::CompilerServices::TaskAwaiter_1<T> $$u__1_ = {}) noexcept : $$1__state{$$1__state_}, $$t__builder{$$t__builder_}, $$4__this{$$4__this_}, protocolVersion{protocolVersion_}, remoteEndPoint{remoteEndPoint_}, message{message_}, cancellationToken{cancellationToken_}, $$7__wrap1{$$7__wrap1_}, $$u__1{$$u__1_} {}
      // private System.Void MoveNext()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Runtime.CompilerServices.IAsyncStateMachine
      // Base method: System.Void IAsyncStateMachine::MoveNext()
      void MoveNext() {
        THROW_UNLESS(il2cpp_utils::RunMethod(*this, "MoveNext"));
      }
      // private System.Void SetStateMachine(System.Runtime.CompilerServices.IAsyncStateMachine stateMachine)
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Runtime.CompilerServices.IAsyncStateMachine
      // Base method: System.Void IAsyncStateMachine::SetStateMachine(System.Runtime.CompilerServices.IAsyncStateMachine stateMachine)
      void SetStateMachine(System::Runtime::CompilerServices::IAsyncStateMachine* stateMachine) {
        THROW_UNLESS(il2cpp_utils::RunMethod(*this, "SetStateMachine", stateMachine));
      }
    }; // MasterServer.MessageHandler/<>c__DisplayClass101_0`1/<<WrapOnSendFailedAwaitResponse>b__0>d
    // public MasterServer.MessageHandler/RequestResponseWaiter waiter
    // Offset: 0x0
    MasterServer::MessageHandler::RequestResponseWaiter* waiter;
    // public System.Func`5<System.UInt32,System.Net.IPEndPoint,MasterServer.IMasterServerReliableRequest,System.Threading.CancellationToken,System.Threading.Tasks.Task`1<T>> onSendFailed
    // Offset: 0x0
    System::Func_5<uint, System::Net::IPEndPoint*, MasterServer::IMasterServerReliableRequest*, System::Threading::CancellationToken, System::Threading::Tasks::Task_1<T>*>* onSendFailed;
    // System.Threading.Tasks.Task <WrapOnSendFailedAwaitResponse>b__0(System.UInt32 protocolVersion, System.Net.IPEndPoint remoteEndPoint, MasterServer.IMasterServerReliableRequest message, System.Threading.CancellationToken cancellationToken)
    // Offset: 0xFFFFFFFF
    System::Threading::Tasks::Task* $WrapOnSendFailedAwaitResponse$b__0(uint protocolVersion, System::Net::IPEndPoint* remoteEndPoint, MasterServer::IMasterServerReliableRequest* message, System::Threading::CancellationToken cancellationToken) {
      return THROW_UNLESS((il2cpp_utils::RunMethod<System::Threading::Tasks::Task*>(this, "<WrapOnSendFailedAwaitResponse>b__0", protocolVersion, remoteEndPoint, message, cancellationToken)));
    }
    // public System.Void .ctor()
    // Offset: 0xFFFFFFFF
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static MessageHandler::$$c__DisplayClass101_0_1<T>* New_ctor() {
      return THROW_UNLESS(il2cpp_utils::New<MessageHandler::$$c__DisplayClass101_0_1<T>*>());
    }
  }; // MasterServer.MessageHandler/<>c__DisplayClass101_0`1
}
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(MasterServer::MessageHandler::$$c__DisplayClass101_0_1, "MasterServer", "MessageHandler/<>c__DisplayClass101_0`1");
#pragma pack(pop)
