// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: MasterServer.BaseClientMessageHandler
#include "MasterServer/BaseClientMessageHandler.hpp"
// Including type: ConnectionFailedReason
#include "GlobalNamespace/ConnectionFailedReason.hpp"
// Including type: PublicServerInfo
#include "GlobalNamespace/PublicServerInfo.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MasterServer
namespace MasterServer {
  // Forward declaring type: ITimeProvider
  class ITimeProvider;
  // Forward declaring type: BaseConnectToServerRequest
  class BaseConnectToServerRequest;
  // Forward declaring type: IUserMessage
  class IUserMessage;
  // Forward declaring type: IMasterServerAuthenticateRequest
  class IMasterServerAuthenticateRequest;
  // Forward declaring type: UserServerHeartbeatResponse
  class UserServerHeartbeatResponse;
  // Forward declaring type: PrepareForConnectionRequest
  class PrepareForConnectionRequest;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IAuthenticationTokenProvider
  class IAuthenticationTokenProvider;
  // Forward declaring type: IDiffieHellmanKeyPair
  class IDiffieHellmanKeyPair;
  // Forward declaring type: IUnconnectedSenderReceiver
  class IUnconnectedSenderReceiver;
  // Forward declaring type: MasterServerEndPoint
  class MasterServerEndPoint;
  // Forward declaring type: ICertificateValidator
  class ICertificateValidator;
  // Forward declaring type: DiscoveryPolicy
  struct DiscoveryPolicy;
  // Forward declaring type: InvitePolicy
  struct InvitePolicy;
  // Skipping declaration: GameplayServerConfiguration because it is already included!
  // Forward declaring type: GameplayServerFilter
  struct GameplayServerFilter;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Skipping declaration: CancellationToken because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Completed forward declares
// Type namespace: MasterServer
namespace MasterServer {
  // Size: 0x118
  #pragma pack(push, 1)
  // Autogenerated type: MasterServer.UserMessageHandler
  class UserMessageHandler : public MasterServer::BaseClientMessageHandler {
    public:
    // Nested type: MasterServer::UserMessageHandler::ConnectToClientDelegate
    class ConnectToClientDelegate;
    // Nested type: MasterServer::UserMessageHandler::ConnectToServerDelegate
    class ConnectToServerDelegate;
    // Nested type: MasterServer::UserMessageHandler::$GetAuthenticationRequest$d__28
    struct $GetAuthenticationRequest$d__28;
    // Nested type: MasterServer::UserMessageHandler::$HandlePrepareForConnectionRequest$d__30
    struct $HandlePrepareForConnectionRequest$d__30;
    // Nested type: MasterServer::UserMessageHandler::$$c__DisplayClass34_0
    class $$c__DisplayClass34_0;
    // Nested type: MasterServer::UserMessageHandler::$$c__DisplayClass38_0
    class $$c__DisplayClass38_0;
    // Nested type: MasterServer::UserMessageHandler::$$c__DisplayClass39_0
    class $$c__DisplayClass39_0;
    // Nested type: MasterServer::UserMessageHandler::$WithFailureHandler$d__40
    struct $WithFailureHandler$d__40;
    // [CompilerGeneratedAttribute] Offset: 0xDF11D0
    // private MasterServer.UserMessageHandler/ConnectToClientDelegate connectToClientEvent
    // Size: 0x8
    // Offset: 0xB0
    MasterServer::UserMessageHandler::ConnectToClientDelegate* connectToClientEvent;
    // Field size check
    static_assert(sizeof(MasterServer::UserMessageHandler::ConnectToClientDelegate*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF11E0
    // private System.Action broadcastingStoppedEvent
    // Size: 0x8
    // Offset: 0xB8
    System::Action* broadcastingStoppedEvent;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // private System.Int64 _lastHeartbeatResponseTime
    // Size: 0x8
    // Offset: 0xC0
    int64_t lastHeartbeatResponseTime;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 _lastHeartbeatRequestTime
    // Size: 0x8
    // Offset: 0xC8
    int64_t lastHeartbeatRequestTime;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 _lastKeepaliveTime
    // Size: 0x8
    // Offset: 0xD0
    int64_t lastKeepaliveTime;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private readonly IAuthenticationTokenProvider _authenticationTokenProvider
    // Size: 0x8
    // Offset: 0xD8
    GlobalNamespace::IAuthenticationTokenProvider* authenticationTokenProvider;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IAuthenticationTokenProvider*) == 0x8);
    // private System.Boolean _isServerActive
    // Size: 0x1
    // Offset: 0xE0
    bool isServerActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isServerWaitingForBroadcastResult
    // Size: 0x1
    // Offset: 0xE1
    bool isServerWaitingForBroadcastResult;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isServerWaitingForBroadcastResult and: serverUserId
    char __padding7[0x6] = {};
    // private System.String _serverUserId
    // Size: 0x8
    // Offset: 0xE8
    ::Il2CppString* serverUserId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String _serverUserName
    // Size: 0x8
    // Offset: 0xF0
    ::Il2CppString* serverUserName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String _serverSecret
    // Size: 0x8
    // Offset: 0xF8
    ::Il2CppString* serverSecret;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Int32 _serverCurrentPlayerCount
    // Size: 0x4
    // Offset: 0x100
    int serverCurrentPlayerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: serverCurrentPlayerCount and: serverRandom
    char __padding11[0x4] = {};
    // private System.Byte[] _serverRandom
    // Size: 0x8
    // Offset: 0x108
    ::Array<uint8_t>* serverRandom;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Threading.Tasks.Task`1<IDiffieHellmanKeyPair> _serverKeysTask
    // Size: 0x8
    // Offset: 0x110
    System::Threading::Tasks::Task_1<GlobalNamespace::IDiffieHellmanKeyPair*>* serverKeysTask;
    // Field size check
    static_assert(sizeof(System::Threading::Tasks::Task_1<GlobalNamespace::IDiffieHellmanKeyPair*>*) == 0x8);
    // Creating value type constructor for type: UserMessageHandler
