// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: MasterServer.UserMessageHandler
#include "MasterServer/UserMessageHandler.hpp"
// Including type: ConnectionFailedReason
#include "GlobalNamespace/ConnectionFailedReason.hpp"
// Including type: System.Threading.CancellationToken
#include "System/Threading/CancellationToken.hpp"
// Including type: DiscoveryPolicy
#include "GlobalNamespace/DiscoveryPolicy.hpp"
// Including type: InvitePolicy
#include "GlobalNamespace/InvitePolicy.hpp"
// Including type: GameplayServerConfiguration
#include "GlobalNamespace/GameplayServerConfiguration.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MasterServer
namespace MasterServer {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Completed forward declares
// Type namespace: MasterServer
namespace MasterServer {
  // Autogenerated type: MasterServer.UserMessageHandler/<>c__DisplayClass34_0
  class UserMessageHandler::$$c__DisplayClass34_0 : public ::Il2CppObject {
    public:
    // Nested type: MasterServer::UserMessageHandler::$$c__DisplayClass34_0::$$StartBroadcastingServer$b__1$d
    struct $$StartBroadcastingServer$b__1$d;
    // public MasterServer.UserMessageHandler <>4__this
    // Offset: 0x10
    MasterServer::UserMessageHandler* $$4__this;
    // public System.Action`1<ConnectionFailedReason> onBroadcastFailed
    // Offset: 0x18
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* onBroadcastFailed;
    // public System.String userId
    // Offset: 0x20
    ::Il2CppString* userId;
    // public System.String userName
    // Offset: 0x28
    ::Il2CppString* userName;
    // public System.String secret
    // Offset: 0x30
    ::Il2CppString* secret;
    // public System.Int32 currentPlayerCount
    // Offset: 0x38
    int currentPlayerCount;
    // public System.Threading.CancellationToken cancellationToken
    // Offset: 0x40
    System::Threading::CancellationToken cancellationToken;
    // public System.String serverName
    // Offset: 0x48
    ::Il2CppString* serverName;
    // public System.String password
    // Offset: 0x50
    ::Il2CppString* password;
    // public System.Int32 maxPlayerCount
    // Offset: 0x58
    int maxPlayerCount;
    // public DiscoveryPolicy discoveryPolicy
    // Offset: 0x5C
    GlobalNamespace::DiscoveryPolicy discoveryPolicy;
    // public InvitePolicy invitePolicy
    // Offset: 0x60
    GlobalNamespace::InvitePolicy invitePolicy;
    // public GameplayServerConfiguration configuration
    // Offset: 0x68
    GlobalNamespace::GameplayServerConfiguration configuration;
    // public System.Action`2<System.Net.IPEndPoint,System.String> onSuccess
    // Offset: 0x80
    System::Action_2<System::Net::IPEndPoint*, ::Il2CppString*>* onSuccess;
    // System.Void <StartBroadcastingServer>b__0(ConnectionFailedReason result)
    // Offset: 0x212AE6C
    void $StartBroadcastingServer$b__0(GlobalNamespace::ConnectionFailedReason result);
    // System.Threading.Tasks.Task <StartBroadcastingServer>b__1()
    // Offset: 0x212AEFC
    System::Threading::Tasks::Task* $StartBroadcastingServer$b__1();
    // public System.Void .ctor()
    // Offset: 0x212A49C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static UserMessageHandler::$$c__DisplayClass34_0* New_ctor();
  }; // MasterServer.UserMessageHandler/<>c__DisplayClass34_0
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(MasterServer::UserMessageHandler::$$c__DisplayClass34_0*, "MasterServer", "UserMessageHandler/<>c__DisplayClass34_0");
#pragma pack(pop)
