// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: MasterServer.UserMessageHandler
#include "MasterServer/UserMessageHandler.hpp"
// Including type: GameplayServerFilter
#include "GlobalNamespace/GameplayServerFilter.hpp"
// Including type: System.Threading.CancellationToken
#include "System/Threading/CancellationToken.hpp"
// Including type: PublicServerInfo
#include "GlobalNamespace/PublicServerInfo.hpp"
// Including type: ConnectionFailedReason
#include "GlobalNamespace/ConnectionFailedReason.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MasterServer
namespace MasterServer {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Completed forward declares
// Type namespace: MasterServer
namespace MasterServer {
  // Autogenerated type: MasterServer.UserMessageHandler/<>c__DisplayClass39_0
  class UserMessageHandler::$$c__DisplayClass39_0 : public ::Il2CppObject {
    public:
    // Nested type: MasterServer::UserMessageHandler::$$c__DisplayClass39_0::$$GetPublicServers$b__0$d
    struct $$GetPublicServers$b__0$d;
    // public MasterServer.UserMessageHandler <>4__this
    // Offset: 0x10
    MasterServer::UserMessageHandler* $$4__this;
    // public System.String userId
    // Offset: 0x18
    ::Il2CppString* userId;
    // public System.String userName
    // Offset: 0x20
    ::Il2CppString* userName;
    // public System.Int32 offset
    // Offset: 0x28
    int offset;
    // public System.Int32 count
    // Offset: 0x2C
    int count;
    // public GameplayServerFilter filter
    // Offset: 0x30
    GlobalNamespace::GameplayServerFilter filter;
    // public System.Threading.CancellationToken cancellationToken
    // Offset: 0x58
    System::Threading::CancellationToken cancellationToken;
    // public System.Action`1<System.Collections.Generic.IReadOnlyList`1<PublicServerInfo>> onSuccess
    // Offset: 0x60
    System::Action_1<System::Collections::Generic::IReadOnlyList_1<GlobalNamespace::PublicServerInfo>*>* onSuccess;
    // public System.Action`1<ConnectionFailedReason> onFailure
    // Offset: 0x68
    System::Action_1<GlobalNamespace::ConnectionFailedReason>* onFailure;
    // System.Threading.Tasks.Task <GetPublicServers>b__0()
    // Offset: 0x1AE3398
    System::Threading::Tasks::Task* $GetPublicServers$b__0();
    // public System.Void .ctor()
    // Offset: 0x1AE17FC
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static UserMessageHandler::$$c__DisplayClass39_0* New_ctor();
  }; // MasterServer.UserMessageHandler/<>c__DisplayClass39_0
  check_size<sizeof(UserMessageHandler::$$c__DisplayClass39_0), 104 + sizeof(void*) + 8 - (104 + sizeof(void*)) % 8> __MasterServer_UserMessageHandler_$$c__DisplayClass39_0SizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(MasterServer::UserMessageHandler::$$c__DisplayClass39_0*, "MasterServer", "UserMessageHandler/<>c__DisplayClass39_0");
#pragma pack(pop)
