// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Org.BouncyCastle.Asn1.Asn1Encodable
#include "Org/BouncyCastle/Asn1/Asn1Encodable.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Org::BouncyCastle::Asn1::X509
namespace Org::BouncyCastle::Asn1::X509 {
  // Forward declaring type: AlgorithmIdentifier
  class AlgorithmIdentifier;
  // Forward declaring type: X509Name
  class X509Name;
  // Forward declaring type: Time
  class Time;
  // Forward declaring type: X509Extensions
  class X509Extensions;
}
// Forward declaring namespace: Org::BouncyCastle::Asn1
namespace Org::BouncyCastle::Asn1 {
  // Forward declaring type: Asn1Sequence
  class Asn1Sequence;
  // Forward declaring type: DerInteger
  class DerInteger;
  // Forward declaring type: Asn1Object
  class Asn1Object;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerable
  class IEnumerable;
}
// Completed forward declares
// Type namespace: Org.BouncyCastle.Asn1.X509
namespace Org::BouncyCastle::Asn1::X509 {
  // Autogenerated type: Org.BouncyCastle.Asn1.X509.TbsCertificateList
  class TbsCertificateList : public Org::BouncyCastle::Asn1::Asn1Encodable {
    public:
    // Nested type: Org::BouncyCastle::Asn1::X509::TbsCertificateList::RevokedCertificatesEnumeration
    class RevokedCertificatesEnumeration;
    // Org.BouncyCastle.Asn1.Asn1Sequence seq
    // Offset: 0x10
    Org::BouncyCastle::Asn1::Asn1Sequence* seq;
    // Org.BouncyCastle.Asn1.DerInteger version
    // Offset: 0x18
    Org::BouncyCastle::Asn1::DerInteger* version;
    // Org.BouncyCastle.Asn1.X509.AlgorithmIdentifier signature
    // Offset: 0x20
    Org::BouncyCastle::Asn1::X509::AlgorithmIdentifier* signature;
    // Org.BouncyCastle.Asn1.X509.X509Name issuer
    // Offset: 0x28
    Org::BouncyCastle::Asn1::X509::X509Name* issuer;
    // Org.BouncyCastle.Asn1.X509.Time thisUpdate
    // Offset: 0x30
    Org::BouncyCastle::Asn1::X509::Time* thisUpdate;
    // Org.BouncyCastle.Asn1.X509.Time nextUpdate
    // Offset: 0x38
    Org::BouncyCastle::Asn1::X509::Time* nextUpdate;
    // Org.BouncyCastle.Asn1.Asn1Sequence revokedCertificates
    // Offset: 0x40
    Org::BouncyCastle::Asn1::Asn1Sequence* revokedCertificates;
    // Org.BouncyCastle.Asn1.X509.X509Extensions crlExtensions
    // Offset: 0x48
    Org::BouncyCastle::Asn1::X509::X509Extensions* crlExtensions;
    // static public Org.BouncyCastle.Asn1.X509.TbsCertificateList GetInstance(System.Object obj)
    // Offset: 0x160A4DC
    static Org::BouncyCastle::Asn1::X509::TbsCertificateList* GetInstance(::Il2CppObject* obj);
    // System.Void .ctor(Org.BouncyCastle.Asn1.Asn1Sequence seq)
    // Offset: 0x160F46C
    static TbsCertificateList* New_ctor(Org::BouncyCastle::Asn1::Asn1Sequence* seq);
    // public System.Int32 get_Version()
    // Offset: 0x160A76C
    int get_Version();
    // public Org.BouncyCastle.Asn1.X509.X509Name get_Issuer()
    // Offset: 0x160F98C
    Org::BouncyCastle::Asn1::X509::X509Name* get_Issuer();
    // public Org.BouncyCastle.Asn1.X509.Time get_ThisUpdate()
    // Offset: 0x160F994
    Org::BouncyCastle::Asn1::X509::Time* get_ThisUpdate();
    // public Org.BouncyCastle.Asn1.X509.Time get_NextUpdate()
    // Offset: 0x160F99C
    Org::BouncyCastle::Asn1::X509::Time* get_NextUpdate();
    // public System.Collections.IEnumerable GetRevokedCertificateEnumeration()
    // Offset: 0x160A67C
    System::Collections::IEnumerable* GetRevokedCertificateEnumeration();
    // public Org.BouncyCastle.Asn1.X509.X509Extensions get_Extensions()
    // Offset: 0x160F9D8
    Org::BouncyCastle::Asn1::X509::X509Extensions* get_Extensions();
    // public override Org.BouncyCastle.Asn1.Asn1Object ToAsn1Object()
    // Offset: 0x160F9E0
    // Implemented from: Org.BouncyCastle.Asn1.Asn1Encodable
    // Base method: Org.BouncyCastle.Asn1.Asn1Object Asn1Encodable::ToAsn1Object()
    Org::BouncyCastle::Asn1::Asn1Object* ToAsn1Object();
  }; // Org.BouncyCastle.Asn1.X509.TbsCertificateList
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Org::BouncyCastle::Asn1::X509::TbsCertificateList*, "Org.BouncyCastle.Asn1.X509", "TbsCertificateList");
#pragma pack(pop)
