// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: AsymmetricAlgorithm
  class AsymmetricAlgorithm;
  // Forward declaring type: AsnEncodedData
  class AsnEncodedData;
  // Forward declaring type: Oid
  class Oid;
  // Forward declaring type: DSA
  class DSA;
  // Forward declaring type: RSA
  class RSA;
}
// Forward declaring namespace: Mono::Security::X509
namespace Mono::Security::X509 {
  // Forward declaring type: X509Certificate
  class X509Certificate;
}
// Completed forward declares
// Type namespace: System.Security.Cryptography.X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.Security.Cryptography.X509Certificates.PublicKey
  class PublicKey : public ::Il2CppObject {
    public:
    // private System.Security.Cryptography.AsymmetricAlgorithm _key
    // Size: 0x8
    // Offset: 0x10
    System::Security::Cryptography::AsymmetricAlgorithm* key;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::AsymmetricAlgorithm*) == 0x8);
    // private System.Security.Cryptography.AsnEncodedData _keyValue
    // Size: 0x8
    // Offset: 0x18
    System::Security::Cryptography::AsnEncodedData* keyValue;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::AsnEncodedData*) == 0x8);
    // private System.Security.Cryptography.AsnEncodedData _params
    // Size: 0x8
    // Offset: 0x20
    System::Security::Cryptography::AsnEncodedData* params;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::AsnEncodedData*) == 0x8);
    // private System.Security.Cryptography.Oid _oid
    // Size: 0x8
    // Offset: 0x28
    System::Security::Cryptography::Oid* oid;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::Oid*) == 0x8);
    // Creating value type constructor for type: PublicKey
    PublicKey(System::Security::Cryptography::AsymmetricAlgorithm* key_ = {}, System::Security::Cryptography::AsnEncodedData* keyValue_ = {}, System::Security::Cryptography::AsnEncodedData* params_ = {}, System::Security::Cryptography::Oid* oid_ = {}) noexcept : key{key_}, keyValue{keyValue_}, params{params_}, oid{oid_} {}
    // Get static field: static private System.Byte[] Empty
    static ::Array<uint8_t>* _get_Empty();
    // Set static field: static private System.Byte[] Empty
    static void _set_Empty(::Array<uint8_t>* value);
    // System.Void .ctor(Mono.Security.X509.X509Certificate certificate)
    // Offset: 0x16A67F4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PublicKey* New_ctor(Mono::Security::X509::X509Certificate* certificate) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Security::Cryptography::X509Certificates::PublicKey::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PublicKey*, creationType>(certificate)));
    }
    // public System.Security.Cryptography.AsnEncodedData get_EncodedKeyValue()
    // Offset: 0x16A6BE4
    System::Security::Cryptography::AsnEncodedData* get_EncodedKeyValue();
    // public System.Security.Cryptography.AsnEncodedData get_EncodedParameters()
    // Offset: 0x16A6BEC
    System::Security::Cryptography::AsnEncodedData* get_EncodedParameters();
    // public System.Security.Cryptography.AsymmetricAlgorithm get_Key()
    // Offset: 0x16A6BF4
    System::Security::Cryptography::AsymmetricAlgorithm* get_Key();
    // public System.Security.Cryptography.Oid get_Oid()
    // Offset: 0x16A75BC
    System::Security::Cryptography::Oid* get_Oid();
    // static private System.Byte[] GetUnsignedBigInteger(System.Byte[] integer)
    // Offset: 0x16A75C4
    static ::Array<uint8_t>* GetUnsignedBigInteger(::Array<uint8_t>* integer);
    // static System.Security.Cryptography.DSA DecodeDSA(System.Byte[] rawPublicKey, System.Byte[] rawParameters)
    // Offset: 0x16A7144
    static System::Security::Cryptography::DSA* DecodeDSA(::Array<uint8_t>* rawPublicKey, ::Array<uint8_t>* rawParameters);
    // static System.Security.Cryptography.RSA DecodeRSA(System.Byte[] rawPublicKey)
    // Offset: 0x16A6DAC
    static System::Security::Cryptography::RSA* DecodeRSA(::Array<uint8_t>* rawPublicKey);
    // static private System.Void .cctor()
    // Offset: 0x16A7670
    static void _cctor();
  }; // System.Security.Cryptography.X509Certificates.PublicKey
  #pragma pack(pop)
  static check_size<sizeof(PublicKey), 40 + sizeof(System::Security::Cryptography::Oid*)> __System_Security_Cryptography_X509Certificates_PublicKeySizeCheck;
  static_assert(sizeof(PublicKey) == 0x30);
}
DEFINE_IL2CPP_ARG_TYPE(System::Security::Cryptography::X509Certificates::PublicKey*, "System.Security.Cryptography.X509Certificates", "PublicKey");
