// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Security.Cryptography.X509Certificates.X509ChainImpl
#include "System/Security/Cryptography/X509Certificates/X509ChainImpl.hpp"
// Including type: System.Security.Cryptography.X509Certificates.StoreLocation
#include "System/Security/Cryptography/X509Certificates/StoreLocation.hpp"
// Including type: Mono.Security.X509.X509Crl
#include "Mono/Security/X509/X509Crl.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509ChainElementCollection
  class X509ChainElementCollection;
  // Forward declaring type: X509ChainPolicy
  class X509ChainPolicy;
  // Forward declaring type: X500DistinguishedName
  class X500DistinguishedName;
  // Forward declaring type: X509ChainElement
  class X509ChainElement;
  // Forward declaring type: X509Certificate2Collection
  class X509Certificate2Collection;
  // Forward declaring type: X509Store
  class X509Store;
  // Skipping declaration: X509ChainStatusFlags because it is already included!
  // Forward declaring type: X509Certificate2
  class X509Certificate2;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: AsymmetricAlgorithm
  class AsymmetricAlgorithm;
}
// Forward declaring namespace: Mono::Security::X509
namespace Mono::Security::X509 {
  // Forward declaring type: X509Extension
  class X509Extension;
  // Forward declaring type: X509Store
  class X509Store;
}
// Completed forward declares
// Type namespace: System.Security.Cryptography.X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: System.Security.Cryptography.X509Certificates.X509ChainImplMono
  class X509ChainImplMono : public System::Security::Cryptography::X509Certificates::X509ChainImpl {
    public:
    // private System.Security.Cryptography.X509Certificates.StoreLocation location
    // Size: 0x4
    // Offset: 0x10
    System::Security::Cryptography::X509Certificates::StoreLocation location;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::StoreLocation) == 0x4);
    // Padding between fields: location and: elements
    char __padding0[0x4] = {};
    // private System.Security.Cryptography.X509Certificates.X509ChainElementCollection elements
    // Size: 0x8
    // Offset: 0x18
    System::Security::Cryptography::X509Certificates::X509ChainElementCollection* elements;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509ChainElementCollection*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509ChainPolicy policy
    // Size: 0x8
    // Offset: 0x20
    System::Security::Cryptography::X509Certificates::X509ChainPolicy* policy;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509ChainPolicy*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509ChainStatus[] status
    // Size: 0x8
    // Offset: 0x28
    ::Array<System::Security::Cryptography::X509Certificates::X509ChainStatus>* status;
    // Field size check
    static_assert(sizeof(::Array<System::Security::Cryptography::X509Certificates::X509ChainStatus>*) == 0x8);
    // private System.Int32 max_path_length
    // Size: 0x4
    // Offset: 0x30
    int max_path_length;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: max_path_length and: working_issuer_name
    char __padding4[0x4] = {};
    // private System.Security.Cryptography.X509Certificates.X500DistinguishedName working_issuer_name
    // Size: 0x8
    // Offset: 0x38
    System::Security::Cryptography::X509Certificates::X500DistinguishedName* working_issuer_name;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X500DistinguishedName*) == 0x8);
    // private System.Security.Cryptography.AsymmetricAlgorithm working_public_key
    // Size: 0x8
    // Offset: 0x40
    System::Security::Cryptography::AsymmetricAlgorithm* working_public_key;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::AsymmetricAlgorithm*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509ChainElement bce_restriction
    // Size: 0x8
    // Offset: 0x48
    System::Security::Cryptography::X509Certificates::X509ChainElement* bce_restriction;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509ChainElement*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Certificate2Collection roots
    // Size: 0x8
    // Offset: 0x50
    System::Security::Cryptography::X509Certificates::X509Certificate2Collection* roots;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Certificate2Collection*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Certificate2Collection cas
    // Size: 0x8
    // Offset: 0x58
    System::Security::Cryptography::X509Certificates::X509Certificate2Collection* cas;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Certificate2Collection*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Store root_store
    // Size: 0x8
    // Offset: 0x60
    System::Security::Cryptography::X509Certificates::X509Store* root_store;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Store*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Store ca_store
    // Size: 0x8
    // Offset: 0x68
    System::Security::Cryptography::X509Certificates::X509Store* ca_store;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Store*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Store user_root_store
    // Size: 0x8
    // Offset: 0x70
    System::Security::Cryptography::X509Certificates::X509Store* user_root_store;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Store*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Store user_ca_store
    // Size: 0x8
    // Offset: 0x78
    System::Security::Cryptography::X509Certificates::X509Store* user_ca_store;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Store*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Certificate2Collection collection
    // Size: 0x8
    // Offset: 0x80
    System::Security::Cryptography::X509Certificates::X509Certificate2Collection* collection;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Certificate2Collection*) == 0x8);
    // Creating value type constructor for type: X509ChainImplMono
