// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Security.Cryptography.X509Certificates.X509Certificate2Impl
#include "System/Security/Cryptography/X509Certificates/X509Certificate2Impl.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509ExtensionCollection
  class X509ExtensionCollection;
  // Forward declaring type: PublicKey
  class PublicKey;
  // Forward declaring type: X500DistinguishedName
  class X500DistinguishedName;
  // Forward declaring type: X509CertificateImplCollection
  class X509CertificateImplCollection;
  // Skipping declaration: X509CertificateImpl because it is already included!
  // Forward declaring type: X509NameType
  struct X509NameType;
  // Forward declaring type: X509KeyStorageFlags
  struct X509KeyStorageFlags;
  // Forward declaring type: X509Certificate2
  class X509Certificate2;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: Oid
  class Oid;
  // Forward declaring type: AsymmetricAlgorithm
  class AsymmetricAlgorithm;
}
// Forward declaring namespace: Mono::Security::X509
namespace Mono::Security::X509 {
  // Forward declaring type: X509Certificate
  class X509Certificate;
}
// Forward declaring namespace: Mono::Security
namespace Mono::Security {
  // Forward declaring type: ASN1
  class ASN1;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: DateTime
  struct DateTime;
}
// Completed forward declares
// Type namespace: System.Security.Cryptography.X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: System.Security.Cryptography.X509Certificates.X509Certificate2ImplMono
  class X509Certificate2ImplMono : public System::Security::Cryptography::X509Certificates::X509Certificate2Impl {
    public:
    // private System.Boolean _archived
    // Size: 0x1
    // Offset: 0x18
    bool archived;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: archived and: extensions
    char __padding0[0x7] = {};
    // private System.Security.Cryptography.X509Certificates.X509ExtensionCollection _extensions
    // Size: 0x8
    // Offset: 0x20
    System::Security::Cryptography::X509Certificates::X509ExtensionCollection* extensions;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509ExtensionCollection*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.PublicKey _publicKey
    // Size: 0x8
    // Offset: 0x28
    System::Security::Cryptography::X509Certificates::PublicKey* publicKey;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::PublicKey*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X500DistinguishedName issuer_name
    // Size: 0x8
    // Offset: 0x30
    System::Security::Cryptography::X509Certificates::X500DistinguishedName* issuer_name;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X500DistinguishedName*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X500DistinguishedName subject_name
    // Size: 0x8
    // Offset: 0x38
    System::Security::Cryptography::X509Certificates::X500DistinguishedName* subject_name;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X500DistinguishedName*) == 0x8);
    // private System.Security.Cryptography.Oid signature_algorithm
    // Size: 0x8
    // Offset: 0x40
    System::Security::Cryptography::Oid* signature_algorithm;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::Oid*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509CertificateImplCollection intermediateCerts
    // Size: 0x8
    // Offset: 0x48
    System::Security::Cryptography::X509Certificates::X509CertificateImplCollection* intermediateCerts;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509CertificateImplCollection*) == 0x8);
    // private Mono.Security.X509.X509Certificate _cert
    // Size: 0x8
    // Offset: 0x50
    Mono::Security::X509::X509Certificate* cert;
    // Field size check
    static_assert(sizeof(Mono::Security::X509::X509Certificate*) == 0x8);
    // Creating value type constructor for type: X509Certificate2ImplMono
