// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include <stdint.h>
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin il2cpp-utils forward declares
struct Il2CppString;
// Completed il2cpp-utils forward declares
// Type namespace: NetEase.Docker
namespace NetEase::Docker {
  // Autogenerated type: NetEase.Docker.UploadScoreData
  struct UploadScoreData : public System::ValueType {
    public:
    // private System.String <Track>k__BackingField
    // Offset: 0x0
    ::Il2CppString* Track;
    // private System.Int32 <Difficulty>k__BackingField
    // Offset: 0x8
    int Difficulty;
    // private System.Int32 <Score>k__BackingField
    // Offset: 0xC
    int Score;
    // private System.Int64 <TimeStamp>k__BackingField
    // Offset: 0x10
    int64_t TimeStamp;
    // private System.Boolean <PlayedUntilEnd>k__BackingField
    // Offset: 0x18
    bool PlayedUntilEnd;
    // private System.Single <AccuracyPercentage>k__BackingField
    // Offset: 0x1C
    float AccuracyPercentage;
    // private System.Int32 <NoOfHits>k__BackingField
    // Offset: 0x20
    int NoOfHits;
    // private System.Int32 <NoOfMisses>k__BackingField
    // Offset: 0x24
    int NoOfMisses;
    // private System.Int32 <NoOfBombsHit>k__BackingField
    // Offset: 0x28
    int NoOfBombsHit;
    // Creating value type constructor for type: UploadScoreData
    constexpr UploadScoreData(::Il2CppString* Track_ = {}, int Difficulty_ = {}, int Score_ = {}, int64_t TimeStamp_ = {}, bool PlayedUntilEnd_ = {}, float AccuracyPercentage_ = {}, int NoOfHits_ = {}, int NoOfMisses_ = {}, int NoOfBombsHit_ = {}) noexcept : Track{Track_}, Difficulty{Difficulty_}, Score{Score_}, TimeStamp{TimeStamp_}, PlayedUntilEnd{PlayedUntilEnd_}, AccuracyPercentage{AccuracyPercentage_}, NoOfHits{NoOfHits_}, NoOfMisses{NoOfMisses_}, NoOfBombsHit{NoOfBombsHit_} {}
    // public System.Void set_Track(System.String value)
    // Offset: 0xA609E0
    void set_Track(::Il2CppString* value);
    // public System.Void set_Score(System.Int32 value)
    // Offset: 0xA609E8
    void set_Score(int value);
  }; // NetEase.Docker.UploadScoreData
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(NetEase::Docker::UploadScoreData, "NetEase.Docker", "UploadScoreData");
#pragma pack(pop)
