// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: Zenject.AddToGameObjectComponentProviderBase
#include "Zenject/AddToGameObjectComponentProviderBase.hpp"
// Including type: Zenject.TypeValuePair
#include "Zenject/TypeValuePair.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: InjectContext
  class InjectContext;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: Zenject
namespace Zenject {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: Zenject.AddToGameObjectComponentProviderBase/Zenject.<>c__DisplayClass17_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: FFFFFFFF
  class AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0 : public ::Il2CppObject {
    public:
    // public Zenject.AddToGameObjectComponentProviderBase <>4__this
    // Size: 0x8
    // Offset: 0x10
    Zenject::AddToGameObjectComponentProviderBase* $$4__this;
    // Field size check
    static_assert(sizeof(Zenject::AddToGameObjectComponentProviderBase*) == 0x8);
    // public System.Collections.Generic.List`1<Zenject.TypeValuePair> args
    // Size: 0x8
    // Offset: 0x18
    System::Collections::Generic::List_1<Zenject::TypeValuePair>* args;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<Zenject::TypeValuePair>*) == 0x8);
    // public System.Object instance
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* instance;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public Zenject.InjectContext context
    // Size: 0x8
    // Offset: 0x28
    Zenject::InjectContext* context;
    // Field size check
    static_assert(sizeof(Zenject::InjectContext*) == 0x8);
    // public System.Boolean wasActive
    // Size: 0x1
    // Offset: 0x30
    bool wasActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasActive and: gameObj
    char __padding4[0x7] = {};
    // public UnityEngine.GameObject gameObj
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::GameObject* gameObj;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // Creating value type constructor for type: $$c__DisplayClass17_0
    $$c__DisplayClass17_0(Zenject::AddToGameObjectComponentProviderBase* $$4__this_ = {}, System::Collections::Generic::List_1<Zenject::TypeValuePair>* args_ = {}, ::Il2CppObject* instance_ = {}, Zenject::InjectContext* context_ = {}, bool wasActive_ = {}, UnityEngine::GameObject* gameObj_ = {}) noexcept : $$4__this{$$4__this_}, args{args_}, instance{instance_}, context{context_}, wasActive{wasActive_}, gameObj{gameObj_} {}
    // Get instance field: public Zenject.AddToGameObjectComponentProviderBase <>4__this
    Zenject::AddToGameObjectComponentProviderBase* _get_$$4__this();
    // Set instance field: public Zenject.AddToGameObjectComponentProviderBase <>4__this
    void _set_$$4__this(Zenject::AddToGameObjectComponentProviderBase* value);
    // Get instance field: public System.Collections.Generic.List`1<Zenject.TypeValuePair> args
    System::Collections::Generic::List_1<Zenject::TypeValuePair>* _get_args();
    // Set instance field: public System.Collections.Generic.List`1<Zenject.TypeValuePair> args
    void _set_args(System::Collections::Generic::List_1<Zenject::TypeValuePair>* value);
    // Get instance field: public System.Object instance
    ::Il2CppObject* _get_instance();
    // Set instance field: public System.Object instance
    void _set_instance(::Il2CppObject* value);
    // Get instance field: public Zenject.InjectContext context
    Zenject::InjectContext* _get_context();
    // Set instance field: public Zenject.InjectContext context
    void _set_context(Zenject::InjectContext* value);
    // Get instance field: public System.Boolean wasActive
    bool _get_wasActive();
    // Set instance field: public System.Boolean wasActive
    void _set_wasActive(bool value);
    // Get instance field: public UnityEngine.GameObject gameObj
    UnityEngine::GameObject* _get_gameObj();
    // Set instance field: public UnityEngine.GameObject gameObj
    void _set_gameObj(UnityEngine::GameObject* value);
    // System.Void <GetAllInstancesWithInjectSplit>b__0()
    // Offset: 0x13DA518
    void $GetAllInstancesWithInjectSplit$b__0();
    // public System.Void .ctor()
    // Offset: 0x13DA510
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("Zenject::AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0*, creationType>()));
    }
  }; // Zenject.AddToGameObjectComponentProviderBase/Zenject.<>c__DisplayClass17_0
  #pragma pack(pop)
  static check_size<sizeof(AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0), 56 + sizeof(UnityEngine::GameObject*)> __Zenject_AddToGameObjectComponentProviderBase_$$c__DisplayClass17_0SizeCheck;
  static_assert(sizeof(AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(Zenject::AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0*, "Zenject", "AddToGameObjectComponentProviderBase/<>c__DisplayClass17_0");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Zenject::AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0::$GetAllInstancesWithInjectSplit$b__0
// Il2CppName: <GetAllInstancesWithInjectSplit>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Zenject::AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0::*)()>(&Zenject::AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0::$GetAllInstancesWithInjectSplit$b__0)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Zenject::AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0*), "<GetAllInstancesWithInjectSplit>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Zenject::AddToGameObjectComponentProviderBase::$$c__DisplayClass17_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
