// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: Zenject.BindingInheritanceMethods
#include "Zenject/BindingInheritanceMethods.hpp"
// Including type: Zenject.InvalidBindResponses
#include "Zenject/InvalidBindResponses.hpp"
// Including type: Zenject.ToChoices
#include "Zenject/ToChoices.hpp"
// Including type: Zenject.ScopeTypes
#include "Zenject/ScopeTypes.hpp"
// Including type: Zenject.TypeValuePair
#include "Zenject/TypeValuePair.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: BindingCondition
  class BindingCondition;
  // Forward declaring type: InjectContext
  class InjectContext;
}
// Completed forward declares
// Type namespace: Zenject
namespace Zenject {
  // Autogenerated type: Zenject.BindInfo
  class BindInfo : public ::Il2CppObject, public System::IDisposable {
    public:
    // public System.Boolean MarkAsCreationBinding
    // Offset: 0x10
    bool MarkAsCreationBinding;
    // public System.Boolean MarkAsUniqueSingleton
    // Offset: 0x11
    bool MarkAsUniqueSingleton;
    // public System.Object ConcreteIdentifier
    // Offset: 0x18
    ::Il2CppObject* ConcreteIdentifier;
    // public System.Boolean SaveProvider
    // Offset: 0x20
    bool SaveProvider;
    // public System.Boolean OnlyBindIfNotBound
    // Offset: 0x21
    bool OnlyBindIfNotBound;
    // public System.Boolean RequireExplicitScope
    // Offset: 0x22
    bool RequireExplicitScope;
    // public System.Object Identifier
    // Offset: 0x28
    ::Il2CppObject* Identifier;
    // public readonly System.Collections.Generic.List`1<System.Type> ContractTypes
    // Offset: 0x30
    System::Collections::Generic::List_1<System::Type*>* ContractTypes;
    // public Zenject.BindingInheritanceMethods BindingInheritanceMethod
    // Offset: 0x38
    Zenject::BindingInheritanceMethods BindingInheritanceMethod;
    // public Zenject.InvalidBindResponses InvalidBindResponse
    // Offset: 0x3C
    Zenject::InvalidBindResponses InvalidBindResponse;
    // public System.Boolean NonLazy
    // Offset: 0x40
    bool NonLazy;
    // public Zenject.BindingCondition Condition
    // Offset: 0x48
    Zenject::BindingCondition* Condition;
    // public Zenject.ToChoices ToChoice
    // Offset: 0x50
    Zenject::ToChoices ToChoice;
    // public System.String ContextInfo
    // Offset: 0x58
    ::Il2CppString* ContextInfo;
    // public readonly System.Collections.Generic.List`1<System.Type> ToTypes
    // Offset: 0x60
    System::Collections::Generic::List_1<System::Type*>* ToTypes;
    // public Zenject.ScopeTypes Scope
    // Offset: 0x68
    Zenject::ScopeTypes Scope;
    // public readonly System.Collections.Generic.List`1<Zenject.TypeValuePair> Arguments
    // Offset: 0x70
    System::Collections::Generic::List_1<Zenject::TypeValuePair>* Arguments;
    // public System.Action`2<Zenject.InjectContext,System.Object> InstantiatedCallback
    // Offset: 0x78
    System::Action_2<Zenject::InjectContext*, ::Il2CppObject*>* InstantiatedCallback;
    // public System.Void SetContextInfo(System.String contextInfo)
    // Offset: 0xD68BAC
    void SetContextInfo(::Il2CppString* contextInfo);
    // public System.Void Reset()
    // Offset: 0xD68A44
    void Reset();
    // public System.Void .ctor()
    // Offset: 0xD68960
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static BindInfo* New_ctor();
    // public System.Void Dispose()
    // Offset: 0xD68B44
    // Implemented from: System.IDisposable
    // Base method: System.Void IDisposable::Dispose()
    void Dispose();
    // Creating proxy method: System_IDisposable_Dispose
    // Maps to method: Dispose
    void System_IDisposable_Dispose();
  }; // Zenject.BindInfo
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Zenject::BindInfo*, "Zenject", "BindInfo");
#pragma pack(pop)
