// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
// Including type: Zenject.IInstantiator
#include "Zenject/IInstantiator.hpp"
// Including type: Zenject.BindingId
#include "Zenject/BindingId.hpp"
// Including type: Zenject.TypeValuePair
#include "Zenject/TypeValuePair.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: LazyInstanceInjector
  class LazyInstanceInjector;
  // Forward declaring type: BindStatement
  class BindStatement;
  // Forward declaring type: IValidatable
  class IValidatable;
  // Forward declaring type: ZenjectSettings
  class ZenjectSettings;
  // Forward declaring type: IProvider
  class IProvider;
  // Forward declaring type: InjectContext
  class InjectContext;
  // Forward declaring type: BindingCondition
  class BindingCondition;
  // Forward declaring type: InjectSources
  struct InjectSources;
  // Forward declaring type: Installer
  class Installer;

  template<typename TParam1, typename TParam2, typename TParam3, typename TParam4, typename TParam5, typename TParam6, typename TParam7, typename TParam8, typename TParam9, typename TParam10, typename TContract>
  class FactoryToChoiceIdBinder_11;
  // Forward declaring type: PlaceholderFactory`11<TParam1, TParam2, TParam3, TParam4, TParam5, TParam6, TParam7, TParam8, TParam9, TParam10, TValue>
  template<typename TParam1, typename TParam2, typename TParam3, typename TParam4, typename TParam5, typename TParam6, typename TParam7, typename TParam8, typename TParam9, typename TParam10, typename TValue>
  class PlaceholderFactory_11;
  // Forward declaring type: ITickable
  class ITickable;
  // Forward declaring type: CopyNonLazyBinder
  class CopyNonLazyBinder;
  // Forward declaring type: IInitializable
  class IInitializable;
  // Forward declaring type: ILateDisposable
  class ILateDisposable;
  // Forward declaring type: IFixedTickable
  class IFixedTickable;
  // Forward declaring type: ILateTickable
  class ILateTickable;
  // Forward declaring type: IPoolable
  class IPoolable;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: IDisposable
  class IDisposable;
}
// Forward declaring namespace: Zenject::Internal
namespace Zenject::Internal {
  // Forward declaring type: IDecoratorProvider
  class IDecoratorProvider;
  // Forward declaring type: LookupId
  class LookupId;
  // Forward declaring type: SingletonMarkRegistry
  class SingletonMarkRegistry;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Object
  class Object;
  // Forward declaring type: Component
  class Component;
  // Forward declaring type: ScriptableObject
  class ScriptableObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IList
  class IList;
}
// Completed forward declares
// Type namespace: Zenject
namespace Zenject {
  // Size: 0x9D
  #pragma pack(push, 1)
  // Autogenerated type: Zenject.DiContainer
  // [NoReflectionBakingAttribute] Offset: CEF33C
  class DiContainer : public ::Il2CppObject/*, public Zenject::IInstantiator*/ {
    public:
    // Nested type: Zenject::DiContainer::ProviderInfo
    class ProviderInfo;
    // Nested type: Zenject::DiContainer::$$c
    class $$c;
    // Nested type: Zenject::DiContainer::$$c__DisplayClass86_0
    class $$c__DisplayClass86_0;
    // Nested type: Zenject::DiContainer::$GetDependencyContracts$d__96
    class $GetDependencyContracts$d__96;
    // Nested type: Zenject::DiContainer::$$c__DisplayClass178_0
    class $$c__DisplayClass178_0;
    // Nested type: Zenject::DiContainer::$$c__DisplayClass203_0_1<TContract>
    template<typename TContract>
    class $$c__DisplayClass203_0_1;
    // private readonly System.Collections.Generic.Dictionary`2<System.Type,Zenject.Internal.IDecoratorProvider> _decorators
    // Size: 0x8
    // Offset: 0x10
    System::Collections::Generic::Dictionary_2<System::Type*, Zenject::Internal::IDecoratorProvider*>* decorators;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<System::Type*, Zenject::Internal::IDecoratorProvider*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<Zenject.BindingId,System.Collections.Generic.List`1<Zenject.DiContainer/ProviderInfo>> _providers
    // Size: 0x8
    // Offset: 0x18
    System::Collections::Generic::Dictionary_2<Zenject::BindingId, System::Collections::Generic::List_1<Zenject::DiContainer::ProviderInfo*>*>* providers;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<Zenject::BindingId, System::Collections::Generic::List_1<Zenject::DiContainer::ProviderInfo*>*>*) == 0x8);
    // private readonly Zenject.DiContainer[][] _containerLookups
    // Size: 0x8
    // Offset: 0x20
    ::Array<::Array<Zenject::DiContainer*>*>* containerLookups;
    // Field size check
    static_assert(sizeof(::Array<::Array<Zenject::DiContainer*>*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<Zenject.Internal.LookupId> _resolvesInProgress
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Generic::HashSet_1<Zenject::Internal::LookupId*>* resolvesInProgress;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<Zenject::Internal::LookupId*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<Zenject.Internal.LookupId> _resolvesTwiceInProgress
    // Size: 0x8
    // Offset: 0x30
    System::Collections::Generic::HashSet_1<Zenject::Internal::LookupId*>* resolvesTwiceInProgress;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<Zenject::Internal::LookupId*>*) == 0x8);
    // private readonly Zenject.LazyInstanceInjector _lazyInjector
    // Size: 0x8
    // Offset: 0x38
    Zenject::LazyInstanceInjector* lazyInjector;
    // Field size check
    static_assert(sizeof(Zenject::LazyInstanceInjector*) == 0x8);
    // private readonly Zenject.Internal.SingletonMarkRegistry _singletonMarkRegistry
    // Size: 0x8
    // Offset: 0x40
    Zenject::Internal::SingletonMarkRegistry* singletonMarkRegistry;
    // Field size check
    static_assert(sizeof(Zenject::Internal::SingletonMarkRegistry*) == 0x8);
    // private readonly System.Collections.Generic.Queue`1<Zenject.BindStatement> _currentBindings
    // Size: 0x8
    // Offset: 0x48
    System::Collections::Generic::Queue_1<Zenject::BindStatement*>* currentBindings;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Queue_1<Zenject::BindStatement*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<Zenject.BindStatement> _childBindings
    // Size: 0x8
    // Offset: 0x50
    System::Collections::Generic::List_1<Zenject::BindStatement*>* childBindings;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<Zenject::BindStatement*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<System.Type> _validatedTypes
    // Size: 0x8
    // Offset: 0x58
    System::Collections::Generic::HashSet_1<System::Type*>* validatedTypes;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<System::Type*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<Zenject.IValidatable> _validationQueue
    // Size: 0x8
    // Offset: 0x60
    System::Collections::Generic::List_1<Zenject::IValidatable*>* validationQueue;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<Zenject::IValidatable*>*) == 0x8);
    // private UnityEngine.Transform _contextTransform
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::Transform* contextTransform;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private System.Boolean _hasLookedUpContextTransform
    // Size: 0x1
    // Offset: 0x70
    bool hasLookedUpContextTransform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasLookedUpContextTransform and: inheritedDefaultParent
    char __padding12[0x7] = {};
    // private UnityEngine.Transform _inheritedDefaultParent
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::Transform* inheritedDefaultParent;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _explicitDefaultParent
    // Size: 0x8
    // Offset: 0x80
    UnityEngine::Transform* explicitDefaultParent;
    // Field size check
    static_assert(sizeof(UnityEngine::Transform*) == 0x8);
    // private System.Boolean _hasExplicitDefaultParent
    // Size: 0x1
    // Offset: 0x88
    bool hasExplicitDefaultParent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasExplicitDefaultParent and: settings
    char __padding15[0x7] = {};
    // private Zenject.ZenjectSettings _settings
    // Size: 0x8
    // Offset: 0x90
    Zenject::ZenjectSettings* settings;
    // Field size check
    static_assert(sizeof(Zenject::ZenjectSettings*) == 0x8);
    // private System.Boolean _hasResolvedRoots
    // Size: 0x1
    // Offset: 0x98
    bool hasResolvedRoots;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isFinalizingBinding
    // Size: 0x1
    // Offset: 0x99
    bool isFinalizingBinding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isValidating
    // Size: 0x1
    // Offset: 0x9A
    bool isValidating;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isInstalling
    // Size: 0x1
    // Offset: 0x9B
    bool isInstalling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xCF165C
    // private System.Boolean <AssertOnNewGameObjects>k__BackingField
    // Size: 0x1
    // Offset: 0x9C
    bool AssertOnNewGameObjects;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: DiContainer
