// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Zenject
namespace Zenject {
  // Skipping declaration: <>c__DisplayClass23_0 because it is already included!
  // Skipping declaration: <>c__DisplayClass25_0 because it is already included!
  // Skipping declaration: <>c__DisplayClass27_0 because it is already included!
  // Skipping declaration: <>c__DisplayClass29_0 because it is already included!
  // Forward declaring type: DiContainer
  class DiContainer;
  // Forward declaring type: FactoryBindInfo
  class FactoryBindInfo;
  // Forward declaring type: BindInfo
  class BindInfo;
  // Forward declaring type: IProvider
  class IProvider;
  // Forward declaring type: InstallerBase
  class InstallerBase;
  // Forward declaring type: ScopeConcreteIdArgConditionCopyNonLazyBinder
  class ScopeConcreteIdArgConditionCopyNonLazyBinder;
  // Forward declaring type: NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder
  class NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder;
  // Forward declaring type: SubContainerCreatorBindInfo
  class SubContainerCreatorBindInfo;
  // Forward declaring type: GameObjectCreationParameters
  class GameObjectCreationParameters;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Object
  class Object;
}
// Completed forward declares
// Type namespace: Zenject
namespace Zenject {
  // Autogenerated type: Zenject.FactorySubContainerBinderBase`1
  template<typename TContract>
  class FactorySubContainerBinderBase_1 : public ::Il2CppObject {
    public:
    // Nested type: Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0<TContract>
    class $$c__DisplayClass23_0;
    // Nested type: Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0<TContract>
    class $$c__DisplayClass25_0;
    // Nested type: Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0<TContract>
    class $$c__DisplayClass27_0;
    // Nested type: Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0<TContract>
    class $$c__DisplayClass29_0;
    // Autogenerated type: Zenject.FactorySubContainerBinderBase`1/<>c__DisplayClass23_0
    class $$c__DisplayClass23_0 : public ::Il2CppObject, public ::il2cpp_utils::il2cpp_type_check::NestedType {
      public:
      using declaring_type = FactorySubContainerBinderBase_1<TContract>*;
      // public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      // Offset: 0x0
      Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this;
      // public Zenject.SubContainerCreatorBindInfo subcontainerBindInfo
      // Offset: 0x0
      Zenject::SubContainerCreatorBindInfo* subcontainerBindInfo;
      // public System.Type installerType
      // Offset: 0x0
      System::Type* installerType;
      // Zenject.IProvider <ByInstaller>b__0(Zenject.DiContainer container)
      // Offset: 0xFFFFFFFF
      Zenject::IProvider* $ByInstaller$b__0(Zenject::DiContainer* container) {
        return THROW_UNLESS((il2cpp_utils::RunMethod<Zenject::IProvider*>(this, "<ByInstaller>b__0", container)));
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      static typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass23_0* New_ctor() {
        return (typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass23_0*)THROW_UNLESS(il2cpp_utils::New(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass23_0*>::get()));
      }
    }; // Zenject.FactorySubContainerBinderBase`1/<>c__DisplayClass23_0
    // Autogenerated type: Zenject.FactorySubContainerBinderBase`1/<>c__DisplayClass25_0
    class $$c__DisplayClass25_0 : public ::Il2CppObject, public ::il2cpp_utils::il2cpp_type_check::NestedType {
      public:
      using declaring_type = FactorySubContainerBinderBase_1<TContract>*;
      // public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      // Offset: 0x0
      Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this;
      // public Zenject.GameObjectCreationParameters gameObjectInfo
      // Offset: 0x0
      Zenject::GameObjectCreationParameters* gameObjectInfo;
      // public System.Type installerType
      // Offset: 0x0
      System::Type* installerType;
      // Zenject.IProvider <ByNewGameObjectInstaller>b__0(Zenject.DiContainer container)
      // Offset: 0xFFFFFFFF
      Zenject::IProvider* $ByNewGameObjectInstaller$b__0(Zenject::DiContainer* container) {
        return THROW_UNLESS((il2cpp_utils::RunMethod<Zenject::IProvider*>(this, "<ByNewGameObjectInstaller>b__0", container)));
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      static typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass25_0* New_ctor() {
        return (typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass25_0*)THROW_UNLESS(il2cpp_utils::New(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass25_0*>::get()));
      }
    }; // Zenject.FactorySubContainerBinderBase`1/<>c__DisplayClass25_0
    // Autogenerated type: Zenject.FactorySubContainerBinderBase`1/<>c__DisplayClass27_0
    class $$c__DisplayClass27_0 : public ::Il2CppObject, public ::il2cpp_utils::il2cpp_type_check::NestedType {
      public:
      using declaring_type = FactorySubContainerBinderBase_1<TContract>*;
      // public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      // Offset: 0x0
      Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this;
      // public UnityEngine.Object prefab
      // Offset: 0x0
      UnityEngine::Object* prefab;
      // public Zenject.GameObjectCreationParameters gameObjectInfo
      // Offset: 0x0
      Zenject::GameObjectCreationParameters* gameObjectInfo;
      // public System.Type installerType
      // Offset: 0x0
      System::Type* installerType;
      // Zenject.IProvider <ByNewPrefabInstaller>b__0(Zenject.DiContainer container)
      // Offset: 0xFFFFFFFF
      Zenject::IProvider* $ByNewPrefabInstaller$b__0(Zenject::DiContainer* container) {
        return THROW_UNLESS((il2cpp_utils::RunMethod<Zenject::IProvider*>(this, "<ByNewPrefabInstaller>b__0", container)));
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      static typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass27_0* New_ctor() {
        return (typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass27_0*)THROW_UNLESS(il2cpp_utils::New(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass27_0*>::get()));
      }
    }; // Zenject.FactorySubContainerBinderBase`1/<>c__DisplayClass27_0
    // Autogenerated type: Zenject.FactorySubContainerBinderBase`1/<>c__DisplayClass29_0
    class $$c__DisplayClass29_0 : public ::Il2CppObject, public ::il2cpp_utils::il2cpp_type_check::NestedType {
      public:
      using declaring_type = FactorySubContainerBinderBase_1<TContract>*;
      // public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      // Offset: 0x0
      Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this;
      // public System.String resourcePath
      // Offset: 0x0
      ::Il2CppString* resourcePath;
      // public Zenject.GameObjectCreationParameters gameObjectInfo
      // Offset: 0x0
      Zenject::GameObjectCreationParameters* gameObjectInfo;
      // public System.Type installerType
      // Offset: 0x0
      System::Type* installerType;
      // Zenject.IProvider <ByNewPrefabResourceInstaller>b__0(Zenject.DiContainer container)
      // Offset: 0xFFFFFFFF
      Zenject::IProvider* $ByNewPrefabResourceInstaller$b__0(Zenject::DiContainer* container) {
        return THROW_UNLESS((il2cpp_utils::RunMethod<Zenject::IProvider*>(this, "<ByNewPrefabResourceInstaller>b__0", container)));
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      static typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass29_0* New_ctor() {
        return (typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass29_0*)THROW_UNLESS(il2cpp_utils::New(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass29_0*>::get()));
      }
    }; // Zenject.FactorySubContainerBinderBase`1/<>c__DisplayClass29_0
    // private Zenject.DiContainer <BindContainer>k__BackingField
    // Offset: 0x0
    Zenject::DiContainer* BindContainer;
    // private Zenject.FactoryBindInfo <FactoryBindInfo>k__BackingField
    // Offset: 0x0
    Zenject::FactoryBindInfo* FactoryBindInfo;
    // private Zenject.BindInfo <BindInfo>k__BackingField
    // Offset: 0x0
    Zenject::BindInfo* BindInfo;
    // private System.Object <SubIdentifier>k__BackingField
    // Offset: 0x0
    ::Il2CppObject* SubIdentifier;
    // public System.Void .ctor(Zenject.DiContainer bindContainer, Zenject.BindInfo bindInfo, Zenject.FactoryBindInfo factoryBindInfo, System.Object subIdentifier)
    // Offset: 0xFFFFFFFF
    static FactorySubContainerBinderBase_1<TContract>* New_ctor(Zenject::DiContainer* bindContainer, Zenject::BindInfo* bindInfo, Zenject::FactoryBindInfo* factoryBindInfo, ::Il2CppObject* subIdentifier) {
      return (FactorySubContainerBinderBase_1<TContract>*)THROW_UNLESS(il2cpp_utils::New(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<FactorySubContainerBinderBase_1<TContract>*>::get(), bindContainer, bindInfo, factoryBindInfo, subIdentifier));
    }
    // protected Zenject.DiContainer get_BindContainer()
    // Offset: 0xFFFFFFFF
    Zenject::DiContainer* get_BindContainer() {
      return THROW_UNLESS(il2cpp_utils::RunMethod<Zenject::DiContainer*>(this, "get_BindContainer"));
    }
    // private System.Void set_BindContainer(Zenject.DiContainer value)
    // Offset: 0xFFFFFFFF
    void set_BindContainer(Zenject::DiContainer* value) {
      THROW_UNLESS(il2cpp_utils::RunMethod(this, "set_BindContainer", value));
    }
    // protected Zenject.FactoryBindInfo get_FactoryBindInfo()
    // Offset: 0xFFFFFFFF
    Zenject::FactoryBindInfo* get_FactoryBindInfo() {
      return THROW_UNLESS(il2cpp_utils::RunMethod<Zenject::FactoryBindInfo*>(this, "get_FactoryBindInfo"));
    }
    // private System.Void set_FactoryBindInfo(Zenject.FactoryBindInfo value)
    // Offset: 0xFFFFFFFF
    void set_FactoryBindInfo(Zenject::FactoryBindInfo* value) {
      THROW_UNLESS(il2cpp_utils::RunMethod(this, "set_FactoryBindInfo", value));
    }
    // protected System.Func`2<Zenject.DiContainer,Zenject.IProvider> get_ProviderFunc()
    // Offset: 0xFFFFFFFF
    System::Func_2<Zenject::DiContainer*, Zenject::IProvider*>* get_ProviderFunc() {
      return THROW_UNLESS((il2cpp_utils::RunMethod<System::Func_2<Zenject::DiContainer*, Zenject::IProvider*>*>(this, "get_ProviderFunc")));
    }
    // protected System.Void set_ProviderFunc(System.Func`2<Zenject.DiContainer,Zenject.IProvider> value)
    // Offset: 0xFFFFFFFF
    void set_ProviderFunc(System::Func_2<Zenject::DiContainer*, Zenject::IProvider*>* value) {
      THROW_UNLESS(il2cpp_utils::RunMethod(this, "set_ProviderFunc", value));
    }
    // protected Zenject.BindInfo get_BindInfo()
    // Offset: 0xFFFFFFFF
    Zenject::BindInfo* get_BindInfo() {
      return THROW_UNLESS(il2cpp_utils::RunMethod<Zenject::BindInfo*>(this, "get_BindInfo"));
    }
    // private System.Void set_BindInfo(Zenject.BindInfo value)
    // Offset: 0xFFFFFFFF
    void set_BindInfo(Zenject::BindInfo* value) {
      THROW_UNLESS(il2cpp_utils::RunMethod(this, "set_BindInfo", value));
    }
    // protected System.Object get_SubIdentifier()
    // Offset: 0xFFFFFFFF
    ::Il2CppObject* get_SubIdentifier() {
      return THROW_UNLESS(il2cpp_utils::RunMethod<::Il2CppObject*>(this, "get_SubIdentifier"));
    }
    // private System.Void set_SubIdentifier(System.Object value)
    // Offset: 0xFFFFFFFF
    void set_SubIdentifier(::Il2CppObject* value) {
      THROW_UNLESS(il2cpp_utils::RunMethod(this, "set_SubIdentifier", value));
    }
    // protected System.Type get_ContractType()
    // Offset: 0xFFFFFFFF
    System::Type* get_ContractType() {
      return THROW_UNLESS(il2cpp_utils::RunMethod<System::Type*>(this, "get_ContractType"));
    }
    // public Zenject.ScopeConcreteIdArgConditionCopyNonLazyBinder ByInstaller()
    // Offset: 0xFFFFFFFF
    template<class TInstaller>
    Zenject::ScopeConcreteIdArgConditionCopyNonLazyBinder* ByInstaller() {
      static_assert(std::is_convertible_v<TInstaller, Zenject::InstallerBase*>);
      return THROW_UNLESS((il2cpp_utils::RunGenericMethod<Zenject::ScopeConcreteIdArgConditionCopyNonLazyBinder*>(this, "ByInstaller", {il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<TInstaller>::get()})));
    }
    // public Zenject.ScopeConcreteIdArgConditionCopyNonLazyBinder ByInstaller(System.Type installerType)
    // Offset: 0xFFFFFFFF
    Zenject::ScopeConcreteIdArgConditionCopyNonLazyBinder* ByInstaller(System::Type* installerType) {
      return THROW_UNLESS(il2cpp_utils::RunMethod<Zenject::ScopeConcreteIdArgConditionCopyNonLazyBinder*>(this, "ByInstaller", installerType));
    }
    // public Zenject.NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder ByNewGameObjectInstaller()
    // Offset: 0xFFFFFFFF
    template<class TInstaller>
    Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder* ByNewGameObjectInstaller() {
      static_assert(std::is_convertible_v<TInstaller, Zenject::InstallerBase*>);
      return THROW_UNLESS((il2cpp_utils::RunGenericMethod<Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder*>(this, "ByNewGameObjectInstaller", {il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<TInstaller>::get()})));
    }
    // public Zenject.NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder ByNewGameObjectInstaller(System.Type installerType)
    // Offset: 0xFFFFFFFF
    Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder* ByNewGameObjectInstaller(System::Type* installerType) {
      return THROW_UNLESS(il2cpp_utils::RunMethod<Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder*>(this, "ByNewGameObjectInstaller", installerType));
    }
    // public Zenject.NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder ByNewPrefabInstaller(UnityEngine.Object prefab)
    // Offset: 0xFFFFFFFF
    template<class TInstaller>
    Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder* ByNewPrefabInstaller(UnityEngine::Object* prefab) {
      static_assert(std::is_convertible_v<TInstaller, Zenject::InstallerBase*>);
      return THROW_UNLESS((il2cpp_utils::RunGenericMethod<Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder*>(this, "ByNewPrefabInstaller", {il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<TInstaller>::get()}, prefab)));
    }
    // public Zenject.NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder ByNewPrefabInstaller(UnityEngine.Object prefab, System.Type installerType)
    // Offset: 0xFFFFFFFF
    Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder* ByNewPrefabInstaller(UnityEngine::Object* prefab, System::Type* installerType) {
      return THROW_UNLESS(il2cpp_utils::RunMethod<Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder*>(this, "ByNewPrefabInstaller", prefab, installerType));
    }
    // public Zenject.NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder ByNewPrefabResourceInstaller(System.String resourcePath)
    // Offset: 0xFFFFFFFF
    template<class TInstaller>
    Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder* ByNewPrefabResourceInstaller(::Il2CppString* resourcePath) {
      static_assert(std::is_convertible_v<TInstaller, Zenject::InstallerBase*>);
      return THROW_UNLESS((il2cpp_utils::RunGenericMethod<Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder*>(this, "ByNewPrefabResourceInstaller", {il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<TInstaller>::get()}, resourcePath)));
    }
    // public Zenject.NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder ByNewPrefabResourceInstaller(System.String resourcePath, System.Type installerType)
    // Offset: 0xFFFFFFFF
    Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder* ByNewPrefabResourceInstaller(::Il2CppString* resourcePath, System::Type* installerType) {
      return THROW_UNLESS(il2cpp_utils::RunMethod<Zenject::NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder*>(this, "ByNewPrefabResourceInstaller", resourcePath, installerType));
    }
  }; // Zenject.FactorySubContainerBinderBase`1
}
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(Zenject::FactorySubContainerBinderBase_1, "Zenject", "FactorySubContainerBinderBase`1");
#pragma pack(pop)
