// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Zenject
namespace Zenject {
  // Skipping declaration: <>c__DisplayClass23_0 because it is already included!
  // Skipping declaration: <>c__DisplayClass25_0 because it is already included!
  // Skipping declaration: <>c__DisplayClass27_0 because it is already included!
  // Skipping declaration: <>c__DisplayClass29_0 because it is already included!
  // Forward declaring type: DiContainer
  class DiContainer;
  // Forward declaring type: FactoryBindInfo
  class FactoryBindInfo;
  // Forward declaring type: BindInfo
  class BindInfo;
  // Forward declaring type: IProvider
  class IProvider;
  // Forward declaring type: InstallerBase
  class InstallerBase;
  // Forward declaring type: ScopeConcreteIdArgConditionCopyNonLazyBinder
  class ScopeConcreteIdArgConditionCopyNonLazyBinder;
  // Forward declaring type: NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder
  class NameTransformScopeConcreteIdArgConditionCopyNonLazyBinder;
  // Forward declaring type: SubContainerCreatorBindInfo
  class SubContainerCreatorBindInfo;
  // Forward declaring type: GameObjectCreationParameters
  class GameObjectCreationParameters;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Object
  class Object;
}
// Completed forward declares
// Type namespace: Zenject
namespace Zenject {
  // WARNING Size may be invalid!
  // Autogenerated type: Zenject.FactorySubContainerBinderBase`1
  // [TokenAttribute] Offset: FFFFFFFF
  // [NoReflectionBakingAttribute] Offset: FFFFFFFF
  template<typename TContract>
  class FactorySubContainerBinderBase_1 : public ::Il2CppObject {
    public:
    // Nested type: Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0<TContract>
    class $$c__DisplayClass23_0;
    // Nested type: Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0<TContract>
    class $$c__DisplayClass25_0;
    // Nested type: Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0<TContract>
    class $$c__DisplayClass27_0;
    // Nested type: Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0<TContract>
    class $$c__DisplayClass29_0;
    // WARNING Size may be invalid!
    // Autogenerated type: Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass23_0
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $$c__DisplayClass23_0 : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = FactorySubContainerBinderBase_1<TContract>*;
      static constexpr std::string_view NESTED_NAME = "<>c__DisplayClass23_0";
      // public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      // Size: 0x8
      // Offset: 0x0
      Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this;
      // Field size check
      static_assert(sizeof(Zenject::FactorySubContainerBinderBase_1<TContract>*) == 0x8);
      // public Zenject.SubContainerCreatorBindInfo subcontainerBindInfo
      // Size: 0x8
      // Offset: 0x0
      Zenject::SubContainerCreatorBindInfo* subcontainerBindInfo;
      // Field size check
      static_assert(sizeof(Zenject::SubContainerCreatorBindInfo*) == 0x8);
      // public System.Type installerType
      // Size: 0x8
      // Offset: 0x0
      System::Type* installerType;
      // Field size check
      static_assert(sizeof(System::Type*) == 0x8);
      // Creating value type constructor for type: $$c__DisplayClass23_0
      $$c__DisplayClass23_0(Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this_ = {}, Zenject::SubContainerCreatorBindInfo* subcontainerBindInfo_ = {}, System::Type* installerType_ = {}) noexcept : $$4__this{$$4__this_}, subcontainerBindInfo{subcontainerBindInfo_}, installerType{installerType_} {}
      // Autogenerated instance field getter
      // Get instance field: public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      Zenject::FactorySubContainerBinderBase_1<TContract>* _get_$$4__this() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0::_get_$$4__this");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<Zenject::FactorySubContainerBinderBase_1<TContract>*>(___internal__instance, "<>4__this")));
      }
      // Autogenerated instance field setter
      // Set instance field: public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      void _set_$$4__this(Zenject::FactorySubContainerBinderBase_1<TContract>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0::_set_$$4__this");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<>4__this", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public Zenject.SubContainerCreatorBindInfo subcontainerBindInfo
      Zenject::SubContainerCreatorBindInfo* _get_subcontainerBindInfo() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0::_get_subcontainerBindInfo");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<Zenject::SubContainerCreatorBindInfo*>(___internal__instance, "subcontainerBindInfo"));
      }
      // Autogenerated instance field setter
      // Set instance field: public Zenject.SubContainerCreatorBindInfo subcontainerBindInfo
      void _set_subcontainerBindInfo(Zenject::SubContainerCreatorBindInfo* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0::_set_subcontainerBindInfo");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "subcontainerBindInfo", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Type installerType
      System::Type* _get_installerType() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0::_get_installerType");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<System::Type*>(___internal__instance, "installerType"));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.Type installerType
      void _set_installerType(System::Type* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0::_set_installerType");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "installerType", value));
      }
      // Zenject.IProvider <ByInstaller>b__0(Zenject.DiContainer container)
      // Offset: 0xFFFFFFFF
      Zenject::IProvider* $ByInstaller$b__0(Zenject::DiContainer* container) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0::<ByInstaller>b__0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<ByInstaller>b__0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(container)})));
        return ::il2cpp_utils::RunMethodThrow<Zenject::IProvider*, false>(this, ___internal__method, container);
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass23_0* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass23_0::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass23_0*, creationType>()));
      }
    }; // Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass23_0
    // Could not write size check! Type: Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass23_0 is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass25_0
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $$c__DisplayClass25_0 : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = FactorySubContainerBinderBase_1<TContract>*;
      static constexpr std::string_view NESTED_NAME = "<>c__DisplayClass25_0";
      // public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      // Size: 0x8
      // Offset: 0x0
      Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this;
      // Field size check
      static_assert(sizeof(Zenject::FactorySubContainerBinderBase_1<TContract>*) == 0x8);
      // public Zenject.GameObjectCreationParameters gameObjectInfo
      // Size: 0x8
      // Offset: 0x0
      Zenject::GameObjectCreationParameters* gameObjectInfo;
      // Field size check
      static_assert(sizeof(Zenject::GameObjectCreationParameters*) == 0x8);
      // public System.Type installerType
      // Size: 0x8
      // Offset: 0x0
      System::Type* installerType;
      // Field size check
      static_assert(sizeof(System::Type*) == 0x8);
      // Creating value type constructor for type: $$c__DisplayClass25_0
      $$c__DisplayClass25_0(Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this_ = {}, Zenject::GameObjectCreationParameters* gameObjectInfo_ = {}, System::Type* installerType_ = {}) noexcept : $$4__this{$$4__this_}, gameObjectInfo{gameObjectInfo_}, installerType{installerType_} {}
      // Autogenerated instance field getter
      // Get instance field: public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      Zenject::FactorySubContainerBinderBase_1<TContract>* _get_$$4__this() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0::_get_$$4__this");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<Zenject::FactorySubContainerBinderBase_1<TContract>*>(___internal__instance, "<>4__this")));
      }
      // Autogenerated instance field setter
      // Set instance field: public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      void _set_$$4__this(Zenject::FactorySubContainerBinderBase_1<TContract>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0::_set_$$4__this");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<>4__this", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public Zenject.GameObjectCreationParameters gameObjectInfo
      Zenject::GameObjectCreationParameters* _get_gameObjectInfo() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0::_get_gameObjectInfo");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<Zenject::GameObjectCreationParameters*>(___internal__instance, "gameObjectInfo"));
      }
      // Autogenerated instance field setter
      // Set instance field: public Zenject.GameObjectCreationParameters gameObjectInfo
      void _set_gameObjectInfo(Zenject::GameObjectCreationParameters* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0::_set_gameObjectInfo");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "gameObjectInfo", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Type installerType
      System::Type* _get_installerType() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0::_get_installerType");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<System::Type*>(___internal__instance, "installerType"));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.Type installerType
      void _set_installerType(System::Type* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0::_set_installerType");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "installerType", value));
      }
      // Zenject.IProvider <ByNewGameObjectInstaller>b__0(Zenject.DiContainer container)
      // Offset: 0xFFFFFFFF
      Zenject::IProvider* $ByNewGameObjectInstaller$b__0(Zenject::DiContainer* container) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0::<ByNewGameObjectInstaller>b__0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<ByNewGameObjectInstaller>b__0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(container)})));
        return ::il2cpp_utils::RunMethodThrow<Zenject::IProvider*, false>(this, ___internal__method, container);
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass25_0* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass25_0::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass25_0*, creationType>()));
      }
    }; // Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass25_0
    // Could not write size check! Type: Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass25_0 is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass27_0
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $$c__DisplayClass27_0 : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = FactorySubContainerBinderBase_1<TContract>*;
      static constexpr std::string_view NESTED_NAME = "<>c__DisplayClass27_0";
      // public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      // Size: 0x8
      // Offset: 0x0
      Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this;
      // Field size check
      static_assert(sizeof(Zenject::FactorySubContainerBinderBase_1<TContract>*) == 0x8);
      // public UnityEngine.Object prefab
      // Size: 0x8
      // Offset: 0x0
      UnityEngine::Object* prefab;
      // Field size check
      static_assert(sizeof(UnityEngine::Object*) == 0x8);
      // public Zenject.GameObjectCreationParameters gameObjectInfo
      // Size: 0x8
      // Offset: 0x0
      Zenject::GameObjectCreationParameters* gameObjectInfo;
      // Field size check
      static_assert(sizeof(Zenject::GameObjectCreationParameters*) == 0x8);
      // public System.Type installerType
      // Size: 0x8
      // Offset: 0x0
      System::Type* installerType;
      // Field size check
      static_assert(sizeof(System::Type*) == 0x8);
      // Creating value type constructor for type: $$c__DisplayClass27_0
      $$c__DisplayClass27_0(Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this_ = {}, UnityEngine::Object* prefab_ = {}, Zenject::GameObjectCreationParameters* gameObjectInfo_ = {}, System::Type* installerType_ = {}) noexcept : $$4__this{$$4__this_}, prefab{prefab_}, gameObjectInfo{gameObjectInfo_}, installerType{installerType_} {}
      // Autogenerated instance field getter
      // Get instance field: public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      Zenject::FactorySubContainerBinderBase_1<TContract>* _get_$$4__this() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::_get_$$4__this");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<Zenject::FactorySubContainerBinderBase_1<TContract>*>(___internal__instance, "<>4__this")));
      }
      // Autogenerated instance field setter
      // Set instance field: public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      void _set_$$4__this(Zenject::FactorySubContainerBinderBase_1<TContract>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::_set_$$4__this");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<>4__this", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public UnityEngine.Object prefab
      UnityEngine::Object* _get_prefab() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::_get_prefab");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<UnityEngine::Object*>(___internal__instance, "prefab"));
      }
      // Autogenerated instance field setter
      // Set instance field: public UnityEngine.Object prefab
      void _set_prefab(UnityEngine::Object* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::_set_prefab");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "prefab", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public Zenject.GameObjectCreationParameters gameObjectInfo
      Zenject::GameObjectCreationParameters* _get_gameObjectInfo() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::_get_gameObjectInfo");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<Zenject::GameObjectCreationParameters*>(___internal__instance, "gameObjectInfo"));
      }
      // Autogenerated instance field setter
      // Set instance field: public Zenject.GameObjectCreationParameters gameObjectInfo
      void _set_gameObjectInfo(Zenject::GameObjectCreationParameters* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::_set_gameObjectInfo");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "gameObjectInfo", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Type installerType
      System::Type* _get_installerType() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::_get_installerType");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<System::Type*>(___internal__instance, "installerType"));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.Type installerType
      void _set_installerType(System::Type* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::_set_installerType");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "installerType", value));
      }
      // Zenject.IProvider <ByNewPrefabInstaller>b__0(Zenject.DiContainer container)
      // Offset: 0xFFFFFFFF
      Zenject::IProvider* $ByNewPrefabInstaller$b__0(Zenject::DiContainer* container) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::<ByNewPrefabInstaller>b__0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<ByNewPrefabInstaller>b__0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(container)})));
        return ::il2cpp_utils::RunMethodThrow<Zenject::IProvider*, false>(this, ___internal__method, container);
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass27_0* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass27_0::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass27_0*, creationType>()));
      }
    }; // Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass27_0
    // Could not write size check! Type: Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass27_0 is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass29_0
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $$c__DisplayClass29_0 : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = FactorySubContainerBinderBase_1<TContract>*;
      static constexpr std::string_view NESTED_NAME = "<>c__DisplayClass29_0";
      // public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      // Size: 0x8
      // Offset: 0x0
      Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this;
      // Field size check
      static_assert(sizeof(Zenject::FactorySubContainerBinderBase_1<TContract>*) == 0x8);
      // public System.String resourcePath
      // Size: 0x8
      // Offset: 0x0
      ::Il2CppString* resourcePath;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // public Zenject.GameObjectCreationParameters gameObjectInfo
      // Size: 0x8
      // Offset: 0x0
      Zenject::GameObjectCreationParameters* gameObjectInfo;
      // Field size check
      static_assert(sizeof(Zenject::GameObjectCreationParameters*) == 0x8);
      // public System.Type installerType
      // Size: 0x8
      // Offset: 0x0
      System::Type* installerType;
      // Field size check
      static_assert(sizeof(System::Type*) == 0x8);
      // Creating value type constructor for type: $$c__DisplayClass29_0
      $$c__DisplayClass29_0(Zenject::FactorySubContainerBinderBase_1<TContract>* $$4__this_ = {}, ::Il2CppString* resourcePath_ = {}, Zenject::GameObjectCreationParameters* gameObjectInfo_ = {}, System::Type* installerType_ = {}) noexcept : $$4__this{$$4__this_}, resourcePath{resourcePath_}, gameObjectInfo{gameObjectInfo_}, installerType{installerType_} {}
      // Autogenerated instance field getter
      // Get instance field: public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      Zenject::FactorySubContainerBinderBase_1<TContract>* _get_$$4__this() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::_get_$$4__this");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<Zenject::FactorySubContainerBinderBase_1<TContract>*>(___internal__instance, "<>4__this")));
      }
      // Autogenerated instance field setter
      // Set instance field: public Zenject.FactorySubContainerBinderBase`1<TContract> <>4__this
      void _set_$$4__this(Zenject::FactorySubContainerBinderBase_1<TContract>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::_set_$$4__this");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<>4__this", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.String resourcePath
      ::Il2CppString* _get_resourcePath() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::_get_resourcePath");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<::Il2CppString*>(___internal__instance, "resourcePath"));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.String resourcePath
      void _set_resourcePath(::Il2CppString* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::_set_resourcePath");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "resourcePath", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public Zenject.GameObjectCreationParameters gameObjectInfo
      Zenject::GameObjectCreationParameters* _get_gameObjectInfo() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::_get_gameObjectInfo");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<Zenject::GameObjectCreationParameters*>(___internal__instance, "gameObjectInfo"));
      }
      // Autogenerated instance field setter
      // Set instance field: public Zenject.GameObjectCreationParameters gameObjectInfo
      void _set_gameObjectInfo(Zenject::GameObjectCreationParameters* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::_set_gameObjectInfo");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "gameObjectInfo", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Type installerType
      System::Type* _get_installerType() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::_get_installerType");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<System::Type*>(___internal__instance, "installerType"));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.Type installerType
      void _set_installerType(System::Type* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::_set_installerType");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "installerType", value));
      }
      // Zenject.IProvider <ByNewPrefabResourceInstaller>b__0(Zenject.DiContainer container)
      // Offset: 0xFFFFFFFF
      Zenject::IProvider* $ByNewPrefabResourceInstaller$b__0(Zenject::DiContainer* container) {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::<ByNewPrefabResourceInstaller>b__0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<ByNewPrefabResourceInstaller>b__0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(container)})));
        return ::il2cpp_utils::RunMethodThrow<Zenject::IProvider*, false>(this, ___internal__method, container);
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass29_0* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::$$c__DisplayClass29_0::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename FactorySubContainerBinderBase_1<TContract>::$$c__DisplayClass29_0*, creationType>()));
      }
    }; // Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass29_0
    // Could not write size check! Type: Zenject.FactorySubContainerBinderBase`1/Zenject.<>c__DisplayClass29_0 is generic, or has no fields that are valid for size checks!
    // private Zenject.DiContainer <BindContainer>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    Zenject::DiContainer* BindContainer;
    // Field size check
    static_assert(sizeof(Zenject::DiContainer*) == 0x8);
    // private Zenject.FactoryBindInfo <FactoryBindInfo>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    Zenject::FactoryBindInfo* FactoryBindInfo;
    // Field size check
    static_assert(sizeof(Zenject::FactoryBindInfo*) == 0x8);
    // private Zenject.BindInfo <BindInfo>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    Zenject::BindInfo* BindInfo;
    // Field size check
    static_assert(sizeof(Zenject::BindInfo*) == 0x8);
    // private System.Object <SubIdentifier>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::Il2CppObject* SubIdentifier;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // Creating value type constructor for type: FactorySubContainerBinderBase_1
    FactorySubContainerBinderBase_1(Zenject::DiContainer* BindContainer_ = {}, Zenject::FactoryBindInfo* FactoryBindInfo_ = {}, Zenject::BindInfo* BindInfo_ = {}, ::Il2CppObject* SubIdentifier_ = {}) noexcept : BindContainer{BindContainer_}, FactoryBindInfo{FactoryBindInfo_}, BindInfo{BindInfo_}, SubIdentifier{SubIdentifier_} {}
    // Autogenerated instance field getter
    // Get instance field: private Zenject.DiContainer <BindContainer>k__BackingField
    Zenject::DiContainer* _get_$BindContainer$k__BackingField() {
      static auto ___internal__logger = ::Logger::get().WithContext("Zenject::FactorySubContainerBinderBase_1::_get_$BindContainer$k__BackingField");
      static auto ___internal__instance = this;
      return THROW_UNLESS((il2cpp_utils::GetFieldValue<Zenject::DiContainer*>(___internal__instance, "<BindContainer>k__BackingField")));
    }
