// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: Zenject.BindingId
#include "Zenject/BindingId.hpp"
// Including type: Zenject.InjectSources
#include "Zenject/InjectSources.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: DiContainer
  class DiContainer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: Zenject
namespace Zenject {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: Zenject.InjectContext
  // [TokenAttribute] Offset: FFFFFFFF
  // [NoReflectionBakingAttribute] Offset: FFFFFFFF
  class InjectContext : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // Nested type: Zenject::InjectContext::$get_ParentContexts$d__52
    class $get_ParentContexts$d__52;
    // Nested type: Zenject::InjectContext::$get_ParentContextsAndSelf$d__54
    class $get_ParentContextsAndSelf$d__54;
    // Nested type: Zenject::InjectContext::$get_AllObjectTypes$d__56
    class $get_AllObjectTypes$d__56;
    // private Zenject.BindingId _bindingId
    // Size: 0x10
    // Offset: 0x10
    Zenject::BindingId bindingId;
    // Field size check
    static_assert(sizeof(Zenject::BindingId) == 0x10);
    // private System.Type _objectType
    // Size: 0x8
    // Offset: 0x20
    System::Type* objectType;
    // Field size check
    static_assert(sizeof(System::Type*) == 0x8);
    // private Zenject.InjectContext _parentContext
    // Size: 0x8
    // Offset: 0x28
    Zenject::InjectContext* parentContext;
    // Field size check
    static_assert(sizeof(Zenject::InjectContext*) == 0x8);
    // private System.Object _objectInstance
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppObject* objectInstance;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.String _memberName
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* memberName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean _optional
    // Size: 0x1
    // Offset: 0x40
    bool optional;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: optional and: sourceType
    char __padding5[0x3] = {};
    // private Zenject.InjectSources _sourceType
    // Size: 0x4
    // Offset: 0x44
    Zenject::InjectSources sourceType;
    // Field size check
    static_assert(sizeof(Zenject::InjectSources) == 0x4);
    // private System.Object _fallBackValue
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* fallBackValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _concreteIdentifier
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppObject* concreteIdentifier;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private Zenject.DiContainer _container
    // Size: 0x8
    // Offset: 0x58
    Zenject::DiContainer* container;
    // Field size check
    static_assert(sizeof(Zenject::DiContainer*) == 0x8);
    // Creating value type constructor for type: InjectContext
    InjectContext(Zenject::BindingId bindingId_ = {}, System::Type* objectType_ = {}, Zenject::InjectContext* parentContext_ = {}, ::Il2CppObject* objectInstance_ = {}, ::Il2CppString* memberName_ = {}, bool optional_ = {}, Zenject::InjectSources sourceType_ = {}, ::Il2CppObject* fallBackValue_ = {}, ::Il2CppObject* concreteIdentifier_ = {}, Zenject::DiContainer* container_ = {}) noexcept : bindingId{bindingId_}, objectType{objectType_}, parentContext{parentContext_}, objectInstance{objectInstance_}, memberName{memberName_}, optional{optional_}, sourceType{sourceType_}, fallBackValue{fallBackValue_}, concreteIdentifier{concreteIdentifier_}, container{container_} {}
    // Creating interface conversion operator: operator System::IDisposable
