// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Zenject.Context
#include "Zenject/Context.hpp"
// Including type: Zenject.ReflectionBakingCoverageModes
#include "Zenject/ReflectionBakingCoverageModes.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: ZenjectSettings
  class ZenjectSettings;
  // Forward declaring type: DiContainer
  class DiContainer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: MonoBehaviour because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: Zenject
namespace Zenject {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: Zenject.ProjectContext
  // [] Offset: FFFFFFFF
  class ProjectContext : public Zenject::Context {
    public:
    // [CompilerGeneratedAttribute] Offset: 0xD94588
    // private System.Action PreInstall
    // Size: 0x8
    // Offset: 0x40
    System::Action* PreInstall;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD94598
    // private System.Action PostInstall
    // Size: 0x8
    // Offset: 0x48
    System::Action* PostInstall;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD945A8
    // private System.Action PreResolve
    // Size: 0x8
    // Offset: 0x50
    System::Action* PreResolve;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD945B8
    // private System.Action PostResolve
    // Size: 0x8
    // Offset: 0x58
    System::Action* PostResolve;
    // Field size check
    static_assert(sizeof(System::Action*) == 0x8);
    // [TooltipAttribute] Offset: 0xD945C8
    // private System.Boolean _parentNewObjectsUnderContext
    // Size: 0x1
    // Offset: 0x60
    bool parentNewObjectsUnderContext;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: parentNewObjectsUnderContext and: editorReflectionBakingCoverageMode
    char __padding4[0x3] = {};
    // private Zenject.ReflectionBakingCoverageModes _editorReflectionBakingCoverageMode
    // Size: 0x4
    // Offset: 0x64
    Zenject::ReflectionBakingCoverageModes editorReflectionBakingCoverageMode;
    // Field size check
    static_assert(sizeof(Zenject::ReflectionBakingCoverageModes) == 0x4);
    // private Zenject.ReflectionBakingCoverageModes _buildsReflectionBakingCoverageMode
    // Size: 0x4
    // Offset: 0x68
    Zenject::ReflectionBakingCoverageModes buildsReflectionBakingCoverageMode;
    // Field size check
    static_assert(sizeof(Zenject::ReflectionBakingCoverageModes) == 0x4);
    // Padding between fields: buildsReflectionBakingCoverageMode and: settings
    char __padding6[0x4] = {};
    // private Zenject.ZenjectSettings _settings
    // Size: 0x8
    // Offset: 0x70
    Zenject::ZenjectSettings* settings;
    // Field size check
    static_assert(sizeof(Zenject::ZenjectSettings*) == 0x8);
    // private Zenject.DiContainer _container
    // Size: 0x8
    // Offset: 0x78
    Zenject::DiContainer* container;
    // Field size check
    static_assert(sizeof(Zenject::DiContainer*) == 0x8);
    // Creating value type constructor for type: ProjectContext
    ProjectContext(System::Action* PreInstall_ = {}, System::Action* PostInstall_ = {}, System::Action* PreResolve_ = {}, System::Action* PostResolve_ = {}, bool parentNewObjectsUnderContext_ = {}, Zenject::ReflectionBakingCoverageModes editorReflectionBakingCoverageMode_ = {}, Zenject::ReflectionBakingCoverageModes buildsReflectionBakingCoverageMode_ = {}, Zenject::ZenjectSettings* settings_ = {}, Zenject::DiContainer* container_ = {}) noexcept : PreInstall{PreInstall_}, PostInstall{PostInstall_}, PreResolve{PreResolve_}, PostResolve{PostResolve_}, parentNewObjectsUnderContext{parentNewObjectsUnderContext_}, editorReflectionBakingCoverageMode{editorReflectionBakingCoverageMode_}, buildsReflectionBakingCoverageMode{buildsReflectionBakingCoverageMode_}, settings{settings_}, container{container_} {}
    // static field const value: static public System.String ProjectContextResourcePath
    static constexpr const char* ProjectContextResourcePath = "ProjectContext";
    // Get static field: static public System.String ProjectContextResourcePath
    static ::Il2CppString* _get_ProjectContextResourcePath();
    // Set static field: static public System.String ProjectContextResourcePath
    static void _set_ProjectContextResourcePath(::Il2CppString* value);
    // static field const value: static public System.String ProjectContextResourcePathOld
    static constexpr const char* ProjectContextResourcePathOld = "ProjectCompositionRoot";
    // Get static field: static public System.String ProjectContextResourcePathOld
    static ::Il2CppString* _get_ProjectContextResourcePathOld();
    // Set static field: static public System.String ProjectContextResourcePathOld
    static void _set_ProjectContextResourcePathOld(::Il2CppString* value);
    // Get static field: static private Zenject.ProjectContext _instance
    static Zenject::ProjectContext* _get__instance();
    // Set static field: static private Zenject.ProjectContext _instance
    static void _set__instance(Zenject::ProjectContext* value);
    // [CompilerGeneratedAttribute] Offset: 0xD94644
    // Get static field: static private System.Boolean <ValidateOnNextRun>k__BackingField
    static bool _get_$ValidateOnNextRun$k__BackingField();
    // Set static field: static private System.Boolean <ValidateOnNextRun>k__BackingField
    static void _set_$ValidateOnNextRun$k__BackingField(bool value);
    // public System.Void add_PreInstall(System.Action value)
    // Offset: 0x134C6F0
    void add_PreInstall(System::Action* value);
    // public System.Void remove_PreInstall(System.Action value)
    // Offset: 0x134C794
    void remove_PreInstall(System::Action* value);
    // public System.Void add_PostInstall(System.Action value)
    // Offset: 0x134C838
    void add_PostInstall(System::Action* value);
    // public System.Void remove_PostInstall(System.Action value)
    // Offset: 0x134C8DC
    void remove_PostInstall(System::Action* value);
    // public System.Void add_PreResolve(System.Action value)
    // Offset: 0x134C980
    void add_PreResolve(System::Action* value);
    // public System.Void remove_PreResolve(System.Action value)
    // Offset: 0x134CA24
    void remove_PreResolve(System::Action* value);
    // public System.Void add_PostResolve(System.Action value)
    // Offset: 0x134CAC8
    void add_PostResolve(System::Action* value);
    // public System.Void remove_PostResolve(System.Action value)
    // Offset: 0x134CB6C
    void remove_PostResolve(System::Action* value);
    // static public System.Boolean get_HasInstance()
    // Offset: 0x134CC18
    static bool get_HasInstance();
    // static public Zenject.ProjectContext get_Instance()
    // Offset: 0x134CC94
    static Zenject::ProjectContext* get_Instance();
    // static public System.Boolean get_ValidateOnNextRun()
    // Offset: 0x134CFB4
    static bool get_ValidateOnNextRun();
    // static public System.Void set_ValidateOnNextRun(System.Boolean value)
    // Offset: 0x134D004
    static void set_ValidateOnNextRun(bool value);
    // static public UnityEngine.GameObject TryGetPrefab()
    // Offset: 0x134D118
    static UnityEngine::GameObject* TryGetPrefab();
    // static private System.Void InstantiateAndInitialize()
    // Offset: 0x134CD3C
    static void InstantiateAndInitialize();
    // public System.Boolean get_ParentNewObjectsUnderContext()
    // Offset: 0x134D65C
    bool get_ParentNewObjectsUnderContext();
    // public System.Void set_ParentNewObjectsUnderContext(System.Boolean value)
    // Offset: 0x134D664
    void set_ParentNewObjectsUnderContext(bool value);
    // public System.Void EnsureIsInitialized()
    // Offset: 0x134D670
    void EnsureIsInitialized();
    // public System.Void Awake()
    // Offset: 0x134D674
    void Awake();
    // private System.Void Initialize()
    // Offset: 0x134D284
    void Initialize();
    // private System.Void InstallBindings(System.Collections.Generic.List`1<UnityEngine.MonoBehaviour> injectableMonoBehaviours)
    // Offset: 0x134D798
    void InstallBindings(System::Collections::Generic::List_1<UnityEngine::MonoBehaviour*>* injectableMonoBehaviours);
    // public override Zenject.DiContainer get_Container()
    // Offset: 0x134CC10
    // Implemented from: Zenject.Context
    // Base method: Zenject.DiContainer Context::get_Container()
    Zenject::DiContainer* get_Container();
    // public override System.Collections.Generic.IEnumerable`1<UnityEngine.GameObject> GetRootGameObjects()
    // Offset: 0x134D05C
    // Implemented from: Zenject.Context
    // Base method: System.Collections.Generic.IEnumerable`1<UnityEngine.GameObject> Context::GetRootGameObjects()
    System::Collections::Generic::IEnumerable_1<UnityEngine::GameObject*>* GetRootGameObjects();
    // protected override System.Void GetInjectableMonoBehaviours(System.Collections.Generic.List`1<UnityEngine.MonoBehaviour> monoBehaviours)
    // Offset: 0x134DA68
    // Implemented from: Zenject.Context
    // Base method: System.Void Context::GetInjectableMonoBehaviours(System.Collections.Generic.List`1<UnityEngine.MonoBehaviour> monoBehaviours)
    void GetInjectableMonoBehaviours(System::Collections::Generic::List_1<UnityEngine::MonoBehaviour*>* monoBehaviours);
    // public System.Void .ctor()
    // Offset: 0x134DAD8
    // Implemented from: Zenject.Context
    // Base method: System.Void Context::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ProjectContext* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("Zenject::ProjectContext::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ProjectContext*, creationType>()));
    }
  }; // Zenject.ProjectContext
  #pragma pack(pop)
  static check_size<sizeof(ProjectContext), 120 + sizeof(Zenject::DiContainer*)> __Zenject_ProjectContextSizeCheck;
  static_assert(sizeof(ProjectContext) == 0x80);
}
DEFINE_IL2CPP_ARG_TYPE(Zenject::ProjectContext*, "Zenject", "ProjectContext");
