// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: DiContainer
  class DiContainer;
  // Forward declaring type: SignalBus
  class SignalBus;
  // Forward declaring type: SignalBindingBindInfo
  class SignalBindingBindInfo;
  // Forward declaring type: InjectTypeInfo
  class InjectTypeInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: Zenject
namespace Zenject {
  // Forward declaring type: SignalCallbackWithLookupWrapper
  class SignalCallbackWithLookupWrapper;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Zenject::SignalCallbackWithLookupWrapper);
DEFINE_IL2CPP_ARG_TYPE(::Zenject::SignalCallbackWithLookupWrapper*, "Zenject", "SignalCallbackWithLookupWrapper");
// Type namespace: Zenject
namespace Zenject {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: Zenject.SignalCallbackWithLookupWrapper
  // [TokenAttribute] Offset: FFFFFFFF
  class SignalCallbackWithLookupWrapper : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    public:
    // private readonly Zenject.DiContainer _container
    // Size: 0x8
    // Offset: 0x10
    ::Zenject::DiContainer* container;
    // Field size check
    static_assert(sizeof(::Zenject::DiContainer*) == 0x8);
    // private readonly Zenject.SignalBus _signalBus
    // Size: 0x8
    // Offset: 0x18
    ::Zenject::SignalBus* signalBus;
    // Field size check
    static_assert(sizeof(::Zenject::SignalBus*) == 0x8);
    // private readonly System.Guid _lookupId
    // Size: 0x10
    // Offset: 0x20
    ::System::Guid lookupId;
    // Field size check
    static_assert(sizeof(::System::Guid) == 0x10);
    // private readonly System.Func`2<System.Object,System.Action`1<System.Object>> _methodGetter
    // Size: 0x8
    // Offset: 0x30
    ::System::Func_2<::Il2CppObject*, ::System::Action_1<::Il2CppObject*>*>* methodGetter;
    // Field size check
    static_assert(sizeof(::System::Func_2<::Il2CppObject*, ::System::Action_1<::Il2CppObject*>*>*) == 0x8);
    // private readonly System.Type _objectType
    // Size: 0x8
    // Offset: 0x38
    ::System::Type* objectType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private readonly System.Type _signalType
    // Size: 0x8
    // Offset: 0x40
    ::System::Type* signalType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private readonly System.Object _identifier
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* identifier;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: private readonly Zenject.DiContainer _container
    [[deprecated("Use field access instead!")]] ::Zenject::DiContainer*& dyn__container();
    // Get instance field reference: private readonly Zenject.SignalBus _signalBus
    [[deprecated("Use field access instead!")]] ::Zenject::SignalBus*& dyn__signalBus();
    // Get instance field reference: private readonly System.Guid _lookupId
    [[deprecated("Use field access instead!")]] ::System::Guid& dyn__lookupId();
    // Get instance field reference: private readonly System.Func`2<System.Object,System.Action`1<System.Object>> _methodGetter
    [[deprecated("Use field access instead!")]] ::System::Func_2<::Il2CppObject*, ::System::Action_1<::Il2CppObject*>*>*& dyn__methodGetter();
    // Get instance field reference: private readonly System.Type _objectType
    [[deprecated("Use field access instead!")]] ::System::Type*& dyn__objectType();
    // Get instance field reference: private readonly System.Type _signalType
    [[deprecated("Use field access instead!")]] ::System::Type*& dyn__signalType();
    // Get instance field reference: private readonly System.Object _identifier
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn__identifier();
    // public System.Void .ctor(Zenject.SignalBindingBindInfo signalBindInfo, System.Type objectType, System.Guid lookupId, System.Func`2<System.Object,System.Action`1<System.Object>> methodGetter, Zenject.SignalBus signalBus, Zenject.DiContainer container)
    // Offset: 0x1D1B4EC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SignalCallbackWithLookupWrapper* New_ctor(::Zenject::SignalBindingBindInfo* signalBindInfo, ::System::Type* objectType, ::System::Guid lookupId, ::System::Func_2<::Il2CppObject*, ::System::Action_1<::Il2CppObject*>*>* methodGetter, ::Zenject::SignalBus* signalBus, ::Zenject::DiContainer* container) {
      static auto ___internal__logger = ::Logger::get().WithContext("::Zenject::SignalCallbackWithLookupWrapper::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SignalCallbackWithLookupWrapper*, creationType>(signalBindInfo, objectType, lookupId, methodGetter, signalBus, container)));
    }
    // private System.Void OnSignalFired(System.Object signal)
    // Offset: 0x1D1B5EC
    void OnSignalFired(::Il2CppObject* signal);
    // public System.Void Dispose()
    // Offset: 0x1D1B7C4
    void Dispose();
    // static private System.Object __zenCreate(System.Object[] P_0)
    // Offset: 0x1D1B86C
    static ::Il2CppObject* __zenCreate(::ArrayW<::Il2CppObject*> P_0);
    // static private Zenject.InjectTypeInfo __zenCreateInjectTypeInfo()
    // Offset: 0x1D1BAA4
    static ::Zenject::InjectTypeInfo* __zenCreateInjectTypeInfo();
  }; // Zenject.SignalCallbackWithLookupWrapper
  #pragma pack(pop)
  static check_size<sizeof(SignalCallbackWithLookupWrapper), 72 + sizeof(::Il2CppObject*)> __Zenject_SignalCallbackWithLookupWrapperSizeCheck;
  static_assert(sizeof(SignalCallbackWithLookupWrapper) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Zenject::SignalCallbackWithLookupWrapper::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Zenject::SignalCallbackWithLookupWrapper::OnSignalFired
// Il2CppName: OnSignalFired
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Zenject::SignalCallbackWithLookupWrapper::*)(::Il2CppObject*)>(&Zenject::SignalCallbackWithLookupWrapper::OnSignalFired)> {
  static const MethodInfo* get() {
    static auto* signal = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Zenject::SignalCallbackWithLookupWrapper*), "OnSignalFired", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{signal});
  }
};
// Writing MetadataGetter for method: Zenject::SignalCallbackWithLookupWrapper::Dispose
// Il2CppName: Dispose
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Zenject::SignalCallbackWithLookupWrapper::*)()>(&Zenject::SignalCallbackWithLookupWrapper::Dispose)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Zenject::SignalCallbackWithLookupWrapper*), "Dispose", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Zenject::SignalCallbackWithLookupWrapper::__zenCreate
// Il2CppName: __zenCreate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Il2CppObject* (*)(::ArrayW<::Il2CppObject*>)>(&Zenject::SignalCallbackWithLookupWrapper::__zenCreate)> {
  static const MethodInfo* get() {
    static auto* P_0 = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Object"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Zenject::SignalCallbackWithLookupWrapper*), "__zenCreate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{P_0});
  }
};
// Writing MetadataGetter for method: Zenject::SignalCallbackWithLookupWrapper::__zenCreateInjectTypeInfo
// Il2CppName: __zenCreateInjectTypeInfo
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Zenject::InjectTypeInfo* (*)()>(&Zenject::SignalCallbackWithLookupWrapper::__zenCreateInjectTypeInfo)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Zenject::SignalCallbackWithLookupWrapper*), "__zenCreateInjectTypeInfo", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
