// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Security.Authentication.SslProtocols
#include "System/Security/Authentication/SslProtocols.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Net::Security
namespace Mono::Net::Security {
  // Forward declaring type: MobileAuthenticatedStream
  class MobileAuthenticatedStream;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509Certificate
  class X509Certificate;
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
  // Forward declaring type: X509Chain
  class X509Chain;
}
// Forward declaring namespace: Mono::Security::Interface
namespace Mono::Security::Interface {
  // Forward declaring type: ICertificateValidator2
  class ICertificateValidator2;
  // Forward declaring type: MonoTlsSettings
  class MonoTlsSettings;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: ValueTuple`2<T1, T2>
  template<typename T1, typename T2>
  struct ValueTuple_2;
}
// Completed forward declares
// Type namespace: Mono.Net.Security
namespace Mono::Net::Security {
  // Autogenerated type: Mono.Net.Security.MobileTlsContext
  class MobileTlsContext : public ::Il2CppObject, public System::IDisposable {
    public:
    // private Mono.Net.Security.MobileAuthenticatedStream parent
    // Offset: 0x10
    Mono::Net::Security::MobileAuthenticatedStream* parent;
    // private System.Boolean serverMode
    // Offset: 0x18
    bool serverMode;
    // private System.String targetHost
    // Offset: 0x20
    ::Il2CppString* targetHost;
    // private System.String serverName
    // Offset: 0x28
    ::Il2CppString* serverName;
    // private System.Security.Authentication.SslProtocols enabledProtocols
    // Offset: 0x30
    System::Security::Authentication::SslProtocols enabledProtocols;
    // private System.Security.Cryptography.X509Certificates.X509Certificate serverCertificate
    // Offset: 0x38
    System::Security::Cryptography::X509Certificates::X509Certificate* serverCertificate;
    // private System.Security.Cryptography.X509Certificates.X509CertificateCollection clientCertificates
    // Offset: 0x40
    System::Security::Cryptography::X509Certificates::X509CertificateCollection* clientCertificates;
    // private System.Boolean askForClientCert
    // Offset: 0x48
    bool askForClientCert;
    // private Mono.Security.Interface.ICertificateValidator2 certificateValidator
    // Offset: 0x50
    Mono::Security::Interface::ICertificateValidator2* certificateValidator;
    // public System.Void .ctor(Mono.Net.Security.MobileAuthenticatedStream parent, System.Boolean serverMode, System.String targetHost, System.Security.Authentication.SslProtocols enabledProtocols, System.Security.Cryptography.X509Certificates.X509Certificate serverCertificate, System.Security.Cryptography.X509Certificates.X509CertificateCollection clientCertificates, System.Boolean askForClientCert)
    // Offset: 0x11F5228
    static MobileTlsContext* New_ctor(Mono::Net::Security::MobileAuthenticatedStream* parent, bool serverMode, ::Il2CppString* targetHost, System::Security::Authentication::SslProtocols enabledProtocols, System::Security::Cryptography::X509Certificates::X509Certificate* serverCertificate, System::Security::Cryptography::X509Certificates::X509CertificateCollection* clientCertificates, bool askForClientCert);
    // Mono.Net.Security.MobileAuthenticatedStream get_Parent()
    // Offset: 0x11F53B4
    Mono::Net::Security::MobileAuthenticatedStream* get_Parent();
    // public Mono.Security.Interface.MonoTlsSettings get_Settings()
    // Offset: 0x11F53BC
    Mono::Security::Interface::MonoTlsSettings* get_Settings();
    // public System.Boolean get_IsAuthenticated()
    // Offset: 0xFFFFFFFF
    bool get_IsAuthenticated();
    // public System.Boolean get_IsServer()
    // Offset: 0x11F53D8
    bool get_IsServer();
    // protected System.String get_TargetHost()
    // Offset: 0x11F53E0
    ::Il2CppString* get_TargetHost();
    // protected System.String get_ServerName()
    // Offset: 0x11F53E8
    ::Il2CppString* get_ServerName();
    // protected System.Security.Cryptography.X509Certificates.X509CertificateCollection get_ClientCertificates()
    // Offset: 0x11F53F0
    System::Security::Cryptography::X509Certificates::X509CertificateCollection* get_ClientCertificates();
    // public System.Void StartHandshake()
    // Offset: 0xFFFFFFFF
    void StartHandshake();
    // public System.Boolean ProcessHandshake()
    // Offset: 0xFFFFFFFF
    bool ProcessHandshake();
    // public System.Void FinishHandshake()
    // Offset: 0xFFFFFFFF
    void FinishHandshake();
    // System.Security.Cryptography.X509Certificates.X509Certificate get_LocalServerCertificate()
    // Offset: 0x11F53F8
    System::Security::Cryptography::X509Certificates::X509Certificate* get_LocalServerCertificate();
    // System.Security.Cryptography.X509Certificates.X509Certificate get_LocalClientCertificate()
    // Offset: 0xFFFFFFFF
    System::Security::Cryptography::X509Certificates::X509Certificate* get_LocalClientCertificate();
    // public System.ValueTuple`2<System.Int32,System.Boolean> Read(System.Byte[] buffer, System.Int32 offset, System.Int32 count)
    // Offset: 0xFFFFFFFF
    System::ValueTuple_2<int, bool> Read(::Array<uint8_t>* buffer, int offset, int count);
    // public System.ValueTuple`2<System.Int32,System.Boolean> Write(System.Byte[] buffer, System.Int32 offset, System.Int32 count)
    // Offset: 0xFFFFFFFF
    System::ValueTuple_2<int, bool> Write(::Array<uint8_t>* buffer, int offset, int count);
    // public System.Void Shutdown()
    // Offset: 0xFFFFFFFF
    void Shutdown();
    // protected System.Boolean ValidateCertificate(System.Security.Cryptography.X509Certificates.X509Certificate leaf, System.Security.Cryptography.X509Certificates.X509Chain chain)
    // Offset: 0x11F5400
    bool ValidateCertificate(System::Security::Cryptography::X509Certificates::X509Certificate* leaf, System::Security::Cryptography::X509Certificates::X509Chain* chain);
    // protected System.Boolean ValidateCertificate(System.Security.Cryptography.X509Certificates.X509CertificateCollection certificates)
    // Offset: 0x11F5508
    bool ValidateCertificate(System::Security::Cryptography::X509Certificates::X509CertificateCollection* certificates);
    // protected System.Security.Cryptography.X509Certificates.X509Certificate SelectClientCertificate(System.Security.Cryptography.X509Certificates.X509Certificate serverCertificate, System.String[] acceptableIssuers)
    // Offset: 0x11F5604
    System::Security::Cryptography::X509Certificates::X509Certificate* SelectClientCertificate(System::Security::Cryptography::X509Certificates::X509Certificate* serverCertificate, ::Array<::Il2CppString*>* acceptableIssuers);
    // protected System.Void Dispose(System.Boolean disposing)
    // Offset: 0x11F5780
    void Dispose(bool disposing);
    // public System.Void Dispose()
    // Offset: 0x11F3628
    // Implemented from: System.IDisposable
    // Base method: System.Void IDisposable::Dispose()
    void Dispose();
    // Creating proxy method: System_IDisposable_Dispose
    // Maps to method: Dispose
    void System_IDisposable_Dispose();
    // protected override System.Void Finalize()
    // Offset: 0x11F5784
    // Implemented from: System.Object
    // Base method: System.Void Object::Finalize()
    void Finalize();
  }; // Mono.Net.Security.MobileTlsContext
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Mono::Net::Security::MobileTlsContext*, "Mono.Net.Security", "MobileTlsContext");
#pragma pack(pop)
