// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.PropertyAttribute
#include "UnityEngine/PropertyAttribute.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: UnityEngine.InputSystem.Layouts
namespace UnityEngine::InputSystem::Layouts {
  // Forward declaring type: InputControlAttribute
  class InputControlAttribute;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::Layouts::InputControlAttribute);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::Layouts::InputControlAttribute*, "UnityEngine.InputSystem.Layouts", "InputControlAttribute");
// Type namespace: UnityEngine.InputSystem.Layouts
namespace UnityEngine::InputSystem::Layouts {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.Layouts.InputControlAttribute
  // [TokenAttribute] Offset: FFFFFFFF
  // [AttributeUsageAttribute] Offset: 958E8C
  class InputControlAttribute : public ::UnityEngine::PropertyAttribute {
    public:
    public:
    // private System.String <layout>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::StringW layout;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <variants>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::StringW variants;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <name>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <format>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::StringW format;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <usage>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::StringW usage;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String[] <usages>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::StringW> usages;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String <parameters>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::StringW parameters;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <processors>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::StringW processors;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <alias>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::StringW alias;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String[] <aliases>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::StringW> aliases;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String <useStateFrom>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::StringW useStateFrom;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.UInt32 <bit>k__BackingField
    // Size: 0x4
    // Offset: 0x68
    uint bit;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 <offset>k__BackingField
    // Size: 0x4
    // Offset: 0x6C
    uint offset;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 <sizeInBits>k__BackingField
    // Size: 0x4
    // Offset: 0x70
    uint sizeInBits;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Int32 <arraySize>k__BackingField
    // Size: 0x4
    // Offset: 0x74
    int arraySize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String <displayName>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::StringW displayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <shortDisplayName>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::StringW shortDisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean <noisy>k__BackingField
    // Size: 0x1
    // Offset: 0x88
    bool noisy;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <synthetic>k__BackingField
    // Size: 0x1
    // Offset: 0x89
    bool synthetic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: synthetic and: defaultState
    char __padding18[0x6] = {};
    // private System.Object <defaultState>k__BackingField
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppObject* defaultState;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object <minValue>k__BackingField
    // Size: 0x8
    // Offset: 0x98
    ::Il2CppObject* minValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object <maxValue>k__BackingField
    // Size: 0x8
    // Offset: 0xA0
    ::Il2CppObject* maxValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    public:
    // Get instance field reference: private System.String <layout>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$layout$k__BackingField();
    // Get instance field reference: private System.String <variants>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$variants$k__BackingField();
    // Get instance field reference: private System.String <name>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$name$k__BackingField();
    // Get instance field reference: private System.String <format>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$format$k__BackingField();
    // Get instance field reference: private System.String <usage>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$usage$k__BackingField();
