// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InternedString
#include "UnityEngine/InputSystem/Utilities/InternedString.hpp"
// Including type: UnityEngine.InputSystem.Utilities.FourCC
#include "UnityEngine/InputSystem/Utilities/FourCC.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
// Including type: UnityEngine.InputSystem.Utilities.ReadOnlyArray`1
#include "UnityEngine/InputSystem/Utilities/ReadOnlyArray_1.hpp"
// Including type: UnityEngine.InputSystem.Utilities.NamedValue
#include "UnityEngine/InputSystem/Utilities/NamedValue.hpp"
// Including type: UnityEngine.InputSystem.Utilities.NameAndParameters
#include "UnityEngine/InputSystem/Utilities/NameAndParameters.hpp"
// Including type: System.Single
#include "System/Single.hpp"
// Including type: UnityEngine.InputSystem.Layouts.InputDeviceMatcher
#include "UnityEngine/InputSystem/Layouts/InputDeviceMatcher.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::Layouts
namespace UnityEngine::InputSystem::Layouts {
  // Skipping declaration: ControlItem because it is already included!
  // Forward declaring type: InputDeviceDescription
  struct InputDeviceDescription;
  // Skipping declaration: Cache because it is already included!
  // Forward declaring type: InputControlAttribute
  class InputControlAttribute;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Skipping declaration: IEnumerable`1 because it is already included!
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: MemberInfo
  class MemberInfo;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputControl
  class InputControl;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.Layouts
namespace UnityEngine::InputSystem::Layouts {
  // Forward declaring type: InputControlLayout
  class InputControlLayout;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::Layouts::InputControlLayout);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::Layouts::InputControlLayout*, "UnityEngine.InputSystem.Layouts", "InputControlLayout");
// Type namespace: UnityEngine.InputSystem.Layouts
namespace UnityEngine::InputSystem::Layouts {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.Layouts.InputControlLayout
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: 958EC4
  class InputControlLayout : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem
    struct ControlItem;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::Builder
    class Builder;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::Flags
    struct Flags;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::LayoutJsonNameAndDescriptorOnly
    struct LayoutJsonNameAndDescriptorOnly;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::LayoutJson
    struct LayoutJson;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItemJson
    class ControlItemJson;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection
    struct Collection;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::LayoutNotFoundException
    class LayoutNotFoundException;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::Cache
    struct Cache;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::CacheRefInstance
    struct CacheRefInstance;
    // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::$$c
    class $$c;
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem
    // [TokenAttribute] Offset: FFFFFFFF
    struct ControlItem/*, public ::System::ValueType*/ {
      public:
      // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags
      struct Flags;
      // Size: 0x4
      #pragma pack(push, 1)
      // Autogenerated type: UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags
      // [TokenAttribute] Offset: FFFFFFFF
      // [FlagsAttribute] Offset: FFFFFFFF
      struct Flags/*, public ::System::Enum*/ {
        public:
        public:
        // public System.Int32 value__
        // Size: 0x4
        // Offset: 0x0
        int value;
        // Field size check
        static_assert(sizeof(int) == 0x4);
        public:
        // Creating value type constructor for type: Flags
        constexpr Flags(int value_ = {}) noexcept : value{value_} {}
        // Creating interface conversion operator: operator ::System::Enum
        operator ::System::Enum() noexcept {
          return *reinterpret_cast<::System::Enum*>(this);
        }
        // Creating conversion operator: operator int
        constexpr operator int() const noexcept {
          return value;
        }
        // static field const value: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags isModifyingExistingControl
        static constexpr const int isModifyingExistingControl = 1;
        // Get static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags isModifyingExistingControl
        static ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags _get_isModifyingExistingControl();
        // Set static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags isModifyingExistingControl
        static void _set_isModifyingExistingControl(::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags value);
        // static field const value: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags IsNoisy
        static constexpr const int IsNoisy = 2;
        // Get static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags IsNoisy
        static ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags _get_IsNoisy();
        // Set static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags IsNoisy
        static void _set_IsNoisy(::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags value);
        // static field const value: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags IsSynthetic
        static constexpr const int IsSynthetic = 4;
        // Get static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags IsSynthetic
        static ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags _get_IsSynthetic();
        // Set static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags IsSynthetic
        static void _set_IsSynthetic(::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags value);
        // static field const value: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags IsFirstDefinedInThisLayout
        static constexpr const int IsFirstDefinedInThisLayout = 8;
        // Get static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags IsFirstDefinedInThisLayout
        static ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags _get_IsFirstDefinedInThisLayout();
        // Set static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags IsFirstDefinedInThisLayout
        static void _set_IsFirstDefinedInThisLayout(::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags value);
        // Get instance field reference: public System.Int32 value__
        [[deprecated("Use field access instead!")]] int& dyn_value__();
      }; // UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags
      #pragma pack(pop)
      static check_size<sizeof(InputControlLayout::ControlItem::Flags), 0 + sizeof(int)> __UnityEngine_InputSystem_Layouts_InputControlLayout_ControlItem_FlagsSizeCheck;
      static_assert(sizeof(InputControlLayout::ControlItem::Flags) == 0x4);
      public:
      // private UnityEngine.InputSystem.Utilities.InternedString <name>k__BackingField
      // Size: 0x10
      // Offset: 0x0
      ::UnityEngine::InputSystem::Utilities::InternedString name;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
      // private UnityEngine.InputSystem.Utilities.InternedString <layout>k__BackingField
      // Size: 0x10
      // Offset: 0x10
      ::UnityEngine::InputSystem::Utilities::InternedString layout;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
      // private UnityEngine.InputSystem.Utilities.InternedString <variants>k__BackingField
      // Size: 0x10
      // Offset: 0x20
      ::UnityEngine::InputSystem::Utilities::InternedString variants;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
      // private System.String <useStateFrom>k__BackingField
      // Size: 0x8
      // Offset: 0x30
      ::StringW useStateFrom;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // private System.String <displayName>k__BackingField
      // Size: 0x8
      // Offset: 0x38
      ::StringW displayName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // private System.String <shortDisplayName>k__BackingField
      // Size: 0x8
      // Offset: 0x40
      ::StringW shortDisplayName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // private UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.InternedString> <usages>k__BackingField
      // Size: 0xFFFFFFFF
      // Offset: 0x48
      ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> usages;
      // private UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.InternedString> <aliases>k__BackingField
      // Size: 0xFFFFFFFF
      // Offset: 0x58
      ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> aliases;
      // private UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.NamedValue> <parameters>k__BackingField
      // Size: 0xFFFFFFFF
      // Offset: 0x68
      ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> parameters;
      // private UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.NameAndParameters> <processors>k__BackingField
      // Size: 0xFFFFFFFF
      // Offset: 0x78
      ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> processors;
      // private System.UInt32 <offset>k__BackingField
      // Size: 0x4
      // Offset: 0x88
      uint offset;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // private System.UInt32 <bit>k__BackingField
      // Size: 0x4
      // Offset: 0x8C
      uint bit;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // private System.UInt32 <sizeInBits>k__BackingField
      // Size: 0x4
      // Offset: 0x90
      uint sizeInBits;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // private UnityEngine.InputSystem.Utilities.FourCC <format>k__BackingField
      // Size: 0x4
      // Offset: 0x94
      ::UnityEngine::InputSystem::Utilities::FourCC format;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Utilities::FourCC) == 0x4);
      // private UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags <flags>k__BackingField
      // Size: 0x4
      // Offset: 0x98
      ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags flags;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags) == 0x4);
      // private System.Int32 <arraySize>k__BackingField
      // Size: 0x4
      // Offset: 0x9C
      int arraySize;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private UnityEngine.InputSystem.Utilities.PrimitiveValue <defaultState>k__BackingField
      // Size: 0xC
      // Offset: 0xA0
      ::UnityEngine::InputSystem::Utilities::PrimitiveValue defaultState;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Utilities::PrimitiveValue) == 0xC);
      // private UnityEngine.InputSystem.Utilities.PrimitiveValue <minValue>k__BackingField
      // Size: 0xC
      // Offset: 0xB0
      ::UnityEngine::InputSystem::Utilities::PrimitiveValue minValue;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Utilities::PrimitiveValue) == 0xC);
      // private UnityEngine.InputSystem.Utilities.PrimitiveValue <maxValue>k__BackingField
      // Size: 0xC
      // Offset: 0xC0
      ::UnityEngine::InputSystem::Utilities::PrimitiveValue maxValue;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Utilities::PrimitiveValue) == 0xC);
      public:
      // Creating value type constructor for type: ControlItem
      constexpr ControlItem(::UnityEngine::InputSystem::Utilities::InternedString name_ = {}, ::UnityEngine::InputSystem::Utilities::InternedString layout_ = {}, ::UnityEngine::InputSystem::Utilities::InternedString variants_ = {}, ::StringW useStateFrom_ = {}, ::StringW displayName_ = {}, ::StringW shortDisplayName_ = {}, ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> usages_ = {}, ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> aliases_ = {}, ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> parameters_ = {}, ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> processors_ = {}, uint offset_ = {}, uint bit_ = {}, uint sizeInBits_ = {}, ::UnityEngine::InputSystem::Utilities::FourCC format_ = {}, ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags flags_ = {}, int arraySize_ = {}, ::UnityEngine::InputSystem::Utilities::PrimitiveValue defaultState_ = {}, ::UnityEngine::InputSystem::Utilities::PrimitiveValue minValue_ = {}, ::UnityEngine::InputSystem::Utilities::PrimitiveValue maxValue_ = {}) noexcept : name{name_}, layout{layout_}, variants{variants_}, useStateFrom{useStateFrom_}, displayName{displayName_}, shortDisplayName{shortDisplayName_}, usages{usages_}, aliases{aliases_}, parameters{parameters_}, processors{processors_}, offset{offset_}, bit{bit_}, sizeInBits{sizeInBits_}, format{format_}, flags{flags_}, arraySize{arraySize_}, defaultState{defaultState_}, minValue{minValue_}, maxValue{maxValue_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.InternedString <name>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::InternedString& dyn_$name$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.InternedString <layout>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::InternedString& dyn_$layout$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.InternedString <variants>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::InternedString& dyn_$variants$k__BackingField();
      // Get instance field reference: private System.String <useStateFrom>k__BackingField
      [[deprecated("Use field access instead!")]] ::StringW& dyn_$useStateFrom$k__BackingField();
      // Get instance field reference: private System.String <displayName>k__BackingField
      [[deprecated("Use field access instead!")]] ::StringW& dyn_$displayName$k__BackingField();
      // Get instance field reference: private System.String <shortDisplayName>k__BackingField
      [[deprecated("Use field access instead!")]] ::StringW& dyn_$shortDisplayName$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.InternedString> <usages>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString>& dyn_$usages$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.InternedString> <aliases>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString>& dyn_$aliases$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.NamedValue> <parameters>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue>& dyn_$parameters$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.NameAndParameters> <processors>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters>& dyn_$processors$k__BackingField();
      // Get instance field reference: private System.UInt32 <offset>k__BackingField
      [[deprecated("Use field access instead!")]] uint& dyn_$offset$k__BackingField();
      // Get instance field reference: private System.UInt32 <bit>k__BackingField
      [[deprecated("Use field access instead!")]] uint& dyn_$bit$k__BackingField();
      // Get instance field reference: private System.UInt32 <sizeInBits>k__BackingField
      [[deprecated("Use field access instead!")]] uint& dyn_$sizeInBits$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.FourCC <format>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::FourCC& dyn_$format$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags <flags>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags& dyn_$flags$k__BackingField();
      // Get instance field reference: private System.Int32 <arraySize>k__BackingField
      [[deprecated("Use field access instead!")]] int& dyn_$arraySize$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.PrimitiveValue <defaultState>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::PrimitiveValue& dyn_$defaultState$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.PrimitiveValue <minValue>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::PrimitiveValue& dyn_$minValue$k__BackingField();
      // Get instance field reference: private UnityEngine.InputSystem.Utilities.PrimitiveValue <maxValue>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::PrimitiveValue& dyn_$maxValue$k__BackingField();
      // public UnityEngine.InputSystem.Utilities.InternedString get_name()
      // Offset: 0xA534E8
      ::UnityEngine::InputSystem::Utilities::InternedString get_name();
      // System.Void set_name(UnityEngine.InputSystem.Utilities.InternedString value)
      // Offset: 0xA534F4
      void set_name(::UnityEngine::InputSystem::Utilities::InternedString value);
      // public UnityEngine.InputSystem.Utilities.InternedString get_layout()
      // Offset: 0xA534FC
      ::UnityEngine::InputSystem::Utilities::InternedString get_layout();
      // System.Void set_layout(UnityEngine.InputSystem.Utilities.InternedString value)
      // Offset: 0xA53508
      void set_layout(::UnityEngine::InputSystem::Utilities::InternedString value);
      // public UnityEngine.InputSystem.Utilities.InternedString get_variants()
      // Offset: 0xA53510
      ::UnityEngine::InputSystem::Utilities::InternedString get_variants();
      // System.Void set_variants(UnityEngine.InputSystem.Utilities.InternedString value)
      // Offset: 0xA5351C
      void set_variants(::UnityEngine::InputSystem::Utilities::InternedString value);
      // public System.String get_useStateFrom()
      // Offset: 0xA53524
      ::StringW get_useStateFrom();
      // System.Void set_useStateFrom(System.String value)
      // Offset: 0xA5352C
      void set_useStateFrom(::StringW value);
      // public System.String get_displayName()
      // Offset: 0xA53534
      ::StringW get_displayName();
      // System.Void set_displayName(System.String value)
      // Offset: 0xA5353C
      void set_displayName(::StringW value);
      // public System.String get_shortDisplayName()
      // Offset: 0xA53544
      ::StringW get_shortDisplayName();
      // System.Void set_shortDisplayName(System.String value)
      // Offset: 0xA5354C
      void set_shortDisplayName(::StringW value);
      // public UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.InternedString> get_usages()
      // Offset: 0xA53554
      ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> get_usages();
      // System.Void set_usages(UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.InternedString> value)
      // Offset: 0xA53560
      void set_usages(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> value);
      // public UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.InternedString> get_aliases()
      // Offset: 0xA53568
      ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> get_aliases();
      // System.Void set_aliases(UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.InternedString> value)
      // Offset: 0xA53574
      void set_aliases(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> value);
      // public UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.NamedValue> get_parameters()
      // Offset: 0xA5357C
      ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> get_parameters();
      // System.Void set_parameters(UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.NamedValue> value)
      // Offset: 0xA53588
      void set_parameters(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> value);
      // public UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.NameAndParameters> get_processors()
      // Offset: 0xA53590
      ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> get_processors();
      // System.Void set_processors(UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.Utilities.NameAndParameters> value)
      // Offset: 0xA5359C
      void set_processors(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> value);
      // public System.UInt32 get_offset()
      // Offset: 0xA535A4
      uint get_offset();
      // System.Void set_offset(System.UInt32 value)
      // Offset: 0xA535AC
      void set_offset(uint value);
      // public System.UInt32 get_bit()
      // Offset: 0xA535B4
      uint get_bit();
      // System.Void set_bit(System.UInt32 value)
      // Offset: 0xA535BC
      void set_bit(uint value);
      // public System.UInt32 get_sizeInBits()
      // Offset: 0xA535C4
      uint get_sizeInBits();
      // System.Void set_sizeInBits(System.UInt32 value)
      // Offset: 0xA535CC
      void set_sizeInBits(uint value);
      // public UnityEngine.InputSystem.Utilities.FourCC get_format()
      // Offset: 0xA535D4
      ::UnityEngine::InputSystem::Utilities::FourCC get_format();
      // System.Void set_format(UnityEngine.InputSystem.Utilities.FourCC value)
      // Offset: 0xA535DC
      void set_format(::UnityEngine::InputSystem::Utilities::FourCC value);
      // private UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags get_flags()
      // Offset: 0xA535E4
      ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags get_flags();
      // private System.Void set_flags(UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem/UnityEngine.InputSystem.Layouts.Flags value)
      // Offset: 0xA535EC
      void set_flags(::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem::Flags value);
      // public System.Int32 get_arraySize()
      // Offset: 0xA535F4
      int get_arraySize();
      // System.Void set_arraySize(System.Int32 value)
      // Offset: 0xA535FC
      void set_arraySize(int value);
      // public UnityEngine.InputSystem.Utilities.PrimitiveValue get_defaultState()
      // Offset: 0xA53604
      ::UnityEngine::InputSystem::Utilities::PrimitiveValue get_defaultState();
      // System.Void set_defaultState(UnityEngine.InputSystem.Utilities.PrimitiveValue value)
      // Offset: 0xA53610
      void set_defaultState(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);
      // public UnityEngine.InputSystem.Utilities.PrimitiveValue get_minValue()
      // Offset: 0xA53618
      ::UnityEngine::InputSystem::Utilities::PrimitiveValue get_minValue();
      // System.Void set_minValue(UnityEngine.InputSystem.Utilities.PrimitiveValue value)
      // Offset: 0xA53624
      void set_minValue(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);
      // public UnityEngine.InputSystem.Utilities.PrimitiveValue get_maxValue()
      // Offset: 0xA5362C
      ::UnityEngine::InputSystem::Utilities::PrimitiveValue get_maxValue();
      // System.Void set_maxValue(UnityEngine.InputSystem.Utilities.PrimitiveValue value)
      // Offset: 0xA53638
      void set_maxValue(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);
      // public System.Boolean get_isModifyingExistingControl()
      // Offset: 0xA53640
      bool get_isModifyingExistingControl();
      // System.Void set_isModifyingExistingControl(System.Boolean value)
      // Offset: 0xA5364C
      void set_isModifyingExistingControl(bool value);
      // public System.Boolean get_isNoisy()
      // Offset: 0xA53668
      bool get_isNoisy();
      // System.Void set_isNoisy(System.Boolean value)
      // Offset: 0xA53674
      void set_isNoisy(bool value);
      // public System.Boolean get_isSynthetic()
      // Offset: 0xA53690
      bool get_isSynthetic();
      // System.Void set_isSynthetic(System.Boolean value)
      // Offset: 0xA5369C
      void set_isSynthetic(bool value);
      // public System.Boolean get_isFirstDefinedInThisLayout()
      // Offset: 0xA536B8
      bool get_isFirstDefinedInThisLayout();
      // System.Void set_isFirstDefinedInThisLayout(System.Boolean value)
      // Offset: 0xA536C4
      void set_isFirstDefinedInThisLayout(bool value);
      // public System.Boolean get_isArray()
      // Offset: 0xA536E0
      bool get_isArray();
      // public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem Merge(UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem other)
      // Offset: 0xA536F0
      ::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem Merge(::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem other);
    }; // UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem
    // WARNING Not writing size check since size may be invalid!
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct Flags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Flags
      constexpr Flags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags IsGenericTypeOfDevice
      static constexpr const int IsGenericTypeOfDevice = 1;
      // Get static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags IsGenericTypeOfDevice
      static ::UnityEngine::InputSystem::Layouts::InputControlLayout::Flags _get_IsGenericTypeOfDevice();
      // Set static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags IsGenericTypeOfDevice
      static void _set_IsGenericTypeOfDevice(::UnityEngine::InputSystem::Layouts::InputControlLayout::Flags value);
      // static field const value: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags HideInUI
      static constexpr const int HideInUI = 2;
      // Get static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags HideInUI
      static ::UnityEngine::InputSystem::Layouts::InputControlLayout::Flags _get_HideInUI();
      // Set static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags HideInUI
      static void _set_HideInUI(::UnityEngine::InputSystem::Layouts::InputControlLayout::Flags value);
      // static field const value: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags IsOverride
      static constexpr const int IsOverride = 4;
      // Get static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags IsOverride
      static ::UnityEngine::InputSystem::Layouts::InputControlLayout::Flags _get_IsOverride();
      // Set static field: static public UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags IsOverride
      static void _set_IsOverride(::UnityEngine::InputSystem::Layouts::InputControlLayout::Flags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags
    #pragma pack(pop)
    static check_size<sizeof(InputControlLayout::Flags), 0 + sizeof(int)> __UnityEngine_InputSystem_Layouts_InputControlLayout_FlagsSizeCheck;
    static_assert(sizeof(InputControlLayout::Flags) == 0x4);
    // Size: 0x38
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Collection
    // [TokenAttribute] Offset: FFFFFFFF
    struct Collection/*, public ::System::ValueType*/ {
      public:
      // Nested type: ::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection::LayoutMatcher
      struct LayoutMatcher;
      // Size: 0x18
      #pragma pack(push, 1)
      // WARNING Layout: Sequential may not be correctly taken into account!
      // Autogenerated type: UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Collection/UnityEngine.InputSystem.Layouts.LayoutMatcher
      // [TokenAttribute] Offset: FFFFFFFF
      struct LayoutMatcher/*, public ::System::ValueType*/ {
        public:
        public:
        // public UnityEngine.InputSystem.Utilities.InternedString layoutName
        // Size: 0x10
        // Offset: 0x0
        ::UnityEngine::InputSystem::Utilities::InternedString layoutName;
        // Field size check
        static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
        // public UnityEngine.InputSystem.Layouts.InputDeviceMatcher deviceMatcher
        // Size: 0x8
        // Offset: 0x10
        ::UnityEngine::InputSystem::Layouts::InputDeviceMatcher deviceMatcher;
        // Field size check
        static_assert(sizeof(::UnityEngine::InputSystem::Layouts::InputDeviceMatcher) == 0x8);
        public:
        // Creating value type constructor for type: LayoutMatcher
        constexpr LayoutMatcher(::UnityEngine::InputSystem::Utilities::InternedString layoutName_ = {}, ::UnityEngine::InputSystem::Layouts::InputDeviceMatcher deviceMatcher_ = {}) noexcept : layoutName{layoutName_}, deviceMatcher{deviceMatcher_} {}
        // Creating interface conversion operator: operator ::System::ValueType
        operator ::System::ValueType() noexcept {
          return *reinterpret_cast<::System::ValueType*>(this);
        }
        // Get instance field reference: public UnityEngine.InputSystem.Utilities.InternedString layoutName
        [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::InternedString& dyn_layoutName();
        // Get instance field reference: public UnityEngine.InputSystem.Layouts.InputDeviceMatcher deviceMatcher
        [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Layouts::InputDeviceMatcher& dyn_deviceMatcher();
      }; // UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Collection/UnityEngine.InputSystem.Layouts.LayoutMatcher
      #pragma pack(pop)
      static check_size<sizeof(InputControlLayout::Collection::LayoutMatcher), 16 + sizeof(::UnityEngine::InputSystem::Layouts::InputDeviceMatcher)> __UnityEngine_InputSystem_Layouts_InputControlLayout_Collection_LayoutMatcherSizeCheck;
      static_assert(sizeof(InputControlLayout::Collection::LayoutMatcher) == 0x18);
      public:
      // public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,System.Type> layoutTypes
      // Size: 0x8
      // Offset: 0x0
      ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::System::Type*>* layoutTypes;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::System::Type*>*) == 0x8);
      // public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,System.String> layoutStrings
      // Size: 0x8
      // Offset: 0x8
      ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::StringW>* layoutStrings;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::StringW>*) == 0x8);
      // public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,System.Func`1<UnityEngine.InputSystem.Layouts.InputControlLayout>> layoutBuilders
      // Size: 0x8
      // Offset: 0x10
      ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::System::Func_1<::UnityEngine::InputSystem::Layouts::InputControlLayout*>*>* layoutBuilders;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::System::Func_1<::UnityEngine::InputSystem::Layouts::InputControlLayout*>*>*) == 0x8);
      // public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,UnityEngine.InputSystem.Utilities.InternedString> baseLayoutTable
      // Size: 0x8
      // Offset: 0x18
      ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Utilities::InternedString>* baseLayoutTable;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Utilities::InternedString>*) == 0x8);
      // public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,UnityEngine.InputSystem.Utilities.InternedString[]> layoutOverrides
      // Size: 0x8
      // Offset: 0x20
      ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>>* layoutOverrides;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>>*) == 0x8);
      // public System.Collections.Generic.HashSet`1<UnityEngine.InputSystem.Utilities.InternedString> layoutOverrideNames
      // Size: 0x8
      // Offset: 0x28
      ::System::Collections::Generic::HashSet_1<::UnityEngine::InputSystem::Utilities::InternedString>* layoutOverrideNames;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::HashSet_1<::UnityEngine::InputSystem::Utilities::InternedString>*) == 0x8);
      // public System.Collections.Generic.List`1<UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Collection/UnityEngine.InputSystem.Layouts.LayoutMatcher> layoutMatchers
      // Size: 0x8
      // Offset: 0x30
      ::System::Collections::Generic::List_1<::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection::LayoutMatcher>* layoutMatchers;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection::LayoutMatcher>*) == 0x8);
      public:
      // Creating value type constructor for type: Collection
      constexpr Collection(::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::System::Type*>* layoutTypes_ = {}, ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::StringW>* layoutStrings_ = {}, ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::System::Func_1<::UnityEngine::InputSystem::Layouts::InputControlLayout*>*>* layoutBuilders_ = {}, ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Utilities::InternedString>* baseLayoutTable_ = {}, ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>>* layoutOverrides_ = {}, ::System::Collections::Generic::HashSet_1<::UnityEngine::InputSystem::Utilities::InternedString>* layoutOverrideNames_ = {}, ::System::Collections::Generic::List_1<::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection::LayoutMatcher>* layoutMatchers_ = {}) noexcept : layoutTypes{layoutTypes_}, layoutStrings{layoutStrings_}, layoutBuilders{layoutBuilders_}, baseLayoutTable{baseLayoutTable_}, layoutOverrides{layoutOverrides_}, layoutOverrideNames{layoutOverrideNames_}, layoutMatchers{layoutMatchers_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // static field const value: static public System.Single kBaseScoreForNonGeneratedLayouts
      static constexpr const float kBaseScoreForNonGeneratedLayouts = 1;
      // Get static field: static public System.Single kBaseScoreForNonGeneratedLayouts
      static float _get_kBaseScoreForNonGeneratedLayouts();
      // Set static field: static public System.Single kBaseScoreForNonGeneratedLayouts
      static void _set_kBaseScoreForNonGeneratedLayouts(float value);
      // Get instance field reference: public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,System.Type> layoutTypes
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::System::Type*>*& dyn_layoutTypes();
      // Get instance field reference: public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,System.String> layoutStrings
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::StringW>*& dyn_layoutStrings();
      // Get instance field reference: public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,System.Func`1<UnityEngine.InputSystem.Layouts.InputControlLayout>> layoutBuilders
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::System::Func_1<::UnityEngine::InputSystem::Layouts::InputControlLayout*>*>*& dyn_layoutBuilders();
      // Get instance field reference: public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,UnityEngine.InputSystem.Utilities.InternedString> baseLayoutTable
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Utilities::InternedString>*& dyn_baseLayoutTable();
      // Get instance field reference: public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,UnityEngine.InputSystem.Utilities.InternedString[]> layoutOverrides
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>>*& dyn_layoutOverrides();
      // Get instance field reference: public System.Collections.Generic.HashSet`1<UnityEngine.InputSystem.Utilities.InternedString> layoutOverrideNames
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::HashSet_1<::UnityEngine::InputSystem::Utilities::InternedString>*& dyn_layoutOverrideNames();
      // Get instance field reference: public System.Collections.Generic.List`1<UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Collection/UnityEngine.InputSystem.Layouts.LayoutMatcher> layoutMatchers
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection::LayoutMatcher>*& dyn_layoutMatchers();
      // public System.Void Allocate()
      // Offset: 0xA533C4
      void Allocate();
      // public UnityEngine.InputSystem.Utilities.InternedString TryFindLayoutForType(System.Type layoutType)
      // Offset: 0xA533CC
      ::UnityEngine::InputSystem::Utilities::InternedString TryFindLayoutForType(::System::Type* layoutType);
      // public UnityEngine.InputSystem.Utilities.InternedString TryFindMatchingLayout(UnityEngine.InputSystem.Layouts.InputDeviceDescription deviceDescription)
      // Offset: 0xA533D4
      ::UnityEngine::InputSystem::Utilities::InternedString TryFindMatchingLayout(::UnityEngine::InputSystem::Layouts::InputDeviceDescription deviceDescription);
      // public System.Boolean HasLayout(UnityEngine.InputSystem.Utilities.InternedString name)
      // Offset: 0xA53410
      bool HasLayout(::UnityEngine::InputSystem::Utilities::InternedString name);
      // private UnityEngine.InputSystem.Layouts.InputControlLayout TryLoadLayoutInternal(UnityEngine.InputSystem.Utilities.InternedString name)
      // Offset: 0xA53418
      ::UnityEngine::InputSystem::Layouts::InputControlLayout* TryLoadLayoutInternal(::UnityEngine::InputSystem::Utilities::InternedString name);
      // public UnityEngine.InputSystem.Layouts.InputControlLayout TryLoadLayout(UnityEngine.InputSystem.Utilities.InternedString name, System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,UnityEngine.InputSystem.Layouts.InputControlLayout> table)
      // Offset: 0xA53420
      ::UnityEngine::InputSystem::Layouts::InputControlLayout* TryLoadLayout(::UnityEngine::InputSystem::Utilities::InternedString name, ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Layouts::InputControlLayout*>* table);
      // public UnityEngine.InputSystem.Utilities.InternedString GetBaseLayoutName(UnityEngine.InputSystem.Utilities.InternedString layoutName)
      // Offset: 0xA53428
      ::UnityEngine::InputSystem::Utilities::InternedString GetBaseLayoutName(::UnityEngine::InputSystem::Utilities::InternedString layoutName);
      // public UnityEngine.InputSystem.Utilities.InternedString GetRootLayoutName(UnityEngine.InputSystem.Utilities.InternedString layoutName)
      // Offset: 0xA53430
      ::UnityEngine::InputSystem::Utilities::InternedString GetRootLayoutName(::UnityEngine::InputSystem::Utilities::InternedString layoutName);
      // public System.Boolean ComputeDistanceInInheritanceHierarchy(UnityEngine.InputSystem.Utilities.InternedString firstLayout, UnityEngine.InputSystem.Utilities.InternedString secondLayout, out System.Int32 distance)
      // Offset: 0xA53438
      bool ComputeDistanceInInheritanceHierarchy(::UnityEngine::InputSystem::Utilities::InternedString firstLayout, ::UnityEngine::InputSystem::Utilities::InternedString secondLayout, ByRef<int> distance);
      // public UnityEngine.InputSystem.Utilities.InternedString FindLayoutThatIntroducesControl(UnityEngine.InputSystem.InputControl control, UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Cache cache)
      // Offset: 0xA53440
      ::UnityEngine::InputSystem::Utilities::InternedString FindLayoutThatIntroducesControl(::UnityEngine::InputSystem::InputControl* control, ::UnityEngine::InputSystem::Layouts::InputControlLayout::Cache cache);
      // public System.Type GetControlTypeForLayout(UnityEngine.InputSystem.Utilities.InternedString layoutName)
      // Offset: 0xA53448
      ::System::Type* GetControlTypeForLayout(::UnityEngine::InputSystem::Utilities::InternedString layoutName);
      // public System.Boolean ValueTypeIsAssignableFrom(UnityEngine.InputSystem.Utilities.InternedString layoutName, System.Type valueType)
      // Offset: 0xA53450
      bool ValueTypeIsAssignableFrom(::UnityEngine::InputSystem::Utilities::InternedString layoutName, ::System::Type* valueType);
      // public System.Boolean IsGeneratedLayout(UnityEngine.InputSystem.Utilities.InternedString layout)
      // Offset: 0xA53458
      bool IsGeneratedLayout(::UnityEngine::InputSystem::Utilities::InternedString layout);
      // public System.Boolean IsBasedOn(UnityEngine.InputSystem.Utilities.InternedString parentLayout, UnityEngine.InputSystem.Utilities.InternedString childLayout)
      // Offset: 0xA53460
      bool IsBasedOn(::UnityEngine::InputSystem::Utilities::InternedString parentLayout, ::UnityEngine::InputSystem::Utilities::InternedString childLayout);
      // public System.Void AddMatcher(UnityEngine.InputSystem.Utilities.InternedString layout, UnityEngine.InputSystem.Layouts.InputDeviceMatcher matcher)
      // Offset: 0xA53468
      void AddMatcher(::UnityEngine::InputSystem::Utilities::InternedString layout, ::UnityEngine::InputSystem::Layouts::InputDeviceMatcher matcher);
    }; // UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Collection
    #pragma pack(pop)
    static check_size<sizeof(InputControlLayout::Collection), 48 + sizeof(::System::Collections::Generic::List_1<::UnityEngine::InputSystem::Layouts::InputControlLayout::Collection::LayoutMatcher>*)> __UnityEngine_InputSystem_Layouts_InputControlLayout_CollectionSizeCheck;
    static_assert(sizeof(InputControlLayout::Collection) == 0x38);
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Cache
    // [TokenAttribute] Offset: FFFFFFFF
    struct Cache/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,UnityEngine.InputSystem.Layouts.InputControlLayout> table
      // Size: 0x8
      // Offset: 0x0
      ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Layouts::InputControlLayout*>* table;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Layouts::InputControlLayout*>*) == 0x8);
      public:
      // Creating value type constructor for type: Cache
      constexpr Cache(::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Layouts::InputControlLayout*>* table_ = {}) noexcept : table{table_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating conversion operator: operator ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Layouts::InputControlLayout*>*
      constexpr operator ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Layouts::InputControlLayout*>*() const noexcept {
        return table;
      }
      // Get instance field reference: public System.Collections.Generic.Dictionary`2<UnityEngine.InputSystem.Utilities.InternedString,UnityEngine.InputSystem.Layouts.InputControlLayout> table
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Layouts::InputControlLayout*>*& dyn_table();
      // public System.Void Clear()
      // Offset: 0xA53348
      void Clear();
      // public UnityEngine.InputSystem.Layouts.InputControlLayout FindOrLoadLayout(System.String name, System.Boolean throwIfNotFound)
      // Offset: 0xA53350
      ::UnityEngine::InputSystem::Layouts::InputControlLayout* FindOrLoadLayout(::StringW name, bool throwIfNotFound);
    }; // UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Cache
    #pragma pack(pop)
    static check_size<sizeof(InputControlLayout::Cache), 0 + sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::InputSystem::Utilities::InternedString, ::UnityEngine::InputSystem::Layouts::InputControlLayout*>*)> __UnityEngine_InputSystem_Layouts_InputControlLayout_CacheSizeCheck;
    static_assert(sizeof(InputControlLayout::Cache) == 0x8);
    public:
    // private UnityEngine.InputSystem.Utilities.InternedString m_Name
    // Size: 0x10
    // Offset: 0x10
    ::UnityEngine::InputSystem::Utilities::InternedString m_Name;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
    // private System.Type m_Type
    // Size: 0x8
    // Offset: 0x20
    ::System::Type* m_Type;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private UnityEngine.InputSystem.Utilities.InternedString m_Variants
    // Size: 0x10
    // Offset: 0x28
    ::UnityEngine::InputSystem::Utilities::InternedString m_Variants;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::InternedString) == 0x10);
    // private UnityEngine.InputSystem.Utilities.FourCC m_StateFormat
    // Size: 0x4
    // Offset: 0x38
    ::UnityEngine::InputSystem::Utilities::FourCC m_StateFormat;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Utilities::FourCC) == 0x4);
    // System.Int32 m_StateSizeInBytes
    // Size: 0x4
    // Offset: 0x3C
    int m_StateSizeInBytes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Nullable`1<System.Boolean> m_UpdateBeforeRender
    // Size: 0xFFFFFFFF
    // Offset: 0x40
    ::System::Nullable_1<bool> m_UpdateBeforeRender;
    // UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.Utilities.InternedString> m_BaseLayouts
    // Size: 0xFFFFFFFF
    // Offset: 0x48
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::Utilities::InternedString> m_BaseLayouts;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.Utilities.InternedString> m_AppliedOverrides
    // Size: 0xFFFFFFFF
    // Offset: 0x68
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::Utilities::InternedString> m_AppliedOverrides;
    // private UnityEngine.InputSystem.Utilities.InternedString[] m_CommonUsages
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString> m_CommonUsages;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>) == 0x8);
    // UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.ControlItem[] m_Controls
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem> m_Controls;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::Layouts::InputControlLayout::ControlItem>) == 0x8);
    // System.String m_DisplayName
    // Size: 0x8
    // Offset: 0x98
    ::StringW m_DisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_Description
    // Size: 0x8
    // Offset: 0xA0
    ::StringW m_Description;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.InputSystem.Layouts.InputControlLayout/UnityEngine.InputSystem.Layouts.Flags m_Flags
    // Size: 0x4
    // Offset: 0xA8
    ::UnityEngine::InputSystem::Layouts::InputControlLayout::Flags m_Flags;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Layouts::InputControlLayout::Flags) == 0x4);
    public:
    // Get static field: static private UnityEngine.InputSystem.Utilities.InternedString s_DefaultVariant
    static ::UnityEngine::InputSystem::Utilities::InternedString _get_s_DefaultVariant();
    // Set static field: static private UnityEngine.InputSystem.Utilities.InternedString s_DefaultVariant
    static void _set_s_DefaultVariant(::UnityEngine::InputSystem::Utilities::InternedString value);
    // static field const value: static public System.String VariantSeparator
    static constexpr const char* VariantSeparator = ";";
    // Get static field: static public System.String VariantSeparator
    static ::StringW _get_VariantSeparator();
    // Set static field: static public System.String VariantSeparator
    static void _set_VariantSeparator(::StringW value);
