// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.EventArgs
#include "System/EventArgs.hpp"
// Including type: System.ComponentModel.ListChangedType
#include "System/ComponentModel/ListChangedType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: PropertyDescriptor
  class PropertyDescriptor;
}
// Completed forward declares
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: ListChangedEventArgs
  class ListChangedEventArgs;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::ComponentModel::ListChangedEventArgs);
DEFINE_IL2CPP_ARG_TYPE(System::ComponentModel::ListChangedEventArgs*, "System.ComponentModel", "ListChangedEventArgs");
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Size: 0x28
  #pragma pack(push, 1)
  // Autogenerated type: System.ComponentModel.ListChangedEventArgs
  // [TokenAttribute] Offset: FFFFFFFF
  class ListChangedEventArgs : public System::EventArgs {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.ComponentModel.ListChangedType listChangedType
    // Size: 0x4
    // Offset: 0x10
    System::ComponentModel::ListChangedType listChangedType;
    // Field size check
    static_assert(sizeof(System::ComponentModel::ListChangedType) == 0x4);
    // private System.Int32 newIndex
    // Size: 0x4
    // Offset: 0x14
    int newIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 oldIndex
    // Size: 0x4
    // Offset: 0x18
    int oldIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: oldIndex and: propDesc
    char __padding2[0x4] = {};
    // private System.ComponentModel.PropertyDescriptor propDesc
    // Size: 0x8
    // Offset: 0x20
    System::ComponentModel::PropertyDescriptor* propDesc;
    // Field size check
    static_assert(sizeof(System::ComponentModel::PropertyDescriptor*) == 0x8);
    public:
    // Get instance field reference: private System.ComponentModel.ListChangedType listChangedType
    System::ComponentModel::ListChangedType& dyn_listChangedType();
    // Get instance field reference: private System.Int32 newIndex
    int& dyn_newIndex();
    // Get instance field reference: private System.Int32 oldIndex
    int& dyn_oldIndex();
    // Get instance field reference: private System.ComponentModel.PropertyDescriptor propDesc
    System::ComponentModel::PropertyDescriptor*& dyn_propDesc();
    // public System.ComponentModel.ListChangedType get_ListChangedType()
    // Offset: 0x1DFA2B8
    System::ComponentModel::ListChangedType get_ListChangedType();
    // public System.Int32 get_NewIndex()
    // Offset: 0x1DFA2C0
    int get_NewIndex();
    // public System.Int32 get_OldIndex()
    // Offset: 0x1DFA2C8
    int get_OldIndex();
    // public System.Void .ctor(System.ComponentModel.ListChangedType listChangedType, System.Int32 newIndex)
    // Offset: 0x1DFA160
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ListChangedEventArgs* New_ctor(System::ComponentModel::ListChangedType listChangedType, int newIndex) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::ComponentModel::ListChangedEventArgs::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ListChangedEventArgs*, creationType>(listChangedType, newIndex)));
    }
    // public System.Void .ctor(System.ComponentModel.ListChangedType listChangedType, System.Int32 newIndex, System.ComponentModel.PropertyDescriptor propDesc)
    // Offset: 0x1DFA1F8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ListChangedEventArgs* New_ctor(System::ComponentModel::ListChangedType listChangedType, int newIndex, System::ComponentModel::PropertyDescriptor* propDesc) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::ComponentModel::ListChangedEventArgs::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ListChangedEventArgs*, creationType>(listChangedType, newIndex, propDesc)));
    }
    // public System.Void .ctor(System.ComponentModel.ListChangedType listChangedType, System.ComponentModel.PropertyDescriptor propDesc)
    // Offset: 0x1DFA234
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ListChangedEventArgs* New_ctor(System::ComponentModel::ListChangedType listChangedType, System::ComponentModel::PropertyDescriptor* propDesc) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::ComponentModel::ListChangedEventArgs::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ListChangedEventArgs*, creationType>(listChangedType, propDesc)));
    }
    // public System.Void .ctor(System.ComponentModel.ListChangedType listChangedType, System.Int32 newIndex, System.Int32 oldIndex)
    // Offset: 0x1DFA168
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ListChangedEventArgs* New_ctor(System::ComponentModel::ListChangedType listChangedType, int newIndex, int oldIndex) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::ComponentModel::ListChangedEventArgs::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ListChangedEventArgs*, creationType>(listChangedType, newIndex, oldIndex)));
    }
  }; // System.ComponentModel.ListChangedEventArgs
  #pragma pack(pop)
  static check_size<sizeof(ListChangedEventArgs), 32 + sizeof(System::ComponentModel::PropertyDescriptor*)> __System_ComponentModel_ListChangedEventArgsSizeCheck;
  static_assert(sizeof(ListChangedEventArgs) == 0x28);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::ComponentModel::ListChangedEventArgs::get_ListChangedType
// Il2CppName: get_ListChangedType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::ComponentModel::ListChangedType (System::ComponentModel::ListChangedEventArgs::*)()>(&System::ComponentModel::ListChangedEventArgs::get_ListChangedType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::ComponentModel::ListChangedEventArgs*), "get_ListChangedType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::ComponentModel::ListChangedEventArgs::get_NewIndex
// Il2CppName: get_NewIndex
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (System::ComponentModel::ListChangedEventArgs::*)()>(&System::ComponentModel::ListChangedEventArgs::get_NewIndex)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::ComponentModel::ListChangedEventArgs*), "get_NewIndex", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::ComponentModel::ListChangedEventArgs::get_OldIndex
// Il2CppName: get_OldIndex
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (System::ComponentModel::ListChangedEventArgs::*)()>(&System::ComponentModel::ListChangedEventArgs::get_OldIndex)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::ComponentModel::ListChangedEventArgs*), "get_OldIndex", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::ComponentModel::ListChangedEventArgs::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::ComponentModel::ListChangedEventArgs::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::ComponentModel::ListChangedEventArgs::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::ComponentModel::ListChangedEventArgs::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
