// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ComponentModel.MemberDescriptor
#include "System/ComponentModel/MemberDescriptor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: TypeConverter
  class TypeConverter;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Attribute
  class Attribute;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IList
  class IList;
}
// Completed forward declares
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: PropertyDescriptor
  class PropertyDescriptor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::ComponentModel::PropertyDescriptor);
DEFINE_IL2CPP_ARG_TYPE(::System::ComponentModel::PropertyDescriptor*, "System.ComponentModel", "PropertyDescriptor");
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Size: 0x7C
  #pragma pack(push, 1)
  // Autogenerated type: System.ComponentModel.PropertyDescriptor
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: 1079D40
  class PropertyDescriptor : public ::System::ComponentModel::MemberDescriptor {
    public:
    public:
    // private System.ComponentModel.TypeConverter converter
    // Size: 0x8
    // Offset: 0x60
    ::System::ComponentModel::TypeConverter* converter;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::TypeConverter*) == 0x8);
    // private System.Object[] editors
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::Il2CppObject*> editors;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppObject*>) == 0x8);
    // private System.Type[] editorTypes
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::System::Type*> editorTypes;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Type*>) == 0x8);
    // private System.Int32 editorCount
    // Size: 0x4
    // Offset: 0x78
    int editorCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private System.ComponentModel.TypeConverter converter
    [[deprecated("Use field access instead!")]] ::System::ComponentModel::TypeConverter*& dyn_converter();
    // Get instance field reference: private System.Object[] editors
    [[deprecated("Use field access instead!")]] ::ArrayW<::Il2CppObject*>& dyn_editors();
    // Get instance field reference: private System.Type[] editorTypes
    [[deprecated("Use field access instead!")]] ::ArrayW<::System::Type*>& dyn_editorTypes();
    // Get instance field reference: private System.Int32 editorCount
    [[deprecated("Use field access instead!")]] int& dyn_editorCount();
    // public System.Type get_PropertyType()
    // Offset: 0xFFFFFFFFFFFFFFFF
    ::System::Type* get_PropertyType();
    // protected System.Void .ctor(System.String name, System.Attribute[] attrs)
    // Offset: 0x1E192E4
    // Implemented from: System.ComponentModel.MemberDescriptor
    // Base method: System.Void MemberDescriptor::.ctor(System.String name, System.Attribute[] attrs)
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PropertyDescriptor* New_ctor(::StringW name, ::ArrayW<::System::Attribute*> attrs) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::ComponentModel::PropertyDescriptor::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PropertyDescriptor*, creationType>(name, attrs)));
    }
    // public override System.Boolean Equals(System.Object obj)
    // Offset: 0x1E192E8
    // Implemented from: System.ComponentModel.MemberDescriptor
    // Base method: System.Boolean MemberDescriptor::Equals(System.Object obj)
    bool Equals(::Il2CppObject* obj);
    // protected override System.Void FillAttributes(System.Collections.IList attributeList)
    // Offset: 0x1E194E4
    // Implemented from: System.ComponentModel.MemberDescriptor
    // Base method: System.Void MemberDescriptor::FillAttributes(System.Collections.IList attributeList)
    void FillAttributes(::System::Collections::IList* attributeList);
    // public override System.Int32 GetHashCode()
    // Offset: 0x1E194F4
    // Implemented from: System.ComponentModel.MemberDescriptor
    // Base method: System.Int32 MemberDescriptor::GetHashCode()
    int GetHashCode();
  }; // System.ComponentModel.PropertyDescriptor
  #pragma pack(pop)
  static check_size<sizeof(PropertyDescriptor), 120 + sizeof(int)> __System_ComponentModel_PropertyDescriptorSizeCheck;
  static_assert(sizeof(PropertyDescriptor) == 0x7C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::ComponentModel::PropertyDescriptor::get_PropertyType
// Il2CppName: get_PropertyType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Type* (System::ComponentModel::PropertyDescriptor::*)()>(&System::ComponentModel::PropertyDescriptor::get_PropertyType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::ComponentModel::PropertyDescriptor*), "get_PropertyType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::ComponentModel::PropertyDescriptor::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::ComponentModel::PropertyDescriptor::Equals
// Il2CppName: Equals
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (System::ComponentModel::PropertyDescriptor::*)(::Il2CppObject*)>(&System::ComponentModel::PropertyDescriptor::Equals)> {
  static const MethodInfo* get() {
    static auto* obj = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::ComponentModel::PropertyDescriptor*), "Equals", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{obj});
  }
};
// Writing MetadataGetter for method: System::ComponentModel::PropertyDescriptor::FillAttributes
// Il2CppName: FillAttributes
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::ComponentModel::PropertyDescriptor::*)(::System::Collections::IList*)>(&System::ComponentModel::PropertyDescriptor::FillAttributes)> {
  static const MethodInfo* get() {
    static auto* attributeList = &::il2cpp_utils::GetClassFromName("System.Collections", "IList")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::ComponentModel::PropertyDescriptor*), "FillAttributes", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{attributeList});
  }
};
// Writing MetadataGetter for method: System::ComponentModel::PropertyDescriptor::GetHashCode
// Il2CppName: GetHashCode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (System::ComponentModel::PropertyDescriptor::*)()>(&System::ComponentModel::PropertyDescriptor::GetHashCode)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::ComponentModel::PropertyDescriptor*), "GetHashCode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
