// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ComponentModel.PropertyDescriptor
#include "System/ComponentModel/PropertyDescriptor.hpp"
// Including type: System.Collections.Specialized.BitVector32
#include "System/Collections/Specialized/BitVector32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Attribute
  class Attribute;
  // Forward declaring type: EventArgs
  class EventArgs;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: PropertyInfo
  class PropertyInfo;
  // Forward declaring type: MethodInfo
  class MethodInfo;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: EventDescriptor
  class EventDescriptor;
  // Forward declaring type: IExtenderProvider
  class IExtenderProvider;
}
// Forward declaring namespace: System::Diagnostics
namespace System::Diagnostics {
  // Forward declaring type: TraceSwitch
  class TraceSwitch;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IList
  class IList;
}
// Completed forward declares
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: ReflectPropertyDescriptor
  class ReflectPropertyDescriptor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::ComponentModel::ReflectPropertyDescriptor);
DEFINE_IL2CPP_ARG_TYPE(::System::ComponentModel::ReflectPropertyDescriptor*, "System.ComponentModel", "ReflectPropertyDescriptor");
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: System.ComponentModel.ReflectPropertyDescriptor
  // [TokenAttribute] Offset: FFFFFFFF
  class ReflectPropertyDescriptor : public ::System::ComponentModel::PropertyDescriptor {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Collections.Specialized.BitVector32 state
    // Size: 0x4
    // Offset: 0x84
    ::System::Collections::Specialized::BitVector32 state;
    // Field size check
    static_assert(sizeof(::System::Collections::Specialized::BitVector32) == 0x4);
    // private System.Type componentClass
    // Size: 0x8
    // Offset: 0x88
    ::System::Type* componentClass;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private System.Type type
    // Size: 0x8
    // Offset: 0x90
    ::System::Type* type;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private System.Object defaultValue
    // Size: 0x8
    // Offset: 0x98
    ::Il2CppObject* defaultValue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Reflection.PropertyInfo propInfo
    // Size: 0x8
    // Offset: 0xA0
    ::System::Reflection::PropertyInfo* propInfo;
    // Field size check
    static_assert(sizeof(::System::Reflection::PropertyInfo*) == 0x8);
    // private System.Reflection.MethodInfo getMethod
    // Size: 0x8
    // Offset: 0xA8
    ::System::Reflection::MethodInfo* getMethod;
    // Field size check
    static_assert(sizeof(::System::Reflection::MethodInfo*) == 0x8);
    // private System.Reflection.MethodInfo setMethod
    // Size: 0x8
    // Offset: 0xB0
    ::System::Reflection::MethodInfo* setMethod;
    // Field size check
    static_assert(sizeof(::System::Reflection::MethodInfo*) == 0x8);
    // private System.Reflection.MethodInfo shouldSerializeMethod
    // Size: 0x8
    // Offset: 0xB8
    ::System::Reflection::MethodInfo* shouldSerializeMethod;
    // Field size check
    static_assert(sizeof(::System::Reflection::MethodInfo*) == 0x8);
    // private System.ComponentModel.EventDescriptor realChangedEvent
    // Size: 0x8
    // Offset: 0xC0
    ::System::ComponentModel::EventDescriptor* realChangedEvent;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::EventDescriptor*) == 0x8);
    // private System.Type receiverType
    // Size: 0x8
    // Offset: 0xC8
    ::System::Type* receiverType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    public:
    // Get static field: static private readonly System.Type[] argsNone
    static ::ArrayW<::System::Type*> _get_argsNone();
    // Set static field: static private readonly System.Type[] argsNone
    static void _set_argsNone(::ArrayW<::System::Type*> value);
    // Get static field: static private readonly System.Object noValue
    static ::Il2CppObject* _get_noValue();
    // Set static field: static private readonly System.Object noValue
    static void _set_noValue(::Il2CppObject* value);
    // Get static field: static private System.Diagnostics.TraceSwitch PropDescCreateSwitch
    static ::System::Diagnostics::TraceSwitch* _get_PropDescCreateSwitch();
    // Set static field: static private System.Diagnostics.TraceSwitch PropDescCreateSwitch
    static void _set_PropDescCreateSwitch(::System::Diagnostics::TraceSwitch* value);
