// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Runtime.Serialization.Formatters.Binary.InternalPrimitiveTypeE
#include "System/Runtime/Serialization/Formatters/Binary/InternalPrimitiveTypeE.hpp"
// Including type: System.Runtime.Serialization.Formatters.Binary.InternalArrayTypeE
#include "System/Runtime/Serialization/Formatters/Binary/InternalArrayTypeE.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: System.Runtime.Serialization.Formatters.Binary
namespace System::Runtime::Serialization::Formatters::Binary {
  // Autogenerated type: System.Runtime.Serialization.Formatters.Binary.NameInfo
  class NameInfo : public ::Il2CppObject {
    public:
    // System.String NIFullName
    // Offset: 0x10
    ::Il2CppString* NIFullName;
    // System.Int64 NIobjectId
    // Offset: 0x18
    int64_t NIobjectId;
    // System.Int64 NIassemId
    // Offset: 0x20
    int64_t NIassemId;
    // System.Runtime.Serialization.Formatters.Binary.InternalPrimitiveTypeE NIprimitiveTypeEnum
    // Offset: 0x28
    System::Runtime::Serialization::Formatters::Binary::InternalPrimitiveTypeE NIprimitiveTypeEnum;
    // System.Type NItype
    // Offset: 0x30
    System::Type* NItype;
    // System.Boolean NIisSealed
    // Offset: 0x38
    bool NIisSealed;
    // System.Boolean NIisArray
    // Offset: 0x39
    bool NIisArray;
    // System.Boolean NIisArrayItem
    // Offset: 0x3A
    bool NIisArrayItem;
    // System.Boolean NItransmitTypeOnObject
    // Offset: 0x3B
    bool NItransmitTypeOnObject;
    // System.Boolean NItransmitTypeOnMember
    // Offset: 0x3C
    bool NItransmitTypeOnMember;
    // System.Boolean NIisParentTypeOnObject
    // Offset: 0x3D
    bool NIisParentTypeOnObject;
    // System.Runtime.Serialization.Formatters.Binary.InternalArrayTypeE NIarrayEnum
    // Offset: 0x40
    System::Runtime::Serialization::Formatters::Binary::InternalArrayTypeE NIarrayEnum;
    // private System.Boolean NIsealedStatusChecked
    // Offset: 0x44
    bool NIsealedStatusChecked;
    // System.Void Init()
    // Offset: 0xE2B0E0
    void Init();
    // public System.Boolean get_IsSealed()
    // Offset: 0xE2B130
    bool get_IsSealed();
    // public System.String get_NIname()
    // Offset: 0xE2B188
    ::Il2CppString* get_NIname();
    // public System.Void set_NIname(System.String value)
    // Offset: 0xE2B1E0
    void set_NIname(::Il2CppString* value);
    // System.Void .ctor()
    // Offset: 0xE2B0D8
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static NameInfo* New_ctor();
  }; // System.Runtime.Serialization.Formatters.Binary.NameInfo
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Serialization::Formatters::Binary::NameInfo*, "System.Runtime.Serialization.Formatters.Binary", "NameInfo");
#pragma pack(pop)
