// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Runtime.Serialization.StreamingContext
#include "System/Runtime/Serialization/StreamingContext.hpp"
// Including type: System.Runtime.Serialization.Formatters.Binary.InternalPrimitiveTypeE
#include "System/Runtime/Serialization/Formatters/Binary/InternalPrimitiveTypeE.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Queue
  class Queue;
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: ObjectIDGenerator
  class ObjectIDGenerator;
  // Forward declaring type: ISurrogateSelector
  class ISurrogateSelector;
  // Forward declaring type: SerializationObjectManager
  class SerializationObjectManager;
  // Forward declaring type: SerializationBinder
  class SerializationBinder;
  // Forward declaring type: IFormatterConverter
  class IFormatterConverter;
}
// Forward declaring namespace: System::Runtime::Serialization::Formatters::Binary
namespace System::Runtime::Serialization::Formatters::Binary {
  // Forward declaring type: __BinaryWriter
  class __BinaryWriter;
  // Forward declaring type: InternalFE
  class InternalFE;
  // Forward declaring type: SerObjectInfoInit
  class SerObjectInfoInit;
  // Forward declaring type: SerStack
  class SerStack;
  // Forward declaring type: WriteObjectInfo
  class WriteObjectInfo;
  // Forward declaring type: NameInfo
  class NameInfo;
}
// Forward declaring namespace: System::Runtime::Remoting::Messaging
namespace System::Runtime::Remoting::Messaging {
  // Forward declaring type: Header
  class Header;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Array
  class Array;
}
// Forward declaring namespace: System::Runtime::Serialization::Formatters
namespace System::Runtime::Serialization::Formatters {
  // Forward declaring type: FormatterTypeStyle
  struct FormatterTypeStyle;
}
// Completed forward declares
// Type namespace: System.Runtime.Serialization.Formatters.Binary
namespace System::Runtime::Serialization::Formatters::Binary {
  // Forward declaring type: ObjectWriter
  class ObjectWriter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Runtime::Serialization::Formatters::Binary::ObjectWriter);
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Serialization::Formatters::Binary::ObjectWriter*, "System.Runtime.Serialization.Formatters.Binary", "ObjectWriter");
// Type namespace: System.Runtime.Serialization.Formatters.Binary
namespace System::Runtime::Serialization::Formatters::Binary {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: System.Runtime.Serialization.Formatters.Binary.ObjectWriter
  // [TokenAttribute] Offset: FFFFFFFF
  class ObjectWriter : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Collections.Queue m_objectQueue
    // Size: 0x8
    // Offset: 0x10
    System::Collections::Queue* m_objectQueue;
    // Field size check
    static_assert(sizeof(System::Collections::Queue*) == 0x8);
    // private System.Runtime.Serialization.ObjectIDGenerator m_idGenerator
    // Size: 0x8
    // Offset: 0x18
    System::Runtime::Serialization::ObjectIDGenerator* m_idGenerator;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ObjectIDGenerator*) == 0x8);
    // private System.Int32 m_currentId
    // Size: 0x4
    // Offset: 0x20
    int m_currentId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_currentId and: m_surrogates
    char __padding2[0x4] = {};
    // private System.Runtime.Serialization.ISurrogateSelector m_surrogates
    // Size: 0x8
    // Offset: 0x28
    System::Runtime::Serialization::ISurrogateSelector* m_surrogates;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ISurrogateSelector*) == 0x8);
    // private System.Runtime.Serialization.StreamingContext m_context
    // Size: 0xC
    // Offset: 0x30
    System::Runtime::Serialization::StreamingContext m_context;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::StreamingContext) == 0xC);
    // Padding between fields: m_context and: serWriter
    char __padding4[0x4] = {};
    // private System.Runtime.Serialization.Formatters.Binary.__BinaryWriter serWriter
    // Size: 0x8
    // Offset: 0x40
    System::Runtime::Serialization::Formatters::Binary::__BinaryWriter* serWriter;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::Formatters::Binary::__BinaryWriter*) == 0x8);
    // private System.Runtime.Serialization.SerializationObjectManager m_objectManager
    // Size: 0x8
    // Offset: 0x48
    System::Runtime::Serialization::SerializationObjectManager* m_objectManager;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::SerializationObjectManager*) == 0x8);
    // private System.Int64 topId
    // Size: 0x8
    // Offset: 0x50
    int64_t topId;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.String topName
    // Size: 0x8
    // Offset: 0x58
    ::StringW topName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Runtime.Remoting.Messaging.Header[] headers
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<System::Runtime::Remoting::Messaging::Header*> headers;
    // Field size check
    static_assert(sizeof(::ArrayW<System::Runtime::Remoting::Messaging::Header*>) == 0x8);
    // private System.Runtime.Serialization.Formatters.Binary.InternalFE formatterEnums
    // Size: 0x8
    // Offset: 0x68
    System::Runtime::Serialization::Formatters::Binary::InternalFE* formatterEnums;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::Formatters::Binary::InternalFE*) == 0x8);
    // private System.Runtime.Serialization.SerializationBinder m_binder
    // Size: 0x8
    // Offset: 0x70
    System::Runtime::Serialization::SerializationBinder* m_binder;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::SerializationBinder*) == 0x8);
    // private System.Runtime.Serialization.Formatters.Binary.SerObjectInfoInit serObjectInfoInit
    // Size: 0x8
    // Offset: 0x78
    System::Runtime::Serialization::Formatters::Binary::SerObjectInfoInit* serObjectInfoInit;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::Formatters::Binary::SerObjectInfoInit*) == 0x8);
    // private System.Runtime.Serialization.IFormatterConverter m_formatterConverter
    // Size: 0x8
    // Offset: 0x80
    System::Runtime::Serialization::IFormatterConverter* m_formatterConverter;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::IFormatterConverter*) == 0x8);
    // System.Object[] crossAppDomainArray
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::Il2CppObject*> crossAppDomainArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppObject*>) == 0x8);
    // private System.Object previousObj
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppObject* previousObj;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Int64 previousId
    // Size: 0x8
    // Offset: 0x98
    int64_t previousId;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Type previousType
    // Size: 0x8
    // Offset: 0xA0
    System::Type* previousType;
    // Field size check
    static_assert(sizeof(System::Type*) == 0x8);
    // private System.Runtime.Serialization.Formatters.Binary.InternalPrimitiveTypeE previousCode
    // Size: 0x4
    // Offset: 0xA8
    System::Runtime::Serialization::Formatters::Binary::InternalPrimitiveTypeE previousCode;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::Formatters::Binary::InternalPrimitiveTypeE) == 0x4);
    // Padding between fields: previousCode and: assemblyToIdTable
    char __padding18[0x4] = {};
    // private System.Collections.Hashtable assemblyToIdTable
    // Size: 0x8
    // Offset: 0xB0
    System::Collections::Hashtable* assemblyToIdTable;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Runtime.Serialization.Formatters.Binary.SerStack niPool
    // Size: 0x8
    // Offset: 0xB8
    System::Runtime::Serialization::Formatters::Binary::SerStack* niPool;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::Formatters::Binary::SerStack*) == 0x8);
    public:
    // Get instance field reference: private System.Collections.Queue m_objectQueue
    System::Collections::Queue*& dyn_m_objectQueue();
    // Get instance field reference: private System.Runtime.Serialization.ObjectIDGenerator m_idGenerator
    System::Runtime::Serialization::ObjectIDGenerator*& dyn_m_idGenerator();
    // Get instance field reference: private System.Int32 m_currentId
    int& dyn_m_currentId();
    // Get instance field reference: private System.Runtime.Serialization.ISurrogateSelector m_surrogates
    System::Runtime::Serialization::ISurrogateSelector*& dyn_m_surrogates();
    // Get instance field reference: private System.Runtime.Serialization.StreamingContext m_context
