// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HMUI.TableView
#include "HMUI/TableView.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ModalView
  class ModalView;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Completed forward declares
// Type namespace: HMUI
namespace HMUI {
  // Size: 0x44
  #pragma pack(push, 1)
  // Autogenerated type: HMUI.DropdownWithTableView
  // [RequireComponent] Offset: DF794C
  class DropdownWithTableView : public UnityEngine::MonoBehaviour {
    public:
    // private UnityEngine.UI.Button _button
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::UI::Button* button;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // private HMUI.TableView _tableView
    // Size: 0x8
    // Offset: 0x20
    HMUI::TableView* tableView;
    // Field size check
    static_assert(sizeof(HMUI::TableView*) == 0x8);
    // private HMUI.ModalView _modalView
    // Size: 0x8
    // Offset: 0x28
    HMUI::ModalView* modalView;
    // Field size check
    static_assert(sizeof(HMUI::ModalView*) == 0x8);
    // private System.Int32 _numberOfVisibleCells
    // Size: 0x4
    // Offset: 0x30
    int numberOfVisibleCells;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: numberOfVisibleCells and: didSelectCellWithIdxEvent
    char __padding3[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xDF8FC8
    // private System.Action`2<HMUI.DropdownWithTableView,System.Int32> didSelectCellWithIdxEvent
    // Size: 0x8
    // Offset: 0x38
    System::Action_2<HMUI::DropdownWithTableView*, int>* didSelectCellWithIdxEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<HMUI::DropdownWithTableView*, int>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF8FD8
    // private System.Int32 <selectedIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    int selectedIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: DropdownWithTableView
    DropdownWithTableView(UnityEngine::UI::Button* button_ = {}, HMUI::TableView* tableView_ = {}, HMUI::ModalView* modalView_ = {}, int numberOfVisibleCells_ = {}, System::Action_2<HMUI::DropdownWithTableView*, int>* didSelectCellWithIdxEvent_ = {}, int selectedIndex_ = {}) noexcept : button{button_}, tableView{tableView_}, modalView{modalView_}, numberOfVisibleCells{numberOfVisibleCells_}, didSelectCellWithIdxEvent{didSelectCellWithIdxEvent_}, selectedIndex{selectedIndex_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_didSelectCellWithIdxEvent(System.Action`2<HMUI.DropdownWithTableView,System.Int32> value)
    // Offset: 0x130F948
    void add_didSelectCellWithIdxEvent(System::Action_2<HMUI::DropdownWithTableView*, int>* value);
    // public System.Void remove_didSelectCellWithIdxEvent(System.Action`2<HMUI.DropdownWithTableView,System.Int32> value)
    // Offset: 0x130F9EC
    void remove_didSelectCellWithIdxEvent(System::Action_2<HMUI::DropdownWithTableView*, int>* value);
    // public HMUI.TableView/IDataSource get_tableViewDataSource()
    // Offset: 0x130FA90
    HMUI::TableView::IDataSource* get_tableViewDataSource();
    // public System.Int32 get_selectedIndex()
    // Offset: 0x130FAAC
    int get_selectedIndex();
    // private System.Void set_selectedIndex(System.Int32 value)
    // Offset: 0x130FAB4
    void set_selectedIndex(int value);
    // public System.Void Init(HMUI.TableView/IDataSource tableViewDataSource)
    // Offset: 0x130FABC
    void Init(HMUI::TableView::IDataSource* tableViewDataSource);
    // public System.Void ReloadData()
    // Offset: 0x130FADC
    void ReloadData();
    // public System.Void SelectCellWithIdx(System.Int32 idx)
    // Offset: 0x130FCD8
    void SelectCellWithIdx(int idx);
    // protected System.Void Awake()
    // Offset: 0x130FD00
    void Awake();
    // protected System.Void OnDisable()
    // Offset: 0x130FE44
    void OnDisable();
    // protected System.Void OnDestroy()
    // Offset: 0x130FE94
    void OnDestroy();
    // private System.Void RefreshSize(HMUI.TableView/IDataSource dataSource)
    // Offset: 0x130FB20
    void RefreshSize(HMUI::TableView::IDataSource* dataSource);
    // private System.Void OnButtonClick()
    // Offset: 0x1310060
    void OnButtonClick();
    // private System.Void HandleTableViewDidSelectCellWithIdx(HMUI.TableView tableView, System.Int32 idx)
    // Offset: 0x13100EC
    void HandleTableViewDidSelectCellWithIdx(HMUI::TableView* tableView, int idx);
    // private System.Void Hide(System.Boolean animated)
    // Offset: 0x130FE4C
    void Hide(bool animated);
    // private System.Void Show(System.Boolean animated)
    // Offset: 0x1310068
    void Show(bool animated);
    // private System.Void HandleModalViewBlockerClicked()
    // Offset: 0x1310164
    void HandleModalViewBlockerClicked();
    // public System.Void .ctor()
    // Offset: 0x131016C
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DropdownWithTableView* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("HMUI::DropdownWithTableView::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DropdownWithTableView*, creationType>()));
    }
  }; // HMUI.DropdownWithTableView
  #pragma pack(pop)
  static check_size<sizeof(DropdownWithTableView), 64 + sizeof(int)> __HMUI_DropdownWithTableViewSizeCheck;
  static_assert(sizeof(DropdownWithTableView) == 0x44);
}
DEFINE_IL2CPP_ARG_TYPE(HMUI::DropdownWithTableView*, "HMUI", "DropdownWithTableView");
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::add_didSelectCellWithIdxEvent
// Il2CppName: add_didSelectCellWithIdxEvent
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::remove_didSelectCellWithIdxEvent
// Il2CppName: remove_didSelectCellWithIdxEvent
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::get_tableViewDataSource
// Il2CppName: get_tableViewDataSource
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::get_selectedIndex
// Il2CppName: get_selectedIndex
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::set_selectedIndex
// Il2CppName: set_selectedIndex
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::Init
// Il2CppName: Init
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::ReloadData
// Il2CppName: ReloadData
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::SelectCellWithIdx
// Il2CppName: SelectCellWithIdx
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::Awake
// Il2CppName: Awake
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::OnDisable
// Il2CppName: OnDisable
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::OnDestroy
// Il2CppName: OnDestroy
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::RefreshSize
// Il2CppName: RefreshSize
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::OnButtonClick
// Il2CppName: OnButtonClick
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::HandleTableViewDidSelectCellWithIdx
// Il2CppName: HandleTableViewDidSelectCellWithIdx
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::Hide
// Il2CppName: Hide
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::Show
// Il2CppName: Show
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::HandleModalViewBlockerClicked
// Il2CppName: HandleModalViewBlockerClicked
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: HMUI::DropdownWithTableView::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
