// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HMUI.ViewController
#include "HMUI/ViewController.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ScreenSystem
  class ScreenSystem;
  // Forward declaring type: NavigationController
  class NavigationController;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: BaseInputModule
  class BaseInputModule;
  // Forward declaring type: EventSystem
  class EventSystem;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: HMUI
namespace HMUI {
  // Forward declaring type: FlowCoordinator
  class FlowCoordinator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(HMUI::FlowCoordinator);
DEFINE_IL2CPP_ARG_TYPE(HMUI::FlowCoordinator*, "HMUI", "FlowCoordinator");
// Type namespace: HMUI
namespace HMUI {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: HMUI.FlowCoordinator
  // [TokenAttribute] Offset: FFFFFFFF
  class FlowCoordinator : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass35_0
    class $$c__DisplayClass35_0;
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass36_0
    class $$c__DisplayClass36_0;
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass37_0
    class $$c__DisplayClass37_0;
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass38_0
    class $$c__DisplayClass38_0;
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass38_1
    class $$c__DisplayClass38_1;
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass39_0
    class $$c__DisplayClass39_0;
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass41_0
    class $$c__DisplayClass41_0;
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass42_0
    class $$c__DisplayClass42_0;
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass45_0
    class $$c__DisplayClass45_0;
    // Nested type: HMUI::FlowCoordinator::$$c__DisplayClass46_0
    class $$c__DisplayClass46_0;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [InjectAttribute] Offset: 0xF25410
    // private readonly UnityEngine.EventSystems.BaseInputModule _baseInputModule
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::EventSystems::BaseInputModule* baseInputModule;
    // Field size check
    static_assert(sizeof(UnityEngine::EventSystems::BaseInputModule*) == 0x8);
    // private HMUI.ScreenSystem _screenSystem
    // Size: 0x8
    // Offset: 0x20
    HMUI::ScreenSystem* screenSystem;
    // Field size check
    static_assert(sizeof(HMUI::ScreenSystem*) == 0x8);
    // private HMUI.FlowCoordinator _parentFlowCoordinator
    // Size: 0x8
    // Offset: 0x28
    HMUI::FlowCoordinator* parentFlowCoordinator;
    // Field size check
    static_assert(sizeof(HMUI::FlowCoordinator*) == 0x8);
    // private HMUI.FlowCoordinator _childFlowCoordinator
    // Size: 0x8
    // Offset: 0x30
    HMUI::FlowCoordinator* childFlowCoordinator;
    // Field size check
    static_assert(sizeof(HMUI::FlowCoordinator*) == 0x8);
    // private System.Collections.Generic.List`1<HMUI.ViewController> _mainScreenViewControllers
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Generic::List_1<HMUI::ViewController*>* mainScreenViewControllers;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HMUI::ViewController*>*) == 0x8);
    // private HMUI.ViewController _leftScreenViewController
    // Size: 0x8
    // Offset: 0x40
    HMUI::ViewController* leftScreenViewController;
    // Field size check
    static_assert(sizeof(HMUI::ViewController*) == 0x8);
    // private HMUI.ViewController _rightScreenViewController
    // Size: 0x8
    // Offset: 0x48
    HMUI::ViewController* rightScreenViewController;
    // Field size check
    static_assert(sizeof(HMUI::ViewController*) == 0x8);
    // private HMUI.ViewController _bottomScreenViewController
    // Size: 0x8
    // Offset: 0x50
    HMUI::ViewController* bottomScreenViewController;
    // Field size check
    static_assert(sizeof(HMUI::ViewController*) == 0x8);
    // private HMUI.ViewController _topScreenViewController
    // Size: 0x8
    // Offset: 0x58
    HMUI::ViewController* topScreenViewController;
    // Field size check
    static_assert(sizeof(HMUI::ViewController*) == 0x8);
    // private System.Boolean _wasActivatedBefore
    // Size: 0x1
    // Offset: 0x60
    bool wasActivatedBefore;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasActivatedBefore and: title
    char __padding9[0x7] = {};
    // private System.String _title
    // Size: 0x8
    // Offset: 0x68
    ::Il2CppString* title;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private HMUI.ViewController _providedMainViewController
    // Size: 0x8
    // Offset: 0x70
    HMUI::ViewController* providedMainViewController;
    // Field size check
    static_assert(sizeof(HMUI::ViewController*) == 0x8);
    // private HMUI.ViewController _providedLeftScreenViewController
    // Size: 0x8
    // Offset: 0x78
    HMUI::ViewController* providedLeftScreenViewController;
    // Field size check
    static_assert(sizeof(HMUI::ViewController*) == 0x8);
    // private HMUI.ViewController _providedRightScreenViewController
    // Size: 0x8
    // Offset: 0x80
    HMUI::ViewController* providedRightScreenViewController;
    // Field size check
    static_assert(sizeof(HMUI::ViewController*) == 0x8);
    // private HMUI.ViewController _providedBottomScreenViewController
    // Size: 0x8
    // Offset: 0x88
    HMUI::ViewController* providedBottomScreenViewController;
    // Field size check
    static_assert(sizeof(HMUI::ViewController*) == 0x8);
    // private HMUI.ViewController _providedTopScreenViewController
    // Size: 0x8
    // Offset: 0x90
    HMUI::ViewController* providedTopScreenViewController;
    // Field size check
    static_assert(sizeof(HMUI::ViewController*) == 0x8);
    // private System.Boolean _viewControllersWereProvided
    // Size: 0x1
    // Offset: 0x98
    bool viewControllersWereProvided;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isInDidActivatePhase
    // Size: 0x1
    // Offset: 0x99
    bool isInDidActivatePhase;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isActivated
    // Size: 0x1
    // Offset: 0x9A
    bool isActivated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isInTransition
    // Size: 0x1
    // Offset: 0x9B
    bool isInTransition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showBackButton
    // Size: 0x1
    // Offset: 0x9C
    bool showBackButton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showBackButton and: prevEventSystem
    char __padding20[0x3] = {};
    // private UnityEngine.EventSystems.EventSystem _prevEventSystem
    // Size: 0x8
    // Offset: 0xA0
    UnityEngine::EventSystems::EventSystem* prevEventSystem;
    // Field size check
    static_assert(sizeof(UnityEngine::EventSystems::EventSystem*) == 0x8);
    public:
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: private readonly UnityEngine.EventSystems.BaseInputModule _baseInputModule
    UnityEngine::EventSystems::BaseInputModule*& dyn__baseInputModule();
    // Get instance field reference: private HMUI.ScreenSystem _screenSystem
    HMUI::ScreenSystem*& dyn__screenSystem();
    // Get instance field reference: private HMUI.FlowCoordinator _parentFlowCoordinator
    HMUI::FlowCoordinator*& dyn__parentFlowCoordinator();
    // Get instance field reference: private HMUI.FlowCoordinator _childFlowCoordinator
    HMUI::FlowCoordinator*& dyn__childFlowCoordinator();
