// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UI.Image
#include "UnityEngine/UI/Image.hpp"
// Including type: IComponentRefresher
#include "GlobalNamespace/IComponentRefresher.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: CurvedCanvasSettingsHelper
  class CurvedCanvasSettingsHelper;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ColorSO
  class ColorSO;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: VertexHelper
  class VertexHelper;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Color32 because it is already included!
  // Forward declaring type: Rect
  struct Rect;
}
// Completed forward declares
// Type namespace: HMUI
namespace HMUI {
  // Forward declaring type: ImageView
  class ImageView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::HMUI::ImageView);
DEFINE_IL2CPP_ARG_TYPE(::HMUI::ImageView*, "HMUI", "ImageView");
// Type namespace: HMUI
namespace HMUI {
  // Size: 0x150
  #pragma pack(push, 1)
  // Autogenerated type: HMUI.ImageView
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  class ImageView : public ::UnityEngine::UI::Image/*, public ::GlobalNamespace::IComponentRefresher*/ {
    public:
    // Nested type: ::HMUI::ImageView::GradientDirection
    struct GradientDirection;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HMUI.ImageView/HMUI.GradientDirection
    // [TokenAttribute] Offset: FFFFFFFF
    struct GradientDirection/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GradientDirection
      constexpr GradientDirection(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HMUI.ImageView/HMUI.GradientDirection Horizontal
      static constexpr const int Horizontal = 0;
      // Get static field: static public HMUI.ImageView/HMUI.GradientDirection Horizontal
      static ::HMUI::ImageView::GradientDirection _get_Horizontal();
      // Set static field: static public HMUI.ImageView/HMUI.GradientDirection Horizontal
      static void _set_Horizontal(::HMUI::ImageView::GradientDirection value);
      // static field const value: static public HMUI.ImageView/HMUI.GradientDirection Vertical
      static constexpr const int Vertical = 1;
      // Get static field: static public HMUI.ImageView/HMUI.GradientDirection Vertical
      static ::HMUI::ImageView::GradientDirection _get_Vertical();
      // Set static field: static public HMUI.ImageView/HMUI.GradientDirection Vertical
      static void _set_Vertical(::HMUI::ImageView::GradientDirection value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // HMUI.ImageView/HMUI.GradientDirection
    #pragma pack(pop)
    static check_size<sizeof(ImageView::GradientDirection), 0 + sizeof(int)> __HMUI_ImageView_GradientDirectionSizeCheck;
    static_assert(sizeof(ImageView::GradientDirection) == 0x4);
    public:
    // private System.Boolean _useScriptableObjectColors
    // Size: 0x1
    // Offset: 0xF8
    bool useScriptableObjectColors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useScriptableObjectColors and: colorSo
    char __padding0[0x7] = {};
    // [NullAllowed] Offset: 0x10E9630
    // private ColorSO _colorSo
    // Size: 0x8
    // Offset: 0x100
    ::GlobalNamespace::ColorSO* colorSo;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ColorSO*) == 0x8);
    // [NullAllowed] Offset: 0x10E9668
    // private ColorSO _color0So
    // Size: 0x8
    // Offset: 0x108
    ::GlobalNamespace::ColorSO* color0So;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ColorSO*) == 0x8);
    // [NullAllowed] Offset: 0x10E96A0
    // private ColorSO _color1So
    // Size: 0x8
    // Offset: 0x110
    ::GlobalNamespace::ColorSO* color1So;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ColorSO*) == 0x8);
    // private System.Single _skew
    // Size: 0x4
    // Offset: 0x118
    float skew;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _gradient
    // Size: 0x1
    // Offset: 0x11C
    bool gradient;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: gradient and: color0
    char __padding5[0x3] = {};
    // private UnityEngine.Color _color0
    // Size: 0x10
    // Offset: 0x120
    ::UnityEngine::Color color0;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _color1
    // Size: 0x10
    // Offset: 0x130
    ::UnityEngine::Color color1;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private HMUI.ImageView/HMUI.GradientDirection _gradientDirection
    // Size: 0x4
    // Offset: 0x140
    ::HMUI::ImageView::GradientDirection gradientDirection;
    // Field size check
    static_assert(sizeof(::HMUI::ImageView::GradientDirection) == 0x4);
    // private System.Boolean _flipGradientColors
    // Size: 0x1
    // Offset: 0x144
    bool flipGradientColors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: flipGradientColors and: curvedCanvasSettingsHelper
    char __padding9[0x3] = {};
    // private readonly HMUI.CurvedCanvasSettingsHelper _curvedCanvasSettingsHelper
    // Size: 0x8
    // Offset: 0x148
    ::HMUI::CurvedCanvasSettingsHelper* curvedCanvasSettingsHelper;
    // Field size check
    static_assert(sizeof(::HMUI::CurvedCanvasSettingsHelper*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IComponentRefresher
    operator ::GlobalNamespace::IComponentRefresher() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IComponentRefresher*>(this);
    }
    // Creating interface conversion operator: i_IComponentRefresher
    inline ::GlobalNamespace::IComponentRefresher* i_IComponentRefresher() noexcept {
      return reinterpret_cast<::GlobalNamespace::IComponentRefresher*>(this);
    }
    // [DoesNotRequireDomainReloadInitAttribute] Offset: 0x10E9738
    // Get static field: static private readonly UnityEngine.Vector2 kVec2Zero
    static ::UnityEngine::Vector2 _get_kVec2Zero();
    // Set static field: static private readonly UnityEngine.Vector2 kVec2Zero
