// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HMUI.InputFieldView
#include "HMUI/InputFieldView.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationClip
  class AnimationClip;
}
// Completed forward declares
// Type namespace: HMUI
namespace HMUI {
  // Size: 0x49
  #pragma pack(push, 1)
  // Autogenerated type: HMUI.InputFieldViewStaticAnimations
  // [TokenAttribute] Offset: FFFFFFFF
  class InputFieldViewStaticAnimations : public UnityEngine::MonoBehaviour {
    public:
    // private HMUI.InputFieldView _inputFieldView
    // Size: 0x8
    // Offset: 0x18
    HMUI::InputFieldView* inputFieldView;
    // Field size check
    static_assert(sizeof(HMUI::InputFieldView*) == 0x8);
    // [SpaceAttribute] Offset: 0xE919D4
    // private UnityEngine.AnimationClip _normalClip
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::AnimationClip* normalClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // private UnityEngine.AnimationClip _highlightedClip
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::AnimationClip* highlightedClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // private UnityEngine.AnimationClip _pressedClip
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::AnimationClip* pressedClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // private UnityEngine.AnimationClip _disabledClip
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::AnimationClip* disabledClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // private UnityEngine.AnimationClip _selectedClip
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::AnimationClip* selectedClip;
    // Field size check
    static_assert(sizeof(UnityEngine::AnimationClip*) == 0x8);
    // private System.Boolean _didStart
    // Size: 0x1
    // Offset: 0x48
    bool didStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: InputFieldViewStaticAnimations
    InputFieldViewStaticAnimations(HMUI::InputFieldView* inputFieldView_ = {}, UnityEngine::AnimationClip* normalClip_ = {}, UnityEngine::AnimationClip* highlightedClip_ = {}, UnityEngine::AnimationClip* pressedClip_ = {}, UnityEngine::AnimationClip* disabledClip_ = {}, UnityEngine::AnimationClip* selectedClip_ = {}, bool didStart_ = {}) noexcept : inputFieldView{inputFieldView_}, normalClip{normalClip_}, highlightedClip{highlightedClip_}, pressedClip{pressedClip_}, disabledClip{disabledClip_}, selectedClip{selectedClip_}, didStart{didStart_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field: private HMUI.InputFieldView _inputFieldView
    HMUI::InputFieldView* _get__inputFieldView();
    // Set instance field: private HMUI.InputFieldView _inputFieldView
    void _set__inputFieldView(HMUI::InputFieldView* value);
    // Get instance field: private UnityEngine.AnimationClip _normalClip
    UnityEngine::AnimationClip* _get__normalClip();
    // Set instance field: private UnityEngine.AnimationClip _normalClip
    void _set__normalClip(UnityEngine::AnimationClip* value);
    // Get instance field: private UnityEngine.AnimationClip _highlightedClip
    UnityEngine::AnimationClip* _get__highlightedClip();
    // Set instance field: private UnityEngine.AnimationClip _highlightedClip
    void _set__highlightedClip(UnityEngine::AnimationClip* value);
    // Get instance field: private UnityEngine.AnimationClip _pressedClip
    UnityEngine::AnimationClip* _get__pressedClip();
    // Set instance field: private UnityEngine.AnimationClip _pressedClip
    void _set__pressedClip(UnityEngine::AnimationClip* value);
    // Get instance field: private UnityEngine.AnimationClip _disabledClip
    UnityEngine::AnimationClip* _get__disabledClip();
    // Set instance field: private UnityEngine.AnimationClip _disabledClip
    void _set__disabledClip(UnityEngine::AnimationClip* value);
    // Get instance field: private UnityEngine.AnimationClip _selectedClip
    UnityEngine::AnimationClip* _get__selectedClip();
    // Set instance field: private UnityEngine.AnimationClip _selectedClip
    void _set__selectedClip(UnityEngine::AnimationClip* value);
    // Get instance field: private System.Boolean _didStart
    bool _get__didStart();
    // Set instance field: private System.Boolean _didStart
    void _set__didStart(bool value);
    // protected System.Void Awake()
    // Offset: 0x1067EF0
    void Awake();
    // protected System.Void Start()
    // Offset: 0x1067F80
    void Start();
    // protected System.Void OnEnable()
    // Offset: 0x10680BC
    void OnEnable();
    // protected System.Void OnDestroy()
    // Offset: 0x10680D8
    void OnDestroy();
    // private System.Void HandleInputFieldViewSelectionStateDidChange(HMUI.InputFieldView/HMUI.SelectionState state)
    // Offset: 0x1067FA4
    void HandleInputFieldViewSelectionStateDidChange(HMUI::InputFieldView::SelectionState state);
    // public System.Void .ctor()
    // Offset: 0x10681B0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static InputFieldViewStaticAnimations* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("HMUI::InputFieldViewStaticAnimations::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<InputFieldViewStaticAnimations*, creationType>()));
    }
  }; // HMUI.InputFieldViewStaticAnimations
  #pragma pack(pop)
  static check_size<sizeof(InputFieldViewStaticAnimations), 72 + sizeof(bool)> __HMUI_InputFieldViewStaticAnimationsSizeCheck;
  static_assert(sizeof(InputFieldViewStaticAnimations) == 0x49);
}
DEFINE_IL2CPP_ARG_TYPE(HMUI::InputFieldViewStaticAnimations*, "HMUI", "InputFieldViewStaticAnimations");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: HMUI::InputFieldViewStaticAnimations::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (HMUI::InputFieldViewStaticAnimations::*)()>(&HMUI::InputFieldViewStaticAnimations::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(HMUI::InputFieldViewStaticAnimations*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: HMUI::InputFieldViewStaticAnimations::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (HMUI::InputFieldViewStaticAnimations::*)()>(&HMUI::InputFieldViewStaticAnimations::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(HMUI::InputFieldViewStaticAnimations*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: HMUI::InputFieldViewStaticAnimations::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (HMUI::InputFieldViewStaticAnimations::*)()>(&HMUI::InputFieldViewStaticAnimations::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(HMUI::InputFieldViewStaticAnimations*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: HMUI::InputFieldViewStaticAnimations::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (HMUI::InputFieldViewStaticAnimations::*)()>(&HMUI::InputFieldViewStaticAnimations::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(HMUI::InputFieldViewStaticAnimations*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: HMUI::InputFieldViewStaticAnimations::HandleInputFieldViewSelectionStateDidChange
// Il2CppName: HandleInputFieldViewSelectionStateDidChange
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (HMUI::InputFieldViewStaticAnimations::*)(HMUI::InputFieldView::SelectionState)>(&HMUI::InputFieldViewStaticAnimations::HandleInputFieldViewSelectionStateDidChange)> {
  static const MethodInfo* get() {
    static auto* state = &::il2cpp_utils::GetClassFromName("HMUI", "InputFieldView/SelectionState")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(HMUI::InputFieldViewStaticAnimations*), "HandleInputFieldViewSelectionStateDidChange", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{state});
  }
};
// Writing MetadataGetter for method: HMUI::InputFieldViewStaticAnimations::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
