// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: PanelAnimationSO
  class PanelAnimationSO;
  // Forward declaring type: ViewController
  class ViewController;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: DiContainer
  class DiContainer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: CanvasGroup
  class CanvasGroup;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: HMUI
namespace HMUI {
  // Autogenerated type: HMUI.ModalView
  class ModalView : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: HMUI::ModalView::$$c__DisplayClass16_0
    class $$c__DisplayClass16_0;
    // Nested type: HMUI::ModalView::$$c__DisplayClass20_0
    class $$c__DisplayClass20_0;
    // private HMUI.PanelAnimationSO _presentPanelAnimations
    // Offset: 0x18
    HMUI::PanelAnimationSO* presentPanelAnimations;
    // private HMUI.PanelAnimationSO _dismissPanelAnimation
    // Offset: 0x20
    HMUI::PanelAnimationSO* dismissPanelAnimation;
    // private System.Boolean _animateParentCanvas
    // Offset: 0x28
    bool animateParentCanvas;
    // private readonly Zenject.DiContainer _container
    // Offset: 0x30
    Zenject::DiContainer* container;
    // private System.Action blockerClickedEvent
    // Offset: 0x38
    System::Action* blockerClickedEvent;
    // private System.Boolean _isShown
    // Offset: 0x40
    bool isShown;
    // private System.Boolean _viewIsValid
    // Offset: 0x41
    bool viewIsValid;
    // private UnityEngine.Canvas _mainCanvas
    // Offset: 0x48
    UnityEngine::Canvas* mainCanvas;
    // private UnityEngine.CanvasGroup _parentCanvasGroup
    // Offset: 0x50
    UnityEngine::CanvasGroup* parentCanvasGroup;
    // private UnityEngine.GameObject _blockerGO
    // Offset: 0x58
    UnityEngine::GameObject* blockerGO;
    // private System.Int32 _test
    // Offset: 0x60
    int test;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_blockerClickedEvent(System.Action value)
    // Offset: 0x216B07C
    void add_blockerClickedEvent(System::Action* value);
    // public System.Void remove_blockerClickedEvent(System.Action value)
    // Offset: 0x216B120
    void remove_blockerClickedEvent(System::Action* value);
    // private System.Void OnDisable()
    // Offset: 0x216B1C4
    void OnDisable();
    // private System.Void OnDestroy()
    // Offset: 0x216B3C4
    void OnDestroy();
    // private System.Void SetupView(UnityEngine.Transform screenTransform)
    // Offset: 0x216B474
    void SetupView(UnityEngine::Transform* screenTransform);
    // public System.Void Hide(System.Boolean animated, System.Action finishedCallback)
    // Offset: 0x216B1D0
    void Hide(bool animated, System::Action* finishedCallback);
    // public System.Void Show(System.Boolean animated, System.Boolean moveToCenter, System.Action finishedCallback)
    // Offset: 0x216B7CC
    void Show(bool animated, bool moveToCenter, System::Action* finishedCallback);
    // private UnityEngine.GameObject CreateBlocker()
    // Offset: 0x216BBF0
    UnityEngine::GameObject* CreateBlocker();
    // private System.Void HandleBlockerButtonClicked()
    // Offset: 0x216BFD8
    void HandleBlockerButtonClicked();
    // private System.Void HandleParentViewControllerDidDeactivate(System.Boolean removedFromHierarchy, System.Boolean screenSystemDisabling)
    // Offset: 0x216BFEC
    void HandleParentViewControllerDidDeactivate(bool removedFromHierarchy, bool screenSystemDisabling);
    // static private UnityEngine.Transform GetModalRootTransform(UnityEngine.Transform transform, out UnityEngine.Canvas canvas, out HMUI.ViewController viewController)
    // Offset: 0x216BAEC
    static UnityEngine::Transform* GetModalRootTransform(UnityEngine::Transform* transform, UnityEngine::Canvas*& canvas, HMUI::ViewController*& viewController);
    // public System.Void .ctor()
    // Offset: 0x216C0C0
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static ModalView* New_ctor();
  }; // HMUI.ModalView
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(HMUI::ModalView*, "HMUI", "ModalView");
#pragma pack(pop)
