// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IVRPlatformHelper
  class IVRPlatformHelper;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: VerticalScrollIndicator
  class VerticalScrollIndicator;
  // Forward declaring type: ButtonBinder
  class ButtonBinder;
  // Forward declaring type: EventSystemListener
  class EventSystemListener;
  // Skipping declaration: ScrollDirection because it is already included!
  // Forward declaring type: ItemForFocussedScrolling
  class ItemForFocussedScrolling;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Completed forward declares
// Type namespace: HMUI
namespace HMUI {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: HMUI.ScrollView
  // [RequireComponent] Offset: DF59EC
  class ScrollView : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: HMUI::ScrollView::ScrollType
    struct ScrollType;
    // Nested type: HMUI::ScrollView::ScrollDirection
    struct ScrollDirection;
    // Nested type: HMUI::ScrollView::ScrollViewDirection
    struct ScrollViewDirection;
    // Nested type: HMUI::ScrollView::$$c
    class $$c;
    // Nested type: HMUI::ScrollView::$$c__DisplayClass50_0
    class $$c__DisplayClass50_0;
    // Nested type: HMUI::ScrollView::$$c__DisplayClass51_0
    class $$c__DisplayClass51_0;
    // Nested type: HMUI::ScrollView::$$c__DisplayClass56_0
    class $$c__DisplayClass56_0;
    // Nested type: HMUI::ScrollView::$$c__DisplayClass56_1
    class $$c__DisplayClass56_1;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HMUI.ScrollView/ScrollType
    struct ScrollType/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ScrollType
      constexpr ScrollType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HMUI.ScrollView/ScrollType PageSize
      static constexpr const int PageSize = 0;
      // Get static field: static public HMUI.ScrollView/ScrollType PageSize
      static HMUI::ScrollView::ScrollType _get_PageSize();
      // Set static field: static public HMUI.ScrollView/ScrollType PageSize
      static void _set_PageSize(HMUI::ScrollView::ScrollType value);
      // static field const value: static public HMUI.ScrollView/ScrollType FixedCellSize
      static constexpr const int FixedCellSize = 1;
      // Get static field: static public HMUI.ScrollView/ScrollType FixedCellSize
      static HMUI::ScrollView::ScrollType _get_FixedCellSize();
      // Set static field: static public HMUI.ScrollView/ScrollType FixedCellSize
      static void _set_FixedCellSize(HMUI::ScrollView::ScrollType value);
      // static field const value: static public HMUI.ScrollView/ScrollType FocusItems
      static constexpr const int FocusItems = 2;
      // Get static field: static public HMUI.ScrollView/ScrollType FocusItems
      static HMUI::ScrollView::ScrollType _get_FocusItems();
      // Set static field: static public HMUI.ScrollView/ScrollType FocusItems
      static void _set_FocusItems(HMUI::ScrollView::ScrollType value);
    }; // HMUI.ScrollView/ScrollType
    #pragma pack(pop)
    static check_size<sizeof(ScrollView::ScrollType), 0 + sizeof(int)> __HMUI_ScrollView_ScrollTypeSizeCheck;
    static_assert(sizeof(ScrollView::ScrollType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HMUI.ScrollView/ScrollDirection
    struct ScrollDirection/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ScrollDirection
      constexpr ScrollDirection(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HMUI.ScrollView/ScrollDirection None
      static constexpr const int None = 0;
      // Get static field: static public HMUI.ScrollView/ScrollDirection None
      static HMUI::ScrollView::ScrollDirection _get_None();
      // Set static field: static public HMUI.ScrollView/ScrollDirection None
      static void _set_None(HMUI::ScrollView::ScrollDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollDirection Up
      static constexpr const int Up = 1;
      // Get static field: static public HMUI.ScrollView/ScrollDirection Up
      static HMUI::ScrollView::ScrollDirection _get_Up();
      // Set static field: static public HMUI.ScrollView/ScrollDirection Up
      static void _set_Up(HMUI::ScrollView::ScrollDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollDirection Down
      static constexpr const int Down = 2;
      // Get static field: static public HMUI.ScrollView/ScrollDirection Down
      static HMUI::ScrollView::ScrollDirection _get_Down();
      // Set static field: static public HMUI.ScrollView/ScrollDirection Down
      static void _set_Down(HMUI::ScrollView::ScrollDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollDirection Left
      static constexpr const int Left = 3;
      // Get static field: static public HMUI.ScrollView/ScrollDirection Left
      static HMUI::ScrollView::ScrollDirection _get_Left();
      // Set static field: static public HMUI.ScrollView/ScrollDirection Left
      static void _set_Left(HMUI::ScrollView::ScrollDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollDirection Right
      static constexpr const int Right = 4;
      // Get static field: static public HMUI.ScrollView/ScrollDirection Right
      static HMUI::ScrollView::ScrollDirection _get_Right();
      // Set static field: static public HMUI.ScrollView/ScrollDirection Right
      static void _set_Right(HMUI::ScrollView::ScrollDirection value);
    }; // HMUI.ScrollView/ScrollDirection
    #pragma pack(pop)
    static check_size<sizeof(ScrollView::ScrollDirection), 0 + sizeof(int)> __HMUI_ScrollView_ScrollDirectionSizeCheck;
    static_assert(sizeof(ScrollView::ScrollDirection) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HMUI.ScrollView/ScrollViewDirection
    struct ScrollViewDirection/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ScrollViewDirection
      constexpr ScrollViewDirection(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HMUI.ScrollView/ScrollViewDirection Vertical
      static constexpr const int Vertical = 0;
      // Get static field: static public HMUI.ScrollView/ScrollViewDirection Vertical
      static HMUI::ScrollView::ScrollViewDirection _get_Vertical();
      // Set static field: static public HMUI.ScrollView/ScrollViewDirection Vertical
      static void _set_Vertical(HMUI::ScrollView::ScrollViewDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollViewDirection Horizontal
      static constexpr const int Horizontal = 1;
      // Get static field: static public HMUI.ScrollView/ScrollViewDirection Horizontal
      static HMUI::ScrollView::ScrollViewDirection _get_Horizontal();
      // Set static field: static public HMUI.ScrollView/ScrollViewDirection Horizontal
      static void _set_Horizontal(HMUI::ScrollView::ScrollViewDirection value);
    }; // HMUI.ScrollView/ScrollViewDirection
    #pragma pack(pop)
    static check_size<sizeof(ScrollView::ScrollViewDirection), 0 + sizeof(int)> __HMUI_ScrollView_ScrollViewDirectionSizeCheck;
    static_assert(sizeof(ScrollView::ScrollViewDirection) == 0x4);
    // private UnityEngine.RectTransform _viewport
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::RectTransform* viewport;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _contentRectTransform
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::RectTransform* contentRectTransform;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // [SpaceAttribute] Offset: 0xDF73F4
    // private HMUI.ScrollView/ScrollViewDirection _scrollViewDirection
    // Size: 0x4
    // Offset: 0x28
    HMUI::ScrollView::ScrollViewDirection scrollViewDirection;
    // Field size check
    static_assert(sizeof(HMUI::ScrollView::ScrollViewDirection) == 0x4);
    // Padding between fields: scrollViewDirection and: pageUpButton
    char __padding2[0x4] = {};
    // [SpaceAttribute] Offset: 0xDF742C
    // [NullAllowed] Offset: 0xDF742C
    // private UnityEngine.UI.Button _pageUpButton
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::UI::Button* pageUpButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // [NullAllowed] Offset: 0xDF7474
    // private UnityEngine.UI.Button _pageDownButton
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::UI::Button* pageDownButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // [NullAllowed] Offset: 0xDF74AC
    // private HMUI.VerticalScrollIndicator _verticalScrollIndicator
    // Size: 0x8
    // Offset: 0x40
    HMUI::VerticalScrollIndicator* verticalScrollIndicator;
    // Field size check
    static_assert(sizeof(HMUI::VerticalScrollIndicator*) == 0x8);
    // [SpaceAttribute] Offset: 0xDF74E4
    // private System.Single _smooth
    // Size: 0x4
    // Offset: 0x48
    float smooth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _joystickScrollSpeed
    // Size: 0x4
    // Offset: 0x4C
    float joystickScrollSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _joystickQuickSnapMaxTime
    // Size: 0x4
    // Offset: 0x50
    float joystickQuickSnapMaxTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0xDF753C
    // public HMUI.ScrollView/ScrollType _scrollType
    // Size: 0x4
    // Offset: 0x54
    HMUI::ScrollView::ScrollType scrollType;
    // Field size check
    static_assert(sizeof(HMUI::ScrollView::ScrollType) == 0x4);
    // [SpaceAttribute] Offset: 0xDF754C
    // [DrawIfAttribute] Offset: 0xDF754C
    // public System.Single _fixedCellSize
    // Size: 0x4
    // Offset: 0x58
    float fixedCellSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [DrawIfAttribute] Offset: 0xDF75F4
    // public System.Single _scrollItemRelativeThresholdPosition
    // Size: 0x4
    // Offset: 0x5C
    float scrollItemRelativeThresholdPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [DrawIfAttribute] Offset: 0xDF768C
    // public System.Single _pageStepNormalizedSize
    // Size: 0x4
    // Offset: 0x60
    float pageStepNormalizedSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: pageStepNormalizedSize and: platformHelper
    char __padding12[0x4] = {};
    // [InjectAttribute] Offset: 0xDF773C
    // private readonly IVRPlatformHelper _platformHelper
    // Size: 0x8
    // Offset: 0x68
    GlobalNamespace::IVRPlatformHelper* platformHelper;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IVRPlatformHelper*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF774C
    // private System.Action`1<System.Single> scrollPositionChangedEvent
    // Size: 0x8
    // Offset: 0x70
    System::Action_1<float>* scrollPositionChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<float>*) == 0x8);
    // private HMUI.ButtonBinder _buttonBinder
    // Size: 0x8
    // Offset: 0x78
    HMUI::ButtonBinder* buttonBinder;
    // Field size check
    static_assert(sizeof(HMUI::ButtonBinder*) == 0x8);
    // private System.Single _destinationPos
    // Size: 0x4
    // Offset: 0x80
    float destinationPos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: destinationPos and: scrollFocusPositions
    char __padding16[0x4] = {};
    // private System.Single[] _scrollFocusPositions
    // Size: 0x8
    // Offset: 0x88
    ::Array<float>* scrollFocusPositions;
    // Field size check
    static_assert(sizeof(::Array<float>*) == 0x8);
    // private HMUI.EventSystemListener _eventSystemListener
    // Size: 0x8
    // Offset: 0x90
    HMUI::EventSystemListener* eventSystemListener;
    // Field size check
    static_assert(sizeof(HMUI::EventSystemListener*) == 0x8);
    // private HMUI.ScrollView/ScrollDirection _lastJoystickScrollDirection
    // Size: 0x4
    // Offset: 0x98
    HMUI::ScrollView::ScrollDirection lastJoystickScrollDirection;
    // Field size check
    static_assert(sizeof(HMUI::ScrollView::ScrollDirection) == 0x4);
    // private System.Single _joystickScrollStartTime
    // Size: 0x4
    // Offset: 0x9C
    float joystickScrollStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: ScrollView
    ScrollView(UnityEngine::RectTransform* viewport_ = {}, UnityEngine::RectTransform* contentRectTransform_ = {}, HMUI::ScrollView::ScrollViewDirection scrollViewDirection_ = {}, UnityEngine::UI::Button* pageUpButton_ = {}, UnityEngine::UI::Button* pageDownButton_ = {}, HMUI::VerticalScrollIndicator* verticalScrollIndicator_ = {}, float smooth_ = {}, float joystickScrollSpeed_ = {}, float joystickQuickSnapMaxTime_ = {}, HMUI::ScrollView::ScrollType scrollType_ = {}, float fixedCellSize_ = {}, float scrollItemRelativeThresholdPosition_ = {}, float pageStepNormalizedSize_ = {}, GlobalNamespace::IVRPlatformHelper* platformHelper_ = {}, System::Action_1<float>* scrollPositionChangedEvent_ = {}, HMUI::ButtonBinder* buttonBinder_ = {}, float destinationPos_ = {}, ::Array<float>* scrollFocusPositions_ = {}, HMUI::EventSystemListener* eventSystemListener_ = {}, HMUI::ScrollView::ScrollDirection lastJoystickScrollDirection_ = {}, float joystickScrollStartTime_ = {}) noexcept : viewport{viewport_}, contentRectTransform{contentRectTransform_}, scrollViewDirection{scrollViewDirection_}, pageUpButton{pageUpButton_}, pageDownButton{pageDownButton_}, verticalScrollIndicator{verticalScrollIndicator_}, smooth{smooth_}, joystickScrollSpeed{joystickScrollSpeed_}, joystickQuickSnapMaxTime{joystickQuickSnapMaxTime_}, scrollType{scrollType_}, fixedCellSize{fixedCellSize_}, scrollItemRelativeThresholdPosition{scrollItemRelativeThresholdPosition_}, pageStepNormalizedSize{pageStepNormalizedSize_}, platformHelper{platformHelper_}, scrollPositionChangedEvent{scrollPositionChangedEvent_}, buttonBinder{buttonBinder_}, destinationPos{destinationPos_}, scrollFocusPositions{scrollFocusPositions_}, eventSystemListener{eventSystemListener_}, lastJoystickScrollDirection{lastJoystickScrollDirection_}, joystickScrollStartTime{joystickScrollStartTime_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public System.Void add_scrollPositionChangedEvent(System.Action`1<System.Single> value)
    // Offset: 0x129B0C8
    void add_scrollPositionChangedEvent(System::Action_1<float>* value);
    // public System.Void remove_scrollPositionChangedEvent(System.Action`1<System.Single> value)
    // Offset: 0x129B16C
    void remove_scrollPositionChangedEvent(System::Action_1<float>* value);
    // public UnityEngine.RectTransform get_viewportTransform()
    // Offset: 0x129B210
    UnityEngine::RectTransform* get_viewportTransform();
    // public UnityEngine.RectTransform get_contentTransform()
    // Offset: 0x129B218
    UnityEngine::RectTransform* get_contentTransform();
    // public System.Single get_position()
    // Offset: 0x129B220
    float get_position();
    // public System.Single get_scrollableSize()
    // Offset: 0x129B25C
    float get_scrollableSize();
    // private System.Single get_scrollPageSize()
    // Offset: 0x129B348
    float get_scrollPageSize();
    // private System.Single get_contentSize()
    // Offset: 0x129B2E8
    float get_contentSize();
    // protected System.Void Awake()
    // Offset: 0x129B3A8
    void Awake();
    // protected System.Void OnDestroy()
    // Offset: 0x129B9E4
    void OnDestroy();
    // protected System.Void Update()
    // Offset: 0x129BBC4
    void Update();
    // protected System.Void SetContentSize(System.Single contentSize)
    // Offset: 0x129BE08
    void SetContentSize(float contentSize);
    // public System.Void UpdateContentSize()
    // Offset: 0x129B810
    void UpdateContentSize();
    // public System.Void ScrollToEnd(System.Boolean animated)
    // Offset: 0x129C0E4
    void ScrollToEnd(bool animated);
    // public System.Void ScrollToWorldPosition(UnityEngine.Vector3 worldPosition, System.Single pageRelativePosition, System.Boolean animated)
    // Offset: 0x129C128
    void ScrollToWorldPosition(UnityEngine::Vector3 worldPosition, float pageRelativePosition, bool animated);
    // public System.Void ScrollToWorldPositionIfOutsideArea(UnityEngine.Vector3 worldPosition, System.Single pageRelativePosition, System.Single relativeBoundaryStart, System.Single relativeBoundaryEnd, System.Boolean animated)
    // Offset: 0x129C2A0
    void ScrollToWorldPositionIfOutsideArea(UnityEngine::Vector3 worldPosition, float pageRelativePosition, float relativeBoundaryStart, float relativeBoundaryEnd, bool animated);
    // public System.Void ScrollTo(System.Single destinationPos, System.Boolean animated)
    // Offset: 0x129AF88
    void ScrollTo(float destinationPos, bool animated);
    // private UnityEngine.Vector2 WorldPositionToScrollViewPosition(UnityEngine.Vector3 worldPosition)
    // Offset: 0x129C174
    UnityEngine::Vector2 WorldPositionToScrollViewPosition(UnityEngine::Vector3 worldPosition);
    // private System.Void SetDestinationPos(System.Single value)
    // Offset: 0x129C354
    void SetDestinationPos(float value);
    // private System.Void UpdateVerticalScrollIndicator(System.Single posY)
    // Offset: 0x129BD48
    void UpdateVerticalScrollIndicator(float posY);
    // private System.Void PageUpButtonPressed()
    // Offset: 0x129C498
    void PageUpButtonPressed();
    // private System.Void PageDownButtonPressed()
    // Offset: 0x129C670
    void PageDownButtonPressed();
    // private System.Void RefreshButtons()
    // Offset: 0x129B8B0
    void RefreshButtons();
    // private System.Void HandlePointerDidEnter(UnityEngine.EventSystems.PointerEventData eventData)
    // Offset: 0x129C878
    void HandlePointerDidEnter(UnityEngine::EventSystems::PointerEventData* eventData);
    // private System.Void HandlePointerDidExit(UnityEngine.EventSystems.PointerEventData eventData)
    // Offset: 0x129CA18
    void HandlePointerDidExit(UnityEngine::EventSystems::PointerEventData* eventData);
    // private System.Void HandleJoystickWasNotCenteredThisFrame(UnityEngine.Vector2 deltaPos)
    // Offset: 0x129CBB8
    void HandleJoystickWasNotCenteredThisFrame(UnityEngine::Vector2 deltaPos);
    // private System.Void HandleJoystickWasCenteredThisFrame()
    // Offset: 0x129CD0C
    void HandleJoystickWasCenteredThisFrame();
    // private HMUI.ScrollView/ScrollDirection ResolveScrollDirection(UnityEngine.Vector2 deltaPos)
    // Offset: 0x129CCBC
    HMUI::ScrollView::ScrollDirection ResolveScrollDirection(UnityEngine::Vector2 deltaPos);
    // private System.Single <Awake>b__38_0(HMUI.ItemForFocussedScrolling item)
    // Offset: 0x129D0B4
    float $Awake$b__38_0(HMUI::ItemForFocussedScrolling* item);
    // private System.Single <Awake>b__38_2(HMUI.ItemForFocussedScrolling item)
    // Offset: 0x129D0FC
    float $Awake$b__38_2(HMUI::ItemForFocussedScrolling* item);
    // public System.Void .ctor()
    // Offset: 0x129D084
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ScrollView* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("HMUI::ScrollView::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ScrollView*, creationType>()));
    }
  }; // HMUI.ScrollView
  #pragma pack(pop)
  static check_size<sizeof(ScrollView), 156 + sizeof(float)> __HMUI_ScrollViewSizeCheck;
  static_assert(sizeof(ScrollView) == 0xA0);
}
DEFINE_IL2CPP_ARG_TYPE(HMUI::ScrollView*, "HMUI", "ScrollView");
DEFINE_IL2CPP_ARG_TYPE(HMUI::ScrollView::ScrollType, "HMUI", "ScrollView/ScrollType");
DEFINE_IL2CPP_ARG_TYPE(HMUI::ScrollView::ScrollDirection, "HMUI", "ScrollView/ScrollDirection");
DEFINE_IL2CPP_ARG_TYPE(HMUI::ScrollView::ScrollViewDirection, "HMUI", "ScrollView/ScrollViewDirection");
