// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: IVRPlatformHelper
  class IVRPlatformHelper;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: VerticalScrollIndicator
  class VerticalScrollIndicator;
  // Forward declaring type: ButtonBinder
  class ButtonBinder;
  // Forward declaring type: EventSystemListener
  class EventSystemListener;
  // Skipping declaration: ScrollDirection because it is already included!
  // Forward declaring type: ItemForFocussedScrolling
  class ItemForFocussedScrolling;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Completed forward declares
// Type namespace: HMUI
namespace HMUI {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: HMUI.ScrollView
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: EE1480
  class ScrollView : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: HMUI::ScrollView::ScrollType
    struct ScrollType;
    // Nested type: HMUI::ScrollView::ScrollDirection
    struct ScrollDirection;
    // Nested type: HMUI::ScrollView::ScrollViewDirection
    struct ScrollViewDirection;
    // Nested type: HMUI::ScrollView::$$c
    class $$c;
    // Nested type: HMUI::ScrollView::$$c__DisplayClass50_0
    class $$c__DisplayClass50_0;
    // Nested type: HMUI::ScrollView::$$c__DisplayClass51_0
    class $$c__DisplayClass51_0;
    // Nested type: HMUI::ScrollView::$$c__DisplayClass56_0
    class $$c__DisplayClass56_0;
    // Nested type: HMUI::ScrollView::$$c__DisplayClass56_1
    class $$c__DisplayClass56_1;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HMUI.ScrollView/ScrollType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ScrollType/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ScrollType
      constexpr ScrollType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HMUI.ScrollView/ScrollType PageSize
      static constexpr const int PageSize = 0;
      // Get static field: static public HMUI.ScrollView/ScrollType PageSize
      static HMUI::ScrollView::ScrollType _get_PageSize();
      // Set static field: static public HMUI.ScrollView/ScrollType PageSize
      static void _set_PageSize(HMUI::ScrollView::ScrollType value);
      // static field const value: static public HMUI.ScrollView/ScrollType FixedCellSize
      static constexpr const int FixedCellSize = 1;
      // Get static field: static public HMUI.ScrollView/ScrollType FixedCellSize
      static HMUI::ScrollView::ScrollType _get_FixedCellSize();
      // Set static field: static public HMUI.ScrollView/ScrollType FixedCellSize
      static void _set_FixedCellSize(HMUI::ScrollView::ScrollType value);
      // static field const value: static public HMUI.ScrollView/ScrollType FocusItems
      static constexpr const int FocusItems = 2;
      // Get static field: static public HMUI.ScrollView/ScrollType FocusItems
      static HMUI::ScrollView::ScrollType _get_FocusItems();
      // Set static field: static public HMUI.ScrollView/ScrollType FocusItems
      static void _set_FocusItems(HMUI::ScrollView::ScrollType value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HMUI.ScrollView/ScrollType
    #pragma pack(pop)
    static check_size<sizeof(ScrollView::ScrollType), 0 + sizeof(int)> __HMUI_ScrollView_ScrollTypeSizeCheck;
    static_assert(sizeof(ScrollView::ScrollType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HMUI.ScrollView/ScrollDirection
    // [TokenAttribute] Offset: FFFFFFFF
    struct ScrollDirection/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ScrollDirection
      constexpr ScrollDirection(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HMUI.ScrollView/ScrollDirection None
      static constexpr const int None = 0;
      // Get static field: static public HMUI.ScrollView/ScrollDirection None
      static HMUI::ScrollView::ScrollDirection _get_None();
      // Set static field: static public HMUI.ScrollView/ScrollDirection None
      static void _set_None(HMUI::ScrollView::ScrollDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollDirection Up
      static constexpr const int Up = 1;
      // Get static field: static public HMUI.ScrollView/ScrollDirection Up
      static HMUI::ScrollView::ScrollDirection _get_Up();
      // Set static field: static public HMUI.ScrollView/ScrollDirection Up
      static void _set_Up(HMUI::ScrollView::ScrollDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollDirection Down
      static constexpr const int Down = 2;
      // Get static field: static public HMUI.ScrollView/ScrollDirection Down
      static HMUI::ScrollView::ScrollDirection _get_Down();
      // Set static field: static public HMUI.ScrollView/ScrollDirection Down
      static void _set_Down(HMUI::ScrollView::ScrollDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollDirection Left
      static constexpr const int Left = 3;
      // Get static field: static public HMUI.ScrollView/ScrollDirection Left
      static HMUI::ScrollView::ScrollDirection _get_Left();
      // Set static field: static public HMUI.ScrollView/ScrollDirection Left
      static void _set_Left(HMUI::ScrollView::ScrollDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollDirection Right
      static constexpr const int Right = 4;
      // Get static field: static public HMUI.ScrollView/ScrollDirection Right
      static HMUI::ScrollView::ScrollDirection _get_Right();
      // Set static field: static public HMUI.ScrollView/ScrollDirection Right
      static void _set_Right(HMUI::ScrollView::ScrollDirection value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HMUI.ScrollView/ScrollDirection
    #pragma pack(pop)
    static check_size<sizeof(ScrollView::ScrollDirection), 0 + sizeof(int)> __HMUI_ScrollView_ScrollDirectionSizeCheck;
    static_assert(sizeof(ScrollView::ScrollDirection) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HMUI.ScrollView/ScrollViewDirection
    // [TokenAttribute] Offset: FFFFFFFF
    struct ScrollViewDirection/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ScrollViewDirection
      constexpr ScrollViewDirection(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HMUI.ScrollView/ScrollViewDirection Vertical
      static constexpr const int Vertical = 0;
      // Get static field: static public HMUI.ScrollView/ScrollViewDirection Vertical
      static HMUI::ScrollView::ScrollViewDirection _get_Vertical();
      // Set static field: static public HMUI.ScrollView/ScrollViewDirection Vertical
      static void _set_Vertical(HMUI::ScrollView::ScrollViewDirection value);
      // static field const value: static public HMUI.ScrollView/ScrollViewDirection Horizontal
      static constexpr const int Horizontal = 1;
      // Get static field: static public HMUI.ScrollView/ScrollViewDirection Horizontal
      static HMUI::ScrollView::ScrollViewDirection _get_Horizontal();
      // Set static field: static public HMUI.ScrollView/ScrollViewDirection Horizontal
      static void _set_Horizontal(HMUI::ScrollView::ScrollViewDirection value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HMUI.ScrollView/ScrollViewDirection
    #pragma pack(pop)
    static check_size<sizeof(ScrollView::ScrollViewDirection), 0 + sizeof(int)> __HMUI_ScrollView_ScrollViewDirectionSizeCheck;
    static_assert(sizeof(ScrollView::ScrollViewDirection) == 0x4);
    // private UnityEngine.RectTransform _viewport
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::RectTransform* viewport;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _contentRectTransform
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::RectTransform* contentRectTransform;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // [SpaceAttribute] Offset: 0xEE2EB8
    // private HMUI.ScrollView/ScrollViewDirection _scrollViewDirection
    // Size: 0x4
    // Offset: 0x28
    HMUI::ScrollView::ScrollViewDirection scrollViewDirection;
    // Field size check
    static_assert(sizeof(HMUI::ScrollView::ScrollViewDirection) == 0x4);
    // Padding between fields: scrollViewDirection and: pageUpButton
    char __padding2[0x4] = {};
    // [SpaceAttribute] Offset: 0xEE2EF0
    // [NullAllowed] Offset: 0xEE2EF0
    // private UnityEngine.UI.Button _pageUpButton
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::UI::Button* pageUpButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // [NullAllowed] Offset: 0xEE2F38
    // private UnityEngine.UI.Button _pageDownButton
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::UI::Button* pageDownButton;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Button*) == 0x8);
    // [NullAllowed] Offset: 0xEE2F70
    // private HMUI.VerticalScrollIndicator _verticalScrollIndicator
    // Size: 0x8
    // Offset: 0x40
    HMUI::VerticalScrollIndicator* verticalScrollIndicator;
    // Field size check
    static_assert(sizeof(HMUI::VerticalScrollIndicator*) == 0x8);
    // [SpaceAttribute] Offset: 0xEE2FA8
    // private System.Single _smooth
    // Size: 0x4
    // Offset: 0x48
    float smooth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _joystickScrollSpeed
    // Size: 0x4
    // Offset: 0x4C
    float joystickScrollSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _joystickQuickSnapMaxTime
    // Size: 0x4
    // Offset: 0x50
    float joystickQuickSnapMaxTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0xEE3000
    // public HMUI.ScrollView/ScrollType _scrollType
    // Size: 0x4
    // Offset: 0x54
    HMUI::ScrollView::ScrollType scrollType;
    // Field size check
    static_assert(sizeof(HMUI::ScrollView::ScrollType) == 0x4);
    // [SpaceAttribute] Offset: 0xEE3010
    // [DrawIfAttribute] Offset: 0xEE3010
    // public System.Single _fixedCellSize
    // Size: 0x4
    // Offset: 0x58
    float fixedCellSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [DrawIfAttribute] Offset: 0xEE30B8
    // public System.Single _scrollItemRelativeThresholdPosition
    // Size: 0x4
    // Offset: 0x5C
    float scrollItemRelativeThresholdPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [DrawIfAttribute] Offset: 0xEE3150
    // public System.Single _pageStepNormalizedSize
    // Size: 0x4
    // Offset: 0x60
    float pageStepNormalizedSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: pageStepNormalizedSize and: platformHelper
    char __padding12[0x4] = {};
    // [InjectAttribute] Offset: 0xEE3200
    // private readonly IVRPlatformHelper _platformHelper
    // Size: 0x8
    // Offset: 0x68
    GlobalNamespace::IVRPlatformHelper* platformHelper;
    // Field size check
    static_assert(sizeof(GlobalNamespace::IVRPlatformHelper*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xEE3210
    // private System.Action`1<System.Single> scrollPositionChangedEvent
    // Size: 0x8
    // Offset: 0x70
    System::Action_1<float>* scrollPositionChangedEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<float>*) == 0x8);
    // private HMUI.ButtonBinder _buttonBinder
    // Size: 0x8
    // Offset: 0x78
    HMUI::ButtonBinder* buttonBinder;
    // Field size check
    static_assert(sizeof(HMUI::ButtonBinder*) == 0x8);
    // private System.Single _destinationPos
    // Size: 0x4
    // Offset: 0x80
    float destinationPos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: destinationPos and: scrollFocusPositions
    char __padding16[0x4] = {};
    // private System.Single[] _scrollFocusPositions
    // Size: 0x8
    // Offset: 0x88
    ::Array<float>* scrollFocusPositions;
    // Field size check
    static_assert(sizeof(::Array<float>*) == 0x8);
    // private HMUI.EventSystemListener _eventSystemListener
    // Size: 0x8
    // Offset: 0x90
    HMUI::EventSystemListener* eventSystemListener;
    // Field size check
    static_assert(sizeof(HMUI::EventSystemListener*) == 0x8);
    // private HMUI.ScrollView/ScrollDirection _lastJoystickScrollDirection
    // Size: 0x4
    // Offset: 0x98
    HMUI::ScrollView::ScrollDirection lastJoystickScrollDirection;
    // Field size check
    static_assert(sizeof(HMUI::ScrollView::ScrollDirection) == 0x4);
    // private System.Single _joystickScrollStartTime
    // Size: 0x4
    // Offset: 0x9C
    float joystickScrollStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: ScrollView
