// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HMUI.ITableCellOwner
#include "HMUI/ITableCellOwner.hpp"
// Including type: HMUI.TableViewSelectionType
#include "HMUI/TableViewSelectionType.hpp"
// Including type: HMUI.SelectableCell
#include "HMUI/SelectableCell.hpp"
// Including type: UnityEngine.RectTransform
#include "UnityEngine/RectTransform.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Tuple`2<T1, T2>
  template<typename T1, typename T2>
  class Tuple_2;
}
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: ScrollView
  class ScrollView;
  // Forward declaring type: TableCell
  class TableCell;
  // Skipping declaration: TableType because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: HMUI
namespace HMUI {
  // Size: 0xA2
  #pragma pack(push, 1)
  // Autogenerated type: HMUI.TableView
  // [RequireComponent] Offset: DF7BEC
  class TableView : public UnityEngine::MonoBehaviour/*, public HMUI::ITableCellOwner*/ {
    public:
    // Nested type: HMUI::TableView::TableType
    struct TableType;
    // Nested type: HMUI::TableView::ScrollPositionType
    struct ScrollPositionType;
    // Nested type: HMUI::TableView::CellsGroup
    class CellsGroup;
    // Nested type: HMUI::TableView::IDataSource
    class IDataSource;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HMUI.TableView/TableType
    struct TableType/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: TableType
      constexpr TableType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HMUI.TableView/TableType Vertical
      static constexpr const int Vertical = 0;
      // Get static field: static public HMUI.TableView/TableType Vertical
      static HMUI::TableView::TableType _get_Vertical();
      // Set static field: static public HMUI.TableView/TableType Vertical
      static void _set_Vertical(HMUI::TableView::TableType value);
      // static field const value: static public HMUI.TableView/TableType Horizontal
      static constexpr const int Horizontal = 1;
      // Get static field: static public HMUI.TableView/TableType Horizontal
      static HMUI::TableView::TableType _get_Horizontal();
      // Set static field: static public HMUI.TableView/TableType Horizontal
      static void _set_Horizontal(HMUI::TableView::TableType value);
    }; // HMUI.TableView/TableType
    #pragma pack(pop)
    static check_size<sizeof(TableView::TableType), 0 + sizeof(int)> __HMUI_TableView_TableTypeSizeCheck;
    static_assert(sizeof(TableView::TableType) == 0x4);
    // private HMUI.ScrollView _scrollView
    // Size: 0x8
    // Offset: 0x18
    HMUI::ScrollView* scrollView;
    // Field size check
    static_assert(sizeof(HMUI::ScrollView*) == 0x8);
    // [SpaceAttribute] Offset: 0xDF9D10
    // private System.Boolean _scrollToTopOnEnable
    // Size: 0x1
    // Offset: 0x20
    bool scrollToTopOnEnable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _alignToCenter
    // Size: 0x1
    // Offset: 0x21
    bool alignToCenter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: alignToCenter and: tableType
    char __padding2[0x2] = {};
    // private HMUI.TableView/TableType _tableType
    // Size: 0x4
    // Offset: 0x24
    HMUI::TableView::TableType tableType;
    // Field size check
    static_assert(sizeof(HMUI::TableView::TableType) == 0x4);
    // [SpaceAttribute] Offset: 0xDF9D68
    // private HMUI.TableViewSelectionType _selectionType
    // Size: 0x4
    // Offset: 0x28
    HMUI::TableViewSelectionType selectionType;
    // Field size check
    static_assert(sizeof(HMUI::TableViewSelectionType) == 0x4);
    // private System.Boolean _canSelectSelectedCell
    // Size: 0x1
    // Offset: 0x2C
    bool canSelectSelectedCell;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canSelectSelectedCell and: preallocatedCells
    char __padding5[0x3] = {};
    // [SpaceAttribute] Offset: 0xDF9DB0
    // [NullAllowed] Offset: 0xDF9DB0
    // private HMUI.TableView/CellsGroup[] _preallocatedCells
    // Size: 0x8
    // Offset: 0x30
    ::Array<HMUI::TableView::CellsGroup*>* preallocatedCells;
    // Field size check
    static_assert(sizeof(::Array<HMUI::TableView::CellsGroup*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF9DF8
    // private System.Action`2<HMUI.TableView,System.Int32> didSelectCellWithIdxEvent
    // Size: 0x8
    // Offset: 0x38
    System::Action_2<HMUI::TableView*, int>* didSelectCellWithIdxEvent;
    // Field size check
    static_assert(sizeof(System::Action_2<HMUI::TableView*, int>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF9E08
    // private System.Action`1<HMUI.TableView> didReloadDataEvent
    // Size: 0x8
    // Offset: 0x40
    System::Action_1<HMUI::TableView*>* didReloadDataEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<HMUI::TableView*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF9E18
    // private System.Action`1<HMUI.TableView> didInsertCellsEvent
    // Size: 0x8
    // Offset: 0x48
    System::Action_1<HMUI::TableView*>* didInsertCellsEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<HMUI::TableView*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF9E28
    // private System.Action`1<HMUI.TableView> didDeleteCellsEvent
    // Size: 0x8
    // Offset: 0x50
    System::Action_1<HMUI::TableView*>* didDeleteCellsEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<HMUI::TableView*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDF9E38
    // private System.Action`1<HMUI.TableView> didChangeRectSizeEvent
    // Size: 0x8
    // Offset: 0x58
    System::Action_1<HMUI::TableView*>* didChangeRectSizeEvent;
    // Field size check
    static_assert(sizeof(System::Action_1<HMUI::TableView*>*) == 0x8);
    // private UnityEngine.RectTransform _contentTransform
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::RectTransform* contentTransform;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _viewportTransform
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::RectTransform* viewportTransform;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // protected HMUI.TableView/IDataSource _dataSource
    // Size: 0x8
    // Offset: 0x70
    HMUI::TableView::IDataSource* dataSource;
    // Field size check
    static_assert(sizeof(HMUI::TableView::IDataSource*) == 0x8);
    // private System.Int32 _numberOfCells
    // Size: 0x4
    // Offset: 0x78
    int numberOfCells;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _cellSize
    // Size: 0x4
    // Offset: 0x7C
    float cellSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly System.Collections.Generic.List`1<HMUI.TableCell> _visibleCells
    // Size: 0x8
    // Offset: 0x80
    System::Collections::Generic::List_1<HMUI::TableCell*>* visibleCells;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HMUI::TableCell*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<HMUI.TableCell>> _reusableCells
    // Size: 0x8
    // Offset: 0x88
    System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Collections::Generic::List_1<HMUI::TableCell*>*>* reusableCells;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Collections::Generic::List_1<HMUI::TableCell*>*>*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.Int32> _selectedCellIdxs
    // Size: 0x8
    // Offset: 0x90
    System::Collections::Generic::HashSet_1<int>* selectedCellIdxs;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // private System.Int32 _prevMinIdx
    // Size: 0x4
    // Offset: 0x98
    int prevMinIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _prevMaxIdx
    // Size: 0x4
    // Offset: 0x9C
    int prevMaxIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _isInitialized
    // Size: 0x1
    // Offset: 0xA0
    bool isInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _refreshCellsOnEnable
    // Size: 0x1
    // Offset: 0xA1
    bool refreshCellsOnEnable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: TableView
