// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: HMUI.SegmentedControl
#include "HMUI/SegmentedControl.hpp"
// Including type: HMUI.SegmentedControl/IDataSource
#include "HMUI/SegmentedControl_IDataSource.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HMUI
namespace HMUI {
  // Forward declaring type: TextSegmentedControlCell
  class TextSegmentedControlCell;
  // Forward declaring type: SegmentedControlCell
  class SegmentedControlCell;
}
// Forward declaring namespace: Zenject
namespace Zenject {
  // Forward declaring type: DiContainer
  class DiContainer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Completed forward declares
// Type namespace: HMUI
namespace HMUI {
  // Autogenerated type: HMUI.TextSegmentedControl
  class TextSegmentedControl : public HMUI::SegmentedControl/*, public HMUI::SegmentedControl::IDataSource*/ {
    public:
    // private System.Single _fontSize
    // Offset: 0x58
    float fontSize;
    // private System.Boolean _overrideCellSize
    // Offset: 0x5C
    bool overrideCellSize;
    // private System.Single _padding
    // Offset: 0x60
    float padding;
    // private System.Boolean _hideCellBackground
    // Offset: 0x64
    bool hideCellBackground;
    // private HMUI.TextSegmentedControlCell _firstCellPrefab
    // Offset: 0x68
    HMUI::TextSegmentedControlCell* firstCellPrefab;
    // private HMUI.TextSegmentedControlCell _lastCellPrefab
    // Offset: 0x70
    HMUI::TextSegmentedControlCell* lastCellPrefab;
    // private HMUI.TextSegmentedControlCell _singleCellPrefab
    // Offset: 0x78
    HMUI::TextSegmentedControlCell* singleCellPrefab;
    // private HMUI.TextSegmentedControlCell _middleCellPrefab
    // Offset: 0x80
    HMUI::TextSegmentedControlCell* middleCellPrefab;
    // private readonly Zenject.DiContainer _container
    // Offset: 0x88
    Zenject::DiContainer* container;
    // private System.Collections.Generic.IReadOnlyList`1<System.String> _texts
    // Offset: 0x90
    System::Collections::Generic::IReadOnlyList_1<::Il2CppString*>* texts;
    // Creating interface conversion operator: operator HMUI::SegmentedControl::IDataSource
    operator HMUI::SegmentedControl::IDataSource() noexcept {
      return *reinterpret_cast<HMUI::SegmentedControl::IDataSource*>(this);
    }
    // public System.Void SetTexts(System.Collections.Generic.IReadOnlyList`1<System.String> texts)
    // Offset: 0x108AF64
    void SetTexts(System::Collections::Generic::IReadOnlyList_1<::Il2CppString*>* texts);
    // private HMUI.TextSegmentedControlCell InstantiateCell(UnityEngine.Object prefab)
    // Offset: 0x108B310
    HMUI::TextSegmentedControlCell* InstantiateCell(UnityEngine::Object* prefab);
    // public System.Int32 NumberOfCells()
    // Offset: 0x108AFA4
    // Implemented from: HMUI.SegmentedControl/IDataSource
    // Base method: System.Int32 IDataSource::NumberOfCells()
    int NumberOfCells();
    // public HMUI.SegmentedControlCell CellForCellNumber(System.Int32 cellNumber)
    // Offset: 0x108B060
    // Implemented from: HMUI.SegmentedControl/IDataSource
    // Base method: HMUI.SegmentedControlCell IDataSource::CellForCellNumber(System.Int32 cellNumber)
    HMUI::SegmentedControlCell* CellForCellNumber(int cellNumber);
    // public System.Void .ctor()
    // Offset: 0x108B4EC
    // Implemented from: HMUI.SegmentedControl
    // Base method: System.Void SegmentedControl::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static TextSegmentedControl* New_ctor();
  }; // HMUI.TextSegmentedControl
  check_size<sizeof(TextSegmentedControl), 144 + sizeof(void*) + 8 - (144 + sizeof(void*)) % 8> __HMUI_TextSegmentedControlSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(HMUI::TextSegmentedControl*, "HMUI", "TextSegmentedControl");
#pragma pack(pop)
