// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: EncoderNLS
  class EncoderNLS;
}
// Completed forward declares
// Type namespace: System.Text
namespace System::Text {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.Text.EncoderFallbackBuffer
  // [] Offset: FFFFFFFF
  class EncoderFallbackBuffer : public ::Il2CppObject {
    public:
    // System.Char* charStart
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppChar* charStart;
    // Field size check
    static_assert(sizeof(::Il2CppChar*) == 0x8);
    // System.Char* charEnd
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppChar* charEnd;
    // Field size check
    static_assert(sizeof(::Il2CppChar*) == 0x8);
    // System.Text.EncoderNLS encoder
    // Size: 0x8
    // Offset: 0x20
    System::Text::EncoderNLS* encoder;
    // Field size check
    static_assert(sizeof(System::Text::EncoderNLS*) == 0x8);
    // System.Boolean setEncoder
    // Size: 0x1
    // Offset: 0x28
    bool setEncoder;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean bUsedEncoder
    // Size: 0x1
    // Offset: 0x29
    bool bUsedEncoder;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean bFallingBack
    // Size: 0x1
    // Offset: 0x2A
    bool bFallingBack;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bFallingBack and: iRecursionCount
    char __padding5[0x1] = {};
    // System.Int32 iRecursionCount
    // Size: 0x4
    // Offset: 0x2C
    int iRecursionCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: EncoderFallbackBuffer
    EncoderFallbackBuffer(::Il2CppChar* charStart_ = {}, ::Il2CppChar* charEnd_ = {}, System::Text::EncoderNLS* encoder_ = {}, bool setEncoder_ = {}, bool bUsedEncoder_ = {}, bool bFallingBack_ = {}, int iRecursionCount_ = {}) noexcept : charStart{charStart_}, charEnd{charEnd_}, encoder{encoder_}, setEncoder{setEncoder_}, bUsedEncoder{bUsedEncoder_}, bFallingBack{bFallingBack_}, iRecursionCount{iRecursionCount_} {}
    // public System.Boolean Fallback(System.Char charUnknown, System.Int32 index)
    // Offset: 0xFFFFFFFF
    bool Fallback_NEW(::Il2CppChar charUnknown, int index);
    // public System.Boolean Fallback(System.Char charUnknownHigh, System.Char charUnknownLow, System.Int32 index)
    // Offset: 0xFFFFFFFF
    bool Fallback_NEW(::Il2CppChar charUnknownHigh, ::Il2CppChar charUnknownLow, int index);
    // public System.Char GetNextChar()
    // Offset: 0xFFFFFFFF
    ::Il2CppChar GetNextChar_NEW();
    // public System.Boolean MovePrevious()
    // Offset: 0xFFFFFFFF
    bool MovePrevious_NEW();
    // public System.Int32 get_Remaining()
    // Offset: 0xFFFFFFFF
    int get_Remaining_NEW();
    // public System.Void Reset()
    // Offset: 0x1A13280
    void Reset_NEW();
    // System.Void InternalReset()
    // Offset: 0x1A132B4
    void InternalReset();
    // System.Void InternalInitialize(System.Char* charStart, System.Char* charEnd, System.Text.EncoderNLS encoder, System.Boolean setEncoder)
    // Offset: 0x1A0F570
    void InternalInitialize(::Il2CppChar* charStart, ::Il2CppChar* charEnd, System::Text::EncoderNLS* encoder, bool setEncoder);
    // System.Char InternalGetNextChar()
    // Offset: 0x1A0F58C
    ::Il2CppChar InternalGetNextChar();
    // System.Boolean InternalFallback(System.Char ch, ref System.Char* chars)
    // Offset: 0x1A132CC
    bool InternalFallback_NEW(::Il2CppChar ch, ::Il2CppChar*& chars);
    // System.Void ThrowLastCharRecursive(System.Int32 charRecursive)
    // Offset: 0x1A1349C
    void ThrowLastCharRecursive(int charRecursive);
    // protected System.Void .ctor()
    // Offset: 0x1A12BE4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static EncoderFallbackBuffer* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Text::EncoderFallbackBuffer::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<EncoderFallbackBuffer*, creationType>()));
    }
  }; // System.Text.EncoderFallbackBuffer
  #pragma pack(pop)
  static check_size<sizeof(EncoderFallbackBuffer), 44 + sizeof(int)> __System_Text_EncoderFallbackBufferSizeCheck;
  static_assert(sizeof(EncoderFallbackBuffer) == 0x30);
}
DEFINE_IL2CPP_ARG_TYPE(System::Text::EncoderFallbackBuffer*, "System.Text", "EncoderFallbackBuffer");
