// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: DigitalOpus.MB.Core.MB2_TexturePacker
#include "DigitalOpus/MB/Core/MB2_TexturePacker.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DigitalOpus::MB::Core::MB2_TexturePacker::PixRect);
DEFINE_IL2CPP_ARG_TYPE(::DigitalOpus::MB::Core::MB2_TexturePacker::PixRect*, "DigitalOpus.MB.Core", "MB2_TexturePacker/PixRect");
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Size: 0x20
  #pragma pack(push, 1)
  // Autogenerated type: DigitalOpus.MB.Core.MB2_TexturePacker/DigitalOpus.MB.Core.PixRect
  // [TokenAttribute] Offset: FFFFFFFF
  class MB2_TexturePacker::PixRect : public ::Il2CppObject {
    public:
    public:
    // public System.Int32 x
    // Size: 0x4
    // Offset: 0x10
    int x;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 y
    // Size: 0x4
    // Offset: 0x14
    int y;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 w
    // Size: 0x4
    // Offset: 0x18
    int w;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 h
    // Size: 0x4
    // Offset: 0x1C
    int h;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public System.Int32 x
    [[deprecated("Use field access instead!")]] int& dyn_x();
    // Get instance field reference: public System.Int32 y
    [[deprecated("Use field access instead!")]] int& dyn_y();
    // Get instance field reference: public System.Int32 w
    [[deprecated("Use field access instead!")]] int& dyn_w();
    // Get instance field reference: public System.Int32 h
    [[deprecated("Use field access instead!")]] int& dyn_h();
    // public System.Void .ctor()
    // Offset: 0xC17CB8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MB2_TexturePacker::PixRect* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::DigitalOpus::MB::Core::MB2_TexturePacker::PixRect::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MB2_TexturePacker::PixRect*, creationType>()));
    }
    // public System.Void .ctor(System.Int32 xx, System.Int32 yy, System.Int32 ww, System.Int32 hh)
    // Offset: 0xC17CC0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MB2_TexturePacker::PixRect* New_ctor(int xx, int yy, int ww, int hh) {
      static auto ___internal__logger = ::Logger::get().WithContext("::DigitalOpus::MB::Core::MB2_TexturePacker::PixRect::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MB2_TexturePacker::PixRect*, creationType>(xx, yy, ww, hh)));
    }
    // public override System.String ToString()
    // Offset: 0xC17D0C
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::StringW ToString();
  }; // DigitalOpus.MB.Core.MB2_TexturePacker/DigitalOpus.MB.Core.PixRect
  #pragma pack(pop)
  static check_size<sizeof(MB2_TexturePacker::PixRect), 28 + sizeof(int)> __DigitalOpus_MB_Core_MB2_TexturePacker_PixRectSizeCheck;
  static_assert(sizeof(MB2_TexturePacker::PixRect) == 0x20);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: DigitalOpus::MB::Core::MB2_TexturePacker::PixRect::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: DigitalOpus::MB::Core::MB2_TexturePacker::PixRect::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: DigitalOpus::MB::Core::MB2_TexturePacker::PixRect::ToString
// Il2CppName: ToString
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (DigitalOpus::MB::Core::MB2_TexturePacker::PixRect::*)()>(&DigitalOpus::MB::Core::MB2_TexturePacker::PixRect::ToString)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(DigitalOpus::MB::Core::MB2_TexturePacker::PixRect*), "ToString", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
