// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: DigitalOpus.MB.Core.MB_IMeshBakerSettings
#include "DigitalOpus/MB/Core/MB_IMeshBakerSettings.hpp"
// Including type: DigitalOpus.MB.Core.MB_RenderType
#include "DigitalOpus/MB/Core/MB_RenderType.hpp"
// Including type: DigitalOpus.MB.Core.MB2_OutputOptions
#include "DigitalOpus/MB/Core/MB2_OutputOptions.hpp"
// Including type: DigitalOpus.MB.Core.MB2_LightmapOptions
#include "DigitalOpus/MB/Core/MB2_LightmapOptions.hpp"
// Including type: DigitalOpus.MB.Core.MB_MeshPivotLocation
#include "DigitalOpus/MB/Core/MB_MeshPivotLocation.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Object
  class Object;
}
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: IAssignToMeshCustomizer
  class IAssignToMeshCustomizer;
}
// Completed forward declares
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MB3_MeshCombinerSettingsData
  class MB3_MeshCombinerSettingsData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DigitalOpus::MB::Core::MB3_MeshCombinerSettingsData);
DEFINE_IL2CPP_ARG_TYPE(::DigitalOpus::MB::Core::MB3_MeshCombinerSettingsData*, "DigitalOpus.MB.Core", "MB3_MeshCombinerSettingsData");
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: DigitalOpus.MB.Core.MB3_MeshCombinerSettingsData
  // [TokenAttribute] Offset: FFFFFFFF
  class MB3_MeshCombinerSettingsData : public ::Il2CppObject/*, public ::DigitalOpus::MB::Core::MB_IMeshBakerSettings*/ {
    public:
    public:
    // protected DigitalOpus.MB.Core.MB_RenderType _renderType
    // Size: 0x4
    // Offset: 0x10
    ::DigitalOpus::MB::Core::MB_RenderType renderType;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB_RenderType) == 0x4);
    // protected DigitalOpus.MB.Core.MB2_OutputOptions _outputOption
    // Size: 0x4
    // Offset: 0x14
    ::DigitalOpus::MB::Core::MB2_OutputOptions outputOption;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_OutputOptions) == 0x4);
    // protected DigitalOpus.MB.Core.MB2_LightmapOptions _lightmapOption
    // Size: 0x4
    // Offset: 0x18
    ::DigitalOpus::MB::Core::MB2_LightmapOptions lightmapOption;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_LightmapOptions) == 0x4);
    // protected System.Boolean _doNorm
    // Size: 0x1
    // Offset: 0x1C
    bool doNorm;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doTan
    // Size: 0x1
    // Offset: 0x1D
    bool doTan;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doCol
    // Size: 0x1
    // Offset: 0x1E
    bool doCol;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV
    // Size: 0x1
    // Offset: 0x1F
    bool doUV;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV3
    // Size: 0x1
    // Offset: 0x20
    bool doUV3;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV4
    // Size: 0x1
    // Offset: 0x21
    bool doUV4;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV5
    // Size: 0x1
    // Offset: 0x22
    bool doUV5;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV6
    // Size: 0x1
    // Offset: 0x23
    bool doUV6;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV7
    // Size: 0x1
    // Offset: 0x24
    bool doUV7;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV8
    // Size: 0x1
    // Offset: 0x25
    bool doUV8;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doBlendShapes
    // Size: 0x1
    // Offset: 0x26
    bool doBlendShapes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doBlendShapes and: pivotLocationType
    char __padding13[0x1] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x98FF90
    // protected DigitalOpus.MB.Core.MB_MeshPivotLocation _pivotLocationType
    // Size: 0x4
    // Offset: 0x28
    ::DigitalOpus::MB::Core::MB_MeshPivotLocation pivotLocationType;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB_MeshPivotLocation) == 0x4);
    // protected UnityEngine.Vector3 _pivotLocation
    // Size: 0xC
    // Offset: 0x2C
    ::UnityEngine::Vector3 pivotLocation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected System.Boolean _clearBuffersAfterBake
    // Size: 0x1
    // Offset: 0x38
    bool clearBuffersAfterBake;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean _optimizeAfterBake
    // Size: 0x1
    // Offset: 0x39
    bool optimizeAfterBake;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: optimizeAfterBake and: uv2UnwrappingParamsHardAngle
    char __padding17[0x2] = {};
    // protected System.Single _uv2UnwrappingParamsHardAngle
    // Size: 0x4
    // Offset: 0x3C
    float uv2UnwrappingParamsHardAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single _uv2UnwrappingParamsPackMargin
    // Size: 0x4
    // Offset: 0x40
    float uv2UnwrappingParamsPackMargin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean _smrNoExtraBonesWhenCombiningMeshRenderers
    // Size: 0x1
    // Offset: 0x44
    bool smrNoExtraBonesWhenCombiningMeshRenderers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _smrMergeBlendShapesWithSameNames
    // Size: 0x1
    // Offset: 0x45
    bool smrMergeBlendShapesWithSameNames;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: smrMergeBlendShapesWithSameNames and: assignToMeshCustomizer
    char __padding21[0x2] = {};
    // protected UnityEngine.Object _assignToMeshCustomizer
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Object* assignToMeshCustomizer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::DigitalOpus::MB::Core::MB_IMeshBakerSettings
    operator ::DigitalOpus::MB::Core::MB_IMeshBakerSettings() noexcept {
      return *reinterpret_cast<::DigitalOpus::MB::Core::MB_IMeshBakerSettings*>(this);
    }
    // Get instance field reference: protected DigitalOpus.MB.Core.MB_RenderType _renderType
    [[deprecated("Use field access instead!")]] ::DigitalOpus::MB::Core::MB_RenderType& dyn__renderType();
    // Get instance field reference: protected DigitalOpus.MB.Core.MB2_OutputOptions _outputOption
    [[deprecated("Use field access instead!")]] ::DigitalOpus::MB::Core::MB2_OutputOptions& dyn__outputOption();
    // Get instance field reference: protected DigitalOpus.MB.Core.MB2_LightmapOptions _lightmapOption
