// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MB2_LogLevel
  struct MB2_LogLevel;
  // Forward declaring type: ShaderTextureProperty
  class ShaderTextureProperty;
  // Forward declaring type: ProgressUpdateDelegate
  class ProgressUpdateDelegate;
  // Forward declaring type: CombineTexturesIntoAtlasesCoroutineResult
  class MB3_TextureCombiner_CombineTexturesIntoAtlasesCoroutineResult;
  // Forward declaring type: MB3_TextureCombiner
  class MB3_TextureCombiner;
  // Forward declaring type: MB2_EditorMethodsInterface
  class MB2_EditorMethodsInterface;
  // Forward declaring type: AtlasPackingResult
  class AtlasPackingResult;
  // Forward declaring type: MB_ITextureCombinerPacker
  class MB_ITextureCombinerPacker;
  // Forward declaring type: MB2_PackingAlgorithmEnum
  struct MB2_PackingAlgorithmEnum;
  // Forward declaring type: MB2_TexturePacker
  class MB2_TexturePacker;
  // Forward declaring type: MeshBakerMaterialTexture
  class MeshBakerMaterialTexture;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Vector2
  struct Vector2;
  // Forward declaring type: Color32
  struct Color32;
  // Forward declaring type: Mesh
  class Mesh;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MB_AtlasesAndRects
  class MB_AtlasesAndRects;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MB3_TextureCombinerPipeline
  class MB3_TextureCombinerPipeline;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline);
DEFINE_IL2CPP_ARG_TYPE(::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline*, "DigitalOpus.MB.Core", "MB3_TextureCombinerPipeline");
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Size: 0x10
  #pragma pack(push, 1)
  // Autogenerated type: DigitalOpus.MB.Core.MB3_TextureCombinerPipeline
  // [TokenAttribute] Offset: FFFFFFFF
  class MB3_TextureCombinerPipeline : public ::Il2CppObject {
    public:
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline::CreateAtlasForProperty
    struct CreateAtlasForProperty;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline::TexturePipelineData
    class TexturePipelineData;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline::$$c__DisplayClass7_0
    class $$c__DisplayClass7_0;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline::$$c__DisplayClass7_1
    class $$c__DisplayClass7_1;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline::$$c__DisplayClass9_0
    class $$c__DisplayClass9_0;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline::$$c__DisplayClass9_1
    class $$c__DisplayClass9_1;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline::$__Step1_CollectDistinctMatTexturesAndUsedObjects$d__9
    class $__Step1_CollectDistinctMatTexturesAndUsedObjects$d__9;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline::$CalculateIdealSizesForTexturesInAtlasAndPadding$d__11
    class $CalculateIdealSizesForTexturesInAtlasAndPadding$d__11;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombinerPipeline::$__Step3_BuildAndSaveAtlasesAndStoreResults$d__14
    class $__Step3_BuildAndSaveAtlasesAndStoreResults$d__14;
    // Size: 0x4
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: DigitalOpus.MB.Core.MB3_TextureCombinerPipeline/DigitalOpus.MB.Core.CreateAtlasForProperty
    // [TokenAttribute] Offset: FFFFFFFF
    struct CreateAtlasForProperty/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean allTexturesAreNull
      // Size: 0x1
      // Offset: 0x0
      bool allTexturesAreNull;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean allTexturesAreSame
      // Size: 0x1
      // Offset: 0x1
      bool allTexturesAreSame;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean allNonTexturePropsAreSame
      // Size: 0x1
      // Offset: 0x2
      bool allNonTexturePropsAreSame;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean allSrcMatsOmittedTextureProperty
      // Size: 0x1
      // Offset: 0x3
      bool allSrcMatsOmittedTextureProperty;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: CreateAtlasForProperty
      constexpr CreateAtlasForProperty(bool allTexturesAreNull_ = {}, bool allTexturesAreSame_ = {}, bool allNonTexturePropsAreSame_ = {}, bool allSrcMatsOmittedTextureProperty_ = {}) noexcept : allTexturesAreNull{allTexturesAreNull_}, allTexturesAreSame{allTexturesAreSame_}, allNonTexturePropsAreSame{allNonTexturePropsAreSame_}, allSrcMatsOmittedTextureProperty{allSrcMatsOmittedTextureProperty_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean allTexturesAreNull
      [[deprecated("Use field access instead!")]] bool& dyn_allTexturesAreNull();
      // Get instance field reference: public System.Boolean allTexturesAreSame
      [[deprecated("Use field access instead!")]] bool& dyn_allTexturesAreSame();
      // Get instance field reference: public System.Boolean allNonTexturePropsAreSame
      [[deprecated("Use field access instead!")]] bool& dyn_allNonTexturePropsAreSame();
      // Get instance field reference: public System.Boolean allSrcMatsOmittedTextureProperty
      [[deprecated("Use field access instead!")]] bool& dyn_allSrcMatsOmittedTextureProperty();
      // public override System.String ToString()
      // Offset: 0xA64F74
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::StringW ToString();
    }; // DigitalOpus.MB.Core.MB3_TextureCombinerPipeline/DigitalOpus.MB.Core.CreateAtlasForProperty
    #pragma pack(pop)
    static check_size<sizeof(MB3_TextureCombinerPipeline::CreateAtlasForProperty), 3 + sizeof(bool)> __DigitalOpus_MB_Core_MB3_TextureCombinerPipeline_CreateAtlasForPropertySizeCheck;
    static_assert(sizeof(MB3_TextureCombinerPipeline::CreateAtlasForProperty) == 0x4);
    // Get static field: static public System.Boolean USE_EXPERIMENTAL_HOIZONTALVERTICAL
    static bool _get_USE_EXPERIMENTAL_HOIZONTALVERTICAL();
    // Set static field: static public System.Boolean USE_EXPERIMENTAL_HOIZONTALVERTICAL
    static void _set_USE_EXPERIMENTAL_HOIZONTALVERTICAL(bool value);
    // Get static field: static public DigitalOpus.MB.Core.ShaderTextureProperty[] shaderTexPropertyNames
    static ::ArrayW<::DigitalOpus::MB::Core::ShaderTextureProperty*> _get_shaderTexPropertyNames();
    // Set static field: static public DigitalOpus.MB.Core.ShaderTextureProperty[] shaderTexPropertyNames
    static void _set_shaderTexPropertyNames(::ArrayW<::DigitalOpus::MB::Core::ShaderTextureProperty*> value);
    // public System.Void .ctor()
    // Offset: 0x15D0F30
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
