// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: DigitalOpus.MB.Core.MB_IMeshBakerSettings
#include "DigitalOpus/MB/Core/MB_IMeshBakerSettings.hpp"
// Including type: DigitalOpus.MB.Core.MB2_ValidationLevel
#include "DigitalOpus/MB/Core/MB2_ValidationLevel.hpp"
// Including type: DigitalOpus.MB.Core.MB2_LogLevel
#include "DigitalOpus/MB/Core/MB2_LogLevel.hpp"
// Including type: DigitalOpus.MB.Core.MB2_OutputOptions
#include "DigitalOpus/MB/Core/MB2_OutputOptions.hpp"
// Including type: DigitalOpus.MB.Core.MB_RenderType
#include "DigitalOpus/MB/Core/MB_RenderType.hpp"
// Including type: DigitalOpus.MB.Core.MB2_LightmapOptions
#include "DigitalOpus/MB/Core/MB2_LightmapOptions.hpp"
// Including type: DigitalOpus.MB.Core.MB_MeshPivotLocation
#include "DigitalOpus/MB/Core/MB_MeshPivotLocation.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MB_IMeshBakerSettingsHolder
  class MB_IMeshBakerSettingsHolder;
  // Forward declaring type: IAssignToMeshCustomizer
  class IAssignToMeshCustomizer;
  // Forward declaring type: MB2_EditorMethodsInterface
  class MB2_EditorMethodsInterface;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MB2_TextureBakeResults
  class MB2_TextureBakeResults;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Object
  class Object;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MB3_MeshCombiner
  class MB3_MeshCombiner;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DigitalOpus::MB::Core::MB3_MeshCombiner);
DEFINE_IL2CPP_ARG_TYPE(::DigitalOpus::MB::Core::MB3_MeshCombiner*, "DigitalOpus.MB.Core", "MB3_MeshCombiner");
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Size: 0x89
  #pragma pack(push, 1)
  // Autogenerated type: DigitalOpus.MB.Core.MB3_MeshCombiner
  // [TokenAttribute] Offset: FFFFFFFF
  class MB3_MeshCombiner : public ::Il2CppObject/*, public ::DigitalOpus::MB::Core::MB_IMeshBakerSettings*/ {
    public:
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombiner::GenerateUV2Delegate
    class GenerateUV2Delegate;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombiner::MBBlendShapeKey
    class MBBlendShapeKey;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombiner::MBBlendShapeValue
    class MBBlendShapeValue;
    public:
    // protected DigitalOpus.MB.Core.MB2_ValidationLevel _validationLevel
    // Size: 0x4
    // Offset: 0x10
    ::DigitalOpus::MB::Core::MB2_ValidationLevel validationLevel;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_ValidationLevel) == 0x4);
    // Padding between fields: validationLevel and: name
    char __padding0[0x4] = {};
    // protected System.String _name
    // Size: 0x8
    // Offset: 0x18
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected MB2_TextureBakeResults _textureBakeResults
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::MB2_TextureBakeResults* textureBakeResults;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB2_TextureBakeResults*) == 0x8);
    // protected UnityEngine.GameObject _resultSceneObject
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* resultSceneObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // protected UnityEngine.Renderer _targetRenderer
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Renderer* targetRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // protected DigitalOpus.MB.Core.MB2_LogLevel _LOG_LEVEL
    // Size: 0x4
    // Offset: 0x38
    ::DigitalOpus::MB::Core::MB2_LogLevel LOG_LEVEL;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_LogLevel) == 0x4);
    // Padding between fields: LOG_LEVEL and: settingsHolder
    char __padding5[0x4] = {};
    // protected UnityEngine.Object _settingsHolder
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Object* settingsHolder;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // protected DigitalOpus.MB.Core.MB2_OutputOptions _outputOption
    // Size: 0x4
    // Offset: 0x48
    ::DigitalOpus::MB::Core::MB2_OutputOptions outputOption;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_OutputOptions) == 0x4);
    // protected DigitalOpus.MB.Core.MB_RenderType _renderType
    // Size: 0x4
    // Offset: 0x4C
    ::DigitalOpus::MB::Core::MB_RenderType renderType;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB_RenderType) == 0x4);
    // protected DigitalOpus.MB.Core.MB2_LightmapOptions _lightmapOption
    // Size: 0x4
    // Offset: 0x50
    ::DigitalOpus::MB::Core::MB2_LightmapOptions lightmapOption;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_LightmapOptions) == 0x4);
    // protected System.Boolean _doNorm
    // Size: 0x1
    // Offset: 0x54
    bool doNorm;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doTan
    // Size: 0x1
    // Offset: 0x55
    bool doTan;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doCol
    // Size: 0x1
    // Offset: 0x56
    bool doCol;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV
    // Size: 0x1
    // Offset: 0x57
    bool doUV;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV3
    // Size: 0x1
    // Offset: 0x58
    bool doUV3;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV4
    // Size: 0x1
    // Offset: 0x59
    bool doUV4;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV5
    // Size: 0x1
    // Offset: 0x5A
    bool doUV5;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV6
    // Size: 0x1
    // Offset: 0x5B
    bool doUV6;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV7
    // Size: 0x1
    // Offset: 0x5C
    bool doUV7;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doUV8
    // Size: 0x1
    // Offset: 0x5D
    bool doUV8;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doBlendShapes
    // Size: 0x1
    // Offset: 0x5E
    bool doBlendShapes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doBlendShapes and: pivotLocationType
    char __padding20[0x1] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x98FD6C
    // protected DigitalOpus.MB.Core.MB_MeshPivotLocation _pivotLocationType
    // Size: 0x4
    // Offset: 0x60
    ::DigitalOpus::MB::Core::MB_MeshPivotLocation pivotLocationType;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB_MeshPivotLocation) == 0x4);
    // protected UnityEngine.Vector3 _pivotLocation
    // Size: 0xC
    // Offset: 0x64
    ::UnityEngine::Vector3 pivotLocation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected System.Boolean _clearBuffersAfterBake
    // Size: 0x1
    // Offset: 0x70
    bool clearBuffersAfterBake;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean _optimizeAfterBake
    // Size: 0x1
    // Offset: 0x71
    bool optimizeAfterBake;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: optimizeAfterBake and: uv2UnwrappingParamsHardAngle
    char __padding24[0x2] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x98FDE8
    // protected System.Single _uv2UnwrappingParamsHardAngle
    // Size: 0x4
    // Offset: 0x74
    float uv2UnwrappingParamsHardAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x98FE34
    // protected System.Single _uv2UnwrappingParamsPackMargin
    // Size: 0x4
    // Offset: 0x78
    float uv2UnwrappingParamsPackMargin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean _smrNoExtraBonesWhenCombiningMeshRenderers
    // Size: 0x1
    // Offset: 0x7C
    bool smrNoExtraBonesWhenCombiningMeshRenderers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _smrMergeBlendShapesWithSameNames
    // Size: 0x1
    // Offset: 0x7D
    bool smrMergeBlendShapesWithSameNames;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: smrMergeBlendShapesWithSameNames and: assignToMeshCustomizer
    char __padding28[0x2] = {};
    // protected UnityEngine.Object _assignToMeshCustomizer
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Object* assignToMeshCustomizer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // protected System.Boolean _usingTemporaryTextureBakeResult
    // Size: 0x1
    // Offset: 0x88
    bool usingTemporaryTextureBakeResult;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::DigitalOpus::MB::Core::MB_IMeshBakerSettings
    operator ::DigitalOpus::MB::Core::MB_IMeshBakerSettings() noexcept {
      return *reinterpret_cast<::DigitalOpus::MB::Core::MB_IMeshBakerSettings*>(this);
    }
    // Get instance field reference: protected DigitalOpus.MB.Core.MB2_ValidationLevel _validationLevel
    [[deprecated("Use field access instead!")]] ::DigitalOpus::MB::Core::MB2_ValidationLevel& dyn__validationLevel();
    // Get instance field reference: protected System.String _name
    [[deprecated("Use field access instead!")]] ::StringW& dyn__name();
    // Get instance field reference: protected MB2_TextureBakeResults _textureBakeResults
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::MB2_TextureBakeResults*& dyn__textureBakeResults();
