// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: DigitalOpus.MB.Core.MB3_MeshCombiner
#include "DigitalOpus/MB/Core/MB3_MeshCombiner.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.BoneWeight
#include "UnityEngine/BoneWeight.hpp"
// Including type: DigitalOpus.MB.Core.MB_Utility/DigitalOpus.MB.Core.MeshAnalysisResult
#include "DigitalOpus/MB/Core/MB_Utility_MeshAnalysisResult.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: SerializableSourceBlendShape2Combined
  class SerializableSourceBlendShape2Combined;
  // Skipping declaration: MB_RenderType because it is already included!
  // Forward declaring type: MB2_EditorMethodsInterface
  class MB2_EditorMethodsInterface;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections::Specialized
namespace System::Collections::Specialized {
  // Forward declaring type: OrderedDictionary
  class OrderedDictionary;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MB2_TextureBakeResults
  class MB2_TextureBakeResults;
}
// Completed forward declares
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MB3_MeshCombinerSingle
  class MB3_MeshCombinerSingle;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DigitalOpus::MB::Core::MB3_MeshCombinerSingle);
DEFINE_IL2CPP_ARG_TYPE(::DigitalOpus::MB::Core::MB3_MeshCombinerSingle*, "DigitalOpus.MB.Core", "MB3_MeshCombinerSingle");
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Size: 0x168
  #pragma pack(push, 1)
  // Autogenerated type: DigitalOpus.MB.Core.MB3_MeshCombinerSingle
  // [TokenAttribute] Offset: FFFFFFFF
  class MB3_MeshCombinerSingle : public ::DigitalOpus::MB::Core::MB3_MeshCombiner {
    public:
    // Writing base type padding for base size: 0x89 to desired offset: 0x90
    char ___base_padding[0x7] = {};
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MB3_MeshCombinerSimpleBones
    class MB3_MeshCombinerSimpleBones;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions
    struct MeshCreationConditions;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::SerializableIntArray
    class SerializableIntArray;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MB_DynamicGameObject
    class MB_DynamicGameObject;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshChannels
    class MeshChannels;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MBBlendShapeFrame
    class MBBlendShapeFrame;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MBBlendShape
    class MBBlendShape;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshChannelsCache
    class MeshChannelsCache;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::BoneAndBindpose
    struct BoneAndBindpose;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::UVAdjuster_Atlas
    class UVAdjuster_Atlas;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::$$c__DisplayClass54_0
    class $$c__DisplayClass54_0;
    // Nested type: ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::$$c__DisplayClass54_1
    class $$c__DisplayClass54_1;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions
    // [TokenAttribute] Offset: FFFFFFFF
    struct MeshCreationConditions/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: MeshCreationConditions
      constexpr MeshCreationConditions(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions NoMesh
      static constexpr const int NoMesh = 0;
      // Get static field: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions NoMesh
      static ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions _get_NoMesh();
      // Set static field: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions NoMesh
      static void _set_NoMesh(::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions value);
      // static field const value: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions CreatedInEditor
      static constexpr const int CreatedInEditor = 1;
      // Get static field: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions CreatedInEditor
      static ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions _get_CreatedInEditor();
      // Set static field: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions CreatedInEditor
      static void _set_CreatedInEditor(::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions value);
      // static field const value: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions CreatedAtRuntime
      static constexpr const int CreatedAtRuntime = 2;
      // Get static field: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions CreatedAtRuntime
      static ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions _get_CreatedAtRuntime();
      // Set static field: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions CreatedAtRuntime
      static void _set_CreatedAtRuntime(::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions value);
      // static field const value: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions AssignedByUser
      static constexpr const int AssignedByUser = 3;
      // Get static field: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions AssignedByUser
      static ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions _get_AssignedByUser();
      // Set static field: static public DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions AssignedByUser
      static void _set_AssignedByUser(::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions
    #pragma pack(pop)
    static check_size<sizeof(MB3_MeshCombinerSingle::MeshCreationConditions), 0 + sizeof(int)> __DigitalOpus_MB_Core_MB3_MeshCombinerSingle_MeshCreationConditionsSizeCheck;
    static_assert(sizeof(MB3_MeshCombinerSingle::MeshCreationConditions) == 0x4);
    public:
    // protected System.Collections.Generic.List`1<UnityEngine.GameObject> objectsInCombinedMesh
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* objectsInCombinedMesh;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // private System.Int32 lightmapIndex
    // Size: 0x4
    // Offset: 0x98
    int lightmapIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: lightmapIndex and: mbDynamicObjectsInCombinedMesh
    char __padding1[0x4] = {};
    // private System.Collections.Generic.List`1<DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MB_DynamicGameObject> mbDynamicObjectsInCombinedMesh
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MB_DynamicGameObject*>* mbDynamicObjectsInCombinedMesh;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MB_DynamicGameObject*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.GameObject,DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MB_DynamicGameObject> _instance2combined_map
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::GameObject*, ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MB_DynamicGameObject*>* instance2combined_map;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::GameObject*, ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MB_DynamicGameObject*>*) == 0x8);
    // private UnityEngine.Vector3[] verts
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<::UnityEngine::Vector3> verts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector3[] normals
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<::UnityEngine::Vector3> normals;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector4[] tangents
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::UnityEngine::Vector4> tangents;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector2[] uvs
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<::UnityEngine::Vector2> uvs;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private System.Single[] uvsSliceIdx
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<float> uvsSliceIdx;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private UnityEngine.Vector2[] uv2s
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::UnityEngine::Vector2> uv2s;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private UnityEngine.Vector2[] uv3s
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<::UnityEngine::Vector2> uv3s;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private UnityEngine.Vector2[] uv4s
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<::UnityEngine::Vector2> uv4s;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private UnityEngine.Vector2[] uv5s
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<::UnityEngine::Vector2> uv5s;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private UnityEngine.Vector2[] uv6s
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::UnityEngine::Vector2> uv6s;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private UnityEngine.Vector2[] uv7s
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::UnityEngine::Vector2> uv7s;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private UnityEngine.Vector2[] uv8s
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::UnityEngine::Vector2> uv8s;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private UnityEngine.Color[] colors
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::UnityEngine::Color> colors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // private UnityEngine.Matrix4x4[] bindPoses
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<::UnityEngine::Matrix4x4> bindPoses;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Matrix4x4>) == 0x8);
    // private UnityEngine.Transform[] bones
    // Size: 0x8
    // Offset: 0x120
    ::ArrayW<::UnityEngine::Transform*> bones;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MBBlendShape[] blendShapes
    // Size: 0x8
    // Offset: 0x128
    ::ArrayW<::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MBBlendShape*> blendShapes;
    // Field size check
    static_assert(sizeof(::ArrayW<::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MBBlendShape*>) == 0x8);
    // DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MBBlendShape[] blendShapesInCombined
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MBBlendShape*> blendShapesInCombined;
    // Field size check
    static_assert(sizeof(::ArrayW<::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MBBlendShape*>) == 0x8);
    // private DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.SerializableIntArray[] submeshTris
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::SerializableIntArray*> submeshTris;
    // Field size check
    static_assert(sizeof(::ArrayW<::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::SerializableIntArray*>) == 0x8);
    // private DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MeshCreationConditions _meshBirth
    // Size: 0x4
    // Offset: 0x140
    ::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions meshBirth;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MeshCreationConditions) == 0x4);
    // Padding between fields: meshBirth and: mesh
    char __padding22[0x4] = {};
    // private UnityEngine.Mesh _mesh
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::Mesh* mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.BoneWeight[] boneWeights
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::UnityEngine::BoneWeight> boneWeights;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::BoneWeight>) == 0x8);
    // private UnityEngine.GameObject[] empty
    // Size: 0x8
    // Offset: 0x158
    ::ArrayW<::UnityEngine::GameObject*> empty;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private System.Int32[] emptyIDs
    // Size: 0x8
    // Offset: 0x160
    ::ArrayW<int> emptyIDs;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    public:
    // Get instance field reference: protected System.Collections.Generic.List`1<UnityEngine.GameObject> objectsInCombinedMesh
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_objectsInCombinedMesh();
    // Get instance field reference: private System.Int32 lightmapIndex
    [[deprecated("Use field access instead!")]] int& dyn_lightmapIndex();
    // Get instance field reference: private System.Collections.Generic.List`1<DigitalOpus.MB.Core.MB3_MeshCombinerSingle/DigitalOpus.MB.Core.MB_DynamicGameObject> mbDynamicObjectsInCombinedMesh
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::MB3_MeshCombinerSingle::MB_DynamicGameObject*>*& dyn_mbDynamicObjectsInCombinedMesh();
