// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: DigitalOpus.MB.Core.MB_TextureTilingTreatment
#include "DigitalOpus/MB/Core/MB_TextureTilingTreatment.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MeshBakerMaterialTexture
  class MeshBakerMaterialTexture;
  // Forward declaring type: MatsAndGOs
  class MatsAndGOs;
  // Forward declaring type: DRect
  struct DRect;
  // Forward declaring type: MB3_TextureCombinerNonTextureProperties
  class MB3_TextureCombinerNonTextureProperties;
  // Forward declaring type: MB3_TextureCombiner
  class MB3_TextureCombiner;
  // Forward declaring type: ShaderTextureProperty
  class ShaderTextureProperty;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rect
  struct Rect;
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MB_TexSet
  class MB_TexSet;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DigitalOpus::MB::Core::MB_TexSet);
DEFINE_IL2CPP_ARG_TYPE(::DigitalOpus::MB::Core::MB_TexSet*, "DigitalOpus.MB.Core", "MB_TexSet");
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: DigitalOpus.MB.Core.MB_TexSet
  // [TokenAttribute] Offset: FFFFFFFF
  class MB_TexSet : public ::Il2CppObject {
    public:
    // Nested type: ::DigitalOpus::MB::Core::MB_TexSet::PipelineVariation
    class PipelineVariation;
    // Nested type: ::DigitalOpus::MB::Core::MB_TexSet::PipelineVariationAllTexturesUseSameMatTiling
    class PipelineVariationAllTexturesUseSameMatTiling;
    // Nested type: ::DigitalOpus::MB::Core::MB_TexSet::PipelineVariationSomeTexturesUseDifferentMatTiling
    class PipelineVariationSomeTexturesUseDifferentMatTiling;
    public:
    // public DigitalOpus.MB.Core.MeshBakerMaterialTexture[] ts
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::DigitalOpus::MB::Core::MeshBakerMaterialTexture*> ts;
    // Field size check
    static_assert(sizeof(::ArrayW<::DigitalOpus::MB::Core::MeshBakerMaterialTexture*>) == 0x8);
    // public DigitalOpus.MB.Core.MatsAndGOs matsAndGOs
    // Size: 0x8
    // Offset: 0x18
    ::DigitalOpus::MB::Core::MatsAndGOs* matsAndGOs;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MatsAndGOs*) == 0x8);
    // private System.Boolean <allTexturesUseSameMatTiling>k__BackingField
    // Size: 0x1
    // Offset: 0x20
    bool allTexturesUseSameMatTiling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <thisIsOnlyTexSetInAtlas>k__BackingField
    // Size: 0x1
    // Offset: 0x21
    bool thisIsOnlyTexSetInAtlas;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: thisIsOnlyTexSetInAtlas and: tilingTreatment
    char __padding3[0x2] = {};
    // private DigitalOpus.MB.Core.MB_TextureTilingTreatment <tilingTreatment>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    ::DigitalOpus::MB::Core::MB_TextureTilingTreatment tilingTreatment;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB_TextureTilingTreatment) == 0x4);
    // private UnityEngine.Vector2 <obUVoffset>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Vector2 obUVoffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 <obUVscale>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Vector2 obUVscale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public System.Int32 idealWidth
    // Size: 0x4
    // Offset: 0x38
    int idealWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 idealHeight
    // Size: 0x4
    // Offset: 0x3C
    int idealHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private DigitalOpus.MB.Core.MB_TexSet/DigitalOpus.MB.Core.PipelineVariation pipelineVariation
    // Size: 0x8
    // Offset: 0x40
    ::DigitalOpus::MB::Core::MB_TexSet::PipelineVariation* pipelineVariation;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB_TexSet::PipelineVariation*) == 0x8);
    public:
    // Get instance field reference: public DigitalOpus.MB.Core.MeshBakerMaterialTexture[] ts
    [[deprecated("Use field access instead!")]] ::ArrayW<::DigitalOpus::MB::Core::MeshBakerMaterialTexture*>& dyn_ts();
    // Get instance field reference: public DigitalOpus.MB.Core.MatsAndGOs matsAndGOs
    [[deprecated("Use field access instead!")]] ::DigitalOpus::MB::Core::MatsAndGOs*& dyn_matsAndGOs();
    // Get instance field reference: private System.Boolean <allTexturesUseSameMatTiling>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$allTexturesUseSameMatTiling$k__BackingField();
    // Get instance field reference: private System.Boolean <thisIsOnlyTexSetInAtlas>k__BackingField
