// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: DigitalOpus.MB.Core.TextureBlender
#include "DigitalOpus/MB/Core/TextureBlender.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: TextureBlenderMaterialPropertyCacheHelper
  class TextureBlenderMaterialPropertyCacheHelper;
  // Forward declaring type: ShaderTextureProperty
  class ShaderTextureProperty;
}
// Completed forward declares
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: TextureBlenderStandardSpecular
  class TextureBlenderStandardSpecular;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DigitalOpus::MB::Core::TextureBlenderStandardSpecular);
DEFINE_IL2CPP_ARG_TYPE(::DigitalOpus::MB::Core::TextureBlenderStandardSpecular*, "DigitalOpus.MB.Core", "TextureBlenderStandardSpecular");
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: DigitalOpus.MB.Core.TextureBlenderStandardSpecular
  // [TokenAttribute] Offset: FFFFFFFF
  class TextureBlenderStandardSpecular : public ::Il2CppObject/*, public ::DigitalOpus::MB::Core::TextureBlender*/ {
    public:
    // Nested type: ::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop
    struct Prop;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop
    // [TokenAttribute] Offset: FFFFFFFF
    struct Prop/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Prop
      constexpr Prop(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doColor
      static constexpr const int doColor = 0;
      // Get static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doColor
      static ::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop _get_doColor();
      // Set static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doColor
      static void _set_doColor(::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop value);
      // static field const value: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doSpecular
      static constexpr const int doSpecular = 1;
      // Get static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doSpecular
      static ::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop _get_doSpecular();
      // Set static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doSpecular
      static void _set_doSpecular(::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop value);
      // static field const value: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doEmission
      static constexpr const int doEmission = 2;
      // Get static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doEmission
      static ::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop _get_doEmission();
      // Set static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doEmission
      static void _set_doEmission(::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop value);
      // static field const value: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doBump
      static constexpr const int doBump = 3;
      // Get static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doBump
      static ::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop _get_doBump();
      // Set static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doBump
      static void _set_doBump(::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop value);
      // static field const value: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doNone
      static constexpr const int doNone = 4;
      // Get static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doNone
      static ::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop _get_doNone();
      // Set static field: static public DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop doNone
      static void _set_doNone(::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop
    #pragma pack(pop)
    static check_size<sizeof(TextureBlenderStandardSpecular::Prop), 0 + sizeof(int)> __DigitalOpus_MB_Core_TextureBlenderStandardSpecular_PropSizeCheck;
    static_assert(sizeof(TextureBlenderStandardSpecular::Prop) == 0x4);
    public:
    // private DigitalOpus.MB.Core.TextureBlenderMaterialPropertyCacheHelper sourceMaterialPropertyCache
    // Size: 0x8
    // Offset: 0x10
    ::DigitalOpus::MB::Core::TextureBlenderMaterialPropertyCacheHelper* sourceMaterialPropertyCache;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::TextureBlenderMaterialPropertyCacheHelper*) == 0x8);
    // private UnityEngine.Color m_tintColor
    // Size: 0x10
    // Offset: 0x18
    ::UnityEngine::Color m_tintColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single m_glossiness
    // Size: 0x4
    // Offset: 0x28
    float m_glossiness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_SpecGlossMapScale
    // Size: 0x4
    // Offset: 0x2C
    float m_SpecGlossMapScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color m_specColor
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Color m_specColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean m_hasSpecGlossMap
    // Size: 0x1
    // Offset: 0x40
    bool m_hasSpecGlossMap;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_hasSpecGlossMap and: m_bumpScale
    char __padding5[0x3] = {};
    // private System.Single m_bumpScale
    // Size: 0x4
    // Offset: 0x44
    float m_bumpScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_shaderDoesEmission
    // Size: 0x1
    // Offset: 0x48
    bool m_shaderDoesEmission;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_shaderDoesEmission and: m_emissionColor
    char __padding7[0x3] = {};
    // private UnityEngine.Color m_emissionColor
    // Size: 0x10
    // Offset: 0x4C
    ::UnityEngine::Color m_emissionColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop propertyToDo
    // Size: 0x4
    // Offset: 0x5C
    ::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop propertyToDo;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop) == 0x4);
    // private UnityEngine.Color m_generatingTintedAtlaColor
    // Size: 0x10
    // Offset: 0x60
    ::UnityEngine::Color m_generatingTintedAtlaColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color m_generatingTintedAtlaSpecular
    // Size: 0x10
    // Offset: 0x70
    ::UnityEngine::Color m_generatingTintedAtlaSpecular;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single m_generatingTintedAtlaGlossiness
    // Size: 0x4
    // Offset: 0x80
    float m_generatingTintedAtlaGlossiness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_generatingTintedAtlaSpecGlossMapScale
    // Size: 0x4
    // Offset: 0x84
    float m_generatingTintedAtlaSpecGlossMapScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_generatingTintedAtlaBumpScale
    // Size: 0x4
    // Offset: 0x88
    float m_generatingTintedAtlaBumpScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color m_generatingTintedAtlaEmission
    // Size: 0x10
    // Offset: 0x8C
    ::UnityEngine::Color m_generatingTintedAtlaEmission;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color m_notGeneratingAtlasDefaultColor
    // Size: 0x10
    // Offset: 0x9C
    ::UnityEngine::Color m_notGeneratingAtlasDefaultColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color m_notGeneratingAtlasDefaultSpecularColor
    // Size: 0x10
    // Offset: 0xAC
    ::UnityEngine::Color m_notGeneratingAtlasDefaultSpecularColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single m_notGeneratingAtlasDefaultGlossiness
    // Size: 0x4
    // Offset: 0xBC
    float m_notGeneratingAtlasDefaultGlossiness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color m_notGeneratingAtlasDefaultEmisionColor
    // Size: 0x10
    // Offset: 0xC0
    ::UnityEngine::Color m_notGeneratingAtlasDefaultEmisionColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    public:
    // Creating interface conversion operator: operator ::DigitalOpus::MB::Core::TextureBlender
    operator ::DigitalOpus::MB::Core::TextureBlender() noexcept {
      return *reinterpret_cast<::DigitalOpus::MB::Core::TextureBlender*>(this);
    }
    // Get static field: static private UnityEngine.Color NeutralNormalMap
    static ::UnityEngine::Color _get_NeutralNormalMap();
    // Set static field: static private UnityEngine.Color NeutralNormalMap
    static void _set_NeutralNormalMap(::UnityEngine::Color value);
    // Get instance field reference: private DigitalOpus.MB.Core.TextureBlenderMaterialPropertyCacheHelper sourceMaterialPropertyCache
    [[deprecated("Use field access instead!")]] ::DigitalOpus::MB::Core::TextureBlenderMaterialPropertyCacheHelper*& dyn_sourceMaterialPropertyCache();
    // Get instance field reference: private UnityEngine.Color m_tintColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_m_tintColor();
    // Get instance field reference: private System.Single m_glossiness
    [[deprecated("Use field access instead!")]] float& dyn_m_glossiness();
    // Get instance field reference: private System.Single m_SpecGlossMapScale
    [[deprecated("Use field access instead!")]] float& dyn_m_SpecGlossMapScale();
    // Get instance field reference: private UnityEngine.Color m_specColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_m_specColor();
    // Get instance field reference: private System.Boolean m_hasSpecGlossMap
    [[deprecated("Use field access instead!")]] bool& dyn_m_hasSpecGlossMap();
    // Get instance field reference: private System.Single m_bumpScale
    [[deprecated("Use field access instead!")]] float& dyn_m_bumpScale();
    // Get instance field reference: private System.Boolean m_shaderDoesEmission
    [[deprecated("Use field access instead!")]] bool& dyn_m_shaderDoesEmission();
    // Get instance field reference: private UnityEngine.Color m_emissionColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_m_emissionColor();
    // Get instance field reference: private DigitalOpus.MB.Core.TextureBlenderStandardSpecular/DigitalOpus.MB.Core.Prop propertyToDo
    [[deprecated("Use field access instead!")]] ::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop& dyn_propertyToDo();
    // Get instance field reference: private UnityEngine.Color m_generatingTintedAtlaColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_m_generatingTintedAtlaColor();
    // Get instance field reference: private UnityEngine.Color m_generatingTintedAtlaSpecular
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_m_generatingTintedAtlaSpecular();
    // Get instance field reference: private System.Single m_generatingTintedAtlaGlossiness
    [[deprecated("Use field access instead!")]] float& dyn_m_generatingTintedAtlaGlossiness();
    // Get instance field reference: private System.Single m_generatingTintedAtlaSpecGlossMapScale
    [[deprecated("Use field access instead!")]] float& dyn_m_generatingTintedAtlaSpecGlossMapScale();
    // Get instance field reference: private System.Single m_generatingTintedAtlaBumpScale
    [[deprecated("Use field access instead!")]] float& dyn_m_generatingTintedAtlaBumpScale();
    // Get instance field reference: private UnityEngine.Color m_generatingTintedAtlaEmission
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_m_generatingTintedAtlaEmission();
    // Get instance field reference: private UnityEngine.Color m_notGeneratingAtlasDefaultColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_m_notGeneratingAtlasDefaultColor();
    // Get instance field reference: private UnityEngine.Color m_notGeneratingAtlasDefaultSpecularColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_m_notGeneratingAtlasDefaultSpecularColor();
    // Get instance field reference: private System.Single m_notGeneratingAtlasDefaultGlossiness
    [[deprecated("Use field access instead!")]] float& dyn_m_notGeneratingAtlasDefaultGlossiness();
    // Get instance field reference: private UnityEngine.Color m_notGeneratingAtlasDefaultEmisionColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_m_notGeneratingAtlasDefaultEmisionColor();
    // public System.Void .ctor()
    // Offset: 0x11C0880
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TextureBlenderStandardSpecular* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TextureBlenderStandardSpecular*, creationType>()));
    }
    // static private System.Void .cctor()
    // Offset: 0x11C0988
    static void _cctor();
    // public System.Boolean DoesShaderNameMatch(System.String shaderName)
    // Offset: 0x11BF62C
    bool DoesShaderNameMatch(::StringW shaderName);
    // public System.Void OnBeforeTintTexture(UnityEngine.Material sourceMat, System.String shaderTexturePropertyName)
    // Offset: 0x11BF688
    void OnBeforeTintTexture(::UnityEngine::Material* sourceMat, ::StringW shaderTexturePropertyName);
    // public UnityEngine.Color OnBlendTexturePixel(System.String propertyToDoshaderPropertyName, UnityEngine.Color pixelColor)
    // Offset: 0x11BF9B4
    ::UnityEngine::Color OnBlendTexturePixel(::StringW propertyToDoshaderPropertyName, ::UnityEngine::Color pixelColor);
    // public System.Boolean NonTexturePropertiesAreEqual(UnityEngine.Material a, UnityEngine.Material b)
    // Offset: 0x11BFB3C
    bool NonTexturePropertiesAreEqual(::UnityEngine::Material* a, ::UnityEngine::Material* b);
    // public System.Void SetNonTexturePropertyValuesOnResultMaterial(UnityEngine.Material resultMaterial)
    // Offset: 0x11BFD9C
    void SetNonTexturePropertyValuesOnResultMaterial(::UnityEngine::Material* resultMaterial);
    // public UnityEngine.Color GetColorIfNoTexture(UnityEngine.Material mat, DigitalOpus.MB.Core.ShaderTextureProperty texPropertyName)
    // Offset: 0x11C01E0
    ::UnityEngine::Color GetColorIfNoTexture(::UnityEngine::Material* mat, ::DigitalOpus::MB::Core::ShaderTextureProperty* texPropertyName);
  }; // DigitalOpus.MB.Core.TextureBlenderStandardSpecular
  #pragma pack(pop)
  static check_size<sizeof(TextureBlenderStandardSpecular), 192 + sizeof(::UnityEngine::Color)> __DigitalOpus_MB_Core_TextureBlenderStandardSpecularSizeCheck;
  static_assert(sizeof(TextureBlenderStandardSpecular) == 0xD0);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::DigitalOpus::MB::Core::TextureBlenderStandardSpecular::Prop, "DigitalOpus.MB.Core", "TextureBlenderStandardSpecular/Prop");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: DigitalOpus::MB::Core::TextureBlenderStandardSpecular::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: DigitalOpus::MB::Core::TextureBlenderStandardSpecular::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&DigitalOpus::MB::Core::TextureBlenderStandardSpecular::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(DigitalOpus::MB::Core::TextureBlenderStandardSpecular*), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: DigitalOpus::MB::Core::TextureBlenderStandardSpecular::DoesShaderNameMatch
// Il2CppName: DoesShaderNameMatch
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (DigitalOpus::MB::Core::TextureBlenderStandardSpecular::*)(::StringW)>(&DigitalOpus::MB::Core::TextureBlenderStandardSpecular::DoesShaderNameMatch)> {
  static const MethodInfo* get() {
    static auto* shaderName = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(DigitalOpus::MB::Core::TextureBlenderStandardSpecular*), "DoesShaderNameMatch", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{shaderName});
  }
};
// Writing MetadataGetter for method: DigitalOpus::MB::Core::TextureBlenderStandardSpecular::OnBeforeTintTexture
// Il2CppName: OnBeforeTintTexture
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (DigitalOpus::MB::Core::TextureBlenderStandardSpecular::*)(::UnityEngine::Material*, ::StringW)>(&DigitalOpus::MB::Core::TextureBlenderStandardSpecular::OnBeforeTintTexture)> {
  static const MethodInfo* get() {
    static auto* sourceMat = &::il2cpp_utils::GetClassFromName("UnityEngine", "Material")->byval_arg;
    static auto* shaderTexturePropertyName = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(DigitalOpus::MB::Core::TextureBlenderStandardSpecular*), "OnBeforeTintTexture", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{sourceMat, shaderTexturePropertyName});
  }
};
// Writing MetadataGetter for method: DigitalOpus::MB::Core::TextureBlenderStandardSpecular::OnBlendTexturePixel
// Il2CppName: OnBlendTexturePixel
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Color (DigitalOpus::MB::Core::TextureBlenderStandardSpecular::*)(::StringW, ::UnityEngine::Color)>(&DigitalOpus::MB::Core::TextureBlenderStandardSpecular::OnBlendTexturePixel)> {
  static const MethodInfo* get() {
    static auto* propertyToDoshaderPropertyName = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* pixelColor = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(DigitalOpus::MB::Core::TextureBlenderStandardSpecular*), "OnBlendTexturePixel", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{propertyToDoshaderPropertyName, pixelColor});
  }
};
// Writing MetadataGetter for method: DigitalOpus::MB::Core::TextureBlenderStandardSpecular::NonTexturePropertiesAreEqual
// Il2CppName: NonTexturePropertiesAreEqual
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (DigitalOpus::MB::Core::TextureBlenderStandardSpecular::*)(::UnityEngine::Material*, ::UnityEngine::Material*)>(&DigitalOpus::MB::Core::TextureBlenderStandardSpecular::NonTexturePropertiesAreEqual)> {
  static const MethodInfo* get() {
    static auto* a = &::il2cpp_utils::GetClassFromName("UnityEngine", "Material")->byval_arg;
    static auto* b = &::il2cpp_utils::GetClassFromName("UnityEngine", "Material")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(DigitalOpus::MB::Core::TextureBlenderStandardSpecular*), "NonTexturePropertiesAreEqual", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{a, b});
  }
};
// Writing MetadataGetter for method: DigitalOpus::MB::Core::TextureBlenderStandardSpecular::SetNonTexturePropertyValuesOnResultMaterial
// Il2CppName: SetNonTexturePropertyValuesOnResultMaterial
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (DigitalOpus::MB::Core::TextureBlenderStandardSpecular::*)(::UnityEngine::Material*)>(&DigitalOpus::MB::Core::TextureBlenderStandardSpecular::SetNonTexturePropertyValuesOnResultMaterial)> {
  static const MethodInfo* get() {
    static auto* resultMaterial = &::il2cpp_utils::GetClassFromName("UnityEngine", "Material")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(DigitalOpus::MB::Core::TextureBlenderStandardSpecular*), "SetNonTexturePropertyValuesOnResultMaterial", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{resultMaterial});
  }
};
// Writing MetadataGetter for method: DigitalOpus::MB::Core::TextureBlenderStandardSpecular::GetColorIfNoTexture
// Il2CppName: GetColorIfNoTexture
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Color (DigitalOpus::MB::Core::TextureBlenderStandardSpecular::*)(::UnityEngine::Material*, ::DigitalOpus::MB::Core::ShaderTextureProperty*)>(&DigitalOpus::MB::Core::TextureBlenderStandardSpecular::GetColorIfNoTexture)> {
  static const MethodInfo* get() {
    static auto* mat = &::il2cpp_utils::GetClassFromName("UnityEngine", "Material")->byval_arg;
    static auto* texPropertyName = &::il2cpp_utils::GetClassFromName("DigitalOpus.MB.Core", "ShaderTextureProperty")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(DigitalOpus::MB::Core::TextureBlenderStandardSpecular*), "GetColorIfNoTexture", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{mat, texPropertyName});
  }
};
