// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: BGNet.Core.Messages.UnconnectedMessageHandler
#include "BGNet/Core/Messages/UnconnectedMessageHandler.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: BGNet::Core::Messages
namespace BGNet::Core::Messages {
  // Forward declaring type: ClientHelloRequest
  class ClientHelloRequest;
  // Forward declaring type: ClientHelloWithCookieRequest
  class ClientHelloWithCookieRequest;
  // Forward declaring type: IUnconnectedAuthenticateRequest
  class IUnconnectedAuthenticateRequest;
  // Forward declaring type: IUnconnectedMessage
  class IUnconnectedMessage;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ICertificateEncryptionProvider
  class ICertificateEncryptionProvider;
  // Forward declaring type: IAsyncComputeManager
  class IAsyncComputeManager;
  // Forward declaring type: IDiffieHellmanKeyPair
  class IDiffieHellmanKeyPair;
  // Forward declaring type: IUnconnectedMessageSender
  class IUnconnectedMessageSender;
}
// Forward declaring namespace: LiteNetLib::Utils
namespace LiteNetLib::Utils {
  // Forward declaring type: NetDataWriter
  class NetDataWriter;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
}
// Forward declaring namespace: BGNet::Core
namespace BGNet::Core {
  // Forward declaring type: ITimeProvider
  class ITimeProvider;
  // Forward declaring type: IAnalyticsManager
  class IAnalyticsManager;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509Certificate2
  class X509Certificate2;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Completed forward declares
// Type namespace: BGNet.Core.Messages
namespace BGNet::Core::Messages {
  // Forward declaring type: BaseServerUnconnectedMessageHandler
  class BaseServerUnconnectedMessageHandler;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler);
DEFINE_IL2CPP_ARG_TYPE(::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler*, "BGNet.Core.Messages", "BaseServerUnconnectedMessageHandler");
// Type namespace: BGNet.Core.Messages
namespace BGNet::Core::Messages {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: BGNet.Core.Messages.BaseServerUnconnectedMessageHandler
  // [TokenAttribute] Offset: FFFFFFFF
  class BaseServerUnconnectedMessageHandler : public ::BGNet::Core::Messages::UnconnectedMessageHandler {
    public:
    // Nested type: ::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler::SigningComputeOperation
    class SigningComputeOperation;
    // Nested type: ::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler::GetPreMasterSecretComputeOperation
    class GetPreMasterSecretComputeOperation;
    // Nested type: ::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler::$$c
    class $$c;
    // Nested type: ::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler::$StartServerAuthenticationFlow$d__19
    struct $StartServerAuthenticationFlow$d__19;
    // Nested type: ::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler::$StartServerAuthenticationFlowAsync$d__21
    struct $StartServerAuthenticationFlowAsync$d__21;
    // Nested type: ::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler::$GetSignatureAsync$d__23
    struct $GetSignatureAsync$d__23;
    // Nested type: ::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler::$GetPreMasterSecretAsync$d__24
    struct $GetPreMasterSecretAsync$d__24;
    // Nested type: ::BGNet::Core::Messages::BaseServerUnconnectedMessageHandler::$RotateServerKeysAsync$d__26
    struct $RotateServerKeysAsync$d__26;
    public:
    // private readonly ICertificateEncryptionProvider _certificateEncryptionProvider
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::ICertificateEncryptionProvider* certificateEncryptionProvider;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ICertificateEncryptionProvider*) == 0x8);
    // private readonly System.Byte[][] _certificateChain
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::ArrayW<uint8_t>> certificateChain;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<uint8_t>>) == 0x8);
    // private readonly LiteNetLib.Utils.NetDataWriter _cookieWriter
    // Size: 0x8
    // Offset: 0x90
    ::LiteNetLib::Utils::NetDataWriter* cookieWriter;
    // Field size check
    static_assert(sizeof(::LiteNetLib::Utils::NetDataWriter*) == 0x8);
    // private readonly LiteNetLib.Utils.NetDataWriter _signatureWriter
    // Size: 0x8
    // Offset: 0x98
    ::LiteNetLib::Utils::NetDataWriter* signatureWriter;
    // Field size check
    static_assert(sizeof(::LiteNetLib::Utils::NetDataWriter*) == 0x8);
    // private readonly IAsyncComputeManager _asyncCompute
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::IAsyncComputeManager* asyncCompute;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IAsyncComputeManager*) == 0x8);
    // private System.Int64 _lastServerKeyPairRequestTime
    // Size: 0x8
    // Offset: 0xA8
    int64_t lastServerKeyPairRequestTime;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private IDiffieHellmanKeyPair _serverKeys
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::IDiffieHellmanKeyPair* serverKeys;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::IDiffieHellmanKeyPair*) == 0x8);
    // private System.Threading.Tasks.Task _serverKeyRotationTask
    // Size: 0x8
    // Offset: 0xB8
    ::System::Threading::Tasks::Task* serverKeyRotationTask;
    // Field size check
    static_assert(sizeof(::System::Threading::Tasks::Task*) == 0x8);
    // private readonly System.Byte[] _hmacKey
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<uint8_t> hmacKey;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    public:
    // static field const value: static private System.Int64 kServerKeyExpirationLength
    static constexpr const int64_t kServerKeyExpirationLength = 3000000000;
    // Get static field: static private System.Int64 kServerKeyExpirationLength
    static int64_t _get_kServerKeyExpirationLength();
    // Set static field: static private System.Int64 kServerKeyExpirationLength
    static void _set_kServerKeyExpirationLength(int64_t value);
    // Get instance field reference: private readonly ICertificateEncryptionProvider _certificateEncryptionProvider
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::ICertificateEncryptionProvider*& dyn__certificateEncryptionProvider();
    // Get instance field reference: private readonly System.Byte[][] _certificateChain
