// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabResultCommon
#include "PlayFab/SharedModels/PlayFabResultCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: PlayFab::InsightsModels
namespace PlayFab::InsightsModels {
  // Forward declaring type: InsightsPerformanceLevel
  class InsightsPerformanceLevel;
}
// Completed forward declares
// Type namespace: PlayFab.InsightsModels
namespace PlayFab::InsightsModels {
  // Forward declaring type: InsightsGetLimitsResponse
  class InsightsGetLimitsResponse;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::InsightsModels::InsightsGetLimitsResponse);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::InsightsModels::InsightsGetLimitsResponse*, "PlayFab.InsightsModels", "InsightsGetLimitsResponse");
// Type namespace: PlayFab.InsightsModels
namespace PlayFab::InsightsModels {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.InsightsModels.InsightsGetLimitsResponse
  // [TokenAttribute] Offset: FFFFFFFF
  class InsightsGetLimitsResponse : public ::PlayFab::SharedModels::PlayFabResultCommon {
    public:
    public:
    // public System.Int32 DefaultPerformanceLevel
    // Size: 0x4
    // Offset: 0x20
    int DefaultPerformanceLevel;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 DefaultStorageRetentionDays
    // Size: 0x4
    // Offset: 0x24
    int DefaultStorageRetentionDays;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 StorageMaxRetentionDays
    // Size: 0x4
    // Offset: 0x28
    int StorageMaxRetentionDays;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 StorageMinRetentionDays
    // Size: 0x4
    // Offset: 0x2C
    int StorageMinRetentionDays;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Collections.Generic.List`1<PlayFab.InsightsModels.InsightsPerformanceLevel> SubMeters
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::PlayFab::InsightsModels::InsightsPerformanceLevel*>* SubMeters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PlayFab::InsightsModels::InsightsPerformanceLevel*>*) == 0x8);
    public:
    // Get instance field reference: public System.Int32 DefaultPerformanceLevel
    [[deprecated("Use field access instead!")]] int& dyn_DefaultPerformanceLevel();
    // Get instance field reference: public System.Int32 DefaultStorageRetentionDays
    [[deprecated("Use field access instead!")]] int& dyn_DefaultStorageRetentionDays();
    // Get instance field reference: public System.Int32 StorageMaxRetentionDays
    [[deprecated("Use field access instead!")]] int& dyn_StorageMaxRetentionDays();
    // Get instance field reference: public System.Int32 StorageMinRetentionDays
    [[deprecated("Use field access instead!")]] int& dyn_StorageMinRetentionDays();
    // Get instance field reference: public System.Collections.Generic.List`1<PlayFab.InsightsModels.InsightsPerformanceLevel> SubMeters
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::PlayFab::InsightsModels::InsightsPerformanceLevel*>*& dyn_SubMeters();
    // public System.Void .ctor()
    // Offset: 0xBB7280
    // Implemented from: PlayFab.SharedModels.PlayFabResultCommon
    // Base method: System.Void PlayFabResultCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static InsightsGetLimitsResponse* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::InsightsModels::InsightsGetLimitsResponse::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<InsightsGetLimitsResponse*, creationType>()));
    }
  }; // PlayFab.InsightsModels.InsightsGetLimitsResponse
  #pragma pack(pop)
  static check_size<sizeof(InsightsGetLimitsResponse), 48 + sizeof(::System::Collections::Generic::List_1<::PlayFab::InsightsModels::InsightsPerformanceLevel*>*)> __PlayFab_InsightsModels_InsightsGetLimitsResponseSizeCheck;
  static_assert(sizeof(InsightsGetLimitsResponse) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::InsightsModels::InsightsGetLimitsResponse::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
