// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputEventTrace
#include "UnityEngine/InputSystem/LowLevel/InputEventTrace.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputEventPtr
#include "UnityEngine/InputSystem/LowLevel/InputEventPtr.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::LowLevel
namespace UnityEngine::InputSystem::LowLevel {
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputDevice
  class InputDevice;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Skipping declaration: IEnumerable`1 because it is already included!
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::LowLevel::InputEventTrace::ReplayController);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::LowLevel::InputEventTrace::ReplayController*, "UnityEngine.InputSystem.LowLevel", "InputEventTrace/ReplayController");
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.LowLevel.InputEventTrace/UnityEngine.InputSystem.LowLevel.ReplayController
  // [TokenAttribute] Offset: FFFFFFFF
  class InputEventTrace::ReplayController : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::LowLevel::InputEventTrace::ReplayController::$$c
    class $$c;
    // Nested type: ::UnityEngine::InputSystem::LowLevel::InputEventTrace::ReplayController::$$c__DisplayClass43_0
    class $$c__DisplayClass43_0;
    public:
    // private System.Boolean <finished>k__BackingField
    // Size: 0x1
    // Offset: 0x10
    bool finished;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <paused>k__BackingField
    // Size: 0x1
    // Offset: 0x11
    bool paused;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 <position>k__BackingField
    // Size: 0x4
    // Offset: 0x14
    int position;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.InputSystem.LowLevel.InputEventTrace m_EventTrace
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::InputSystem::LowLevel::InputEventTrace* m_EventTrace;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputEventTrace*) == 0x8);
    // private UnityEngine.InputSystem.LowLevel.InputEventTrace/UnityEngine.InputSystem.LowLevel.Enumerator m_Enumerator
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::InputSystem::LowLevel::InputEventTrace::Enumerator* m_Enumerator;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputEventTrace::Enumerator*) == 0x8);
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Collections.Generic.KeyValuePair`2<System.Int32,System.Int32>> m_DeviceIDMappings
    // Size: 0xFFFFFFFF
    // Offset: 0x28
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Collections::Generic::KeyValuePair_2<int, int>> m_DeviceIDMappings;
    // private System.Boolean m_CreateNewDevices
    // Size: 0x1
    // Offset: 0x40
    bool m_CreateNewDevices;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.InputDevice> m_CreatedDevices
    // Size: 0xFFFFFFFF
    // Offset: 0x48
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::InputDevice*> m_CreatedDevices;
    // private System.Action m_OnFinished
    // Size: 0x8
    // Offset: 0x60
    ::System::Action* m_OnFinished;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.LowLevel.InputEventPtr> m_OnEvent
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputEventPtr>* m_OnEvent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputEventPtr>*) == 0x8);
    // private System.Double m_StartTimeAsPerFirstEvent
    // Size: 0x8
    // Offset: 0x70
    double m_StartTimeAsPerFirstEvent;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double m_StartTimeAsPerRuntime
    // Size: 0x8
    // Offset: 0x78
    double m_StartTimeAsPerRuntime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Int32 m_AllEventsByTimeIndex
    // Size: 0x4
    // Offset: 0x80
    int m_AllEventsByTimeIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.InputSystem.LowLevel.InputEventPtr> m_AllEventsByTime
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::UnityEngine::InputSystem::LowLevel::InputEventPtr>* m_AllEventsByTime;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::InputSystem::LowLevel::InputEventPtr>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: private System.Boolean <finished>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$finished$k__BackingField();
    // Get instance field reference: private System.Boolean <paused>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$paused$k__BackingField();
    // Get instance field reference: private System.Int32 <position>k__BackingField
