// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Collections.Generic.IEnumerable`1
#include "System/Collections/Generic/IEnumerable_1.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputEventPtr
#include "UnityEngine/InputSystem/LowLevel/InputEventPtr.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.InputSystem.Utilities.FourCC
#include "UnityEngine/InputSystem/Utilities/FourCC.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::LowLevel
namespace UnityEngine::InputSystem::LowLevel {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`3<T1, T2, TResult>
  template<typename T1, typename T2, typename TResult>
  class Func_3;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputDevice
  class InputDevice;
}
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Skipping declaration: IEnumerator`1 because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: InputEventTrace
  class InputEventTrace;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::LowLevel::InputEventTrace);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::LowLevel::InputEventTrace*, "UnityEngine.InputSystem.LowLevel", "InputEventTrace");
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.LowLevel.InputEventTrace
  // [TokenAttribute] Offset: FFFFFFFF
  class InputEventTrace : public ::Il2CppObject/*, public ::System::IDisposable, public ::System::Collections::Generic::IEnumerable_1<::UnityEngine::InputSystem::LowLevel::InputEventPtr>*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::LowLevel::InputEventTrace::Enumerator
    class Enumerator;
    // Nested type: ::UnityEngine::InputSystem::LowLevel::InputEventTrace::FileFlags
    struct FileFlags;
    // Nested type: ::UnityEngine::InputSystem::LowLevel::InputEventTrace::ReplayController
    class ReplayController;
    // Nested type: ::UnityEngine::InputSystem::LowLevel::InputEventTrace::DeviceInfo
    struct DeviceInfo;
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.LowLevel.InputEventTrace/UnityEngine.InputSystem.LowLevel.DeviceInfo
    // [TokenAttribute] Offset: FFFFFFFF
    struct DeviceInfo/*, public ::System::ValueType*/ {
      public:
      public:
      // System.Int32 m_DeviceId
      // Size: 0x4
      // Offset: 0x0
      int m_DeviceId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: m_DeviceId and: m_Layout
      char __padding0[0x4] = {};
      // System.String m_Layout
      // Size: 0x8
      // Offset: 0x8
      ::StringW m_Layout;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // UnityEngine.InputSystem.Utilities.FourCC m_StateFormat
      // Size: 0x4
      // Offset: 0x10
      ::UnityEngine::InputSystem::Utilities::FourCC m_StateFormat;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Utilities::FourCC) == 0x4);
      // System.Int32 m_StateSizeInBytes
      // Size: 0x4
      // Offset: 0x14
      int m_StateSizeInBytes;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.String m_FullLayoutJson
      // Size: 0x8
      // Offset: 0x18
      ::StringW m_FullLayoutJson;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      public:
      // Creating value type constructor for type: DeviceInfo
      constexpr DeviceInfo(int m_DeviceId_ = {}, ::StringW m_Layout_ = {}, ::UnityEngine::InputSystem::Utilities::FourCC m_StateFormat_ = {}, int m_StateSizeInBytes_ = {}, ::StringW m_FullLayoutJson_ = {}) noexcept : m_DeviceId{m_DeviceId_}, m_Layout{m_Layout_}, m_StateFormat{m_StateFormat_}, m_StateSizeInBytes{m_StateSizeInBytes_}, m_FullLayoutJson{m_FullLayoutJson_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: System.Int32 m_DeviceId
      [[deprecated("Use field access instead!")]] int& dyn_m_DeviceId();
      // Get instance field reference: System.String m_Layout
      [[deprecated("Use field access instead!")]] ::StringW& dyn_m_Layout();
      // Get instance field reference: UnityEngine.InputSystem.Utilities.FourCC m_StateFormat
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::FourCC& dyn_m_StateFormat();
      // Get instance field reference: System.Int32 m_StateSizeInBytes
      [[deprecated("Use field access instead!")]] int& dyn_m_StateSizeInBytes();
      // Get instance field reference: System.String m_FullLayoutJson
      [[deprecated("Use field access instead!")]] ::StringW& dyn_m_FullLayoutJson();
      // public System.Int32 get_deviceId()
      // Offset: 0xA56640
      int get_deviceId();
      // public System.Void set_deviceId(System.Int32 value)
      // Offset: 0xA56648
      void set_deviceId(int value);
      // public System.String get_layout()
      // Offset: 0xA56650
      ::StringW get_layout();
      // public System.Void set_layout(System.String value)
      // Offset: 0xA56658
      void set_layout(::StringW value);
      // public UnityEngine.InputSystem.Utilities.FourCC get_stateFormat()
      // Offset: 0xA56660
      ::UnityEngine::InputSystem::Utilities::FourCC get_stateFormat();
      // public System.Void set_stateFormat(UnityEngine.InputSystem.Utilities.FourCC value)
      // Offset: 0xA56668
      void set_stateFormat(::UnityEngine::InputSystem::Utilities::FourCC value);
      // public System.Int32 get_stateSizeInBytes()
      // Offset: 0xA56670
      int get_stateSizeInBytes();
      // public System.Void set_stateSizeInBytes(System.Int32 value)
      // Offset: 0xA56678
      void set_stateSizeInBytes(int value);
    }; // UnityEngine.InputSystem.LowLevel.InputEventTrace/UnityEngine.InputSystem.LowLevel.DeviceInfo
    #pragma pack(pop)
    static check_size<sizeof(InputEventTrace::DeviceInfo), 24 + sizeof(::StringW)> __UnityEngine_InputSystem_LowLevel_InputEventTrace_DeviceInfoSizeCheck;
    static_assert(sizeof(InputEventTrace::DeviceInfo) == 0x20);
    public:
    // private System.Int32 m_ChangeCounter
    // Size: 0x4
    // Offset: 0x10
    int m_ChangeCounter;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_Enabled
    // Size: 0x1
    // Offset: 0x14
    bool m_Enabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Func`3<UnityEngine.InputSystem.LowLevel.InputEventPtr,UnityEngine.InputSystem.InputDevice,System.Boolean> m_OnFilterEvent
    // Size: 0x8
    // Offset: 0x18
    ::System::Func_3<::UnityEngine::InputSystem::LowLevel::InputEventPtr, ::UnityEngine::InputSystem::InputDevice*, bool>* m_OnFilterEvent;
    // Field size check
    static_assert(sizeof(::System::Func_3<::UnityEngine::InputSystem::LowLevel::InputEventPtr, ::UnityEngine::InputSystem::InputDevice*, bool>*) == 0x8);
    // private System.Int32 m_DeviceId
    // Size: 0x4
    // Offset: 0x20
    int m_DeviceId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Action`1<UnityEngine.InputSystem.LowLevel.InputEventPtr>> m_EventListeners
    // Size: 0xFFFFFFFF
    // Offset: 0x28
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputEventPtr>*> m_EventListeners;
    // private System.Int64 m_EventBufferSize
    // Size: 0x8
    // Offset: 0x40
    int64_t m_EventBufferSize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 m_MaxEventBufferSize
    // Size: 0x8
    // Offset: 0x48
    int64_t m_MaxEventBufferSize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 m_GrowIncrementSize
    // Size: 0x8
    // Offset: 0x50
    int64_t m_GrowIncrementSize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 m_EventCount
    // Size: 0x8
    // Offset: 0x58
    int64_t m_EventCount;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 m_EventSizeInBytes
    // Size: 0x8
    // Offset: 0x60
    int64_t m_EventSizeInBytes;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.UInt64 m_EventBufferStorage
    // Size: 0x8
    // Offset: 0x68
    uint64_t m_EventBufferStorage;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.UInt64 m_EventBufferHeadStorage
    // Size: 0x8
    // Offset: 0x70
    uint64_t m_EventBufferHeadStorage;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.UInt64 m_EventBufferTailStorage
    // Size: 0x8
    // Offset: 0x78
    uint64_t m_EventBufferTailStorage;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.Boolean m_HasWrapped
    // Size: 0x1
    // Offset: 0x80
    bool m_HasWrapped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_RecordFrameMarkers
    // Size: 0x1
    // Offset: 0x81
    bool m_RecordFrameMarkers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.InputSystem.LowLevel.InputEventTrace/UnityEngine.InputSystem.LowLevel.DeviceInfo[] m_DeviceInfos
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::InputSystem::LowLevel::InputEventTrace::DeviceInfo> m_DeviceInfos;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::LowLevel::InputEventTrace::DeviceInfo>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Creating interface conversion operator: operator ::System::Collections::Generic::IEnumerable_1<::UnityEngine::InputSystem::LowLevel::InputEventPtr>
    operator ::System::Collections::Generic::IEnumerable_1<::UnityEngine::InputSystem::LowLevel::InputEventPtr>() noexcept {
      return *reinterpret_cast<::System::Collections::Generic::IEnumerable_1<::UnityEngine::InputSystem::LowLevel::InputEventPtr>*>(this);
    }
    // static field const value: static private System.Int32 kDefaultBufferSize
