// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputUpdate
#include "UnityEngine/InputSystem/LowLevel/InputUpdate.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputUpdateType
#include "UnityEngine/InputSystem/LowLevel/InputUpdateType.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::LowLevel::InputUpdate::SerializedState, "UnityEngine.InputSystem.LowLevel", "InputUpdate/SerializedState");
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Size: 0x10
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.LowLevel.InputUpdate/UnityEngine.InputSystem.LowLevel.SerializedState
  // [TokenAttribute] Offset: FFFFFFFF
  struct InputUpdate::SerializedState/*, public ::System::ValueType*/ {
    public:
    public:
    // public UnityEngine.InputSystem.LowLevel.InputUpdateType lastUpdateType
    // Size: 0x4
    // Offset: 0x0
    ::UnityEngine::InputSystem::LowLevel::InputUpdateType lastUpdateType;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputUpdateType) == 0x4);
    // public System.UInt32 updateStepCount
    // Size: 0x4
    // Offset: 0x4
    uint updateStepCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 lastUpdateRetainedEventBytes
    // Size: 0x4
    // Offset: 0x8
    uint lastUpdateRetainedEventBytes;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 lastUpdateRetainedEventCount
    // Size: 0x4
    // Offset: 0xC
    uint lastUpdateRetainedEventCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    public:
    // Creating value type constructor for type: SerializedState
    constexpr SerializedState(::UnityEngine::InputSystem::LowLevel::InputUpdateType lastUpdateType_ = {}, uint updateStepCount_ = {}, uint lastUpdateRetainedEventBytes_ = {}, uint lastUpdateRetainedEventCount_ = {}) noexcept : lastUpdateType{lastUpdateType_}, updateStepCount{updateStepCount_}, lastUpdateRetainedEventBytes{lastUpdateRetainedEventBytes_}, lastUpdateRetainedEventCount{lastUpdateRetainedEventCount_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public UnityEngine.InputSystem.LowLevel.InputUpdateType lastUpdateType
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::LowLevel::InputUpdateType& dyn_lastUpdateType();
    // Get instance field reference: public System.UInt32 updateStepCount
    [[deprecated("Use field access instead!")]] uint& dyn_updateStepCount();
    // Get instance field reference: public System.UInt32 lastUpdateRetainedEventBytes
    [[deprecated("Use field access instead!")]] uint& dyn_lastUpdateRetainedEventBytes();
    // Get instance field reference: public System.UInt32 lastUpdateRetainedEventCount
    [[deprecated("Use field access instead!")]] uint& dyn_lastUpdateRetainedEventCount();
  }; // UnityEngine.InputSystem.LowLevel.InputUpdate/UnityEngine.InputSystem.LowLevel.SerializedState
  #pragma pack(pop)
  static check_size<sizeof(InputUpdate::SerializedState), 12 + sizeof(uint)> __UnityEngine_InputSystem_LowLevel_InputUpdate_SerializedStateSizeCheck;
  static_assert(sizeof(InputUpdate::SerializedState) == 0x10);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
