// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.IInputRuntime
#include "UnityEngine/InputSystem/LowLevel/IInputRuntime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: InputUpdateDelegate
  class InputUpdateDelegate;
  // Forward declaring type: InputEvent
  struct InputEvent;
  // Forward declaring type: InputDeviceCommand
  struct InputDeviceCommand;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ScreenOrientation
  struct ScreenOrientation;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: NativeInputRuntime
  class NativeInputRuntime;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::LowLevel::NativeInputRuntime);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::LowLevel::NativeInputRuntime*, "UnityEngine.InputSystem.LowLevel", "NativeInputRuntime");
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.LowLevel.NativeInputRuntime
  // [TokenAttribute] Offset: FFFFFFFF
  class NativeInputRuntime : public ::Il2CppObject/*, public ::UnityEngine::InputSystem::LowLevel::IInputRuntime*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::LowLevel::NativeInputRuntime::$$c__DisplayClass7_0
    class $$c__DisplayClass7_0;
    // Nested type: ::UnityEngine::InputSystem::LowLevel::NativeInputRuntime::$$c__DisplayClass10_0
    class $$c__DisplayClass10_0;
    // Nested type: ::UnityEngine::InputSystem::LowLevel::NativeInputRuntime::$$c__DisplayClass13_0
    class $$c__DisplayClass13_0;
    public:
    // private System.Action m_ShutdownMethod
    // Size: 0x8
    // Offset: 0x10
    ::System::Action* m_ShutdownMethod;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private UnityEngine.InputSystem.LowLevel.InputUpdateDelegate m_OnUpdate
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::InputSystem::LowLevel::InputUpdateDelegate* m_OnUpdate;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputUpdateDelegate*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.LowLevel.InputUpdateType> m_OnBeforeUpdate
    // Size: 0x8
    // Offset: 0x20
    ::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputUpdateType>* m_OnBeforeUpdate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputUpdateType>*) == 0x8);
    // private System.Func`2<UnityEngine.InputSystem.LowLevel.InputUpdateType,System.Boolean> m_OnShouldRunUpdate
    // Size: 0x8
    // Offset: 0x28
    ::System::Func_2<::UnityEngine::InputSystem::LowLevel::InputUpdateType, bool>* m_OnShouldRunUpdate;
    // Field size check
    static_assert(sizeof(::System::Func_2<::UnityEngine::InputSystem::LowLevel::InputUpdateType, bool>*) == 0x8);
    // private System.Single m_PollingFrequency
    // Size: 0x4
    // Offset: 0x30
    float m_PollingFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_DidCallOnShutdown
    // Size: 0x1
    // Offset: 0x34
    bool m_DidCallOnShutdown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DidCallOnShutdown and: m_FocusChangedMethod
    char __padding5[0x3] = {};
    // private System.Action`1<System.Boolean> m_FocusChangedMethod
    // Size: 0x8
    // Offset: 0x38
    ::System::Action_1<bool>* m_FocusChangedMethod;
    // Field size check
    static_assert(sizeof(::System::Action_1<bool>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::InputSystem::LowLevel::IInputRuntime
    operator ::UnityEngine::InputSystem::LowLevel::IInputRuntime() noexcept {
      return *reinterpret_cast<::UnityEngine::InputSystem::LowLevel::IInputRuntime*>(this);
    }
    // Get static field: static public readonly UnityEngine.InputSystem.LowLevel.NativeInputRuntime instance
    static ::UnityEngine::InputSystem::LowLevel::NativeInputRuntime* _get_instance();
    // Set static field: static public readonly UnityEngine.InputSystem.LowLevel.NativeInputRuntime instance
    static void _set_instance(::UnityEngine::InputSystem::LowLevel::NativeInputRuntime* value);
    // Get instance field reference: private System.Action m_ShutdownMethod
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_m_ShutdownMethod();
    // Get instance field reference: private UnityEngine.InputSystem.LowLevel.InputUpdateDelegate m_OnUpdate
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::LowLevel::InputUpdateDelegate*& dyn_m_OnUpdate();
    // Get instance field reference: private System.Action`1<UnityEngine.InputSystem.LowLevel.InputUpdateType> m_OnBeforeUpdate
    [[deprecated("Use field access instead!")]] ::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputUpdateType>*& dyn_m_OnBeforeUpdate();
    // Get instance field reference: private System.Func`2<UnityEngine.InputSystem.LowLevel.InputUpdateType,System.Boolean> m_OnShouldRunUpdate
    [[deprecated("Use field access instead!")]] ::System::Func_2<::UnityEngine::InputSystem::LowLevel::InputUpdateType, bool>*& dyn_m_OnShouldRunUpdate();
    // Get instance field reference: private System.Single m_PollingFrequency
    [[deprecated("Use field access instead!")]] float& dyn_m_PollingFrequency();
    // Get instance field reference: private System.Boolean m_DidCallOnShutdown
    [[deprecated("Use field access instead!")]] bool& dyn_m_DidCallOnShutdown();
    // Get instance field reference: private System.Action`1<System.Boolean> m_FocusChangedMethod
    [[deprecated("Use field access instead!")]] ::System::Action_1<bool>*& dyn_m_FocusChangedMethod();
    // public UnityEngine.InputSystem.LowLevel.InputUpdateDelegate get_onUpdate()
    // Offset: 0xCC5720
    ::UnityEngine::InputSystem::LowLevel::InputUpdateDelegate* get_onUpdate();
    // public System.Void set_onUpdate(UnityEngine.InputSystem.LowLevel.InputUpdateDelegate value)
    // Offset: 0xCC5728
    void set_onUpdate(::UnityEngine::InputSystem::LowLevel::InputUpdateDelegate* value);
    // public System.Action`1<UnityEngine.InputSystem.LowLevel.InputUpdateType> get_onBeforeUpdate()
    // Offset: 0xCC5838
    ::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputUpdateType>* get_onBeforeUpdate();
    // public System.Void set_onBeforeUpdate(System.Action`1<UnityEngine.InputSystem.LowLevel.InputUpdateType> value)
    // Offset: 0xCC5840
    void set_onBeforeUpdate(::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputUpdateType>* value);
    // public System.Func`2<UnityEngine.InputSystem.LowLevel.InputUpdateType,System.Boolean> get_onShouldRunUpdate()
    // Offset: 0xCC5958
    ::System::Func_2<::UnityEngine::InputSystem::LowLevel::InputUpdateType, bool>* get_onShouldRunUpdate();
    // public System.Void set_onShouldRunUpdate(System.Func`2<UnityEngine.InputSystem.LowLevel.InputUpdateType,System.Boolean> value)
    // Offset: 0xCC5960
    void set_onShouldRunUpdate(::System::Func_2<::UnityEngine::InputSystem::LowLevel::InputUpdateType, bool>* value);
    // public System.Action`2<System.Int32,System.String> get_onDeviceDiscovered()
    // Offset: 0xCC5A78
    ::System::Action_2<int, ::StringW>* get_onDeviceDiscovered();
    // public System.Void set_onDeviceDiscovered(System.Action`2<System.Int32,System.String> value)
    // Offset: 0xCC5AD8
    void set_onDeviceDiscovered(::System::Action_2<int, ::StringW>* value);
    // public System.Action get_onShutdown()
    // Offset: 0xCC5B40
    ::System::Action* get_onShutdown();
    // public System.Void set_onShutdown(System.Action value)
    // Offset: 0xCC5B48
    void set_onShutdown(::System::Action* value);
    // public System.Action`1<System.Boolean> get_onPlayerFocusChanged()
    // Offset: 0xCC5C20
    ::System::Action_1<bool>* get_onPlayerFocusChanged();
    // public System.Void set_onPlayerFocusChanged(System.Action`1<System.Boolean> value)
    // Offset: 0xCC5C28
    void set_onPlayerFocusChanged(::System::Action_1<bool>* value);
    // public System.Single get_pollingFrequency()
    // Offset: 0xCC5D10
    float get_pollingFrequency();
    // public System.Void set_pollingFrequency(System.Single value)
    // Offset: 0xCC5D18
    void set_pollingFrequency(float value);
    // public System.Double get_currentTime()
    // Offset: 0xCC5D90
    double get_currentTime();
    // public System.Double get_currentTimeForFixedUpdate()
    // Offset: 0xCC5DF0
    double get_currentTimeForFixedUpdate();
    // public System.Double get_currentTimeOffsetToRealtimeSinceStartup()
    // Offset: 0xCC5E20
    double get_currentTimeOffsetToRealtimeSinceStartup();
    // public System.Single get_unscaledGameTime()
    // Offset: 0xCC5E80
    float get_unscaledGameTime();
    // public System.Boolean get_runInBackground()
    // Offset: 0xCC5E88
    bool get_runInBackground();
    // public UnityEngine.ScreenOrientation get_screenOrientation()
    // Offset: 0xCC5F58
    ::UnityEngine::ScreenOrientation get_screenOrientation();
    // public System.Boolean get_isInBatchMode()
    // Offset: 0xCC5F60
    bool get_isInBatchMode();
    // public System.Void .ctor()
    // Offset: 0xCC5F70
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static NativeInputRuntime* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::InputSystem::LowLevel::NativeInputRuntime::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<NativeInputRuntime*, creationType>()));
    }
    // static private System.Void .cctor()
    // Offset: 0xCC5F80
    static void _cctor();
    // public System.Int32 AllocateDeviceId()
    // Offset: 0xCC54F4
    int AllocateDeviceId();
    // public System.Void Update(UnityEngine.InputSystem.LowLevel.InputUpdateType updateType)
    // Offset: 0xCC5554
    void Update(::UnityEngine::InputSystem::LowLevel::InputUpdateType updateType);
    // public System.Void QueueEvent(UnityEngine.InputSystem.LowLevel.InputEvent* ptr)
    // Offset: 0xCC55BC
    void QueueEvent(::UnityEngine::InputSystem::LowLevel::InputEvent* ptr);
    // public System.Int64 DeviceCommand(System.Int32 deviceId, UnityEngine.InputSystem.LowLevel.InputDeviceCommand* commandPtr)
    // Offset: 0xCC5638
    int64_t DeviceCommand(int deviceId, ::UnityEngine::InputSystem::LowLevel::InputDeviceCommand* commandPtr);
    // private System.Void OnShutdown()
    // Offset: 0xCC5E90
    void OnShutdown();
    // private System.Boolean OnWantsToShutdown()
    // Offset: 0xCC5EAC
    bool OnWantsToShutdown();
    // private System.Void OnFocusChanged(System.Boolean focus)
    // Offset: 0xCC5EF0
    void OnFocusChanged(bool focus);
    // public System.Void RegisterAnalyticsEvent(System.String name, System.Int32 maxPerHour, System.Int32 maxPropertiesPerEvent)
    // Offset: 0xCC5F68
    void RegisterAnalyticsEvent(::StringW name, int maxPerHour, int maxPropertiesPerEvent);
    // public System.Void SendAnalyticsEvent(System.String name, System.Object data)
    // Offset: 0xCC5F6C
    void SendAnalyticsEvent(::StringW name, ::Il2CppObject* data);
  }; // UnityEngine.InputSystem.LowLevel.NativeInputRuntime
  #pragma pack(pop)
  static check_size<sizeof(NativeInputRuntime), 56 + sizeof(::System::Action_1<bool>*)> __UnityEngine_InputSystem_LowLevel_NativeInputRuntimeSizeCheck;
  static_assert(sizeof(NativeInputRuntime) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::InputSystem::LowLevel::NativeInputRuntime::get_onUpdate
// Il2CppName: get_onUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::InputSystem::LowLevel::InputUpdateDelegate* (UnityEngine::InputSystem::LowLevel::NativeInputRuntime::*)()>(&UnityEngine::InputSystem::LowLevel::NativeInputRuntime::get_onUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::InputSystem::LowLevel::NativeInputRuntime*), "get_onUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::InputSystem::LowLevel::NativeInputRuntime::set_onUpdate
// Il2CppName: set_onUpdate
template<>
