// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.IInputStateTypeInfo
#include "UnityEngine/InputSystem/LowLevel/IInputStateTypeInfo.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: FourCC
  struct FourCC;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: PointerState
  struct PointerState;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::LowLevel::PointerState, "UnityEngine.InputSystem.LowLevel", "PointerState");
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Size: 0x22
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.LowLevel.PointerState
  // [TokenAttribute] Offset: FFFFFFFF
  struct PointerState/*, public ::System::ValueType, public ::UnityEngine::InputSystem::LowLevel::IInputStateTypeInfo*/ {
    public:
    public:
    // private System.UInt32 pointerId
    // Size: 0x4
    // Offset: 0x0
    uint pointerId;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // [InputControlAttribute] Offset: 0x95FEA4
    // public UnityEngine.Vector2 position
    // Size: 0x8
    // Offset: 0x4
    ::UnityEngine::Vector2 position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // [InputControlAttribute] Offset: 0x95FF00
    // public UnityEngine.Vector2 delta
    // Size: 0x8
    // Offset: 0xC
    ::UnityEngine::Vector2 delta;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // [InputControlAttribute] Offset: 0x95FF5C
    // public System.Single pressure
    // Size: 0x4
    // Offset: 0x14
    float pressure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [InputControlAttribute] Offset: 0x95FFB8
    // public UnityEngine.Vector2 radius
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Vector2 radius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // [InputControlAttribute] Offset: 0x960014
    // public System.UInt16 buttons
    // Size: 0x2
    // Offset: 0x20
    uint16_t buttons;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    public:
    // Creating value type constructor for type: PointerState
    constexpr PointerState(uint pointerId_ = {}, ::UnityEngine::Vector2 position_ = {}, ::UnityEngine::Vector2 delta_ = {}, float pressure_ = {}, ::UnityEngine::Vector2 radius_ = {}, uint16_t buttons_ = {}) noexcept : pointerId{pointerId_}, position{position_}, delta{delta_}, pressure{pressure_}, radius{radius_}, buttons{buttons_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::InputSystem::LowLevel::IInputStateTypeInfo
    operator ::UnityEngine::InputSystem::LowLevel::IInputStateTypeInfo() noexcept {
      return *reinterpret_cast<::UnityEngine::InputSystem::LowLevel::IInputStateTypeInfo*>(this);
    }
    // Get instance field reference: private System.UInt32 pointerId
    [[deprecated("Use field access instead!")]] uint& dyn_pointerId();
    // Get instance field reference: public UnityEngine.Vector2 position
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_position();
    // Get instance field reference: public UnityEngine.Vector2 delta
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_delta();
    // Get instance field reference: public System.Single pressure
    [[deprecated("Use field access instead!")]] float& dyn_pressure();
    // Get instance field reference: public UnityEngine.Vector2 radius
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_radius();
    // Get instance field reference: public System.UInt16 buttons
    [[deprecated("Use field access instead!")]] uint16_t& dyn_buttons();
    // static public UnityEngine.InputSystem.Utilities.FourCC get_kFormat()
    // Offset: 0xCC6360
    static ::UnityEngine::InputSystem::Utilities::FourCC get_kFormat();
    // public UnityEngine.InputSystem.Utilities.FourCC get_format()
    // Offset: 0xA3B494
    ::UnityEngine::InputSystem::Utilities::FourCC get_format();
  }; // UnityEngine.InputSystem.LowLevel.PointerState
  #pragma pack(pop)
  static check_size<sizeof(PointerState), 32 + sizeof(uint16_t)> __UnityEngine_InputSystem_LowLevel_PointerStateSizeCheck;
  static_assert(sizeof(PointerState) == 0x22);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::InputSystem::LowLevel::PointerState::get_kFormat
// Il2CppName: get_kFormat
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::InputSystem::Utilities::FourCC (*)()>(&UnityEngine::InputSystem::LowLevel::PointerState::get_kFormat)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::InputSystem::LowLevel::PointerState), "get_kFormat", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::InputSystem::LowLevel::PointerState::get_format
// Il2CppName: get_format
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::InputSystem::Utilities::FourCC (UnityEngine::InputSystem::LowLevel::PointerState::*)()>(&UnityEngine::InputSystem::LowLevel::PointerState::get_format)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::InputSystem::LowLevel::PointerState), "get_format", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
