// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseController
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseController.hpp"
// Including type: UnityEngine.InputSystem.InputActionProperty
#include "UnityEngine/InputSystem/InputActionProperty.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Skipping declaration: InteractionState because it is already included!
  // Forward declaring type: XRControllerState
  class XRControllerState;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: ActionBasedController
  class ActionBasedController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::ActionBasedController);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::ActionBasedController*, "UnityEngine.XR.Interaction.Toolkit", "ActionBasedController");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x13C
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.ActionBasedController
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 97EB4C
  class ActionBasedController : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseController {
    public:
    // Writing base type padding for base size: 0x71 to desired offset: 0x78
    char ___base_padding[0x7] = {};
    public:
    // private UnityEngine.InputSystem.InputActionProperty m_PositionAction
    // Size: 0x18
    // Offset: 0x78
    ::UnityEngine::InputSystem::InputActionProperty m_PositionAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_RotationAction
    // Size: 0x18
    // Offset: 0x90
    ::UnityEngine::InputSystem::InputActionProperty m_RotationAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_SelectAction
    // Size: 0x18
    // Offset: 0xA8
    ::UnityEngine::InputSystem::InputActionProperty m_SelectAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_ActivateAction
    // Size: 0x18
    // Offset: 0xC0
    ::UnityEngine::InputSystem::InputActionProperty m_ActivateAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_UIPressAction
    // Size: 0x18
    // Offset: 0xD8
    ::UnityEngine::InputSystem::InputActionProperty m_UIPressAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_HapticDeviceAction
    // Size: 0x18
    // Offset: 0xF0
    ::UnityEngine::InputSystem::InputActionProperty m_HapticDeviceAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_RotateAnchorAction
    // Size: 0x18
    // Offset: 0x108
    ::UnityEngine::InputSystem::InputActionProperty m_RotateAnchorAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_TranslateAnchorAction
    // Size: 0x18
    // Offset: 0x120
    ::UnityEngine::InputSystem::InputActionProperty m_TranslateAnchorAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private System.Single m_ButtonPressPoint
    // Size: 0x4
    // Offset: 0x138
    float m_ButtonPressPoint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.InputSystem.InputActionProperty m_PositionAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionProperty& dyn_m_PositionAction();
    // Get instance field reference: private UnityEngine.InputSystem.InputActionProperty m_RotationAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionProperty& dyn_m_RotationAction();
    // Get instance field reference: private UnityEngine.InputSystem.InputActionProperty m_SelectAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionProperty& dyn_m_SelectAction();
    // Get instance field reference: private UnityEngine.InputSystem.InputActionProperty m_ActivateAction
