// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.LocomotionProvider
#include "UnityEngine/XR/Interaction/Toolkit/LocomotionProvider.hpp"
// Including type: UnityEngine.XR.InputFeatureUsage`1
#include "UnityEngine/XR/InputFeatureUsage_1.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRController
  class XRController;
  // Skipping declaration: InputAxes because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: GorillaSnapTurn
  class GorillaSnapTurn;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*, "UnityEngine.XR.Interaction.Toolkit", "GorillaSnapTurn");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaSnapTurn : public ::UnityEngine::XR::Interaction::Toolkit::LocomotionProvider {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes
    struct InputAxes;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputAxes/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputAxes
      constexpr InputAxes(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes Primary2DAxis
      static constexpr const int Primary2DAxis = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes Primary2DAxis
      static ::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes _get_Primary2DAxis();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes Primary2DAxis
      static void _set_Primary2DAxis(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes Secondary2DAxis
      static constexpr const int Secondary2DAxis = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes Secondary2DAxis
      static ::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes _get_Secondary2DAxis();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes Secondary2DAxis
      static void _set_Secondary2DAxis(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes
    #pragma pack(pop)
    static check_size<sizeof(GorillaSnapTurn::InputAxes), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_GorillaSnapTurn_InputAxesSizeCheck;
    static_assert(sizeof(GorillaSnapTurn::InputAxes) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0x9946CC
    // private UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes m_TurnUsage
    // Size: 0x4
    // Offset: 0x30
    ::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes m_TurnUsage;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes) == 0x4);
    // Padding between fields: m_TurnUsage and: m_Controllers
    char __padding0[0x4] = {};
    // [TooltipAttribute] Offset: 0x994718
    // private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRController> m_Controllers
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRController*>* m_Controllers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRController*>*) == 0x8);
    // [TooltipAttribute] Offset: 0x994764
    // private System.Single m_TurnAmount
    // Size: 0x4
    // Offset: 0x40
    float m_TurnAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x9947B0
    // private System.Single m_DebounceTime
    // Size: 0x4
    // Offset: 0x44
    float m_DebounceTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x9947FC
    // private System.Single m_DeadZone
    // Size: 0x4
    // Offset: 0x48
    float m_DeadZone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_CurrentTurnAmount
    // Size: 0x4
    // Offset: 0x4C
    float m_CurrentTurnAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TimeStarted
    // Size: 0x4
    // Offset: 0x50
    float m_TimeStarted;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_AxisReset
    // Size: 0x1
    // Offset: 0x54
    bool m_AxisReset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AxisReset and: turnSpeed
    char __padding7[0x3] = {};
    // public System.Single turnSpeed
    // Size: 0x4
    // Offset: 0x58
    float turnSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: turnSpeed and: m_ControllersWereActive
    char __padding8[0x4] = {};
    // private System.Collections.Generic.List`1<System.Boolean> m_ControllersWereActive
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<bool>* m_ControllersWereActive;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<bool>*) == 0x8);
    public:
    // Get static field: static private readonly UnityEngine.XR.InputFeatureUsage`1<UnityEngine.Vector2>[] m_Vec2UsageList
    static ::ArrayW<::UnityEngine::XR::InputFeatureUsage_1<::UnityEngine::Vector2>> _get_m_Vec2UsageList();
    // Set static field: static private readonly UnityEngine.XR.InputFeatureUsage`1<UnityEngine.Vector2>[] m_Vec2UsageList
    static void _set_m_Vec2UsageList(::ArrayW<::UnityEngine::XR::InputFeatureUsage_1<::UnityEngine::Vector2>> value);
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes m_TurnUsage
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes& dyn_m_TurnUsage();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRController> m_Controllers
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRController*>*& dyn_m_Controllers();
    // Get instance field reference: private System.Single m_TurnAmount
    [[deprecated("Use field access instead!")]] float& dyn_m_TurnAmount();
    // Get instance field reference: private System.Single m_DebounceTime
    [[deprecated("Use field access instead!")]] float& dyn_m_DebounceTime();
    // Get instance field reference: private System.Single m_DeadZone
    [[deprecated("Use field access instead!")]] float& dyn_m_DeadZone();
    // Get instance field reference: private System.Single m_CurrentTurnAmount
    [[deprecated("Use field access instead!")]] float& dyn_m_CurrentTurnAmount();
    // Get instance field reference: private System.Single m_TimeStarted
    [[deprecated("Use field access instead!")]] float& dyn_m_TimeStarted();
    // Get instance field reference: private System.Boolean m_AxisReset
    [[deprecated("Use field access instead!")]] bool& dyn_m_AxisReset();
    // Get instance field reference: public System.Single turnSpeed
    [[deprecated("Use field access instead!")]] float& dyn_turnSpeed();
    // Get instance field reference: private System.Collections.Generic.List`1<System.Boolean> m_ControllersWereActive
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<bool>*& dyn_m_ControllersWereActive();
    // public UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes get_turnUsage()
    // Offset: 0xCFABAC
    ::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes get_turnUsage();
    // public System.Void set_turnUsage(UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn/UnityEngine.XR.Interaction.Toolkit.InputAxes value)
    // Offset: 0xCFABB4
    void set_turnUsage(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes value);
    // public System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRController> get_controllers()
    // Offset: 0xCFABBC
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRController*>* get_controllers();
    // public System.Void set_controllers(System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRController> value)
    // Offset: 0xCFABC4
    void set_controllers(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRController*>* value);
    // public System.Single get_turnAmount()
    // Offset: 0xCFABCC
    float get_turnAmount();
    // public System.Void set_turnAmount(System.Single value)
    // Offset: 0xCFABD4
    void set_turnAmount(float value);
    // public System.Single get_debounceTime()
    // Offset: 0xCFABDC
    float get_debounceTime();
    // public System.Void set_debounceTime(System.Single value)
    // Offset: 0xCFABE4
    void set_debounceTime(float value);
    // public System.Single get_deadZone()
    // Offset: 0xCFABEC
    float get_deadZone();
    // public System.Void set_deadZone(System.Single value)
    // Offset: 0xCFABF4
    void set_deadZone(float value);
    // public System.Void .ctor()
    // Offset: 0xCFB174
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GorillaSnapTurn* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GorillaSnapTurn*, creationType>()));
    }
    // static private System.Void .cctor()
    // Offset: 0xCFB228
    static void _cctor();
    // private System.Void Update()
    // Offset: 0xCFABFC
    void Update();
    // private System.Void EnsureControllerDataListSize()
    // Offset: 0xCFAEA0
    void EnsureControllerDataListSize();
    // System.Void FakeStartTurn(System.Boolean isLeft)
    // Offset: 0xCFAFE8
    void FakeStartTurn(bool isLeft);
    // private System.Void StartTurn(System.Single amount)
    // Offset: 0xCFAF74
    void StartTurn(float amount);
    // public System.Void ChangeTurnMode(System.String turnMode, System.Int32 turnSpeedFactor)
    // Offset: 0xCFB00C
    void ChangeTurnMode(::StringW turnMode, int turnSpeedFactor);
    // public System.Single ConvertedTurnFactor(System.Single newTurnSpeed)
    // Offset: 0xCFB0EC
    float ConvertedTurnFactor(float newTurnSpeed);
  }; // UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn
  #pragma pack(pop)
  static check_size<sizeof(GorillaSnapTurn), 96 + sizeof(::System::Collections::Generic::List_1<bool>*)> __UnityEngine_XR_Interaction_Toolkit_GorillaSnapTurnSizeCheck;
  static_assert(sizeof(GorillaSnapTurn) == 0x68);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes, "UnityEngine.XR.Interaction.Toolkit", "GorillaSnapTurn/InputAxes");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_turnUsage
// Il2CppName: get_turnUsage
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)()>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_turnUsage)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "get_turnUsage", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_turnUsage
// Il2CppName: set_turnUsage
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::InputAxes)>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_turnUsage)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine.XR.Interaction.Toolkit", "GorillaSnapTurn/InputAxes")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "set_turnUsage", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_controllers
// Il2CppName: get_controllers
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRController*>* (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)()>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_controllers)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "get_controllers", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_controllers
// Il2CppName: set_controllers
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRController*>*)>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_controllers)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("UnityEngine.XR.Interaction.Toolkit", "XRController")})->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "set_controllers", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_turnAmount
// Il2CppName: get_turnAmount
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)()>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_turnAmount)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "get_turnAmount", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_turnAmount
// Il2CppName: set_turnAmount
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)(float)>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_turnAmount)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "set_turnAmount", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_debounceTime
// Il2CppName: get_debounceTime
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)()>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_debounceTime)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "get_debounceTime", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_debounceTime
// Il2CppName: set_debounceTime
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)(float)>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_debounceTime)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "set_debounceTime", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_deadZone
// Il2CppName: get_deadZone
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)()>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::get_deadZone)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "get_deadZone", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_deadZone
// Il2CppName: set_deadZone
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)(float)>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::set_deadZone)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "set_deadZone", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)()>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::EnsureControllerDataListSize
// Il2CppName: EnsureControllerDataListSize
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)()>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::EnsureControllerDataListSize)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "EnsureControllerDataListSize", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::FakeStartTurn
// Il2CppName: FakeStartTurn
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)(bool)>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::FakeStartTurn)> {
  static const MethodInfo* get() {
    static auto* isLeft = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "FakeStartTurn", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{isLeft});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::StartTurn
// Il2CppName: StartTurn
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)(float)>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::StartTurn)> {
  static const MethodInfo* get() {
    static auto* amount = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "StartTurn", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{amount});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::ChangeTurnMode
// Il2CppName: ChangeTurnMode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)(::StringW, int)>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::ChangeTurnMode)> {
  static const MethodInfo* get() {
    static auto* turnMode = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* turnSpeedFactor = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "ChangeTurnMode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{turnMode, turnSpeedFactor});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::ConvertedTurnFactor
// Il2CppName: ConvertedTurnFactor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::*)(float)>(&UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn::ConvertedTurnFactor)> {
  static const MethodInfo* get() {
    static auto* newTurnSpeed = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*), "ConvertedTurnFactor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{newTurnSpeed});
  }
};
