// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.InteractionState
#include "UnityEngine/XR/Interaction/Toolkit/InteractionState.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRInteractionUpdateOrder
#include "UnityEngine/XR/Interaction/Toolkit/XRInteractionUpdateOrder.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRControllerState
  class XRControllerState;
  // Skipping declaration: UpdateType because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseController
  class XRBaseController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRBaseController);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRBaseController*, "UnityEngine.XR.Interaction.Toolkit", "XRBaseController");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x71
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseController
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: 97EB84
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class XRBaseController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType
    struct UpdateType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateType
      constexpr UpdateType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType UpdateAndBeforeRender
      static constexpr const int UpdateAndBeforeRender = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType UpdateAndBeforeRender
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType _get_UpdateAndBeforeRender();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType UpdateAndBeforeRender
      static void _set_UpdateAndBeforeRender(::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType Update
      static constexpr const int Update = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType Update
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType _get_Update();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType Update
      static void _set_Update(::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType BeforeRender
      static constexpr const int BeforeRender = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType BeforeRender
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType _get_BeforeRender();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType BeforeRender
      static void _set_BeforeRender(::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType
    #pragma pack(pop)
    static check_size<sizeof(XRBaseController::UpdateType), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRBaseController_UpdateTypeSizeCheck;
    static_assert(sizeof(XRBaseController::UpdateType) == 0x4);
    public:
    // [HeaderAttribute] Offset: 0x97F4DC
    // [TooltipAttribute] Offset: 0x97F4DC
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType m_UpdateTrackingType
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType m_UpdateTrackingType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType) == 0x4);
    // [TooltipAttribute] Offset: 0x97F54C
    // private System.Boolean m_EnableInputTracking
    // Size: 0x1
    // Offset: 0x1C
    bool m_EnableInputTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [HeaderAttribute] Offset: 0x97F598
    // [TooltipAttribute] Offset: 0x97F598
    // private System.Boolean m_EnableInputActions
    // Size: 0x1
    // Offset: 0x1D
    bool m_EnableInputActions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_EnableInputActions and: m_ModelPrefab
    char __padding2[0x2] = {};
    // [HeaderAttribute] Offset: 0x97F608
    // [TooltipAttribute] Offset: 0x97F608
    // private UnityEngine.Transform m_ModelPrefab
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* m_ModelPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x97F678
    // private UnityEngine.Transform m_ModelTransform
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* m_ModelTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x97F6C4
    // private System.Boolean m_AnimateModel
    // Size: 0x1
    // Offset: 0x30
    bool m_AnimateModel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AnimateModel and: m_ModelSelectTransition
    char __padding5[0x7] = {};
    // [TooltipAttribute] Offset: 0x97F710
    // private System.String m_ModelSelectTransition
    // Size: 0x8
    // Offset: 0x38
    ::StringW m_ModelSelectTransition;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [TooltipAttribute] Offset: 0x97F75C
    // private System.String m_ModelDeSelectTransition
    // Size: 0x8
    // Offset: 0x40
    ::StringW m_ModelDeSelectTransition;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single m_AnchorControlDeadzone
    // Size: 0x4
    // Offset: 0x48
    float m_AnchorControlDeadzone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_AnchorControlOffAxisDeadzone
    // Size: 0x4
    // Offset: 0x4C
    float m_AnchorControlOffAxisDeadzone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InteractionState m_SelectInteractionState
    // Size: 0x3
    // Offset: 0x50
    ::UnityEngine::XR::Interaction::Toolkit::InteractionState m_SelectInteractionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InteractionState) == 0x3);
    // private UnityEngine.XR.Interaction.Toolkit.InteractionState m_ActivateInteractionState
    // Size: 0x3
    // Offset: 0x53
    ::UnityEngine::XR::Interaction::Toolkit::InteractionState m_ActivateInteractionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InteractionState) == 0x3);
    // private UnityEngine.XR.Interaction.Toolkit.InteractionState m_UIPressInteractionState
    // Size: 0x3
    // Offset: 0x56
    ::UnityEngine::XR::Interaction::Toolkit::InteractionState m_UIPressInteractionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InteractionState) == 0x3);
    // private System.Boolean m_HideControllerModel
    // Size: 0x1
    // Offset: 0x59
    bool m_HideControllerModel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HideControllerModel and: m_ControllerState
    char __padding13[0x6] = {};
    // private UnityEngine.XR.Interaction.Toolkit.XRControllerState m_ControllerState
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::XR::Interaction::Toolkit::XRControllerState* m_ControllerState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRControllerState*) == 0x8);
    // private UnityEngine.GameObject m_ModelGO
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* m_ModelGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean m_PerformSetup
    // Size: 0x1
    // Offset: 0x70
    bool m_PerformSetup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.XRBaseController/UnityEngine.XR.Interaction.Toolkit.UpdateType m_UpdateTrackingType
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType& dyn_m_UpdateTrackingType();
    // Get instance field reference: private System.Boolean m_EnableInputTracking
    [[deprecated("Use field access instead!")]] bool& dyn_m_EnableInputTracking();
    // Get instance field reference: private System.Boolean m_EnableInputActions
    [[deprecated("Use field access instead!")]] bool& dyn_m_EnableInputActions();
    // Get instance field reference: private UnityEngine.Transform m_ModelPrefab
