// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseController
  class XRBaseController;
  // Skipping declaration: InputTriggerType because it is already included!
  // Skipping declaration: XRBaseInteractable because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseControllerInteractor
  class XRBaseControllerInteractor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor*, "UnityEngine.XR.Interaction.Toolkit", "XRBaseControllerInteractor");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x108
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor
  // [TokenAttribute] Offset: FFFFFFFF
  class XRBaseControllerInteractor : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType
    struct InputTriggerType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputTriggerType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputTriggerType
      constexpr InputTriggerType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType State
      static constexpr const int State = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType State
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType _get_State();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType State
      static void _set_State(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType StateChange
      static constexpr const int StateChange = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType StateChange
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType _get_StateChange();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType StateChange
      static void _set_StateChange(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType Toggle
      static constexpr const int Toggle = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType Toggle
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType _get_Toggle();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType Toggle
      static void _set_Toggle(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType Sticky
      static constexpr const int Sticky = 3;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType Sticky
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType _get_Sticky();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType Sticky
      static void _set_Sticky(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType
    #pragma pack(pop)
    static check_size<sizeof(XRBaseControllerInteractor::InputTriggerType), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRBaseControllerInteractor_InputTriggerTypeSizeCheck;
    static_assert(sizeof(XRBaseControllerInteractor::InputTriggerType) == 0x4);
    public:
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType m_SelectActionTrigger
    // Size: 0x4
    // Offset: 0x80
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType m_SelectActionTrigger;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType) == 0x4);
    // private System.Boolean m_HideControllerOnSelect
    // Size: 0x1
    // Offset: 0x84
    bool m_HideControllerOnSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [FormerlySerializedAsAttribute] Offset: 0x980DE8
    // private System.Boolean m_PlayAudioClipOnSelectEntered
    // Size: 0x1
    // Offset: 0x85
    bool m_PlayAudioClipOnSelectEntered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnSelectEntered and: m_AudioClipForOnSelectEntered
    char __padding2[0x2] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x980E34
    // private UnityEngine.AudioClip m_AudioClipForOnSelectEntered
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::AudioClip* m_AudioClipForOnSelectEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x980E80
    // private System.Boolean m_PlayAudioClipOnSelectExited
    // Size: 0x1
    // Offset: 0x90
    bool m_PlayAudioClipOnSelectExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnSelectExited and: m_AudioClipForOnSelectExited
    char __padding4[0x7] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x980ECC
    // private UnityEngine.AudioClip m_AudioClipForOnSelectExited
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::AudioClip* m_AudioClipForOnSelectExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x980F18
    // private System.Boolean m_PlayAudioClipOnHoverEntered
    // Size: 0x1
    // Offset: 0xA0
    bool m_PlayAudioClipOnHoverEntered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnHoverEntered and: m_AudioClipForOnHoverEntered
    char __padding6[0x7] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x980F64
    // private UnityEngine.AudioClip m_AudioClipForOnHoverEntered
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::AudioClip* m_AudioClipForOnHoverEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x980FB0
    // private System.Boolean m_PlayAudioClipOnHoverExited
    // Size: 0x1
    // Offset: 0xB0
    bool m_PlayAudioClipOnHoverExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnHoverExited and: m_AudioClipForOnHoverExited
    char __padding8[0x7] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x980FFC
    // private UnityEngine.AudioClip m_AudioClipForOnHoverExited
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::AudioClip* m_AudioClipForOnHoverExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x981048
    // private System.Boolean m_PlayHapticsOnSelectEntered
    // Size: 0x1
    // Offset: 0xC0
    bool m_PlayHapticsOnSelectEntered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnSelectEntered and: m_HapticSelectEnterIntensity
    char __padding10[0x3] = {};
    // [RangeAttribute] Offset: 0x981094
    // private System.Single m_HapticSelectEnterIntensity
    // Size: 0x4
    // Offset: 0xC4
    float m_HapticSelectEnterIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticSelectEnterDuration
    // Size: 0x4
    // Offset: 0xC8
    float m_HapticSelectEnterDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x9810E4
    // private System.Boolean m_PlayHapticsOnSelectExited
    // Size: 0x1
    // Offset: 0xCC
    bool m_PlayHapticsOnSelectExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnSelectExited and: m_HapticSelectExitIntensity
    char __padding13[0x3] = {};
    // [RangeAttribute] Offset: 0x981130
    // private System.Single m_HapticSelectExitIntensity
    // Size: 0x4
    // Offset: 0xD0
    float m_HapticSelectExitIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticSelectExitDuration
    // Size: 0x4
    // Offset: 0xD4
    float m_HapticSelectExitDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x981180
    // private System.Boolean m_PlayHapticsOnHoverEntered
    // Size: 0x1
    // Offset: 0xD8
    bool m_PlayHapticsOnHoverEntered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnHoverEntered and: m_HapticHoverEnterIntensity
    char __padding16[0x3] = {};
    // [RangeAttribute] Offset: 0x9811CC
    // private System.Single m_HapticHoverEnterIntensity
    // Size: 0x4
    // Offset: 0xDC
    float m_HapticHoverEnterIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticHoverEnterDuration
    // Size: 0x4
    // Offset: 0xE0
    float m_HapticHoverEnterDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x98121C
    // private System.Boolean m_PlayHapticsOnHoverExited
    // Size: 0x1
    // Offset: 0xE4
    bool m_PlayHapticsOnHoverExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnHoverExited and: m_HapticHoverExitIntensity
    char __padding19[0x3] = {};
    // [RangeAttribute] Offset: 0x981268
    // private System.Single m_HapticHoverExitIntensity
    // Size: 0x4
    // Offset: 0xE8
    float m_HapticHoverExitIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticHoverExitDuration
    // Size: 0x4
    // Offset: 0xEC
    float m_HapticHoverExitDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseController m_Controller
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseController* m_Controller;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseController*) == 0x8);
    // private System.Boolean m_ToggleSelectActive
    // Size: 0x1
    // Offset: 0xF8
    bool m_ToggleSelectActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_WaitingForSecondDeactivate
    // Size: 0x1
    // Offset: 0xF9
    bool m_WaitingForSecondDeactivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_WaitingForSecondDeactivate and: m_EffectsAudioSource
    char __padding24[0x6] = {};
    // private UnityEngine.AudioSource m_EffectsAudioSource
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::AudioSource* m_EffectsAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    public:
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/UnityEngine.XR.Interaction.Toolkit.InputTriggerType m_SelectActionTrigger
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType& dyn_m_SelectActionTrigger();
    // Get instance field reference: private System.Boolean m_HideControllerOnSelect
    [[deprecated("Use field access instead!")]] bool& dyn_m_HideControllerOnSelect();
    // Get instance field reference: private System.Boolean m_PlayAudioClipOnSelectEntered
    [[deprecated("Use field access instead!")]] bool& dyn_m_PlayAudioClipOnSelectEntered();
    // Get instance field reference: private UnityEngine.AudioClip m_AudioClipForOnSelectEntered
