// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRInteractionUpdateOrder
#include "UnityEngine/XR/Interaction/Toolkit/XRInteractionUpdateOrder.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRInteractionManager
  class XRInteractionManager;
  // Forward declaring type: XRBaseInteractor
  class XRBaseInteractor;
  // Forward declaring type: XRInteractableEvent
  class XRInteractableEvent;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseInteractable
  class XRBaseInteractable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*, "UnityEngine.XR.Interaction.Toolkit", "XRBaseInteractable");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable
  // [TokenAttribute] Offset: FFFFFFFF
  // [SelectionBaseAttribute] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: 97ECF0
  class XRBaseInteractable : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType
    struct MovementType;
    public:
    // [TooltipAttribute] Offset: 0x97FD54
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractionManager m_InteractionManager
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager* m_InteractionManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager*) == 0x8);
    // [TooltipAttribute] Offset: 0x97FDA0
    // private System.Collections.Generic.List`1<UnityEngine.Collider> m_Colliders
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::Collider*>* m_Colliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Collider*>*) == 0x8);
    // [TooltipAttribute] Offset: 0x97FDEC
    // private UnityEngine.LayerMask m_InteractionLayerMask
    // Size: 0x4
    // Offset: 0x28
    ::UnityEngine::LayerMask m_InteractionLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // Padding between fields: m_InteractionLayerMask and: m_HoveringInteractors
    char __padding2[0x4] = {};
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor> m_HoveringInteractors
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor*>* m_HoveringInteractors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor*>*) == 0x8);
    // private System.Boolean <isHovered>k__BackingField
    // Size: 0x1
    // Offset: 0x38
    bool isHovered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isSelected>k__BackingField
    // Size: 0x1
    // Offset: 0x39
    bool isSelected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isSelected and: m_RegisteredInteractionManager
    char __padding5[0x6] = {};
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractionManager m_RegisteredInteractionManager
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager* m_RegisteredInteractionManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x97FE58
    // [TooltipAttribute] Offset: 0x97FE58
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnFirstHoverEntered
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnFirstHoverEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x97FEC8
    // [TooltipAttribute] Offset: 0x97FEC8
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnHoverEntered
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnHoverEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x97FF38
    // [TooltipAttribute] Offset: 0x97FF38
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnHoverExited
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnHoverExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x97FFA8
    // [TooltipAttribute] Offset: 0x97FFA8
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnLastHoverExited
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnLastHoverExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x980018
    // [TooltipAttribute] Offset: 0x980018
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnSelectEntered
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnSelectEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x980088
    // [TooltipAttribute] Offset: 0x980088
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnSelectExited
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnSelectExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x9800F8
    // [TooltipAttribute] Offset: 0x9800F8
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnSelectCanceled
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnSelectCanceled;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0x980168
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnActivate
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnActivate;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0x9801B4
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnDeactivate
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnDeactivate;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0x980200
    // private UnityEngine.GameObject m_CustomReticle
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* m_CustomReticle;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor,UnityEngine.GameObject> m_ReticleCache
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor*, ::UnityEngine::GameObject*>* m_ReticleCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor*, ::UnityEngine::GameObject*>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private UnityEngine.XR.Interaction.Toolkit.XRInteractionManager s_InteractionManagerCache
    static ::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager* _get_s_InteractionManagerCache();
    // Set static field: static private UnityEngine.XR.Interaction.Toolkit.XRInteractionManager s_InteractionManagerCache
    static void _set_s_InteractionManagerCache(::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager* value);
