// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseInteractor
  class XRBaseInteractor;
  // Forward declaring type: XRBaseInteractable
  class XRBaseInteractable;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRInteractorReticleVisual
  class XRInteractorReticleVisual;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRInteractorReticleVisual);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRInteractorReticleVisual*, "UnityEngine.XR.Interaction.Toolkit", "XRInteractorReticleVisual");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x71
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRInteractorReticleVisual
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 97EEDC
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class XRInteractorReticleVisual : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // [TooltipAttribute] Offset: 0x980B68
    // private System.Single m_MaxRaycastDistance
    // Size: 0x4
    // Offset: 0x18
    float m_MaxRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_MaxRaycastDistance and: m_ReticlePrefab
    char __padding0[0x4] = {};
    // [TooltipAttribute] Offset: 0x980BB4
    // private UnityEngine.GameObject m_ReticlePrefab
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* m_ReticlePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [TooltipAttribute] Offset: 0x980C00
    // private System.Single m_PrefabScalingFactor
    // Size: 0x4
    // Offset: 0x28
    float m_PrefabScalingFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x980C4C
    // private System.Boolean m_UndoDistanceScaling
    // Size: 0x1
    // Offset: 0x2C
    bool m_UndoDistanceScaling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x980C98
    // private System.Boolean m_AlignPrefabWithSurfaceNormal
    // Size: 0x1
    // Offset: 0x2D
    bool m_AlignPrefabWithSurfaceNormal;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AlignPrefabWithSurfaceNormal and: m_EndpointSmoothingTime
    char __padding4[0x2] = {};
    // [TooltipAttribute] Offset: 0x980CE4
    // private System.Single m_EndpointSmoothingTime
    // Size: 0x4
    // Offset: 0x30
    float m_EndpointSmoothingTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x980D30
    // private System.Boolean m_DrawWhileSelecting
    // Size: 0x1
    // Offset: 0x34
    bool m_DrawWhileSelecting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DrawWhileSelecting and: m_RaycastMask
    char __padding6[0x3] = {};
    // [TooltipAttribute] Offset: 0x980D7C
    // private UnityEngine.LayerMask m_RaycastMask
    // Size: 0x4
    // Offset: 0x38
    ::UnityEngine::LayerMask m_RaycastMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private System.Boolean m_ReticleActive
    // Size: 0x1
    // Offset: 0x3C
    bool m_ReticleActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ReticleActive and: m_ReticleInstance
    char __padding8[0x3] = {};
    // private UnityEngine.GameObject m_ReticleInstance
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* m_ReticleInstance;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor m_Interactor
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor* m_Interactor;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor*) == 0x8);
    // private UnityEngine.Vector3 m_TargetEndPoint
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 m_TargetEndPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_TargetEndNormal
    // Size: 0xC
    // Offset: 0x5C
    ::UnityEngine::Vector3 m_TargetEndNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private readonly UnityEngine.RaycastHit[] m_RaycastHits
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::UnityEngine::RaycastHit> m_RaycastHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private System.Boolean m_HasSelectedInteractable
    // Size: 0x1
    // Offset: 0x70
    bool m_HasSelectedInteractable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Int32 k_MaxRaycastHits
    static constexpr const int k_MaxRaycastHits = 10;
    // Get static field: static private System.Int32 k_MaxRaycastHits
    static int _get_k_MaxRaycastHits();
    // Set static field: static private System.Int32 k_MaxRaycastHits
    static void _set_k_MaxRaycastHits(int value);
    // Get instance field reference: private System.Single m_MaxRaycastDistance
    [[deprecated("Use field access instead!")]] float& dyn_m_MaxRaycastDistance();
    // Get instance field reference: private UnityEngine.GameObject m_ReticlePrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_m_ReticlePrefab();
