// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseControllerInteractor.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractor
#include "UnityEngine/XR/Interaction/Toolkit/UI/IUIInteractor.hpp"
// Including type: UnityEngine.QueryTriggerInteraction
#include "UnityEngine/QueryTriggerInteraction.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Skipping declaration: XRBaseInteractable because it is already included!
  // Forward declaring type: XRRig
  class XRRig;
  // Skipping declaration: LineType because it is already included!
  // Skipping declaration: HitDetectionType because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector2 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: XRUIInputModule
  class XRUIInputModule;
  // Forward declaring type: TrackedDeviceModel
  struct TrackedDeviceModel;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: RaycastResult
  struct RaycastResult;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputAction
  class InputAction;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRRayInteractor
  class XRRayInteractor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor*, "UnityEngine.XR.Interaction.Toolkit", "XRRayInteractor");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x1C8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRayInteractor
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 97EFC0
  class XRRayInteractor : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor/*, public ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor*/ {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::RaycastHitComparer
    class RaycastHitComparer;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType
    struct LineType;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType
    struct HitDetectionType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType
    // [TokenAttribute] Offset: FFFFFFFF
    struct LineType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LineType
      constexpr LineType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType StraightLine
      static constexpr const int StraightLine = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType StraightLine
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType _get_StraightLine();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType StraightLine
      static void _set_StraightLine(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType ProjectileCurve
      static constexpr const int ProjectileCurve = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType ProjectileCurve
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType _get_ProjectileCurve();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType ProjectileCurve
      static void _set_ProjectileCurve(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType BezierCurve
      static constexpr const int BezierCurve = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType BezierCurve
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType _get_BezierCurve();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType BezierCurve
      static void _set_BezierCurve(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType
    #pragma pack(pop)
    static check_size<sizeof(XRRayInteractor::LineType), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRRayInteractor_LineTypeSizeCheck;
    static_assert(sizeof(XRRayInteractor::LineType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.HitDetectionType
    // [TokenAttribute] Offset: FFFFFFFF
    struct HitDetectionType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: HitDetectionType
      constexpr HitDetectionType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.HitDetectionType Raycast
      static constexpr const int Raycast = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.HitDetectionType Raycast
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType _get_Raycast();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.HitDetectionType Raycast
      static void _set_Raycast(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.HitDetectionType SphereCast
      static constexpr const int SphereCast = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.HitDetectionType SphereCast
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType _get_SphereCast();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.HitDetectionType SphereCast
      static void _set_SphereCast(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.HitDetectionType
    #pragma pack(pop)
    static check_size<sizeof(XRRayInteractor::HitDetectionType), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRRayInteractor_HitDetectionTypeSizeCheck;
    static_assert(sizeof(XRRayInteractor::HitDetectionType) == 0x4);
    public:
    // private UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.LineType m_LineType
    // Size: 0x4
    // Offset: 0x108
    ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType m_LineType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType) == 0x4);
    // private System.Single m_MaxRaycastDistance
    // Size: 0x4
    // Offset: 0x10C
    float m_MaxRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform m_ReferenceFrame
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Transform* m_ReferenceFrame;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single m_Velocity
    // Size: 0x4
    // Offset: 0x118
    float m_Velocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_Acceleration
    // Size: 0x4
    // Offset: 0x11C
    float m_Acceleration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_AdditionalFlightTime
    // Size: 0x4
    // Offset: 0x120
    float m_AdditionalFlightTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_EndPointDistance
    // Size: 0x4
    // Offset: 0x124
    float m_EndPointDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_EndPointHeight
    // Size: 0x4
    // Offset: 0x128
    float m_EndPointHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ControlPointDistance
    // Size: 0x4
    // Offset: 0x12C
    float m_ControlPointDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ControlPointHeight
    // Size: 0x4
    // Offset: 0x130
    float m_ControlPointHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x981668
    // private System.Int32 m_SampleFrequency
    // Size: 0x4
    // Offset: 0x134
    int m_SampleFrequency;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.HitDetectionType m_HitDetectionType
    // Size: 0x4
    // Offset: 0x138
    ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType m_HitDetectionType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType) == 0x4);
    // [RangeAttribute] Offset: 0x9816BC
    // private System.Single m_SphereCastRadius
    // Size: 0x4
    // Offset: 0x13C
    float m_SphereCastRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.LayerMask m_RaycastMask
    // Size: 0x4
    // Offset: 0x140
    ::UnityEngine::LayerMask m_RaycastMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.QueryTriggerInteraction m_RaycastTriggerInteraction
    // Size: 0x4
    // Offset: 0x144
    ::UnityEngine::QueryTriggerInteraction m_RaycastTriggerInteraction;
    // Field size check
    static_assert(sizeof(::UnityEngine::QueryTriggerInteraction) == 0x4);
    // private System.Boolean m_KeepSelectedTargetValid
    // Size: 0x1
    // Offset: 0x148
    bool m_KeepSelectedTargetValid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HoverToSelect
    // Size: 0x1
    // Offset: 0x149
    bool m_HoverToSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HoverToSelect and: m_HoverTimeToSelect
    char __padding16[0x2] = {};
    // private System.Single m_HoverTimeToSelect
    // Size: 0x4
    // Offset: 0x14C
    float m_HoverTimeToSelect;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_EnableUIInteraction
    // Size: 0x1
    // Offset: 0x150
    bool m_EnableUIInteraction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_AllowAnchorControl
    // Size: 0x1
    // Offset: 0x151
    bool m_AllowAnchorControl;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UseForceGrab
    // Size: 0x1
    // Offset: 0x152
    bool m_UseForceGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UseForceGrab and: m_RotateSpeed
    char __padding20[0x1] = {};
    // private System.Single m_RotateSpeed
    // Size: 0x4
    // Offset: 0x154
    float m_RotateSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TranslateSpeed
    // Size: 0x4
    // Offset: 0x158
    float m_TranslateSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_TranslateSpeed and: m_ValidTargets
    char __padding22[0x4] = {};
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable> m_ValidTargets
    // Size: 0x8
    // Offset: 0x160
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*>* m_ValidTargets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*>*) == 0x8);
    // private UnityEngine.Transform m_OriginalAttachTransform
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::Transform* m_OriginalAttachTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRRig m_XRRig
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::XR::Interaction::Toolkit::XRRig* m_XRRig;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRig*) == 0x8);
    // private readonly UnityEngine.RaycastHit[] m_RaycastHits
    // Size: 0x8
    // Offset: 0x178
    ::ArrayW<::UnityEngine::RaycastHit> m_RaycastHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private readonly UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/UnityEngine.XR.Interaction.Toolkit.RaycastHitComparer m_RaycastHitComparer
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::RaycastHitComparer* m_RaycastHitComparer;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::RaycastHitComparer*) == 0x8);
    // private UnityEngine.Vector3[] m_SamplePoints
    // Size: 0x8
    // Offset: 0x188
    ::ArrayW<::UnityEngine::Vector3> m_SamplePoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Int32 m_NoSamplePoints
    // Size: 0x4
    // Offset: 0x190
    int m_NoSamplePoints;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_NoSamplePoints and: m_CurrentNearestObject
    char __padding29[0x4] = {};
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable m_CurrentNearestObject
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable* m_CurrentNearestObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*) == 0x8);
    // private System.Single m_LastTimeHoveredObjectChanged
    // Size: 0x4
    // Offset: 0x1A0
    float m_LastTimeHoveredObjectChanged;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PassedHoverTimeToSelect
    // Size: 0x1
    // Offset: 0x1A4
    bool m_PassedHoverTimeToSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PassedHoverTimeToSelect and: m_HitCount
    char __padding32[0x3] = {};
    // private System.Int32 m_HitCount
    // Size: 0x4
    // Offset: 0x1A8
    int m_HitCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_HitPositionInLine
    // Size: 0x4
    // Offset: 0x1AC
    int m_HitPositionInLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly UnityEngine.Vector3[] m_ControlPoints
    // Size: 0x8
    // Offset: 0x1B0
    ::ArrayW<::UnityEngine::Vector3> m_ControlPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule m_InputModule
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule* m_InputModule;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule m_RegisteredInputModule
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule* m_RegisteredInputModule;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor
    operator ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor() noexcept {
      return *reinterpret_cast<::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor*>(this);
    }
    // static field const value: static private System.Int32 k_MaxRaycastHits
    static constexpr const int k_MaxRaycastHits = 10;
    // Get static field: static private System.Int32 k_MaxRaycastHits
    static int _get_k_MaxRaycastHits();
    // Set static field: static private System.Int32 k_MaxRaycastHits
    static void _set_k_MaxRaycastHits(int value);
    // static field const value: static private System.Int32 k_MinLineSamples
