// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.XR.TrackingOriginModeFlags
#include "UnityEngine/XR/TrackingOriginModeFlags.hpp"
// Including type: UnityEngine.XR.TrackingSpaceType
#include "UnityEngine/XR/TrackingSpaceType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRInputSubsystem
  class XRInputSubsystem;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRRig
  class XRRig;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRRig);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRRig*, "UnityEngine.XR.Interaction.Toolkit", "XRRig");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x3E
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRig
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 97F208
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class XRRig : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRig::$RepeatInitializeCamera$d__40
    class $RepeatInitializeCamera$d__40;
    public:
    // [TooltipAttribute] Offset: 0x982378
    // private UnityEngine.GameObject m_RigBaseGameObject
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* m_RigBaseGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [TooltipAttribute] Offset: 0x9823C4
    // private UnityEngine.GameObject m_CameraFloorOffsetObject
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* m_CameraFloorOffsetObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [TooltipAttribute] Offset: 0x982410
    // private UnityEngine.GameObject m_CameraGameObject
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* m_CameraGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [TooltipAttribute] Offset: 0x98245C
    // private UnityEngine.XR.TrackingOriginModeFlags m_TrackingOriginMode
    // Size: 0x4
    // Offset: 0x30
    ::UnityEngine::XR::TrackingOriginModeFlags m_TrackingOriginMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::TrackingOriginModeFlags) == 0x4);
    // [TooltipAttribute] Offset: 0x9824A8
    // private UnityEngine.XR.TrackingSpaceType m_TrackingSpace
    // Size: 0x4
    // Offset: 0x34
    ::UnityEngine::XR::TrackingSpaceType m_TrackingSpace;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::TrackingSpaceType) == 0x4);
    // [TooltipAttribute] Offset: 0x9824F4
    // private System.Single m_CameraYOffset
    // Size: 0x4
    // Offset: 0x38
    float m_CameraYOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_CameraInitialized
    // Size: 0x1
    // Offset: 0x3C
    bool m_CameraInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CameraInitializing
    // Size: 0x1
    // Offset: 0x3D
    bool m_CameraInitializing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single k_DefaultCameraYOffset
    static constexpr const float k_DefaultCameraYOffset = 1.36144;
    // Get static field: static private System.Single k_DefaultCameraYOffset
    static float _get_k_DefaultCameraYOffset();
    // Set static field: static private System.Single k_DefaultCameraYOffset
    static void _set_k_DefaultCameraYOffset(float value);
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.XR.XRInputSubsystem> s_InputSubsystems
    static ::System::Collections::Generic::List_1<::UnityEngine::XR::XRInputSubsystem*>* _get_s_InputSubsystems();
