// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Completed forward declares
// Type namespace: Tayx.Graphy
namespace Tayx::Graphy {
  // Forward declaring type: G_GraphShader
  class G_GraphShader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Tayx::Graphy::G_GraphShader);
DEFINE_IL2CPP_ARG_TYPE(::Tayx::Graphy::G_GraphShader*, "Tayx.Graphy", "G_GraphShader");
// Type namespace: Tayx.Graphy
namespace Tayx::Graphy {
  // Size: 0x8C
  #pragma pack(push, 1)
  // Autogenerated type: Tayx.Graphy.G_GraphShader
  // [TokenAttribute] Offset: FFFFFFFF
  class G_GraphShader : public ::Il2CppObject {
    public:
    public:
    // public System.Int32 ArrayMaxSize
    // Size: 0x4
    // Offset: 0x10
    int ArrayMaxSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: ArrayMaxSize and: ShaderArrayValues
    char __padding0[0x4] = {};
    // public System.Single[] ShaderArrayValues
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<float> ShaderArrayValues;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public UnityEngine.UI.Image Image
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UI::Image* Image;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.String Name
    // Size: 0x8
    // Offset: 0x28
    ::StringW Name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String Name_Length
    // Size: 0x8
    // Offset: 0x30
    ::StringW Name_Length;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single Average
    // Size: 0x4
    // Offset: 0x38
    float Average;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_averagePropertyId
    // Size: 0x4
    // Offset: 0x3C
    int m_averagePropertyId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single GoodThreshold
    // Size: 0x4
    // Offset: 0x40
    float GoodThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single CautionThreshold
    // Size: 0x4
    // Offset: 0x44
    float CautionThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_goodThresholdPropertyId
    // Size: 0x4
    // Offset: 0x48
    int m_goodThresholdPropertyId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_cautionThresholdPropertyId
    // Size: 0x4
    // Offset: 0x4C
    int m_cautionThresholdPropertyId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Color GoodColor
    // Size: 0x10
    // Offset: 0x50
    ::UnityEngine::Color GoodColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color CautionColor
    // Size: 0x10
    // Offset: 0x60
    ::UnityEngine::Color CautionColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color CriticalColor
    // Size: 0x10
    // Offset: 0x70
    ::UnityEngine::Color CriticalColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Int32 m_goodColorPropertyId
    // Size: 0x4
    // Offset: 0x80
    int m_goodColorPropertyId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_cautionColorPropertyId
    // Size: 0x4
    // Offset: 0x84
    int m_cautionColorPropertyId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_criticalColorPropertyId
    // Size: 0x4
    // Offset: 0x88
    int m_criticalColorPropertyId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // static field const value: static public System.Int32 ArrayMaxSizeFull
    static constexpr const int ArrayMaxSizeFull = 512;
    // Get static field: static public System.Int32 ArrayMaxSizeFull
    static int _get_ArrayMaxSizeFull();
    // Set static field: static public System.Int32 ArrayMaxSizeFull
    static void _set_ArrayMaxSizeFull(int value);
    // static field const value: static public System.Int32 ArrayMaxSizeLight
    static constexpr const int ArrayMaxSizeLight = 128;
    // Get static field: static public System.Int32 ArrayMaxSizeLight
    static int _get_ArrayMaxSizeLight();
    // Set static field: static public System.Int32 ArrayMaxSizeLight
    static void _set_ArrayMaxSizeLight(int value);
    // Get instance field reference: public System.Int32 ArrayMaxSize
    [[deprecated("Use field access instead!")]] int& dyn_ArrayMaxSize();
    // Get instance field reference: public System.Single[] ShaderArrayValues
    [[deprecated("Use field access instead!")]] ::ArrayW<float>& dyn_ShaderArrayValues();
    // Get instance field reference: public UnityEngine.UI.Image Image
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Image*& dyn_Image();
    // Get instance field reference: private System.String Name
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Name();
    // Get instance field reference: private System.String Name_Length
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Name_Length();
    // Get instance field reference: public System.Single Average
    [[deprecated("Use field access instead!")]] float& dyn_Average();
    // Get instance field reference: private System.Int32 m_averagePropertyId
    [[deprecated("Use field access instead!")]] int& dyn_m_averagePropertyId();
    // Get instance field reference: public System.Single GoodThreshold
    [[deprecated("Use field access instead!")]] float& dyn_GoodThreshold();
    // Get instance field reference: public System.Single CautionThreshold
    [[deprecated("Use field access instead!")]] float& dyn_CautionThreshold();
    // Get instance field reference: private System.Int32 m_goodThresholdPropertyId
    [[deprecated("Use field access instead!")]] int& dyn_m_goodThresholdPropertyId();
    // Get instance field reference: private System.Int32 m_cautionThresholdPropertyId
    [[deprecated("Use field access instead!")]] int& dyn_m_cautionThresholdPropertyId();
    // Get instance field reference: public UnityEngine.Color GoodColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_GoodColor();
    // Get instance field reference: public UnityEngine.Color CautionColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_CautionColor();
    // Get instance field reference: public UnityEngine.Color CriticalColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_CriticalColor();
    // Get instance field reference: private System.Int32 m_goodColorPropertyId
    [[deprecated("Use field access instead!")]] int& dyn_m_goodColorPropertyId();
    // Get instance field reference: private System.Int32 m_cautionColorPropertyId
    [[deprecated("Use field access instead!")]] int& dyn_m_cautionColorPropertyId();
    // Get instance field reference: private System.Int32 m_criticalColorPropertyId
    [[deprecated("Use field access instead!")]] int& dyn_m_criticalColorPropertyId();
    // public System.Void .ctor()
    // Offset: 0x2ADB2D8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static G_GraphShader* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Tayx::Graphy::G_GraphShader::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<G_GraphShader*, creationType>()));
    }
    // public System.Void InitializeShader()
    // Offset: 0x2ADA698
    void InitializeShader();
    // public System.Void UpdateArray()
    // Offset: 0x2ADB240
    void UpdateArray();
    // public System.Void UpdateAverage()
    // Offset: 0x2ADB290
    void UpdateAverage();
    // public System.Void UpdateThresholds()
    // Offset: 0x2ADB1CC
    void UpdateThresholds();
    // public System.Void UpdateColors()
    // Offset: 0x2ADB120
    void UpdateColors();
    // public System.Void UpdatePoints()
    // Offset: 0x2ADAE70
    void UpdatePoints();
  }; // Tayx.Graphy.G_GraphShader
  #pragma pack(pop)
  static check_size<sizeof(G_GraphShader), 136 + sizeof(int)> __Tayx_Graphy_G_GraphShaderSizeCheck;
  static_assert(sizeof(G_GraphShader) == 0x8C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Tayx::Graphy::G_GraphShader::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Tayx::Graphy::G_GraphShader::InitializeShader
// Il2CppName: InitializeShader
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::G_GraphShader::*)()>(&Tayx::Graphy::G_GraphShader::InitializeShader)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::G_GraphShader*), "InitializeShader", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::G_GraphShader::UpdateArray
// Il2CppName: UpdateArray
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::G_GraphShader::*)()>(&Tayx::Graphy::G_GraphShader::UpdateArray)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::G_GraphShader*), "UpdateArray", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::G_GraphShader::UpdateAverage
// Il2CppName: UpdateAverage
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::G_GraphShader::*)()>(&Tayx::Graphy::G_GraphShader::UpdateAverage)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::G_GraphShader*), "UpdateAverage", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::G_GraphShader::UpdateThresholds
// Il2CppName: UpdateThresholds
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::G_GraphShader::*)()>(&Tayx::Graphy::G_GraphShader::UpdateThresholds)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::G_GraphShader*), "UpdateThresholds", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::G_GraphShader::UpdateColors
// Il2CppName: UpdateColors
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::G_GraphShader::*)()>(&Tayx::Graphy::G_GraphShader::UpdateColors)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::G_GraphShader*), "UpdateColors", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::G_GraphShader::UpdatePoints
// Il2CppName: UpdatePoints
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::G_GraphShader::*)()>(&Tayx::Graphy::G_GraphShader::UpdatePoints)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::G_GraphShader*), "UpdatePoints", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
