// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPun
#include "Photon/Pun/MonoBehaviourPun.hpp"
// Including type: UnityEngine.EventSystems.IPointerClickHandler
#include "UnityEngine/EventSystems/IPointerClickHandler.hpp"
// Including type: UnityEngine.EventSystems.PointerEventData/UnityEngine.EventSystems.InputButton
#include "UnityEngine/EventSystems/PointerEventData.hpp"
// Including type: UnityEngine.KeyCode
#include "UnityEngine/KeyCode.hpp"
// Including type: Photon.Pun.RpcTarget
#include "Photon/Pun/RpcTarget.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Pun::UtilityScripts
namespace Photon::Pun::UtilityScripts {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: PointerEventData because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Photon.Pun.UtilityScripts
namespace Photon::Pun::UtilityScripts {
  // Forward declaring type: OnClickRpc
  class OnClickRpc;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Pun::UtilityScripts::OnClickRpc);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Pun::UtilityScripts::OnClickRpc*, "Photon.Pun.UtilityScripts", "OnClickRpc");
// Type namespace: Photon.Pun.UtilityScripts
namespace Photon::Pun::UtilityScripts {
  // Size: 0x49
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Pun.UtilityScripts.OnClickRpc
  // [TokenAttribute] Offset: FFFFFFFF
  class OnClickRpc : public ::Photon::Pun::MonoBehaviourPun/*, public ::UnityEngine::EventSystems::IPointerClickHandler*/ {
    public:
    // Nested type: ::Photon::Pun::UtilityScripts::OnClickRpc::$ClickFlash$d__8
    class $ClickFlash$d__8;
    public:
    // public UnityEngine.EventSystems.PointerEventData/UnityEngine.EventSystems.InputButton Button
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::EventSystems::PointerEventData::InputButton Button;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::PointerEventData::InputButton) == 0x4);
    // public UnityEngine.KeyCode ModifierKey
    // Size: 0x4
    // Offset: 0x24
    ::UnityEngine::KeyCode ModifierKey;
    // Field size check
    static_assert(sizeof(::UnityEngine::KeyCode) == 0x4);
    // public Photon.Pun.RpcTarget Target
    // Size: 0x4
    // Offset: 0x28
    ::Photon::Pun::RpcTarget Target;
    // Field size check
    static_assert(sizeof(::Photon::Pun::RpcTarget) == 0x4);
    // Padding between fields: Target and: originalMaterial
    char __padding2[0x4] = {};
    // private UnityEngine.Material originalMaterial
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Material* originalMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Color originalColor
    // Size: 0x10
    // Offset: 0x38
    ::UnityEngine::Color originalColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean isFlashing
    // Size: 0x1
    // Offset: 0x48
    bool isFlashing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::EventSystems::IPointerClickHandler
    operator ::UnityEngine::EventSystems::IPointerClickHandler() noexcept {
      return *reinterpret_cast<::UnityEngine::EventSystems::IPointerClickHandler*>(this);
    }
    // Get instance field reference: public UnityEngine.EventSystems.PointerEventData/UnityEngine.EventSystems.InputButton Button
    [[deprecated("Use field access instead!")]] ::UnityEngine::EventSystems::PointerEventData::InputButton& dyn_Button();
    // Get instance field reference: public UnityEngine.KeyCode ModifierKey
    [[deprecated("Use field access instead!")]] ::UnityEngine::KeyCode& dyn_ModifierKey();
    // Get instance field reference: public Photon.Pun.RpcTarget Target
    [[deprecated("Use field access instead!")]] ::Photon::Pun::RpcTarget& dyn_Target();
    // Get instance field reference: private UnityEngine.Material originalMaterial
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_originalMaterial();
    // Get instance field reference: private UnityEngine.Color originalColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_originalColor();
    // Get instance field reference: private System.Boolean isFlashing
    [[deprecated("Use field access instead!")]] bool& dyn_isFlashing();
    // public System.Void .ctor()
    // Offset: 0x164E9E8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OnClickRpc* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Photon::Pun::UtilityScripts::OnClickRpc::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OnClickRpc*, creationType>()));
    }
    // private System.Void UnityEngine.EventSystems.IPointerClickHandler.OnPointerClick(UnityEngine.EventSystems.PointerEventData eventData)
    // Offset: 0x164E7B0
    void UnityEngine_EventSystems_IPointerClickHandler_OnPointerClick(::UnityEngine::EventSystems::PointerEventData* eventData);
    // public System.Void ClickRpc()
    // Offset: 0x164E920
    void ClickRpc();
    // public System.Collections.IEnumerator ClickFlash()
    // Offset: 0x164E94C
    ::System::Collections::IEnumerator* ClickFlash();
  }; // Photon.Pun.UtilityScripts.OnClickRpc
  #pragma pack(pop)
  static check_size<sizeof(OnClickRpc), 72 + sizeof(bool)> __Photon_Pun_UtilityScripts_OnClickRpcSizeCheck;
  static_assert(sizeof(OnClickRpc) == 0x49);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Photon::Pun::UtilityScripts::OnClickRpc::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Photon::Pun::UtilityScripts::OnClickRpc::UnityEngine_EventSystems_IPointerClickHandler_OnPointerClick
// Il2CppName: UnityEngine.EventSystems.IPointerClickHandler.OnPointerClick
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Pun::UtilityScripts::OnClickRpc::*)(::UnityEngine::EventSystems::PointerEventData*)>(&Photon::Pun::UtilityScripts::OnClickRpc::UnityEngine_EventSystems_IPointerClickHandler_OnPointerClick)> {
  static const MethodInfo* get() {
    static auto* eventData = &::il2cpp_utils::GetClassFromName("UnityEngine.EventSystems", "PointerEventData")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Photon::Pun::UtilityScripts::OnClickRpc*), "UnityEngine.EventSystems.IPointerClickHandler.OnPointerClick", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{eventData});
  }
};
// Writing MetadataGetter for method: Photon::Pun::UtilityScripts::OnClickRpc::ClickRpc
// Il2CppName: ClickRpc
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Pun::UtilityScripts::OnClickRpc::*)()>(&Photon::Pun::UtilityScripts::OnClickRpc::ClickRpc)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Pun::UtilityScripts::OnClickRpc*), "ClickRpc", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Pun::UtilityScripts::OnClickRpc::ClickFlash
// Il2CppName: ClickFlash
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::IEnumerator* (Photon::Pun::UtilityScripts::OnClickRpc::*)()>(&Photon::Pun::UtilityScripts::OnClickRpc::ClickFlash)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Pun::UtilityScripts::OnClickRpc*), "ClickFlash", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
