// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Security.Cryptography.DSA
#include "System/Security/Cryptography/DSA.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Security::Cryptography
namespace Mono::Security::Cryptography {
}
// Forward declaring namespace: Mono::Math
namespace Mono::Math {
  // Forward declaring type: BigInteger
  class BigInteger;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: RandomNumberGenerator
  class RandomNumberGenerator;
  // Forward declaring type: DSAParameters
  struct DSAParameters;
}
// Completed forward declares
// Type namespace: Mono.Security.Cryptography
namespace Mono::Security::Cryptography {
  // Autogenerated type: Mono.Security.Cryptography.DSAManaged
  class DSAManaged : public System::Security::Cryptography::DSA {
    public:
    // Nested type: Mono::Security::Cryptography::DSAManaged::KeyGeneratedEventHandler
    class KeyGeneratedEventHandler;
    // private System.Boolean keypairGenerated
    // Offset: 0x20
    bool keypairGenerated;
    // private System.Boolean m_disposed
    // Offset: 0x21
    bool m_disposed;
    // private Mono.Math.BigInteger p
    // Offset: 0x28
    Mono::Math::BigInteger* p;
    // private Mono.Math.BigInteger q
    // Offset: 0x30
    Mono::Math::BigInteger* q;
    // private Mono.Math.BigInteger g
    // Offset: 0x38
    Mono::Math::BigInteger* g;
    // private Mono.Math.BigInteger x
    // Offset: 0x40
    Mono::Math::BigInteger* x;
    // private Mono.Math.BigInteger y
    // Offset: 0x48
    Mono::Math::BigInteger* y;
    // private Mono.Math.BigInteger j
    // Offset: 0x50
    Mono::Math::BigInteger* j;
    // private Mono.Math.BigInteger seed
    // Offset: 0x58
    Mono::Math::BigInteger* seed;
    // private System.Int32 counter
    // Offset: 0x60
    int counter;
    // private System.Boolean j_missing
    // Offset: 0x64
    bool j_missing;
    // private System.Security.Cryptography.RandomNumberGenerator rng
    // Offset: 0x68
    System::Security::Cryptography::RandomNumberGenerator* rng;
    // private Mono.Security.Cryptography.DSAManaged/KeyGeneratedEventHandler KeyGenerated
    // Offset: 0x70
    Mono::Security::Cryptography::DSAManaged::KeyGeneratedEventHandler* KeyGenerated;
    // public System.Void .ctor(System.Int32 dwKeySize)
    // Offset: 0x15AE070
    static DSAManaged* New_ctor(int dwKeySize);
    // private System.Void Generate()
    // Offset: 0x15AE1DC
    void Generate();
    // private System.Void GenerateKeyPair()
    // Offset: 0x15AE858
    void GenerateKeyPair();
    // private System.Void add(System.Byte[] a, System.Byte[] b, System.Int32 value)
    // Offset: 0x15AED8C
    void add(::Array<uint8_t>* a, ::Array<uint8_t>* b, int value);
    // private System.Void GenerateParams(System.Int32 keyLength)
    // Offset: 0x15AE22C
    void GenerateParams(int keyLength);
    // private System.Security.Cryptography.RandomNumberGenerator get_Random()
    // Offset: 0x15AEE40
    System::Security::Cryptography::RandomNumberGenerator* get_Random();
    // public System.Boolean get_PublicOnly()
    // Offset: 0x15AEEA8
    bool get_PublicOnly();
    // private System.Byte[] NormalizeArray(System.Byte[] array)
    // Offset: 0x15AEF30
    ::Array<uint8_t>* NormalizeArray(::Array<uint8_t>* array);
    // public System.Void add_KeyGenerated(Mono.Security.Cryptography.DSAManaged/KeyGeneratedEventHandler value)
    // Offset: 0x15AFDD0
    void add_KeyGenerated(Mono::Security::Cryptography::DSAManaged::KeyGeneratedEventHandler* value);
    // public System.Void remove_KeyGenerated(Mono.Security.Cryptography.DSAManaged/KeyGeneratedEventHandler value)
    // Offset: 0x15AFE74
    void remove_KeyGenerated(Mono::Security::Cryptography::DSAManaged::KeyGeneratedEventHandler* value);
    // protected override System.Void Finalize()
    // Offset: 0x15AE168
    // Implemented from: System.Object
    // Base method: System.Void Object::Finalize()
    void Finalize();
    // public override System.Int32 get_KeySize()
    // Offset: 0x15AEE7C
    // Implemented from: System.Security.Cryptography.AsymmetricAlgorithm
    // Base method: System.Int32 AsymmetricAlgorithm::get_KeySize()
    int get_KeySize();
    // public override System.Security.Cryptography.DSAParameters ExportParameters(System.Boolean includePrivateParameters)
    // Offset: 0x15AEFE4
    // Implemented from: System.Security.Cryptography.DSA
    // Base method: System.Security.Cryptography.DSAParameters DSA::ExportParameters(System.Boolean includePrivateParameters)
    System::Security::Cryptography::DSAParameters ExportParameters(bool includePrivateParameters);
    // public override System.Void ImportParameters(System.Security.Cryptography.DSAParameters parameters)
    // Offset: 0x15AF2D8
    // Implemented from: System.Security.Cryptography.DSA
    // Base method: System.Void DSA::ImportParameters(System.Security.Cryptography.DSAParameters parameters)
    void ImportParameters(System::Security::Cryptography::DSAParameters parameters);
    // public override System.Boolean VerifySignature(System.Byte[] rgbHash, System.Byte[] rgbSignature)
    // Offset: 0x15AF638
    // Implemented from: System.Security.Cryptography.DSA
    // Base method: System.Boolean DSA::VerifySignature(System.Byte[] rgbHash, System.Byte[] rgbSignature)
    bool VerifySignature(::Array<uint8_t>* rgbHash, ::Array<uint8_t>* rgbSignature);
    // protected override System.Void Dispose(System.Boolean disposing)
    // Offset: 0x15AFB10
    // Implemented from: System.Security.Cryptography.AsymmetricAlgorithm
    // Base method: System.Void AsymmetricAlgorithm::Dispose(System.Boolean disposing)
    void Dispose(bool disposing);
  }; // Mono.Security.Cryptography.DSAManaged
  check_size<sizeof(DSAManaged), 112 + sizeof(void*) + ((112 + sizeof(void*)) % 8 != 0 ? (8 - (112 + sizeof(void*)) % 8) : 0)> __Mono_Security_Cryptography_DSAManagedSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Mono::Security::Cryptography::DSAManaged*, "Mono.Security.Cryptography", "DSAManaged");
#pragma pack(pop)
