// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Security.Cryptography.RSA
#include "System/Security/Cryptography/RSA.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Security::Cryptography
namespace Mono::Security::Cryptography {
}
// Forward declaring namespace: Mono::Math
namespace Mono::Math {
  // Forward declaring type: BigInteger
  class BigInteger;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: RSAParameters
  struct RSAParameters;
}
// Completed forward declares
// Type namespace: Mono.Security.Cryptography
namespace Mono::Security::Cryptography {
  // Autogenerated type: Mono.Security.Cryptography.RSAManaged
  class RSAManaged : public System::Security::Cryptography::RSA {
    public:
    // Nested type: Mono::Security::Cryptography::RSAManaged::KeyGeneratedEventHandler
    class KeyGeneratedEventHandler;
    // private System.Boolean isCRTpossible
    // Offset: 0x20
    bool isCRTpossible;
    // private System.Boolean keypairGenerated
    // Offset: 0x21
    bool keypairGenerated;
    // private System.Boolean m_disposed
    // Offset: 0x22
    bool m_disposed;
    // private Mono.Math.BigInteger d
    // Offset: 0x28
    Mono::Math::BigInteger* d;
    // private Mono.Math.BigInteger p
    // Offset: 0x30
    Mono::Math::BigInteger* p;
    // private Mono.Math.BigInteger q
    // Offset: 0x38
    Mono::Math::BigInteger* q;
    // private Mono.Math.BigInteger dp
    // Offset: 0x40
    Mono::Math::BigInteger* dp;
    // private Mono.Math.BigInteger dq
    // Offset: 0x48
    Mono::Math::BigInteger* dq;
    // private Mono.Math.BigInteger qInv
    // Offset: 0x50
    Mono::Math::BigInteger* qInv;
    // private Mono.Math.BigInteger n
    // Offset: 0x58
    Mono::Math::BigInteger* n;
    // private Mono.Math.BigInteger e
    // Offset: 0x60
    Mono::Math::BigInteger* e;
    // private Mono.Security.Cryptography.RSAManaged/KeyGeneratedEventHandler KeyGenerated
    // Offset: 0x68
    Mono::Security::Cryptography::RSAManaged::KeyGeneratedEventHandler* KeyGenerated;
    // private System.Void GenerateKeyPair()
    // Offset: 0x17B6258
    void GenerateKeyPair();
    // public System.Boolean get_PublicOnly()
    // Offset: 0x17B69A4
    bool get_PublicOnly();
    // private System.Byte[] GetPaddedValue(Mono.Math.BigInteger value, System.Int32 length)
    // Offset: 0x17B6E10
    ::Array<uint8_t>* GetPaddedValue(Mono::Math::BigInteger* value, int length);
    // public override System.Security.Cryptography.RSAParameters ExportParameters(System.Boolean includePrivateParameters)
    // Offset: 0x17B6A68
    // Implemented from: System.Security.Cryptography.RSA
    // Base method: System.Security.Cryptography.RSAParameters RSA::ExportParameters(System.Boolean includePrivateParameters)
    System::Security::Cryptography::RSAParameters ExportParameters(bool includePrivateParameters);
    // public override System.Void ImportParameters(System.Security.Cryptography.RSAParameters parameters)
    // Offset: 0x17B6ED0
    // Implemented from: System.Security.Cryptography.RSA
    // Base method: System.Void RSA::ImportParameters(System.Security.Cryptography.RSAParameters parameters)
    void ImportParameters(System::Security::Cryptography::RSAParameters parameters);
  }; // Mono.Security.Cryptography.RSAManaged
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Mono::Security::Cryptography::RSAManaged*, "Mono.Security.Cryptography", "RSAManaged");
#pragma pack(pop)
