// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputAction
  class InputAction;
  // Forward declaring type: CallbackContext
  struct InputAction_CallbackContext;
}
// Forward declaring namespace: UnityEngine::InputSystem::XR
namespace UnityEngine::InputSystem::XR {
  // Skipping declaration: TrackingType because it is already included!
  // Skipping declaration: UpdateType because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.XR
namespace UnityEngine::InputSystem::XR {
  // Forward declaring type: TrackedPoseDriver
  class TrackedPoseDriver;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::XR::TrackedPoseDriver);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::XR::TrackedPoseDriver*, "UnityEngine.InputSystem.XR", "TrackedPoseDriver");
// Type namespace: UnityEngine.InputSystem.XR
namespace UnityEngine::InputSystem::XR {
  // Size: 0x4E
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.XR.TrackedPoseDriver
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 9581D0
  class TrackedPoseDriver : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType
    struct TrackingType;
    // Nested type: ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType
    struct UpdateType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackingType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TrackingType
      constexpr TrackingType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType RotationAndPosition
      static constexpr const int RotationAndPosition = 0;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType RotationAndPosition
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType _get_RotationAndPosition();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType RotationAndPosition
      static void _set_RotationAndPosition(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType RotationOnly
      static constexpr const int RotationOnly = 1;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType RotationOnly
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType _get_RotationOnly();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType RotationOnly
      static void _set_RotationOnly(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType PositionOnly
      static constexpr const int PositionOnly = 2;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType PositionOnly
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType _get_PositionOnly();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType PositionOnly
      static void _set_PositionOnly(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType
    #pragma pack(pop)
    static check_size<sizeof(TrackedPoseDriver::TrackingType), 0 + sizeof(int)> __UnityEngine_InputSystem_XR_TrackedPoseDriver_TrackingTypeSizeCheck;
    static_assert(sizeof(TrackedPoseDriver::TrackingType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateType
      constexpr UpdateType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType UpdateAndBeforeRender
      static constexpr const int UpdateAndBeforeRender = 0;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType UpdateAndBeforeRender
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType _get_UpdateAndBeforeRender();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType UpdateAndBeforeRender
      static void _set_UpdateAndBeforeRender(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType Update
      static constexpr const int Update = 1;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType Update
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType _get_Update();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType Update
      static void _set_Update(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType BeforeRender
      static constexpr const int BeforeRender = 2;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType BeforeRender
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType _get_BeforeRender();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType BeforeRender
      static void _set_BeforeRender(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType
    #pragma pack(pop)
    static check_size<sizeof(TrackedPoseDriver::UpdateType), 0 + sizeof(int)> __UnityEngine_InputSystem_XR_TrackedPoseDriver_UpdateTypeSizeCheck;
    static_assert(sizeof(TrackedPoseDriver::UpdateType) == 0x4);
    public:
    // private UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType m_TrackingType
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType m_TrackingType;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType) == 0x4);
    // private UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType m_UpdateType
    // Size: 0x4
    // Offset: 0x1C
    ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType m_UpdateType;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType) == 0x4);
    // private UnityEngine.InputSystem.InputAction m_PositionAction
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::InputSystem::InputAction* m_PositionAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputAction*) == 0x8);
    // private UnityEngine.InputSystem.InputAction m_RotationAction
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::InputSystem::InputAction* m_RotationAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputAction*) == 0x8);
    // private UnityEngine.Vector3 m_CurrentPosition
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Vector3 m_CurrentPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_CurrentRotation
    // Size: 0x10
    // Offset: 0x3C
    ::UnityEngine::Quaternion m_CurrentRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Boolean m_RotationBound
    // Size: 0x1
    // Offset: 0x4C
    bool m_RotationBound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_PositionBound
    // Size: 0x1
    // Offset: 0x4D
    bool m_PositionBound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType m_TrackingType
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType& dyn_m_TrackingType();
    // Get instance field reference: private UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType m_UpdateType
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType& dyn_m_UpdateType();
    // Get instance field reference: private UnityEngine.InputSystem.InputAction m_PositionAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputAction*& dyn_m_PositionAction();
    // Get instance field reference: private UnityEngine.InputSystem.InputAction m_RotationAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputAction*& dyn_m_RotationAction();
    // Get instance field reference: private UnityEngine.Vector3 m_CurrentPosition
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_CurrentPosition();
    // Get instance field reference: private UnityEngine.Quaternion m_CurrentRotation
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_m_CurrentRotation();
    // Get instance field reference: private System.Boolean m_RotationBound
    [[deprecated("Use field access instead!")]] bool& dyn_m_RotationBound();
    // Get instance field reference: private System.Boolean m_PositionBound
    [[deprecated("Use field access instead!")]] bool& dyn_m_PositionBound();
    // public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType get_trackingType()
    // Offset: 0x1B58E8C
    ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType get_trackingType();
    // public System.Void set_trackingType(UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.TrackingType value)
    // Offset: 0x1B58E94
    void set_trackingType(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType value);
    // public UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType get_updateType()
    // Offset: 0x1B58E9C
    ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType get_updateType();
    // public System.Void set_updateType(UnityEngine.InputSystem.XR.TrackedPoseDriver/UnityEngine.InputSystem.XR.UpdateType value)
    // Offset: 0x1B58EA4
    void set_updateType(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType value);
    // public UnityEngine.InputSystem.InputAction get_positionAction()
    // Offset: 0x1B58EAC
    ::UnityEngine::InputSystem::InputAction* get_positionAction();
    // public System.Void set_positionAction(UnityEngine.InputSystem.InputAction value)
    // Offset: 0x1B58EB4
    void set_positionAction(::UnityEngine::InputSystem::InputAction* value);
    // public UnityEngine.InputSystem.InputAction get_rotationAction()
    // Offset: 0x1B58FC0
    ::UnityEngine::InputSystem::InputAction* get_rotationAction();
    // public System.Void set_rotationAction(UnityEngine.InputSystem.InputAction value)
    // Offset: 0x1B58FC8
    void set_rotationAction(::UnityEngine::InputSystem::InputAction* value);
    // public System.Void .ctor()
    // Offset: 0x1B59890
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TrackedPoseDriver* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::InputSystem::XR::TrackedPoseDriver::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TrackedPoseDriver*, creationType>()));
    }
    // private System.Void BindActions()
    // Offset: 0x1B58F9C
    void BindActions();
    // private System.Void BindPosition()
    // Offset: 0x1B590B0
    void BindPosition();
    // private System.Void BindRotation()
    // Offset: 0x1B591B8
    void BindRotation();
    // private System.Void UnbindActions()
    // Offset: 0x1B592C0
    void UnbindActions();
    // private System.Void UnbindPosition()
    // Offset: 0x1B58EE8
    void UnbindPosition();
    // private System.Void UnbindRotation()
    // Offset: 0x1B58FFC
    void UnbindRotation();
    // private System.Void OnPositionUpdate(UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext context)
    // Offset: 0x1B592E4
    void OnPositionUpdate(::UnityEngine::InputSystem::InputAction_CallbackContext context);
    // private System.Void OnRotationUpdate(UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext context)
    // Offset: 0x1B5934C
    void OnRotationUpdate(::UnityEngine::InputSystem::InputAction_CallbackContext context);
    // protected System.Void Awake()
    // Offset: 0x1B593B4
    void Awake();
    // protected System.Void OnEnable()
    // Offset: 0x1B59504
    void OnEnable();
    // private System.Void OnDisable()
    // Offset: 0x1B595A8
    void OnDisable();
    // protected System.Void OnDestroy()
    // Offset: 0x1B5964C
    void OnDestroy();
    // protected System.Void UpdateCallback()
    // Offset: 0x1B596EC
    void UpdateCallback();
    // protected System.Void OnUpdate()
    // Offset: 0x1B5975C
    void OnUpdate();
    // protected System.Void OnBeforeRender()
    // Offset: 0x1B59778
    void OnBeforeRender();
    // protected System.Void SetLocalTransform(UnityEngine.Vector3 newPosition, UnityEngine.Quaternion newRotation)
    // Offset: 0x1B59798
    void SetLocalTransform(::UnityEngine::Vector3 newPosition, ::UnityEngine::Quaternion newRotation);
    // private System.Boolean HasStereoCamera()
    // Offset: 0x1B59454
    bool HasStereoCamera();
    // protected System.Void PerformUpdate()
    // Offset: 0x1B59874
    void PerformUpdate();
  }; // UnityEngine.InputSystem.XR.TrackedPoseDriver
  #pragma pack(pop)
  static check_size<sizeof(TrackedPoseDriver), 77 + sizeof(bool)> __UnityEngine_InputSystem_XR_TrackedPoseDriverSizeCheck;
  static_assert(sizeof(TrackedPoseDriver) == 0x4E);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType, "UnityEngine.InputSystem.XR", "TrackedPoseDriver/UpdateType");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType, "UnityEngine.InputSystem.XR", "TrackedPoseDriver/TrackingType");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::InputSystem::XR::TrackedPoseDriver::get_trackingType
// Il2CppName: get_trackingType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType (UnityEngine::InputSystem::XR::TrackedPoseDriver::*)()>(&UnityEngine::InputSystem::XR::TrackedPoseDriver::get_trackingType)> {
  static const MethodInfo* get() {
