// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: BeatSaberAPI.DataTransferObjects
namespace BeatSaberAPI::DataTransferObjects {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: BeatSaberAPI.DataTransferObjects.LevelScoreResult
  class LevelScoreResult : public ::Il2CppObject {
    public:
    // Nested type: BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers
    struct GameplayModifiers;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers
    struct GameplayModifiers/*, public System::Enum*/ {
      public:
      // public System.UInt32 value__
      // Size: 0x4
      // Offset: 0x0
      uint value;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // Creating value type constructor for type: GameplayModifiers
      constexpr GameplayModifiers(uint value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator uint
      constexpr operator uint() const noexcept {
        return value;
      }
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers None
      static constexpr const uint None = 0u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers None
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_None();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers None
      static void _set_None(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers InstaFail
      static constexpr const uint InstaFail = 2u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers InstaFail
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_InstaFail();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers InstaFail
      static void _set_InstaFail(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers FailOnSaberClash
      static constexpr const uint FailOnSaberClash = 4u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers FailOnSaberClash
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_FailOnSaberClash();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers FailOnSaberClash
      static void _set_FailOnSaberClash(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers FastNotes
      static constexpr const uint FastNotes = 8u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers FastNotes
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_FastNotes();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers FastNotes
      static void _set_FastNotes(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers DisappearingArrows
      static constexpr const uint DisappearingArrows = 16u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers DisappearingArrows
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_DisappearingArrows();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers DisappearingArrows
      static void _set_DisappearingArrows(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers NoBombs
      static constexpr const uint NoBombs = 32u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers NoBombs
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_NoBombs();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers NoBombs
      static void _set_NoBombs(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SongSpeedFaster
      static constexpr const uint SongSpeedFaster = 64u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SongSpeedFaster
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_SongSpeedFaster();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SongSpeedFaster
      static void _set_SongSpeedFaster(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SongSpeedSlower
      static constexpr const uint SongSpeedSlower = 128u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SongSpeedSlower
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_SongSpeedSlower();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SongSpeedSlower
      static void _set_SongSpeedSlower(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers EnabledObstacleTypeFullHeightOnly
      static constexpr const uint EnabledObstacleTypeFullHeightOnly = 256u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers EnabledObstacleTypeFullHeightOnly
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_EnabledObstacleTypeFullHeightOnly();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers EnabledObstacleTypeFullHeightOnly
      static void _set_EnabledObstacleTypeFullHeightOnly(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers EnabledObstacleTypeNoObstacles
      static constexpr const uint EnabledObstacleTypeNoObstacles = 512u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers EnabledObstacleTypeNoObstacles
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_EnabledObstacleTypeNoObstacles();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers EnabledObstacleTypeNoObstacles
      static void _set_EnabledObstacleTypeNoObstacles(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers EnergyTypeBattery
      static constexpr const uint EnergyTypeBattery = 1024u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers EnergyTypeBattery
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_EnergyTypeBattery();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers EnergyTypeBattery
      static void _set_EnergyTypeBattery(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers StrictAngles
      static constexpr const uint StrictAngles = 2048u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers StrictAngles
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_StrictAngles();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers StrictAngles
      static void _set_StrictAngles(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers NoArrows
      static constexpr const uint NoArrows = 4096u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers NoArrows
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_NoArrows();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers NoArrows
      static void _set_NoArrows(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers GhostNotes
      static constexpr const uint GhostNotes = 8192u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers GhostNotes
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_GhostNotes();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers GhostNotes
      static void _set_GhostNotes(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers NoFailOn0Energy
      static constexpr const uint NoFailOn0Energy = 16384u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers NoFailOn0Energy
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_NoFailOn0Energy();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers NoFailOn0Energy
      static void _set_NoFailOn0Energy(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SongSpeedSuperFast
      static constexpr const uint SongSpeedSuperFast = 32768u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SongSpeedSuperFast
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_SongSpeedSuperFast();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SongSpeedSuperFast
      static void _set_SongSpeedSuperFast(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers ProMode
      static constexpr const uint ProMode = 65536u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers ProMode
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_ProMode();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers ProMode
      static void _set_ProMode(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers ZenMode
      static constexpr const uint ZenMode = 131072u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers ZenMode
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_ZenMode();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers ZenMode
      static void _set_ZenMode(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SmallCubes
      static constexpr const uint SmallCubes = 262144u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SmallCubes
      static BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_SmallCubes();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers SmallCubes
      static void _set_SmallCubes(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
    }; // BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers
    #pragma pack(pop)
    static check_size<sizeof(LevelScoreResult::GameplayModifiers), 0 + sizeof(uint)> __BeatSaberAPI_DataTransferObjects_LevelScoreResult_GameplayModifiersSizeCheck;
    static_assert(sizeof(LevelScoreResult::GameplayModifiers) == 0x4);
    // public System.String leaderboardId
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* leaderboardId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.Int32 rawScore
    // Size: 0x4
    // Offset: 0x18
    int rawScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 modifiedScore
    // Size: 0x4
    // Offset: 0x1C
    int modifiedScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean fullCombo
    // Size: 0x1
    // Offset: 0x20
    bool fullCombo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fullCombo and: goodCutsCount
    char __padding3[0x3] = {};
    // public System.Int32 goodCutsCount
    // Size: 0x4
    // Offset: 0x24
    int goodCutsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 badCutsCount
    // Size: 0x4
    // Offset: 0x28
    int badCutsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 missedCount
    // Size: 0x4
    // Offset: 0x2C
    int missedCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 maxCombo
    // Size: 0x4
    // Offset: 0x30
    int maxCombo;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: maxCombo and: gameplayModifiers
    char __padding7[0x4] = {};
    // public BeatSaberAPI.DataTransferObjects.LevelScoreResult/GameplayModifiers[] gameplayModifiers
    // Size: 0x8
    // Offset: 0x38
    ::Array<BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers>* gameplayModifiers;
    // Field size check
    static_assert(sizeof(::Array<BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers>*) == 0x8);
    // public System.String deviceModel
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* deviceModel;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String extraDataBase64
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* extraDataBase64;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: LevelScoreResult
    LevelScoreResult(::Il2CppString* leaderboardId_ = {}, int rawScore_ = {}, int modifiedScore_ = {}, bool fullCombo_ = {}, int goodCutsCount_ = {}, int badCutsCount_ = {}, int missedCount_ = {}, int maxCombo_ = {}, ::Array<BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers>* gameplayModifiers_ = {}, ::Il2CppString* deviceModel_ = {}, ::Il2CppString* extraDataBase64_ = {}) noexcept : leaderboardId{leaderboardId_}, rawScore{rawScore_}, modifiedScore{modifiedScore_}, fullCombo{fullCombo_}, goodCutsCount{goodCutsCount_}, badCutsCount{badCutsCount_}, missedCount{missedCount_}, maxCombo{maxCombo_}, gameplayModifiers{gameplayModifiers_}, deviceModel{deviceModel_}, extraDataBase64{extraDataBase64_} {}
    // public System.Void .ctor()
    // Offset: 0x1066F1C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LevelScoreResult* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("BeatSaberAPI::DataTransferObjects::LevelScoreResult::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LevelScoreResult*, creationType>()));
    }
  }; // BeatSaberAPI.DataTransferObjects.LevelScoreResult
  #pragma pack(pop)
  static check_size<sizeof(LevelScoreResult), 72 + sizeof(::Il2CppString*)> __BeatSaberAPI_DataTransferObjects_LevelScoreResultSizeCheck;
  static_assert(sizeof(LevelScoreResult) == 0x50);
}
DEFINE_IL2CPP_ARG_TYPE(BeatSaberAPI::DataTransferObjects::LevelScoreResult*, "BeatSaberAPI.DataTransferObjects", "LevelScoreResult");
DEFINE_IL2CPP_ARG_TYPE(BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers, "BeatSaberAPI.DataTransferObjects", "LevelScoreResult/GameplayModifiers");
