// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: BeatSaberAPI.DataTransferObjects
namespace BeatSaberAPI::DataTransferObjects {
  // Forward declaring type: LevelScoreResult
  class LevelScoreResult;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::BeatSaberAPI::DataTransferObjects::LevelScoreResult);
DEFINE_IL2CPP_ARG_TYPE(::BeatSaberAPI::DataTransferObjects::LevelScoreResult*, "BeatSaberAPI.DataTransferObjects", "LevelScoreResult");
// Type namespace: BeatSaberAPI.DataTransferObjects
namespace BeatSaberAPI::DataTransferObjects {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: BeatSaberAPI.DataTransferObjects.LevelScoreResult
  // [TokenAttribute] Offset: FFFFFFFF
  class LevelScoreResult : public ::Il2CppObject {
    public:
    // Nested type: ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers
    struct GameplayModifiers;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers
    // [TokenAttribute] Offset: FFFFFFFF
    struct GameplayModifiers/*, public ::System::Enum*/ {
      public:
      public:
      // public System.UInt32 value__
      // Size: 0x4
      // Offset: 0x0
      uint value;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      public:
      // Creating value type constructor for type: GameplayModifiers
      constexpr GameplayModifiers(uint value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator uint
      constexpr operator uint() const noexcept {
        return value;
      }
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers None
      static constexpr const uint None = 0u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers None
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_None();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers None
      static void _set_None(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers InstaFail
      static constexpr const uint InstaFail = 2u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers InstaFail
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_InstaFail();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers InstaFail
      static void _set_InstaFail(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers FailOnSaberClash
      static constexpr const uint FailOnSaberClash = 4u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers FailOnSaberClash
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_FailOnSaberClash();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers FailOnSaberClash
      static void _set_FailOnSaberClash(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers FastNotes
      static constexpr const uint FastNotes = 8u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers FastNotes
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_FastNotes();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers FastNotes
      static void _set_FastNotes(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers DisappearingArrows
      static constexpr const uint DisappearingArrows = 16u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers DisappearingArrows
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_DisappearingArrows();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers DisappearingArrows
      static void _set_DisappearingArrows(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers NoBombs
      static constexpr const uint NoBombs = 32u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers NoBombs
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_NoBombs();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers NoBombs
      static void _set_NoBombs(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SongSpeedFaster
      static constexpr const uint SongSpeedFaster = 64u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SongSpeedFaster
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_SongSpeedFaster();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SongSpeedFaster
      static void _set_SongSpeedFaster(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SongSpeedSlower
      static constexpr const uint SongSpeedSlower = 128u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SongSpeedSlower
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_SongSpeedSlower();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SongSpeedSlower
      static void _set_SongSpeedSlower(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers EnabledObstacleTypeFullHeightOnly
      static constexpr const uint EnabledObstacleTypeFullHeightOnly = 256u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers EnabledObstacleTypeFullHeightOnly
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_EnabledObstacleTypeFullHeightOnly();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers EnabledObstacleTypeFullHeightOnly
      static void _set_EnabledObstacleTypeFullHeightOnly(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers EnabledObstacleTypeNoObstacles
      static constexpr const uint EnabledObstacleTypeNoObstacles = 512u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers EnabledObstacleTypeNoObstacles
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_EnabledObstacleTypeNoObstacles();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers EnabledObstacleTypeNoObstacles
      static void _set_EnabledObstacleTypeNoObstacles(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers EnergyTypeBattery
      static constexpr const uint EnergyTypeBattery = 1024u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers EnergyTypeBattery
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_EnergyTypeBattery();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers EnergyTypeBattery
      static void _set_EnergyTypeBattery(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers StrictAngles
      static constexpr const uint StrictAngles = 2048u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers StrictAngles
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_StrictAngles();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers StrictAngles
      static void _set_StrictAngles(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers NoArrows
      static constexpr const uint NoArrows = 4096u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers NoArrows
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_NoArrows();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers NoArrows
      static void _set_NoArrows(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers GhostNotes
      static constexpr const uint GhostNotes = 8192u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers GhostNotes
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_GhostNotes();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers GhostNotes
      static void _set_GhostNotes(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers NoFailOn0Energy
      static constexpr const uint NoFailOn0Energy = 16384u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers NoFailOn0Energy
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_NoFailOn0Energy();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers NoFailOn0Energy
      static void _set_NoFailOn0Energy(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SongSpeedSuperFast
      static constexpr const uint SongSpeedSuperFast = 32768u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SongSpeedSuperFast
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_SongSpeedSuperFast();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SongSpeedSuperFast
      static void _set_SongSpeedSuperFast(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers ProMode
      static constexpr const uint ProMode = 65536u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers ProMode
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_ProMode();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers ProMode
      static void _set_ProMode(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers ZenMode
      static constexpr const uint ZenMode = 131072u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers ZenMode
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_ZenMode();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers ZenMode
      static void _set_ZenMode(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // static field const value: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SmallCubes
      static constexpr const uint SmallCubes = 262144u;
      // Get static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SmallCubes
      static ::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers _get_SmallCubes();
      // Set static field: static public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers SmallCubes
      static void _set_SmallCubes(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers value);
      // Get instance field reference: public System.UInt32 value__
      uint& dyn_value__();
    }; // BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers
    #pragma pack(pop)
    static check_size<sizeof(LevelScoreResult::GameplayModifiers), 0 + sizeof(uint)> __BeatSaberAPI_DataTransferObjects_LevelScoreResult_GameplayModifiersSizeCheck;
    static_assert(sizeof(LevelScoreResult::GameplayModifiers) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.String leaderboardId
    // Size: 0x8
    // Offset: 0x10
    ::StringW leaderboardId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 multipliedScore
    // Size: 0x4
    // Offset: 0x18
    int multipliedScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 modifiedScore
    // Size: 0x4
    // Offset: 0x1C
    int modifiedScore;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean fullCombo
    // Size: 0x1
    // Offset: 0x20
    bool fullCombo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fullCombo and: goodCutsCount
    char __padding3[0x3] = {};
    // public System.Int32 goodCutsCount
    // Size: 0x4
    // Offset: 0x24
    int goodCutsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 badCutsCount
    // Size: 0x4
    // Offset: 0x28
    int badCutsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 missedCount
    // Size: 0x4
    // Offset: 0x2C
    int missedCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 maxCombo
    // Size: 0x4
    // Offset: 0x30
    int maxCombo;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: maxCombo and: gameplayModifiers
    char __padding7[0x4] = {};
    // public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers[] gameplayModifiers
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers> gameplayModifiers;
    // Field size check
    static_assert(sizeof(::ArrayW<::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers>) == 0x8);
    // public System.String deviceModel
    // Size: 0x8
    // Offset: 0x40
    ::StringW deviceModel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String extraDataBase64
    // Size: 0x8
    // Offset: 0x48
    ::StringW extraDataBase64;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String leaderboardId
    ::StringW& dyn_leaderboardId();
    // Get instance field reference: public System.Int32 multipliedScore
    int& dyn_multipliedScore();
    // Get instance field reference: public System.Int32 modifiedScore
    int& dyn_modifiedScore();
    // Get instance field reference: public System.Boolean fullCombo
    bool& dyn_fullCombo();
    // Get instance field reference: public System.Int32 goodCutsCount
    int& dyn_goodCutsCount();
    // Get instance field reference: public System.Int32 badCutsCount
    int& dyn_badCutsCount();
    // Get instance field reference: public System.Int32 missedCount
    int& dyn_missedCount();
    // Get instance field reference: public System.Int32 maxCombo
    int& dyn_maxCombo();
    // Get instance field reference: public BeatSaberAPI.DataTransferObjects.LevelScoreResult/BeatSaberAPI.DataTransferObjects.GameplayModifiers[] gameplayModifiers
    ::ArrayW<::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers>& dyn_gameplayModifiers();
    // Get instance field reference: public System.String deviceModel
    ::StringW& dyn_deviceModel();
    // Get instance field reference: public System.String extraDataBase64
    ::StringW& dyn_extraDataBase64();
    // public System.Void .ctor()
    // Offset: 0x1371D4C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LevelScoreResult* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::BeatSaberAPI::DataTransferObjects::LevelScoreResult::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LevelScoreResult*, creationType>()));
    }
  }; // BeatSaberAPI.DataTransferObjects.LevelScoreResult
  #pragma pack(pop)
  static check_size<sizeof(LevelScoreResult), 72 + sizeof(::StringW)> __BeatSaberAPI_DataTransferObjects_LevelScoreResultSizeCheck;
  static_assert(sizeof(LevelScoreResult) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::BeatSaberAPI::DataTransferObjects::LevelScoreResult::GameplayModifiers, "BeatSaberAPI.DataTransferObjects", "LevelScoreResult/GameplayModifiers");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: BeatSaberAPI::DataTransferObjects::LevelScoreResult::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
