// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TestTools::TestRunner
namespace UnityEngine::TestTools::TestRunner {
}
// Forward declaring namespace: UnityEngine::TestTools::TestRunner::GUI
namespace UnityEngine::TestTools::TestRunner::GUI {
  // Forward declaring type: RuntimeTestRunnerFilter
  class RuntimeTestRunnerFilter;
}
// Forward declaring namespace: NUnit::Framework::Interfaces
namespace NUnit::Framework::Interfaces {
  // Forward declaring type: ITestFilter
  class ITestFilter;
}
// Completed forward declares
// Type namespace: UnityEngine.TestTools.TestRunner
namespace UnityEngine::TestTools::TestRunner {
  // Forward declaring type: PlaymodeTestsControllerSettings
  class PlaymodeTestsControllerSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::TestTools::TestRunner::PlaymodeTestsControllerSettings);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TestTools::TestRunner::PlaymodeTestsControllerSettings*, "UnityEngine.TestTools.TestRunner", "PlaymodeTestsControllerSettings");
// Type namespace: UnityEngine.TestTools.TestRunner
namespace UnityEngine::TestTools::TestRunner {
  // Size: 0x32
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.TestTools.TestRunner.PlaymodeTestsControllerSettings
  // [TokenAttribute] Offset: FFFFFFFF
  class PlaymodeTestsControllerSettings : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::TestTools::TestRunner::PlaymodeTestsControllerSettings::$$c
    class $$c;
    public:
    // public UnityEngine.TestTools.TestRunner.GUI.RuntimeTestRunnerFilter[] filters
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::UnityEngine::TestTools::TestRunner::GUI::RuntimeTestRunnerFilter*> filters;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::TestTools::TestRunner::GUI::RuntimeTestRunnerFilter*>) == 0x8);
    // public System.Boolean sceneBased
    // Size: 0x1
    // Offset: 0x18
    bool sceneBased;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sceneBased and: originalScene
    char __padding1[0x7] = {};
    // public System.String originalScene
    // Size: 0x8
    // Offset: 0x20
    ::StringW originalScene;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String bootstrapScene
    // Size: 0x8
    // Offset: 0x28
    ::StringW bootstrapScene;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean runInBackgroundValue
    // Size: 0x1
    // Offset: 0x30
    bool runInBackgroundValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean consoleErrorPaused
    // Size: 0x1
    // Offset: 0x31
    bool consoleErrorPaused;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public UnityEngine.TestTools.TestRunner.GUI.RuntimeTestRunnerFilter[] filters
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::TestTools::TestRunner::GUI::RuntimeTestRunnerFilter*>& dyn_filters();
    // Get instance field reference: public System.Boolean sceneBased
    [[deprecated("Use field access instead!")]] bool& dyn_sceneBased();
    // Get instance field reference: public System.String originalScene
    [[deprecated("Use field access instead!")]] ::StringW& dyn_originalScene();
    // Get instance field reference: public System.String bootstrapScene
    [[deprecated("Use field access instead!")]] ::StringW& dyn_bootstrapScene();
    // Get instance field reference: public System.Boolean runInBackgroundValue
    [[deprecated("Use field access instead!")]] bool& dyn_runInBackgroundValue();
    // Get instance field reference: public System.Boolean consoleErrorPaused
    [[deprecated("Use field access instead!")]] bool& dyn_consoleErrorPaused();
    // public System.Void .ctor()
    // Offset: 0x19898EC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PlaymodeTestsControllerSettings* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::TestTools::TestRunner::PlaymodeTestsControllerSettings::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PlaymodeTestsControllerSettings*, creationType>()));
    }
    // NUnit.Framework.Interfaces.ITestFilter BuildNUnitFilter()
    // Offset: 0x1989E0C
    ::NUnit::Framework::Interfaces::ITestFilter* BuildNUnitFilter();
  }; // UnityEngine.TestTools.TestRunner.PlaymodeTestsControllerSettings
  #pragma pack(pop)
  static check_size<sizeof(PlaymodeTestsControllerSettings), 49 + sizeof(bool)> __UnityEngine_TestTools_TestRunner_PlaymodeTestsControllerSettingsSizeCheck;
  static_assert(sizeof(PlaymodeTestsControllerSettings) == 0x32);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::TestTools::TestRunner::PlaymodeTestsControllerSettings::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::TestTools::TestRunner::PlaymodeTestsControllerSettings::BuildNUnitFilter
// Il2CppName: BuildNUnitFilter
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::NUnit::Framework::Interfaces::ITestFilter* (UnityEngine::TestTools::TestRunner::PlaymodeTestsControllerSettings::*)()>(&UnityEngine::TestTools::TestRunner::PlaymodeTestsControllerSettings::BuildNUnitFilter)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TestTools::TestRunner::PlaymodeTestsControllerSettings*), "BuildNUnitFilter", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
