// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Attribute
#include "System/Attribute.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: UnityEngine.Bindings
namespace UnityEngine::Bindings {
  // Size: 0x1C
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Bindings.NativeMethodAttribute
  // [] Offset: FFFFFFFF
  // [AttributeUsageAttribute] Offset: CA3E3C
  // [VisibleToOtherModulesAttribute] Offset: CA3E3C
  class NativeMethodAttribute : public System::Attribute {
    public:
    // [DebuggerBrowsableAttribute] Offset: 0xCA437C
    // [CompilerGeneratedAttribute] Offset: 0xCA437C
    // private System.String <Name>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* Name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xCA43B8
    // [DebuggerBrowsableAttribute] Offset: 0xCA43B8
    // private System.Boolean <IsThreadSafe>k__BackingField
    // Size: 0x1
    // Offset: 0x18
    bool IsThreadSafe;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xCA43F4
    // [DebuggerBrowsableAttribute] Offset: 0xCA43F4
    // private System.Boolean <IsFreeFunction>k__BackingField
    // Size: 0x1
    // Offset: 0x19
    bool IsFreeFunction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [DebuggerBrowsableAttribute] Offset: 0xCA4430
    // [CompilerGeneratedAttribute] Offset: 0xCA4430
    // private System.Boolean <ThrowsException>k__BackingField
    // Size: 0x1
    // Offset: 0x1A
    bool ThrowsException;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [DebuggerBrowsableAttribute] Offset: 0xCA446C
    // [CompilerGeneratedAttribute] Offset: 0xCA446C
    // private System.Boolean <HasExplicitThis>k__BackingField
    // Size: 0x1
    // Offset: 0x1B
    bool HasExplicitThis;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: NativeMethodAttribute
    NativeMethodAttribute(::Il2CppString* Name_ = {}, bool IsThreadSafe_ = {}, bool IsFreeFunction_ = {}, bool ThrowsException_ = {}, bool HasExplicitThis_ = {}) noexcept : Name{Name_}, IsThreadSafe{IsThreadSafe_}, IsFreeFunction{IsFreeFunction_}, ThrowsException{ThrowsException_}, HasExplicitThis{HasExplicitThis_} {}
    // public System.Void set_Name(System.String value)
    // Offset: 0x2181E18
    void set_Name_NEW(::Il2CppString* value);
    // public System.Void set_IsThreadSafe(System.Boolean value)
    // Offset: 0x2181E20
    void set_IsThreadSafe_NEW(bool value);
    // public System.Void set_IsFreeFunction(System.Boolean value)
    // Offset: 0x2181E2C
    void set_IsFreeFunction_NEW(bool value);
    // public System.Void set_ThrowsException(System.Boolean value)
    // Offset: 0x2181E38
    void set_ThrowsException_NEW(bool value);
    // public System.Void set_HasExplicitThis(System.Boolean value)
    // Offset: 0x2181E44
    void set_HasExplicitThis_NEW(bool value);
    // public System.Void .ctor(System.String name)
    // Offset: 0x2181E50
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static NativeMethodAttribute* New_ctor(::Il2CppString* name) {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::Bindings::NativeMethodAttribute::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<NativeMethodAttribute*, creationType>(name)));
    }
    // public System.Void .ctor(System.String name, System.Boolean isFreeFunction)
    // Offset: 0x2181C24
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static NativeMethodAttribute* New_ctor(::Il2CppString* name, bool isFreeFunction) {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::Bindings::NativeMethodAttribute::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<NativeMethodAttribute*, creationType>(name, isFreeFunction)));
    }
    // public System.Void .ctor(System.String name, System.Boolean isFreeFunction, System.Boolean isThreadSafe)
    // Offset: 0x2181C84
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static NativeMethodAttribute* New_ctor(::Il2CppString* name, bool isFreeFunction, bool isThreadSafe) {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::Bindings::NativeMethodAttribute::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<NativeMethodAttribute*, creationType>(name, isFreeFunction, isThreadSafe)));
    }
    // public System.Void .ctor()
    // Offset: 0x2181BF4
    // Implemented from: System.Attribute
    // Base method: System.Void Attribute::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static NativeMethodAttribute* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::Bindings::NativeMethodAttribute::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<NativeMethodAttribute*, creationType>()));
    }
  }; // UnityEngine.Bindings.NativeMethodAttribute
  #pragma pack(pop)
  static check_size<sizeof(NativeMethodAttribute), 27 + sizeof(bool)> __UnityEngine_Bindings_NativeMethodAttributeSizeCheck;
  static_assert(sizeof(NativeMethodAttribute) == 0x1C);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Bindings::NativeMethodAttribute*, "UnityEngine.Bindings", "NativeMethodAttribute");
