// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Decoder
  class Decoder;
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Decimal
  struct Decimal;
}
// Completed forward declares
// Type namespace: System.IO
namespace System::IO {
  // Size: 0x47
  #pragma pack(push, 1)
  // Autogenerated type: System.IO.BinaryReader
  // [] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: C95020
  class BinaryReader : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // private System.IO.Stream m_stream
    // Size: 0x8
    // Offset: 0x10
    System::IO::Stream* m_stream;
    // Field size check
    static_assert(sizeof(System::IO::Stream*) == 0x8);
    // private System.Byte[] m_buffer
    // Size: 0x8
    // Offset: 0x18
    ::Array<uint8_t>* m_buffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Text.Decoder m_decoder
    // Size: 0x8
    // Offset: 0x20
    System::Text::Decoder* m_decoder;
    // Field size check
    static_assert(sizeof(System::Text::Decoder*) == 0x8);
    // private System.Byte[] m_charBytes
    // Size: 0x8
    // Offset: 0x28
    ::Array<uint8_t>* m_charBytes;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Char[] m_singleChar
    // Size: 0x8
    // Offset: 0x30
    ::Array<::Il2CppChar>* m_singleChar;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppChar>*) == 0x8);
    // private System.Char[] m_charBuffer
    // Size: 0x8
    // Offset: 0x38
    ::Array<::Il2CppChar>* m_charBuffer;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppChar>*) == 0x8);
    // private System.Int32 m_maxCharsSize
    // Size: 0x4
    // Offset: 0x40
    int m_maxCharsSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_2BytesPerChar
    // Size: 0x1
    // Offset: 0x44
    bool m_2BytesPerChar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_isMemoryStream
    // Size: 0x1
    // Offset: 0x45
    bool m_isMemoryStream;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_leaveOpen
    // Size: 0x1
    // Offset: 0x46
    bool m_leaveOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: BinaryReader
    BinaryReader(System::IO::Stream* m_stream_ = {}, ::Array<uint8_t>* m_buffer_ = {}, System::Text::Decoder* m_decoder_ = {}, ::Array<uint8_t>* m_charBytes_ = {}, ::Array<::Il2CppChar>* m_singleChar_ = {}, ::Array<::Il2CppChar>* m_charBuffer_ = {}, int m_maxCharsSize_ = {}, bool m_2BytesPerChar_ = {}, bool m_isMemoryStream_ = {}, bool m_leaveOpen_ = {}) noexcept : m_stream{m_stream_}, m_buffer{m_buffer_}, m_decoder{m_decoder_}, m_charBytes{m_charBytes_}, m_singleChar{m_singleChar_}, m_charBuffer{m_charBuffer_}, m_maxCharsSize{m_maxCharsSize_}, m_2BytesPerChar{m_2BytesPerChar_}, m_isMemoryStream{m_isMemoryStream_}, m_leaveOpen{m_leaveOpen_} {}
    // Creating interface conversion operator: operator System::IDisposable
    operator System::IDisposable() noexcept {
      return *reinterpret_cast<System::IDisposable*>(this);
    }
    // public System.Void .ctor(System.IO.Stream input)
    // Offset: 0x189F8FC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BinaryReader* New_ctor(System::IO::Stream* input) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::IO::BinaryReader::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BinaryReader*, creationType>(input)));
    }
    // public System.Void .ctor(System.IO.Stream input, System.Text.Encoding encoding)
    // Offset: 0x189FBC8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BinaryReader* New_ctor(System::IO::Stream* input, System::Text::Encoding* encoding) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::IO::BinaryReader::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BinaryReader*, creationType>(input, encoding)));
    }
    // public System.Void .ctor(System.IO.Stream input, System.Text.Encoding encoding, System.Boolean leaveOpen)
    // Offset: 0x189F974
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BinaryReader* New_ctor(System::IO::Stream* input, System::Text::Encoding* encoding, bool leaveOpen) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::IO::BinaryReader::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BinaryReader*, creationType>(input, encoding, leaveOpen)));
    }
    // public System.IO.Stream get_BaseStream()
    // Offset: 0x189FBD0
    System::IO::Stream* get_BaseStream_NEW();
    // public System.Void Close()
    // Offset: 0x189FBD8
    void Close_NEW();
    // protected System.Void Dispose(System.Boolean disposing)
    // Offset: 0x189FBE8
    void Dispose_NEW(bool disposing);
    // public System.Void Dispose()
    // Offset: 0x189FC38
    void Dispose_NEW();
    // public System.Int32 Read()
    // Offset: 0x189FC48
    int Read_NEW();
    // public System.Boolean ReadBoolean()
    // Offset: 0x189FEF4
    bool ReadBoolean_NEW();
    // public System.Byte ReadByte()
    // Offset: 0x189FF50
    uint8_t ReadByte_NEW();
    // public System.SByte ReadSByte()
    // Offset: 0x189FFAC
    int8_t ReadSByte_NEW();
    // public System.Char ReadChar()
    // Offset: 0x18A0000
    ::Il2CppChar ReadChar_NEW();
    // public System.Int16 ReadInt16()
    // Offset: 0x18A003C
    int16_t ReadInt16_NEW();
    // public System.UInt16 ReadUInt16()
    // Offset: 0x18A0098
    uint16_t ReadUInt16_NEW();
    // public System.Int32 ReadInt32()
    // Offset: 0x18A00F4
    int ReadInt32_NEW();
    // public System.UInt32 ReadUInt32()
    // Offset: 0x18A0200
    uint ReadUInt32_NEW();
    // public System.Int64 ReadInt64()
    // Offset: 0x18A0284
    int64_t ReadInt64_NEW();
    // public System.UInt64 ReadUInt64()
    // Offset: 0x18A0348
    uint64_t ReadUInt64_NEW();
    // public System.Single ReadSingle()
    // Offset: 0x18A040C
    float ReadSingle_NEW();
    // public System.Double ReadDouble()
    // Offset: 0x18A0448
    double ReadDouble_NEW();
    // public System.Decimal ReadDecimal()
    // Offset: 0x18A0484
    System::Decimal ReadDecimal_NEW();
    // public System.String ReadString()
    // Offset: 0x18A05D8
    ::Il2CppString* ReadString_NEW();
    // private System.Int32 InternalReadChars(System.Char[] buffer, System.Int32 index, System.Int32 count)
    // Offset: 0x18A0930
    int InternalReadChars(::Array<::Il2CppChar>* buffer, int index, int count);
    // private System.Int32 InternalReadOneChar()
    // Offset: 0x189FC78
    int InternalReadOneChar();
    // public System.Char[] ReadChars(System.Int32 count)
    // Offset: 0x18A0C0C
    ::Array<::Il2CppChar>* ReadChars_NEW(int count);
    // public System.Int32 Read(System.Byte[] buffer, System.Int32 index, System.Int32 count)
    // Offset: 0x18A0D6C
    int Read_NEW(::Array<uint8_t>* buffer, int index, int count);
    // public System.Byte[] ReadBytes(System.Int32 count)
    // Offset: 0x18A0F34
    ::Array<uint8_t>* ReadBytes_NEW(int count);
    // protected System.Void FillBuffer(System.Int32 numBytes)
    // Offset: 0x18A10CC
    void FillBuffer_NEW(int numBytes);
    // protected internal System.Int32 Read7BitEncodedInt()
    // Offset: 0x18A0860
    int Read7BitEncodedInt();
  }; // System.IO.BinaryReader
  #pragma pack(pop)
  static check_size<sizeof(BinaryReader), 70 + sizeof(bool)> __System_IO_BinaryReaderSizeCheck;
  static_assert(sizeof(BinaryReader) == 0x47);
}
DEFINE_IL2CPP_ARG_TYPE(System::IO::BinaryReader*, "System.IO", "BinaryReader");
