// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: FileSystemWatcher
  class FileSystemWatcher;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Completed forward declares
// Type namespace: System.IO
namespace System::IO {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: System.IO.DefaultWatcherData
  class DefaultWatcherData : public ::Il2CppObject {
    public:
    // public System.IO.FileSystemWatcher FSW
    // Size: 0x8
    // Offset: 0x10
    System::IO::FileSystemWatcher* FSW;
    // Field size check
    static_assert(sizeof(System::IO::FileSystemWatcher*) == 0x8);
    // public System.String Directory
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* Directory;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String FileMask
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* FileMask;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.Boolean IncludeSubdirs
    // Size: 0x1
    // Offset: 0x28
    bool IncludeSubdirs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean Enabled
    // Size: 0x1
    // Offset: 0x29
    bool Enabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean NoWildcards
    // Size: 0x1
    // Offset: 0x2A
    bool NoWildcards;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NoWildcards and: DisabledTime
    char __padding5[0x5] = {};
    // public System.DateTime DisabledTime
    // Size: 0x8
    // Offset: 0x30
    System::DateTime DisabledTime;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // public System.Object FilesLock
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppObject* FilesLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public System.Collections.Hashtable Files
    // Size: 0x8
    // Offset: 0x40
    System::Collections::Hashtable* Files;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // Creating value type constructor for type: DefaultWatcherData
    DefaultWatcherData(System::IO::FileSystemWatcher* FSW_ = {}, ::Il2CppString* Directory_ = {}, ::Il2CppString* FileMask_ = {}, bool IncludeSubdirs_ = {}, bool Enabled_ = {}, bool NoWildcards_ = {}, System::DateTime DisabledTime_ = {}, ::Il2CppObject* FilesLock_ = {}, System::Collections::Hashtable* Files_ = {}) noexcept : FSW{FSW_}, Directory{Directory_}, FileMask{FileMask_}, IncludeSubdirs{IncludeSubdirs_}, Enabled{Enabled_}, NoWildcards{NoWildcards_}, DisabledTime{DisabledTime_}, FilesLock{FilesLock_}, Files{Files_} {}
    // public System.Void .ctor()
    // Offset: 0x16D4CB0
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DefaultWatcherData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("System::IO::DefaultWatcherData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DefaultWatcherData*, creationType>()));
    }
  }; // System.IO.DefaultWatcherData
  #pragma pack(pop)
  static check_size<sizeof(DefaultWatcherData), 64 + sizeof(System::Collections::Hashtable*)> __System_IO_DefaultWatcherDataSizeCheck;
  static_assert(sizeof(DefaultWatcherData) == 0x48);
}
DEFINE_IL2CPP_ARG_TYPE(System::IO::DefaultWatcherData*, "System.IO", "DefaultWatcherData");
