// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
// Including type: System.IO.FileAccess
#include "System/IO/FileAccess.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Including type: System.IO.FileMode
#include "System/IO/FileMode.hpp"
// Including type: System.IO.FileShare
#include "System/IO/FileShare.hpp"
// Including type: System.IO.FileOptions
#include "System/IO/FileOptions.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Forward declaring namespace: Microsoft::Win32::SafeHandles
namespace Microsoft::Win32::SafeHandles {
  // Forward declaring type: SafeFileHandle
  class SafeFileHandle;
}
// Forward declaring namespace: System::Runtime::InteropServices
namespace System::Runtime::InteropServices {
  // Forward declaring type: SafeHandle
  class SafeHandle;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Completed forward declares
// Type namespace: System.IO
namespace System::IO {
  // Forward declaring type: FileStream
  class FileStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::IO::FileStream);
DEFINE_IL2CPP_ARG_TYPE(::System::IO::FileStream*, "System.IO", "FileStream");
// Type namespace: System.IO
namespace System::IO {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: System.IO.FileStream
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: 106ED78
  class FileStream : public ::System::IO::Stream {
    public:
    // Nested type: ::System::IO::FileStream::ReadDelegate
    class ReadDelegate;
    // Nested type: ::System::IO::FileStream::WriteDelegate
    class WriteDelegate;
    public:
    // private System.Byte[] buf
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<uint8_t> buf;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.String name
    // Size: 0x8
    // Offset: 0x30
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Microsoft.Win32.SafeHandles.SafeFileHandle safeHandle
    // Size: 0x8
    // Offset: 0x38
    ::Microsoft::Win32::SafeHandles::SafeFileHandle* safeHandle;
    // Field size check
    static_assert(sizeof(::Microsoft::Win32::SafeHandles::SafeFileHandle*) == 0x8);
    // private System.Boolean isExposed
    // Size: 0x1
    // Offset: 0x40
    bool isExposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isExposed and: append_startpos
    char __padding3[0x7] = {};
    // private System.Int64 append_startpos
    // Size: 0x8
    // Offset: 0x48
    int64_t append_startpos;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.IO.FileAccess access
    // Size: 0x4
    // Offset: 0x50
    ::System::IO::FileAccess access;
    // Field size check
    static_assert(sizeof(::System::IO::FileAccess) == 0x4);
    // private System.Boolean owner
    // Size: 0x1
    // Offset: 0x54
    bool owner;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean async
    // Size: 0x1
    // Offset: 0x55
    bool async;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean canseek
    // Size: 0x1
    // Offset: 0x56
    bool canseek;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean anonymous
    // Size: 0x1
    // Offset: 0x57
    bool anonymous;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean buf_dirty
    // Size: 0x1
    // Offset: 0x58
    bool buf_dirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: buf_dirty and: buf_size
    char __padding10[0x3] = {};
    // private System.Int32 buf_size
    // Size: 0x4
    // Offset: 0x5C
    int buf_size;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 buf_length
    // Size: 0x4
    // Offset: 0x60
    int buf_length;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 buf_offset
    // Size: 0x4
    // Offset: 0x64
    int buf_offset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int64 buf_start
    // Size: 0x8
    // Offset: 0x68
    int64_t buf_start;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    public:
    // static field const value: static System.Int32 DefaultBufferSize
    static constexpr const int DefaultBufferSize = 4096;
    // Get static field: static System.Int32 DefaultBufferSize
    static int _get_DefaultBufferSize();
    // Set static field: static System.Int32 DefaultBufferSize
    static void _set_DefaultBufferSize(int value);
    // Get static field: static private System.Byte[] buf_recycle
    static ::ArrayW<uint8_t> _get_buf_recycle();
    // Set static field: static private System.Byte[] buf_recycle
    static void _set_buf_recycle(::ArrayW<uint8_t> value);
    // Get static field: static private readonly System.Object buf_recycle_lock
    static ::Il2CppObject* _get_buf_recycle_lock();
    // Set static field: static private readonly System.Object buf_recycle_lock
