// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IAsyncResult
#include "System/IAsyncResult.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
  // Forward declaring type: WaitHandle
  class WaitHandle;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Completed forward declares
// Type namespace: System.IO
namespace System::IO {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: System.IO.FileStreamAsyncResult
  // [] Offset: FFFFFFFF
  class FileStreamAsyncResult : public ::Il2CppObject/*, public System::IAsyncResult*/ {
    public:
    // private System.Object state
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppObject* state;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean completed
    // Size: 0x1
    // Offset: 0x18
    bool completed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: completed and: wh
    char __padding1[0x7] = {};
    // private System.Threading.ManualResetEvent wh
    // Size: 0x8
    // Offset: 0x20
    System::Threading::ManualResetEvent* wh;
    // Field size check
    static_assert(sizeof(System::Threading::ManualResetEvent*) == 0x8);
    // private System.AsyncCallback cb
    // Size: 0x8
    // Offset: 0x28
    System::AsyncCallback* cb;
    // Field size check
    static_assert(sizeof(System::AsyncCallback*) == 0x8);
    // private System.Boolean completedSynch
    // Size: 0x1
    // Offset: 0x30
    bool completedSynch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: completedSynch and: Count
    char __padding4[0x3] = {};
    // public System.Int32 Count
    // Size: 0x4
    // Offset: 0x34
    int Count;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 OriginalCount
    // Size: 0x4
    // Offset: 0x38
    int OriginalCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 BytesRead
    // Size: 0x4
    // Offset: 0x3C
    int BytesRead;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.AsyncCallback realcb
    // Size: 0x8
    // Offset: 0x40
    System::AsyncCallback* realcb;
    // Field size check
    static_assert(sizeof(System::AsyncCallback*) == 0x8);
    // Creating value type constructor for type: FileStreamAsyncResult
    FileStreamAsyncResult(::Il2CppObject* state_ = {}, bool completed_ = {}, System::Threading::ManualResetEvent* wh_ = {}, System::AsyncCallback* cb_ = {}, bool completedSynch_ = {}, int Count_ = {}, int OriginalCount_ = {}, int BytesRead_ = {}, System::AsyncCallback* realcb_ = {}) noexcept : state{state_}, completed{completed_}, wh{wh_}, cb{cb_}, completedSynch{completedSynch_}, Count{Count_}, OriginalCount{OriginalCount_}, BytesRead{BytesRead_}, realcb{realcb_} {}
    // Creating interface conversion operator: operator System::IAsyncResult
    operator System::IAsyncResult() noexcept {
      return *reinterpret_cast<System::IAsyncResult*>(this);
    }
    // public System.Void .ctor(System.AsyncCallback cb, System.Object state)
    // Offset: 0x143C688
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FileStreamAsyncResult* New_ctor(System::AsyncCallback* cb, ::Il2CppObject* state) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::IO::FileStreamAsyncResult::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FileStreamAsyncResult*, creationType>(cb, state)));
    }
    // static private System.Void CBWrapper(System.IAsyncResult ares)
    // Offset: 0x143DE44
    static void CBWrapper(System::IAsyncResult* ares);
    // public System.Object get_AsyncState()
    // Offset: 0x143DEE0
    // Implemented from: System.IAsyncResult
    // Base method: System.Object IAsyncResult::get_AsyncState()
    ::Il2CppObject* get_AsyncState();
    // Creating proxy method: System_IAsyncResult_get_AsyncState
    // Maps to method: get_AsyncState
    ::Il2CppObject* System_IAsyncResult_get_AsyncState();
    // public System.Boolean get_CompletedSynchronously()
    // Offset: 0x143DEE8
    // Implemented from: System.IAsyncResult
    // Base method: System.Boolean IAsyncResult::get_CompletedSynchronously()
    bool get_CompletedSynchronously();
    // Creating proxy method: System_IAsyncResult_get_CompletedSynchronously
    // Maps to method: get_CompletedSynchronously
    bool System_IAsyncResult_get_CompletedSynchronously();
    // public System.Threading.WaitHandle get_AsyncWaitHandle()
    // Offset: 0x143DEF0
    // Implemented from: System.IAsyncResult
    // Base method: System.Threading.WaitHandle IAsyncResult::get_AsyncWaitHandle()
    System::Threading::WaitHandle* get_AsyncWaitHandle();
    // Creating proxy method: System_IAsyncResult_get_AsyncWaitHandle
    // Maps to method: get_AsyncWaitHandle
    System::Threading::WaitHandle* System_IAsyncResult_get_AsyncWaitHandle();
    // public System.Boolean get_IsCompleted()
    // Offset: 0x143DEF8
    // Implemented from: System.IAsyncResult
    // Base method: System.Boolean IAsyncResult::get_IsCompleted()
    bool get_IsCompleted();
    // Creating proxy method: System_IAsyncResult_get_IsCompleted
    // Maps to method: get_IsCompleted
    bool System_IAsyncResult_get_IsCompleted();
  }; // System.IO.FileStreamAsyncResult
  static check_size<sizeof(FileStreamAsyncResult), 64 + sizeof(System::AsyncCallback*)> __System_IO_FileStreamAsyncResultSizeCheck;
  static_assert(sizeof(FileStreamAsyncResult) == 0x48);
}
#pragma pack(pop)
DEFINE_IL2CPP_ARG_TYPE(System::IO::FileStreamAsyncResult*, "System.IO", "FileStreamAsyncResult");
