// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ComponentModel.Component
#include "System/ComponentModel/Component.hpp"
// Including type: System.IO.NotifyFilters
#include "System/IO/NotifyFilters.hpp"
// Including type: System.IO.WaitForChangedResult
#include "System/IO/WaitForChangedResult.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SearchPattern2
  class SearchPattern2;
  // Forward declaring type: FileSystemEventHandler
  class FileSystemEventHandler;
  // Forward declaring type: ErrorEventHandler
  class ErrorEventHandler;
  // Forward declaring type: RenamedEventHandler
  class RenamedEventHandler;
  // Forward declaring type: IFileWatcher
  class IFileWatcher;
  // Forward declaring type: FileSystemEventArgs
  class FileSystemEventArgs;
  // Forward declaring type: RenamedEventArgs
  class RenamedEventArgs;
  // Forward declaring type: FileAction
  struct FileAction;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: ISynchronizeInvoke
  class ISynchronizeInvoke;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Delegate
  class Delegate;
  // Forward declaring type: EventArgs
  class EventArgs;
}
// Completed forward declares
// Type namespace: System.IO
namespace System::IO {
  // Autogenerated type: System.IO.FileSystemWatcher
  class FileSystemWatcher : public System::ComponentModel::Component {
    public:
    // Nested type: System::IO::FileSystemWatcher::EventType
    struct EventType;
    // private System.Boolean enableRaisingEvents
    // Offset: 0x28
    bool enableRaisingEvents;
    // private System.String filter
    // Offset: 0x30
    ::CsString* filter;
    // private System.Boolean includeSubdirectories
    // Offset: 0x38
    bool includeSubdirectories;
    // private System.Int32 internalBufferSize
    // Offset: 0x3C
    int internalBufferSize;
    // private System.IO.NotifyFilters notifyFilter
    // Offset: 0x40
    System::IO::NotifyFilters notifyFilter;
    // private System.String path
    // Offset: 0x48
    ::CsString* path;
    // private System.String fullpath
    // Offset: 0x50
    ::CsString* fullpath;
    // private System.ComponentModel.ISynchronizeInvoke synchronizingObject
    // Offset: 0x58
    System::ComponentModel::ISynchronizeInvoke* synchronizingObject;
    // private System.IO.WaitForChangedResult lastData
    // Offset: 0x60
    System::IO::WaitForChangedResult lastData;
    // private System.Boolean waiting
    // Offset: 0x80
    bool waiting;
    // private System.IO.SearchPattern2 pattern
    // Offset: 0x88
    System::IO::SearchPattern2* pattern;
    // private System.Boolean disposed
    // Offset: 0x90
    bool disposed;
    // private System.String mangledFilter
    // Offset: 0x98
    ::CsString* mangledFilter;
    // Get static field: static private System.IO.IFileWatcher watcher
    static System::IO::IFileWatcher* _get_watcher();
    // Set static field: static private System.IO.IFileWatcher watcher
    static void _set_watcher(System::IO::IFileWatcher* value);
    // Get static field: static private System.Object lockobj
    static ::CsObject* _get_lockobj();
    // Set static field: static private System.Object lockobj
    static void _set_lockobj(::CsObject* value);
    // private System.IO.FileSystemEventHandler Changed
    // Offset: 0xA0
    System::IO::FileSystemEventHandler* Changed;
    // private System.IO.FileSystemEventHandler Created
    // Offset: 0xA8
    System::IO::FileSystemEventHandler* Created;
    // private System.IO.FileSystemEventHandler Deleted
    // Offset: 0xB0
    System::IO::FileSystemEventHandler* Deleted;
    // private System.IO.ErrorEventHandler Error
    // Offset: 0xB8
    System::IO::ErrorEventHandler* Error;
    // private System.IO.RenamedEventHandler Renamed
    // Offset: 0xC0
    System::IO::RenamedEventHandler* Renamed;
    // public System.Void .ctor(System.String path, System.String filter)
    // Offset: 0xF621C4
    static FileSystemWatcher* New_ctor(::CsString* path, ::CsString* filter);
    // private System.Void InitWatcher()
    // Offset: 0xF6236C
    void InitWatcher();
    // System.Boolean get_Waiting()
    // Offset: 0xF62664
    bool get_Waiting();
    // System.Void set_Waiting(System.Boolean value)
    // Offset: 0xF6266C
    void set_Waiting(bool value);
    // System.String get_MangledFilter()
    // Offset: 0xF5F60C
    ::CsString* get_MangledFilter();
    // System.IO.SearchPattern2 get_Pattern()
    // Offset: 0xF5F574
    System::IO::SearchPattern2* get_Pattern();
    // System.String get_FullPath()
    // Offset: 0xF5F4B8
    ::CsString* get_FullPath();
    // public System.Void set_EnableRaisingEvents(System.Boolean value)
    // Offset: 0xF62680
    void set_EnableRaisingEvents(bool value);
    // public System.Boolean get_IncludeSubdirectories()
    // Offset: 0xF62868
    bool get_IncludeSubdirectories();
    // public System.Void set_NotifyFilter(System.IO.NotifyFilters value)
    // Offset: 0xF62870
    void set_NotifyFilter(System::IO::NotifyFilters value);
    // private System.Void RaiseEvent(System.Delegate ev, System.EventArgs arg, System.IO.FileSystemWatcher/EventType evtype)
    // Offset: 0xF62964
    void RaiseEvent(System::Delegate* ev, System::EventArgs* arg, System::IO::FileSystemWatcher::EventType evtype);
    // protected System.Void OnChanged(System.IO.FileSystemEventArgs e)
    // Offset: 0xF62C78
    void OnChanged(System::IO::FileSystemEventArgs* e);
    // protected System.Void OnCreated(System.IO.FileSystemEventArgs e)
    // Offset: 0xF62C8C
    void OnCreated(System::IO::FileSystemEventArgs* e);
    // protected System.Void OnDeleted(System.IO.FileSystemEventArgs e)
    // Offset: 0xF62CA0
    void OnDeleted(System::IO::FileSystemEventArgs* e);
    // protected System.Void OnRenamed(System.IO.RenamedEventArgs e)
    // Offset: 0xF62CB4
    void OnRenamed(System::IO::RenamedEventArgs* e);
    // System.Void DispatchEvents(System.IO.FileAction act, System.String filename, System.IO.RenamedEventArgs renamed)
    // Offset: 0xF60488
    void DispatchEvents(System::IO::FileAction act, ::CsString* filename, System::IO::RenamedEventArgs*& renamed);
    // private System.Void Start()
    // Offset: 0xF626AC
    void Start();
    // private System.Void Stop()
    // Offset: 0xF62788
    void Stop();
    // public System.Void add_Changed(System.IO.FileSystemEventHandler value)
    // Offset: 0xF62D88
    void add_Changed(System::IO::FileSystemEventHandler* value);
    // public System.Void remove_Changed(System.IO.FileSystemEventHandler value)
    // Offset: 0xF62E2C
    void remove_Changed(System::IO::FileSystemEventHandler* value);
    // static private System.Int32 InternalSupportsFSW()
    // Offset: 0xF625BC
    static int InternalSupportsFSW();
    // protected override System.Void Dispose(System.Boolean disposing)
    // Offset: 0xF628BC
    // Implemented from: System.ComponentModel.Component
    // Base method: System.Void Component::Dispose(System.Boolean disposing)
    void Dispose(bool disposing);
    // protected override System.Void Finalize()
    // Offset: 0xF628FC
    // Implemented from: System.ComponentModel.Component
    // Base method: System.Void Component::Finalize()
    void Finalize();
    // static private System.Void .cctor()
    // Offset: 0xF62ED0
    // Implemented from: System.ComponentModel.Component
    // Base method: System.Void Component::.cctor()
    static void _cctor();
  }; // System.IO.FileSystemWatcher
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::IO::FileSystemWatcher*, "System.IO", "FileSystemWatcher");
#pragma pack(pop)
