// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IO.TextReader
#include "System/IO/TextReader.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
  // Forward declaring type: Decoder
  class Decoder;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Completed forward declares
// Type namespace: System.IO
namespace System::IO {
  // Autogenerated type: System.IO.StreamReader
  class StreamReader : public System::IO::TextReader {
    public:
    // Nested type: System::IO::StreamReader::NullStreamReader
    class NullStreamReader;
    // private System.IO.Stream stream
    // Offset: 0x18
    System::IO::Stream* stream;
    // private System.Text.Encoding encoding
    // Offset: 0x20
    System::Text::Encoding* encoding;
    // private System.Text.Decoder decoder
    // Offset: 0x28
    System::Text::Decoder* decoder;
    // private System.Byte[] byteBuffer
    // Offset: 0x30
    ::Array<uint8_t>* byteBuffer;
    // private System.Char[] charBuffer
    // Offset: 0x38
    ::Array<::Il2CppChar>* charBuffer;
    // private System.Byte[] _preamble
    // Offset: 0x40
    ::Array<uint8_t>* preamble;
    // private System.Int32 charPos
    // Offset: 0x48
    int charPos;
    // private System.Int32 charLen
    // Offset: 0x4C
    int charLen;
    // private System.Int32 byteLen
    // Offset: 0x50
    int byteLen;
    // private System.Int32 bytePos
    // Offset: 0x54
    int bytePos;
    // private System.Int32 _maxCharsPerBuffer
    // Offset: 0x58
    int maxCharsPerBuffer;
    // private System.Boolean _detectEncoding
    // Offset: 0x5C
    bool detectEncoding;
    // private System.Boolean _checkPreamble
    // Offset: 0x5D
    bool checkPreamble;
    // private System.Boolean _isBlocked
    // Offset: 0x5E
    bool isBlocked;
    // private System.Boolean _closable
    // Offset: 0x5F
    bool closable;
    // private System.Threading.Tasks.Task _asyncReadTask
    // Offset: 0x60
    System::Threading::Tasks::Task* asyncReadTask;
    // Deleting conversion operator: operator ::Il2CppObject*
    constexpr operator ::Il2CppObject*() const noexcept = delete;
    // Get static field: static public readonly System.IO.StreamReader Null
    static System::IO::StreamReader* _get_Null();
    // Set static field: static public readonly System.IO.StreamReader Null
    static void _set_Null(System::IO::StreamReader* value);
    // static System.Int32 get_DefaultBufferSize()
    // Offset: 0x100B578
    static int get_DefaultBufferSize();
    // private System.Void CheckAsyncTaskInProgress()
    // Offset: 0x100B580
    void CheckAsyncTaskInProgress();
    // public System.Void .ctor(System.IO.Stream stream)
    // Offset: 0x100B698
    static StreamReader* New_ctor(System::IO::Stream* stream);
    // public System.Void .ctor(System.IO.Stream stream, System.Boolean detectEncodingFromByteOrderMarks)
    // Offset: 0x100B6A0
    static StreamReader* New_ctor(System::IO::Stream* stream, bool detectEncodingFromByteOrderMarks);
    // public System.Void .ctor(System.IO.Stream stream, System.Text.Encoding encoding)
    // Offset: 0x100B8F0
    static StreamReader* New_ctor(System::IO::Stream* stream, System::Text::Encoding* encoding);
    // public System.Void .ctor(System.IO.Stream stream, System.Text.Encoding encoding, System.Boolean detectEncodingFromByteOrderMarks, System.Int32 bufferSize, System.Boolean leaveOpen)
    // Offset: 0x100B738
    static StreamReader* New_ctor(System::IO::Stream* stream, System::Text::Encoding* encoding, bool detectEncodingFromByteOrderMarks, int bufferSize, bool leaveOpen);
    // public System.Void .ctor(System.String path)
    // Offset: 0x100BAF8
    static StreamReader* New_ctor(::Il2CppString* path);
    // public System.Void .ctor(System.String path, System.Boolean detectEncodingFromByteOrderMarks)
    // Offset: 0x100BB00
    static StreamReader* New_ctor(::Il2CppString* path, bool detectEncodingFromByteOrderMarks);
    // public System.Void .ctor(System.String path, System.Text.Encoding encoding)
    // Offset: 0x100BBA4
    static StreamReader* New_ctor(::Il2CppString* path, System::Text::Encoding* encoding);
    // public System.Void .ctor(System.String path, System.Text.Encoding encoding, System.Boolean detectEncodingFromByteOrderMarks, System.Int32 bufferSize)
    // Offset: 0x100BB98
    static StreamReader* New_ctor(::Il2CppString* path, System::Text::Encoding* encoding, bool detectEncodingFromByteOrderMarks, int bufferSize);
    // System.Void .ctor(System.String path, System.Text.Encoding encoding, System.Boolean detectEncodingFromByteOrderMarks, System.Int32 bufferSize, System.Boolean checkHost)
    // Offset: 0x100BC2C
    static StreamReader* New_ctor(::Il2CppString* path, System::Text::Encoding* encoding, bool detectEncodingFromByteOrderMarks, int bufferSize, bool checkHost);
    // private System.Void Init(System.IO.Stream stream, System.Text.Encoding encoding, System.Boolean detectEncodingFromByteOrderMarks, System.Int32 bufferSize, System.Boolean leaveOpen)
    // Offset: 0x100B978
    void Init(System::IO::Stream* stream, System::Text::Encoding* encoding, bool detectEncodingFromByteOrderMarks, int bufferSize, bool leaveOpen);
    // System.Void Init(System.IO.Stream stream)
    // Offset: 0x100BE58
    void Init(System::IO::Stream* stream);
    // System.Boolean get_LeaveOpen()
    // Offset: 0x100BF8C
    bool get_LeaveOpen();
    // public System.Boolean get_EndOfStream()
    // Offset: 0x100BFA0
    bool get_EndOfStream();
    // System.Boolean DataAvailable()
    // Offset: 0x100C110
    bool DataAvailable();
    // private System.Void CompressBuffer(System.Int32 n)
    // Offset: 0x100C6D8
    void CompressBuffer(int n);
    // private System.Void DetectEncoding()
    // Offset: 0x100C720
    void DetectEncoding();
    // private System.Boolean IsPreamble()
    // Offset: 0x100CA50
    bool IsPreamble();
    // System.Int32 ReadBuffer()
    // Offset: 0x100CB68
    int ReadBuffer();
    // private System.Int32 ReadBuffer(System.Char[] userBuffer, System.Int32 userOffset, System.Int32 desiredChars, out System.Boolean readToUserBuffer)
    // Offset: 0x100C3E8
    int ReadBuffer(::Array<::Il2CppChar>* userBuffer, int userOffset, int desiredChars, bool& readToUserBuffer);
    // System.Void .ctor()
    // Offset: 0x100B628
    // Implemented from: System.IO.TextReader
    // Base method: System.Void TextReader::.ctor()
    // Base method: System.Void MarshalByRefObject::.ctor()
    // Base method: System.Void Object::.ctor()
    static StreamReader* New_ctor();
    // public override System.Void Close()
    // Offset: 0x100BE88
    // Implemented from: System.IO.TextReader
    // Base method: System.Void TextReader::Close()
    void Close();
    // protected override System.Void Dispose(System.Boolean disposing)
    // Offset: 0x100BE98
    // Implemented from: System.IO.TextReader
    // Base method: System.Void TextReader::Dispose(System.Boolean disposing)
    void Dispose(bool disposing);
    // public override System.Int32 Peek()
    // Offset: 0x100C080
    // Implemented from: System.IO.TextReader
    // Base method: System.Int32 TextReader::Peek()
    int Peek();
    // public override System.Int32 Read()
    // Offset: 0x100C120
    // Implemented from: System.IO.TextReader
    // Base method: System.Int32 TextReader::Read()
    int Read();
    // public override System.Int32 Read(in System.Char[] buffer, System.Int32 index, System.Int32 count)
    // Offset: 0x100C1B0
    // Implemented from: System.IO.TextReader
    // Base method: System.Int32 TextReader::Read(in System.Char[] buffer, System.Int32 index, System.Int32 count)
    int Read(::Array<::Il2CppChar>*& buffer, int index, int count);
    // public override System.String ReadToEnd()
    // Offset: 0x100C600
    // Implemented from: System.IO.TextReader
    // Base method: System.String TextReader::ReadToEnd()
    ::Il2CppString* ReadToEnd();
    // public override System.String ReadLine()
    // Offset: 0x100CCD8
    // Implemented from: System.IO.TextReader
    // Base method: System.String TextReader::ReadLine()
    ::Il2CppString* ReadLine();
    // static private System.Void .cctor()
    // Offset: 0x100CEFC
    // Implemented from: System.IO.TextReader
    // Base method: System.Void TextReader::.cctor()
    static void _cctor();
  }; // System.IO.StreamReader
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::IO::StreamReader*, "System.IO", "StreamReader");
#pragma pack(pop)
