// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Mono.Net.Security.MobileTlsContext
#include "Mono/Net/Security/MobileTlsContext.hpp"
// Including type: Mono.Unity.UnityTls
#include "Mono/Unity/UnityTls.hpp"
// Including type: System.Runtime.InteropServices.GCHandle
#include "System/Runtime/InteropServices/GCHandle.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509Certificate
  class X509Certificate;
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
}
// Forward declaring namespace: Mono::Security::Interface
namespace Mono::Security::Interface {
  // Forward declaring type: MonoTlsConnectionInfo
  class MonoTlsConnectionInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
  // Skipping declaration: IntPtr because it is already included!
  // Forward declaring type: ValueTuple`2<T1, T2>
  template<typename T1, typename T2>
  struct ValueTuple_2;
}
// Forward declaring namespace: Mono::Net::Security
namespace Mono::Net::Security {
  // Forward declaring type: MobileAuthenticatedStream
  class MobileAuthenticatedStream;
}
// Completed forward declares
// Type namespace: Mono.Unity
namespace Mono::Unity {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: Mono.Unity.UnityTlsContext
  class UnityTlsContext : public Mono::Net::Security::MobileTlsContext {
    public:
    // private Mono.Unity.UnityTls/unitytls_tlsctx* tlsContext
    // Size: 0x8
    // Offset: 0x58
    Mono::Unity::UnityTls::unitytls_tlsctx* tlsContext;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_x509list* requestedClientCertChain
    // Size: 0x8
    // Offset: 0x60
    Mono::Unity::UnityTls::unitytls_x509list* requestedClientCertChain;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_x509list*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_key* requestedClientKey
    // Size: 0x8
    // Offset: 0x68
    Mono::Unity::UnityTls::unitytls_key* requestedClientKey;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_key*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_tlsctx_read_callback readCallback
    // Size: 0x8
    // Offset: 0x70
    Mono::Unity::UnityTls::unitytls_tlsctx_read_callback* readCallback;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx_read_callback*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_tlsctx_write_callback writeCallback
    // Size: 0x8
    // Offset: 0x78
    Mono::Unity::UnityTls::unitytls_tlsctx_write_callback* writeCallback;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx_write_callback*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_tlsctx_certificate_callback certificateCallback
    // Size: 0x8
    // Offset: 0x80
    Mono::Unity::UnityTls::unitytls_tlsctx_certificate_callback* certificateCallback;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx_certificate_callback*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_tlsctx_x509verify_callback verifyCallback
    // Size: 0x8
    // Offset: 0x88
    Mono::Unity::UnityTls::unitytls_tlsctx_x509verify_callback* verifyCallback;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx_x509verify_callback*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Certificate localClientCertificate
    // Size: 0x8
    // Offset: 0x90
    System::Security::Cryptography::X509Certificates::X509Certificate* localClientCertificate;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Certificate*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Certificate remoteCertificate
    // Size: 0x8
    // Offset: 0x98
    System::Security::Cryptography::X509Certificates::X509Certificate* remoteCertificate;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Certificate*) == 0x8);
    // private Mono.Security.Interface.MonoTlsConnectionInfo connectioninfo
    // Size: 0x8
    // Offset: 0xA0
    Mono::Security::Interface::MonoTlsConnectionInfo* connectioninfo;
    // Field size check
    static_assert(sizeof(Mono::Security::Interface::MonoTlsConnectionInfo*) == 0x8);
    // private System.Boolean isAuthenticated
    // Size: 0x1
    // Offset: 0xA8
    bool isAuthenticated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasContext
    // Size: 0x1
    // Offset: 0xA9
    bool hasContext;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean closedGraceful
    // Size: 0x1
    // Offset: 0xAA
    bool closedGraceful;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: closedGraceful and: writeBuffer
    char __padding12[0x5] = {};
    // private System.Byte[] writeBuffer
    // Size: 0x8
    // Offset: 0xB0
    ::Array<uint8_t>* writeBuffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] readBuffer
    // Size: 0x8
    // Offset: 0xB8
    ::Array<uint8_t>* readBuffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Runtime.InteropServices.GCHandle handle
    // Size: 0x4
    // Offset: 0xC0
    System::Runtime::InteropServices::GCHandle handle;
    // Field size check
    static_assert(sizeof(System::Runtime::InteropServices::GCHandle) == 0x4);
    // Padding between fields: handle and: lastException
    char __padding15[0x4] = {};
    // private System.Exception lastException
    // Size: 0x8
    // Offset: 0xC8
    System::Exception* lastException;
    // Field size check
    static_assert(sizeof(System::Exception*) == 0x8);
    // Creating value type constructor for type: UnityTlsContext
