// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Mono.Net.Security.MobileTlsContext
#include "Mono/Net/Security/MobileTlsContext.hpp"
// Including type: Mono.Unity.UnityTls
#include "Mono/Unity/UnityTls.hpp"
// Including type: System.Runtime.InteropServices.GCHandle
#include "System/Runtime/InteropServices/GCHandle.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509Certificate
  class X509Certificate;
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
}
// Forward declaring namespace: Mono::Security::Interface
namespace Mono::Security::Interface {
  // Forward declaring type: MonoTlsConnectionInfo
  class MonoTlsConnectionInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
  // Skipping declaration: IntPtr because it is already included!
  // Forward declaring type: ValueTuple`2<T1, T2>
  template<typename T1, typename T2>
  struct ValueTuple_2;
}
// Forward declaring namespace: Mono::Net::Security
namespace Mono::Net::Security {
  // Forward declaring type: MobileAuthenticatedStream
  class MobileAuthenticatedStream;
}
// Completed forward declares
// Type namespace: Mono.Unity
namespace Mono::Unity {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: Mono.Unity.UnityTlsContext
  // [] Offset: FFFFFFFF
  class UnityTlsContext : public Mono::Net::Security::MobileTlsContext {
    public:
    // private Mono.Unity.UnityTls/unitytls_tlsctx* tlsContext
    // Size: 0x8
    // Offset: 0x58
    Mono::Unity::UnityTls::unitytls_tlsctx* tlsContext;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_x509list* requestedClientCertChain
    // Size: 0x8
    // Offset: 0x60
    Mono::Unity::UnityTls::unitytls_x509list* requestedClientCertChain;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_x509list*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_key* requestedClientKey
    // Size: 0x8
    // Offset: 0x68
    Mono::Unity::UnityTls::unitytls_key* requestedClientKey;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_key*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_tlsctx_read_callback readCallback
    // Size: 0x8
    // Offset: 0x70
    Mono::Unity::UnityTls::unitytls_tlsctx_read_callback* readCallback;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx_read_callback*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_tlsctx_write_callback writeCallback
    // Size: 0x8
    // Offset: 0x78
    Mono::Unity::UnityTls::unitytls_tlsctx_write_callback* writeCallback;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx_write_callback*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_tlsctx_certificate_callback certificateCallback
    // Size: 0x8
    // Offset: 0x80
    Mono::Unity::UnityTls::unitytls_tlsctx_certificate_callback* certificateCallback;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx_certificate_callback*) == 0x8);
    // private Mono.Unity.UnityTls/unitytls_tlsctx_x509verify_callback verifyCallback
    // Size: 0x8
    // Offset: 0x88
    Mono::Unity::UnityTls::unitytls_tlsctx_x509verify_callback* verifyCallback;
    // Field size check
    static_assert(sizeof(Mono::Unity::UnityTls::unitytls_tlsctx_x509verify_callback*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Certificate localClientCertificate
    // Size: 0x8
    // Offset: 0x90
    System::Security::Cryptography::X509Certificates::X509Certificate* localClientCertificate;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Certificate*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Certificate remoteCertificate
    // Size: 0x8
    // Offset: 0x98
    System::Security::Cryptography::X509Certificates::X509Certificate* remoteCertificate;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Certificate*) == 0x8);
    // private Mono.Security.Interface.MonoTlsConnectionInfo connectioninfo
    // Size: 0x8
    // Offset: 0xA0
    Mono::Security::Interface::MonoTlsConnectionInfo* connectioninfo;
    // Field size check
    static_assert(sizeof(Mono::Security::Interface::MonoTlsConnectionInfo*) == 0x8);
    // private System.Boolean isAuthenticated
    // Size: 0x1
    // Offset: 0xA8
    bool isAuthenticated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasContext
    // Size: 0x1
    // Offset: 0xA9
    bool hasContext;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean closedGraceful
    // Size: 0x1
    // Offset: 0xAA
    bool closedGraceful;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: closedGraceful and: writeBuffer
    char __padding12[0x5] = {};
    // private System.Byte[] writeBuffer
    // Size: 0x8
    // Offset: 0xB0
    ::Array<uint8_t>* writeBuffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] readBuffer
    // Size: 0x8
    // Offset: 0xB8
    ::Array<uint8_t>* readBuffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Runtime.InteropServices.GCHandle handle
    // Size: 0x4
    // Offset: 0xC0
    System::Runtime::InteropServices::GCHandle handle;
    // Field size check
    static_assert(sizeof(System::Runtime::InteropServices::GCHandle) == 0x4);
    // Padding between fields: handle and: lastException
    char __padding15[0x4] = {};
    // private System.Exception lastException
    // Size: 0x8
    // Offset: 0xC8
    System::Exception* lastException;
    // Field size check
    static_assert(sizeof(System::Exception*) == 0x8);
    // Creating value type constructor for type: UnityTlsContext
    UnityTlsContext(Mono::Unity::UnityTls::unitytls_tlsctx* tlsContext_ = {}, Mono::Unity::UnityTls::unitytls_x509list* requestedClientCertChain_ = {}, Mono::Unity::UnityTls::unitytls_key* requestedClientKey_ = {}, Mono::Unity::UnityTls::unitytls_tlsctx_read_callback* readCallback_ = {}, Mono::Unity::UnityTls::unitytls_tlsctx_write_callback* writeCallback_ = {}, Mono::Unity::UnityTls::unitytls_tlsctx_certificate_callback* certificateCallback_ = {}, Mono::Unity::UnityTls::unitytls_tlsctx_x509verify_callback* verifyCallback_ = {}, System::Security::Cryptography::X509Certificates::X509Certificate* localClientCertificate_ = {}, System::Security::Cryptography::X509Certificates::X509Certificate* remoteCertificate_ = {}, Mono::Security::Interface::MonoTlsConnectionInfo* connectioninfo_ = {}, bool isAuthenticated_ = {}, bool hasContext_ = {}, bool closedGraceful_ = {}, ::Array<uint8_t>* writeBuffer_ = {}, ::Array<uint8_t>* readBuffer_ = {}, System::Runtime::InteropServices::GCHandle handle_ = {}, System::Exception* lastException_ = {}) noexcept : tlsContext{tlsContext_}, requestedClientCertChain{requestedClientCertChain_}, requestedClientKey{requestedClientKey_}, readCallback{readCallback_}, writeCallback{writeCallback_}, certificateCallback{certificateCallback_}, verifyCallback{verifyCallback_}, localClientCertificate{localClientCertificate_}, remoteCertificate{remoteCertificate_}, connectioninfo{connectioninfo_}, isAuthenticated{isAuthenticated_}, hasContext{hasContext_}, closedGraceful{closedGraceful_}, writeBuffer{writeBuffer_}, readBuffer{readBuffer_}, handle{handle_}, lastException{lastException_} {}
    // static private System.Void ExtractNativeKeyAndChainFromManagedCertificate(System.Security.Cryptography.X509Certificates.X509Certificate cert, Mono.Unity.UnityTls/unitytls_errorstate* errorState, out Mono.Unity.UnityTls/unitytls_x509list* nativeCertChain, out Mono.Unity.UnityTls/unitytls_key* nativeKey)
    // Offset: 0x1274C90
    static void ExtractNativeKeyAndChainFromManagedCertificate(System::Security::Cryptography::X509Certificates::X509Certificate* cert, Mono::Unity::UnityTls::unitytls_errorstate* errorState, Mono::Unity::UnityTls::unitytls_x509list*& nativeCertChain, Mono::Unity::UnityTls::unitytls_key*& nativeKey);
    // static private System.IntPtr WriteCallback(System.Void* userData, System.Byte* data, System.IntPtr bufferLen, Mono.Unity.UnityTls/unitytls_errorstate* errorState)
    // Offset: 0x12742C8
    static System::IntPtr WriteCallback(void* userData, uint8_t* data, System::IntPtr bufferLen, Mono::Unity::UnityTls::unitytls_errorstate* errorState);
    // private System.IntPtr WriteCallback(System.Byte* data, System.IntPtr bufferLen, Mono.Unity.UnityTls/unitytls_errorstate* errorState)
    // Offset: 0x12758A0
    System::IntPtr WriteCallback(uint8_t* data, System::IntPtr bufferLen, Mono::Unity::UnityTls::unitytls_errorstate* errorState);
    // static private System.IntPtr ReadCallback(System.Void* userData, System.Byte* buffer, System.IntPtr bufferLen, Mono.Unity.UnityTls/unitytls_errorstate* errorState)
    // Offset: 0x1274398
    static System::IntPtr ReadCallback(void* userData, uint8_t* buffer, System::IntPtr bufferLen, Mono::Unity::UnityTls::unitytls_errorstate* errorState);
    // private System.IntPtr ReadCallback(System.Byte* buffer, System.IntPtr bufferLen, Mono.Unity.UnityTls/unitytls_errorstate* errorState)
    // Offset: 0x1275B04
    System::IntPtr ReadCallback(uint8_t* buffer, System::IntPtr bufferLen, Mono::Unity::UnityTls::unitytls_errorstate* errorState);
    // static private Mono.Unity.UnityTls/unitytls_x509verify_result VerifyCallback(System.Void* userData, Mono.Unity.UnityTls/unitytls_x509list_ref chain, Mono.Unity.UnityTls/unitytls_errorstate* errorState)
    // Offset: 0x1274468
    static Mono::Unity::UnityTls::unitytls_x509verify_result VerifyCallback(void* userData, Mono::Unity::UnityTls::unitytls_x509list_ref chain, Mono::Unity::UnityTls::unitytls_errorstate* errorState);
    // private Mono.Unity.UnityTls/unitytls_x509verify_result VerifyCallback(Mono.Unity.UnityTls/unitytls_x509list_ref chain, Mono.Unity.UnityTls/unitytls_errorstate* errorState)
    // Offset: 0x1275DE8
    Mono::Unity::UnityTls::unitytls_x509verify_result VerifyCallback(Mono::Unity::UnityTls::unitytls_x509list_ref chain, Mono::Unity::UnityTls::unitytls_errorstate* errorState);
    // static private System.Void CertificateCallback(System.Void* userData, Mono.Unity.UnityTls/unitytls_tlsctx* ctx, System.Byte* cn, System.IntPtr cnLen, Mono.Unity.UnityTls/unitytls_x509name* caList, System.IntPtr caListLen, Mono.Unity.UnityTls/unitytls_x509list_ref* chain, Mono.Unity.UnityTls/unitytls_key_ref* key, Mono.Unity.UnityTls/unitytls_errorstate* errorState)
    // Offset: 0x1274530
    static void CertificateCallback(void* userData, Mono::Unity::UnityTls::unitytls_tlsctx* ctx, uint8_t* cn, System::IntPtr cnLen, Mono::Unity::UnityTls::unitytls_x509name* caList, System::IntPtr caListLen, Mono::Unity::UnityTls::unitytls_x509list_ref* chain, Mono::Unity::UnityTls::unitytls_key_ref* key, Mono::Unity::UnityTls::unitytls_errorstate* errorState);
    // private System.Void CertificateCallback(Mono.Unity.UnityTls/unitytls_tlsctx* ctx, System.Byte* cn, System.IntPtr cnLen, Mono.Unity.UnityTls/unitytls_x509name* caList, System.IntPtr caListLen, Mono.Unity.UnityTls/unitytls_x509list_ref* chain, Mono.Unity.UnityTls/unitytls_key_ref* key, Mono.Unity.UnityTls/unitytls_errorstate* errorState)
    // Offset: 0x1275F48
    void CertificateCallback(Mono::Unity::UnityTls::unitytls_tlsctx* ctx, uint8_t* cn, System::IntPtr cnLen, Mono::Unity::UnityTls::unitytls_x509name* caList, System::IntPtr caListLen, Mono::Unity::UnityTls::unitytls_x509list_ref* chain, Mono::Unity::UnityTls::unitytls_key_ref* key, Mono::Unity::UnityTls::unitytls_errorstate* errorState);
    // public System.Void .ctor(Mono.Net.Security.MobileAuthenticatedStream parent, System.Boolean serverMode, System.String targetHost, System.Security.Authentication.SslProtocols enabledProtocols, System.Security.Cryptography.X509Certificates.X509Certificate serverCertificate, System.Security.Cryptography.X509Certificates.X509CertificateCollection clientCertificates, System.Boolean askForClientCert)
    // Offset: 0x1274600
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.Void MobileTlsContext::.ctor(Mono.Net.Security.MobileAuthenticatedStream parent, System.Boolean serverMode, System.String targetHost, System.Security.Authentication.SslProtocols enabledProtocols, System.Security.Cryptography.X509Certificates.X509Certificate serverCertificate, System.Security.Cryptography.X509Certificates.X509CertificateCollection clientCertificates, System.Boolean askForClientCert)
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UnityTlsContext* New_ctor(Mono::Net::Security::MobileAuthenticatedStream* parent, bool serverMode, ::Il2CppString* targetHost, System::Security::Authentication::SslProtocols enabledProtocols, System::Security::Cryptography::X509Certificates::X509Certificate* serverCertificate, System::Security::Cryptography::X509Certificates::X509CertificateCollection* clientCertificates, bool askForClientCert) {
      static auto ___internal__logger = ::Logger::get().WithContext("Mono::Unity::UnityTlsContext::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UnityTlsContext*, creationType>(parent, serverMode, targetHost, enabledProtocols, serverCertificate, clientCertificates, askForClientCert)));
    }
    // public override System.Boolean get_IsAuthenticated()
    // Offset: 0x1274F94
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.Boolean MobileTlsContext::get_IsAuthenticated()
    bool get_IsAuthenticated();
    // override System.Security.Cryptography.X509Certificates.X509Certificate get_LocalClientCertificate()
    // Offset: 0x1274F9C
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.Security.Cryptography.X509Certificates.X509Certificate MobileTlsContext::get_LocalClientCertificate()
    System::Security::Cryptography::X509Certificates::X509Certificate* get_LocalClientCertificate();
    // public override System.ValueTuple`2<System.Int32,System.Boolean> Read(System.Byte[] buffer, System.Int32 offset, System.Int32 count)
    // Offset: 0x1274FA4
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.ValueTuple`2<System.Int32,System.Boolean> MobileTlsContext::Read(System.Byte[] buffer, System.Int32 offset, System.Int32 count)
    System::ValueTuple_2<int, bool> Read(::Array<uint8_t>* buffer, int offset, int count);
    // public override System.ValueTuple`2<System.Int32,System.Boolean> Write(System.Byte[] buffer, System.Int32 offset, System.Int32 count)
    // Offset: 0x1275158
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.ValueTuple`2<System.Int32,System.Boolean> MobileTlsContext::Write(System.Byte[] buffer, System.Int32 offset, System.Int32 count)
    System::ValueTuple_2<int, bool> Write(::Array<uint8_t>* buffer, int offset, int count);
    // public override System.Void Shutdown()
    // Offset: 0x1275300
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.Void MobileTlsContext::Shutdown()
    void Shutdown();
    // protected override System.Void Dispose(System.Boolean disposing)
    // Offset: 0x12753C8
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.Void MobileTlsContext::Dispose(System.Boolean disposing)
    void Dispose(bool disposing);
    // public override System.Void StartHandshake()
    // Offset: 0x12754BC
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.Void MobileTlsContext::StartHandshake()
    void StartHandshake();
    // public override System.Boolean ProcessHandshake()
    // Offset: 0x127562C
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.Boolean MobileTlsContext::ProcessHandshake()
    bool ProcessHandshake();
    // public override System.Void FinishHandshake()
    // Offset: 0x1275790
    // Implemented from: Mono.Net.Security.MobileTlsContext
    // Base method: System.Void MobileTlsContext::FinishHandshake()
    void FinishHandshake();
  }; // Mono.Unity.UnityTlsContext
  #pragma pack(pop)
  static check_size<sizeof(UnityTlsContext), 200 + sizeof(System::Exception*)> __Mono_Unity_UnityTlsContextSizeCheck;
  static_assert(sizeof(UnityTlsContext) == 0xD0);
}
DEFINE_IL2CPP_ARG_TYPE(Mono::Unity::UnityTlsContext*, "Mono.Unity", "UnityTlsContext");
