// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Mono.Unity.UnityTls
#include "Mono/Unity/UnityTls.hpp"
// Including type: Mono.Unity.UnityTls/unitytls_tlsctx_protocolrange
#include "Mono/Unity/UnityTls_unitytls_tlsctx_protocolrange.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Unity
namespace Mono::Unity {
}
// Completed forward declares
// Type namespace: Mono.Unity
namespace Mono::Unity {
  // Autogenerated type: Mono.Unity.UnityTls/unitytls_interface_struct
  class UnityTls::unitytls_interface_struct : public ::Il2CppObject {
    public:
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_errorstate_create_t
    class unitytls_errorstate_create_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_errorstate_raise_error_t
    class unitytls_errorstate_raise_error_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_key_get_ref_t
    class unitytls_key_get_ref_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_key_parse_der_t
    class unitytls_key_parse_der_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_key_parse_pem_t
    class unitytls_key_parse_pem_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_key_free_t
    class unitytls_key_free_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509_export_der_t
    class unitytls_x509_export_der_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_get_ref_t
    class unitytls_x509list_get_ref_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_get_x509_t
    class unitytls_x509list_get_x509_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_create_t
    class unitytls_x509list_create_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_append_t
    class unitytls_x509list_append_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_append_der_t
    class unitytls_x509list_append_der_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_free_t
    class unitytls_x509list_free_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509verify_default_ca_t
    class unitytls_x509verify_default_ca_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509verify_explicit_ca_t
    class unitytls_x509verify_explicit_ca_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_create_server_t
    class unitytls_tlsctx_create_server_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_create_client_t
    class unitytls_tlsctx_create_client_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_server_require_client_authentication_t
    class unitytls_tlsctx_server_require_client_authentication_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_set_certificate_callback_t
    class unitytls_tlsctx_set_certificate_callback_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_set_trace_callback_t
    class unitytls_tlsctx_set_trace_callback_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_set_x509verify_callback_t
    class unitytls_tlsctx_set_x509verify_callback_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_set_supported_ciphersuites_t
    class unitytls_tlsctx_set_supported_ciphersuites_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_get_ciphersuite_t
    class unitytls_tlsctx_get_ciphersuite_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_get_protocol_t
    class unitytls_tlsctx_get_protocol_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_process_handshake_t
    class unitytls_tlsctx_process_handshake_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_read_t
    class unitytls_tlsctx_read_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_write_t
    class unitytls_tlsctx_write_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_notify_close_t
    class unitytls_tlsctx_notify_close_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_free_t
    class unitytls_tlsctx_free_t;
    // Nested type: Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_random_generate_bytes_t
    class unitytls_random_generate_bytes_t;
    // public readonly System.UInt64 UNITYTLS_INVALID_HANDLE
    // Offset: 0x10
    uint64_t UNITYTLS_INVALID_HANDLE;
    // public readonly Mono.Unity.UnityTls/unitytls_tlsctx_protocolrange UNITYTLS_TLSCTX_PROTOCOLRANGE_DEFAULT
    // Offset: 0x18
    Mono::Unity::UnityTls::unitytls_tlsctx_protocolrange UNITYTLS_TLSCTX_PROTOCOLRANGE_DEFAULT;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_errorstate_create_t unitytls_errorstate_create
    // Offset: 0x20
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_errorstate_create_t* unitytls_errorstate_create;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_errorstate_raise_error_t unitytls_errorstate_raise_error
    // Offset: 0x28
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_errorstate_raise_error_t* unitytls_errorstate_raise_error;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_key_get_ref_t unitytls_key_get_ref
    // Offset: 0x30
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_key_get_ref_t* unitytls_key_get_ref;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_key_parse_der_t unitytls_key_parse_der
    // Offset: 0x38
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_key_parse_der_t* unitytls_key_parse_der;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_key_parse_pem_t unitytls_key_parse_pem
    // Offset: 0x40
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_key_parse_pem_t* unitytls_key_parse_pem;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_key_free_t unitytls_key_free
    // Offset: 0x48
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_key_free_t* unitytls_key_free;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509_export_der_t unitytls_x509_export_der
    // Offset: 0x50
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509_export_der_t* unitytls_x509_export_der;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509list_get_ref_t unitytls_x509list_get_ref
    // Offset: 0x58
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_get_ref_t* unitytls_x509list_get_ref;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509list_get_x509_t unitytls_x509list_get_x509
    // Offset: 0x60
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_get_x509_t* unitytls_x509list_get_x509;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509list_create_t unitytls_x509list_create
    // Offset: 0x68
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_create_t* unitytls_x509list_create;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509list_append_t unitytls_x509list_append
    // Offset: 0x70
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_append_t* unitytls_x509list_append;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509list_append_der_t unitytls_x509list_append_der
    // Offset: 0x78
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_append_der_t* unitytls_x509list_append_der;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509list_append_der_t unitytls_x509list_append_pem
    // Offset: 0x80
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_append_der_t* unitytls_x509list_append_pem;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509list_free_t unitytls_x509list_free
    // Offset: 0x88
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509list_free_t* unitytls_x509list_free;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509verify_default_ca_t unitytls_x509verify_default_ca
    // Offset: 0x90
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509verify_default_ca_t* unitytls_x509verify_default_ca;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_x509verify_explicit_ca_t unitytls_x509verify_explicit_ca
    // Offset: 0x98
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_x509verify_explicit_ca_t* unitytls_x509verify_explicit_ca;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_create_server_t unitytls_tlsctx_create_server
    // Offset: 0xA0
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_create_server_t* unitytls_tlsctx_create_server;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_create_client_t unitytls_tlsctx_create_client
    // Offset: 0xA8
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_create_client_t* unitytls_tlsctx_create_client;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_server_require_client_authentication_t unitytls_tlsctx_server_require_client_authentication
    // Offset: 0xB0
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_server_require_client_authentication_t* unitytls_tlsctx_server_require_client_authentication;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_set_certificate_callback_t unitytls_tlsctx_set_certificate_callback
    // Offset: 0xB8
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_set_certificate_callback_t* unitytls_tlsctx_set_certificate_callback;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_set_trace_callback_t unitytls_tlsctx_set_trace_callback
    // Offset: 0xC0
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_set_trace_callback_t* unitytls_tlsctx_set_trace_callback;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_set_x509verify_callback_t unitytls_tlsctx_set_x509verify_callback
    // Offset: 0xC8
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_set_x509verify_callback_t* unitytls_tlsctx_set_x509verify_callback;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_set_supported_ciphersuites_t unitytls_tlsctx_set_supported_ciphersuites
    // Offset: 0xD0
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_set_supported_ciphersuites_t* unitytls_tlsctx_set_supported_ciphersuites;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_get_ciphersuite_t unitytls_tlsctx_get_ciphersuite
    // Offset: 0xD8
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_get_ciphersuite_t* unitytls_tlsctx_get_ciphersuite;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_get_protocol_t unitytls_tlsctx_get_protocol
    // Offset: 0xE0
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_get_protocol_t* unitytls_tlsctx_get_protocol;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_process_handshake_t unitytls_tlsctx_process_handshake
    // Offset: 0xE8
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_process_handshake_t* unitytls_tlsctx_process_handshake;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_read_t unitytls_tlsctx_read
    // Offset: 0xF0
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_read_t* unitytls_tlsctx_read;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_write_t unitytls_tlsctx_write
    // Offset: 0xF8
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_write_t* unitytls_tlsctx_write;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_notify_close_t unitytls_tlsctx_notify_close
    // Offset: 0x100
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_notify_close_t* unitytls_tlsctx_notify_close;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_tlsctx_free_t unitytls_tlsctx_free
    // Offset: 0x108
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_tlsctx_free_t* unitytls_tlsctx_free;
    // public Mono.Unity.UnityTls/unitytls_interface_struct/unitytls_random_generate_bytes_t unitytls_random_generate_bytes
    // Offset: 0x110
    Mono::Unity::UnityTls::unitytls_interface_struct::unitytls_random_generate_bytes_t* unitytls_random_generate_bytes;
    // public System.Void .ctor()
    // Offset: 0x11F8330
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static UnityTls::unitytls_interface_struct* New_ctor();
  }; // Mono.Unity.UnityTls/unitytls_interface_struct
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Mono::Unity::UnityTls::unitytls_interface_struct*, "Mono.Unity", "UnityTls/unitytls_interface_struct");
#pragma pack(pop)
