// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Collections.Generic.IDictionary`2
#include "System/Collections/Generic/IDictionary_2.hpp"
// Including type: System.Collections.IDictionary
#include "System/Collections/IDictionary.hpp"
// Including type: System.Collections.Generic.IReadOnlyDictionary`2
#include "System/Collections/Generic/IReadOnlyDictionary_2.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Collections.IDictionaryEnumerator
#include "System/Collections/IDictionaryEnumerator.hpp"
// Including type: System.Collections.DictionaryEntry
#include "System/Collections/DictionaryEntry.hpp"
// Including type: System.Collections.Generic.IEnumerator`1
#include "System/Collections/Generic/IEnumerator_1.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Concurrent
namespace System::Collections::Concurrent {
  // Skipping declaration: Tables because it is already included!
  // Skipping declaration: Node because it is already included!
  // Skipping declaration: DictionaryEnumerator because it is already included!
  // Skipping declaration: <GetEnumerator>d__32 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEqualityComparer`1<T>
  template<typename T>
  class IEqualityComparer_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Array
  class Array;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
  // Skipping declaration: ICollection because it is already included!
}
// Completed forward declares
// Type namespace: System.Collections.Concurrent
namespace System::Collections::Concurrent {
  // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2
  template<typename TKey, typename TValue>
  class ConcurrentDictionary_2 : public ::Il2CppObject, public System::Collections::Generic::IDictionary_2<TKey, TValue>, public System::Collections::IDictionary, public System::Collections::Generic::IReadOnlyDictionary_2<TKey, TValue> {
    public:
    // Nested type: System::Collections::Concurrent::ConcurrentDictionary_2::Tables<TKey, TValue>
    class Tables;
    // Nested type: System::Collections::Concurrent::ConcurrentDictionary_2::Node<TKey, TValue>
    class Node;
    // Nested type: System::Collections::Concurrent::ConcurrentDictionary_2::DictionaryEnumerator<TKey, TValue>
    class DictionaryEnumerator;
    // Nested type: System::Collections::Concurrent::ConcurrentDictionary_2::$GetEnumerator$d__32<TKey, TValue>
    class $GetEnumerator$d__32;
    // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2/Tables
    class Tables : public ::Il2CppObject, public ::il2cpp_utils::il2cpp_type_check::NestedType {
      public:
      using declaring_type = ConcurrentDictionary_2<TKey, TValue>*;
      // readonly System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue>[] _buckets
      // Offset: 0x0
      ::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>* buckets;
      // readonly System.Object[] _locks
      // Offset: 0x0
      ::Array<::Il2CppObject*>* locks;
      // System.Int32[] _countPerLock
      // Offset: 0x0
      ::Array<int>* countPerLock;
      // System.Void .ctor(System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue>[] buckets, System.Object[] locks, System.Int32[] countPerLock)
      // Offset: 0xFFFFFFFF
      static typename ConcurrentDictionary_2<TKey, TValue>::Tables* New_ctor(::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>* buckets, ::Array<::Il2CppObject*>* locks, ::Array<int>* countPerLock) {
        return (typename ConcurrentDictionary_2<TKey, TValue>::Tables*)THROW_UNLESS((il2cpp_utils::New(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename ConcurrentDictionary_2<TKey, TValue>::Tables*>::get(), buckets, locks, countPerLock)));
      }
    }; // System.Collections.Concurrent.ConcurrentDictionary`2/Tables
    // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2/Node
    class Node : public ::Il2CppObject, public ::il2cpp_utils::il2cpp_type_check::NestedType {
      public:
      using declaring_type = ConcurrentDictionary_2<TKey, TValue>*;
      // readonly TKey _key
      // Offset: 0x0
      TKey key;
      // TValue _value
      // Offset: 0x0
      TValue value;
      // System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue> _next
      // Offset: 0x0
      typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node* next;
      // readonly System.Int32 _hashcode
      // Offset: 0x0
      int hashcode;
      // System.Void .ctor(TKey key, TValue value, System.Int32 hashcode, System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue> next)
      // Offset: 0xFFFFFFFF
      static typename ConcurrentDictionary_2<TKey, TValue>::Node* New_ctor(TKey key, TValue value, int hashcode, typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node* next) {
        return (typename ConcurrentDictionary_2<TKey, TValue>::Node*)THROW_UNLESS((il2cpp_utils::New(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename ConcurrentDictionary_2<TKey, TValue>::Node*>::get(), key, value, hashcode, next)));
      }
    }; // System.Collections.Concurrent.ConcurrentDictionary`2/Node
    // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2/DictionaryEnumerator
    class DictionaryEnumerator : public ::Il2CppObject, public System::Collections::IDictionaryEnumerator, public ::il2cpp_utils::il2cpp_type_check::NestedType {
      public:
      using declaring_type = ConcurrentDictionary_2<TKey, TValue>*;
      // private System.Collections.Generic.IEnumerator`1<System.Collections.Generic.KeyValuePair`2<TKey,TValue>> _enumerator
      // Offset: 0x0
      System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>* enumerator;
      // Creating conversion operator: operator System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>*
      constexpr operator System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>*() const noexcept {
        return enumerator;
      }
      // System.Void .ctor(System.Collections.Concurrent.ConcurrentDictionary`2<TKey,TValue> dictionary)
      // Offset: 0xFFFFFFFF
      static typename ConcurrentDictionary_2<TKey, TValue>::DictionaryEnumerator* New_ctor(System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>* dictionary) {
        return (typename ConcurrentDictionary_2<TKey, TValue>::DictionaryEnumerator*)THROW_UNLESS((il2cpp_utils::New(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename ConcurrentDictionary_2<TKey, TValue>::DictionaryEnumerator*>::get(), dictionary)));
      }
      // public System.Collections.DictionaryEntry get_Entry()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IDictionaryEnumerator
      // Base method: System.Collections.DictionaryEntry IDictionaryEnumerator::get_Entry()
      System::Collections::DictionaryEntry get_Entry() {
        return THROW_UNLESS(il2cpp_utils::RunMethod<System::Collections::DictionaryEntry>(this, "get_Entry"));
      }
      // Creating proxy method: System_Collections_IDictionaryEnumerator_get_Entry
      // Maps to method: get_Entry
      System::Collections::DictionaryEntry System_Collections_IDictionaryEnumerator_get_Entry() {
        return get_Entry();
      }
      // public System.Object get_Key()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IDictionaryEnumerator
      // Base method: System.Object IDictionaryEnumerator::get_Key()
      ::Il2CppObject* get_Key() {
        return THROW_UNLESS(il2cpp_utils::RunMethod<::Il2CppObject*>(this, "get_Key"));
      }
      // Creating proxy method: System_Collections_IDictionaryEnumerator_get_Key
      // Maps to method: get_Key
      ::Il2CppObject* System_Collections_IDictionaryEnumerator_get_Key() {
        return get_Key();
      }
      // public System.Object get_Value()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IDictionaryEnumerator
      // Base method: System.Object IDictionaryEnumerator::get_Value()
      ::Il2CppObject* get_Value() {
        return THROW_UNLESS(il2cpp_utils::RunMethod<::Il2CppObject*>(this, "get_Value"));
      }
      // Creating proxy method: System_Collections_IDictionaryEnumerator_get_Value
      // Maps to method: get_Value
      ::Il2CppObject* System_Collections_IDictionaryEnumerator_get_Value() {
        return get_Value();
      }
      // public System.Object get_Current()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Object IEnumerator::get_Current()
      ::Il2CppObject* get_Current() {
        return THROW_UNLESS(il2cpp_utils::RunMethod<::Il2CppObject*>(this, "get_Current"));
      }
      // Creating proxy method: System_Collections_IEnumerator_get_Current
      // Maps to method: get_Current
      ::Il2CppObject* System_Collections_IEnumerator_get_Current() {
        return get_Current();
      }
      // public System.Boolean MoveNext()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Boolean IEnumerator::MoveNext()
      bool MoveNext() {
        return THROW_UNLESS(il2cpp_utils::RunMethod<bool>(this, "MoveNext"));
      }
      // public System.Void Reset()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Void IEnumerator::Reset()
      void Reset() {
        THROW_UNLESS(il2cpp_utils::RunMethod(this, "Reset"));
      }
      // Creating proxy method: System_Collections_IEnumerator_Reset
      // Maps to method: Reset
      void System_Collections_IEnumerator_Reset() {
        Reset();
      }
    }; // System.Collections.Concurrent.ConcurrentDictionary`2/DictionaryEnumerator
    // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2/<GetEnumerator>d__32
    class $GetEnumerator$d__32 : public ::Il2CppObject, public System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>, public ::il2cpp_utils::il2cpp_type_check::NestedType {
      public:
      using declaring_type = ConcurrentDictionary_2<TKey, TValue>*;
      // private System.Int32 <>1__state
      // Offset: 0x0
      int $$1__state;
      // private System.Collections.Generic.KeyValuePair`2<TKey,TValue> <>2__current
      // Offset: 0x0
      System::Collections::Generic::KeyValuePair_2<TKey, TValue> $$2__current;
      // public System.Collections.Concurrent.ConcurrentDictionary`2<TKey,TValue> <>4__this
      // Offset: 0x0
      System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>* $$4__this;
      // private System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue>[] <buckets>5__1
      // Offset: 0x0
      ::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>* $buckets$5__1;
      // private System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue> <current>5__2
      // Offset: 0x0
      typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node* $current$5__2;
      // private System.Int32 <i>5__3
      // Offset: 0x0
      int $i$5__3;
      // public System.Void .ctor(System.Int32 <>1__state)
      // Offset: 0xFFFFFFFF
      static typename ConcurrentDictionary_2<TKey, TValue>::$GetEnumerator$d__32* New_ctor(int $$1__state) {
        return (typename ConcurrentDictionary_2<TKey, TValue>::$GetEnumerator$d__32*)THROW_UNLESS((il2cpp_utils::New(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename ConcurrentDictionary_2<TKey, TValue>::$GetEnumerator$d__32*>::get(), $$1__state)));
      }
      // private System.Void System.IDisposable.Dispose()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.IDisposable
      // Base method: System.Void IDisposable::Dispose()
      void System_IDisposable_Dispose() {
        THROW_UNLESS(il2cpp_utils::RunMethod(this, "System.IDisposable.Dispose"));
      }
      // private System.Boolean MoveNext()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Boolean IEnumerator::MoveNext()
      bool MoveNext() {
        return THROW_UNLESS(il2cpp_utils::RunMethod<bool>(this, "MoveNext"));
      }
      // private System.Collections.Generic.KeyValuePair`2<TKey,TValue> System.Collections.Generic.IEnumerator<System.Collections.Generic.KeyValuePair<TKey,TValue>>.get_Current()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.Generic.IEnumerator`1
      // Base method: T IEnumerator`1::get_Current()
      System::Collections::Generic::KeyValuePair_2<TKey, TValue> System_Collections_Generic_IEnumerator_1_get_Current() {
        return THROW_UNLESS((il2cpp_utils::RunMethod<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>(this, "System.Collections.Generic.IEnumerator<System.Collections.Generic.KeyValuePair<TKey,TValue>>.get_Current")));
      }
      // private System.Void System.Collections.IEnumerator.Reset()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Void IEnumerator::Reset()
      void System_Collections_IEnumerator_Reset() {
        THROW_UNLESS(il2cpp_utils::RunMethod(this, "System.Collections.IEnumerator.Reset"));
      }
      // private System.Object System.Collections.IEnumerator.get_Current()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Object IEnumerator::get_Current()
      ::Il2CppObject* System_Collections_IEnumerator_get_Current() {
        return THROW_UNLESS(il2cpp_utils::RunMethod<::Il2CppObject*>(this, "System.Collections.IEnumerator.get_Current"));
      }
    }; // System.Collections.Concurrent.ConcurrentDictionary`2/<GetEnumerator>d__32
    // private System.Collections.Concurrent.ConcurrentDictionary`2/Tables<TKey,TValue> _tables
    // Offset: 0x0
    typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Tables* tables;
    // private System.Collections.Generic.IEqualityComparer`1<TKey> _comparer
    // Offset: 0x0
    System::Collections::Generic::IEqualityComparer_1<TKey>* comparer;
    // private readonly System.Boolean _growLockArray
    // Offset: 0x0
    bool growLockArray;
    // private System.Int32 _budget
    // Offset: 0x0
    int budget;
    // Autogenerated static field getter
    // Get static field: static private System.Int32 DefaultCapacity
    static int _get_DefaultCapacity() {
      return THROW_UNLESS((il2cpp_utils::GetFieldValue<int>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<ConcurrentDictionary_2<TKey, TValue>*>::get(), "DefaultCapacity")));
    }
    // Autogenerated static field setter
    // Set static field: static private System.Int32 DefaultCapacity
    static void _set_DefaultCapacity(int value) {
      THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<ConcurrentDictionary_2<TKey, TValue>*>::get(), "DefaultCapacity", value)));
    }
    // Autogenerated static field getter
    // Get static field: static private System.Int32 MaxLockNumber
    static int _get_MaxLockNumber() {
