// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Collections.Generic.IDictionary`2
#include "System/Collections/Generic/IDictionary_2.hpp"
// Including type: System.Collections.IDictionary
#include "System/Collections/IDictionary.hpp"
// Including type: System.Collections.Generic.IReadOnlyDictionary`2
#include "System/Collections/Generic/IReadOnlyDictionary_2.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Collections.DictionaryEntry
#include "System/Collections/DictionaryEntry.hpp"
// Including type: System.Collections.IDictionaryEnumerator
#include "System/Collections/IDictionaryEnumerator.hpp"
// Including type: System.Collections.Generic.IEnumerator`1
#include "System/Collections/Generic/IEnumerator_1.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Concurrent
namespace System::Collections::Concurrent {
  // Skipping declaration: Tables because it is already included!
  // Skipping declaration: Node because it is already included!
  // Skipping declaration: DictionaryEnumerator because it is already included!
  // Skipping declaration: <GetEnumerator>d__32 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEqualityComparer`1<T>
  template<typename T>
  class IEqualityComparer_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Array
  class Array;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
  // Skipping declaration: ICollection because it is already included!
}
// Completed forward declares
// Type namespace: System.Collections.Concurrent
namespace System::Collections::Concurrent {
  // WARNING Size may be invalid!
  // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2
  // [] Offset: FFFFFFFF
  // [DebuggerTypeProxyAttribute] Offset: D3CF30
  // [DebuggerDisplayAttribute] Offset: D3CF30
  // [DefaultMemberAttribute] Offset: D3CF30
  template<typename TKey, typename TValue>
  class ConcurrentDictionary_2 : public ::Il2CppObject/*, public System::Collections::Generic::IDictionary_2<TKey, TValue>, public System::Collections::IDictionary, public System::Collections::Generic::IReadOnlyDictionary_2<TKey, TValue>*/ {
    public:
    // Nested type: System::Collections::Concurrent::ConcurrentDictionary_2::Tables<TKey, TValue>
    class Tables;
    // Nested type: System::Collections::Concurrent::ConcurrentDictionary_2::Node<TKey, TValue>
    class Node;
    // Nested type: System::Collections::Concurrent::ConcurrentDictionary_2::DictionaryEnumerator<TKey, TValue>
    class DictionaryEnumerator;
    // Nested type: System::Collections::Concurrent::ConcurrentDictionary_2::$GetEnumerator$d__32<TKey, TValue>
    class $GetEnumerator$d__32;
    // WARNING Size may be invalid!
    // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2/Tables
    // [] Offset: FFFFFFFF
    class Tables : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = ConcurrentDictionary_2<TKey, TValue>*;
      static constexpr std::string_view NESTED_NAME = "Tables";
      // readonly System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue>[] _buckets
      // Size: 0x8
      // Offset: 0x0
      ::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>* buckets;
      // Field size check
      static_assert(sizeof(::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>*) == 0x8);
      // readonly System.Object[] _locks
      // Size: 0x8
      // Offset: 0x0
      ::Array<::Il2CppObject*>* locks;
      // Field size check
      static_assert(sizeof(::Array<::Il2CppObject*>*) == 0x8);
      // System.Int32[] _countPerLock
      // Size: 0x8
      // Offset: 0x0
      ::Array<int>* countPerLock;
      // Field size check
      static_assert(sizeof(::Array<int>*) == 0x8);
      // Creating value type constructor for type: Tables
      Tables(::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>* buckets_ = {}, ::Array<::Il2CppObject*>* locks_ = {}, ::Array<int>* countPerLock_ = {}) noexcept : buckets{buckets_}, locks{locks_}, countPerLock{countPerLock_} {}
      // System.Void .ctor(System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue>[] buckets, System.Object[] locks, System.Int32[] countPerLock)
      // Offset: 0xFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename ConcurrentDictionary_2<TKey, TValue>::Tables* New_ctor(::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>* buckets, ::Array<::Il2CppObject*>* locks, ::Array<int>* countPerLock) {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("Tables").WithContext(".ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename ConcurrentDictionary_2<TKey, TValue>::Tables*, creationType>(buckets, locks, countPerLock)));
      }
    }; // System.Collections.Concurrent.ConcurrentDictionary`2/Tables
    // Could not write size check! Type: System.Collections.Concurrent.ConcurrentDictionary`2/Tables is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2/Node
    // [] Offset: FFFFFFFF
    class Node : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = ConcurrentDictionary_2<TKey, TValue>*;
      static constexpr std::string_view NESTED_NAME = "Node";
      // readonly TKey _key
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      TKey key;
      // TValue _value
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      TValue value;
      // System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue> _next
      // Size: 0x8
      // Offset: 0x0
      typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node* next;
      // Field size check
      static_assert(sizeof(typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*) == 0x8);
      // readonly System.Int32 _hashcode
      // Size: 0x4
      // Offset: 0x0
      int hashcode;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: Node
      Node(TKey key_ = {}, TValue value_ = {}, typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node* next_ = {}, int hashcode_ = {}) noexcept : key{key_}, value{value_}, next{next_}, hashcode{hashcode_} {}
      // System.Void .ctor(TKey key, TValue value, System.Int32 hashcode, System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue> next)
      // Offset: 0xFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename ConcurrentDictionary_2<TKey, TValue>::Node* New_ctor(TKey key, TValue value, int hashcode, typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node* next) {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("Node").WithContext(".ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename ConcurrentDictionary_2<TKey, TValue>::Node*, creationType>(key, value, hashcode, next)));
      }
    }; // System.Collections.Concurrent.ConcurrentDictionary`2/Node
    // Could not write size check! Type: System.Collections.Concurrent.ConcurrentDictionary`2/Node is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2/DictionaryEnumerator
    // [] Offset: FFFFFFFF
    class DictionaryEnumerator : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject/*, public System::Collections::IDictionaryEnumerator*/ {
      public:
      using declaring_type = ConcurrentDictionary_2<TKey, TValue>*;
      static constexpr std::string_view NESTED_NAME = "DictionaryEnumerator";
      // private System.Collections.Generic.IEnumerator`1<System.Collections.Generic.KeyValuePair`2<TKey,TValue>> _enumerator
      // Size: 0x8
      // Offset: 0x0
      System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>* enumerator;
      // Field size check
      static_assert(sizeof(System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>*) == 0x8);
      // Creating value type constructor for type: DictionaryEnumerator
      DictionaryEnumerator(System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>* enumerator_ = {}) noexcept : enumerator{enumerator_} {}
      // Creating interface conversion operator: operator System::Collections::IDictionaryEnumerator
      operator System::Collections::IDictionaryEnumerator() noexcept {
        return *reinterpret_cast<System::Collections::IDictionaryEnumerator*>(this);
      }
      // Creating conversion operator: operator System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>*
      constexpr operator System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>*() const noexcept {
        return enumerator;
      }
      // System.Void .ctor(System.Collections.Concurrent.ConcurrentDictionary`2<TKey,TValue> dictionary)
      // Offset: 0xFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename ConcurrentDictionary_2<TKey, TValue>::DictionaryEnumerator* New_ctor(System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>* dictionary) {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("DictionaryEnumerator").WithContext(".ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename ConcurrentDictionary_2<TKey, TValue>::DictionaryEnumerator*, creationType>(dictionary)));
      }
      // public System.Collections.DictionaryEntry get_Entry()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IDictionaryEnumerator
      // Base method: System.Collections.DictionaryEntry IDictionaryEnumerator::get_Entry()
      System::Collections::DictionaryEntry get_Entry() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("DictionaryEnumerator").WithContext("get_Entry");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "get_Entry", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        return ::il2cpp_utils::RunMethodThrow<System::Collections::DictionaryEntry, false>(this, ___internal__method);
      }
      // Creating proxy method: System_Collections_IDictionaryEnumerator_get_Entry
      // Maps to method: get_Entry
      System::Collections::DictionaryEntry System_Collections_IDictionaryEnumerator_get_Entry() {
        return get_Entry();
      }
      // public System.Object get_Key()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IDictionaryEnumerator
      // Base method: System.Object IDictionaryEnumerator::get_Key()
      ::Il2CppObject* get_Key() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("DictionaryEnumerator").WithContext("get_Key");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "get_Key", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        return ::il2cpp_utils::RunMethodThrow<::Il2CppObject*, false>(this, ___internal__method);
      }
      // Creating proxy method: System_Collections_IDictionaryEnumerator_get_Key
      // Maps to method: get_Key
      ::Il2CppObject* System_Collections_IDictionaryEnumerator_get_Key() {
        return get_Key();
      }
      // public System.Object get_Value()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IDictionaryEnumerator
      // Base method: System.Object IDictionaryEnumerator::get_Value()
      ::Il2CppObject* get_Value() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("DictionaryEnumerator").WithContext("get_Value");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "get_Value", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        return ::il2cpp_utils::RunMethodThrow<::Il2CppObject*, false>(this, ___internal__method);
      }
      // Creating proxy method: System_Collections_IDictionaryEnumerator_get_Value
      // Maps to method: get_Value
      ::Il2CppObject* System_Collections_IDictionaryEnumerator_get_Value() {
        return get_Value();
      }
      // public System.Object get_Current()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Object IEnumerator::get_Current()
      ::Il2CppObject* get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("DictionaryEnumerator").WithContext("get_Current");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "get_Current", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        return ::il2cpp_utils::RunMethodThrow<::Il2CppObject*, false>(this, ___internal__method);
      }
      // Creating proxy method: System_Collections_IEnumerator_get_Current
      // Maps to method: get_Current
      ::Il2CppObject* System_Collections_IEnumerator_get_Current() {
        return get_Current();
      }
      // public System.Boolean MoveNext()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Boolean IEnumerator::MoveNext()
      bool MoveNext() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("DictionaryEnumerator").WithContext("MoveNext");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "MoveNext", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        return ::il2cpp_utils::RunMethodThrow<bool, false>(this, ___internal__method);
      }
      // Creating proxy method: System_Collections_IEnumerator_MoveNext
      // Maps to method: MoveNext
      bool System_Collections_IEnumerator_MoveNext() {
        return MoveNext();
      }
      // public System.Void Reset()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Void IEnumerator::Reset()
      void Reset() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("DictionaryEnumerator").WithContext("Reset");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "Reset", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
      }
      // Creating proxy method: System_Collections_IEnumerator_Reset
      // Maps to method: Reset
      void System_Collections_IEnumerator_Reset() {
        Reset();
      }
    }; // System.Collections.Concurrent.ConcurrentDictionary`2/DictionaryEnumerator
    // Could not write size check! Type: System.Collections.Concurrent.ConcurrentDictionary`2/DictionaryEnumerator is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: System.Collections.Concurrent.ConcurrentDictionary`2/<GetEnumerator>d__32
    // [] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: D3CFDC
    class $GetEnumerator$d__32 : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject/*, public System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>*/ {
      public:
      using declaring_type = ConcurrentDictionary_2<TKey, TValue>*;
      static constexpr std::string_view NESTED_NAME = "$GetEnumerator$d__32";
      // private System.Int32 <>1__state
      // Size: 0x4
      // Offset: 0x0
      int $$1__state;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Collections.Generic.KeyValuePair`2<TKey,TValue> <>2__current
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      System::Collections::Generic::KeyValuePair_2<TKey, TValue> $$2__current;
      // public System.Collections.Concurrent.ConcurrentDictionary`2<TKey,TValue> <>4__this
      // Size: 0x8
      // Offset: 0x0
      System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>* $$4__this;
      // Field size check
      static_assert(sizeof(System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>*) == 0x8);
      // private System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue>[] <buckets>5__1
      // Size: 0x8
      // Offset: 0x0
      ::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>* $buckets$5__1;
      // Field size check
      static_assert(sizeof(::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>*) == 0x8);
      // private System.Collections.Concurrent.ConcurrentDictionary`2/Node<TKey,TValue> <current>5__2
      // Size: 0x8
      // Offset: 0x0
      typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node* $current$5__2;
      // Field size check
      static_assert(sizeof(typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*) == 0x8);
      // private System.Int32 <i>5__3
      // Size: 0x4
      // Offset: 0x0
      int $i$5__3;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: $GetEnumerator$d__32
      $GetEnumerator$d__32(int $$1__state_ = {}, System::Collections::Generic::KeyValuePair_2<TKey, TValue> $$2__current_ = {}, System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>* $$4__this_ = {}, ::Array<typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node*>* $buckets$5__1_ = {}, typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Node* $current$5__2_ = {}, int $i$5__3_ = {}) noexcept : $$1__state{$$1__state_}, $$2__current{$$2__current_}, $$4__this{$$4__this_}, $buckets$5__1{$buckets$5__1_}, $current$5__2{$current$5__2_}, $i$5__3{$i$5__3_} {}
      // Creating interface conversion operator: operator System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>
      operator System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>() noexcept {
        return *reinterpret_cast<System::Collections::Generic::IEnumerator_1<System::Collections::Generic::KeyValuePair_2<TKey, TValue>>*>(this);
      }
      // public System.Void .ctor(System.Int32 <>1__state)
      // Offset: 0xFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename ConcurrentDictionary_2<TKey, TValue>::$GetEnumerator$d__32* New_ctor(int $$1__state) {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("$GetEnumerator$d__32").WithContext(".ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename ConcurrentDictionary_2<TKey, TValue>::$GetEnumerator$d__32*, creationType>($$1__state)));
      }
      // private System.Void System.IDisposable.Dispose()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.IDisposable
      // Base method: System.Void IDisposable::Dispose()
      void System_IDisposable_Dispose() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("$GetEnumerator$d__32").WithContext("System.IDisposable.Dispose");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "System.IDisposable.Dispose", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
      }
      // private System.Boolean MoveNext()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Boolean IEnumerator::MoveNext()
      bool MoveNext() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("$GetEnumerator$d__32").WithContext("MoveNext");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "MoveNext", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        return ::il2cpp_utils::RunMethodThrow<bool, false>(this, ___internal__method);
      }
      // Creating proxy method: System_Collections_IEnumerator_MoveNext
      // Maps to method: MoveNext
      bool System_Collections_IEnumerator_MoveNext() {
        return MoveNext();
      }
      // private System.Collections.Generic.KeyValuePair`2<TKey,TValue> System.Collections.Generic.IEnumerator<System.Collections.Generic.KeyValuePair<TKey,TValue>>.get_Current()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.Generic.IEnumerator`1
      // Base method: T IEnumerator_1::get_Current()
      System::Collections::Generic::KeyValuePair_2<TKey, TValue> System_Collections_Generic_IEnumerator_1_get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("$GetEnumerator$d__32").WithContext("System.Collections.Generic.IEnumerator<System.Collections.Generic.KeyValuePair<TKey,TValue>>.get_Current");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "System.Collections.Generic.IEnumerator<System.Collections.Generic.KeyValuePair<TKey,TValue>>.get_Current", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes())));
        return ::il2cpp_utils::RunMethodThrow<System::Collections::Generic::KeyValuePair_2<TKey, TValue>, false>(this, ___internal__method);
      }
      // private System.Void System.Collections.IEnumerator.Reset()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Void IEnumerator::Reset()
      void System_Collections_IEnumerator_Reset() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("$GetEnumerator$d__32").WithContext("System.Collections.IEnumerator.Reset");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "System.Collections.IEnumerator.Reset", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
      }
      // private System.Object System.Collections.IEnumerator.get_Current()
      // Offset: 0xFFFFFFFF
      // Implemented from: System.Collections.IEnumerator
      // Base method: System.Object IEnumerator::get_Current()
      ::Il2CppObject* System_Collections_IEnumerator_get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Collections::Concurrent").WithContext("$GetEnumerator$d__32").WithContext("System.Collections.IEnumerator.get_Current");
        static auto* ___internal__method = THROW_UNLESS(::il2cpp_utils::FindMethod(this, "System.Collections.IEnumerator.get_Current", std::vector<Il2CppClass*>{}, ::il2cpp_utils::ExtractTypes()));
        return ::il2cpp_utils::RunMethodThrow<::Il2CppObject*, false>(this, ___internal__method);
      }
    }; // System.Collections.Concurrent.ConcurrentDictionary`2/<GetEnumerator>d__32
    // Could not write size check! Type: System.Collections.Concurrent.ConcurrentDictionary`2/<GetEnumerator>d__32 is generic, or has no fields that are valid for size checks!
    // private System.Collections.Concurrent.ConcurrentDictionary`2/Tables<TKey,TValue> _tables
    // Size: 0x8
    // Offset: 0x0
    typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Tables* tables;
    // Field size check
    static_assert(sizeof(typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Tables*) == 0x8);
    // private System.Collections.Generic.IEqualityComparer`1<TKey> _comparer
    // Size: 0x8
    // Offset: 0x0
    System::Collections::Generic::IEqualityComparer_1<TKey>* comparer;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::IEqualityComparer_1<TKey>*) == 0x8);
    // private readonly System.Boolean _growLockArray
    // Size: 0x1
    // Offset: 0x0
    bool growLockArray;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 _budget
    // Size: 0x4
    // Offset: 0x0
    int budget;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: ConcurrentDictionary_2
    ConcurrentDictionary_2(typename System::Collections::Concurrent::ConcurrentDictionary_2<TKey, TValue>::Tables* tables_ = {}, System::Collections::Generic::IEqualityComparer_1<TKey>* comparer_ = {}, bool growLockArray_ = {}, int budget_ = {}) noexcept : tables{tables_}, comparer{comparer_}, growLockArray{growLockArray_}, budget{budget_} {}
    // Creating interface conversion operator: operator System::Collections::Generic::IDictionary_2<TKey, TValue>
    operator System::Collections::Generic::IDictionary_2<TKey, TValue>() noexcept {
      return *reinterpret_cast<System::Collections::Generic::IDictionary_2<TKey, TValue>*>(this);
    }
    // Creating interface conversion operator: operator System::Collections::IDictionary
    operator System::Collections::IDictionary() noexcept {
      return *reinterpret_cast<System::Collections::IDictionary*>(this);
    }
