// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Collections.Generic.IReadOnlyCollection`1
#include "System/Collections/Generic/IReadOnlyCollection_1.hpp"
// Including type: System.Collections.Concurrent.IProducerConsumerCollection`1
#include "System/Collections/Concurrent/IProducerConsumerCollection_1.hpp"
// Including type: System.Collections.Concurrent.PaddedHeadAndTail
#include "System/Collections/Concurrent/PaddedHeadAndTail.hpp"
// Including type: System.Collections.Generic.IEnumerator`1
#include "System/Collections/Generic/IEnumerator_1.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Concurrent
namespace System::Collections::Concurrent {
  // Skipping declaration: Segment because it is already included!
  // Skipping declaration: <Enumerate>d__27 because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Array
  class Array;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
}
// Completed forward declares
// Type namespace: System.Collections.Concurrent
namespace System::Collections::Concurrent {
  // WARNING Size may be invalid!
  // Autogenerated type: System.Collections.Concurrent.ConcurrentQueue`1
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerTypeProxyAttribute] Offset: D6DBD4
  // [DebuggerDisplayAttribute] Offset: D6DBD4
  template<typename T>
  class ConcurrentQueue_1 : public ::Il2CppObject/*, public System::Collections::Generic::IReadOnlyCollection_1<T>, public System::Collections::Concurrent::IProducerConsumerCollection_1<T>*/ {
    public:
    // Nested type: System::Collections::Concurrent::ConcurrentQueue_1::Segment<T>
    class Segment;
    // Nested type: System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27<T>
    class $Enumerate$d__27;
    // WARNING Size may be invalid!
    // Autogenerated type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment
    // [TokenAttribute] Offset: FFFFFFFF
    // [DebuggerDisplayAttribute] Offset: D6DC5C
    class Segment : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = ConcurrentQueue_1<T>*;
      static constexpr std::string_view NESTED_NAME = "Segment";
      // Nested type: System::Collections::Concurrent::ConcurrentQueue_1::Segment::Slot<T>
      struct Slot;
      // WARNING Size may be invalid!
      // Autogenerated type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot
      // [TokenAttribute] Offset: FFFFFFFF
      // [DebuggerDisplayAttribute] Offset: D6DC94
      struct Slot : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public System::ValueType*/ {
        public:
        using declaring_type = typename ConcurrentQueue_1<T>::Segment*;
        static constexpr std::string_view NESTED_NAME = "Slot";
        // public T Item
        // Size: 0xFFFFFFFF
        // Offset: 0x0
        T Item;
        // public System.Int32 SequenceNumber
        // Size: 0x4
        // Offset: 0x0
        int SequenceNumber;
        // Field size check
        static_assert(sizeof(int) == 0x4);
        // Creating value type constructor for type: Slot
        constexpr Slot(T Item_ = {}, int SequenceNumber_ = {}) noexcept : Item{Item_}, SequenceNumber{SequenceNumber_} {}
        // Creating interface conversion operator: operator System::ValueType
        operator System::ValueType() noexcept {
          return *reinterpret_cast<System::ValueType*>(this);
        }
        // Autogenerated instance field getter
        // Get instance field: public T Item
        T _get_Item() {
          static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::Slot::_get_Item");
          static auto ___internal__instance = *this;
          return THROW_UNLESS(il2cpp_utils::GetFieldValue<T>(___internal__instance, "Item"));
        }
        // Autogenerated instance field setter
        // Set instance field: public T Item
        void _set_Item(T value) {
          static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::Slot::_set_Item");
          static auto ___internal__instance = *this;
          THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "Item", value));
        }
        // Autogenerated instance field getter
        // Get instance field: public System.Int32 SequenceNumber
        int _get_SequenceNumber() {
          static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::Slot::_get_SequenceNumber");
          static auto ___internal__instance = *this;
          return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(___internal__instance, "SequenceNumber"));
        }
        // Autogenerated instance field setter
        // Set instance field: public System.Int32 SequenceNumber
        void _set_SequenceNumber(int value) {
          static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::Slot::_set_SequenceNumber");
          static auto ___internal__instance = *this;
          THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "SequenceNumber", value));
        }
      }; // System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot
      // Could not write size check! Type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot is generic, or has no fields that are valid for size checks!
      // readonly System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot<T>[] _slots
      // Size: 0x8
      // Offset: 0x0
      ::Array<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot>* slots;
      // Field size check
      static_assert(sizeof(::Array<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot>*) == 0x8);
      // readonly System.Int32 _slotsMask
      // Size: 0x4
      // Offset: 0x0
      int slotsMask;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Collections.Concurrent.PaddedHeadAndTail _headAndTail
      // Size: 0x104
      // Offset: 0x0
      System::Collections::Concurrent::PaddedHeadAndTail headAndTail;
      // Field size check
      static_assert(sizeof(System::Collections::Concurrent::PaddedHeadAndTail) == 0x104);
      // System.Boolean _preservedForObservation
      // Size: 0x1
      // Offset: 0x0
      bool preservedForObservation;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // System.Boolean _frozenForEnqueues
      // Size: 0x1
      // Offset: 0x0
      bool frozenForEnqueues;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> _nextSegment
      // Size: 0x8
      // Offset: 0x0
      typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* nextSegment;
      // Field size check
      static_assert(sizeof(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
      // Creating value type constructor for type: Segment
      Segment(::Array<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot>* slots_ = {}, int slotsMask_ = {}, System::Collections::Concurrent::PaddedHeadAndTail headAndTail_ = {}, bool preservedForObservation_ = {}, bool frozenForEnqueues_ = {}, typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* nextSegment_ = {}) noexcept : slots{slots_}, slotsMask{slotsMask_}, headAndTail{headAndTail_}, preservedForObservation{preservedForObservation_}, frozenForEnqueues{frozenForEnqueues_}, nextSegment{nextSegment_} {}
      // Autogenerated instance field getter
      // Get instance field: readonly System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot<T>[] _slots
      ::Array<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot>* _get__slots() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_get__slots");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<::Array<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot>*>(___internal__instance, "_slots"));
      }
      // Autogenerated instance field setter
      // Set instance field: readonly System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot<T>[] _slots
      void _set__slots(::Array<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_set__slots");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_slots", value));
      }
      // Autogenerated instance field getter
      // Get instance field: readonly System.Int32 _slotsMask
      int _get__slotsMask() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_get__slotsMask");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(___internal__instance, "_slotsMask"));
      }
      // Autogenerated instance field setter
      // Set instance field: readonly System.Int32 _slotsMask
      void _set__slotsMask(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_set__slotsMask");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_slotsMask", value));
      }
      // Autogenerated instance field getter
      // Get instance field: System.Collections.Concurrent.PaddedHeadAndTail _headAndTail
      System::Collections::Concurrent::PaddedHeadAndTail _get__headAndTail() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_get__headAndTail");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<System::Collections::Concurrent::PaddedHeadAndTail>(___internal__instance, "_headAndTail"));
      }
      // Autogenerated instance field setter
      // Set instance field: System.Collections.Concurrent.PaddedHeadAndTail _headAndTail
      void _set__headAndTail(System::Collections::Concurrent::PaddedHeadAndTail value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_set__headAndTail");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_headAndTail", value));
      }
      // Autogenerated instance field getter
      // Get instance field: System.Boolean _preservedForObservation
      bool _get__preservedForObservation() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_get__preservedForObservation");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<bool>(___internal__instance, "_preservedForObservation"));
      }
      // Autogenerated instance field setter
      // Set instance field: System.Boolean _preservedForObservation
      void _set__preservedForObservation(bool value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_set__preservedForObservation");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_preservedForObservation", value));
      }
      // Autogenerated instance field getter
      // Get instance field: System.Boolean _frozenForEnqueues
      bool _get__frozenForEnqueues() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_get__frozenForEnqueues");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<bool>(___internal__instance, "_frozenForEnqueues"));
      }
      // Autogenerated instance field setter
      // Set instance field: System.Boolean _frozenForEnqueues
      void _set__frozenForEnqueues(bool value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_set__frozenForEnqueues");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_frozenForEnqueues", value));
      }
      // Autogenerated instance field getter
      // Get instance field: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> _nextSegment
      typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* _get__nextSegment() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_get__nextSegment");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*>(___internal__instance, "_nextSegment"));
      }
      // Autogenerated instance field setter
      // Set instance field: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> _nextSegment
      void _set__nextSegment(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::_set__nextSegment");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "_nextSegment", value));
      }
      // System.Int32 get_Capacity()
      // Offset: 0xFFFFFFFF
      int get_Capacity() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::get_Capacity");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "get_Capacity", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodThrow<int, false>(this, ___internal__method);
      }
      // System.Int32 get_FreezeOffset()
      // Offset: 0xFFFFFFFF
      int get_FreezeOffset() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::get_FreezeOffset");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "get_FreezeOffset", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodThrow<int, false>(this, ___internal__method);
      }
      // public System.Void .ctor(System.Int32 boundedLength)
      // Offset: 0xFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename ConcurrentQueue_1<T>::Segment* New_ctor(int boundedLength) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename ConcurrentQueue_1<T>::Segment*, creationType>(boundedLength)));
      }
      // System.Void EnsureFrozenForEnqueues()
      // Offset: 0xFFFFFFFF
      void EnsureFrozenForEnqueues() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::EnsureFrozenForEnqueues");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "EnsureFrozenForEnqueues", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
      }
      // public System.Boolean TryDequeue(out T item)
      // Offset: 0xFFFFFFFF
      bool TryDequeue(T& item) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::TryDequeue");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "TryDequeue", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<T&>()})));
        return ::il2cpp_utils::RunMethodThrow<bool, false>(this, ___internal__method, item);
      }
      // public System.Boolean TryEnqueue(T item)
      // Offset: 0xFFFFFFFF
      bool TryEnqueue(T item) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::Segment::TryEnqueue");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "TryEnqueue", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(item)})));
        return ::il2cpp_utils::RunMethodThrow<bool, false>(this, ___internal__method, item);
      }
    }; // System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment
    // Could not write size check! Type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.<Enumerate>d__27
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $Enumerate$d__27 : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject/*, public System::Collections::Generic::IEnumerator_1<T>*/ {
      public:
      using declaring_type = ConcurrentQueue_1<T>*;
      static constexpr std::string_view NESTED_NAME = "<Enumerate>d__27";
      // private System.Int32 <>1__state
      // Size: 0x4
      // Offset: 0x0
      int $$1__state;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private T <>2__current
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      T $$2__current;
      // public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> head
      // Size: 0x8
      // Offset: 0x0
      typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* head;
      // Field size check
      static_assert(sizeof(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
      // public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> tail
      // Size: 0x8
      // Offset: 0x0
      typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* tail;
      // Field size check
      static_assert(sizeof(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
      // public System.Int32 tailTail
      // Size: 0x4
      // Offset: 0x0
      int tailTail;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 headHead
      // Size: 0x4
      // Offset: 0x0
      int headHead;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Collections.Concurrent.ConcurrentQueue`1<T> <>4__this
      // Size: 0x8
      // Offset: 0x0
      System::Collections::Concurrent::ConcurrentQueue_1<T>* $$4__this;
      // Field size check
      static_assert(sizeof(System::Collections::Concurrent::ConcurrentQueue_1<T>*) == 0x8);
      // private System.Int32 <i>5__1
      // Size: 0x4
      // Offset: 0x0
      int $i$5__1;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <headTail>5__2
      // Size: 0x4
      // Offset: 0x0
      int $headTail$5__2;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <i>5__3
      // Size: 0x4
      // Offset: 0x0
      int $i$5__3;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <i>5__4
      // Size: 0x4
      // Offset: 0x0
      int $i$5__4;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> <s>5__5
      // Size: 0x8
      // Offset: 0x0
      typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* $s$5__5;
      // Field size check
      static_assert(sizeof(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
      // private System.Int32 <i>5__6
      // Size: 0x4
      // Offset: 0x0
      int $i$5__6;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <sTail>5__7
      // Size: 0x4
      // Offset: 0x0
      int $sTail$5__7;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <i>5__8
      // Size: 0x4
      // Offset: 0x0
      int $i$5__8;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: $Enumerate$d__27
      $Enumerate$d__27(int $$1__state_ = {}, T $$2__current_ = {}, typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* head_ = {}, typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* tail_ = {}, int tailTail_ = {}, int headHead_ = {}, System::Collections::Concurrent::ConcurrentQueue_1<T>* $$4__this_ = {}, int $i$5__1_ = {}, int $headTail$5__2_ = {}, int $i$5__3_ = {}, int $i$5__4_ = {}, typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* $s$5__5_ = {}, int $i$5__6_ = {}, int $sTail$5__7_ = {}, int $i$5__8_ = {}) noexcept : $$1__state{$$1__state_}, $$2__current{$$2__current_}, head{head_}, tail{tail_}, tailTail{tailTail_}, headHead{headHead_}, $$4__this{$$4__this_}, $i$5__1{$i$5__1_}, $headTail$5__2{$headTail$5__2_}, $i$5__3{$i$5__3_}, $i$5__4{$i$5__4_}, $s$5__5{$s$5__5_}, $i$5__6{$i$5__6_}, $sTail$5__7{$sTail$5__7_}, $i$5__8{$i$5__8_} {}
      // Creating interface conversion operator: operator System::Collections::Generic::IEnumerator_1<T>
      operator System::Collections::Generic::IEnumerator_1<T>() noexcept {
        return *reinterpret_cast<System::Collections::Generic::IEnumerator_1<T>*>(this);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <>1__state
      int _get_$$1__state() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$$1__state");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<int>(___internal__instance, "<>1__state")));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 <>1__state
      void _set_$$1__state(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$$1__state");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<>1__state", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private T <>2__current
      T _get_$$2__current() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$$2__current");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<T>(___internal__instance, "<>2__current")));
      }
      // Autogenerated instance field setter
      // Set instance field: private T <>2__current
      void _set_$$2__current(T value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$$2__current");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<>2__current", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> head
      typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* _get_head() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_head");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*>(___internal__instance, "head"));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> head
      void _set_head(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_head");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "head", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> tail
      typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* _get_tail() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_tail");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*>(___internal__instance, "tail"));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> tail
      void _set_tail(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_tail");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "tail", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Int32 tailTail
      int _get_tailTail() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_tailTail");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(___internal__instance, "tailTail"));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.Int32 tailTail
      void _set_tailTail(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_tailTail");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "tailTail", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Int32 headHead
      int _get_headHead() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_headHead");
        static auto ___internal__instance = this;
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(___internal__instance, "headHead"));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.Int32 headHead
      void _set_headHead(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_headHead");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "headHead", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Collections.Concurrent.ConcurrentQueue`1<T> <>4__this
      System::Collections::Concurrent::ConcurrentQueue_1<T>* _get_$$4__this() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$$4__this");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<System::Collections::Concurrent::ConcurrentQueue_1<T>*>(___internal__instance, "<>4__this")));
      }
      // Autogenerated instance field setter
      // Set instance field: public System.Collections.Concurrent.ConcurrentQueue`1<T> <>4__this
      void _set_$$4__this(System::Collections::Concurrent::ConcurrentQueue_1<T>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$$4__this");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<>4__this", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__1
      int _get_$i$5__1() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$i$5__1");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<int>(___internal__instance, "<i>5__1")));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 <i>5__1
      void _set_$i$5__1(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$i$5__1");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<i>5__1", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <headTail>5__2
      int _get_$headTail$5__2() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$headTail$5__2");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<int>(___internal__instance, "<headTail>5__2")));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 <headTail>5__2
      void _set_$headTail$5__2(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$headTail$5__2");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<headTail>5__2", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__3
      int _get_$i$5__3() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$i$5__3");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<int>(___internal__instance, "<i>5__3")));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 <i>5__3
      void _set_$i$5__3(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$i$5__3");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<i>5__3", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__4
      int _get_$i$5__4() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$i$5__4");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<int>(___internal__instance, "<i>5__4")));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 <i>5__4
      void _set_$i$5__4(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$i$5__4");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<i>5__4", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> <s>5__5
      typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* _get_$s$5__5() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$s$5__5");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*>(___internal__instance, "<s>5__5")));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> <s>5__5
      void _set_$s$5__5(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$s$5__5");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<s>5__5", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__6
      int _get_$i$5__6() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$i$5__6");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<int>(___internal__instance, "<i>5__6")));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 <i>5__6
      void _set_$i$5__6(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$i$5__6");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<i>5__6", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <sTail>5__7
      int _get_$sTail$5__7() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$sTail$5__7");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<int>(___internal__instance, "<sTail>5__7")));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 <sTail>5__7
      void _set_$sTail$5__7(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$sTail$5__7");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<sTail>5__7", value));
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__8
      int _get_$i$5__8() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_get_$i$5__8");
        static auto ___internal__instance = this;
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<int>(___internal__instance, "<i>5__8")));
      }
      // Autogenerated instance field setter
      // Set instance field: private System.Int32 <i>5__8
      void _set_$i$5__8(int value) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::_set_$i$5__8");
        static auto ___internal__instance = this;
        THROW_UNLESS(il2cpp_utils::SetFieldValue(___internal__instance, "<i>5__8", value));
      }
      // private T System.Collections.Generic.IEnumerator<T>.get_Current()
      // Offset: 0xFFFFFFFF
      T System_Collections_Generic_IEnumerator$T$_get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::System.Collections.Generic.IEnumerator<T>.get_Current");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "System.Collections.Generic.IEnumerator<T>.get_Current", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodThrow<T, false>(this, ___internal__method);
      }
      // private System.Object System.Collections.IEnumerator.get_Current()
      // Offset: 0xFFFFFFFF
      ::Il2CppObject* System_Collections_IEnumerator_get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::System.Collections.IEnumerator.get_Current");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "System.Collections.IEnumerator.get_Current", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodThrow<::Il2CppObject*, false>(this, ___internal__method);
      }
      // public System.Void .ctor(System.Int32 <>1__state)
      // Offset: 0xFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename ConcurrentQueue_1<T>::$Enumerate$d__27* New_ctor(int $$1__state) {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename ConcurrentQueue_1<T>::$Enumerate$d__27*, creationType>($$1__state)));
      }
      // private System.Void System.IDisposable.Dispose()
      // Offset: 0xFFFFFFFF
      void System_IDisposable_Dispose() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::System.IDisposable.Dispose");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "System.IDisposable.Dispose", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
      }
      // private System.Boolean MoveNext()
      // Offset: 0xFFFFFFFF
      bool MoveNext() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::MoveNext");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "MoveNext", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodThrow<bool, false>(this, ___internal__method);
      }
      // private System.Void System.Collections.IEnumerator.Reset()
      // Offset: 0xFFFFFFFF
      void System_Collections_IEnumerator_Reset() {
        static auto ___internal__logger = ::Logger::get().WithContext("System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::System.Collections.IEnumerator.Reset");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "System.Collections.IEnumerator.Reset", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodThrow<void, false>(this, ___internal__method);
      }
    }; // System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.<Enumerate>d__27
    // Could not write size check! Type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.<Enumerate>d__27 is generic, or has no fields that are valid for size checks!
    // private System.Object _crossSegmentLock
    // Size: 0x8
    // Offset: 0x0
    ::Il2CppObject* crossSegmentLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> _tail
    // Size: 0x8
    // Offset: 0x0
    typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* tail;
    // Field size check
    static_assert(sizeof(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
    // private System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> _head
    // Size: 0x8
    // Offset: 0x0
    typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* head;
    // Field size check
    static_assert(sizeof(typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
    // Creating value type constructor for type: ConcurrentQueue_1
    ConcurrentQueue_1(::Il2CppObject* crossSegmentLock_ = {}, typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* tail_ = {}, typename System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* head_ = {}) noexcept : crossSegmentLock{crossSegmentLock_}, tail{tail_}, head{head_} {}
    // Creating interface conversion operator: operator System::Collections::Generic::IReadOnlyCollection_1<T>
    operator System::Collections::Generic::IReadOnlyCollection_1<T>() noexcept {
      return *reinterpret_cast<System::Collections::Generic::IReadOnlyCollection_1<T>*>(this);
    }
    // Creating interface conversion operator: operator System::Collections::Concurrent::IProducerConsumerCollection_1<T>
    operator System::Collections::Concurrent::IProducerConsumerCollection_1<T>() noexcept {
