// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Collections.Generic.IReadOnlyCollection`1
#include "System/Collections/Generic/IReadOnlyCollection_1.hpp"
// Including type: System.Collections.Concurrent.IProducerConsumerCollection`1
#include "System/Collections/Concurrent/IProducerConsumerCollection_1.hpp"
// Including type: System.Collections.Concurrent.PaddedHeadAndTail
#include "System/Collections/Concurrent/PaddedHeadAndTail.hpp"
// Including type: System.Collections.Generic.IEnumerator`1
#include "System/Collections/Generic/IEnumerator_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Concurrent
namespace System::Collections::Concurrent {
  // Skipping declaration: Segment because it is already included!
  // Skipping declaration: <Enumerate>d__27 because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Array
  class Array;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
}
// Completed forward declares
// Type namespace: System.Collections.Concurrent
namespace System::Collections::Concurrent {
  // Forward declaring type: ConcurrentQueue`1<T>
  template<typename T>
  class ConcurrentQueue_1;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(::System::Collections::Concurrent::ConcurrentQueue_1, "System.Collections.Concurrent", "ConcurrentQueue`1");
// Type namespace: System.Collections.Concurrent
namespace System::Collections::Concurrent {
  // WARNING Size may be invalid!
  // Autogenerated type: System.Collections.Concurrent.ConcurrentQueue`1
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerDisplayAttribute] Offset: 1079AB8
  // [DebuggerTypeProxyAttribute] Offset: 1079AB8
  template<typename T>
  class ConcurrentQueue_1 : public ::Il2CppObject/*, public ::System::Collections::Generic::IReadOnlyCollection_1<T>, public ::System::Collections::Concurrent::IProducerConsumerCollection_1<T>*/ {
    public:
    // Nested type: ::System::Collections::Concurrent::ConcurrentQueue_1::Segment<T>
    class Segment;
    // Nested type: ::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27<T>
    class $Enumerate$d__27;
    // WARNING Size may be invalid!
    // Autogenerated type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment
    // [TokenAttribute] Offset: FFFFFFFF
    // [DebuggerDisplayAttribute] Offset: 1079B40
    class Segment : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = ConcurrentQueue_1<T>*;
      static constexpr std::string_view NESTED_NAME = "Segment";
      static constexpr bool IS_VALUE_TYPE = false;
      // Nested type: ::System::Collections::Concurrent::ConcurrentQueue_1::Segment::Slot<T>
      struct Slot;
      // WARNING Size may be invalid!
      // Autogenerated type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot
      // [TokenAttribute] Offset: FFFFFFFF
      // [DebuggerDisplayAttribute] Offset: 1079B78
      struct Slot : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public ::System::ValueType*/ {
        public:
        using declaring_type = typename ConcurrentQueue_1<T>::Segment*;
        static constexpr std::string_view NESTED_NAME = "Slot";
        static constexpr bool IS_VALUE_TYPE = true;
        public:
        // public T Item
        // Size: 0xFFFFFFFF
        // Offset: 0x0
        T Item;
        // public System.Int32 SequenceNumber
        // Size: 0x4
        // Offset: 0x0
        int SequenceNumber;
        // Field size check
        static_assert(sizeof(int) == 0x4);
        public:
        // Creating value type constructor for type: Slot
        constexpr Slot(T Item_ = {}, int SequenceNumber_ = {}) noexcept : Item{Item_}, SequenceNumber{SequenceNumber_} {}
        // Creating interface conversion operator: operator ::System::ValueType
        operator ::System::ValueType() noexcept {
          return *reinterpret_cast<::System::ValueType*>(this);
        }
        // Creating interface conversion operator: i_ValueType
        inline ::System::ValueType* i_ValueType() noexcept {
          return reinterpret_cast<::System::ValueType*>(this);
        }
        // Autogenerated instance field getter
        // Get instance field: public T Item
        [[deprecated("Use field access instead!")]] T& dyn_Item() {
          static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::Slot::dyn_Item");
          auto ___internal__instance = *this;
          static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "Item"))->offset;
          return *reinterpret_cast<T*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
        }
        // Autogenerated instance field getter
        // Get instance field: public System.Int32 SequenceNumber
        [[deprecated("Use field access instead!")]] int& dyn_SequenceNumber() {
          static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::Slot::dyn_SequenceNumber");
          auto ___internal__instance = *this;
          static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "SequenceNumber"))->offset;
          return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
        }
      }; // System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot
      // Could not write size check! Type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot is generic, or has no fields that are valid for size checks!
      public:
      // readonly System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot<T>[] _slots
      // Size: 0x8
      // Offset: 0x0
      ::ArrayW<typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot> slots;
      // Field size check
      static_assert(sizeof(::ArrayW<typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot>) == 0x8);
      // readonly System.Int32 _slotsMask
      // Size: 0x4
      // Offset: 0x0
      int slotsMask;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Collections.Concurrent.PaddedHeadAndTail _headAndTail
      // Size: 0x104
      // Offset: 0x0
      ::System::Collections::Concurrent::PaddedHeadAndTail headAndTail;
      // Field size check
      static_assert(sizeof(::System::Collections::Concurrent::PaddedHeadAndTail) == 0x104);
      // System.Boolean _preservedForObservation
      // Size: 0x1
      // Offset: 0x0
      bool preservedForObservation;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // System.Boolean _frozenForEnqueues
      // Size: 0x1
      // Offset: 0x0
      bool frozenForEnqueues;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> _nextSegment
      // Size: 0x8
      // Offset: 0x0
      typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* nextSegment;
      // Field size check
      static_assert(sizeof(typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
      public:
      // Autogenerated instance field getter
      // Get instance field: readonly System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment/System.Collections.Concurrent.Slot<T>[] _slots
      [[deprecated("Use field access instead!")]] ::ArrayW<typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot>& dyn__slots() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::dyn__slots");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_slots"))->offset;
        return *reinterpret_cast<::ArrayW<typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment::Slot>*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: readonly System.Int32 _slotsMask
      [[deprecated("Use field access instead!")]] int& dyn__slotsMask() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::dyn__slotsMask");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_slotsMask"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Collections.Concurrent.PaddedHeadAndTail _headAndTail
      [[deprecated("Use field access instead!")]] ::System::Collections::Concurrent::PaddedHeadAndTail& dyn__headAndTail() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::dyn__headAndTail");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_headAndTail"))->offset;
        return *reinterpret_cast<::System::Collections::Concurrent::PaddedHeadAndTail*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Boolean _preservedForObservation
      [[deprecated("Use field access instead!")]] bool& dyn__preservedForObservation() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::dyn__preservedForObservation");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_preservedForObservation"))->offset;
        return *reinterpret_cast<bool*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Boolean _frozenForEnqueues
      [[deprecated("Use field access instead!")]] bool& dyn__frozenForEnqueues() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::dyn__frozenForEnqueues");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_frozenForEnqueues"))->offset;
        return *reinterpret_cast<bool*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> _nextSegment
      [[deprecated("Use field access instead!")]] typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*& dyn__nextSegment() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::dyn__nextSegment");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "_nextSegment"))->offset;
        return *reinterpret_cast<typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment**>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // System.Int32 get_Capacity()
      // Offset: 0xFFFFFFFFFFFFFFFF
      int get_Capacity() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::get_Capacity");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "get_Capacity", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<int, false>(this, ___internal__method);
      }
      // System.Int32 get_FreezeOffset()
      // Offset: 0xFFFFFFFFFFFFFFFF
      int get_FreezeOffset() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::get_FreezeOffset");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "get_FreezeOffset", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<int, false>(this, ___internal__method);
      }
      // public System.Void .ctor(System.Int32 boundedLength)
      // Offset: 0xFFFFFFFFFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename ConcurrentQueue_1<T>::Segment* New_ctor(int boundedLength) {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename ConcurrentQueue_1<T>::Segment*, creationType>(boundedLength)));
      }
      // System.Void EnsureFrozenForEnqueues()
      // Offset: 0xFFFFFFFFFFFFFFFF
      void EnsureFrozenForEnqueues() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::EnsureFrozenForEnqueues");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "EnsureFrozenForEnqueues", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method);
      }
      // public System.Boolean TryDequeue(out T item)
      // Offset: 0xFFFFFFFFFFFFFFFF
      bool TryDequeue(ByRef<T> item) {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::TryDequeue");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "TryDequeue", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<T&>()})));
        return ::il2cpp_utils::RunMethodRethrow<bool, false>(this, ___internal__method, byref(item));
      }
      // public System.Boolean TryEnqueue(T item)
      // Offset: 0xFFFFFFFFFFFFFFFF
      bool TryEnqueue(T item) {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::Segment::TryEnqueue");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "TryEnqueue", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(item)})));
        return ::il2cpp_utils::RunMethodRethrow<bool, false>(this, ___internal__method, item);
      }
    }; // System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment
    // Could not write size check! Type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.<Enumerate>d__27
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $Enumerate$d__27 : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject/*, public ::System::Collections::Generic::IEnumerator_1<T>*/ {
      public:
      using declaring_type = ConcurrentQueue_1<T>*;
      static constexpr std::string_view NESTED_NAME = "<Enumerate>d__27";
      static constexpr bool IS_VALUE_TYPE = false;
      public:
      // private System.Int32 <>1__state
      // Size: 0x4
      // Offset: 0x0
      int $$1__state;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private T <>2__current
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      T $$2__current;
      // public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> head
      // Size: 0x8
      // Offset: 0x0
      typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* head;
      // Field size check
      static_assert(sizeof(typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
      // public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> tail
      // Size: 0x8
      // Offset: 0x0
      typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* tail;
      // Field size check
      static_assert(sizeof(typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
      // public System.Int32 tailTail
      // Size: 0x4
      // Offset: 0x0
      int tailTail;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 headHead
      // Size: 0x4
      // Offset: 0x0
      int headHead;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Collections.Concurrent.ConcurrentQueue`1<T> <>4__this
      // Size: 0x8
      // Offset: 0x0
      ::System::Collections::Concurrent::ConcurrentQueue_1<T>* $$4__this;
      // Field size check
      static_assert(sizeof(::System::Collections::Concurrent::ConcurrentQueue_1<T>*) == 0x8);
      // private System.Int32 <i>5__1
      // Size: 0x4
      // Offset: 0x0
      int $i$5__1;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <headTail>5__2
      // Size: 0x4
      // Offset: 0x0
      int $headTail$5__2;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <i>5__3
      // Size: 0x4
      // Offset: 0x0
      int $i$5__3;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <i>5__4
      // Size: 0x4
      // Offset: 0x0
      int $i$5__4;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> <s>5__5
      // Size: 0x8
      // Offset: 0x0
      typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* $s$5__5;
      // Field size check
      static_assert(sizeof(typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
      // private System.Int32 <i>5__6
      // Size: 0x4
      // Offset: 0x0
      int $i$5__6;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <sTail>5__7
      // Size: 0x4
      // Offset: 0x0
      int $sTail$5__7;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Int32 <i>5__8
      // Size: 0x4
      // Offset: 0x0
      int $i$5__8;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating interface conversion operator: operator ::System::Collections::Generic::IEnumerator_1<T>
      operator ::System::Collections::Generic::IEnumerator_1<T>() noexcept {
        return *reinterpret_cast<::System::Collections::Generic::IEnumerator_1<T>*>(this);
      }
      // Creating interface conversion operator: i_IEnumerator_1_T
      inline ::System::Collections::Generic::IEnumerator_1<T>* i_IEnumerator_1_T() noexcept {
        return reinterpret_cast<::System::Collections::Generic::IEnumerator_1<T>*>(this);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <>1__state
      [[deprecated("Use field access instead!")]] int& dyn_$$1__state() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$$1__state");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<>1__state"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private T <>2__current
      [[deprecated("Use field access instead!")]] T& dyn_$$2__current() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$$2__current");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<>2__current"))->offset;
        return *reinterpret_cast<T*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> head
      [[deprecated("Use field access instead!")]] typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*& dyn_head() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_head");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "head"))->offset;
        return *reinterpret_cast<typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment**>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> tail
      [[deprecated("Use field access instead!")]] typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*& dyn_tail() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_tail");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "tail"))->offset;
        return *reinterpret_cast<typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment**>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Int32 tailTail
      [[deprecated("Use field access instead!")]] int& dyn_tailTail() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_tailTail");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "tailTail"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Int32 headHead
      [[deprecated("Use field access instead!")]] int& dyn_headHead() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_headHead");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "headHead"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Collections.Concurrent.ConcurrentQueue`1<T> <>4__this
      [[deprecated("Use field access instead!")]] ::System::Collections::Concurrent::ConcurrentQueue_1<T>*& dyn_$$4__this() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$$4__this");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<>4__this"))->offset;
        return *reinterpret_cast<::System::Collections::Concurrent::ConcurrentQueue_1<T>**>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__1
      [[deprecated("Use field access instead!")]] int& dyn_$i$5__1() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$i$5__1");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<i>5__1"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <headTail>5__2
      [[deprecated("Use field access instead!")]] int& dyn_$headTail$5__2() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$headTail$5__2");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<headTail>5__2"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__3
      [[deprecated("Use field access instead!")]] int& dyn_$i$5__3() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$i$5__3");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<i>5__3"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__4
      [[deprecated("Use field access instead!")]] int& dyn_$i$5__4() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$i$5__4");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<i>5__4"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> <s>5__5
      [[deprecated("Use field access instead!")]] typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*& dyn_$s$5__5() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$s$5__5");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<s>5__5"))->offset;
        return *reinterpret_cast<typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment**>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__6
      [[deprecated("Use field access instead!")]] int& dyn_$i$5__6() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$i$5__6");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<i>5__6"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <sTail>5__7
      [[deprecated("Use field access instead!")]] int& dyn_$sTail$5__7() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$sTail$5__7");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<sTail>5__7"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: private System.Int32 <i>5__8
      [[deprecated("Use field access instead!")]] int& dyn_$i$5__8() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::dyn_$i$5__8");
        auto ___internal__instance = this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "<i>5__8"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // private T System.Collections.Generic.IEnumerator<T>.get_Current()
      // Offset: 0xFFFFFFFFFFFFFFFF
      T System_Collections_Generic_IEnumerator$T$_get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::System.Collections.Generic.IEnumerator<T>.get_Current");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "System.Collections.Generic.IEnumerator<T>.get_Current", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<T, false>(this, ___internal__method);
      }
      // private System.Object System.Collections.IEnumerator.get_Current()
      // Offset: 0xFFFFFFFFFFFFFFFF
      ::Il2CppObject* System_Collections_IEnumerator_get_Current() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::System.Collections.IEnumerator.get_Current");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "System.Collections.IEnumerator.get_Current", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<::Il2CppObject*, false>(this, ___internal__method);
      }
      // public System.Void .ctor(System.Int32 <>1__state)
      // Offset: 0xFFFFFFFFFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename ConcurrentQueue_1<T>::$Enumerate$d__27* New_ctor(int $$1__state) {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename ConcurrentQueue_1<T>::$Enumerate$d__27*, creationType>($$1__state)));
      }
      // private System.Void System.IDisposable.Dispose()
      // Offset: 0xFFFFFFFFFFFFFFFF
      void System_IDisposable_Dispose() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::System.IDisposable.Dispose");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "System.IDisposable.Dispose", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method);
      }
      // private System.Boolean MoveNext()
      // Offset: 0xFFFFFFFFFFFFFFFF
      bool MoveNext() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::MoveNext");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "MoveNext", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<bool, false>(this, ___internal__method);
      }
      // private System.Void System.Collections.IEnumerator.Reset()
      // Offset: 0xFFFFFFFFFFFFFFFF
      void System_Collections_IEnumerator_Reset() {
        static auto ___internal__logger = ::Logger::get().WithContext("::System::Collections::Concurrent::ConcurrentQueue_1::$Enumerate$d__27::System.Collections.IEnumerator.Reset");
        auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "System.Collections.IEnumerator.Reset", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method);
      }
    }; // System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.<Enumerate>d__27
    // Could not write size check! Type: System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.<Enumerate>d__27 is generic, or has no fields that are valid for size checks!
    public:
    // private System.Object _crossSegmentLock
    // Size: 0x8
    // Offset: 0x0
    ::Il2CppObject* crossSegmentLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> _tail
    // Size: 0x8
    // Offset: 0x0
    typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* tail;
    // Field size check
    static_assert(sizeof(typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
    // private System.Collections.Concurrent.ConcurrentQueue`1/System.Collections.Concurrent.Segment<T> _head
    // Size: 0x8
    // Offset: 0x0
    typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment* head;
    // Field size check
    static_assert(sizeof(typename ::System::Collections::Concurrent::ConcurrentQueue_1<T>::Segment*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::Collections::Generic::IReadOnlyCollection_1<T>
    operator ::System::Collections::Generic::IReadOnlyCollection_1<T>() noexcept {
      return *reinterpret_cast<::System::Collections::Generic::IReadOnlyCollection_1<T>*>(this);
    }
    // Creating interface conversion operator: i_IReadOnlyCollection_1_T
    inline ::System::Collections::Generic::IReadOnlyCollection_1<T>* i_IReadOnlyCollection_1_T() noexcept {
      return reinterpret_cast<::System::Collections::Generic::IReadOnlyCollection_1<T>*>(this);
    }
    // Creating interface conversion operator: operator ::System::Collections::Concurrent::IProducerConsumerCollection_1<T>
    operator ::System::Collections::Concurrent::IProducerConsumerCollection_1<T>() noexcept {
