// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ClipperLib.ClipperBase
#include "ClipperLib/ClipperBase.hpp"
// Including type: ClipperLib.ClipType
#include "ClipperLib/ClipType.hpp"
// Including type: ClipperLib.PolyFillType
#include "ClipperLib/PolyFillType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ClipperLib
namespace ClipperLib {
  // Forward declaring type: Maxima
  class Maxima;
  // Forward declaring type: TEdge
  class TEdge;
  // Forward declaring type: IntersectNode
  class IntersectNode;
  // Forward declaring type: Join
  class Join;
  // Forward declaring type: OutPt
  class OutPt;
  // Forward declaring type: OutRec
  class OutRec;
  // Forward declaring type: Direction
  struct Direction;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IComparer`1<T>
  template<typename T>
  class IComparer_1;
}
// Completed forward declares
// Type namespace: ClipperLib
namespace ClipperLib {
  // Forward declaring type: Clipper
  class Clipper;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ClipperLib::Clipper);
DEFINE_IL2CPP_ARG_TYPE(::ClipperLib::Clipper*, "ClipperLib", "Clipper");
// Type namespace: ClipperLib
namespace ClipperLib {
  // Size: 0x8B
  #pragma pack(push, 1)
  // Autogenerated type: ClipperLib.Clipper
  // [TokenAttribute] Offset: FFFFFFFF
  class Clipper : public ::ClipperLib::ClipperBase {
    public:
    // Writing base type padding for base size: 0x43 to desired offset: 0x44
    char ___base_padding[0x1] = {};
    public:
    // private ClipperLib.ClipType m_ClipType
    // Size: 0x4
    // Offset: 0x44
    ::ClipperLib::ClipType m_ClipType;
    // Field size check
    static_assert(sizeof(::ClipperLib::ClipType) == 0x4);
    // private ClipperLib.Maxima m_Maxima
    // Size: 0x8
    // Offset: 0x48
    ::ClipperLib::Maxima* m_Maxima;
    // Field size check
    static_assert(sizeof(::ClipperLib::Maxima*) == 0x8);
    // private ClipperLib.TEdge m_SortedEdges
    // Size: 0x8
    // Offset: 0x50
    ::ClipperLib::TEdge* m_SortedEdges;
    // Field size check
    static_assert(sizeof(::ClipperLib::TEdge*) == 0x8);
    // private System.Collections.Generic.List`1<ClipperLib.IntersectNode> m_IntersectList
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::ClipperLib::IntersectNode*>* m_IntersectList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::ClipperLib::IntersectNode*>*) == 0x8);
    // private System.Collections.Generic.IComparer`1<ClipperLib.IntersectNode> m_IntersectNodeComparer
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::IComparer_1<::ClipperLib::IntersectNode*>* m_IntersectNodeComparer;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IComparer_1<::ClipperLib::IntersectNode*>*) == 0x8);
    // private System.Boolean m_ExecuteLocked
    // Size: 0x1
    // Offset: 0x68
    bool m_ExecuteLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ExecuteLocked and: m_ClipFillType
    char __padding5[0x3] = {};
    // private ClipperLib.PolyFillType m_ClipFillType
    // Size: 0x4
    // Offset: 0x6C
    ::ClipperLib::PolyFillType m_ClipFillType;
    // Field size check
    static_assert(sizeof(::ClipperLib::PolyFillType) == 0x4);
    // private ClipperLib.PolyFillType m_SubjFillType
    // Size: 0x4
    // Offset: 0x70
    ::ClipperLib::PolyFillType m_SubjFillType;
    // Field size check
    static_assert(sizeof(::ClipperLib::PolyFillType) == 0x4);
    // Padding between fields: m_SubjFillType and: m_Joins
    char __padding7[0x4] = {};
    // private System.Collections.Generic.List`1<ClipperLib.Join> m_Joins
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::ClipperLib::Join*>* m_Joins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::ClipperLib::Join*>*) == 0x8);
    // private System.Collections.Generic.List`1<ClipperLib.Join> m_GhostJoins
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::ClipperLib::Join*>* m_GhostJoins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::ClipperLib::Join*>*) == 0x8);
    // private System.Boolean m_UsingPolyTree
    // Size: 0x1
    // Offset: 0x88
    bool m_UsingPolyTree;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <ReverseSolution>k__BackingField
    // Size: 0x1
    // Offset: 0x89
    bool ReverseSolution;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <StrictlySimple>k__BackingField
    // Size: 0x1
    // Offset: 0x8A
    bool StrictlySimple;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private ClipperLib.ClipType m_ClipType
    [[deprecated("Use field access instead!")]] ::ClipperLib::ClipType& dyn_m_ClipType();
    // Get instance field reference: private ClipperLib.Maxima m_Maxima
    [[deprecated("Use field access instead!")]] ::ClipperLib::Maxima*& dyn_m_Maxima();
    // Get instance field reference: private ClipperLib.TEdge m_SortedEdges
    [[deprecated("Use field access instead!")]] ::ClipperLib::TEdge*& dyn_m_SortedEdges();
    // Get instance field reference: private System.Collections.Generic.List`1<ClipperLib.IntersectNode> m_IntersectList
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::ClipperLib::IntersectNode*>*& dyn_m_IntersectList();
