// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ClipperLib.IntPoint
#include "ClipperLib/IntPoint.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ClipperLib
namespace ClipperLib {
  // Forward declaring type: LocalMinima
  class LocalMinima;
  // Forward declaring type: TEdge
  class TEdge;
  // Forward declaring type: Scanbeam
  class Scanbeam;
  // Forward declaring type: OutRec
  class OutRec;
  // Forward declaring type: PolyType
  struct PolyType;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: ClipperLib
namespace ClipperLib {
  // Forward declaring type: ClipperBase
  class ClipperBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ClipperLib::ClipperBase);
DEFINE_IL2CPP_ARG_TYPE(::ClipperLib::ClipperBase*, "ClipperLib", "ClipperBase");
// Type namespace: ClipperLib
namespace ClipperLib {
  // Size: 0x43
  #pragma pack(push, 1)
  // Autogenerated type: ClipperLib.ClipperBase
  // [TokenAttribute] Offset: FFFFFFFF
  class ClipperBase : public ::Il2CppObject {
    public:
    public:
    // ClipperLib.LocalMinima m_MinimaList
    // Size: 0x8
    // Offset: 0x10
    ::ClipperLib::LocalMinima* m_MinimaList;
    // Field size check
    static_assert(sizeof(::ClipperLib::LocalMinima*) == 0x8);
    // ClipperLib.LocalMinima m_CurrentLM
    // Size: 0x8
    // Offset: 0x18
    ::ClipperLib::LocalMinima* m_CurrentLM;
    // Field size check
    static_assert(sizeof(::ClipperLib::LocalMinima*) == 0x8);
    // System.Collections.Generic.List`1<System.Collections.Generic.List`1<ClipperLib.TEdge>> m_edges
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::ClipperLib::TEdge*>*>* m_edges;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::ClipperLib::TEdge*>*>*) == 0x8);
    // ClipperLib.Scanbeam m_Scanbeam
    // Size: 0x8
    // Offset: 0x28
    ::ClipperLib::Scanbeam* m_Scanbeam;
    // Field size check
    static_assert(sizeof(::ClipperLib::Scanbeam*) == 0x8);
    // System.Collections.Generic.List`1<ClipperLib.OutRec> m_PolyOuts
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::ClipperLib::OutRec*>* m_PolyOuts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::ClipperLib::OutRec*>*) == 0x8);
    // ClipperLib.TEdge m_ActiveEdges
    // Size: 0x8
    // Offset: 0x38
    ::ClipperLib::TEdge* m_ActiveEdges;
    // Field size check
    static_assert(sizeof(::ClipperLib::TEdge*) == 0x8);
    // System.Boolean m_UseFullRange
    // Size: 0x1
    // Offset: 0x40
    bool m_UseFullRange;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean m_HasOpenPaths
    // Size: 0x1
    // Offset: 0x41
    bool m_HasOpenPaths;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <PreserveCollinear>k__BackingField
    // Size: 0x1
    // Offset: 0x42
    bool PreserveCollinear;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: ClipperLib.LocalMinima m_MinimaList
    [[deprecated("Use field access instead!")]] ::ClipperLib::LocalMinima*& dyn_m_MinimaList();
    // Get instance field reference: ClipperLib.LocalMinima m_CurrentLM
    [[deprecated("Use field access instead!")]] ::ClipperLib::LocalMinima*& dyn_m_CurrentLM();
    // Get instance field reference: System.Collections.Generic.List`1<System.Collections.Generic.List`1<ClipperLib.TEdge>> m_edges
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::ClipperLib::TEdge*>*>*& dyn_m_edges();
    // Get instance field reference: ClipperLib.Scanbeam m_Scanbeam
    [[deprecated("Use field access instead!")]] ::ClipperLib::Scanbeam*& dyn_m_Scanbeam();
