// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.EventSystems.RaycastResult
#include "UnityEngine/EventSystems/RaycastResult.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: BaseInputModule
  class BaseInputModule;
  // Forward declaring type: BaseEventData
  class BaseEventData;
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Comparison`1<T>
  template<typename T>
  class Comparison_1;
}
// Completed forward declares
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: EventSystem
  class EventSystem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::EventSystems::EventSystem);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::EventSystems::EventSystem*, "UnityEngine.EventSystems", "EventSystem");
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.EventSystems.EventSystem
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 107F8C4
  class EventSystem : public ::UnityEngine::EventSystems::UIBehaviour {
    public:
    public:
    // private System.Collections.Generic.List`1<UnityEngine.EventSystems.BaseInputModule> m_SystemInputModules
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::UnityEngine::EventSystems::BaseInputModule*>* m_SystemInputModules;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::EventSystems::BaseInputModule*>*) == 0x8);
    // private UnityEngine.EventSystems.BaseInputModule m_CurrentInputModule
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::EventSystems::BaseInputModule* m_CurrentInputModule;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::BaseInputModule*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x10818F4
    // private UnityEngine.GameObject m_FirstSelected
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* m_FirstSelected;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean m_sendNavigationEvents
    // Size: 0x1
    // Offset: 0x30
    bool m_sendNavigationEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_sendNavigationEvents and: m_DragThreshold
    char __padding3[0x3] = {};
    // private System.Int32 m_DragThreshold
    // Size: 0x4
    // Offset: 0x34
    int m_DragThreshold;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.GameObject m_CurrentSelected
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* m_CurrentSelected;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean m_HasFocus
    // Size: 0x1
    // Offset: 0x40
    bool m_HasFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SelectionGuard
    // Size: 0x1
    // Offset: 0x41
    bool m_SelectionGuard;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SelectionGuard and: m_DummyData
    char __padding7[0x6] = {};
    // private UnityEngine.EventSystems.BaseEventData m_DummyData
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::EventSystems::BaseEventData* m_DummyData;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::BaseEventData*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private System.Collections.Generic.List`1<UnityEngine.EventSystems.EventSystem> m_EventSystems
    static ::System::Collections::Generic::List_1<::UnityEngine::EventSystems::EventSystem*>* _get_m_EventSystems();
    // Set static field: static private System.Collections.Generic.List`1<UnityEngine.EventSystems.EventSystem> m_EventSystems
    static void _set_m_EventSystems(::System::Collections::Generic::List_1<::UnityEngine::EventSystems::EventSystem*>* value);
    // Get static field: static private readonly System.Comparison`1<UnityEngine.EventSystems.RaycastResult> s_RaycastComparer
