// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.PointerInputModule
#include "UnityEngine/EventSystems/PointerInputModule.hpp"
// Including type: OVRInput/Button
#include "GlobalNamespace/OVRInput_Button.hpp"
// Including type: UnityEngine.KeyCode
#include "UnityEngine/KeyCode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: OVRPointerEventData
  class OVRPointerEventData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRCursor
  class OVRCursor;
  // Forward declaring type: OVRRaycaster
  class OVRRaycaster;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: OVRInputModule
  class OVRInputModule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::EventSystems::OVRInputModule);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::EventSystems::OVRInputModule*, "UnityEngine.EventSystems", "OVRInputModule");
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Size: 0xE8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.EventSystems.OVRInputModule
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRInputModule : public ::UnityEngine::EventSystems::PointerInputModule {
    public:
    // Nested type: ::UnityEngine::EventSystems::OVRInputModule::InputMode
    struct InputMode;
    public:
    // [TooltipAttribute] Offset: 0x108BADC
    // public UnityEngine.Transform rayTransform
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* rayTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public OVRCursor m_Cursor
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::OVRCursor* m_Cursor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRCursor*) == 0x8);
    // [TooltipAttribute] Offset: 0x108BB14
    // public OVRInput/Button joyPadClickButton
    // Size: 0x4
    // Offset: 0x68
    ::GlobalNamespace::OVRInput::Button joyPadClickButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::Button) == 0x4);
    // [TooltipAttribute] Offset: 0x108BB4C
    // public UnityEngine.KeyCode gazeClickKey
    // Size: 0x4
    // Offset: 0x6C
    ::UnityEngine::KeyCode gazeClickKey;
    // Field size check
    static_assert(sizeof(::UnityEngine::KeyCode) == 0x4);
    // [HeaderAttribute] Offset: 0x108BB84
    // [TooltipAttribute] Offset: 0x108BB84
    // public System.Boolean performSphereCastForGazepointer
    // Size: 0x1
    // Offset: 0x70
    bool performSphereCastForGazepointer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [HeaderAttribute] Offset: 0x108BBE4
    // [TooltipAttribute] Offset: 0x108BBE4
    // public System.Boolean useRightStickScroll
    // Size: 0x1
    // Offset: 0x71
    bool useRightStickScroll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useRightStickScroll and: rightStickDeadZone
    char __padding5[0x2] = {};
    // [TooltipAttribute] Offset: 0x108BC44
    // public System.Single rightStickDeadZone
    // Size: 0x4
    // Offset: 0x74
    float rightStickDeadZone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0x108BC7C
    // [TooltipAttribute] Offset: 0x108BC7C
    // public System.Boolean useSwipeScroll
    // Size: 0x1
    // Offset: 0x78
    bool useSwipeScroll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useSwipeScroll and: swipeDragThreshold
    char __padding7[0x3] = {};
    // [TooltipAttribute] Offset: 0x108BCDC
    // public System.Single swipeDragThreshold
    // Size: 0x4
    // Offset: 0x7C
    float swipeDragThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x108BD14
    // public System.Single swipeDragScale
    // Size: 0x4
    // Offset: 0x80
    float swipeDragScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x108BD4C
    // public System.Boolean InvertSwipeXAxis
    // Size: 0x1
    // Offset: 0x84
    bool InvertSwipeXAxis;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: InvertSwipeXAxis and: activeGraphicRaycaster
    char __padding10[0x3] = {};
    // public OVRRaycaster activeGraphicRaycaster
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::OVRRaycaster* activeGraphicRaycaster;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRRaycaster*) == 0x8);
    // [HeaderAttribute] Offset: 0x108BD84
    // [TooltipAttribute] Offset: 0x108BD84
    // public System.Single angleDragThreshold
    // Size: 0x4
    // Offset: 0x90
    float angleDragThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_SpherecastRadius
    // Size: 0x4
    // Offset: 0x94
    float m_SpherecastRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_NextAction
    // Size: 0x4
    // Offset: 0x98
    float m_NextAction;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 m_LastMousePosition
    // Size: 0x8
    // Offset: 0x9C
    ::UnityEngine::Vector2 m_LastMousePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_MousePosition
    // Size: 0x8
    // Offset: 0xA4
    ::UnityEngine::Vector2 m_MousePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // Padding between fields: m_MousePosition and: m_HorizontalAxis
    char __padding16[0x4] = {};
    // [HeaderAttribute] Offset: 0x108BDF4
    // private System.String m_HorizontalAxis
    // Size: 0x8
    // Offset: 0xB0
    ::StringW m_HorizontalAxis;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_VerticalAxis
    // Size: 0x8
    // Offset: 0xB8
    ::StringW m_VerticalAxis;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_SubmitButton
    // Size: 0x8
    // Offset: 0xC0
    ::StringW m_SubmitButton;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_CancelButton
    // Size: 0x8
    // Offset: 0xC8
    ::StringW m_CancelButton;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single m_InputActionsPerSecond
    // Size: 0x4
    // Offset: 0xD0
    float m_InputActionsPerSecond;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_AllowActivationOnMobileDevice
    // Size: 0x1
    // Offset: 0xD4
    bool m_AllowActivationOnMobileDevice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AllowActivationOnMobileDevice and: m_VRRayPointerData
    char __padding22[0x3] = {};
    // protected System.Collections.Generic.Dictionary`2<System.Int32,UnityEngine.EventSystems.OVRPointerEventData> m_VRRayPointerData
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::EventSystems::OVRPointerEventData*>* m_VRRayPointerData;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::EventSystems::OVRPointerEventData*>*) == 0x8);
    // private readonly UnityEngine.EventSystems.PointerInputModule/UnityEngine.EventSystems.MouseState m_MouseState
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::EventSystems::PointerInputModule::MouseState* m_MouseState;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::PointerInputModule::MouseState*) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.Transform rayTransform
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_rayTransform();
    // Get instance field reference: public OVRCursor m_Cursor
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRCursor*& dyn_m_Cursor();
    // Get instance field reference: public OVRInput/Button joyPadClickButton
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::Button& dyn_joyPadClickButton();
    // Get instance field reference: public UnityEngine.KeyCode gazeClickKey
    [[deprecated("Use field access instead!")]] ::UnityEngine::KeyCode& dyn_gazeClickKey();
