// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.BaseEventData
#include "UnityEngine/EventSystems/BaseEventData.hpp"
// Including type: UnityEngine.EventSystems.RaycastResult
#include "UnityEngine/EventSystems/RaycastResult.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: InputButton because it is already included!
  // Forward declaring type: EventSystem
  class EventSystem;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Autogenerated type: UnityEngine.EventSystems.PointerEventData
  class PointerEventData : public UnityEngine::EventSystems::BaseEventData {
    public:
    // Nested type: UnityEngine::EventSystems::PointerEventData::InputButton
    struct InputButton;
    // Nested type: UnityEngine::EventSystems::PointerEventData::FramePressState
    struct FramePressState;
    // Autogenerated type: UnityEngine.EventSystems.PointerEventData/InputButton
    struct InputButton : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: InputButton
      constexpr InputButton(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.EventSystems.PointerEventData/InputButton Left
      static constexpr const int Left = 0;
      // Get static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Left
      static UnityEngine::EventSystems::PointerEventData::InputButton _get_Left();
      // Set static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Left
      static void _set_Left(UnityEngine::EventSystems::PointerEventData::InputButton value);
      // static field const value: static public UnityEngine.EventSystems.PointerEventData/InputButton Right
      static constexpr const int Right = 1;
      // Get static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Right
      static UnityEngine::EventSystems::PointerEventData::InputButton _get_Right();
      // Set static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Right
      static void _set_Right(UnityEngine::EventSystems::PointerEventData::InputButton value);
      // static field const value: static public UnityEngine.EventSystems.PointerEventData/InputButton Middle
      static constexpr const int Middle = 2;
      // Get static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Middle
      static UnityEngine::EventSystems::PointerEventData::InputButton _get_Middle();
      // Set static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Middle
      static void _set_Middle(UnityEngine::EventSystems::PointerEventData::InputButton value);
    }; // UnityEngine.EventSystems.PointerEventData/InputButton
    check_size<sizeof(PointerEventData::InputButton), 0 + sizeof(int) + 8 - (0 + sizeof(int)) % 8> __UnityEngine_EventSystems_PointerEventData_InputButtonSizeCheck;
    // private UnityEngine.GameObject <pointerEnter>k__BackingField
    // Offset: 0x20
    UnityEngine::GameObject* pointerEnter;
    // private UnityEngine.GameObject m_PointerPress
    // Offset: 0x28
    UnityEngine::GameObject* m_PointerPress;
    // private UnityEngine.GameObject <lastPress>k__BackingField
    // Offset: 0x30
    UnityEngine::GameObject* lastPress;
    // private UnityEngine.GameObject <rawPointerPress>k__BackingField
    // Offset: 0x38
    UnityEngine::GameObject* rawPointerPress;
    // private UnityEngine.GameObject <pointerDrag>k__BackingField
    // Offset: 0x40
    UnityEngine::GameObject* pointerDrag;
    // private UnityEngine.EventSystems.RaycastResult <pointerCurrentRaycast>k__BackingField
    // Offset: 0x48
    UnityEngine::EventSystems::RaycastResult pointerCurrentRaycast;
    // private UnityEngine.EventSystems.RaycastResult <pointerPressRaycast>k__BackingField
    // Offset: 0x90
    UnityEngine::EventSystems::RaycastResult pointerPressRaycast;
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> hovered
    // Offset: 0xD8
    System::Collections::Generic::List_1<UnityEngine::GameObject*>* hovered;
    // private System.Boolean <eligibleForClick>k__BackingField
    // Offset: 0xE0
    bool eligibleForClick;
    // private System.Int32 <pointerId>k__BackingField
    // Offset: 0xE4
    int pointerId;
    // private UnityEngine.Vector2 <position>k__BackingField
    // Offset: 0xE8
    UnityEngine::Vector2 position;
    // private UnityEngine.Vector2 <delta>k__BackingField
    // Offset: 0xF0
    UnityEngine::Vector2 delta;
    // private UnityEngine.Vector2 <pressPosition>k__BackingField
    // Offset: 0xF8
    UnityEngine::Vector2 pressPosition;
    // private UnityEngine.Vector3 <worldPosition>k__BackingField
    // Offset: 0x100
    UnityEngine::Vector3 worldPosition;
    // private UnityEngine.Vector3 <worldNormal>k__BackingField
    // Offset: 0x10C
    UnityEngine::Vector3 worldNormal;
    // private System.Single <clickTime>k__BackingField
    // Offset: 0x118
    float clickTime;
    // private System.Int32 <clickCount>k__BackingField
    // Offset: 0x11C
    int clickCount;
    // private UnityEngine.Vector2 <scrollDelta>k__BackingField
    // Offset: 0x120
    UnityEngine::Vector2 scrollDelta;
    // private System.Boolean <useDragThreshold>k__BackingField
    // Offset: 0x128
    bool useDragThreshold;
    // private System.Boolean <dragging>k__BackingField
    // Offset: 0x129
    bool dragging;
    // private UnityEngine.EventSystems.PointerEventData/InputButton <button>k__BackingField
    // Offset: 0x12C
    UnityEngine::EventSystems::PointerEventData::InputButton button;
    // public UnityEngine.GameObject get_pointerEnter()
    // Offset: 0x1150210
    UnityEngine::GameObject* get_pointerEnter();
    // public System.Void set_pointerEnter(UnityEngine.GameObject value)
    // Offset: 0x1150218
    void set_pointerEnter(UnityEngine::GameObject* value);
    // public UnityEngine.GameObject get_lastPress()
    // Offset: 0x1150220
    UnityEngine::GameObject* get_lastPress();
    // private System.Void set_lastPress(UnityEngine.GameObject value)
    // Offset: 0x1150228
    void set_lastPress(UnityEngine::GameObject* value);
    // public UnityEngine.GameObject get_rawPointerPress()
    // Offset: 0x1150230
    UnityEngine::GameObject* get_rawPointerPress();
    // public System.Void set_rawPointerPress(UnityEngine.GameObject value)
    // Offset: 0x1150238
    void set_rawPointerPress(UnityEngine::GameObject* value);
    // public UnityEngine.GameObject get_pointerDrag()
    // Offset: 0x1150240
    UnityEngine::GameObject* get_pointerDrag();
    // public System.Void set_pointerDrag(UnityEngine.GameObject value)
    // Offset: 0x1150248
    void set_pointerDrag(UnityEngine::GameObject* value);
    // public UnityEngine.EventSystems.RaycastResult get_pointerCurrentRaycast()
    // Offset: 0x1150250
    UnityEngine::EventSystems::RaycastResult get_pointerCurrentRaycast();
    // public System.Void set_pointerCurrentRaycast(UnityEngine.EventSystems.RaycastResult value)
    // Offset: 0x1150260
    void set_pointerCurrentRaycast(UnityEngine::EventSystems::RaycastResult value);
    // public UnityEngine.EventSystems.RaycastResult get_pointerPressRaycast()
    // Offset: 0x1150290
    UnityEngine::EventSystems::RaycastResult get_pointerPressRaycast();
    // public System.Void set_pointerPressRaycast(UnityEngine.EventSystems.RaycastResult value)
    // Offset: 0x11502A0
    void set_pointerPressRaycast(UnityEngine::EventSystems::RaycastResult value);
    // public System.Boolean get_eligibleForClick()
    // Offset: 0x11502D0
    bool get_eligibleForClick();
    // public System.Void set_eligibleForClick(System.Boolean value)
    // Offset: 0x11502D8
    void set_eligibleForClick(bool value);
    // public System.Int32 get_pointerId()
    // Offset: 0x11502E4
    int get_pointerId();
    // public System.Void set_pointerId(System.Int32 value)
    // Offset: 0x11502EC
    void set_pointerId(int value);
    // public UnityEngine.Vector2 get_position()
    // Offset: 0x11502F4
    UnityEngine::Vector2 get_position();
    // public System.Void set_position(UnityEngine.Vector2 value)
    // Offset: 0x11502FC
    void set_position(UnityEngine::Vector2 value);
    // public UnityEngine.Vector2 get_delta()
    // Offset: 0x1150304
    UnityEngine::Vector2 get_delta();
    // public System.Void set_delta(UnityEngine.Vector2 value)
    // Offset: 0x115030C
    void set_delta(UnityEngine::Vector2 value);
    // public UnityEngine.Vector2 get_pressPosition()
    // Offset: 0x1150314
    UnityEngine::Vector2 get_pressPosition();
    // public System.Void set_pressPosition(UnityEngine.Vector2 value)
    // Offset: 0x115031C
    void set_pressPosition(UnityEngine::Vector2 value);
    // public UnityEngine.Vector3 get_worldPosition()
    // Offset: 0x1150324
    UnityEngine::Vector3 get_worldPosition();
    // public System.Void set_worldPosition(UnityEngine.Vector3 value)
    // Offset: 0x1150334
    void set_worldPosition(UnityEngine::Vector3 value);
    // public UnityEngine.Vector3 get_worldNormal()
    // Offset: 0x1150344
    UnityEngine::Vector3 get_worldNormal();
    // public System.Void set_worldNormal(UnityEngine.Vector3 value)
    // Offset: 0x1150354
    void set_worldNormal(UnityEngine::Vector3 value);
    // public System.Single get_clickTime()
    // Offset: 0x1150364
    float get_clickTime();
    // public System.Void set_clickTime(System.Single value)
    // Offset: 0x115036C
    void set_clickTime(float value);
    // public System.Int32 get_clickCount()
    // Offset: 0x1150374
    int get_clickCount();
    // public System.Void set_clickCount(System.Int32 value)
    // Offset: 0x115037C
    void set_clickCount(int value);
    // public UnityEngine.Vector2 get_scrollDelta()
    // Offset: 0x1150384
    UnityEngine::Vector2 get_scrollDelta();
    // public System.Void set_scrollDelta(UnityEngine.Vector2 value)
    // Offset: 0x1150390
    void set_scrollDelta(UnityEngine::Vector2 value);
    // public System.Boolean get_useDragThreshold()
    // Offset: 0x115039C
    bool get_useDragThreshold();
    // public System.Void set_useDragThreshold(System.Boolean value)
    // Offset: 0x11503A4
    void set_useDragThreshold(bool value);
    // public System.Boolean get_dragging()
    // Offset: 0x11503B0
    bool get_dragging();
    // public System.Void set_dragging(System.Boolean value)
    // Offset: 0x11503B8
    void set_dragging(bool value);
    // public UnityEngine.EventSystems.PointerEventData/InputButton get_button()
    // Offset: 0x11503C4
    UnityEngine::EventSystems::PointerEventData::InputButton get_button();
    // public System.Void set_button(UnityEngine.EventSystems.PointerEventData/InputButton value)
    // Offset: 0x11503CC
    void set_button(UnityEngine::EventSystems::PointerEventData::InputButton value);
    // public System.Boolean IsPointerMoving()
    // Offset: 0x11504E4
    bool IsPointerMoving();
    // public System.Boolean IsScrolling()
    // Offset: 0x1150518
    bool IsScrolling();
    // public UnityEngine.Camera get_enterEventCamera()
    // Offset: 0x115054C
    UnityEngine::Camera* get_enterEventCamera();
    // public UnityEngine.Camera get_pressEventCamera()
    // Offset: 0x11505EC
    UnityEngine::Camera* get_pressEventCamera();
    // public UnityEngine.GameObject get_pointerPress()
    // Offset: 0x115068C
    UnityEngine::GameObject* get_pointerPress();
    // public System.Void set_pointerPress(UnityEngine.GameObject value)
    // Offset: 0x1150694
    void set_pointerPress(UnityEngine::GameObject* value);
    // public System.Void .ctor(UnityEngine.EventSystems.EventSystem eventSystem)
    // Offset: 0x11503D4
    // Implemented from: UnityEngine.EventSystems.BaseEventData
    // Base method: System.Void BaseEventData::.ctor(UnityEngine.EventSystems.EventSystem eventSystem)
    static PointerEventData* New_ctor(UnityEngine::EventSystems::EventSystem* eventSystem);
    // public override System.String ToString()
    // Offset: 0x1150748
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::Il2CppString* ToString();
  }; // UnityEngine.EventSystems.PointerEventData
  check_size<sizeof(PointerEventData), 300 + sizeof(UnityEngine::EventSystems::PointerEventData::InputButton) + 8 - (300 + sizeof(UnityEngine::EventSystems::PointerEventData::InputButton)) % 8> __UnityEngine_EventSystems_PointerEventDataSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::EventSystems::PointerEventData*, "UnityEngine.EventSystems", "PointerEventData");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::EventSystems::PointerEventData::InputButton, "UnityEngine.EventSystems", "PointerEventData/InputButton");
#pragma pack(pop)
