// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: BaseRaycaster
  class BaseRaycaster;
}
// Completed forward declares
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Autogenerated type: UnityEngine.EventSystems.RaycastResult
  struct RaycastResult : public System::ValueType {
    public:
    // private UnityEngine.GameObject m_GameObject
    // Offset: 0x0
    UnityEngine::GameObject* m_GameObject;
    // public UnityEngine.EventSystems.BaseRaycaster module
    // Offset: 0x8
    UnityEngine::EventSystems::BaseRaycaster* module;
    // public System.Single distance
    // Offset: 0x10
    float distance;
    // public System.Single index
    // Offset: 0x14
    float index;
    // public System.Int32 depth
    // Offset: 0x18
    int depth;
    // public System.Int32 sortingLayer
    // Offset: 0x1C
    int sortingLayer;
    // public System.Int32 sortingOrder
    // Offset: 0x20
    int sortingOrder;
    // public UnityEngine.Vector3 worldPosition
    // Offset: 0x24
    UnityEngine::Vector3 worldPosition;
    // public UnityEngine.Vector3 worldNormal
    // Offset: 0x30
    UnityEngine::Vector3 worldNormal;
    // public UnityEngine.Vector2 screenPosition
    // Offset: 0x3C
    UnityEngine::Vector2 screenPosition;
    // public System.Int32 displayIndex
    // Offset: 0x44
    int displayIndex;
    // Creating value type constructor for type: RaycastResult
    constexpr RaycastResult(UnityEngine::GameObject* m_GameObject_ = {}, UnityEngine::EventSystems::BaseRaycaster* module_ = {}, float distance_ = {}, float index_ = {}, int depth_ = {}, int sortingLayer_ = {}, int sortingOrder_ = {}, UnityEngine::Vector3 worldPosition_ = {}, UnityEngine::Vector3 worldNormal_ = {}, UnityEngine::Vector2 screenPosition_ = {}, int displayIndex_ = {}) noexcept : m_GameObject{m_GameObject_}, module{module_}, distance{distance_}, index{index_}, depth{depth_}, sortingLayer{sortingLayer_}, sortingOrder{sortingOrder_}, worldPosition{worldPosition_}, worldNormal{worldNormal_}, screenPosition{screenPosition_}, displayIndex{displayIndex_} {}
    // public UnityEngine.GameObject get_gameObject()
    // Offset: 0xA32B48
    UnityEngine::GameObject* get_gameObject();
    // public System.Void set_gameObject(UnityEngine.GameObject value)
    // Offset: 0xA32B50
    void set_gameObject(UnityEngine::GameObject* value);
    // public System.Boolean get_isValid()
    // Offset: 0xA32B58
    bool get_isValid();
    // public System.Void Clear()
    // Offset: 0xA32B60
    void Clear();
    // public override System.String ToString()
    // Offset: 0xA32B68
    // Implemented from: System.ValueType
    // Base method: System.String ValueType::ToString()
    ::Il2CppString* ToString();
  }; // UnityEngine.EventSystems.RaycastResult
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::EventSystems::RaycastResult, "UnityEngine.EventSystems", "RaycastResult");
#pragma pack(pop)
