// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.PointerInputModule
#include "UnityEngine/EventSystems/PointerInputModule.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: PointerEventData because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: StandaloneInputModule
  class StandaloneInputModule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::EventSystems::StandaloneInputModule);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::EventSystems::StandaloneInputModule*, "UnityEngine.EventSystems", "StandaloneInputModule");
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Size: 0xB1
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.EventSystems.StandaloneInputModule
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 1062C04
  class StandaloneInputModule : public ::UnityEngine::EventSystems::PointerInputModule {
    public:
    // Nested type: ::UnityEngine::EventSystems::StandaloneInputModule::InputMode
    struct InputMode;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Single m_PrevActionTime
    // Size: 0x4
    // Offset: 0x58
    float m_PrevActionTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 m_LastMoveVector
    // Size: 0x8
    // Offset: 0x5C
    ::UnityEngine::Vector2 m_LastMoveVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Int32 m_ConsecutiveMoveCount
    // Size: 0x4
    // Offset: 0x64
    int m_ConsecutiveMoveCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector2 m_LastMousePosition
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Vector2 m_LastMousePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_MousePosition
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Vector2 m_MousePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.GameObject m_CurrentFocusedGameObject
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* m_CurrentFocusedGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.EventSystems.PointerEventData m_InputPointerEvent
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::EventSystems::PointerEventData* m_InputPointerEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::PointerEventData*) == 0x8);
    // private System.String m_HorizontalAxis
    // Size: 0x8
    // Offset: 0x88
    ::StringW m_HorizontalAxis;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_VerticalAxis
    // Size: 0x8
    // Offset: 0x90
    ::StringW m_VerticalAxis;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_SubmitButton
    // Size: 0x8
    // Offset: 0x98
    ::StringW m_SubmitButton;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_CancelButton
    // Size: 0x8
    // Offset: 0xA0
    ::StringW m_CancelButton;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single m_InputActionsPerSecond
    // Size: 0x4
    // Offset: 0xA8
    float m_InputActionsPerSecond;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_RepeatDelay
    // Size: 0x4
    // Offset: 0xAC
    float m_RepeatDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x1064C78
    // private System.Boolean m_ForceModuleActive
    // Size: 0x1
    // Offset: 0xB0
    bool m_ForceModuleActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.Single m_PrevActionTime
    float& dyn_m_PrevActionTime();
    // Get instance field reference: private UnityEngine.Vector2 m_LastMoveVector
    ::UnityEngine::Vector2& dyn_m_LastMoveVector();
    // Get instance field reference: private System.Int32 m_ConsecutiveMoveCount
    int& dyn_m_ConsecutiveMoveCount();
    // Get instance field reference: private UnityEngine.Vector2 m_LastMousePosition
    ::UnityEngine::Vector2& dyn_m_LastMousePosition();
    // Get instance field reference: private UnityEngine.Vector2 m_MousePosition
    ::UnityEngine::Vector2& dyn_m_MousePosition();
    // Get instance field reference: private UnityEngine.GameObject m_CurrentFocusedGameObject
    ::UnityEngine::GameObject*& dyn_m_CurrentFocusedGameObject();
