// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.PointerInputModule
#include "UnityEngine/EventSystems/PointerInputModule.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: PointerEventData because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Size: 0x71
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.EventSystems.TouchInputModule
  // [ObsoleteAttribute] Offset: DC5C8C
  // [AddComponentMenu] Offset: DC5C8C
  class TouchInputModule : public UnityEngine::EventSystems::PointerInputModule {
    public:
    // private UnityEngine.Vector2 m_LastMousePosition
    // Size: 0x8
    // Offset: 0x58
    UnityEngine::Vector2 m_LastMousePosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_MousePosition
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::Vector2 m_MousePosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.EventSystems.PointerEventData m_InputPointerEvent
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::EventSystems::PointerEventData* m_InputPointerEvent;
    // Field size check
    static_assert(sizeof(UnityEngine::EventSystems::PointerEventData*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xDC7D04
    // private System.Boolean m_ForceModuleActive
    // Size: 0x1
    // Offset: 0x70
    bool m_ForceModuleActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: TouchInputModule
    TouchInputModule(UnityEngine::Vector2 m_LastMousePosition_ = {}, UnityEngine::Vector2 m_MousePosition_ = {}, UnityEngine::EventSystems::PointerEventData* m_InputPointerEvent_ = {}, bool m_ForceModuleActive_ = {}) noexcept : m_LastMousePosition{m_LastMousePosition_}, m_MousePosition{m_MousePosition_}, m_InputPointerEvent{m_InputPointerEvent_}, m_ForceModuleActive{m_ForceModuleActive_} {}
    // public System.Boolean get_allowActivationOnStandalone()
    // Offset: 0x1436F78
    bool get_allowActivationOnStandalone();
    // public System.Void set_allowActivationOnStandalone(System.Boolean value)
    // Offset: 0x1436F80
    void set_allowActivationOnStandalone(bool value);
    // public System.Boolean get_forceModuleActive()
    // Offset: 0x1436F8C
    bool get_forceModuleActive();
    // public System.Void set_forceModuleActive(System.Boolean value)
    // Offset: 0x1436F94
    void set_forceModuleActive(bool value);
    // private System.Boolean UseFakeInput()
    // Offset: 0x1437274
    bool UseFakeInput();
    // private System.Void FakeTouches()
    // Offset: 0x14372E0
    void FakeTouches();
    // private System.Void ProcessTouchEvents()
    // Offset: 0x1437428
    void ProcessTouchEvents();
    // protected System.Void ProcessTouchPress(UnityEngine.EventSystems.PointerEventData pointerEvent, System.Boolean pressed, System.Boolean released)
    // Offset: 0x143757C
    void ProcessTouchPress(UnityEngine::EventSystems::PointerEventData* pointerEvent, bool pressed, bool released);
    // protected System.Void .ctor()
    // Offset: 0x1436F74
    // Implemented from: UnityEngine.EventSystems.PointerInputModule
    // Base method: System.Void PointerInputModule::.ctor()
    // Base method: System.Void BaseInputModule::.ctor()
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TouchInputModule* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::EventSystems::TouchInputModule::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TouchInputModule*, creationType>()));
    }
    // public override System.Void UpdateModule()
    // Offset: 0x1436FA0
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Void BaseInputModule::UpdateModule()
    void UpdateModule();
    // public override System.Boolean IsModuleSupported()
    // Offset: 0x1437104
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Boolean BaseInputModule::IsModuleSupported()
    bool IsModuleSupported();
    // public override System.Boolean ShouldActivateModule()
    // Offset: 0x1437140
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Boolean BaseInputModule::ShouldActivateModule()
    bool ShouldActivateModule();
    // public override System.Void Process()
    // Offset: 0x14372A8
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Void BaseInputModule::Process()
    void Process();
    // public override System.Void DeactivateModule()
    // Offset: 0x1437C60
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Void BaseInputModule::DeactivateModule()
    void DeactivateModule();
    // public override System.String ToString()
    // Offset: 0x1437C64
    // Implemented from: UnityEngine.EventSystems.PointerInputModule
    // Base method: System.String PointerInputModule::ToString()
    ::Il2CppString* ToString();
  }; // UnityEngine.EventSystems.TouchInputModule
  #pragma pack(pop)
  static check_size<sizeof(TouchInputModule), 112 + sizeof(bool)> __UnityEngine_EventSystems_TouchInputModuleSizeCheck;
  static_assert(sizeof(TouchInputModule) == 0x71);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::EventSystems::TouchInputModule*, "UnityEngine.EventSystems", "TouchInputModule");
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::get_allowActivationOnStandalone
// Il2CppName: get_allowActivationOnStandalone
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::set_allowActivationOnStandalone
// Il2CppName: set_allowActivationOnStandalone
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::get_forceModuleActive
// Il2CppName: get_forceModuleActive
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::set_forceModuleActive
// Il2CppName: set_forceModuleActive
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::UseFakeInput
// Il2CppName: UseFakeInput
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::FakeTouches
// Il2CppName: FakeTouches
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::ProcessTouchEvents
// Il2CppName: ProcessTouchEvents
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::ProcessTouchPress
// Il2CppName: ProcessTouchPress
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::UpdateModule
// Il2CppName: UpdateModule
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::IsModuleSupported
// Il2CppName: IsModuleSupported
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::ShouldActivateModule
// Il2CppName: ShouldActivateModule
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::Process
// Il2CppName: Process
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::DeactivateModule
// Il2CppName: DeactivateModule
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::EventSystems::TouchInputModule::ToString
// Il2CppName: ToString
// Cannot perform method pointer template specialization from operators!
