// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.PointerInputModule
#include "UnityEngine/EventSystems/PointerInputModule.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: PointerEventData because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Size: 0x71
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.EventSystems.TouchInputModule
  // [] Offset: FFFFFFFF
  // [ObsoleteAttribute] Offset: CD8C5C
  // [AddComponentMenu] Offset: CD8C5C
  class TouchInputModule : public UnityEngine::EventSystems::PointerInputModule {
    public:
    // private UnityEngine.Vector2 m_LastMousePosition
    // Size: 0x8
    // Offset: 0x58
    UnityEngine::Vector2 m_LastMousePosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_MousePosition
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::Vector2 m_MousePosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.EventSystems.PointerEventData m_InputPointerEvent
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::EventSystems::PointerEventData* m_InputPointerEvent;
    // Field size check
    static_assert(sizeof(UnityEngine::EventSystems::PointerEventData*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xCDACD4
    // private System.Boolean m_ForceModuleActive
    // Size: 0x1
    // Offset: 0x70
    bool m_ForceModuleActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: TouchInputModule
    TouchInputModule(UnityEngine::Vector2 m_LastMousePosition_ = {}, UnityEngine::Vector2 m_MousePosition_ = {}, UnityEngine::EventSystems::PointerEventData* m_InputPointerEvent_ = {}, bool m_ForceModuleActive_ = {}) noexcept : m_LastMousePosition{m_LastMousePosition_}, m_MousePosition{m_MousePosition_}, m_InputPointerEvent{m_InputPointerEvent_}, m_ForceModuleActive{m_ForceModuleActive_} {}
    // public System.Boolean get_allowActivationOnStandalone()
    // Offset: 0x131879C
    bool get_allowActivationOnStandalone();
    // public System.Void set_allowActivationOnStandalone(System.Boolean value)
    // Offset: 0x13187A4
    void set_allowActivationOnStandalone(bool value);
    // public System.Boolean get_forceModuleActive()
    // Offset: 0x13187B0
    bool get_forceModuleActive();
    // public System.Void set_forceModuleActive(System.Boolean value)
    // Offset: 0x13187B8
    void set_forceModuleActive(bool value);
    // private System.Boolean UseFakeInput()
    // Offset: 0x1318A98
    bool UseFakeInput();
    // private System.Void FakeTouches()
    // Offset: 0x1318B04
    void FakeTouches();
    // private System.Void ProcessTouchEvents()
    // Offset: 0x1318C4C
    void ProcessTouchEvents();
    // protected System.Void ProcessTouchPress(UnityEngine.EventSystems.PointerEventData pointerEvent, System.Boolean pressed, System.Boolean released)
    // Offset: 0x1318DA0
    void ProcessTouchPress(UnityEngine::EventSystems::PointerEventData* pointerEvent, bool pressed, bool released);
    // protected System.Void .ctor()
    // Offset: 0x1318798
    // Implemented from: UnityEngine.EventSystems.PointerInputModule
    // Base method: System.Void PointerInputModule::.ctor()
    // Base method: System.Void BaseInputModule::.ctor()
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TouchInputModule* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::EventSystems::TouchInputModule::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TouchInputModule*, creationType>()));
    }
    // public override System.Void UpdateModule()
    // Offset: 0x13187C4
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Void BaseInputModule::UpdateModule_NEW()
    void UpdateModule();
    // public override System.Boolean IsModuleSupported()
    // Offset: 0x1318928
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Boolean BaseInputModule::IsModuleSupported_NEW()
    bool IsModuleSupported();
    // public override System.Boolean ShouldActivateModule()
    // Offset: 0x1318964
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Boolean BaseInputModule::ShouldActivateModule_NEW()
    bool ShouldActivateModule();
    // public override System.Void Process()
    // Offset: 0x1318ACC
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Void BaseInputModule::Process_NEW()
    void Process();
    // public override System.Void DeactivateModule()
    // Offset: 0x1319484
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Void BaseInputModule::DeactivateModule_NEW()
    void DeactivateModule();
    // public override System.String ToString()
    // Offset: 0x1319488
    // Implemented from: UnityEngine.EventSystems.PointerInputModule
    // Base method: System.String PointerInputModule::ToString()
    ::Il2CppString* ToString();
  }; // UnityEngine.EventSystems.TouchInputModule
  #pragma pack(pop)
  static check_size<sizeof(TouchInputModule), 112 + sizeof(bool)> __UnityEngine_EventSystems_TouchInputModuleSizeCheck;
  static_assert(sizeof(TouchInputModule) == 0x71);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::EventSystems::TouchInputModule*, "UnityEngine.EventSystems", "TouchInputModule");
