// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem
#include "GorillaNetworking/CosmeticsController_CosmeticItem.hpp"
// Including type: GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticSet
#include "GorillaNetworking/CosmeticsController_CosmeticSet.hpp"
// Including type: GorillaNetworking.CosmeticsController/GorillaNetworking.PurchaseItemStages
#include "GorillaNetworking/CosmeticsController_PurchaseItemStages.hpp"
// Including type: GorillaNetworking.CosmeticsController/GorillaNetworking.Wardrobe
#include "GorillaNetworking/CosmeticsController_Wardrobe.hpp"
// Including type: GorillaNetworking.CosmeticsController/GorillaNetworking.ATMStages
#include "GorillaNetworking/CosmeticsController_ATMStages.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"

// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: GorillaComputer
  class GorillaComputer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: CatalogItem
  class CatalogItem;
  // Forward declaring type: UserDataRecord
  class UserDataRecord;
  // Forward declaring type: PurchaseItemResult
  class PurchaseItemResult;
  // Forward declaring type: GetUserDataResult
  class GetUserDataResult;
  // Forward declaring type: ExecuteCloudScriptResult
  class ExecuteCloudScriptResult;
  // Forward declaring type: GetUserInventoryResult
  class GetUserInventoryResult;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: FittingRoomButton
  class FittingRoomButton;
  // Forward declaring type: CosmeticStand
  class CosmeticStand;
  // Forward declaring type: CheckoutCartButton
  class CheckoutCartButton;
  // Forward declaring type: PurchaseItemButton
  class PurchaseItemButton;
  // Forward declaring type: HeadModel
  class HeadModel;
  // Forward declaring type: PurchaseCurrencyButton
  class PurchaseCurrencyButton;
  // Forward declaring type: EarlyAccessButton
  class EarlyAccessButton;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message
  class Message;
  // Forward declaring type: Message`1<T>
  template<typename T>
  class Message_1;
}
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: Purchase
  class Purchase;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Completed forward declares
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: CosmeticsController
  class CosmeticsController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::CosmeticsController);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::CosmeticsController*, "GorillaNetworking", "CosmeticsController");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0x540
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.CosmeticsController
  // [TokenAttribute] Offset: FFFFFFFF
  class CosmeticsController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass102_0
    class $$c__DisplayClass102_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass103_0
    class $$c__DisplayClass103_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$CheckIfMyCosmeticsUpdated$d__103
    class $CheckIfMyCosmeticsUpdated$d__103;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass112_0
    class $$c__DisplayClass112_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass113_0
    class $$c__DisplayClass113_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c
    class $$c;
    // Nested type: ::GorillaNetworking::CosmeticsController::$CheckCanGetDaily$d__114
    class $CheckCanGetDaily$d__114;
    // Nested type: ::GorillaNetworking::CosmeticsController::$GetMyDaily$d__115
    class $GetMyDaily$d__115;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass116_0
    class $$c__DisplayClass116_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass116_1
    class $$c__DisplayClass116_1;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass116_2
    class $$c__DisplayClass116_2;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass116_3
    class $$c__DisplayClass116_3;
    // Nested type: ::GorillaNetworking::CosmeticsController::$CheckIfQuitPurchase$d__124
    class $CheckIfQuitPurchase$d__124;
    public:
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem> allCosmetics
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>* allCosmetics;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem> allCosmeticsDict
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::Dictionary_2<::StringW, ::GorillaNetworking::CosmeticsController_CosmeticItem>* allCosmeticsDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::GorillaNetworking::CosmeticsController_CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.String> allCosmeticsItemIDsfromDisplayNamesDict
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>* allCosmeticsItemIDsfromDisplayNamesDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*) == 0x8);
    // public GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem nullItem
    // Size: 0x32
    // Offset: 0x30
    ::GorillaNetworking::CosmeticsController_CosmeticItem nullItem;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController_CosmeticItem) == 0x32);
    // Padding between fields: nullItem and: catalog
    char __padding3[0x6] = {};
    // public System.String catalog
    // Size: 0x8
    // Offset: 0x68
    ::StringW catalog;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public GorillaNetworking.GorillaComputer computer
    // Size: 0x8
    // Offset: 0x70
    ::GorillaNetworking::GorillaComputer* computer;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaComputer*) == 0x8);
    // private System.String[] tempStringArray
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::StringW> tempStringArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem tempItem
    // Size: 0x32
    // Offset: 0x80
    ::GorillaNetworking::CosmeticsController_CosmeticItem tempItem;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController_CosmeticItem) == 0x32);
    // Padding between fields: tempItem and: catalogItems
    char __padding7[0x6] = {};
    // public System.Collections.Generic.List`1<PlayFab.ClientModels.CatalogItem> catalogItems
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::List_1<::PlayFab::ClientModels::CatalogItem*>* catalogItems;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PlayFab::ClientModels::CatalogItem*>*) == 0x8);
    // public System.Boolean tryTwice
    // Size: 0x1
    // Offset: 0xC0
    bool tryTwice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tryTwice and: tryOnSet
    char __padding9[0x7] = {};
    // public GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticSet tryOnSet
    // Size: 0x112
    // Offset: 0xC8
    ::GorillaNetworking::CosmeticsController_CosmeticSet tryOnSet;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController_CosmeticSet) == 0x112);
    // Padding between fields: tryOnSet and: fittingRoomButtons
    char __padding10[0x6] = {};
    // public FittingRoomButton[] fittingRoomButtons
    // Size: 0x8
    // Offset: 0x1E0
    ::ArrayW<::GlobalNamespace::FittingRoomButton*> fittingRoomButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::FittingRoomButton*>) == 0x8);
    // public CosmeticStand[] cosmeticStands
    // Size: 0x8
    // Offset: 0x1E8
    ::ArrayW<::GlobalNamespace::CosmeticStand*> cosmeticStands;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::CosmeticStand*>) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem> currentCart
    // Size: 0x8
    // Offset: 0x1F0
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>* currentCart;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*) == 0x8);
    // public GorillaNetworking.CosmeticsController/GorillaNetworking.PurchaseItemStages currentPurchaseItemStage
    // Size: 0x4
    // Offset: 0x1F8
    ::GorillaNetworking::CosmeticsController_PurchaseItemStages currentPurchaseItemStage;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController_PurchaseItemStages) == 0x4);
    // Padding between fields: currentPurchaseItemStage and: checkoutCartButtons
    char __padding14[0x4] = {};
    // public CheckoutCartButton[] checkoutCartButtons
    // Size: 0x8
    // Offset: 0x200
    ::ArrayW<::GlobalNamespace::CheckoutCartButton*> checkoutCartButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::CheckoutCartButton*>) == 0x8);
    // public PurchaseItemButton leftPurchaseButton
    // Size: 0x8
    // Offset: 0x208
    ::GlobalNamespace::PurchaseItemButton* leftPurchaseButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PurchaseItemButton*) == 0x8);
    // public PurchaseItemButton rightPurchaseButton
    // Size: 0x8
    // Offset: 0x210
    ::GlobalNamespace::PurchaseItemButton* rightPurchaseButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PurchaseItemButton*) == 0x8);
    // public UnityEngine.UI.Text purchaseText
    // Size: 0x8
    // Offset: 0x218
    ::UnityEngine::UI::Text* purchaseText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem itemToBuy
    // Size: 0x32
    // Offset: 0x220
    ::GorillaNetworking::CosmeticsController_CosmeticItem itemToBuy;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController_CosmeticItem) == 0x32);
    // Padding between fields: itemToBuy and: checkoutHeadModel
    char __padding19[0x6] = {};
    // public HeadModel checkoutHeadModel
    // Size: 0x8
    // Offset: 0x258
    ::GlobalNamespace::HeadModel* checkoutHeadModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HeadModel*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> playerIDList
    // Size: 0x8
    // Offset: 0x260
    ::System::Collections::Generic::List_1<::StringW>* playerIDList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Boolean foundCosmetic
    // Size: 0x1
    // Offset: 0x268
    bool foundCosmetic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: foundCosmetic and: attempts
    char __padding22[0x3] = {};
    // private System.Int32 attempts
    // Size: 0x4
    // Offset: 0x26C
    int attempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String finalLine
    // Size: 0x8
    // Offset: 0x270
    ::StringW finalLine;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean purchaseLocked
    // Size: 0x1
    // Offset: 0x278
    bool purchaseLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isLastHandTouchedLeft
    // Size: 0x1
    // Offset: 0x279
    bool isLastHandTouchedLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isLastHandTouchedLeft and: wardrobes
    char __padding26[0x6] = {};
    // public GorillaNetworking.CosmeticsController/GorillaNetworking.Wardrobe[] wardrobes
    // Size: 0x8
    // Offset: 0x280
    ::ArrayW<::GorillaNetworking::CosmeticsController_Wardrobe> wardrobes;
    // Field size check
    static_assert(sizeof(::ArrayW<::GorillaNetworking::CosmeticsController_Wardrobe>) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem> unlockedCosmetics
    // Size: 0x8
    // Offset: 0x288
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>* unlockedCosmetics;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem> unlockedHats
    // Size: 0x8
    // Offset: 0x290
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>* unlockedHats;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem> unlockedFaces
    // Size: 0x8
    // Offset: 0x298
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>* unlockedFaces;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem> unlockedBadges
    // Size: 0x8
    // Offset: 0x2A0
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>* unlockedBadges;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem> unlockedHoldable
    // Size: 0x8
    // Offset: 0x2A8
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>* unlockedHoldable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*) == 0x8);
    // public System.Int32[] cosmeticsPages
    // Size: 0x8
    // Offset: 0x2B0
    ::ArrayW<int> cosmeticsPages;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem>[] itemLists
    // Size: 0x8
    // Offset: 0x2B8
    ::ArrayW<::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*> itemLists;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*>) == 0x8);
    // private System.Int32 wardrobeType
    // Size: 0x4
    // Offset: 0x2C0
    int wardrobeType;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: wardrobeType and: currentWornSet
    char __padding35[0x4] = {};
    // public GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticSet currentWornSet
    // Size: 0x112
    // Offset: 0x2C8
    ::GorillaNetworking::CosmeticsController_CosmeticSet currentWornSet;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController_CosmeticSet) == 0x112);
    // Padding between fields: currentWornSet and: concatStringCosmeticsAllowed
    char __padding36[0x6] = {};
    // public System.String concatStringCosmeticsAllowed
    // Size: 0x8
    // Offset: 0x3E0
    ::StringW concatStringCosmeticsAllowed;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.UI.Text atmText
    // Size: 0x8
    // Offset: 0x3E8
    ::UnityEngine::UI::Text* atmText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.String currentAtmString
    // Size: 0x8
    // Offset: 0x3F0
    ::StringW currentAtmString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.UI.Text infoText
    // Size: 0x8
    // Offset: 0x3F8
    ::UnityEngine::UI::Text* infoText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text earlyAccessText
    // Size: 0x8
    // Offset: 0x400
    ::UnityEngine::UI::Text* earlyAccessText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text[] purchaseButtonText
    // Size: 0x8
    // Offset: 0x408
    ::ArrayW<::UnityEngine::UI::Text*> purchaseButtonText;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UI::Text*>) == 0x8);
    // public UnityEngine.UI.Text dailyText
    // Size: 0x8
    // Offset: 0x410
    ::UnityEngine::UI::Text* dailyText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public GorillaNetworking.CosmeticsController/GorillaNetworking.ATMStages currentATMStage
    // Size: 0x4
    // Offset: 0x418
    ::GorillaNetworking::CosmeticsController_ATMStages currentATMStage;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController_ATMStages) == 0x4);
    // Padding between fields: currentATMStage and: atmButtonsText
    char __padding44[0x4] = {};
    // public UnityEngine.UI.Text atmButtonsText
    // Size: 0x8
    // Offset: 0x420
    ::UnityEngine::UI::Text* atmButtonsText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.Int32 currencyBalance
    // Size: 0x4
    // Offset: 0x428
    int currencyBalance;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: currencyBalance and: currencyName
    char __padding46[0x4] = {};
    // public System.String currencyName
    // Size: 0x8
    // Offset: 0x430
    ::StringW currencyName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PurchaseCurrencyButton[] purchaseCurrencyButtons
    // Size: 0x8
    // Offset: 0x438
    ::ArrayW<::GlobalNamespace::PurchaseCurrencyButton*> purchaseCurrencyButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::PurchaseCurrencyButton*>) == 0x8);
    // public UnityEngine.UI.Text currencyBoardText
    // Size: 0x8
    // Offset: 0x440
    ::UnityEngine::UI::Text* currencyBoardText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text currencyBoxText
    // Size: 0x8
    // Offset: 0x448
    ::UnityEngine::UI::Text* currencyBoxText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.String startingCurrencyBoxTextString
    // Size: 0x8
    // Offset: 0x450
    ::StringW startingCurrencyBoxTextString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String successfulCurrencyPurchaseTextString
    // Size: 0x8
    // Offset: 0x458
    ::StringW successfulCurrencyPurchaseTextString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 numShinyRocksToBuy
    // Size: 0x4
    // Offset: 0x460
    int numShinyRocksToBuy;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single shinyRocksCost
    // Size: 0x4
    // Offset: 0x464
    float shinyRocksCost;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.String itemToPurchase
    // Size: 0x8
    // Offset: 0x468
    ::StringW itemToPurchase;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean confirmedDidntPlayInBeta
    // Size: 0x1
    // Offset: 0x470
    bool confirmedDidntPlayInBeta;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean playedInBeta
    // Size: 0x1
    // Offset: 0x471
    bool playedInBeta;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean gotMyDaily
    // Size: 0x1
    // Offset: 0x472
    bool gotMyDaily;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean checkedDaily
    // Size: 0x1
    // Offset: 0x473
    bool checkedDaily;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: checkedDaily and: currentPurchaseID
    char __padding59[0x4] = {};
    // public System.String currentPurchaseID
    // Size: 0x8
    // Offset: 0x478
    ::StringW currentPurchaseID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean hasPrice
    // Size: 0x1
    // Offset: 0x480
    bool hasPrice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasPrice and: searchIndex
    char __padding61[0x3] = {};
    // private System.Int32 searchIndex
    // Size: 0x4
    // Offset: 0x484
    int searchIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iterator
    // Size: 0x4
    // Offset: 0x488
    int iterator;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: iterator and: cosmeticItemVar
    char __padding63[0x4] = {};
    // private GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem cosmeticItemVar
    // Size: 0x32
    // Offset: 0x490
    ::GorillaNetworking::CosmeticsController_CosmeticItem cosmeticItemVar;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController_CosmeticItem) == 0x32);
    // Padding between fields: cosmeticItemVar and: earlyAccessButton
    char __padding64[0x6] = {};
    // public EarlyAccessButton earlyAccessButton
    // Size: 0x8
    // Offset: 0x4C8
    ::GlobalNamespace::EarlyAccessButton* earlyAccessButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EarlyAccessButton*) == 0x8);
    // private System.String userToken
    // Size: 0x8
    // Offset: 0x4D0
    ::StringW userToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean triggerAPI
    // Size: 0x1
    // Offset: 0x4D8
    bool triggerAPI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: triggerAPI and: cloudscriptAttempts
    char __padding67[0x3] = {};
    // public System.Int32 cloudscriptAttempts
    // Size: 0x4
    // Offset: 0x4DC
    int cloudscriptAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 userLockAttempts
    // Size: 0x4
    // Offset: 0x4E0
    int userLockAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 attemptsLimit
    // Size: 0x4
    // Offset: 0x4E4
    int attemptsLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean tryGetPurchasesTwice
    // Size: 0x1
    // Offset: 0x4E8
    bool tryGetPurchasesTwice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tryGetPurchasesTwice and: startupSKU
    char __padding71[0x7] = {};
    // public System.String startupSKU
    // Size: 0x8
    // Offset: 0x4F0
    ::StringW startupSKU;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 startupAttempts
    // Size: 0x4
    // Offset: 0x4F8
    int startupAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean oculusAttemptingToPurchase
    // Size: 0x1
    // Offset: 0x4FC
    bool oculusAttemptingToPurchase;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: oculusAttemptingToPurchase and: debugParameters
    char __padding74[0x3] = {};
    // public System.Boolean[] debugParameters
    // Size: 0x8
    // Offset: 0x500
    ::ArrayW<bool> debugParameters;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // public System.Boolean hasLockableItem
    // Size: 0x1
    // Offset: 0x508
    bool hasLockableItem;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasLockableItem and: currentTime
    char __padding76[0x7] = {};
    // public System.DateTime currentTime
    // Size: 0x8
    // Offset: 0x510
    ::System::DateTime currentTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // public System.String lastDailyLogin
    // Size: 0x8
    // Offset: 0x518
    ::StringW lastDailyLogin;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PlayFab.ClientModels.UserDataRecord userDataRecord
    // Size: 0x8
    // Offset: 0x520
    ::PlayFab::ClientModels::UserDataRecord* userDataRecord;
    // Field size check
    static_assert(sizeof(::PlayFab::ClientModels::UserDataRecord*) == 0x8);
    // public System.Int32 secondsUntilTomorrow
    // Size: 0x4
    // Offset: 0x528
    int secondsUntilTomorrow;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single secondsToWaitToCheckDaily
    // Size: 0x4
    // Offset: 0x52C
    float secondsToWaitToCheckDaily;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.String returnString
    // Size: 0x8
    // Offset: 0x530
    ::StringW returnString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String[] returnStringArray
    // Size: 0x8
    // Offset: 0x538
    ::ArrayW<::StringW> returnStringArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static public GorillaNetworking.CosmeticsController instance
    static ::GorillaNetworking::CosmeticsController* _get_instance();
    // Set static field: static public GorillaNetworking.CosmeticsController instance
    static void _set_instance(::GorillaNetworking::CosmeticsController* value);
    // Get instance field reference: public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/GorillaNetworking.CosmeticItem> allCosmetics
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController_CosmeticItem>*& dyn_allCosmetics();
