// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: TextAsset
  class TextAsset;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
}
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: PhotonNetworkController
  class PhotonNetworkController;
  // Forward declaring type: GorillaNetworkJoinTrigger
  class GorillaNetworkJoinTrigger;
  // Forward declaring type: GorillaKeyboardButton
  class GorillaKeyboardButton;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GorillaLevelScreen
  class GorillaLevelScreen;
  // Forward declaring type: GorillaFriendCollider
  class GorillaFriendCollider;
  // Forward declaring type: ModeSelectButton
  class ModeSelectButton;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: GorillaSnapTurn
  class GorillaSnapTurn;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: ExecuteCloudScriptResult
  class ExecuteCloudScriptResult;
  // Forward declaring type: GetTimeResult
  class GetTimeResult;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Completed forward declares
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: GorillaComputer
  class GorillaComputer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::GorillaComputer);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::GorillaComputer*, "GorillaNetworking", "GorillaComputer");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0x238
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.GorillaComputer
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaComputer : public ::Photon::Pun::MonoBehaviourPunCallbacks {
    public:
    // Nested type: ::GorillaNetworking::GorillaComputer::ComputerState
    struct ComputerState;
    // Nested type: ::GorillaNetworking::GorillaComputer::$ButtonColorUpdate$d__78
    class $ButtonColorUpdate$d__78;
    // Nested type: ::GorillaNetworking::GorillaComputer::$$c__DisplayClass125_0
    class $$c__DisplayClass125_0;
    // Nested type: ::GorillaNetworking::GorillaComputer::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ComputerState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ComputerState
      constexpr ComputerState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Startup
      static constexpr const int Startup = 0;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Startup
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Startup();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Startup
      static void _set_Startup(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Color
      static constexpr const int Color = 1;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Color
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Color();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Color
      static void _set_Color(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Name
      static constexpr const int Name = 2;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Name
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Name();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Name
      static void _set_Name(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Turn
      static constexpr const int Turn = 3;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Turn
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Turn();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Turn
      static void _set_Turn(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Mic
      static constexpr const int Mic = 4;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Mic
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Mic();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Mic
      static void _set_Mic(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Room
      static constexpr const int Room = 5;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Room
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Room();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Room
      static void _set_Room(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Queue
      static constexpr const int Queue = 6;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Queue
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Queue();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Queue
      static void _set_Queue(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Group
      static constexpr const int Group = 7;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Group
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Group();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Group
      static void _set_Group(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Voice
      static constexpr const int Voice = 8;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Voice
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Voice();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Voice
      static void _set_Voice(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Credits
      static constexpr const int Credits = 9;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Credits
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Credits();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Credits
      static void _set_Credits(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Visuals
      static constexpr const int Visuals = 10;
      // Get static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Visuals
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Visuals();
      // Set static field: static public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState Visuals
      static void _set_Visuals(::GorillaNetworking::GorillaComputer::ComputerState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState
    #pragma pack(pop)
    static check_size<sizeof(GorillaComputer::ComputerState), 0 + sizeof(int)> __GorillaNetworking_GorillaComputer_ComputerStateSizeCheck;
    static_assert(sizeof(GorillaComputer::ComputerState) == 0x4);
    public:
    // public System.Boolean tryGetTimeAgain
    // Size: 0x1
    // Offset: 0x20
    bool tryGetTimeAgain;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tryGetTimeAgain and: unpressedMaterial
    char __padding0[0x7] = {};
    // public UnityEngine.Material unpressedMaterial
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Material* unpressedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material pressedMaterial
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Material* pressedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public System.String currentTextField
    // Size: 0x8
    // Offset: 0x38
    ::StringW currentTextField;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single buttonFadeTime
    // Size: 0x4
    // Offset: 0x40
    float buttonFadeTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: buttonFadeTime and: offlineScoreboard
    char __padding4[0x4] = {};
    // public UnityEngine.UI.Text offlineScoreboard
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::UI::Text* offlineScoreboard;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text screenText
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::UI::Text* screenText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text functionSelectText
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::UI::Text* functionSelectText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text wallScreenText
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::UI::Text* wallScreenText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text tutorialWallScreenText
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::UI::Text* tutorialWallScreenText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text offlineVRRigNametagText
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::UI::Text* offlineVRRigNametagText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.String versionText
    // Size: 0x8
    // Offset: 0x78
    ::StringW versionText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String versionMismatch
    // Size: 0x8
    // Offset: 0x80
    ::StringW versionMismatch;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String unableToConnect
    // Size: 0x8
    // Offset: 0x88
    ::StringW unableToConnect;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.Material wrongVersionMaterial
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Material* wrongVersionMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.MeshRenderer wallScreenRenderer
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::MeshRenderer* wallScreenRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.MeshRenderer tutorialWallScreenRenderer
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::MeshRenderer* tutorialWallScreenRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.MeshRenderer computerScreenRenderer
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::MeshRenderer* computerScreenRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.MeshRenderer scoreboardRenderer
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::MeshRenderer* scoreboardRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public GorillaLevelScreen[] levelScreens
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<::GlobalNamespace::GorillaLevelScreen*> levelScreens;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::GorillaLevelScreen*>) == 0x8);
    // public System.Int64 startupMillis
    // Size: 0x8
    // Offset: 0xC0
    int64_t startupMillis;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public UnityEngine.UI.Text currentGameModeText
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::UI::Text* currentGameModeText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.Int32 includeUpdatedServerSynchTest
    // Size: 0x4
    // Offset: 0xD0
    int includeUpdatedServerSynchTest;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: includeUpdatedServerSynchTest and: networkController
    char __padding22[0x4] = {};
    // public GorillaNetworking.PhotonNetworkController networkController
    // Size: 0x8
    // Offset: 0xD8
    ::GorillaNetworking::PhotonNetworkController* networkController;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::PhotonNetworkController*) == 0x8);
    // public System.Single updateCooldown
    // Size: 0x4
    // Offset: 0xE0
    float updateCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastUpdateTime
    // Size: 0x4
    // Offset: 0xE4
    float lastUpdateTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean isConnectedToMaster
    // Size: 0x1
    // Offset: 0xE8
    bool isConnectedToMaster;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isConnectedToMaster and: allowedMapsToJoin
    char __padding26[0x7] = {};
    // public System.String[] allowedMapsToJoin
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<::StringW> allowedMapsToJoin;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public GorillaNetworking.GorillaComputer/GorillaNetworking.ComputerState currentState
    // Size: 0x4
    // Offset: 0xF8
    ::GorillaNetworking::GorillaComputer::ComputerState currentState;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaComputer::ComputerState) == 0x4);
    // private System.Int32 usersBanned
    // Size: 0x4
    // Offset: 0xFC
    int usersBanned;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.UI.Text motdText
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::UI::Text* motdText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private System.String lastMOTD
    // Size: 0x8
    // Offset: 0x108
    ::StringW lastMOTD;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.Material updatedMOTDMaterial
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Material* updatedMOTDMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.MeshRenderer motdRenderer
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::MeshRenderer* motdRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private System.Single redValue
    // Size: 0x4
    // Offset: 0x120
    float redValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: redValue and: redText
    char __padding34[0x4] = {};
    // private System.String redText
    // Size: 0x8
    // Offset: 0x128
    ::StringW redText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single blueValue
    // Size: 0x4
    // Offset: 0x130
    float blueValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: blueValue and: blueText
    char __padding36[0x4] = {};
    // private System.String blueText
    // Size: 0x8
    // Offset: 0x138
    ::StringW blueText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single greenValue
    // Size: 0x4
    // Offset: 0x140
    float greenValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: greenValue and: greenText
    char __padding38[0x4] = {};
    // private System.String greenText
    // Size: 0x8
    // Offset: 0x148
    ::StringW greenText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 colorCursorLine
    // Size: 0x4
    // Offset: 0x150
    int colorCursorLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: colorCursorLine and: savedName
    char __padding40[0x4] = {};
    // public System.String savedName
    // Size: 0x8
    // Offset: 0x158
    ::StringW savedName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String currentName
    // Size: 0x8
    // Offset: 0x160
    ::StringW currentName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String[] exactOneWeek
    // Size: 0x8
    // Offset: 0x168
    ::ArrayW<::StringW> exactOneWeek;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String[] anywhereOneWeek
    // Size: 0x8
    // Offset: 0x170
    ::ArrayW<::StringW> anywhereOneWeek;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String[] anywhereTwoWeek
    // Size: 0x8
    // Offset: 0x178
    ::ArrayW<::StringW> anywhereTwoWeek;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public UnityEngine.TextAsset exactOneWeekFile
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::TextAsset* exactOneWeekFile;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset anywhereOneWeekFile
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::TextAsset* anywhereOneWeekFile;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset anywhereTwoWeekFile
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::TextAsset* anywhereTwoWeekFile;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public System.String roomToJoin
    // Size: 0x8
    // Offset: 0x198
    ::StringW roomToJoin;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean roomFull
    // Size: 0x1
    // Offset: 0x1A0
    bool roomFull;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean roomNotAllowed
    // Size: 0x1
    // Offset: 0x1A1
    bool roomNotAllowed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: roomNotAllowed and: turnValue
    char __padding51[0x2] = {};
    // private System.Int32 turnValue
    // Size: 0x4
    // Offset: 0x1A4
    int turnValue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String turnType
    // Size: 0x8
    // Offset: 0x1A8
    ::StringW turnType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn gorillaTurn
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn* gorillaTurn;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*) == 0x8);
    // public System.String pttType
    // Size: 0x8
    // Offset: 0x1B8
    ::StringW pttType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String currentQueue
    // Size: 0x8
    // Offset: 0x1C0
    ::StringW currentQueue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean allowedInCompetitive
    // Size: 0x1
    // Offset: 0x1C8
    bool allowedInCompetitive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allowedInCompetitive and: groupMapJoin
    char __padding57[0x7] = {};
    // public System.String groupMapJoin
    // Size: 0x8
    // Offset: 0x1D0
    ::StringW groupMapJoin;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 groupMapJoinIndex
    // Size: 0x4
    // Offset: 0x1D8
    int groupMapJoinIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: groupMapJoinIndex and: friendJoinCollider
    char __padding59[0x4] = {};
    // public GorillaFriendCollider friendJoinCollider
    // Size: 0x8
    // Offset: 0x1E0
    ::GlobalNamespace::GorillaFriendCollider* friendJoinCollider;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaFriendCollider*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger caveMapTrigger
    // Size: 0x8
    // Offset: 0x1E8
    ::GorillaNetworking::GorillaNetworkJoinTrigger* caveMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger forestMapTrigger
    // Size: 0x8
    // Offset: 0x1F0
    ::GorillaNetworking::GorillaNetworkJoinTrigger* forestMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger canyonMapTrigger
    // Size: 0x8
    // Offset: 0x1F8
    ::GorillaNetworking::GorillaNetworkJoinTrigger* canyonMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger cityMapTrigger
    // Size: 0x8
    // Offset: 0x200
    ::GorillaNetworking::GorillaNetworkJoinTrigger* cityMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger mountainMapTrigger
    // Size: 0x8
    // Offset: 0x208
    ::GorillaNetworking::GorillaNetworkJoinTrigger* mountainMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public System.String voiceChatOn
    // Size: 0x8
    // Offset: 0x210
    ::StringW voiceChatOn;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public ModeSelectButton[] modeSelectButtons
    // Size: 0x8
    // Offset: 0x218
    ::ArrayW<::GlobalNamespace::ModeSelectButton*> modeSelectButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::ModeSelectButton*>) == 0x8);
    // public System.String currentGameMode
    // Size: 0x8
    // Offset: 0x220
    ::StringW currentGameMode;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean disableParticles
    // Size: 0x1
    // Offset: 0x228
    bool disableParticles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableParticles and: instrumentVolume
    char __padding69[0x3] = {};
    // public System.Single instrumentVolume
    // Size: 0x4
    // Offset: 0x22C
    float instrumentVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Material[] updatedMaterials
    // Size: 0x8
    // Offset: 0x230
    ::ArrayW<::UnityEngine::Material*> updatedMaterials;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    public:
    // Get static field: static public GorillaNetworking.GorillaComputer instance
    static ::GorillaNetworking::GorillaComputer* _get_instance();
    // Set static field: static public GorillaNetworking.GorillaComputer instance
    static void _set_instance(::GorillaNetworking::GorillaComputer* value);
    // Get instance field reference: public System.Boolean tryGetTimeAgain
    [[deprecated("Use field access instead!")]] bool& dyn_tryGetTimeAgain();
    // Get instance field reference: public UnityEngine.Material unpressedMaterial
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_unpressedMaterial();
    // Get instance field reference: public UnityEngine.Material pressedMaterial
