// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaTriggerBox
#include "GlobalNamespace/GorillaTriggerBox.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: PhotonNetworkController
  class PhotonNetworkController;
}
// Completed forward declares
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: GorillaNetworkLobbyJoinTrigger
  class GorillaNetworkLobbyJoinTrigger;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::GorillaNetworkLobbyJoinTrigger);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::GorillaNetworkLobbyJoinTrigger*, "GorillaNetworking", "GorillaNetworkLobbyJoinTrigger");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.GorillaNetworkLobbyJoinTrigger
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaNetworkLobbyJoinTrigger : public ::GlobalNamespace::GorillaTriggerBox {
    public:
    // Writing base type padding for base size: 0x19 to desired offset: 0x20
    char ___base_padding[0x7] = {};
    public:
    // public UnityEngine.GameObject[] makeSureThisIsDisabled
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::GameObject*> makeSureThisIsDisabled;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] makeSureThisIsEnabled
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::GameObject*> makeSureThisIsEnabled;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public System.String gameModeName
    // Size: 0x8
    // Offset: 0x30
    ::StringW gameModeName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public GorillaNetworking.PhotonNetworkController photonNetworkController
    // Size: 0x8
    // Offset: 0x38
    ::GorillaNetworking::PhotonNetworkController* photonNetworkController;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::PhotonNetworkController*) == 0x8);
    // public System.String componentTypeToRemove
    // Size: 0x8
    // Offset: 0x40
    ::StringW componentTypeToRemove;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject componentRemoveTarget
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* componentRemoveTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String componentTypeToAdd
    // Size: 0x8
    // Offset: 0x50
    ::StringW componentTypeToAdd;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject componentAddTarget
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* componentAddTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject gorillaParent
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* gorillaParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject joinFailedBlock
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* joinFailedBlock;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.GameObject[] makeSureThisIsDisabled
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_makeSureThisIsDisabled();
    // Get instance field reference: public UnityEngine.GameObject[] makeSureThisIsEnabled
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_makeSureThisIsEnabled();
    // Get instance field reference: public System.String gameModeName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_gameModeName();
    // Get instance field reference: public GorillaNetworking.PhotonNetworkController photonNetworkController
    [[deprecated("Use field access instead!")]] ::GorillaNetworking::PhotonNetworkController*& dyn_photonNetworkController();
    // Get instance field reference: public System.String componentTypeToRemove
    [[deprecated("Use field access instead!")]] ::StringW& dyn_componentTypeToRemove();
    // Get instance field reference: public UnityEngine.GameObject componentRemoveTarget
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_componentRemoveTarget();
    // Get instance field reference: public System.String componentTypeToAdd
    [[deprecated("Use field access instead!")]] ::StringW& dyn_componentTypeToAdd();
    // Get instance field reference: public UnityEngine.GameObject componentAddTarget
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_componentAddTarget();
    // Get instance field reference: public UnityEngine.GameObject gorillaParent
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_gorillaParent();
    // Get instance field reference: public UnityEngine.GameObject joinFailedBlock
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_joinFailedBlock();
    // public System.Void .ctor()
    // Offset: 0xC73E10
    // Implemented from: GorillaTriggerBox
    // Base method: System.Void GorillaTriggerBox::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GorillaNetworkLobbyJoinTrigger* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaNetworking::GorillaNetworkLobbyJoinTrigger::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GorillaNetworkLobbyJoinTrigger*, creationType>()));
    }
  }; // GorillaNetworking.GorillaNetworkLobbyJoinTrigger
  #pragma pack(pop)
  static check_size<sizeof(GorillaNetworkLobbyJoinTrigger), 104 + sizeof(::UnityEngine::GameObject*)> __GorillaNetworking_GorillaNetworkLobbyJoinTriggerSizeCheck;
  static_assert(sizeof(GorillaNetworkLobbyJoinTrigger) == 0x70);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GorillaNetworking::GorillaNetworkLobbyJoinTrigger::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
