// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: PlayFabAuthenticator
  class PlayFabAuthenticator;
  // Forward declaring type: GorillaNetworkJoinTrigger
  class GorillaNetworkJoinTrigger;
  // Skipping declaration: ConnectionState because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: DisconnectCause
  struct DisconnectCause;
  // Forward declaring type: FriendInfo
  class FriendInfo;
}
// Completed forward declares
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: PhotonNetworkController
  class PhotonNetworkController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::PhotonNetworkController);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::PhotonNetworkController*, "GorillaNetworking", "PhotonNetworkController");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0x131
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.PhotonNetworkController
  // [TokenAttribute] Offset: FFFFFFFF
  class PhotonNetworkController : public ::Photon::Pun::MonoBehaviourPunCallbacks {
    public:
    // Nested type: ::GorillaNetworking::PhotonNetworkController::ConnectionState
    struct ConnectionState;
    // Nested type: ::GorillaNetworking::PhotonNetworkController::ConnectionEvent
    struct ConnectionEvent;
    // Nested type: ::GorillaNetworking::PhotonNetworkController::$DisableOnStart$d__53
    class $DisableOnStart$d__53;
    // Nested type: ::GorillaNetworking::PhotonNetworkController::$SearchForFriendToJoin$d__90
    class $SearchForFriendToJoin$d__90;
    // Nested type: ::GorillaNetworking::PhotonNetworkController::$UpdatePlayerCount$d__94
    class $UpdatePlayerCount$d__94;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ConnectionState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ConnectionState
      constexpr ConnectionState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState Initialization
      static constexpr const int Initialization = 0;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState Initialization
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_Initialization();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState Initialization
      static void _set_Initialization(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState WrongVersion
      static constexpr const int WrongVersion = 1;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState WrongVersion
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_WrongVersion();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState WrongVersion
      static void _set_WrongVersion(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState DeterminingPingsAndPlayerCount
      static constexpr const int DeterminingPingsAndPlayerCount = 2;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState DeterminingPingsAndPlayerCount
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_DeterminingPingsAndPlayerCount();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState DeterminingPingsAndPlayerCount
      static void _set_DeterminingPingsAndPlayerCount(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState ConnectedAndWaiting
      static constexpr const int ConnectedAndWaiting = 3;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState ConnectedAndWaiting
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_ConnectedAndWaiting();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState ConnectedAndWaiting
      static void _set_ConnectedAndWaiting(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState DisconnectingFromRoom
      static constexpr const int DisconnectingFromRoom = 4;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState DisconnectingFromRoom
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_DisconnectingFromRoom();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState DisconnectingFromRoom
      static void _set_DisconnectingFromRoom(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState JoiningPublicRoom
      static constexpr const int JoiningPublicRoom = 5;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState JoiningPublicRoom
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_JoiningPublicRoom();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState JoiningPublicRoom
      static void _set_JoiningPublicRoom(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState JoiningSpecificRoom
      static constexpr const int JoiningSpecificRoom = 6;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState JoiningSpecificRoom
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_JoiningSpecificRoom();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState JoiningSpecificRoom
      static void _set_JoiningSpecificRoom(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState JoiningFriend
      static constexpr const int JoiningFriend = 7;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState JoiningFriend
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_JoiningFriend();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState JoiningFriend
      static void _set_JoiningFriend(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState InPrivateRoom
      static constexpr const int InPrivateRoom = 8;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState InPrivateRoom
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_InPrivateRoom();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState InPrivateRoom
      static void _set_InPrivateRoom(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // static field const value: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState InPublicRoom
      static constexpr const int InPublicRoom = 9;
      // Get static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState InPublicRoom
      static ::GorillaNetworking::PhotonNetworkController::ConnectionState _get_InPublicRoom();
      // Set static field: static public GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState InPublicRoom
      static void _set_InPublicRoom(::GorillaNetworking::PhotonNetworkController::ConnectionState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState
    #pragma pack(pop)
    static check_size<sizeof(PhotonNetworkController::ConnectionState), 0 + sizeof(int)> __GorillaNetworking_PhotonNetworkController_ConnectionStateSizeCheck;
    static_assert(sizeof(PhotonNetworkController::ConnectionState) == 0x4);
    public:
    // public System.Int32 incrementCounter
    // Size: 0x4
    // Offset: 0x20
    int incrementCounter;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState currentState
    // Size: 0x4
    // Offset: 0x24
    ::GorillaNetworking::PhotonNetworkController::ConnectionState currentState;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::PhotonNetworkController::ConnectionState) == 0x4);
    // public GorillaNetworking.PlayFabAuthenticator playFabAuthenticator
    // Size: 0x8
    // Offset: 0x28
    ::GorillaNetworking::PlayFabAuthenticator* playFabAuthenticator;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::PlayFabAuthenticator*) == 0x8);
    // public System.String[] serverRegions
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::StringW> serverRegions;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String _gameVersion
    // Size: 0x8
    // Offset: 0x38
    ::StringW gameVersion;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean isPrivate
    // Size: 0x1
    // Offset: 0x40
    bool isPrivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPrivate and: customRoomID
    char __padding5[0x7] = {};
    // public System.String customRoomID
    // Size: 0x8
    // Offset: 0x48
    ::StringW customRoomID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject playerOffset
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* playerOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.SkinnedMeshRenderer[] offlineVRRig
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::SkinnedMeshRenderer*> offlineVRRig;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::SkinnedMeshRenderer*>) == 0x8);
    // public System.Boolean attemptingToConnect
    // Size: 0x1
    // Offset: 0x60
    bool attemptingToConnect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: attemptingToConnect and: currentRegionIndex
    char __padding9[0x3] = {};
    // private System.Int32 currentRegionIndex
    // Size: 0x4
    // Offset: 0x64
    int currentRegionIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.String currentGameType
    // Size: 0x8
    // Offset: 0x68
    ::StringW currentGameType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean wrongVersion
    // Size: 0x1
    // Offset: 0x70
    bool wrongVersion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean roomCosmeticsInitialized
    // Size: 0x1
    // Offset: 0x71
    bool roomCosmeticsInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: roomCosmeticsInitialized and: photonVoiceObjectPrefab
    char __padding13[0x6] = {};
    // public UnityEngine.GameObject photonVoiceObjectPrefab
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* photonVoiceObjectPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.Boolean> playerCosmeticsLookup
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::Dictionary_2<::StringW, bool>* playerCosmeticsLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, bool>*) == 0x8);
    // private System.Boolean pastFirstConnection
    // Size: 0x1
    // Offset: 0x88
    bool pastFirstConnection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: pastFirstConnection and: lastHeadRightHandDistance
    char __padding16[0x3] = {};
    // private System.Single lastHeadRightHandDistance
    // Size: 0x4
    // Offset: 0x8C
    float lastHeadRightHandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastHeadLeftHandDistance
    // Size: 0x4
    // Offset: 0x90
    float lastHeadLeftHandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single pauseTime
    // Size: 0x4
    // Offset: 0x94
    float pauseTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single disconnectTime
    // Size: 0x4
    // Offset: 0x98
    float disconnectTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean disableAFKKick
    // Size: 0x1
    // Offset: 0x9C
    bool disableAFKKick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableAFKKick and: headRightHandDistance
    char __padding21[0x3] = {};
    // private System.Single headRightHandDistance
    // Size: 0x4
    // Offset: 0xA0
    float headRightHandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single headLeftHandDistance
    // Size: 0x4
    // Offset: 0xA4
    float headLeftHandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion headQuat
    // Size: 0x10
    // Offset: 0xA8
    ::UnityEngine::Quaternion headQuat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion lastHeadQuat
    // Size: 0x10
    // Offset: 0xB8
    ::UnityEngine::Quaternion lastHeadQuat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.GameObject[] disableOnStartup
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<::UnityEngine::GameObject*> disableOnStartup;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] enableOnStartup
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::UnityEngine::GameObject*> enableOnStartup;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private System.String roomCharacters
    // Size: 0x8
    // Offset: 0xD8
    ::StringW roomCharacters;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean updatedName
    // Size: 0x1
    // Offset: 0xE0
    bool updatedName;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: updatedName and: playersInRegion
    char __padding29[0x7] = {};
    // private System.Int32[] playersInRegion
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<int> playersInRegion;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Int32[] pingInRegion
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<int> pingInRegion;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Collections.Generic.List`1<System.String> friendIDList
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::StringW>* friendIDList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Boolean successfullyFoundFriend
    // Size: 0x1
    // Offset: 0x100
    bool successfullyFoundFriend;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: successfullyFoundFriend and: startingToLookForFriend
    char __padding33[0x3] = {};
    // private System.Single startingToLookForFriend
    // Size: 0x4
    // Offset: 0x104
    float startingToLookForFriend;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single timeToSpendLookingForFriend
    // Size: 0x4
    // Offset: 0x108
    float timeToSpendLookingForFriend;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean joiningWithFriend
    // Size: 0x1
    // Offset: 0x10C
    bool joiningWithFriend;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: joiningWithFriend and: friendToFollow
    char __padding36[0x3] = {};
    // private System.String friendToFollow
    // Size: 0x8
    // Offset: 0x110
    ::StringW friendToFollow;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean isRoomFull
    // Size: 0x1
    // Offset: 0x118
    bool isRoomFull;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean doesRoomExist
    // Size: 0x1
    // Offset: 0x119
    bool doesRoomExist;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean createRoom
    // Size: 0x1
    // Offset: 0x11A
    bool createRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: createRoom and: privateTrigger
    char __padding40[0x5] = {};
    // public GorillaNetworking.GorillaNetworkJoinTrigger privateTrigger
    // Size: 0x8
    // Offset: 0x120
    ::GorillaNetworking::GorillaNetworkJoinTrigger* privateTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger currentJoinTrigger
    // Size: 0x8
    // Offset: 0x128
    ::GorillaNetworking::GorillaNetworkJoinTrigger* currentJoinTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public System.Boolean allowedInPubRoom
    // Size: 0x1
    // Offset: 0x130
    bool allowedInPubRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static public GorillaNetworking.PhotonNetworkController Instance
    static ::GorillaNetworking::PhotonNetworkController* _get_Instance();
    // Set static field: static public GorillaNetworking.PhotonNetworkController Instance
    static void _set_Instance(::GorillaNetworking::PhotonNetworkController* value);
    // Get instance field reference: public System.Int32 incrementCounter
    [[deprecated("Use field access instead!")]] int& dyn_incrementCounter();
    // Get instance field reference: private GorillaNetworking.PhotonNetworkController/GorillaNetworking.ConnectionState currentState
    [[deprecated("Use field access instead!")]] ::GorillaNetworking::PhotonNetworkController::ConnectionState& dyn_currentState();
    // Get instance field reference: public GorillaNetworking.PlayFabAuthenticator playFabAuthenticator
