// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.UI.ILayoutSelfController
#include "UnityEngine/UI/ILayoutSelfController.hpp"
// Including type: UnityEngine.DrivenRectTransformTracker
#include "UnityEngine/DrivenRectTransformTracker.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Skipping declaration: AspectMode because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UI.AspectRatioFitter
  // [] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: D7CCC0
  // [ExecuteAlways] Offset: D7CCC0
  // [RequireComponent] Offset: D7CCC0
  // [DisallowMultipleComponent] Offset: D7CCC0
  class AspectRatioFitter : public UnityEngine::EventSystems::UIBehaviour/*, public UnityEngine::UI::ILayoutSelfController*/ {
    public:
    // Nested type: UnityEngine::UI::AspectRatioFitter::AspectMode
    struct AspectMode;
    // Size: 0x4
    // Autogenerated type: UnityEngine.UI.AspectRatioFitter/AspectMode
    // [] Offset: FFFFFFFF
    struct AspectMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: AspectMode
      constexpr AspectMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.AspectRatioFitter/AspectMode None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode None
      static UnityEngine::UI::AspectRatioFitter::AspectMode _get_None();
      // Set static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode None
      static void _set_None(UnityEngine::UI::AspectRatioFitter::AspectMode value);
      // static field const value: static public UnityEngine.UI.AspectRatioFitter/AspectMode WidthControlsHeight
      static constexpr const int WidthControlsHeight = 1;
      // Get static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode WidthControlsHeight
      static UnityEngine::UI::AspectRatioFitter::AspectMode _get_WidthControlsHeight();
      // Set static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode WidthControlsHeight
      static void _set_WidthControlsHeight(UnityEngine::UI::AspectRatioFitter::AspectMode value);
      // static field const value: static public UnityEngine.UI.AspectRatioFitter/AspectMode HeightControlsWidth
      static constexpr const int HeightControlsWidth = 2;
      // Get static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode HeightControlsWidth
      static UnityEngine::UI::AspectRatioFitter::AspectMode _get_HeightControlsWidth();
      // Set static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode HeightControlsWidth
      static void _set_HeightControlsWidth(UnityEngine::UI::AspectRatioFitter::AspectMode value);
      // static field const value: static public UnityEngine.UI.AspectRatioFitter/AspectMode FitInParent
      static constexpr const int FitInParent = 3;
      // Get static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode FitInParent
      static UnityEngine::UI::AspectRatioFitter::AspectMode _get_FitInParent();
      // Set static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode FitInParent
      static void _set_FitInParent(UnityEngine::UI::AspectRatioFitter::AspectMode value);
      // static field const value: static public UnityEngine.UI.AspectRatioFitter/AspectMode EnvelopeParent
      static constexpr const int EnvelopeParent = 4;
      // Get static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode EnvelopeParent
      static UnityEngine::UI::AspectRatioFitter::AspectMode _get_EnvelopeParent();
      // Set static field: static public UnityEngine.UI.AspectRatioFitter/AspectMode EnvelopeParent
      static void _set_EnvelopeParent(UnityEngine::UI::AspectRatioFitter::AspectMode value);
    }; // UnityEngine.UI.AspectRatioFitter/AspectMode
    static check_size<sizeof(AspectRatioFitter::AspectMode), 0 + sizeof(int)> __UnityEngine_UI_AspectRatioFitter_AspectModeSizeCheck;
    static_assert(sizeof(AspectRatioFitter::AspectMode) == 0x4);
    // private UnityEngine.UI.AspectRatioFitter/AspectMode m_AspectMode
    // Size: 0x4
    // Offset: 0x18
    UnityEngine::UI::AspectRatioFitter::AspectMode m_AspectMode;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::AspectRatioFitter::AspectMode) == 0x4);
    // private System.Single m_AspectRatio
    // Size: 0x4
    // Offset: 0x1C
    float m_AspectRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.RectTransform m_Rect
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::RectTransform* m_Rect;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private System.Boolean m_DelayedSetDirty
    // Size: 0x1
    // Offset: 0x28
    bool m_DelayedSetDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.DrivenRectTransformTracker m_Tracker
    // Size: 0x1
    // Offset: 0x29
    UnityEngine::DrivenRectTransformTracker m_Tracker;
    // Field size check
    static_assert(sizeof(UnityEngine::DrivenRectTransformTracker) == 0x1);
    // Creating value type constructor for type: AspectRatioFitter
    AspectRatioFitter(UnityEngine::UI::AspectRatioFitter::AspectMode m_AspectMode_ = {}, float m_AspectRatio_ = {}, UnityEngine::RectTransform* m_Rect_ = {}, bool m_DelayedSetDirty_ = {}, UnityEngine::DrivenRectTransformTracker m_Tracker_ = {}) noexcept : m_AspectMode{m_AspectMode_}, m_AspectRatio{m_AspectRatio_}, m_Rect{m_Rect_}, m_DelayedSetDirty{m_DelayedSetDirty_}, m_Tracker{m_Tracker_} {}
    // Creating interface conversion operator: operator UnityEngine::UI::ILayoutSelfController
    operator UnityEngine::UI::ILayoutSelfController() noexcept {
      return *reinterpret_cast<UnityEngine::UI::ILayoutSelfController*>(this);
    }
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public UnityEngine.UI.AspectRatioFitter/AspectMode get_aspectMode()
    // Offset: 0x1155C78
    UnityEngine::UI::AspectRatioFitter::AspectMode get_aspectMode();
    // public System.Void set_aspectMode(UnityEngine.UI.AspectRatioFitter/AspectMode value)
    // Offset: 0x1155C80
    void set_aspectMode(UnityEngine::UI::AspectRatioFitter::AspectMode value);
    // public System.Single get_aspectRatio()
    // Offset: 0x1155D00
    float get_aspectRatio();
    // public System.Void set_aspectRatio(System.Single value)
    // Offset: 0x1155D08
    void set_aspectRatio(float value);
    // private UnityEngine.RectTransform get_rectTransform()
    // Offset: 0x1155D84
    UnityEngine::RectTransform* get_rectTransform();
    // protected System.Void Update()
    // Offset: 0x1155EC8
    void Update();
    // private System.Void UpdateRect()
    // Offset: 0x1155EE0
    void UpdateRect();
    // private System.Single GetSizeDeltaToProduceSize(System.Single size, System.Int32 axis)
    // Offset: 0x1156298
    float GetSizeDeltaToProduceSize(float size, int axis);
    // private UnityEngine.Vector2 GetParentSize()
    // Offset: 0x1156190
    UnityEngine::Vector2 GetParentSize();
    // protected System.Void SetDirty()
    // Offset: 0x1155CFC
    void SetDirty();
    // protected System.Void .ctor()
    // Offset: 0x1155E30
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AspectRatioFitter* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::UI::AspectRatioFitter::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AspectRatioFitter*, creationType>()));
    }
    // protected override System.Void OnEnable()
    // Offset: 0x1155E40
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnEnable()
    void OnEnable();
    // protected override System.Void OnDisable()
    // Offset: 0x1155E44
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnDisable()
    void OnDisable();
    // protected override System.Void OnRectTransformDimensionsChange()
    // Offset: 0x1155EDC
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnRectTransformDimensionsChange()
    void OnRectTransformDimensionsChange();
    // public System.Void SetLayoutHorizontal()
    // Offset: 0x115634C
    // Implemented from: UnityEngine.UI.ILayoutController
    // Base method: System.Void ILayoutController::SetLayoutHorizontal()
    void SetLayoutHorizontal();
    // public System.Void SetLayoutVertical()
    // Offset: 0x1156350
    // Implemented from: UnityEngine.UI.ILayoutController
    // Base method: System.Void ILayoutController::SetLayoutVertical()
    void SetLayoutVertical();
  }; // UnityEngine.UI.AspectRatioFitter
  // WARNING Not writing size check since size may be invalid!
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::AspectRatioFitter*, "UnityEngine.UI", "AspectRatioFitter");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::AspectRatioFitter::AspectMode, "UnityEngine.UI", "AspectRatioFitter/AspectMode");
