// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Canvas
  class Canvas;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Skipping declaration: ScaleMode because it is already included!
  // Skipping declaration: ScreenMatchMode because it is already included!
  // Skipping declaration: Unit because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.CanvasScaler
  // [RequireComponent] Offset: CD95B4
  // [ExecuteAlways] Offset: CD95B4
  // [AddComponentMenu] Offset: CD95B4
  // [DisallowMultipleComponent] Offset: CD95B4
  class CanvasScaler : public UnityEngine::EventSystems::UIBehaviour {
    public:
    // Nested type: UnityEngine::UI::CanvasScaler::ScaleMode
    struct ScaleMode;
    // Nested type: UnityEngine::UI::CanvasScaler::ScreenMatchMode
    struct ScreenMatchMode;
    // Nested type: UnityEngine::UI::CanvasScaler::Unit
    struct Unit;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.CanvasScaler/ScaleMode
    struct ScaleMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ScaleMode
      constexpr ScaleMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.CanvasScaler/ScaleMode ConstantPixelSize
      static constexpr const int ConstantPixelSize = 0;
      // Get static field: static public UnityEngine.UI.CanvasScaler/ScaleMode ConstantPixelSize
      static UnityEngine::UI::CanvasScaler::ScaleMode _get_ConstantPixelSize();
      // Set static field: static public UnityEngine.UI.CanvasScaler/ScaleMode ConstantPixelSize
      static void _set_ConstantPixelSize(UnityEngine::UI::CanvasScaler::ScaleMode value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/ScaleMode ScaleWithScreenSize
      static constexpr const int ScaleWithScreenSize = 1;
      // Get static field: static public UnityEngine.UI.CanvasScaler/ScaleMode ScaleWithScreenSize
      static UnityEngine::UI::CanvasScaler::ScaleMode _get_ScaleWithScreenSize();
      // Set static field: static public UnityEngine.UI.CanvasScaler/ScaleMode ScaleWithScreenSize
      static void _set_ScaleWithScreenSize(UnityEngine::UI::CanvasScaler::ScaleMode value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/ScaleMode ConstantPhysicalSize
      static constexpr const int ConstantPhysicalSize = 2;
      // Get static field: static public UnityEngine.UI.CanvasScaler/ScaleMode ConstantPhysicalSize
      static UnityEngine::UI::CanvasScaler::ScaleMode _get_ConstantPhysicalSize();
      // Set static field: static public UnityEngine.UI.CanvasScaler/ScaleMode ConstantPhysicalSize
      static void _set_ConstantPhysicalSize(UnityEngine::UI::CanvasScaler::ScaleMode value);
    }; // UnityEngine.UI.CanvasScaler/ScaleMode
    #pragma pack(pop)
    static check_size<sizeof(CanvasScaler::ScaleMode), 0 + sizeof(int)> __UnityEngine_UI_CanvasScaler_ScaleModeSizeCheck;
    static_assert(sizeof(CanvasScaler::ScaleMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.CanvasScaler/ScreenMatchMode
    struct ScreenMatchMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ScreenMatchMode
      constexpr ScreenMatchMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.CanvasScaler/ScreenMatchMode MatchWidthOrHeight
      static constexpr const int MatchWidthOrHeight = 0;
      // Get static field: static public UnityEngine.UI.CanvasScaler/ScreenMatchMode MatchWidthOrHeight
      static UnityEngine::UI::CanvasScaler::ScreenMatchMode _get_MatchWidthOrHeight();
      // Set static field: static public UnityEngine.UI.CanvasScaler/ScreenMatchMode MatchWidthOrHeight
      static void _set_MatchWidthOrHeight(UnityEngine::UI::CanvasScaler::ScreenMatchMode value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/ScreenMatchMode Expand
      static constexpr const int Expand = 1;
      // Get static field: static public UnityEngine.UI.CanvasScaler/ScreenMatchMode Expand
      static UnityEngine::UI::CanvasScaler::ScreenMatchMode _get_Expand();
      // Set static field: static public UnityEngine.UI.CanvasScaler/ScreenMatchMode Expand
      static void _set_Expand(UnityEngine::UI::CanvasScaler::ScreenMatchMode value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/ScreenMatchMode Shrink
      static constexpr const int Shrink = 2;
      // Get static field: static public UnityEngine.UI.CanvasScaler/ScreenMatchMode Shrink
      static UnityEngine::UI::CanvasScaler::ScreenMatchMode _get_Shrink();
      // Set static field: static public UnityEngine.UI.CanvasScaler/ScreenMatchMode Shrink
      static void _set_Shrink(UnityEngine::UI::CanvasScaler::ScreenMatchMode value);
    }; // UnityEngine.UI.CanvasScaler/ScreenMatchMode
    #pragma pack(pop)
    static check_size<sizeof(CanvasScaler::ScreenMatchMode), 0 + sizeof(int)> __UnityEngine_UI_CanvasScaler_ScreenMatchModeSizeCheck;
    static_assert(sizeof(CanvasScaler::ScreenMatchMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.CanvasScaler/Unit
    struct Unit/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: Unit
      constexpr Unit(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.CanvasScaler/Unit Centimeters
      static constexpr const int Centimeters = 0;
      // Get static field: static public UnityEngine.UI.CanvasScaler/Unit Centimeters
      static UnityEngine::UI::CanvasScaler::Unit _get_Centimeters();
      // Set static field: static public UnityEngine.UI.CanvasScaler/Unit Centimeters
      static void _set_Centimeters(UnityEngine::UI::CanvasScaler::Unit value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/Unit Millimeters
      static constexpr const int Millimeters = 1;
      // Get static field: static public UnityEngine.UI.CanvasScaler/Unit Millimeters
      static UnityEngine::UI::CanvasScaler::Unit _get_Millimeters();
      // Set static field: static public UnityEngine.UI.CanvasScaler/Unit Millimeters
      static void _set_Millimeters(UnityEngine::UI::CanvasScaler::Unit value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/Unit Inches
      static constexpr const int Inches = 2;
      // Get static field: static public UnityEngine.UI.CanvasScaler/Unit Inches
      static UnityEngine::UI::CanvasScaler::Unit _get_Inches();
      // Set static field: static public UnityEngine.UI.CanvasScaler/Unit Inches
      static void _set_Inches(UnityEngine::UI::CanvasScaler::Unit value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/Unit Points
      static constexpr const int Points = 3;
      // Get static field: static public UnityEngine.UI.CanvasScaler/Unit Points
      static UnityEngine::UI::CanvasScaler::Unit _get_Points();
      // Set static field: static public UnityEngine.UI.CanvasScaler/Unit Points
      static void _set_Points(UnityEngine::UI::CanvasScaler::Unit value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/Unit Picas
      static constexpr const int Picas = 4;
      // Get static field: static public UnityEngine.UI.CanvasScaler/Unit Picas
      static UnityEngine::UI::CanvasScaler::Unit _get_Picas();
      // Set static field: static public UnityEngine.UI.CanvasScaler/Unit Picas
      static void _set_Picas(UnityEngine::UI::CanvasScaler::Unit value);
    }; // UnityEngine.UI.CanvasScaler/Unit
    #pragma pack(pop)
    static check_size<sizeof(CanvasScaler::Unit), 0 + sizeof(int)> __UnityEngine_UI_CanvasScaler_UnitSizeCheck;
    static_assert(sizeof(CanvasScaler::Unit) == 0x4);
    // [TooltipAttribute] Offset: 0xCDB14C
    // private UnityEngine.UI.CanvasScaler/ScaleMode m_UiScaleMode
    // Size: 0x4
    // Offset: 0x18
    UnityEngine::UI::CanvasScaler::ScaleMode m_UiScaleMode;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::CanvasScaler::ScaleMode) == 0x4);
    // [TooltipAttribute] Offset: 0xCDB198
    // protected System.Single m_ReferencePixelsPerUnit
    // Size: 0x4
    // Offset: 0x1C
    float m_ReferencePixelsPerUnit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xCDB1E4
    // protected System.Single m_ScaleFactor
    // Size: 0x4
    // Offset: 0x20
    float m_ScaleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xCDB230
    // protected UnityEngine.Vector2 m_ReferenceResolution
    // Size: 0x8
    // Offset: 0x24
    UnityEngine::Vector2 m_ReferenceResolution;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // [TooltipAttribute] Offset: 0xCDB27C
    // protected UnityEngine.UI.CanvasScaler/ScreenMatchMode m_ScreenMatchMode
    // Size: 0x4
    // Offset: 0x2C
    UnityEngine::UI::CanvasScaler::ScreenMatchMode m_ScreenMatchMode;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::CanvasScaler::ScreenMatchMode) == 0x4);
    // [TooltipAttribute] Offset: 0xCDB2C8
    // [RangeAttribute] Offset: 0xCDB2C8
    // protected System.Single m_MatchWidthOrHeight
    // Size: 0x4
    // Offset: 0x30
    float m_MatchWidthOrHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xCDB32C
    // protected UnityEngine.UI.CanvasScaler/Unit m_PhysicalUnit
    // Size: 0x4
    // Offset: 0x34
    UnityEngine::UI::CanvasScaler::Unit m_PhysicalUnit;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::CanvasScaler::Unit) == 0x4);
    // [TooltipAttribute] Offset: 0xCDB378
    // protected System.Single m_FallbackScreenDPI
    // Size: 0x4
    // Offset: 0x38
    float m_FallbackScreenDPI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xCDB3C4
    // protected System.Single m_DefaultSpriteDPI
    // Size: 0x4
    // Offset: 0x3C
    float m_DefaultSpriteDPI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xCDB410
    // protected System.Single m_DynamicPixelsPerUnit
    // Size: 0x4
    // Offset: 0x40
    float m_DynamicPixelsPerUnit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_DynamicPixelsPerUnit and: m_Canvas
    char __padding9[0x4] = {};
    // private UnityEngine.Canvas m_Canvas
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::Canvas* m_Canvas;
    // Field size check
    static_assert(sizeof(UnityEngine::Canvas*) == 0x8);
    // private System.Single m_PrevScaleFactor
    // Size: 0x4
    // Offset: 0x50
    float m_PrevScaleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PrevReferencePixelsPerUnit
    // Size: 0x4
    // Offset: 0x54
    float m_PrevReferencePixelsPerUnit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: CanvasScaler
    CanvasScaler(UnityEngine::UI::CanvasScaler::ScaleMode m_UiScaleMode_ = {}, float m_ReferencePixelsPerUnit_ = {}, float m_ScaleFactor_ = {}, UnityEngine::Vector2 m_ReferenceResolution_ = {}, UnityEngine::UI::CanvasScaler::ScreenMatchMode m_ScreenMatchMode_ = {}, float m_MatchWidthOrHeight_ = {}, UnityEngine::UI::CanvasScaler::Unit m_PhysicalUnit_ = {}, float m_FallbackScreenDPI_ = {}, float m_DefaultSpriteDPI_ = {}, float m_DynamicPixelsPerUnit_ = {}, UnityEngine::Canvas* m_Canvas_ = {}, float m_PrevScaleFactor_ = {}, float m_PrevReferencePixelsPerUnit_ = {}) noexcept : m_UiScaleMode{m_UiScaleMode_}, m_ReferencePixelsPerUnit{m_ReferencePixelsPerUnit_}, m_ScaleFactor{m_ScaleFactor_}, m_ReferenceResolution{m_ReferenceResolution_}, m_ScreenMatchMode{m_ScreenMatchMode_}, m_MatchWidthOrHeight{m_MatchWidthOrHeight_}, m_PhysicalUnit{m_PhysicalUnit_}, m_FallbackScreenDPI{m_FallbackScreenDPI_}, m_DefaultSpriteDPI{m_DefaultSpriteDPI_}, m_DynamicPixelsPerUnit{m_DynamicPixelsPerUnit_}, m_Canvas{m_Canvas_}, m_PrevScaleFactor{m_PrevScaleFactor_}, m_PrevReferencePixelsPerUnit{m_PrevReferencePixelsPerUnit_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single kLogBase
    static constexpr const float kLogBase = 2;
    // Get static field: static private System.Single kLogBase
    static float _get_kLogBase();
    // Set static field: static private System.Single kLogBase
    static void _set_kLogBase(float value);
    // public UnityEngine.UI.CanvasScaler/ScaleMode get_uiScaleMode()
    // Offset: 0x131D044
    UnityEngine::UI::CanvasScaler::ScaleMode get_uiScaleMode();
    // public System.Void set_uiScaleMode(UnityEngine.UI.CanvasScaler/ScaleMode value)
    // Offset: 0x131D04C
    void set_uiScaleMode(UnityEngine::UI::CanvasScaler::ScaleMode value);
    // public System.Single get_referencePixelsPerUnit()
    // Offset: 0x131D054
    float get_referencePixelsPerUnit();
    // public System.Void set_referencePixelsPerUnit(System.Single value)
    // Offset: 0x131D05C
    void set_referencePixelsPerUnit(float value);
    // public System.Single get_scaleFactor()
    // Offset: 0x131D064
    float get_scaleFactor();
    // public System.Void set_scaleFactor(System.Single value)
    // Offset: 0x131D06C
    void set_scaleFactor(float value);
    // public UnityEngine.Vector2 get_referenceResolution()
    // Offset: 0x131D0F0
    UnityEngine::Vector2 get_referenceResolution();
    // public System.Void set_referenceResolution(UnityEngine.Vector2 value)
    // Offset: 0x131D0F8
    void set_referenceResolution(UnityEngine::Vector2 value);
    // public UnityEngine.UI.CanvasScaler/ScreenMatchMode get_screenMatchMode()
    // Offset: 0x131D1F8
    UnityEngine::UI::CanvasScaler::ScreenMatchMode get_screenMatchMode();
    // public System.Void set_screenMatchMode(UnityEngine.UI.CanvasScaler/ScreenMatchMode value)
    // Offset: 0x131D200
    void set_screenMatchMode(UnityEngine::UI::CanvasScaler::ScreenMatchMode value);
    // public System.Single get_matchWidthOrHeight()
    // Offset: 0x131D208
    float get_matchWidthOrHeight();
    // public System.Void set_matchWidthOrHeight(System.Single value)
    // Offset: 0x131D210
    void set_matchWidthOrHeight(float value);
    // public UnityEngine.UI.CanvasScaler/Unit get_physicalUnit()
    // Offset: 0x131D218
    UnityEngine::UI::CanvasScaler::Unit get_physicalUnit();
    // public System.Void set_physicalUnit(UnityEngine.UI.CanvasScaler/Unit value)
    // Offset: 0x131D220
    void set_physicalUnit(UnityEngine::UI::CanvasScaler::Unit value);
    // public System.Single get_fallbackScreenDPI()
    // Offset: 0x131D228
    float get_fallbackScreenDPI();
    // public System.Void set_fallbackScreenDPI(System.Single value)
    // Offset: 0x131D230
    void set_fallbackScreenDPI(float value);
    // public System.Single get_defaultSpriteDPI()
    // Offset: 0x131D238
    float get_defaultSpriteDPI();
    // public System.Void set_defaultSpriteDPI(System.Single value)
    // Offset: 0x131D240
    void set_defaultSpriteDPI(float value);
    // public System.Single get_dynamicPixelsPerUnit()
    // Offset: 0x131D2C0
    float get_dynamicPixelsPerUnit();
    // public System.Void set_dynamicPixelsPerUnit(System.Single value)
    // Offset: 0x131D2C8
    void set_dynamicPixelsPerUnit(float value);
    // protected System.Void Update()
    // Offset: 0x131D484
    void Update();
    // protected System.Void Handle()
    // Offset: 0x131D494
    void Handle();
    // protected System.Void HandleWorldCanvas()
    // Offset: 0x131D5A0
    void HandleWorldCanvas();
    // protected System.Void HandleConstantPixelSize()
    // Offset: 0x131D5CC
    void HandleConstantPixelSize();
    // protected System.Void HandleScaleWithScreenSize()
    // Offset: 0x131D5F8
    void HandleScaleWithScreenSize();
    // protected System.Void HandleConstantPhysicalSize()
    // Offset: 0x131D868
    void HandleConstantPhysicalSize();
    // protected System.Void SetScaleFactor(System.Single scaleFactor)
    // Offset: 0x131D3EC
    void SetScaleFactor(float scaleFactor);
    // protected System.Void SetReferencePixelsPerUnit(System.Single referencePixelsPerUnit)
    // Offset: 0x131D438
    void SetReferencePixelsPerUnit(float referencePixelsPerUnit);
    // protected System.Void .ctor()
    // Offset: 0x131D2D0
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CanvasScaler* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::UI::CanvasScaler::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CanvasScaler*, creationType>()));
    }
    // protected override System.Void OnEnable()
    // Offset: 0x131D354
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnEnable()
    void OnEnable();
    // protected override System.Void OnDisable()
    // Offset: 0x131D3BC
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnDisable()
    void OnDisable();
  }; // UnityEngine.UI.CanvasScaler
  #pragma pack(pop)
  static check_size<sizeof(CanvasScaler), 84 + sizeof(float)> __UnityEngine_UI_CanvasScalerSizeCheck;
  static_assert(sizeof(CanvasScaler) == 0x58);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::CanvasScaler*, "UnityEngine.UI", "CanvasScaler");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::CanvasScaler::ScaleMode, "UnityEngine.UI", "CanvasScaler/ScaleMode");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::CanvasScaler::ScreenMatchMode, "UnityEngine.UI", "CanvasScaler/ScreenMatchMode");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::CanvasScaler::Unit, "UnityEngine.UI", "CanvasScaler/Unit");
