// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Canvas
  class Canvas;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Skipping declaration: ScaleMode because it is already included!
  // Skipping declaration: ScreenMatchMode because it is already included!
  // Skipping declaration: Unit because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Forward declaring type: CanvasScaler
  class CanvasScaler;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UI::CanvasScaler);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UI::CanvasScaler*, "UnityEngine.UI", "CanvasScaler");
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.CanvasScaler
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 108A134
  // [ExecuteAlways] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 108A134
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class CanvasScaler : public ::UnityEngine::EventSystems::UIBehaviour {
    public:
    // Nested type: ::UnityEngine::UI::CanvasScaler::ScaleMode
    struct ScaleMode;
    // Nested type: ::UnityEngine::UI::CanvasScaler::ScreenMatchMode
    struct ScreenMatchMode;
    // Nested type: ::UnityEngine::UI::CanvasScaler::Unit
    struct Unit;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct ScaleMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ScaleMode
      constexpr ScaleMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode ConstantPixelSize
      static constexpr const int ConstantPixelSize = 0;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode ConstantPixelSize
      static ::UnityEngine::UI::CanvasScaler::ScaleMode _get_ConstantPixelSize();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode ConstantPixelSize
      static void _set_ConstantPixelSize(::UnityEngine::UI::CanvasScaler::ScaleMode value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode ScaleWithScreenSize
      static constexpr const int ScaleWithScreenSize = 1;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode ScaleWithScreenSize
      static ::UnityEngine::UI::CanvasScaler::ScaleMode _get_ScaleWithScreenSize();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode ScaleWithScreenSize
      static void _set_ScaleWithScreenSize(::UnityEngine::UI::CanvasScaler::ScaleMode value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode ConstantPhysicalSize
      static constexpr const int ConstantPhysicalSize = 2;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode ConstantPhysicalSize
      static ::UnityEngine::UI::CanvasScaler::ScaleMode _get_ConstantPhysicalSize();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode ConstantPhysicalSize
      static void _set_ConstantPhysicalSize(::UnityEngine::UI::CanvasScaler::ScaleMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode
    #pragma pack(pop)
    static check_size<sizeof(CanvasScaler::ScaleMode), 0 + sizeof(int)> __UnityEngine_UI_CanvasScaler_ScaleModeSizeCheck;
    static_assert(sizeof(CanvasScaler::ScaleMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct ScreenMatchMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ScreenMatchMode
      constexpr ScreenMatchMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode MatchWidthOrHeight
      static constexpr const int MatchWidthOrHeight = 0;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode MatchWidthOrHeight
      static ::UnityEngine::UI::CanvasScaler::ScreenMatchMode _get_MatchWidthOrHeight();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode MatchWidthOrHeight
      static void _set_MatchWidthOrHeight(::UnityEngine::UI::CanvasScaler::ScreenMatchMode value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode Expand
      static constexpr const int Expand = 1;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode Expand
      static ::UnityEngine::UI::CanvasScaler::ScreenMatchMode _get_Expand();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode Expand
      static void _set_Expand(::UnityEngine::UI::CanvasScaler::ScreenMatchMode value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode Shrink
      static constexpr const int Shrink = 2;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode Shrink
      static ::UnityEngine::UI::CanvasScaler::ScreenMatchMode _get_Shrink();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode Shrink
      static void _set_Shrink(::UnityEngine::UI::CanvasScaler::ScreenMatchMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode
    #pragma pack(pop)
    static check_size<sizeof(CanvasScaler::ScreenMatchMode), 0 + sizeof(int)> __UnityEngine_UI_CanvasScaler_ScreenMatchModeSizeCheck;
    static_assert(sizeof(CanvasScaler::ScreenMatchMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit
    // [TokenAttribute] Offset: FFFFFFFF
    struct Unit/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Unit
      constexpr Unit(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Centimeters
      static constexpr const int Centimeters = 0;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Centimeters
      static ::UnityEngine::UI::CanvasScaler::Unit _get_Centimeters();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Centimeters
      static void _set_Centimeters(::UnityEngine::UI::CanvasScaler::Unit value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Millimeters
      static constexpr const int Millimeters = 1;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Millimeters
      static ::UnityEngine::UI::CanvasScaler::Unit _get_Millimeters();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Millimeters
      static void _set_Millimeters(::UnityEngine::UI::CanvasScaler::Unit value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Inches
      static constexpr const int Inches = 2;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Inches
      static ::UnityEngine::UI::CanvasScaler::Unit _get_Inches();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Inches
      static void _set_Inches(::UnityEngine::UI::CanvasScaler::Unit value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Points
      static constexpr const int Points = 3;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Points
      static ::UnityEngine::UI::CanvasScaler::Unit _get_Points();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Points
      static void _set_Points(::UnityEngine::UI::CanvasScaler::Unit value);
      // static field const value: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Picas
      static constexpr const int Picas = 4;
      // Get static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Picas
      static ::UnityEngine::UI::CanvasScaler::Unit _get_Picas();
      // Set static field: static public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit Picas
      static void _set_Picas(::UnityEngine::UI::CanvasScaler::Unit value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit
    #pragma pack(pop)
    static check_size<sizeof(CanvasScaler::Unit), 0 + sizeof(int)> __UnityEngine_UI_CanvasScaler_UnitSizeCheck;
    static_assert(sizeof(CanvasScaler::Unit) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0x108BCDC
    // private UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode m_UiScaleMode
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::UI::CanvasScaler::ScaleMode m_UiScaleMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::CanvasScaler::ScaleMode) == 0x4);
    // [TooltipAttribute] Offset: 0x108BD28
    // protected System.Single m_ReferencePixelsPerUnit
    // Size: 0x4
    // Offset: 0x1C
    float m_ReferencePixelsPerUnit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x108BD74
    // protected System.Single m_ScaleFactor
    // Size: 0x4
    // Offset: 0x20
    float m_ScaleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x108BDC0
    // protected UnityEngine.Vector2 m_ReferenceResolution
    // Size: 0x8
    // Offset: 0x24
    ::UnityEngine::Vector2 m_ReferenceResolution;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // [TooltipAttribute] Offset: 0x108BE0C
    // protected UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode m_ScreenMatchMode
    // Size: 0x4
    // Offset: 0x2C
    ::UnityEngine::UI::CanvasScaler::ScreenMatchMode m_ScreenMatchMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::CanvasScaler::ScreenMatchMode) == 0x4);
    // [TooltipAttribute] Offset: 0x108BE58
    // [RangeAttribute] Offset: 0x108BE58
    // protected System.Single m_MatchWidthOrHeight
    // Size: 0x4
    // Offset: 0x30
    float m_MatchWidthOrHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x108BEBC
    // protected UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit m_PhysicalUnit
    // Size: 0x4
    // Offset: 0x34
    ::UnityEngine::UI::CanvasScaler::Unit m_PhysicalUnit;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::CanvasScaler::Unit) == 0x4);
    // [TooltipAttribute] Offset: 0x108BF08
    // protected System.Single m_FallbackScreenDPI
    // Size: 0x4
    // Offset: 0x38
    float m_FallbackScreenDPI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x108BF54
    // protected System.Single m_DefaultSpriteDPI
    // Size: 0x4
    // Offset: 0x3C
    float m_DefaultSpriteDPI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x108BFA0
    // protected System.Single m_DynamicPixelsPerUnit
    // Size: 0x4
    // Offset: 0x40
    float m_DynamicPixelsPerUnit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_DynamicPixelsPerUnit and: m_Canvas
    char __padding9[0x4] = {};
    // private UnityEngine.Canvas m_Canvas
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Canvas* m_Canvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private System.Single m_PrevScaleFactor
    // Size: 0x4
    // Offset: 0x50
    float m_PrevScaleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PrevReferencePixelsPerUnit
    // Size: 0x4
    // Offset: 0x54
    float m_PrevReferencePixelsPerUnit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single kLogBase
    static constexpr const float kLogBase = 2;
    // Get static field: static private System.Single kLogBase
    static float _get_kLogBase();
    // Set static field: static private System.Single kLogBase
    static void _set_kLogBase(float value);
    // Get instance field reference: private UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode m_UiScaleMode
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::CanvasScaler::ScaleMode& dyn_m_UiScaleMode();
    // Get instance field reference: protected System.Single m_ReferencePixelsPerUnit
    [[deprecated("Use field access instead!")]] float& dyn_m_ReferencePixelsPerUnit();
    // Get instance field reference: protected System.Single m_ScaleFactor
    [[deprecated("Use field access instead!")]] float& dyn_m_ScaleFactor();
    // Get instance field reference: protected UnityEngine.Vector2 m_ReferenceResolution
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_m_ReferenceResolution();
    // Get instance field reference: protected UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode m_ScreenMatchMode
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::CanvasScaler::ScreenMatchMode& dyn_m_ScreenMatchMode();
    // Get instance field reference: protected System.Single m_MatchWidthOrHeight
    [[deprecated("Use field access instead!")]] float& dyn_m_MatchWidthOrHeight();
    // Get instance field reference: protected UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit m_PhysicalUnit
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::CanvasScaler::Unit& dyn_m_PhysicalUnit();
    // Get instance field reference: protected System.Single m_FallbackScreenDPI
    [[deprecated("Use field access instead!")]] float& dyn_m_FallbackScreenDPI();
    // Get instance field reference: protected System.Single m_DefaultSpriteDPI
    [[deprecated("Use field access instead!")]] float& dyn_m_DefaultSpriteDPI();
    // Get instance field reference: protected System.Single m_DynamicPixelsPerUnit
    [[deprecated("Use field access instead!")]] float& dyn_m_DynamicPixelsPerUnit();
    // Get instance field reference: private UnityEngine.Canvas m_Canvas
    [[deprecated("Use field access instead!")]] ::UnityEngine::Canvas*& dyn_m_Canvas();
    // Get instance field reference: private System.Single m_PrevScaleFactor
    [[deprecated("Use field access instead!")]] float& dyn_m_PrevScaleFactor();
    // Get instance field reference: private System.Single m_PrevReferencePixelsPerUnit
    [[deprecated("Use field access instead!")]] float& dyn_m_PrevReferencePixelsPerUnit();
    // public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode get_uiScaleMode()
    // Offset: 0x193C994
    ::UnityEngine::UI::CanvasScaler::ScaleMode get_uiScaleMode();
    // public System.Void set_uiScaleMode(UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScaleMode value)
    // Offset: 0x193C99C
    void set_uiScaleMode(::UnityEngine::UI::CanvasScaler::ScaleMode value);
    // public System.Single get_referencePixelsPerUnit()
    // Offset: 0x193C9A4
    float get_referencePixelsPerUnit();
    // public System.Void set_referencePixelsPerUnit(System.Single value)
    // Offset: 0x193C9AC
    void set_referencePixelsPerUnit(float value);
    // public System.Single get_scaleFactor()
    // Offset: 0x193C9B4
    float get_scaleFactor();
    // public System.Void set_scaleFactor(System.Single value)
    // Offset: 0x193C9BC
    void set_scaleFactor(float value);
    // public UnityEngine.Vector2 get_referenceResolution()
    // Offset: 0x193CA40
    ::UnityEngine::Vector2 get_referenceResolution();
    // public System.Void set_referenceResolution(UnityEngine.Vector2 value)
    // Offset: 0x193CA48
    void set_referenceResolution(::UnityEngine::Vector2 value);
    // public UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode get_screenMatchMode()
    // Offset: 0x193CB48
    ::UnityEngine::UI::CanvasScaler::ScreenMatchMode get_screenMatchMode();
    // public System.Void set_screenMatchMode(UnityEngine.UI.CanvasScaler/UnityEngine.UI.ScreenMatchMode value)
    // Offset: 0x193CB50
    void set_screenMatchMode(::UnityEngine::UI::CanvasScaler::ScreenMatchMode value);
    // public System.Single get_matchWidthOrHeight()
    // Offset: 0x193CB58
    float get_matchWidthOrHeight();
    // public System.Void set_matchWidthOrHeight(System.Single value)
    // Offset: 0x193CB60
    void set_matchWidthOrHeight(float value);
    // public UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit get_physicalUnit()
    // Offset: 0x193CB68
    ::UnityEngine::UI::CanvasScaler::Unit get_physicalUnit();
    // public System.Void set_physicalUnit(UnityEngine.UI.CanvasScaler/UnityEngine.UI.Unit value)
    // Offset: 0x193CB70
    void set_physicalUnit(::UnityEngine::UI::CanvasScaler::Unit value);
    // public System.Single get_fallbackScreenDPI()
    // Offset: 0x193CB78
    float get_fallbackScreenDPI();
    // public System.Void set_fallbackScreenDPI(System.Single value)
    // Offset: 0x193CB80
    void set_fallbackScreenDPI(float value);
    // public System.Single get_defaultSpriteDPI()
    // Offset: 0x193CB88
    float get_defaultSpriteDPI();
    // public System.Void set_defaultSpriteDPI(System.Single value)
    // Offset: 0x193CB90
    void set_defaultSpriteDPI(float value);
    // public System.Single get_dynamicPixelsPerUnit()
    // Offset: 0x193CC10
    float get_dynamicPixelsPerUnit();
    // public System.Void set_dynamicPixelsPerUnit(System.Single value)
    // Offset: 0x193CC18
    void set_dynamicPixelsPerUnit(float value);
    // private System.Void Canvas_preWillRenderCanvases()
    // Offset: 0x193CD44
    void Canvas_preWillRenderCanvases();
    // protected System.Void Handle()
    // Offset: 0x193CE7C
    void Handle();
    // protected System.Void HandleWorldCanvas()
    // Offset: 0x193CF88
    void HandleWorldCanvas();
    // protected System.Void HandleConstantPixelSize()
    // Offset: 0x193CFB4
    void HandleConstantPixelSize();
    // protected System.Void HandleScaleWithScreenSize()
    // Offset: 0x193CFE0
    void HandleScaleWithScreenSize();
    // protected System.Void HandleConstantPhysicalSize()
    // Offset: 0x193D23C
    void HandleConstantPhysicalSize();
    // protected System.Void SetScaleFactor(System.Single scaleFactor)
    // Offset: 0x193CDE4
    void SetScaleFactor(float scaleFactor);
    // protected System.Void SetReferencePixelsPerUnit(System.Single referencePixelsPerUnit)
    // Offset: 0x193CE30
    void SetReferencePixelsPerUnit(float referencePixelsPerUnit);
    // protected System.Void .ctor()
    // Offset: 0x193CC20
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CanvasScaler* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UI::CanvasScaler::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CanvasScaler*, creationType>()));
    }
    // protected override System.Void OnEnable()
    // Offset: 0x193CCA4
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnEnable()
    void OnEnable();
    // protected override System.Void OnDisable()
    // Offset: 0x193CD54
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnDisable()
    void OnDisable();
  }; // UnityEngine.UI.CanvasScaler
  #pragma pack(pop)
  static check_size<sizeof(CanvasScaler), 84 + sizeof(float)> __UnityEngine_UI_CanvasScalerSizeCheck;
  static_assert(sizeof(CanvasScaler) == 0x58);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UI::CanvasScaler::Unit, "UnityEngine.UI", "CanvasScaler/Unit");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UI::CanvasScaler::ScreenMatchMode, "UnityEngine.UI", "CanvasScaler/ScreenMatchMode");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UI::CanvasScaler::ScaleMode, "UnityEngine.UI", "CanvasScaler/ScaleMode");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UI::CanvasScaler::get_uiScaleMode
// Il2CppName: get_uiScaleMode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UI::CanvasScaler::ScaleMode (UnityEngine::UI::CanvasScaler::*)()>(&UnityEngine::UI::CanvasScaler::get_uiScaleMode)> {
