// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.UI.ILayoutSelfController
#include "UnityEngine/UI/ILayoutSelfController.hpp"
// Including type: UnityEngine.DrivenRectTransformTracker
#include "UnityEngine/DrivenRectTransformTracker.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Skipping declaration: FitMode because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UI.ContentSizeFitter
  // [] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: CEEC4C
  // [ExecuteAlways] Offset: CEEC4C
  // [RequireComponent] Offset: CEEC4C
  class ContentSizeFitter : public UnityEngine::EventSystems::UIBehaviour/*, public UnityEngine::UI::ILayoutSelfController*/ {
    public:
    // Nested type: UnityEngine::UI::ContentSizeFitter::FitMode
    struct FitMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.ContentSizeFitter/FitMode
    // [] Offset: FFFFFFFF
    struct FitMode/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: FitMode
      constexpr FitMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.ContentSizeFitter/FitMode Unconstrained
      static constexpr const int Unconstrained = 0;
      // Get static field: static public UnityEngine.UI.ContentSizeFitter/FitMode Unconstrained
      static UnityEngine::UI::ContentSizeFitter::FitMode _get_Unconstrained();
      // Set static field: static public UnityEngine.UI.ContentSizeFitter/FitMode Unconstrained
      static void _set_Unconstrained(UnityEngine::UI::ContentSizeFitter::FitMode value);
      // static field const value: static public UnityEngine.UI.ContentSizeFitter/FitMode MinSize
      static constexpr const int MinSize = 1;
      // Get static field: static public UnityEngine.UI.ContentSizeFitter/FitMode MinSize
      static UnityEngine::UI::ContentSizeFitter::FitMode _get_MinSize();
      // Set static field: static public UnityEngine.UI.ContentSizeFitter/FitMode MinSize
      static void _set_MinSize(UnityEngine::UI::ContentSizeFitter::FitMode value);
      // static field const value: static public UnityEngine.UI.ContentSizeFitter/FitMode PreferredSize
      static constexpr const int PreferredSize = 2;
      // Get static field: static public UnityEngine.UI.ContentSizeFitter/FitMode PreferredSize
      static UnityEngine::UI::ContentSizeFitter::FitMode _get_PreferredSize();
      // Set static field: static public UnityEngine.UI.ContentSizeFitter/FitMode PreferredSize
      static void _set_PreferredSize(UnityEngine::UI::ContentSizeFitter::FitMode value);
    }; // UnityEngine.UI.ContentSizeFitter/FitMode
    #pragma pack(pop)
    static check_size<sizeof(ContentSizeFitter::FitMode), 0 + sizeof(int)> __UnityEngine_UI_ContentSizeFitter_FitModeSizeCheck;
    static_assert(sizeof(ContentSizeFitter::FitMode) == 0x4);
    // protected UnityEngine.UI.ContentSizeFitter/FitMode m_HorizontalFit
    // Size: 0x4
    // Offset: 0x18
    UnityEngine::UI::ContentSizeFitter::FitMode m_HorizontalFit;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::ContentSizeFitter::FitMode) == 0x4);
    // protected UnityEngine.UI.ContentSizeFitter/FitMode m_VerticalFit
    // Size: 0x4
    // Offset: 0x1C
    UnityEngine::UI::ContentSizeFitter::FitMode m_VerticalFit;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::ContentSizeFitter::FitMode) == 0x4);
    // private UnityEngine.RectTransform m_Rect
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::RectTransform* m_Rect;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.DrivenRectTransformTracker m_Tracker
    // Size: 0x1
    // Offset: 0x28
    UnityEngine::DrivenRectTransformTracker m_Tracker;
    // Field size check
    static_assert(sizeof(UnityEngine::DrivenRectTransformTracker) == 0x1);
    // Creating value type constructor for type: ContentSizeFitter
    ContentSizeFitter(UnityEngine::UI::ContentSizeFitter::FitMode m_HorizontalFit_ = {}, UnityEngine::UI::ContentSizeFitter::FitMode m_VerticalFit_ = {}, UnityEngine::RectTransform* m_Rect_ = {}, UnityEngine::DrivenRectTransformTracker m_Tracker_ = {}) noexcept : m_HorizontalFit{m_HorizontalFit_}, m_VerticalFit{m_VerticalFit_}, m_Rect{m_Rect_}, m_Tracker{m_Tracker_} {}
    // Creating interface conversion operator: operator UnityEngine::UI::ILayoutSelfController
    operator UnityEngine::UI::ILayoutSelfController() noexcept {
      return *reinterpret_cast<UnityEngine::UI::ILayoutSelfController*>(this);
    }
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public UnityEngine.UI.ContentSizeFitter/FitMode get_horizontalFit()
    // Offset: 0x1300028
    UnityEngine::UI::ContentSizeFitter::FitMode get_horizontalFit();
    // public System.Void set_horizontalFit(UnityEngine.UI.ContentSizeFitter/FitMode value)
    // Offset: 0x1300030
    void set_horizontalFit(UnityEngine::UI::ContentSizeFitter::FitMode value);
    // public UnityEngine.UI.ContentSizeFitter/FitMode get_verticalFit()
    // Offset: 0x1300144
    UnityEngine::UI::ContentSizeFitter::FitMode get_verticalFit();
    // public System.Void set_verticalFit(UnityEngine.UI.ContentSizeFitter/FitMode value)
    // Offset: 0x130014C
    void set_verticalFit(UnityEngine::UI::ContentSizeFitter::FitMode value);
    // private UnityEngine.RectTransform get_rectTransform()
    // Offset: 0x13001C8
    UnityEngine::RectTransform* get_rectTransform();
    // private System.Void HandleSelfFittingAlongAxis(System.Int32 axis)
    // Offset: 0x1300308
    void HandleSelfFittingAlongAxis(int axis);
    // protected System.Void SetDirty()
    // Offset: 0x13000AC
    void SetDirty();
    // protected System.Void .ctor()
    // Offset: 0x1300274
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ContentSizeFitter* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::UI::ContentSizeFitter::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ContentSizeFitter*, creationType>()));
    }
    // protected override System.Void OnEnable()
    // Offset: 0x130027C
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnEnable()
    void OnEnable();
    // protected override System.Void OnDisable()
    // Offset: 0x1300280
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnDisable()
    void OnDisable();
    // protected override System.Void OnRectTransformDimensionsChange()
    // Offset: 0x1300304
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnRectTransformDimensionsChange()
    void OnRectTransformDimensionsChange();
    // public System.Void SetLayoutHorizontal()
    // Offset: 0x13003D8
    // Implemented from: UnityEngine.UI.ILayoutController
    // Base method: System.Void ILayoutController::SetLayoutHorizontal()
    void SetLayoutHorizontal();
    // public System.Void SetLayoutVertical()
    // Offset: 0x1300408
    // Implemented from: UnityEngine.UI.ILayoutController
    // Base method: System.Void ILayoutController::SetLayoutVertical()
    void SetLayoutVertical();
  }; // UnityEngine.UI.ContentSizeFitter
  // WARNING Not writing size check since size may be invalid!
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::ContentSizeFitter*, "UnityEngine.UI", "ContentSizeFitter");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::ContentSizeFitter::FitMode, "UnityEngine.UI", "ContentSizeFitter/FitMode");
