// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UI.DefaultControls
#include "UnityEngine/UI/DefaultControls.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0x38
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.UI.DefaultControls/UnityEngine.UI.Resources
  // [TokenAttribute] Offset: FFFFFFFF
  struct DefaultControls::Resources/*, public System::ValueType*/ {
    public:
    // public UnityEngine.Sprite standard
    // Size: 0x8
    // Offset: 0x0
    UnityEngine::Sprite* standard;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // public UnityEngine.Sprite background
    // Size: 0x8
    // Offset: 0x8
    UnityEngine::Sprite* background;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // public UnityEngine.Sprite inputField
    // Size: 0x8
    // Offset: 0x10
    UnityEngine::Sprite* inputField;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // public UnityEngine.Sprite knob
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Sprite* knob;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // public UnityEngine.Sprite checkmark
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::Sprite* checkmark;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // public UnityEngine.Sprite dropdown
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::Sprite* dropdown;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // public UnityEngine.Sprite mask
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::Sprite* mask;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // Creating value type constructor for type: Resources
    constexpr Resources(UnityEngine::Sprite* standard_ = {}, UnityEngine::Sprite* background_ = {}, UnityEngine::Sprite* inputField_ = {}, UnityEngine::Sprite* knob_ = {}, UnityEngine::Sprite* checkmark_ = {}, UnityEngine::Sprite* dropdown_ = {}, UnityEngine::Sprite* mask_ = {}) noexcept : standard{standard_}, background{background_}, inputField{inputField_}, knob{knob_}, checkmark{checkmark_}, dropdown{dropdown_}, mask{mask_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public UnityEngine.Sprite standard
    UnityEngine::Sprite* _get_standard();
    // Set instance field: public UnityEngine.Sprite standard
    void _set_standard(UnityEngine::Sprite* value);
    // Get instance field: public UnityEngine.Sprite background
    UnityEngine::Sprite* _get_background();
    // Set instance field: public UnityEngine.Sprite background
    void _set_background(UnityEngine::Sprite* value);
    // Get instance field: public UnityEngine.Sprite inputField
    UnityEngine::Sprite* _get_inputField();
    // Set instance field: public UnityEngine.Sprite inputField
    void _set_inputField(UnityEngine::Sprite* value);
    // Get instance field: public UnityEngine.Sprite knob
    UnityEngine::Sprite* _get_knob();
    // Set instance field: public UnityEngine.Sprite knob
    void _set_knob(UnityEngine::Sprite* value);
    // Get instance field: public UnityEngine.Sprite checkmark
    UnityEngine::Sprite* _get_checkmark();
    // Set instance field: public UnityEngine.Sprite checkmark
    void _set_checkmark(UnityEngine::Sprite* value);
    // Get instance field: public UnityEngine.Sprite dropdown
    UnityEngine::Sprite* _get_dropdown();
    // Set instance field: public UnityEngine.Sprite dropdown
    void _set_dropdown(UnityEngine::Sprite* value);
    // Get instance field: public UnityEngine.Sprite mask
    UnityEngine::Sprite* _get_mask();
    // Set instance field: public UnityEngine.Sprite mask
    void _set_mask(UnityEngine::Sprite* value);
  }; // UnityEngine.UI.DefaultControls/UnityEngine.UI.Resources
  #pragma pack(pop)
  static check_size<sizeof(DefaultControls::Resources), 48 + sizeof(UnityEngine::Sprite*)> __UnityEngine_UI_DefaultControls_ResourcesSizeCheck;
  static_assert(sizeof(DefaultControls::Resources) == 0x38);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::DefaultControls::Resources, "UnityEngine.UI", "DefaultControls/Resources");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
