// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.UI.CoroutineTween.ColorTween
#include "UnityEngine/UI/CoroutineTween/ColorTween.hpp"
// Including type: UnityEngine.UIVertex
#include "UnityEngine/UIVertex.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: CanvasRenderer
  class CanvasRenderer;
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Rect
  struct Rect;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityAction
  class UnityAction;
}
// Forward declaring namespace: UnityEngine::UI::CoroutineTween
namespace UnityEngine::UI::CoroutineTween {
  // Forward declaring type: TweenRunner`1<T>
  template<typename T>
  class TweenRunner_1;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: VertexHelper
  class VertexHelper;
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0x89
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.Graphic
  // [DisallowMultipleComponent] Offset: DC4EC4
  // [RequireComponent] Offset: DC4EC4
  // [RequireComponent] Offset: DC4EC4
  // [ExecuteAlways] Offset: DC4EC4
  class Graphic : public UnityEngine::EventSystems::UIBehaviour/*, public UnityEngine::UI::ICanvasElement*/ {
    public:
    // [FormerlySerializedAsAttribute] Offset: 0xDC6614
    // protected UnityEngine.Material m_Material
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Material* m_Material;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // private UnityEngine.Color m_Color
    // Size: 0x10
    // Offset: 0x20
    UnityEngine::Color m_Color;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // protected System.Boolean m_SkipLayoutUpdate
    // Size: 0x1
    // Offset: 0x30
    bool m_SkipLayoutUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_SkipMaterialUpdate
    // Size: 0x1
    // Offset: 0x31
    bool m_SkipMaterialUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_RaycastTarget
    // Size: 0x1
    // Offset: 0x32
    bool m_RaycastTarget;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_RaycastTarget and: m_RectTransform
    char __padding4[0x5] = {};
    // private UnityEngine.RectTransform m_RectTransform
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::RectTransform* m_RectTransform;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.CanvasRenderer m_CanvasRenderer
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::CanvasRenderer* m_CanvasRenderer;
    // Field size check
    static_assert(sizeof(UnityEngine::CanvasRenderer*) == 0x8);
    // private UnityEngine.Canvas m_Canvas
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::Canvas* m_Canvas;
    // Field size check
    static_assert(sizeof(UnityEngine::Canvas*) == 0x8);
    // private System.Boolean m_VertsDirty
    // Size: 0x1
    // Offset: 0x50
    bool m_VertsDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_MaterialDirty
    // Size: 0x1
    // Offset: 0x51
    bool m_MaterialDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_MaterialDirty and: m_OnDirtyLayoutCallback
    char __padding9[0x6] = {};
    // protected UnityEngine.Events.UnityAction m_OnDirtyLayoutCallback
    // Size: 0x8
    // Offset: 0x58
    UnityEngine::Events::UnityAction* m_OnDirtyLayoutCallback;
    // Field size check
    static_assert(sizeof(UnityEngine::Events::UnityAction*) == 0x8);
    // protected UnityEngine.Events.UnityAction m_OnDirtyVertsCallback
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::Events::UnityAction* m_OnDirtyVertsCallback;
    // Field size check
    static_assert(sizeof(UnityEngine::Events::UnityAction*) == 0x8);
    // protected UnityEngine.Events.UnityAction m_OnDirtyMaterialCallback
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::Events::UnityAction* m_OnDirtyMaterialCallback;
    // Field size check
    static_assert(sizeof(UnityEngine::Events::UnityAction*) == 0x8);
    // protected UnityEngine.Mesh m_CachedMesh
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::Mesh* m_CachedMesh;
    // Field size check
    static_assert(sizeof(UnityEngine::Mesh*) == 0x8);
    // protected UnityEngine.Vector2[] m_CachedUvs
    // Size: 0x8
    // Offset: 0x78
    ::Array<UnityEngine::Vector2>* m_CachedUvs;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector2>*) == 0x8);
    // private readonly UnityEngine.UI.CoroutineTween.TweenRunner`1<UnityEngine.UI.CoroutineTween.ColorTween> m_ColorTweenRunner
    // Size: 0x8
    // Offset: 0x80
    UnityEngine::UI::CoroutineTween::TweenRunner_1<UnityEngine::UI::CoroutineTween::ColorTween>* m_ColorTweenRunner;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::CoroutineTween::TweenRunner_1<UnityEngine::UI::CoroutineTween::ColorTween>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xDC6680
    // private System.Boolean <useLegacyMeshGeneration>k__BackingField
    // Size: 0x1
    // Offset: 0x88
    bool useLegacyMeshGeneration;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: Graphic
