// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UI.MaskableGraphic
#include "UnityEngine/UI/MaskableGraphic.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.ICanvasRaycastFilter
#include "UnityEngine/ICanvasRaycastFilter.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Sprite
  class Sprite;
  // Forward declaring type: Rect
  struct Rect;
  // Skipping declaration: Vector4 because it is already included!
  // Skipping declaration: Color32 because it is already included!
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Texture
  class Texture;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Skipping declaration: Type because it is already included!
  // Skipping declaration: FillMethod because it is already included!
  // Forward declaring type: VertexHelper
  class VertexHelper;
}
// Forward declaring namespace: UnityEngine::U2D
namespace UnityEngine::U2D {
  // Forward declaring type: SpriteAtlas
  class SpriteAtlas;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0xF8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.Image
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: DE493C
  class Image : public UnityEngine::UI::MaskableGraphic/*, public UnityEngine::ISerializationCallbackReceiver, public UnityEngine::UI::ILayoutElement, public UnityEngine::ICanvasRaycastFilter*/ {
    public:
    // Nested type: UnityEngine::UI::Image::Type
    struct Type;
    // Nested type: UnityEngine::UI::Image::FillMethod
    struct FillMethod;
    // Nested type: UnityEngine::UI::Image::OriginHorizontal
    struct OriginHorizontal;
    // Nested type: UnityEngine::UI::Image::OriginVertical
    struct OriginVertical;
    // Nested type: UnityEngine::UI::Image::Origin90
    struct Origin90;
    // Nested type: UnityEngine::UI::Image::Origin180
    struct Origin180;
    // Nested type: UnityEngine::UI::Image::Origin360
    struct Origin360;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.Image/UnityEngine.UI.Type
    // [TokenAttribute] Offset: FFFFFFFF
    struct Type/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: Type
      constexpr Type(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.Image/UnityEngine.UI.Type Simple
      static constexpr const int Simple = 0;
      // Get static field: static public UnityEngine.UI.Image/UnityEngine.UI.Type Simple
      static UnityEngine::UI::Image::Type _get_Simple();
      // Set static field: static public UnityEngine.UI.Image/UnityEngine.UI.Type Simple
      static void _set_Simple(UnityEngine::UI::Image::Type value);
      // static field const value: static public UnityEngine.UI.Image/UnityEngine.UI.Type Sliced
      static constexpr const int Sliced = 1;
      // Get static field: static public UnityEngine.UI.Image/UnityEngine.UI.Type Sliced
      static UnityEngine::UI::Image::Type _get_Sliced();
      // Set static field: static public UnityEngine.UI.Image/UnityEngine.UI.Type Sliced
      static void _set_Sliced(UnityEngine::UI::Image::Type value);
      // static field const value: static public UnityEngine.UI.Image/UnityEngine.UI.Type Tiled
      static constexpr const int Tiled = 2;
      // Get static field: static public UnityEngine.UI.Image/UnityEngine.UI.Type Tiled
      static UnityEngine::UI::Image::Type _get_Tiled();
      // Set static field: static public UnityEngine.UI.Image/UnityEngine.UI.Type Tiled
      static void _set_Tiled(UnityEngine::UI::Image::Type value);
      // static field const value: static public UnityEngine.UI.Image/UnityEngine.UI.Type Filled
      static constexpr const int Filled = 3;
      // Get static field: static public UnityEngine.UI.Image/UnityEngine.UI.Type Filled
      static UnityEngine::UI::Image::Type _get_Filled();
      // Set static field: static public UnityEngine.UI.Image/UnityEngine.UI.Type Filled
      static void _set_Filled(UnityEngine::UI::Image::Type value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // UnityEngine.UI.Image/UnityEngine.UI.Type
    #pragma pack(pop)
    static check_size<sizeof(Image::Type), 0 + sizeof(int)> __UnityEngine_UI_Image_TypeSizeCheck;
    static_assert(sizeof(Image::Type) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.Image/UnityEngine.UI.FillMethod
    // [TokenAttribute] Offset: FFFFFFFF
    struct FillMethod/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: FillMethod
      constexpr FillMethod(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Horizontal
      static constexpr const int Horizontal = 0;
      // Get static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Horizontal
      static UnityEngine::UI::Image::FillMethod _get_Horizontal();
      // Set static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Horizontal
      static void _set_Horizontal(UnityEngine::UI::Image::FillMethod value);
      // static field const value: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Vertical
      static constexpr const int Vertical = 1;
      // Get static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Vertical
      static UnityEngine::UI::Image::FillMethod _get_Vertical();
      // Set static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Vertical
      static void _set_Vertical(UnityEngine::UI::Image::FillMethod value);
      // static field const value: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Radial90
      static constexpr const int Radial90 = 2;
      // Get static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Radial90
      static UnityEngine::UI::Image::FillMethod _get_Radial90();
      // Set static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Radial90
      static void _set_Radial90(UnityEngine::UI::Image::FillMethod value);
      // static field const value: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Radial180
      static constexpr const int Radial180 = 3;
      // Get static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Radial180
      static UnityEngine::UI::Image::FillMethod _get_Radial180();
      // Set static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Radial180
      static void _set_Radial180(UnityEngine::UI::Image::FillMethod value);
      // static field const value: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Radial360
      static constexpr const int Radial360 = 4;
      // Get static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Radial360
      static UnityEngine::UI::Image::FillMethod _get_Radial360();
      // Set static field: static public UnityEngine.UI.Image/UnityEngine.UI.FillMethod Radial360
      static void _set_Radial360(UnityEngine::UI::Image::FillMethod value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // UnityEngine.UI.Image/UnityEngine.UI.FillMethod
    #pragma pack(pop)
    static check_size<sizeof(Image::FillMethod), 0 + sizeof(int)> __UnityEngine_UI_Image_FillMethodSizeCheck;
    static_assert(sizeof(Image::FillMethod) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0xDE6FF0
    // private UnityEngine.Sprite m_Sprite
    // Size: 0x8
    // Offset: 0xC0
    UnityEngine::Sprite* m_Sprite;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // private UnityEngine.Sprite m_OverrideSprite
    // Size: 0x8
    // Offset: 0xC8
    UnityEngine::Sprite* m_OverrideSprite;
    // Field size check
    static_assert(sizeof(UnityEngine::Sprite*) == 0x8);
    // private UnityEngine.UI.Image/UnityEngine.UI.Type m_Type
    // Size: 0x4
    // Offset: 0xD0
    UnityEngine::UI::Image::Type m_Type;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Image::Type) == 0x4);
    // private System.Boolean m_PreserveAspect
    // Size: 0x1
    // Offset: 0xD4
    bool m_PreserveAspect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_FillCenter
    // Size: 0x1
    // Offset: 0xD5
    bool m_FillCenter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_FillCenter and: m_FillMethod
    char __padding4[0x2] = {};
    // private UnityEngine.UI.Image/UnityEngine.UI.FillMethod m_FillMethod
    // Size: 0x4
    // Offset: 0xD8
    UnityEngine::UI::Image::FillMethod m_FillMethod;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Image::FillMethod) == 0x4);
    // [RangeAttribute] Offset: 0xDE707C
    // private System.Single m_FillAmount
    // Size: 0x4
    // Offset: 0xDC
    float m_FillAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_FillClockwise
    // Size: 0x1
    // Offset: 0xE0
    bool m_FillClockwise;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_FillClockwise and: m_FillOrigin
    char __padding7[0x3] = {};
    // private System.Int32 m_FillOrigin
    // Size: 0x4
    // Offset: 0xE4
    int m_FillOrigin;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_AlphaHitTestMinimumThreshold
    // Size: 0x4
    // Offset: 0xE8
    float m_AlphaHitTestMinimumThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_Tracked
    // Size: 0x1
    // Offset: 0xEC
    bool m_Tracked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UseSpriteMesh
    // Size: 0x1
    // Offset: 0xED
    bool m_UseSpriteMesh;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UseSpriteMesh and: m_PixelsPerUnitMultiplier
    char __padding11[0x2] = {};
    // private System.Single m_PixelsPerUnitMultiplier
    // Size: 0x4
    // Offset: 0xF0
    float m_PixelsPerUnitMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_CachedReferencePixelsPerUnit
    // Size: 0x4
    // Offset: 0xF4
    float m_CachedReferencePixelsPerUnit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: Image
