// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UI.Selectable
#include "UnityEngine/UI/Selectable.hpp"
// Including type: UnityEngine.EventSystems.IPointerClickHandler
#include "UnityEngine/EventSystems/IPointerClickHandler.hpp"
// Including type: UnityEngine.EventSystems.ISubmitHandler
#include "UnityEngine/EventSystems/ISubmitHandler.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.EventSystems.IUpdateSelectedHandler
#include "UnityEngine/EventSystems/IUpdateSelectedHandler.hpp"
// Including type: UnityEngine.EventSystems.IBeginDragHandler
#include "UnityEngine/EventSystems/IBeginDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IDragHandler
#include "UnityEngine/EventSystems/IDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IEndDragHandler
#include "UnityEngine/EventSystems/IEndDragHandler.hpp"
// Including type: UnityEngine.TouchScreenKeyboardType
#include "UnityEngine/TouchScreenKeyboardType.hpp"
// Including type: UnityEngine.UIVertex
#include "UnityEngine/UIVertex.hpp"

  // Skipping declaration: InputType because it is already included!
  // Skipping declaration: CharacterValidation because it is already included!
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
  // Forward declaring type: VertexHelper
  class VertexHelper;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: BaseInput
  class BaseInput;
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Forward declaring type: BaseEventData
  class BaseEventData;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Forward declaring type: InputField
  class InputField;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UI::InputField);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UI::InputField*, "UnityEngine.UI", "InputField");
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0x210
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.InputField
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 10C5B54
  class InputField : public ::UnityEngine::UI::Selectable/*, public ::UnityEngine::EventSystems::IPointerClickHandler, public ::UnityEngine::EventSystems::ISubmitHandler, public ::UnityEngine::UI::ICanvasElement, public ::UnityEngine::UI::ILayoutElement, public ::UnityEngine::EventSystems::IUpdateSelectedHandler, public ::UnityEngine::EventSystems::IBeginDragHandler, public ::UnityEngine::EventSystems::IDragHandler, public ::UnityEngine::EventSystems::IEndDragHandler*/ {
    public:
    // Nested type: ::UnityEngine::UI::InputField::ContentType
    struct ContentType;
    // Nested type: ::UnityEngine::UI::InputField::InputType
    struct InputType;
    // Nested type: ::UnityEngine::UI::InputField::CharacterValidation
    struct CharacterValidation;
    // Nested type: ::UnityEngine::UI::InputField::LineType
    struct LineType;
    // Nested type: ::UnityEngine::UI::InputField::OnValidateInput
    class OnValidateInput;
    // Nested type: ::UnityEngine::UI::InputField::SubmitEvent
    class SubmitEvent;
    // Nested type: ::UnityEngine::UI::InputField::OnChangeEvent
    class OnChangeEvent;
    // Nested type: ::UnityEngine::UI::InputField::EditState
    struct EditState;
    // Nested type: ::UnityEngine::UI::InputField::$CaretBlink$d__161
    class $CaretBlink$d__161;
    // Nested type: ::UnityEngine::UI::InputField::$MouseDragOutsideRect$d__181
    class $MouseDragOutsideRect$d__181;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.InputField/UnityEngine.UI.ContentType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ContentType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ContentType
      constexpr ContentType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Standard
      static constexpr const int Standard = 0;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Standard
      static ::UnityEngine::UI::InputField::ContentType _get_Standard();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Standard
      static void _set_Standard(::UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Autocorrected
      static constexpr const int Autocorrected = 1;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Autocorrected
      static ::UnityEngine::UI::InputField::ContentType _get_Autocorrected();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Autocorrected
      static void _set_Autocorrected(::UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType IntegerNumber
      static constexpr const int IntegerNumber = 2;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType IntegerNumber
      static ::UnityEngine::UI::InputField::ContentType _get_IntegerNumber();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType IntegerNumber
      static void _set_IntegerNumber(::UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType DecimalNumber
      static constexpr const int DecimalNumber = 3;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType DecimalNumber
      static ::UnityEngine::UI::InputField::ContentType _get_DecimalNumber();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType DecimalNumber
      static void _set_DecimalNumber(::UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Alphanumeric
      static constexpr const int Alphanumeric = 4;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Alphanumeric
      static ::UnityEngine::UI::InputField::ContentType _get_Alphanumeric();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Alphanumeric
      static void _set_Alphanumeric(::UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Name
      static constexpr const int Name = 5;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Name
      static ::UnityEngine::UI::InputField::ContentType _get_Name();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Name
      static void _set_Name(::UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType EmailAddress
      static constexpr const int EmailAddress = 6;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType EmailAddress
      static ::UnityEngine::UI::InputField::ContentType _get_EmailAddress();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType EmailAddress
      static void _set_EmailAddress(::UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Password
      static constexpr const int Password = 7;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Password
      static ::UnityEngine::UI::InputField::ContentType _get_Password();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Password
      static void _set_Password(::UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Pin
      static constexpr const int Pin = 8;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Pin
      static ::UnityEngine::UI::InputField::ContentType _get_Pin();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Pin
      static void _set_Pin(::UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Custom
      static constexpr const int Custom = 9;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Custom
      static ::UnityEngine::UI::InputField::ContentType _get_Custom();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.ContentType Custom
      static void _set_Custom(::UnityEngine::UI::InputField::ContentType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UI.InputField/UnityEngine.UI.ContentType
    #pragma pack(pop)
    static check_size<sizeof(InputField::ContentType), 0 + sizeof(int)> __UnityEngine_UI_InputField_ContentTypeSizeCheck;
    static_assert(sizeof(InputField::ContentType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.InputField/UnityEngine.UI.InputType
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputType
      constexpr InputType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.InputType Standard
      static constexpr const int Standard = 0;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.InputType Standard
      static ::UnityEngine::UI::InputField::InputType _get_Standard();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.InputType Standard
      static void _set_Standard(::UnityEngine::UI::InputField::InputType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.InputType AutoCorrect
      static constexpr const int AutoCorrect = 1;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.InputType AutoCorrect
      static ::UnityEngine::UI::InputField::InputType _get_AutoCorrect();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.InputType AutoCorrect
      static void _set_AutoCorrect(::UnityEngine::UI::InputField::InputType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.InputType Password
      static constexpr const int Password = 2;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.InputType Password
      static ::UnityEngine::UI::InputField::InputType _get_Password();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.InputType Password
      static void _set_Password(::UnityEngine::UI::InputField::InputType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UI.InputField/UnityEngine.UI.InputType
    #pragma pack(pop)
    static check_size<sizeof(InputField::InputType), 0 + sizeof(int)> __UnityEngine_UI_InputField_InputTypeSizeCheck;
    static_assert(sizeof(InputField::InputType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation
    // [TokenAttribute] Offset: FFFFFFFF
    struct CharacterValidation/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CharacterValidation
      constexpr CharacterValidation(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation None
      static ::UnityEngine::UI::InputField::CharacterValidation _get_None();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation None
      static void _set_None(::UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Integer
      static constexpr const int Integer = 1;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Integer
      static ::UnityEngine::UI::InputField::CharacterValidation _get_Integer();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Integer
      static void _set_Integer(::UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Decimal
      static constexpr const int Decimal = 2;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Decimal
      static ::UnityEngine::UI::InputField::CharacterValidation _get_Decimal();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Decimal
      static void _set_Decimal(::UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Alphanumeric
      static constexpr const int Alphanumeric = 3;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Alphanumeric
      static ::UnityEngine::UI::InputField::CharacterValidation _get_Alphanumeric();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Alphanumeric
      static void _set_Alphanumeric(::UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Name
      static constexpr const int Name = 4;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Name
      static ::UnityEngine::UI::InputField::CharacterValidation _get_Name();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation Name
      static void _set_Name(::UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation EmailAddress
      static constexpr const int EmailAddress = 5;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation EmailAddress
      static ::UnityEngine::UI::InputField::CharacterValidation _get_EmailAddress();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation EmailAddress
      static void _set_EmailAddress(::UnityEngine::UI::InputField::CharacterValidation value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation
    #pragma pack(pop)
    static check_size<sizeof(InputField::CharacterValidation), 0 + sizeof(int)> __UnityEngine_UI_InputField_CharacterValidationSizeCheck;
    static_assert(sizeof(InputField::CharacterValidation) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.InputField/UnityEngine.UI.LineType
    // [TokenAttribute] Offset: FFFFFFFF
    struct LineType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LineType
      constexpr LineType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.LineType SingleLine
      static constexpr const int SingleLine = 0;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.LineType SingleLine
      static ::UnityEngine::UI::InputField::LineType _get_SingleLine();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.LineType SingleLine
      static void _set_SingleLine(::UnityEngine::UI::InputField::LineType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.LineType MultiLineSubmit
      static constexpr const int MultiLineSubmit = 1;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.LineType MultiLineSubmit
      static ::UnityEngine::UI::InputField::LineType _get_MultiLineSubmit();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.LineType MultiLineSubmit
      static void _set_MultiLineSubmit(::UnityEngine::UI::InputField::LineType value);
      // static field const value: static public UnityEngine.UI.InputField/UnityEngine.UI.LineType MultiLineNewline
      static constexpr const int MultiLineNewline = 2;
      // Get static field: static public UnityEngine.UI.InputField/UnityEngine.UI.LineType MultiLineNewline
      static ::UnityEngine::UI::InputField::LineType _get_MultiLineNewline();
      // Set static field: static public UnityEngine.UI.InputField/UnityEngine.UI.LineType MultiLineNewline
      static void _set_MultiLineNewline(::UnityEngine::UI::InputField::LineType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UI.InputField/UnityEngine.UI.LineType
    #pragma pack(pop)
    static check_size<sizeof(InputField::LineType), 0 + sizeof(int)> __UnityEngine_UI_InputField_LineTypeSizeCheck;
    static_assert(sizeof(InputField::LineType) == 0x4);
    public:
    // protected UnityEngine.TouchScreenKeyboard m_Keyboard
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::TouchScreenKeyboard* m_Keyboard;
    // Field size check
    static_assert(sizeof(::UnityEngine::TouchScreenKeyboard*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x10C72D8
    // protected UnityEngine.UI.Text m_TextComponent
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::UI::Text* m_TextComponent;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // protected UnityEngine.UI.Graphic m_Placeholder
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::UI::Graphic* m_Placeholder;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Graphic*) == 0x8);
    // private UnityEngine.UI.InputField/UnityEngine.UI.ContentType m_ContentType
    // Size: 0x4
    // Offset: 0x110
    ::UnityEngine::UI::InputField::ContentType m_ContentType;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::InputField::ContentType) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x10C7344
    // private UnityEngine.UI.InputField/UnityEngine.UI.InputType m_InputType
    // Size: 0x4
    // Offset: 0x114
    ::UnityEngine::UI::InputField::InputType m_InputType;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::InputField::InputType) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x10C7390
    // private System.Char m_AsteriskChar
    // Size: 0x2
    // Offset: 0x118
    ::Il2CppChar m_AsteriskChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // Padding between fields: m_AsteriskChar and: m_KeyboardType
    char __padding5[0x2] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x10C73DC
    // private UnityEngine.TouchScreenKeyboardType m_KeyboardType
    // Size: 0x4
    // Offset: 0x11C
    ::UnityEngine::TouchScreenKeyboardType m_KeyboardType;
    // Field size check
    static_assert(sizeof(::UnityEngine::TouchScreenKeyboardType) == 0x4);
    // private UnityEngine.UI.InputField/UnityEngine.UI.LineType m_LineType
    // Size: 0x4
    // Offset: 0x120
    ::UnityEngine::UI::InputField::LineType m_LineType;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::InputField::LineType) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x10C7438
    // private System.Boolean m_HideMobileInput
    // Size: 0x1
    // Offset: 0x124
    bool m_HideMobileInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HideMobileInput and: m_CharacterValidation
    char __padding8[0x3] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x10C7484
    // private UnityEngine.UI.InputField/UnityEngine.UI.CharacterValidation m_CharacterValidation
    // Size: 0x4
    // Offset: 0x128
    ::UnityEngine::UI::InputField::CharacterValidation m_CharacterValidation;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::InputField::CharacterValidation) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x10C74D0
    // private System.Int32 m_CharacterLimit
    // Size: 0x4
    // Offset: 0x12C
    int m_CharacterLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x10C751C
    // [FormerlySerializedAsAttribute] Offset: 0x10C751C
    // [FormerlySerializedAsAttribute] Offset: 0x10C751C
    // private UnityEngine.UI.InputField/UnityEngine.UI.SubmitEvent m_OnEndEdit
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::UI::InputField::SubmitEvent* m_OnEndEdit;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::InputField::SubmitEvent*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x10C75B0
    // [FormerlySerializedAsAttribute] Offset: 0x10C75B0
    // private UnityEngine.UI.InputField/UnityEngine.UI.OnChangeEvent m_OnValueChanged
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::UI::InputField::OnChangeEvent* m_OnValueChanged;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::InputField::OnChangeEvent*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x10C7620
    // private UnityEngine.UI.InputField/UnityEngine.UI.OnValidateInput m_OnValidateInput
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::UI::InputField::OnValidateInput* m_OnValidateInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::InputField::OnValidateInput*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x10C766C
    // private UnityEngine.Color m_CaretColor
    // Size: 0x10
    // Offset: 0x148
    ::UnityEngine::Color m_CaretColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean m_CustomCaretColor
    // Size: 0x1
    // Offset: 0x158
    bool m_CustomCaretColor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CustomCaretColor and: m_SelectionColor
    char __padding15[0x3] = {};
    // private UnityEngine.Color m_SelectionColor
    // Size: 0x10
    // Offset: 0x15C
    ::UnityEngine::Color m_SelectionColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: m_SelectionColor and: m_Text
    char __padding16[0x4] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x10C76D8
    // protected System.String m_Text
    // Size: 0x8
    // Offset: 0x170
    ::StringW m_Text;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [RangeAttribute] Offset: 0x10C7724
    // private System.Single m_CaretBlinkRate
    // Size: 0x4
    // Offset: 0x178
    float m_CaretBlinkRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x10C7764
    // private System.Int32 m_CaretWidth
    // Size: 0x4
    // Offset: 0x17C
    int m_CaretWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_ReadOnly
    // Size: 0x1
    // Offset: 0x180
    bool m_ReadOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ShouldActivateOnSelect
    // Size: 0x1
    // Offset: 0x181
    bool m_ShouldActivateOnSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ShouldActivateOnSelect and: m_CaretPosition
    char __padding21[0x2] = {};
    // protected System.Int32 m_CaretPosition
    // Size: 0x4
    // Offset: 0x184
    int m_CaretPosition;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_CaretSelectPosition
    // Size: 0x4
    // Offset: 0x188
    int m_CaretSelectPosition;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_CaretSelectPosition and: caretRectTrans
    char __padding23[0x4] = {};
    // private UnityEngine.RectTransform caretRectTrans
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::RectTransform* caretRectTrans;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // protected UnityEngine.UIVertex[] m_CursorVerts
    // Size: 0x8
    // Offset: 0x198
    ::ArrayW<::UnityEngine::UIVertex> m_CursorVerts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIVertex>) == 0x8);
    // private UnityEngine.TextGenerator m_InputTextCache
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::TextGenerator* m_InputTextCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextGenerator*) == 0x8);
    // private UnityEngine.CanvasRenderer m_CachedInputRenderer
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::CanvasRenderer* m_CachedInputRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::CanvasRenderer*) == 0x8);
    // private System.Boolean m_PreventFontCallback
    // Size: 0x1
    // Offset: 0x1B0
    bool m_PreventFontCallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PreventFontCallback and: m_Mesh
    char __padding28[0x7] = {};
    // protected UnityEngine.Mesh m_Mesh
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::Mesh* m_Mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private System.Boolean m_AllowInput
    // Size: 0x1
    // Offset: 0x1C0
    bool m_AllowInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ShouldActivateNextUpdate
    // Size: 0x1
    // Offset: 0x1C1
    bool m_ShouldActivateNextUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UpdateDrag
    // Size: 0x1
    // Offset: 0x1C2
    bool m_UpdateDrag;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_DragPositionOutOfBounds
    // Size: 0x1
    // Offset: 0x1C3
    bool m_DragPositionOutOfBounds;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_CaretVisible
    // Size: 0x1
    // Offset: 0x1C4
    bool m_CaretVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CaretVisible and: m_BlinkCoroutine
    char __padding34[0x3] = {};
    // private UnityEngine.Coroutine m_BlinkCoroutine
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::Coroutine* m_BlinkCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Single m_BlinkStartTime
    // Size: 0x4
    // Offset: 0x1D0
    float m_BlinkStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Int32 m_DrawStart
    // Size: 0x4
    // Offset: 0x1D4
    int m_DrawStart;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_DrawEnd
    // Size: 0x4
    // Offset: 0x1D8
    int m_DrawEnd;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_DrawEnd and: m_DragCoroutine
    char __padding38[0x4] = {};
    // private UnityEngine.Coroutine m_DragCoroutine
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::Coroutine* m_DragCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.String m_OriginalText
    // Size: 0x8
    // Offset: 0x1E8
    ::StringW m_OriginalText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_WasCanceled
    // Size: 0x1
    // Offset: 0x1F0
    bool m_WasCanceled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HasDoneFocusTransition
    // Size: 0x1
    // Offset: 0x1F1
    bool m_HasDoneFocusTransition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasDoneFocusTransition and: m_WaitForSecondsRealtime
    char __padding42[0x6] = {};
    // private UnityEngine.WaitForSecondsRealtime m_WaitForSecondsRealtime
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::WaitForSecondsRealtime* m_WaitForSecondsRealtime;
    // Field size check
    static_assert(sizeof(::UnityEngine::WaitForSecondsRealtime*) == 0x8);
    // private System.Boolean m_TouchKeyboardAllowsInPlaceEditing
    // Size: 0x1
    // Offset: 0x200
    bool m_TouchKeyboardAllowsInPlaceEditing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_TouchKeyboardAllowsInPlaceEditing and: m_ProcessingEvent
    char __padding44[0x7] = {};
    // private UnityEngine.Event m_ProcessingEvent
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::Event* m_ProcessingEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Event*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::EventSystems::IPointerClickHandler
    operator ::UnityEngine::EventSystems::IPointerClickHandler() noexcept {
      return *reinterpret_cast<::UnityEngine::EventSystems::IPointerClickHandler*>(this);
    }
    // Creating interface conversion operator: i_IPointerClickHandler
    inline ::UnityEngine::EventSystems::IPointerClickHandler* i_IPointerClickHandler() noexcept {
      return reinterpret_cast<::UnityEngine::EventSystems::IPointerClickHandler*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::EventSystems::ISubmitHandler
    operator ::UnityEngine::EventSystems::ISubmitHandler() noexcept {
      return *reinterpret_cast<::UnityEngine::EventSystems::ISubmitHandler*>(this);
    }
