// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
// Including type: UnityEngine.UI.Selectable
#include "UnityEngine/UI/Selectable.hpp"
// Including type: UnityEngine.EventSystems.IUpdateSelectedHandler
#include "UnityEngine/EventSystems/IUpdateSelectedHandler.hpp"
// Including type: UnityEngine.EventSystems.IBeginDragHandler
#include "UnityEngine/EventSystems/IBeginDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IDragHandler
#include "UnityEngine/EventSystems/IDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IEndDragHandler
#include "UnityEngine/EventSystems/IEndDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IPointerClickHandler
#include "UnityEngine/EventSystems/IPointerClickHandler.hpp"
// Including type: UnityEngine.EventSystems.ISubmitHandler
#include "UnityEngine/EventSystems/ISubmitHandler.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.TouchScreenKeyboardType
#include "UnityEngine/TouchScreenKeyboardType.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Completed includes
// Begin forward declares

  class Coroutine;
  // Forward declaring type: WaitForSecondsRealtime
  class WaitForSecondsRealtime;
  // Forward declaring type: Event
  class Event;
  // Forward declaring type: Vector2
  struct Vector2;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
  // Forward declaring type: Graphic
  class Graphic;
  // Skipping declaration: ContentType because it is already included!
  // Skipping declaration: LineType because it is already included!
  // Skipping declaration: InputType because it is already included!
  // Skipping declaration: CharacterValidation because it is already included!
  // Forward declaring type: VertexHelper
  class VertexHelper;
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: BaseInput
  class BaseInput;
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Forward declaring type: BaseEventData
  class BaseEventData;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Autogenerated type: UnityEngine.UI.InputField
  class InputField : public UnityEngine::UI::Selectable, public UnityEngine::EventSystems::IUpdateSelectedHandler, public UnityEngine::EventSystems::IBeginDragHandler, public UnityEngine::EventSystems::IDragHandler, public UnityEngine::EventSystems::IEndDragHandler, public UnityEngine::EventSystems::IPointerClickHandler, public UnityEngine::EventSystems::ISubmitHandler, public UnityEngine::UI::ICanvasElement, public UnityEngine::UI::ILayoutElement {
    public:
    // Nested type: UnityEngine::UI::InputField::ContentType
    struct ContentType;
    // Nested type: UnityEngine::UI::InputField::InputType
    struct InputType;
    // Nested type: UnityEngine::UI::InputField::CharacterValidation
    struct CharacterValidation;
    // Nested type: UnityEngine::UI::InputField::LineType
    struct LineType;
    // Nested type: UnityEngine::UI::InputField::OnValidateInput
    class OnValidateInput;
    // Nested type: UnityEngine::UI::InputField::SubmitEvent
    class SubmitEvent;
    // Nested type: UnityEngine::UI::InputField::OnChangeEvent
    class OnChangeEvent;
    // Nested type: UnityEngine::UI::InputField::EditState
    struct EditState;
    // Nested type: UnityEngine::UI::InputField::$CaretBlink$d__159
    class $CaretBlink$d__159;
    // Nested type: UnityEngine::UI::InputField::$MouseDragOutsideRect$d__179
    class $MouseDragOutsideRect$d__179;
    // Autogenerated type: UnityEngine.UI.InputField/ContentType
    struct ContentType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: ContentType
      constexpr ContentType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.InputField/ContentType Standard
      static constexpr const int Standard = 0;
      // Get static field: static public UnityEngine.UI.InputField/ContentType Standard
      static UnityEngine::UI::InputField::ContentType _get_Standard();
      // Set static field: static public UnityEngine.UI.InputField/ContentType Standard
      static void _set_Standard(UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/ContentType Autocorrected
      static constexpr const int Autocorrected = 1;
      // Get static field: static public UnityEngine.UI.InputField/ContentType Autocorrected
      static UnityEngine::UI::InputField::ContentType _get_Autocorrected();
      // Set static field: static public UnityEngine.UI.InputField/ContentType Autocorrected
      static void _set_Autocorrected(UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/ContentType IntegerNumber
      static constexpr const int IntegerNumber = 2;
      // Get static field: static public UnityEngine.UI.InputField/ContentType IntegerNumber
      static UnityEngine::UI::InputField::ContentType _get_IntegerNumber();
      // Set static field: static public UnityEngine.UI.InputField/ContentType IntegerNumber
      static void _set_IntegerNumber(UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/ContentType DecimalNumber
      static constexpr const int DecimalNumber = 3;
      // Get static field: static public UnityEngine.UI.InputField/ContentType DecimalNumber
      static UnityEngine::UI::InputField::ContentType _get_DecimalNumber();
      // Set static field: static public UnityEngine.UI.InputField/ContentType DecimalNumber
      static void _set_DecimalNumber(UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/ContentType Alphanumeric
      static constexpr const int Alphanumeric = 4;
      // Get static field: static public UnityEngine.UI.InputField/ContentType Alphanumeric
      static UnityEngine::UI::InputField::ContentType _get_Alphanumeric();
      // Set static field: static public UnityEngine.UI.InputField/ContentType Alphanumeric
      static void _set_Alphanumeric(UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/ContentType Name
      static constexpr const int Name = 5;
      // Get static field: static public UnityEngine.UI.InputField/ContentType Name
      static UnityEngine::UI::InputField::ContentType _get_Name();
      // Set static field: static public UnityEngine.UI.InputField/ContentType Name
      static void _set_Name(UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/ContentType EmailAddress
      static constexpr const int EmailAddress = 6;
      // Get static field: static public UnityEngine.UI.InputField/ContentType EmailAddress
      static UnityEngine::UI::InputField::ContentType _get_EmailAddress();
      // Set static field: static public UnityEngine.UI.InputField/ContentType EmailAddress
      static void _set_EmailAddress(UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/ContentType Password
      static constexpr const int Password = 7;
      // Get static field: static public UnityEngine.UI.InputField/ContentType Password
      static UnityEngine::UI::InputField::ContentType _get_Password();
      // Set static field: static public UnityEngine.UI.InputField/ContentType Password
      static void _set_Password(UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/ContentType Pin
      static constexpr const int Pin = 8;
      // Get static field: static public UnityEngine.UI.InputField/ContentType Pin
      static UnityEngine::UI::InputField::ContentType _get_Pin();
      // Set static field: static public UnityEngine.UI.InputField/ContentType Pin
      static void _set_Pin(UnityEngine::UI::InputField::ContentType value);
      // static field const value: static public UnityEngine.UI.InputField/ContentType Custom
      static constexpr const int Custom = 9;
      // Get static field: static public UnityEngine.UI.InputField/ContentType Custom
      static UnityEngine::UI::InputField::ContentType _get_Custom();
      // Set static field: static public UnityEngine.UI.InputField/ContentType Custom
      static void _set_Custom(UnityEngine::UI::InputField::ContentType value);
    }; // UnityEngine.UI.InputField/ContentType
    // Autogenerated type: UnityEngine.UI.InputField/InputType
    struct InputType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: InputType
      constexpr InputType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.InputField/InputType Standard
      static constexpr const int Standard = 0;
      // Get static field: static public UnityEngine.UI.InputField/InputType Standard
      static UnityEngine::UI::InputField::InputType _get_Standard();
      // Set static field: static public UnityEngine.UI.InputField/InputType Standard
      static void _set_Standard(UnityEngine::UI::InputField::InputType value);
      // static field const value: static public UnityEngine.UI.InputField/InputType AutoCorrect
      static constexpr const int AutoCorrect = 1;
      // Get static field: static public UnityEngine.UI.InputField/InputType AutoCorrect
      static UnityEngine::UI::InputField::InputType _get_AutoCorrect();
      // Set static field: static public UnityEngine.UI.InputField/InputType AutoCorrect
      static void _set_AutoCorrect(UnityEngine::UI::InputField::InputType value);
      // static field const value: static public UnityEngine.UI.InputField/InputType Password
      static constexpr const int Password = 2;
      // Get static field: static public UnityEngine.UI.InputField/InputType Password
      static UnityEngine::UI::InputField::InputType _get_Password();
      // Set static field: static public UnityEngine.UI.InputField/InputType Password
      static void _set_Password(UnityEngine::UI::InputField::InputType value);
    }; // UnityEngine.UI.InputField/InputType
    // Autogenerated type: UnityEngine.UI.InputField/CharacterValidation
    struct CharacterValidation : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: CharacterValidation
      constexpr CharacterValidation(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.InputField/CharacterValidation None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.UI.InputField/CharacterValidation None
      static UnityEngine::UI::InputField::CharacterValidation _get_None();
      // Set static field: static public UnityEngine.UI.InputField/CharacterValidation None
      static void _set_None(UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/CharacterValidation Integer
      static constexpr const int Integer = 1;
      // Get static field: static public UnityEngine.UI.InputField/CharacterValidation Integer
      static UnityEngine::UI::InputField::CharacterValidation _get_Integer();
      // Set static field: static public UnityEngine.UI.InputField/CharacterValidation Integer
      static void _set_Integer(UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/CharacterValidation Decimal
      static constexpr const int Decimal = 2;
      // Get static field: static public UnityEngine.UI.InputField/CharacterValidation Decimal
      static UnityEngine::UI::InputField::CharacterValidation _get_Decimal();
      // Set static field: static public UnityEngine.UI.InputField/CharacterValidation Decimal
      static void _set_Decimal(UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/CharacterValidation Alphanumeric
      static constexpr const int Alphanumeric = 3;
      // Get static field: static public UnityEngine.UI.InputField/CharacterValidation Alphanumeric
      static UnityEngine::UI::InputField::CharacterValidation _get_Alphanumeric();
      // Set static field: static public UnityEngine.UI.InputField/CharacterValidation Alphanumeric
      static void _set_Alphanumeric(UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/CharacterValidation Name
      static constexpr const int Name = 4;
      // Get static field: static public UnityEngine.UI.InputField/CharacterValidation Name
      static UnityEngine::UI::InputField::CharacterValidation _get_Name();
      // Set static field: static public UnityEngine.UI.InputField/CharacterValidation Name
      static void _set_Name(UnityEngine::UI::InputField::CharacterValidation value);
      // static field const value: static public UnityEngine.UI.InputField/CharacterValidation EmailAddress
      static constexpr const int EmailAddress = 5;
      // Get static field: static public UnityEngine.UI.InputField/CharacterValidation EmailAddress
      static UnityEngine::UI::InputField::CharacterValidation _get_EmailAddress();
      // Set static field: static public UnityEngine.UI.InputField/CharacterValidation EmailAddress
      static void _set_EmailAddress(UnityEngine::UI::InputField::CharacterValidation value);
    }; // UnityEngine.UI.InputField/CharacterValidation
    // Autogenerated type: UnityEngine.UI.InputField/LineType
    struct LineType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: LineType
      constexpr LineType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.InputField/LineType SingleLine
      static constexpr const int SingleLine = 0;
      // Get static field: static public UnityEngine.UI.InputField/LineType SingleLine
      static UnityEngine::UI::InputField::LineType _get_SingleLine();
      // Set static field: static public UnityEngine.UI.InputField/LineType SingleLine
      static void _set_SingleLine(UnityEngine::UI::InputField::LineType value);
      // static field const value: static public UnityEngine.UI.InputField/LineType MultiLineSubmit
      static constexpr const int MultiLineSubmit = 1;
      // Get static field: static public UnityEngine.UI.InputField/LineType MultiLineSubmit
      static UnityEngine::UI::InputField::LineType _get_MultiLineSubmit();
      // Set static field: static public UnityEngine.UI.InputField/LineType MultiLineSubmit
      static void _set_MultiLineSubmit(UnityEngine::UI::InputField::LineType value);
      // static field const value: static public UnityEngine.UI.InputField/LineType MultiLineNewline
      static constexpr const int MultiLineNewline = 2;
      // Get static field: static public UnityEngine.UI.InputField/LineType MultiLineNewline
      static UnityEngine::UI::InputField::LineType _get_MultiLineNewline();
      // Set static field: static public UnityEngine.UI.InputField/LineType MultiLineNewline
      static void _set_MultiLineNewline(UnityEngine::UI::InputField::LineType value);
    }; // UnityEngine.UI.InputField/LineType
    // protected UnityEngine.TouchScreenKeyboard m_Keyboard
    // Offset: 0xF0
    UnityEngine::TouchScreenKeyboard* m_Keyboard;
    // protected UnityEngine.UI.Text m_TextComponent
    // Offset: 0xF8
    UnityEngine::UI::Text* m_TextComponent;
    // protected UnityEngine.UI.Graphic m_Placeholder
    // Offset: 0x100
    UnityEngine::UI::Graphic* m_Placeholder;
    // private UnityEngine.UI.InputField/ContentType m_ContentType
    // Offset: 0x108
    UnityEngine::UI::InputField::ContentType m_ContentType;
    // private UnityEngine.UI.InputField/InputType m_InputType
    // Offset: 0x10C
    UnityEngine::UI::InputField::InputType m_InputType;
    // private System.Char m_AsteriskChar
    // Offset: 0x110
    ::Il2CppChar m_AsteriskChar;
    // private UnityEngine.TouchScreenKeyboardType m_KeyboardType
    // Offset: 0x114
    UnityEngine::TouchScreenKeyboardType m_KeyboardType;
    // private UnityEngine.UI.InputField/LineType m_LineType
    // Offset: 0x118
    UnityEngine::UI::InputField::LineType m_LineType;
    // private System.Boolean m_HideMobileInput
    // Offset: 0x11C
    bool m_HideMobileInput;
    // private UnityEngine.UI.InputField/CharacterValidation m_CharacterValidation
    // Offset: 0x120
    UnityEngine::UI::InputField::CharacterValidation m_CharacterValidation;
    // private System.Int32 m_CharacterLimit
    // Offset: 0x124
    int m_CharacterLimit;
    // private UnityEngine.UI.InputField/SubmitEvent m_OnEndEdit
    // Offset: 0x128
    UnityEngine::UI::InputField::SubmitEvent* m_OnEndEdit;
    // private UnityEngine.UI.InputField/OnChangeEvent m_OnValueChanged
    // Offset: 0x130
    UnityEngine::UI::InputField::OnChangeEvent* m_OnValueChanged;
    // private UnityEngine.UI.InputField/OnValidateInput m_OnValidateInput
    // Offset: 0x138
    UnityEngine::UI::InputField::OnValidateInput* m_OnValidateInput;
    // private UnityEngine.Color m_CaretColor
    // Offset: 0x140
    UnityEngine::Color m_CaretColor;
    // private System.Boolean m_CustomCaretColor
    // Offset: 0x150
    bool m_CustomCaretColor;
    // private UnityEngine.Color m_SelectionColor
    // Offset: 0x154
    UnityEngine::Color m_SelectionColor;
    // protected System.String m_Text
    // Offset: 0x168
    ::Il2CppString* m_Text;
    // private System.Single m_CaretBlinkRate
    // Offset: 0x170
    float m_CaretBlinkRate;
    // private System.Int32 m_CaretWidth
    // Offset: 0x174
    int m_CaretWidth;
    // private System.Boolean m_ReadOnly
    // Offset: 0x178
    bool m_ReadOnly;
    // protected System.Int32 m_CaretPosition
    // Offset: 0x17C
    int m_CaretPosition;
    // protected System.Int32 m_CaretSelectPosition
    // Offset: 0x180
    int m_CaretSelectPosition;
    // private UnityEngine.RectTransform caretRectTrans
    // Offset: 0x188
    UnityEngine::RectTransform* caretRectTrans;
    // protected UnityEngine.UIVertex[] m_CursorVerts
    // Offset: 0x190
    ::Array<UnityEngine::UIVertex>* m_CursorVerts;
    // private UnityEngine.TextGenerator m_InputTextCache
    // Offset: 0x198
    UnityEngine::TextGenerator* m_InputTextCache;
    // private UnityEngine.CanvasRenderer m_CachedInputRenderer
    // Offset: 0x1A0
    UnityEngine::CanvasRenderer* m_CachedInputRenderer;
    // private System.Boolean m_PreventFontCallback
    // Offset: 0x1A8
    bool m_PreventFontCallback;
    // protected UnityEngine.Mesh m_Mesh
    // Offset: 0x1B0
    UnityEngine::Mesh* m_Mesh;
    // private System.Boolean m_AllowInput
    // Offset: 0x1B8
    bool m_AllowInput;
    // private System.Boolean m_ShouldActivateNextUpdate
    // Offset: 0x1B9
    bool m_ShouldActivateNextUpdate;
    // private System.Boolean m_UpdateDrag
    // Offset: 0x1BA
    bool m_UpdateDrag;
    // private System.Boolean m_DragPositionOutOfBounds
    // Offset: 0x1BB
    bool m_DragPositionOutOfBounds;
    // protected System.Boolean m_CaretVisible
    // Offset: 0x1BC
    bool m_CaretVisible;
    // private UnityEngine.Coroutine m_BlinkCoroutine
    // Offset: 0x1C0
    UnityEngine::Coroutine* m_BlinkCoroutine;
    // private System.Single m_BlinkStartTime
    // Offset: 0x1C8
    float m_BlinkStartTime;
    // protected System.Int32 m_DrawStart
    // Offset: 0x1CC
    int m_DrawStart;
    // protected System.Int32 m_DrawEnd
    // Offset: 0x1D0
    int m_DrawEnd;
    // private UnityEngine.Coroutine m_DragCoroutine
    // Offset: 0x1D8
    UnityEngine::Coroutine* m_DragCoroutine;
    // private System.String m_OriginalText
    // Offset: 0x1E0
    ::Il2CppString* m_OriginalText;
    // private System.Boolean m_WasCanceled
    // Offset: 0x1E8
    bool m_WasCanceled;
    // private System.Boolean m_HasDoneFocusTransition
    // Offset: 0x1E9
    bool m_HasDoneFocusTransition;
    // private UnityEngine.WaitForSecondsRealtime m_WaitForSecondsRealtime
    // Offset: 0x1F0
    UnityEngine::WaitForSecondsRealtime* m_WaitForSecondsRealtime;
    // private System.Boolean m_TouchKeyboardAllowsInPlaceEditing
    // Offset: 0x1F8
    bool m_TouchKeyboardAllowsInPlaceEditing;
    // private UnityEngine.Event m_ProcessingEvent
    // Offset: 0x200
    UnityEngine::Event* m_ProcessingEvent;
    // Get static field: static private readonly System.Char[] kSeparators
    static ::Array<::Il2CppChar>* _get_kSeparators();
    // Set static field: static private readonly System.Char[] kSeparators
    static void _set_kSeparators(::Array<::Il2CppChar>* value);
    // static field const value: static private System.Single kHScrollSpeed
    static constexpr const float kHScrollSpeed = 0.05;
    // Get static field: static private System.Single kHScrollSpeed
    static float _get_kHScrollSpeed();
    // Set static field: static private System.Single kHScrollSpeed
    static void _set_kHScrollSpeed(float value);
    // static field const value: static private System.Single kVScrollSpeed
    static constexpr const float kVScrollSpeed = 0.1;
    // Get static field: static private System.Single kVScrollSpeed
    static float _get_kVScrollSpeed();
    // Set static field: static private System.Single kVScrollSpeed
