// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.EventSystems.IInitializePotentialDragHandler
#include "UnityEngine/EventSystems/IInitializePotentialDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IBeginDragHandler
#include "UnityEngine/EventSystems/IBeginDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IEndDragHandler
#include "UnityEngine/EventSystems/IEndDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IDragHandler
#include "UnityEngine/EventSystems/IDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IScrollHandler
#include "UnityEngine/EventSystems/IScrollHandler.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.UI.ILayoutGroup
#include "UnityEngine/UI/ILayoutGroup.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: UnityEngine.DrivenRectTransformTracker
#include "UnityEngine/DrivenRectTransformTracker.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Scrollbar
  class Scrollbar;
  // Skipping declaration: MovementType because it is already included!
  // Skipping declaration: ScrollbarVisibility because it is already included!
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0x128
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.ScrollRect
  // [AddComponentMenu] Offset: DC5668
  // [SelectionBaseAttribute] Offset: DC5668
  // [ExecuteAlways] Offset: DC5668
  // [DisallowMultipleComponent] Offset: DC5668
  // [RequireComponent] Offset: DC5668
  class ScrollRect : public UnityEngine::EventSystems::UIBehaviour/*, public UnityEngine::EventSystems::IInitializePotentialDragHandler, public UnityEngine::EventSystems::IBeginDragHandler, public UnityEngine::EventSystems::IEndDragHandler, public UnityEngine::EventSystems::IDragHandler, public UnityEngine::EventSystems::IScrollHandler, public UnityEngine::UI::ICanvasElement, public UnityEngine::UI::ILayoutElement, public UnityEngine::UI::ILayoutGroup*/ {
    public:
    // Nested type: UnityEngine::UI::ScrollRect::MovementType
    struct MovementType;
    // Nested type: UnityEngine::UI::ScrollRect::ScrollbarVisibility
    struct ScrollbarVisibility;
    // Nested type: UnityEngine::UI::ScrollRect::ScrollRectEvent
    class ScrollRectEvent;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.ScrollRect/MovementType
    struct MovementType/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: MovementType
      constexpr MovementType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.ScrollRect/MovementType Unrestricted
      static constexpr const int Unrestricted = 0;
      // Get static field: static public UnityEngine.UI.ScrollRect/MovementType Unrestricted
      static UnityEngine::UI::ScrollRect::MovementType _get_Unrestricted();
      // Set static field: static public UnityEngine.UI.ScrollRect/MovementType Unrestricted
      static void _set_Unrestricted(UnityEngine::UI::ScrollRect::MovementType value);
      // static field const value: static public UnityEngine.UI.ScrollRect/MovementType Elastic
      static constexpr const int Elastic = 1;
      // Get static field: static public UnityEngine.UI.ScrollRect/MovementType Elastic
      static UnityEngine::UI::ScrollRect::MovementType _get_Elastic();
      // Set static field: static public UnityEngine.UI.ScrollRect/MovementType Elastic
      static void _set_Elastic(UnityEngine::UI::ScrollRect::MovementType value);
      // static field const value: static public UnityEngine.UI.ScrollRect/MovementType Clamped
      static constexpr const int Clamped = 2;
      // Get static field: static public UnityEngine.UI.ScrollRect/MovementType Clamped
      static UnityEngine::UI::ScrollRect::MovementType _get_Clamped();
      // Set static field: static public UnityEngine.UI.ScrollRect/MovementType Clamped
      static void _set_Clamped(UnityEngine::UI::ScrollRect::MovementType value);
    }; // UnityEngine.UI.ScrollRect/MovementType
    #pragma pack(pop)
    static check_size<sizeof(ScrollRect::MovementType), 0 + sizeof(int)> __UnityEngine_UI_ScrollRect_MovementTypeSizeCheck;
    static_assert(sizeof(ScrollRect::MovementType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.ScrollRect/ScrollbarVisibility
    struct ScrollbarVisibility/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ScrollbarVisibility
      constexpr ScrollbarVisibility(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility Permanent
      static constexpr const int Permanent = 0;
      // Get static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility Permanent
      static UnityEngine::UI::ScrollRect::ScrollbarVisibility _get_Permanent();
      // Set static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility Permanent
      static void _set_Permanent(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
      // static field const value: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHide
      static constexpr const int AutoHide = 1;
      // Get static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHide
      static UnityEngine::UI::ScrollRect::ScrollbarVisibility _get_AutoHide();
      // Set static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHide
      static void _set_AutoHide(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
      // static field const value: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHideAndExpandViewport
      static constexpr const int AutoHideAndExpandViewport = 2;
      // Get static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHideAndExpandViewport
      static UnityEngine::UI::ScrollRect::ScrollbarVisibility _get_AutoHideAndExpandViewport();
      // Set static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHideAndExpandViewport
      static void _set_AutoHideAndExpandViewport(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
    }; // UnityEngine.UI.ScrollRect/ScrollbarVisibility
    #pragma pack(pop)
    static check_size<sizeof(ScrollRect::ScrollbarVisibility), 0 + sizeof(int)> __UnityEngine_UI_ScrollRect_ScrollbarVisibilitySizeCheck;
    static_assert(sizeof(ScrollRect::ScrollbarVisibility) == 0x4);
    // private UnityEngine.RectTransform m_Content
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::RectTransform* m_Content;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private System.Boolean m_Horizontal
    // Size: 0x1
    // Offset: 0x20
    bool m_Horizontal;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Vertical
    // Size: 0x1
    // Offset: 0x21
    bool m_Vertical;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Vertical and: m_MovementType
    char __padding2[0x2] = {};
    // private UnityEngine.UI.ScrollRect/MovementType m_MovementType
    // Size: 0x4
    // Offset: 0x24
    UnityEngine::UI::ScrollRect::MovementType m_MovementType;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::ScrollRect::MovementType) == 0x4);
    // private System.Single m_Elasticity
    // Size: 0x4
    // Offset: 0x28
    float m_Elasticity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_Inertia
    // Size: 0x1
    // Offset: 0x2C
    bool m_Inertia;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Inertia and: m_DecelerationRate
    char __padding5[0x3] = {};
    // private System.Single m_DecelerationRate
    // Size: 0x4
    // Offset: 0x30
    float m_DecelerationRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ScrollSensitivity
    // Size: 0x4
    // Offset: 0x34
    float m_ScrollSensitivity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.RectTransform m_Viewport
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::RectTransform* m_Viewport;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.UI.Scrollbar m_HorizontalScrollbar
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::UI::Scrollbar* m_HorizontalScrollbar;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Scrollbar*) == 0x8);
    // private UnityEngine.UI.Scrollbar m_VerticalScrollbar
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::UI::Scrollbar* m_VerticalScrollbar;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Scrollbar*) == 0x8);
    // private UnityEngine.UI.ScrollRect/ScrollbarVisibility m_HorizontalScrollbarVisibility
    // Size: 0x4
    // Offset: 0x50
    UnityEngine::UI::ScrollRect::ScrollbarVisibility m_HorizontalScrollbarVisibility;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::ScrollRect::ScrollbarVisibility) == 0x4);
    // private UnityEngine.UI.ScrollRect/ScrollbarVisibility m_VerticalScrollbarVisibility
    // Size: 0x4
    // Offset: 0x54
    UnityEngine::UI::ScrollRect::ScrollbarVisibility m_VerticalScrollbarVisibility;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::ScrollRect::ScrollbarVisibility) == 0x4);
    // private System.Single m_HorizontalScrollbarSpacing
    // Size: 0x4
    // Offset: 0x58
    float m_HorizontalScrollbarSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_VerticalScrollbarSpacing
    // Size: 0x4
    // Offset: 0x5C
    float m_VerticalScrollbarSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.UI.ScrollRect/ScrollRectEvent m_OnValueChanged
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::UI::ScrollRect::ScrollRectEvent* m_OnValueChanged;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::ScrollRect::ScrollRectEvent*) == 0x8);
    // private UnityEngine.Vector2 m_PointerStartLocalCursor
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::Vector2 m_PointerStartLocalCursor;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // protected UnityEngine.Vector2 m_ContentStartPosition
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::Vector2 m_ContentStartPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.RectTransform m_ViewRect
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::RectTransform* m_ViewRect;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // protected UnityEngine.Bounds m_ContentBounds
    // Size: 0x18
    // Offset: 0x80
    UnityEngine::Bounds m_ContentBounds;
    // Field size check
    static_assert(sizeof(UnityEngine::Bounds) == 0x18);
    // private UnityEngine.Bounds m_ViewBounds
    // Size: 0x18
    // Offset: 0x98
    UnityEngine::Bounds m_ViewBounds;
    // Field size check
    static_assert(sizeof(UnityEngine::Bounds) == 0x18);
    // private UnityEngine.Vector2 m_Velocity
    // Size: 0x8
    // Offset: 0xB0
    UnityEngine::Vector2 m_Velocity;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private System.Boolean m_Dragging
    // Size: 0x1
    // Offset: 0xB8
    bool m_Dragging;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Scrolling
    // Size: 0x1
    // Offset: 0xB9
    bool m_Scrolling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Scrolling and: m_PrevPosition
    char __padding23[0x2] = {};
    // private UnityEngine.Vector2 m_PrevPosition
    // Size: 0x8
    // Offset: 0xBC
    UnityEngine::Vector2 m_PrevPosition;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Bounds m_PrevContentBounds
    // Size: 0x18
    // Offset: 0xC4
    UnityEngine::Bounds m_PrevContentBounds;
    // Field size check
    static_assert(sizeof(UnityEngine::Bounds) == 0x18);
    // private UnityEngine.Bounds m_PrevViewBounds
    // Size: 0x18
    // Offset: 0xDC
    UnityEngine::Bounds m_PrevViewBounds;
    // Field size check
    static_assert(sizeof(UnityEngine::Bounds) == 0x18);
    // private System.Boolean m_HasRebuiltLayout
    // Size: 0x1
    // Offset: 0xF4
    bool m_HasRebuiltLayout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HSliderExpand
    // Size: 0x1
    // Offset: 0xF5
    bool m_HSliderExpand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_VSliderExpand
    // Size: 0x1
    // Offset: 0xF6
    bool m_VSliderExpand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_VSliderExpand and: m_HSliderHeight
    char __padding29[0x1] = {};
    // private System.Single m_HSliderHeight
    // Size: 0x4
    // Offset: 0xF8
    float m_HSliderHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_VSliderWidth
    // Size: 0x4
    // Offset: 0xFC
    float m_VSliderWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.RectTransform m_Rect
    // Size: 0x8
    // Offset: 0x100
    UnityEngine::RectTransform* m_Rect;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform m_HorizontalScrollbarRect
    // Size: 0x8
    // Offset: 0x108
    UnityEngine::RectTransform* m_HorizontalScrollbarRect;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform m_VerticalScrollbarRect
    // Size: 0x8
    // Offset: 0x110
    UnityEngine::RectTransform* m_VerticalScrollbarRect;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.DrivenRectTransformTracker m_Tracker
    // Size: 0x1
    // Offset: 0x118
    UnityEngine::DrivenRectTransformTracker m_Tracker;
    // Field size check
    static_assert(sizeof(UnityEngine::DrivenRectTransformTracker) == 0x1);
    // Padding between fields: m_Tracker and: m_Corners
    char __padding35[0x7] = {};
    // private readonly UnityEngine.Vector3[] m_Corners
    // Size: 0x8
    // Offset: 0x120
    ::Array<UnityEngine::Vector3>* m_Corners;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector3>*) == 0x8);
    // Creating value type constructor for type: ScrollRect
