// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.EventSystems.IInitializePotentialDragHandler
#include "UnityEngine/EventSystems/IInitializePotentialDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IBeginDragHandler
#include "UnityEngine/EventSystems/IBeginDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IEndDragHandler
#include "UnityEngine/EventSystems/IEndDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IDragHandler
#include "UnityEngine/EventSystems/IDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IScrollHandler
#include "UnityEngine/EventSystems/IScrollHandler.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.UI.ILayoutGroup
#include "UnityEngine/UI/ILayoutGroup.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: UnityEngine.DrivenRectTransformTracker
#include "UnityEngine/DrivenRectTransformTracker.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Scrollbar
  class Scrollbar;
  // Skipping declaration: MovementType because it is already included!
  // Skipping declaration: ScrollbarVisibility because it is already included!
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Autogenerated type: UnityEngine.UI.ScrollRect
  class ScrollRect : public UnityEngine::EventSystems::UIBehaviour, public UnityEngine::EventSystems::IInitializePotentialDragHandler, public UnityEngine::EventSystems::IBeginDragHandler, public UnityEngine::EventSystems::IEndDragHandler, public UnityEngine::EventSystems::IDragHandler, public UnityEngine::EventSystems::IScrollHandler, public UnityEngine::UI::ICanvasElement, public UnityEngine::UI::ILayoutElement, public UnityEngine::UI::ILayoutGroup {
    public:
    // Nested type: UnityEngine::UI::ScrollRect::MovementType
    struct MovementType;
    // Nested type: UnityEngine::UI::ScrollRect::ScrollbarVisibility
    struct ScrollbarVisibility;
    // Nested type: UnityEngine::UI::ScrollRect::ScrollRectEvent
    class ScrollRectEvent;
    // Autogenerated type: UnityEngine.UI.ScrollRect/MovementType
    struct MovementType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: MovementType
      constexpr MovementType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.ScrollRect/MovementType Unrestricted
      static constexpr const int Unrestricted = 0;
      // Get static field: static public UnityEngine.UI.ScrollRect/MovementType Unrestricted
      static UnityEngine::UI::ScrollRect::MovementType _get_Unrestricted();
      // Set static field: static public UnityEngine.UI.ScrollRect/MovementType Unrestricted
      static void _set_Unrestricted(UnityEngine::UI::ScrollRect::MovementType value);
      // static field const value: static public UnityEngine.UI.ScrollRect/MovementType Elastic
      static constexpr const int Elastic = 1;
      // Get static field: static public UnityEngine.UI.ScrollRect/MovementType Elastic
      static UnityEngine::UI::ScrollRect::MovementType _get_Elastic();
      // Set static field: static public UnityEngine.UI.ScrollRect/MovementType Elastic
      static void _set_Elastic(UnityEngine::UI::ScrollRect::MovementType value);
      // static field const value: static public UnityEngine.UI.ScrollRect/MovementType Clamped
      static constexpr const int Clamped = 2;
      // Get static field: static public UnityEngine.UI.ScrollRect/MovementType Clamped
      static UnityEngine::UI::ScrollRect::MovementType _get_Clamped();
      // Set static field: static public UnityEngine.UI.ScrollRect/MovementType Clamped
      static void _set_Clamped(UnityEngine::UI::ScrollRect::MovementType value);
    }; // UnityEngine.UI.ScrollRect/MovementType
    // Autogenerated type: UnityEngine.UI.ScrollRect/ScrollbarVisibility
    struct ScrollbarVisibility : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: ScrollbarVisibility
      constexpr ScrollbarVisibility(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility Permanent
      static constexpr const int Permanent = 0;
      // Get static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility Permanent
      static UnityEngine::UI::ScrollRect::ScrollbarVisibility _get_Permanent();
      // Set static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility Permanent
      static void _set_Permanent(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
      // static field const value: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHide
      static constexpr const int AutoHide = 1;
      // Get static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHide
      static UnityEngine::UI::ScrollRect::ScrollbarVisibility _get_AutoHide();
      // Set static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHide
      static void _set_AutoHide(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
      // static field const value: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHideAndExpandViewport
      static constexpr const int AutoHideAndExpandViewport = 2;
      // Get static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHideAndExpandViewport
      static UnityEngine::UI::ScrollRect::ScrollbarVisibility _get_AutoHideAndExpandViewport();
      // Set static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHideAndExpandViewport
      static void _set_AutoHideAndExpandViewport(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
    }; // UnityEngine.UI.ScrollRect/ScrollbarVisibility
    // private UnityEngine.RectTransform m_Content
    // Offset: 0x18
    UnityEngine::RectTransform* m_Content;
    // private System.Boolean m_Horizontal
    // Offset: 0x20
    bool m_Horizontal;
    // private System.Boolean m_Vertical
    // Offset: 0x21
    bool m_Vertical;
    // private UnityEngine.UI.ScrollRect/MovementType m_MovementType
    // Offset: 0x24
    UnityEngine::UI::ScrollRect::MovementType m_MovementType;
    // private System.Single m_Elasticity
    // Offset: 0x28
    float m_Elasticity;
    // private System.Boolean m_Inertia
    // Offset: 0x2C
    bool m_Inertia;
    // private System.Single m_DecelerationRate
    // Offset: 0x30
    float m_DecelerationRate;
    // private System.Single m_ScrollSensitivity
    // Offset: 0x34
    float m_ScrollSensitivity;
    // private UnityEngine.RectTransform m_Viewport
    // Offset: 0x38
    UnityEngine::RectTransform* m_Viewport;
    // private UnityEngine.UI.Scrollbar m_HorizontalScrollbar
    // Offset: 0x40
    UnityEngine::UI::Scrollbar* m_HorizontalScrollbar;
    // private UnityEngine.UI.Scrollbar m_VerticalScrollbar
    // Offset: 0x48
    UnityEngine::UI::Scrollbar* m_VerticalScrollbar;
    // private UnityEngine.UI.ScrollRect/ScrollbarVisibility m_HorizontalScrollbarVisibility
    // Offset: 0x50
    UnityEngine::UI::ScrollRect::ScrollbarVisibility m_HorizontalScrollbarVisibility;
    // private UnityEngine.UI.ScrollRect/ScrollbarVisibility m_VerticalScrollbarVisibility
    // Offset: 0x54
    UnityEngine::UI::ScrollRect::ScrollbarVisibility m_VerticalScrollbarVisibility;
    // private System.Single m_HorizontalScrollbarSpacing
    // Offset: 0x58
    float m_HorizontalScrollbarSpacing;
    // private System.Single m_VerticalScrollbarSpacing
    // Offset: 0x5C
    float m_VerticalScrollbarSpacing;
    // private UnityEngine.UI.ScrollRect/ScrollRectEvent m_OnValueChanged
    // Offset: 0x60
    UnityEngine::UI::ScrollRect::ScrollRectEvent* m_OnValueChanged;
    // private UnityEngine.Vector2 m_PointerStartLocalCursor
    // Offset: 0x68
    UnityEngine::Vector2 m_PointerStartLocalCursor;
    // protected UnityEngine.Vector2 m_ContentStartPosition
    // Offset: 0x70
    UnityEngine::Vector2 m_ContentStartPosition;
    // private UnityEngine.RectTransform m_ViewRect
    // Offset: 0x78
    UnityEngine::RectTransform* m_ViewRect;
    // protected UnityEngine.Bounds m_ContentBounds
    // Offset: 0x80
    UnityEngine::Bounds m_ContentBounds;
    // private UnityEngine.Bounds m_ViewBounds
    // Offset: 0x98
    UnityEngine::Bounds m_ViewBounds;
    // private UnityEngine.Vector2 m_Velocity
    // Offset: 0xB0
    UnityEngine::Vector2 m_Velocity;
    // private System.Boolean m_Dragging
    // Offset: 0xB8
    bool m_Dragging;
    // private System.Boolean m_Scrolling
    // Offset: 0xB9
    bool m_Scrolling;
    // private UnityEngine.Vector2 m_PrevPosition
    // Offset: 0xBC
    UnityEngine::Vector2 m_PrevPosition;
    // private UnityEngine.Bounds m_PrevContentBounds
    // Offset: 0xC4
    UnityEngine::Bounds m_PrevContentBounds;
    // private UnityEngine.Bounds m_PrevViewBounds
    // Offset: 0xDC
    UnityEngine::Bounds m_PrevViewBounds;
    // private System.Boolean m_HasRebuiltLayout
    // Offset: 0xF4
    bool m_HasRebuiltLayout;
    // private System.Boolean m_HSliderExpand
    // Offset: 0xF5
    bool m_HSliderExpand;
    // private System.Boolean m_VSliderExpand
    // Offset: 0xF6
    bool m_VSliderExpand;
    // private System.Single m_HSliderHeight
    // Offset: 0xF8
    float m_HSliderHeight;
    // private System.Single m_VSliderWidth
    // Offset: 0xFC
    float m_VSliderWidth;
    // private UnityEngine.RectTransform m_Rect
    // Offset: 0x100
    UnityEngine::RectTransform* m_Rect;
    // private UnityEngine.RectTransform m_HorizontalScrollbarRect
    // Offset: 0x108
    UnityEngine::RectTransform* m_HorizontalScrollbarRect;
    // private UnityEngine.RectTransform m_VerticalScrollbarRect
    // Offset: 0x110
    UnityEngine::RectTransform* m_VerticalScrollbarRect;
    // private UnityEngine.DrivenRectTransformTracker m_Tracker
    // Offset: 0x118
    UnityEngine::DrivenRectTransformTracker m_Tracker;
    // private readonly UnityEngine.Vector3[] m_Corners
    // Offset: 0x120
    ::Array<UnityEngine::Vector3>* m_Corners;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // public UnityEngine.RectTransform get_content()
    // Offset: 0x120B1C0
    UnityEngine::RectTransform* get_content();
    // public System.Void set_content(UnityEngine.RectTransform value)
    // Offset: 0x120B1C8
    void set_content(UnityEngine::RectTransform* value);
    // public System.Boolean get_horizontal()
    // Offset: 0x120B1D0
    bool get_horizontal();
    // public System.Void set_horizontal(System.Boolean value)
    // Offset: 0x120B1D8
    void set_horizontal(bool value);
    // public System.Boolean get_vertical()
    // Offset: 0x120B1E4
    bool get_vertical();
    // public System.Void set_vertical(System.Boolean value)
    // Offset: 0x120B1EC
    void set_vertical(bool value);
    // public UnityEngine.UI.ScrollRect/MovementType get_movementType()
    // Offset: 0x120B1F8
    UnityEngine::UI::ScrollRect::MovementType get_movementType();
    // public System.Void set_movementType(UnityEngine.UI.ScrollRect/MovementType value)
    // Offset: 0x120B200
    void set_movementType(UnityEngine::UI::ScrollRect::MovementType value);
    // public System.Single get_elasticity()
    // Offset: 0x120B208
    float get_elasticity();
    // public System.Void set_elasticity(System.Single value)
    // Offset: 0x120B210
    void set_elasticity(float value);
    // public System.Boolean get_inertia()
    // Offset: 0x120B218
    bool get_inertia();
    // public System.Void set_inertia(System.Boolean value)
    // Offset: 0x120B220
    void set_inertia(bool value);
    // public System.Single get_decelerationRate()
    // Offset: 0x120B22C
    float get_decelerationRate();
    // public System.Void set_decelerationRate(System.Single value)
    // Offset: 0x120B234
    void set_decelerationRate(float value);
    // public System.Single get_scrollSensitivity()
    // Offset: 0x120B23C
    float get_scrollSensitivity();
    // public System.Void set_scrollSensitivity(System.Single value)
    // Offset: 0x120B244
    void set_scrollSensitivity(float value);
    // public UnityEngine.RectTransform get_viewport()
    // Offset: 0x120B24C
    UnityEngine::RectTransform* get_viewport();
    // public System.Void set_viewport(UnityEngine.RectTransform value)
    // Offset: 0x120B254
    void set_viewport(UnityEngine::RectTransform* value);
    // public UnityEngine.UI.Scrollbar get_horizontalScrollbar()
    // Offset: 0x120B34C
    UnityEngine::UI::Scrollbar* get_horizontalScrollbar();
    // public System.Void set_horizontalScrollbar(UnityEngine.UI.Scrollbar value)
    // Offset: 0x120B354
    void set_horizontalScrollbar(UnityEngine::UI::Scrollbar* value);
    // public UnityEngine.UI.Scrollbar get_verticalScrollbar()
    // Offset: 0x120B4DC
    UnityEngine::UI::Scrollbar* get_verticalScrollbar();
    // public System.Void set_verticalScrollbar(UnityEngine.UI.Scrollbar value)
    // Offset: 0x120B4E4
    void set_verticalScrollbar(UnityEngine::UI::Scrollbar* value);
    // public UnityEngine.UI.ScrollRect/ScrollbarVisibility get_horizontalScrollbarVisibility()
    // Offset: 0x120B66C
    UnityEngine::UI::ScrollRect::ScrollbarVisibility get_horizontalScrollbarVisibility();
    // public System.Void set_horizontalScrollbarVisibility(UnityEngine.UI.ScrollRect/ScrollbarVisibility value)
    // Offset: 0x120B674
    void set_horizontalScrollbarVisibility(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
    // public UnityEngine.UI.ScrollRect/ScrollbarVisibility get_verticalScrollbarVisibility()
    // Offset: 0x120B67C
    UnityEngine::UI::ScrollRect::ScrollbarVisibility get_verticalScrollbarVisibility();
    // public System.Void set_verticalScrollbarVisibility(UnityEngine.UI.ScrollRect/ScrollbarVisibility value)
    // Offset: 0x120B684
    void set_verticalScrollbarVisibility(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
    // public System.Single get_horizontalScrollbarSpacing()
    // Offset: 0x120B68C
    float get_horizontalScrollbarSpacing();
    // public System.Void set_horizontalScrollbarSpacing(System.Single value)
    // Offset: 0x120B694
    void set_horizontalScrollbarSpacing(float value);
    // public System.Single get_verticalScrollbarSpacing()
    // Offset: 0x120B730
    float get_verticalScrollbarSpacing();
    // public System.Void set_verticalScrollbarSpacing(System.Single value)
    // Offset: 0x120B738
    void set_verticalScrollbarSpacing(float value);
    // public UnityEngine.UI.ScrollRect/ScrollRectEvent get_onValueChanged()
    // Offset: 0x120B740
    UnityEngine::UI::ScrollRect::ScrollRectEvent* get_onValueChanged();
    // public System.Void set_onValueChanged(UnityEngine.UI.ScrollRect/ScrollRectEvent value)
    // Offset: 0x120B748
    void set_onValueChanged(UnityEngine::UI::ScrollRect::ScrollRectEvent* value);
    // protected UnityEngine.RectTransform get_viewRect()
    // Offset: 0x120B750
    UnityEngine::RectTransform* get_viewRect();
    // public UnityEngine.Vector2 get_velocity()
    // Offset: 0x120B85C
    UnityEngine::Vector2 get_velocity();
    // public System.Void set_velocity(UnityEngine.Vector2 value)
    // Offset: 0x120B864
    void set_velocity(UnityEngine::Vector2 value);
    // private UnityEngine.RectTransform get_rectTransform()
    // Offset: 0x120B86C
    UnityEngine::RectTransform* get_rectTransform();
    // private System.Void UpdateCachedData()
    // Offset: 0x120BB20
    void UpdateCachedData();
    // private System.Void EnsureLayoutHasRebuilt()
    // Offset: 0x120CBA4
    void EnsureLayoutHasRebuilt();
    // public System.Void StopMovement()
    // Offset: 0x120CC28
    void StopMovement();
    // protected System.Void SetContentAnchoredPosition(UnityEngine.Vector2 position)
    // Offset: 0x120D448
    void SetContentAnchoredPosition(UnityEngine::Vector2 position);
    // protected System.Void LateUpdate()
    // Offset: 0x120D560
    void LateUpdate();
    // protected System.Void UpdatePrevData()
    // Offset: 0x120C680
    void UpdatePrevData();
    // private System.Void UpdateScrollbars(UnityEngine.Vector2 offset)
    // Offset: 0x120C468
    void UpdateScrollbars(UnityEngine::Vector2 offset);
    // public UnityEngine.Vector2 get_normalizedPosition()
    // Offset: 0x120DBF4
    UnityEngine::Vector2 get_normalizedPosition();
    // public System.Void set_normalizedPosition(UnityEngine.Vector2 value)
    // Offset: 0x120DFE8
    void set_normalizedPosition(UnityEngine::Vector2 value);
    // public System.Single get_horizontalNormalizedPosition()
    // Offset: 0x120DD40
    float get_horizontalNormalizedPosition();
    // public System.Void set_horizontalNormalizedPosition(System.Single value)
    // Offset: 0x120E03C
    void set_horizontalNormalizedPosition(float value);
    // public System.Single get_verticalNormalizedPosition()
    // Offset: 0x120DE98
    float get_verticalNormalizedPosition();
    // public System.Void set_verticalNormalizedPosition(System.Single value)
    // Offset: 0x120E050
    void set_verticalNormalizedPosition(float value);
    // private System.Void SetHorizontalNormalizedPosition(System.Single value)
    // Offset: 0x120E064
    void SetHorizontalNormalizedPosition(float value);
    // private System.Void SetVerticalNormalizedPosition(System.Single value)
    // Offset: 0x120E078
    void SetVerticalNormalizedPosition(float value);
    // protected System.Void SetNormalizedPosition(System.Single value, System.Int32 axis)
    // Offset: 0x120E08C
    void SetNormalizedPosition(float value, int axis);
    // static private System.Single RubberDelta(System.Single overStretching, System.Single viewSize)
    // Offset: 0x120D39C
    static float RubberDelta(float overStretching, float viewSize);
    // private System.Boolean get_hScrollingNeeded()
    // Offset: 0x120E2A8
    bool get_hScrollingNeeded();
    // private System.Boolean get_vScrollingNeeded()
    // Offset: 0x120E310
    bool get_vScrollingNeeded();
    // private System.Void UpdateScrollbarVisibility()
    // Offset: 0x120DC4C
    void UpdateScrollbarVisibility();
    // static private System.Void UpdateOneScrollbarVisibility(System.Boolean xScrollingNeeded, System.Boolean xAxisEnabled, UnityEngine.UI.ScrollRect/ScrollbarVisibility scrollbarVisibility, UnityEngine.UI.Scrollbar scrollbar)
    // Offset: 0x120EF00
    static void UpdateOneScrollbarVisibility(bool xScrollingNeeded, bool xAxisEnabled, UnityEngine::UI::ScrollRect::ScrollbarVisibility scrollbarVisibility, UnityEngine::UI::Scrollbar* scrollbar);
    // private System.Void UpdateScrollbarLayout()
    // Offset: 0x120EBD8
    void UpdateScrollbarLayout();
    // protected System.Void UpdateBounds()
    // Offset: 0x120BF0C
    void UpdateBounds();
    // static System.Void AdjustBounds(ref UnityEngine.Bounds viewBounds, ref UnityEngine.Vector2 contentPivot, ref UnityEngine.Vector3 contentSize, ref UnityEngine.Vector3 contentPos)
    // Offset: 0x120F004
    static void AdjustBounds(UnityEngine::Bounds& viewBounds, UnityEngine::Vector2& contentPivot, UnityEngine::Vector3& contentSize, UnityEngine::Vector3& contentPos);
    // private UnityEngine.Bounds GetBounds()
    // Offset: 0x120E988
    UnityEngine::Bounds GetBounds();
    // static UnityEngine.Bounds InternalGetBounds(UnityEngine.Vector3[] corners, ref UnityEngine.Matrix4x4 viewWorldToLocalMatrix)
    // Offset: 0x120F144
    static UnityEngine::Bounds InternalGetBounds(::Array<UnityEngine::Vector3>* corners, UnityEngine::Matrix4x4& viewWorldToLocalMatrix);
    // private UnityEngine.Vector2 CalculateOffset(UnityEngine.Vector2 delta)
    // Offset: 0x120CF40
    UnityEngine::Vector2 CalculateOffset(UnityEngine::Vector2 delta);
    // static UnityEngine.Vector2 InternalCalculateOffset(ref UnityEngine.Bounds viewBounds, ref UnityEngine.Bounds contentBounds, System.Boolean horizontal, System.Boolean vertical, UnityEngine.UI.ScrollRect/MovementType movementType, ref UnityEngine.Vector2 delta)
    // Offset: 0x120F348
    static UnityEngine::Vector2 InternalCalculateOffset(UnityEngine::Bounds& viewBounds, UnityEngine::Bounds& contentBounds, bool horizontal, bool vertical, UnityEngine::UI::ScrollRect::MovementType movementType, UnityEngine::Vector2& delta);
    // protected System.Void SetDirty()
    // Offset: 0x120B69C
    void SetDirty();
    // protected System.Void SetDirtyCaching()
    // Offset: 0x120B27C
    void SetDirtyCaching();
    // protected System.Void .ctor()
    // Offset: 0x120B918
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static ScrollRect* New_ctor();
    // public System.Void Rebuild(UnityEngine.UI.CanvasUpdate executing)
    // Offset: 0x120BA6C
    // Implemented from: UnityEngine.UI.ICanvasElement
    // Base method: System.Void ICanvasElement::Rebuild(UnityEngine.UI.CanvasUpdate executing)
    void Rebuild(UnityEngine::UI::CanvasUpdate executing);
    // public System.Void LayoutComplete()
    // Offset: 0x120C75C
    // Implemented from: UnityEngine.UI.ICanvasElement
    // Base method: System.Void ICanvasElement::LayoutComplete()
    void LayoutComplete();
    // public System.Void GraphicUpdateComplete()
    // Offset: 0x120C760
    // Implemented from: UnityEngine.UI.ICanvasElement
    // Base method: System.Void ICanvasElement::GraphicUpdateComplete()
    void GraphicUpdateComplete();
    // protected override System.Void OnEnable()
    // Offset: 0x120C764
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnEnable()
    void OnEnable();
    // protected override System.Void OnDisable()
    // Offset: 0x120C904
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnDisable()
    void OnDisable();
    // public override System.Boolean IsActive()
    // Offset: 0x120CB14
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Boolean UIBehaviour::IsActive()
    bool IsActive();
    // public System.Void OnScroll(UnityEngine.EventSystems.PointerEventData data)
    // Offset: 0x120CC94
    // Implemented from: UnityEngine.EventSystems.IScrollHandler
    // Base method: System.Void IScrollHandler::OnScroll(UnityEngine.EventSystems.PointerEventData data)
    void OnScroll(UnityEngine::EventSystems::PointerEventData* data);
    // public System.Void OnInitializePotentialDrag(UnityEngine.EventSystems.PointerEventData eventData)
    // Offset: 0x120CF7C
    // Implemented from: UnityEngine.EventSystems.IInitializePotentialDragHandler
    // Base method: System.Void IInitializePotentialDragHandler::OnInitializePotentialDrag(UnityEngine.EventSystems.PointerEventData eventData)
    void OnInitializePotentialDrag(UnityEngine::EventSystems::PointerEventData* eventData);
    // public System.Void OnBeginDrag(UnityEngine.EventSystems.PointerEventData eventData)
    // Offset: 0x120D004
    // Implemented from: UnityEngine.EventSystems.IBeginDragHandler
    // Base method: System.Void IBeginDragHandler::OnBeginDrag(UnityEngine.EventSystems.PointerEventData eventData)
    void OnBeginDrag(UnityEngine::EventSystems::PointerEventData* eventData);
    // public System.Void OnEndDrag(UnityEngine.EventSystems.PointerEventData eventData)
    // Offset: 0x120D134
    // Implemented from: UnityEngine.EventSystems.IEndDragHandler
    // Base method: System.Void IEndDragHandler::OnEndDrag(UnityEngine.EventSystems.PointerEventData eventData)
    void OnEndDrag(UnityEngine::EventSystems::PointerEventData* eventData);
    // public System.Void OnDrag(UnityEngine.EventSystems.PointerEventData eventData)
    // Offset: 0x120D158
    // Implemented from: UnityEngine.EventSystems.IDragHandler
    // Base method: System.Void IDragHandler::OnDrag(UnityEngine.EventSystems.PointerEventData eventData)
    void OnDrag(UnityEngine::EventSystems::PointerEventData* eventData);
    // protected override System.Void OnRectTransformDimensionsChange()
    // Offset: 0x120E2A4
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnRectTransformDimensionsChange()
    void OnRectTransformDimensionsChange();
    // public System.Void CalculateLayoutInputHorizontal()
    // Offset: 0x120E378
    // Implemented from: UnityEngine.UI.ILayoutElement
    // Base method: System.Void ILayoutElement::CalculateLayoutInputHorizontal()
    void CalculateLayoutInputHorizontal();
    // public System.Void CalculateLayoutInputVertical()
    // Offset: 0x120E37C
    // Implemented from: UnityEngine.UI.ILayoutElement
    // Base method: System.Void ILayoutElement::CalculateLayoutInputVertical()
    void CalculateLayoutInputVertical();
    // public System.Single get_minWidth()
    // Offset: 0x120E380
    // Implemented from: UnityEngine.UI.ILayoutElement
    // Base method: System.Single ILayoutElement::get_minWidth()
    float get_minWidth();
    // public System.Single get_preferredWidth()
    // Offset: 0x120E388
    // Implemented from: UnityEngine.UI.ILayoutElement
    // Base method: System.Single ILayoutElement::get_preferredWidth()
    float get_preferredWidth();
    // public System.Single get_flexibleWidth()
    // Offset: 0x120E390
    // Implemented from: UnityEngine.UI.ILayoutElement
    // Base method: System.Single ILayoutElement::get_flexibleWidth()
    float get_flexibleWidth();
    // public System.Single get_minHeight()
    // Offset: 0x120E398
    // Implemented from: UnityEngine.UI.ILayoutElement
    // Base method: System.Single ILayoutElement::get_minHeight()
    float get_minHeight();
    // public System.Single get_preferredHeight()
    // Offset: 0x120E3A0
    // Implemented from: UnityEngine.UI.ILayoutElement
    // Base method: System.Single ILayoutElement::get_preferredHeight()
    float get_preferredHeight();
    // public System.Single get_flexibleHeight()
    // Offset: 0x120E3A8
    // Implemented from: UnityEngine.UI.ILayoutElement
    // Base method: System.Single ILayoutElement::get_flexibleHeight()
    float get_flexibleHeight();
    // public System.Int32 get_layoutPriority()
    // Offset: 0x120E3B0
    // Implemented from: UnityEngine.UI.ILayoutElement
    // Base method: System.Int32 ILayoutElement::get_layoutPriority()
    int get_layoutPriority();
    // public System.Void SetLayoutHorizontal()
    // Offset: 0x120E3B8
    // Implemented from: UnityEngine.UI.ILayoutController
    // Base method: System.Void ILayoutController::SetLayoutHorizontal()
    void SetLayoutHorizontal();
    // public System.Void SetLayoutVertical()
    // Offset: 0x120EA7C
    // Implemented from: UnityEngine.UI.ILayoutController
    // Base method: System.Void ILayoutController::SetLayoutVertical()
    void SetLayoutVertical();
    // private UnityEngine.Transform UnityEngine.UI.ICanvasElement.get_transform()
    // Offset: 0x120F53C
    // Implemented from: UnityEngine.UI.ICanvasElement
    // Base method: UnityEngine.Transform ICanvasElement::get_transform()
    UnityEngine::Transform* UnityEngine_UI_ICanvasElement_get_transform();
  }; // UnityEngine.UI.ScrollRect
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::ScrollRect*, "UnityEngine.UI", "ScrollRect");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::ScrollRect::MovementType, "UnityEngine.UI", "ScrollRect/MovementType");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::ScrollRect::ScrollbarVisibility, "UnityEngine.UI", "ScrollRect/ScrollbarVisibility");
#pragma pack(pop)
