// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.UI.Selectable
#include "UnityEngine/UI/Selectable.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
// Including type: UnityEngine.EventSystems.IBeginDragHandler
#include "UnityEngine/EventSystems/IBeginDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IDragHandler
#include "UnityEngine/EventSystems/IDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IInitializePotentialDragHandler
#include "UnityEngine/EventSystems/IInitializePotentialDragHandler.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.DrivenRectTransformTracker
#include "UnityEngine/DrivenRectTransformTracker.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Skipping declaration: Direction because it is already included!
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Forward declaring type: AxisEventData
  class AxisEventData;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0x13A
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.Scrollbar
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: DB2C44
  // [ExecuteAlways] Offset: FFFFFFFF
  // [RequireComponent] Offset: DB2C44
  class Scrollbar : public UnityEngine::UI::Selectable/*, public UnityEngine::UI::ICanvasElement, public UnityEngine::EventSystems::IBeginDragHandler, public UnityEngine::EventSystems::IDragHandler, public UnityEngine::EventSystems::IInitializePotentialDragHandler*/ {
    public:
    // Nested type: UnityEngine::UI::Scrollbar::Direction
    struct Direction;
    // Nested type: UnityEngine::UI::Scrollbar::ScrollEvent
    class ScrollEvent;
    // Nested type: UnityEngine::UI::Scrollbar::Axis
    struct Axis;
    // Nested type: UnityEngine::UI::Scrollbar::$ClickRepeat$d__58
    class $ClickRepeat$d__58;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction
    // [TokenAttribute] Offset: FFFFFFFF
    struct Direction/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: Direction
      constexpr Direction(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction LeftToRight
      static constexpr const int LeftToRight = 0;
      // Get static field: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction LeftToRight
      static UnityEngine::UI::Scrollbar::Direction _get_LeftToRight();
      // Set static field: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction LeftToRight
      static void _set_LeftToRight(UnityEngine::UI::Scrollbar::Direction value);
      // static field const value: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction RightToLeft
      static constexpr const int RightToLeft = 1;
      // Get static field: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction RightToLeft
      static UnityEngine::UI::Scrollbar::Direction _get_RightToLeft();
      // Set static field: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction RightToLeft
      static void _set_RightToLeft(UnityEngine::UI::Scrollbar::Direction value);
      // static field const value: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction BottomToTop
      static constexpr const int BottomToTop = 2;
      // Get static field: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction BottomToTop
      static UnityEngine::UI::Scrollbar::Direction _get_BottomToTop();
      // Set static field: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction BottomToTop
      static void _set_BottomToTop(UnityEngine::UI::Scrollbar::Direction value);
      // static field const value: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction TopToBottom
      static constexpr const int TopToBottom = 3;
      // Get static field: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction TopToBottom
      static UnityEngine::UI::Scrollbar::Direction _get_TopToBottom();
      // Set static field: static public UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction TopToBottom
      static void _set_TopToBottom(UnityEngine::UI::Scrollbar::Direction value);
      // Get instance field: public System.Int32 value__
      int _get_value__();
      // Set instance field: public System.Int32 value__
      void _set_value__(int value);
    }; // UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction
    #pragma pack(pop)
    static check_size<sizeof(Scrollbar::Direction), 0 + sizeof(int)> __UnityEngine_UI_Scrollbar_DirectionSizeCheck;
    static_assert(sizeof(Scrollbar::Direction) == 0x4);
    // private UnityEngine.RectTransform m_HandleRect
    // Size: 0x8
    // Offset: 0xF8
    UnityEngine::RectTransform* m_HandleRect;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.UI.Scrollbar/UnityEngine.UI.Direction m_Direction
    // Size: 0x4
    // Offset: 0x100
    UnityEngine::UI::Scrollbar::Direction m_Direction;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Scrollbar::Direction) == 0x4);
    // [RangeAttribute] Offset: 0xDB49C4
    // private System.Single m_Value
    // Size: 0x4
    // Offset: 0x104
    float m_Value;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xDB4A04
    // private System.Single m_Size
    // Size: 0x4
    // Offset: 0x108
    float m_Size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xDB4A44
    // private System.Int32 m_NumberOfSteps
    // Size: 0x4
    // Offset: 0x10C
    int m_NumberOfSteps;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [SpaceAttribute] Offset: 0xDB4A84
    // private UnityEngine.UI.Scrollbar/UnityEngine.UI.ScrollEvent m_OnValueChanged
    // Size: 0x8
    // Offset: 0x110
    UnityEngine::UI::Scrollbar::ScrollEvent* m_OnValueChanged;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Scrollbar::ScrollEvent*) == 0x8);
    // private UnityEngine.RectTransform m_ContainerRect
    // Size: 0x8
    // Offset: 0x118
    UnityEngine::RectTransform* m_ContainerRect;
    // Field size check
    static_assert(sizeof(UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.Vector2 m_Offset
    // Size: 0x8
    // Offset: 0x120
    UnityEngine::Vector2 m_Offset;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.DrivenRectTransformTracker m_Tracker
    // Size: 0x1
    // Offset: 0x128
    UnityEngine::DrivenRectTransformTracker m_Tracker;
    // Field size check
    static_assert(sizeof(UnityEngine::DrivenRectTransformTracker) == 0x1);
    // Padding between fields: m_Tracker and: m_PointerDownRepeat
    char __padding8[0x7] = {};
    // private UnityEngine.Coroutine m_PointerDownRepeat
    // Size: 0x8
    // Offset: 0x130
    UnityEngine::Coroutine* m_PointerDownRepeat;
    // Field size check
    static_assert(sizeof(UnityEngine::Coroutine*) == 0x8);
    // private System.Boolean isPointerDownAndNotDragging
    // Size: 0x1
    // Offset: 0x138
    bool isPointerDownAndNotDragging;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_DelayedUpdateVisuals
    // Size: 0x1
    // Offset: 0x139
    bool m_DelayedUpdateVisuals;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: Scrollbar
