// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.EventSystems.IInitializePotentialDragHandler
#include "UnityEngine/EventSystems/IInitializePotentialDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IBeginDragHandler
#include "UnityEngine/EventSystems/IBeginDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IEndDragHandler
#include "UnityEngine/EventSystems/IEndDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IDragHandler
#include "UnityEngine/EventSystems/IDragHandler.hpp"
// Including type: UnityEngine.EventSystems.IScrollHandler
#include "UnityEngine/EventSystems/IScrollHandler.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.UI.ILayoutGroup
#include "UnityEngine/UI/ILayoutGroup.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: UnityEngine.DrivenRectTransformTracker
#include "UnityEngine/DrivenRectTransformTracker.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Scrollbar
  class Scrollbar;
  // Skipping declaration: MovementType because it is already included!
  // Skipping declaration: ScrollbarVisibility because it is already included!
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Autogenerated type: UnityEngine.UI.ScrollRect
  class ScrollRect : public UnityEngine::EventSystems::UIBehaviour/*, public UnityEngine::EventSystems::IInitializePotentialDragHandler, public UnityEngine::EventSystems::IBeginDragHandler, public UnityEngine::EventSystems::IEndDragHandler, public UnityEngine::EventSystems::IDragHandler, public UnityEngine::EventSystems::IScrollHandler, public UnityEngine::UI::ICanvasElement, public UnityEngine::UI::ILayoutElement, public UnityEngine::UI::ILayoutGroup*/ {
    public:
    // Nested type: UnityEngine::UI::ScrollRect::MovementType
    struct MovementType;
    // Nested type: UnityEngine::UI::ScrollRect::ScrollbarVisibility
    struct ScrollbarVisibility;
    // Nested type: UnityEngine::UI::ScrollRect::ScrollRectEvent
    class ScrollRectEvent;
    // Autogenerated type: UnityEngine.UI.ScrollRect/MovementType
    struct MovementType : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: MovementType
      constexpr MovementType(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.ScrollRect/MovementType Unrestricted
      static constexpr const int Unrestricted = 0;
      // Get static field: static public UnityEngine.UI.ScrollRect/MovementType Unrestricted
      static UnityEngine::UI::ScrollRect::MovementType _get_Unrestricted();
      // Set static field: static public UnityEngine.UI.ScrollRect/MovementType Unrestricted
      static void _set_Unrestricted(UnityEngine::UI::ScrollRect::MovementType value);
      // static field const value: static public UnityEngine.UI.ScrollRect/MovementType Elastic
      static constexpr const int Elastic = 1;
      // Get static field: static public UnityEngine.UI.ScrollRect/MovementType Elastic
      static UnityEngine::UI::ScrollRect::MovementType _get_Elastic();
      // Set static field: static public UnityEngine.UI.ScrollRect/MovementType Elastic
      static void _set_Elastic(UnityEngine::UI::ScrollRect::MovementType value);
      // static field const value: static public UnityEngine.UI.ScrollRect/MovementType Clamped
      static constexpr const int Clamped = 2;
      // Get static field: static public UnityEngine.UI.ScrollRect/MovementType Clamped
      static UnityEngine::UI::ScrollRect::MovementType _get_Clamped();
      // Set static field: static public UnityEngine.UI.ScrollRect/MovementType Clamped
      static void _set_Clamped(UnityEngine::UI::ScrollRect::MovementType value);
    }; // UnityEngine.UI.ScrollRect/MovementType
    // Autogenerated type: UnityEngine.UI.ScrollRect/ScrollbarVisibility
    struct ScrollbarVisibility : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: ScrollbarVisibility
      constexpr ScrollbarVisibility(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility Permanent
      static constexpr const int Permanent = 0;
      // Get static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility Permanent
      static UnityEngine::UI::ScrollRect::ScrollbarVisibility _get_Permanent();
      // Set static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility Permanent
      static void _set_Permanent(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
      // static field const value: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHide
      static constexpr const int AutoHide = 1;
      // Get static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHide
      static UnityEngine::UI::ScrollRect::ScrollbarVisibility _get_AutoHide();
      // Set static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHide
      static void _set_AutoHide(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
      // static field const value: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHideAndExpandViewport
      static constexpr const int AutoHideAndExpandViewport = 2;
      // Get static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHideAndExpandViewport
      static UnityEngine::UI::ScrollRect::ScrollbarVisibility _get_AutoHideAndExpandViewport();
      // Set static field: static public UnityEngine.UI.ScrollRect/ScrollbarVisibility AutoHideAndExpandViewport
      static void _set_AutoHideAndExpandViewport(UnityEngine::UI::ScrollRect::ScrollbarVisibility value);
    }; // UnityEngine.UI.ScrollRect/ScrollbarVisibility
    // private UnityEngine.RectTransform m_Content
    // Offset: 0x18
    UnityEngine::RectTransform* m_Content;
    // private System.Boolean m_Horizontal
    // Offset: 0x20
    bool m_Horizontal;
    // private System.Boolean m_Vertical
    // Offset: 0x21
    bool m_Vertical;
    // private UnityEngine.UI.ScrollRect/MovementType m_MovementType
    // Offset: 0x24
    UnityEngine::UI::ScrollRect::MovementType m_MovementType;
    // private System.Single m_Elasticity
    // Offset: 0x28
    float m_Elasticity;
    // private System.Boolean m_Inertia
    // Offset: 0x2C
    bool m_Inertia;
    // private System.Single m_DecelerationRate
    // Offset: 0x30
    float m_DecelerationRate;
    // private System.Single m_ScrollSensitivity
    // Offset: 0x34
    float m_ScrollSensitivity;
    // private UnityEngine.RectTransform m_Viewport
    // Offset: 0x38
    UnityEngine::RectTransform* m_Viewport;
    // private UnityEngine.UI.Scrollbar m_HorizontalScrollbar
    // Offset: 0x40
    UnityEngine::UI::Scrollbar* m_HorizontalScrollbar;
    // private UnityEngine.UI.Scrollbar m_VerticalScrollbar
    // Offset: 0x48
    UnityEngine::UI::Scrollbar* m_VerticalScrollbar;
    // private UnityEngine.UI.ScrollRect/ScrollbarVisibility m_HorizontalScrollbarVisibility
    // Offset: 0x50
    UnityEngine::UI::ScrollRect::ScrollbarVisibility m_HorizontalScrollbarVisibility;
    // private UnityEngine.UI.ScrollRect/ScrollbarVisibility m_VerticalScrollbarVisibility
    // Offset: 0x54
    UnityEngine::UI::ScrollRect::ScrollbarVisibility m_VerticalScrollbarVisibility;
    // private System.Single m_HorizontalScrollbarSpacing
    // Offset: 0x58
    float m_HorizontalScrollbarSpacing;
    // private System.Single m_VerticalScrollbarSpacing
    // Offset: 0x5C
    float m_VerticalScrollbarSpacing;
    // private UnityEngine.UI.ScrollRect/ScrollRectEvent m_OnValueChanged
    // Offset: 0x60
    UnityEngine::UI::ScrollRect::ScrollRectEvent* m_OnValueChanged;
    // private UnityEngine.Vector2 m_PointerStartLocalCursor
    // Offset: 0x68
    UnityEngine::Vector2 m_PointerStartLocalCursor;
    // protected UnityEngine.Vector2 m_ContentStartPosition
    // Offset: 0x70
    UnityEngine::Vector2 m_ContentStartPosition;
    // private UnityEngine.RectTransform m_ViewRect
    // Offset: 0x78
    UnityEngine::RectTransform* m_ViewRect;
    // protected UnityEngine.Bounds m_ContentBounds
    // Offset: 0x80
    UnityEngine::Bounds m_ContentBounds;
    // private UnityEngine.Bounds m_ViewBounds
    // Offset: 0x98
    UnityEngine::Bounds m_ViewBounds;
    // private UnityEngine.Vector2 m_Velocity
    // Offset: 0xB0
    UnityEngine::Vector2 m_Velocity;
    // private System.Boolean m_Dragging
    // Offset: 0xB8
    bool m_Dragging;
    // private System.Boolean m_Scrolling
    // Offset: 0xB9
    bool m_Scrolling;
    // private UnityEngine.Vector2 m_PrevPosition
    // Offset: 0xBC
    UnityEngine::Vector2 m_PrevPosition;
    // private UnityEngine.Bounds m_PrevContentBounds
    // Offset: 0xC4
    UnityEngine::Bounds m_PrevContentBounds;
    // private UnityEngine.Bounds m_PrevViewBounds
    // Offset: 0xDC
    UnityEngine::Bounds m_PrevViewBounds;
    // private System.Boolean m_HasRebuiltLayout
    // Offset: 0xF4
    bool m_HasRebuiltLayout;
    // private System.Boolean m_HSliderExpand
    // Offset: 0xF5
    bool m_HSliderExpand;
    // private System.Boolean m_VSliderExpand
    // Offset: 0xF6
    bool m_VSliderExpand;
    // private System.Single m_HSliderHeight
    // Offset: 0xF8
    float m_HSliderHeight;
    // private System.Single m_VSliderWidth
    // Offset: 0xFC
    float m_VSliderWidth;
    // private UnityEngine.RectTransform m_Rect
    // Offset: 0x100
    UnityEngine::RectTransform* m_Rect;
    // private UnityEngine.RectTransform m_HorizontalScrollbarRect
    // Offset: 0x108
    UnityEngine::RectTransform* m_HorizontalScrollbarRect;
    // private UnityEngine.RectTransform m_VerticalScrollbarRect
    // Offset: 0x110
    UnityEngine::RectTransform* m_VerticalScrollbarRect;
    // private UnityEngine.DrivenRectTransformTracker m_Tracker
    // Offset: 0x118
    UnityEngine::DrivenRectTransformTracker m_Tracker;
    // private readonly UnityEngine.Vector3[] m_Corners
    // Offset: 0x120
    ::Array<UnityEngine::Vector3>* m_Corners;
    // Creating interface conversion operator: operator UnityEngine::EventSystems::IInitializePotentialDragHandler
    operator UnityEngine::EventSystems::IInitializePotentialDragHandler() noexcept {
      return *reinterpret_cast<UnityEngine::EventSystems::IInitializePotentialDragHandler*>(this);
    }
    // Creating interface conversion operator: operator UnityEngine::EventSystems::IBeginDragHandler
    operator UnityEngine::EventSystems::IBeginDragHandler() noexcept {
      return *reinterpret_cast<UnityEngine::EventSystems::IBeginDragHandler*>(this);
    }
    // Creating interface conversion operator: operator UnityEngine::EventSystems::IEndDragHandler
    operator UnityEngine::EventSystems::IEndDragHandler() noexcept {
      return *reinterpret_cast<UnityEngine::EventSystems::IEndDragHandler*>(this);
    }
    // Creating interface conversion operator: operator UnityEngine::EventSystems::IDragHandler
