// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.EventSystems.IPointerEnterHandler
#include "UnityEngine/EventSystems/IPointerEnterHandler.hpp"
// Including type: UnityEngine.EventSystems.IMoveHandler
#include "UnityEngine/EventSystems/IMoveHandler.hpp"
// Including type: UnityEngine.EventSystems.IPointerDownHandler
#include "UnityEngine/EventSystems/IPointerDownHandler.hpp"
// Including type: UnityEngine.EventSystems.IPointerUpHandler
#include "UnityEngine/EventSystems/IPointerUpHandler.hpp"
// Including type: UnityEngine.EventSystems.IPointerExitHandler
#include "UnityEngine/EventSystems/IPointerExitHandler.hpp"
// Including type: UnityEngine.EventSystems.ISelectHandler
#include "UnityEngine/EventSystems/ISelectHandler.hpp"
// Including type: UnityEngine.EventSystems.IDeselectHandler
#include "UnityEngine/EventSystems/IDeselectHandler.hpp"
// Including type: UnityEngine.UI.Navigation
#include "UnityEngine/UI/Navigation.hpp"
// Including type: UnityEngine.UI.ColorBlock
#include "UnityEngine/UI/ColorBlock.hpp"
// Including type: UnityEngine.UI.SpriteState
#include "UnityEngine/UI/SpriteState.hpp"

#include "beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: AnimationTriggers
  class AnimationTriggers;
  // Forward declaring type: Graphic
  class Graphic;
  // Skipping declaration: Transition because it is already included!
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: CanvasGroup
  class CanvasGroup;
  // Forward declaring type: Animator
  class Animator;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Vector2
  struct Vector2;
  // Skipping declaration: Color because it is already included!
  // Forward declaring type: Sprite
  class Sprite;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: AxisEventData
  class AxisEventData;
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Forward declaring type: BaseEventData
  class BaseEventData;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Forward declaring type: Selectable
  class Selectable;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(UnityEngine::UI::Selectable);
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::Selectable*, "UnityEngine.UI", "Selectable");
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0xF8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.Selectable
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: EEAAEC
  // [ExecuteAlways] Offset: FFFFFFFF
  // [SelectionBaseAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class Selectable : public UnityEngine::EventSystems::UIBehaviour/*, public UnityEngine::EventSystems::IPointerEnterHandler, public UnityEngine::EventSystems::IMoveHandler, public UnityEngine::EventSystems::IPointerDownHandler, public UnityEngine::EventSystems::IPointerUpHandler, public UnityEngine::EventSystems::IPointerExitHandler, public UnityEngine::EventSystems::ISelectHandler, public UnityEngine::EventSystems::IDeselectHandler*/ {
    public:
    // Nested type: UnityEngine::UI::Selectable::Transition
    struct Transition;
    // Nested type: UnityEngine::UI::Selectable::SelectionState
    struct SelectionState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.Selectable/UnityEngine.UI.Transition
    // [TokenAttribute] Offset: FFFFFFFF
    struct Transition/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Transition
      constexpr Transition(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition None
      static UnityEngine::UI::Selectable::Transition _get_None();
      // Set static field: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition None
      static void _set_None(UnityEngine::UI::Selectable::Transition value);
      // static field const value: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition ColorTint
      static constexpr const int ColorTint = 1;
      // Get static field: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition ColorTint
      static UnityEngine::UI::Selectable::Transition _get_ColorTint();
      // Set static field: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition ColorTint
      static void _set_ColorTint(UnityEngine::UI::Selectable::Transition value);
      // static field const value: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition SpriteSwap
      static constexpr const int SpriteSwap = 2;
      // Get static field: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition SpriteSwap
      static UnityEngine::UI::Selectable::Transition _get_SpriteSwap();
      // Set static field: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition SpriteSwap
      static void _set_SpriteSwap(UnityEngine::UI::Selectable::Transition value);
      // static field const value: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition Animation
      static constexpr const int Animation = 3;
      // Get static field: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition Animation
      static UnityEngine::UI::Selectable::Transition _get_Animation();
      // Set static field: static public UnityEngine.UI.Selectable/UnityEngine.UI.Transition Animation
      static void _set_Animation(UnityEngine::UI::Selectable::Transition value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // UnityEngine.UI.Selectable/UnityEngine.UI.Transition
    #pragma pack(pop)
    static check_size<sizeof(Selectable::Transition), 0 + sizeof(int)> __UnityEngine_UI_Selectable_TransitionSizeCheck;
    static_assert(sizeof(Selectable::Transition) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean m_EnableCalled
    // Size: 0x1
    // Offset: 0x18
    bool m_EnableCalled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_EnableCalled and: m_Navigation
    char __padding0[0x7] = {};
    // [FormerlySerializedAsAttribute] Offset: 0xEEC8DC
    // private UnityEngine.UI.Navigation m_Navigation
    // Size: 0x28
    // Offset: 0x20
    UnityEngine::UI::Navigation m_Navigation;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Navigation) == 0x28);
    // [FormerlySerializedAsAttribute] Offset: 0xEEC928
    // private UnityEngine.UI.Selectable/UnityEngine.UI.Transition m_Transition
    // Size: 0x4
    // Offset: 0x48
    UnityEngine::UI::Selectable::Transition m_Transition;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Selectable::Transition) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0xEEC974
    // private UnityEngine.UI.ColorBlock m_Colors
    // Size: 0x58
    // Offset: 0x4C
    UnityEngine::UI::ColorBlock m_Colors;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::ColorBlock) == 0x58);
    // Padding between fields: m_Colors and: m_SpriteState
    char __padding3[0x4] = {};
    // [FormerlySerializedAsAttribute] Offset: 0xEEC9C0
    // private UnityEngine.UI.SpriteState m_SpriteState
    // Size: 0x20
    // Offset: 0xA8
    UnityEngine::UI::SpriteState m_SpriteState;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::SpriteState) == 0x20);
    // [FormerlySerializedAsAttribute] Offset: 0xEECA0C
    // private UnityEngine.UI.AnimationTriggers m_AnimationTriggers
    // Size: 0x8
    // Offset: 0xC8
    UnityEngine::UI::AnimationTriggers* m_AnimationTriggers;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::AnimationTriggers*) == 0x8);
    // [TooltipAttribute] Offset: 0xEECA58
    // private System.Boolean m_Interactable
    // Size: 0x1
    // Offset: 0xD0
    bool m_Interactable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Interactable and: m_TargetGraphic
    char __padding6[0x7] = {};
    // [FormerlySerializedAsAttribute] Offset: 0xEECAA4
    // [FormerlySerializedAsAttribute] Offset: 0xEECAA4
    // private UnityEngine.UI.Graphic m_TargetGraphic
    // Size: 0x8
    // Offset: 0xD8
    UnityEngine::UI::Graphic* m_TargetGraphic;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Graphic*) == 0x8);
    // private System.Boolean m_GroupsAllowInteraction
    // Size: 0x1
    // Offset: 0xE0
    bool m_GroupsAllowInteraction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_GroupsAllowInteraction and: m_CurrentIndex
    char __padding8[0x3] = {};
    // protected System.Int32 m_CurrentIndex
    // Size: 0x4
    // Offset: 0xE4
    int m_CurrentIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <isPointerInside>k__BackingField
    // Size: 0x1
    // Offset: 0xE8
    bool isPointerInside;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isPointerDown>k__BackingField
    // Size: 0x1
    // Offset: 0xE9
    bool isPointerDown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <hasSelection>k__BackingField
    // Size: 0x1
    // Offset: 0xEA
    bool hasSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasSelection and: m_CanvasGroupCache
    char __padding12[0x5] = {};
    // private readonly System.Collections.Generic.List`1<UnityEngine.CanvasGroup> m_CanvasGroupCache
    // Size: 0x8
    // Offset: 0xF0
    System::Collections::Generic::List_1<UnityEngine::CanvasGroup*>* m_CanvasGroupCache;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::CanvasGroup*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator UnityEngine::EventSystems::IPointerEnterHandler
    operator UnityEngine::EventSystems::IPointerEnterHandler() noexcept {
      return *reinterpret_cast<UnityEngine::EventSystems::IPointerEnterHandler*>(this);
    }
    // Creating interface conversion operator: operator UnityEngine::EventSystems::IMoveHandler
    operator UnityEngine::EventSystems::IMoveHandler() noexcept {
      return *reinterpret_cast<UnityEngine::EventSystems::IMoveHandler*>(this);
    }
    // Creating interface conversion operator: operator UnityEngine::EventSystems::IPointerDownHandler
    operator UnityEngine::EventSystems::IPointerDownHandler() noexcept {
