// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.UI.MaskableGraphic
#include "UnityEngine/UI/MaskableGraphic.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: FontData
  class FontData;
  // Forward declaring type: VertexHelper
  class VertexHelper;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: TextGenerator
  class TextGenerator;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Font
  class Font;
  // Forward declaring type: TextAnchor
  struct TextAnchor;
  // Forward declaring type: HorizontalWrapMode
  struct HorizontalWrapMode;
  // Forward declaring type: VerticalWrapMode
  struct VerticalWrapMode;
  // Forward declaring type: FontStyle
  struct FontStyle;
  // Forward declaring type: TextGenerationSettings
  struct TextGenerationSettings;
  // Skipping declaration: Vector2 because it is already included!
  // Forward declaring type: Texture
  class Texture;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0xF0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.Text
  // [AddComponentMenu] Offset: DC58CC
  class Text : public UnityEngine::UI::MaskableGraphic/*, public UnityEngine::UI::ILayoutElement*/ {
    public:
    // private UnityEngine.UI.FontData m_FontData
    // Size: 0x8
    // Offset: 0xC0
    UnityEngine::UI::FontData* m_FontData;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::FontData*) == 0x8);
    // [TextAreaAttribute] Offset: 0xDC7964
    // protected System.String m_Text
    // Size: 0x8
    // Offset: 0xC8
    ::Il2CppString* m_Text;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private UnityEngine.TextGenerator m_TextCache
    // Size: 0x8
    // Offset: 0xD0
    UnityEngine::TextGenerator* m_TextCache;
    // Field size check
    static_assert(sizeof(UnityEngine::TextGenerator*) == 0x8);
    // private UnityEngine.TextGenerator m_TextCacheForLayout
    // Size: 0x8
    // Offset: 0xD8
    UnityEngine::TextGenerator* m_TextCacheForLayout;
    // Field size check
    static_assert(sizeof(UnityEngine::TextGenerator*) == 0x8);
    // protected System.Boolean m_DisableFontTextureRebuiltCallback
    // Size: 0x1
    // Offset: 0xE0
    bool m_DisableFontTextureRebuiltCallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DisableFontTextureRebuiltCallback and: m_TempVerts
    char __padding4[0x7] = {};
    // private readonly UnityEngine.UIVertex[] m_TempVerts
    // Size: 0x8
    // Offset: 0xE8
    ::Array<UnityEngine::UIVertex>* m_TempVerts;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::UIVertex>*) == 0x8);
    // Creating value type constructor for type: Text
    Text(UnityEngine::UI::FontData* m_FontData_ = {}, ::Il2CppString* m_Text_ = {}, UnityEngine::TextGenerator* m_TextCache_ = {}, UnityEngine::TextGenerator* m_TextCacheForLayout_ = {}, bool m_DisableFontTextureRebuiltCallback_ = {}, ::Array<UnityEngine::UIVertex>* m_TempVerts_ = {}) noexcept : m_FontData{m_FontData_}, m_Text{m_Text_}, m_TextCache{m_TextCache_}, m_TextCacheForLayout{m_TextCacheForLayout_}, m_DisableFontTextureRebuiltCallback{m_DisableFontTextureRebuiltCallback_}, m_TempVerts{m_TempVerts_} {}
    // Creating interface conversion operator: operator UnityEngine::UI::ILayoutElement
    operator UnityEngine::UI::ILayoutElement() noexcept {
      return *reinterpret_cast<UnityEngine::UI::ILayoutElement*>(this);
    }
    // Get static field: static protected UnityEngine.Material s_DefaultText
    static UnityEngine::Material* _get_s_DefaultText();
    // Set static field: static protected UnityEngine.Material s_DefaultText
    static void _set_s_DefaultText(UnityEngine::Material* value);
    // public UnityEngine.TextGenerator get_cachedTextGenerator()
    // Offset: 0x23A0280
    UnityEngine::TextGenerator* get_cachedTextGenerator();
    // public UnityEngine.TextGenerator get_cachedTextGeneratorForLayout()
    // Offset: 0x23A0318
    UnityEngine::TextGenerator* get_cachedTextGeneratorForLayout();
    // public System.Void FontTextureChanged()
    // Offset: 0x23A0588
    void FontTextureChanged();
    // public UnityEngine.Font get_font()
    // Offset: 0x23A056C
    UnityEngine::Font* get_font();
    // public System.Void set_font(UnityEngine.Font value)
    // Offset: 0x23A06A8
    void set_font(UnityEngine::Font* value);
    // public System.String get_text()
    // Offset: 0x23A079C
    ::Il2CppString* get_text();
    // public System.Void set_text(System.String value)
    // Offset: 0x23A07A4
    void set_text(::Il2CppString* value);
    // public System.Boolean get_supportRichText()
    // Offset: 0x23A0880
    bool get_supportRichText();
    // public System.Void set_supportRichText(System.Boolean value)
    // Offset: 0x23A089C
    void set_supportRichText(bool value);
    // public System.Boolean get_resizeTextForBestFit()
    // Offset: 0x23A090C
    bool get_resizeTextForBestFit();
    // public System.Void set_resizeTextForBestFit(System.Boolean value)
    // Offset: 0x23A0928
    void set_resizeTextForBestFit(bool value);
    // public System.Int32 get_resizeTextMinSize()
    // Offset: 0x23A0998
    int get_resizeTextMinSize();
    // public System.Void set_resizeTextMinSize(System.Int32 value)
    // Offset: 0x23A09B4
    void set_resizeTextMinSize(int value);
    // public System.Int32 get_resizeTextMaxSize()
    // Offset: 0x23A0A18
    int get_resizeTextMaxSize();
    // public System.Void set_resizeTextMaxSize(System.Int32 value)
    // Offset: 0x23A0A34
    void set_resizeTextMaxSize(int value);
    // public UnityEngine.TextAnchor get_alignment()
    // Offset: 0x23A0A98
    UnityEngine::TextAnchor get_alignment();
    // public System.Void set_alignment(UnityEngine.TextAnchor value)
    // Offset: 0x23A0AB4
    void set_alignment(UnityEngine::TextAnchor value);
    // public System.Boolean get_alignByGeometry()
    // Offset: 0x23A0B18
    bool get_alignByGeometry();
    // public System.Void set_alignByGeometry(System.Boolean value)
    // Offset: 0x23A0B34
    void set_alignByGeometry(bool value);
    // public System.Int32 get_fontSize()
    // Offset: 0x23A0B78
    int get_fontSize();
    // public System.Void set_fontSize(System.Int32 value)
    // Offset: 0x23A0B94
    void set_fontSize(int value);
    // public UnityEngine.HorizontalWrapMode get_horizontalOverflow()
    // Offset: 0x23A0BF8
    UnityEngine::HorizontalWrapMode get_horizontalOverflow();
    // public System.Void set_horizontalOverflow(UnityEngine.HorizontalWrapMode value)
    // Offset: 0x23A0C14
    void set_horizontalOverflow(UnityEngine::HorizontalWrapMode value);
    // public UnityEngine.VerticalWrapMode get_verticalOverflow()
    // Offset: 0x23A0C78
    UnityEngine::VerticalWrapMode get_verticalOverflow();
    // public System.Void set_verticalOverflow(UnityEngine.VerticalWrapMode value)
    // Offset: 0x23A0C94
    void set_verticalOverflow(UnityEngine::VerticalWrapMode value);
    // public System.Single get_lineSpacing()
    // Offset: 0x23A0CF8
    float get_lineSpacing();
    // public System.Void set_lineSpacing(System.Single value)
    // Offset: 0x23A0D14
    void set_lineSpacing(float value);
    // public UnityEngine.FontStyle get_fontStyle()
    // Offset: 0x23A0D78
    UnityEngine::FontStyle get_fontStyle();
    // public System.Void set_fontStyle(UnityEngine.FontStyle value)
    // Offset: 0x23A0D94
    void set_fontStyle(UnityEngine::FontStyle value);
    // public System.Single get_pixelsPerUnit()
    // Offset: 0x23A0DF8
    float get_pixelsPerUnit();
    // System.Void AssignDefaultFont()
    // Offset: 0x23A10FC
    void AssignDefaultFont();
    // public UnityEngine.TextGenerationSettings GetGenerationSettings(UnityEngine.Vector2 extents)
    // Offset: 0x23A1160
    UnityEngine::TextGenerationSettings GetGenerationSettings(UnityEngine::Vector2 extents);
    // static public UnityEngine.Vector2 GetTextAnchorPivot(UnityEngine.TextAnchor anchor)
    // Offset: 0x23A1354
    static UnityEngine::Vector2 GetTextAnchorPivot(UnityEngine::TextAnchor anchor);
    // public System.Void CalculateLayoutInputHorizontal()
    // Offset: 0x23A1D50
    void CalculateLayoutInputHorizontal();
    // public System.Void CalculateLayoutInputVertical()
    // Offset: 0x23A1D54
    void CalculateLayoutInputVertical();
    // public System.Single get_minWidth()
    // Offset: 0x23A1D58
    float get_minWidth();
    // public System.Single get_preferredWidth()
    // Offset: 0x23A1D60
    float get_preferredWidth();
    // public System.Single get_flexibleWidth()
    // Offset: 0x23A1E58
    float get_flexibleWidth();
    // public System.Single get_minHeight()
    // Offset: 0x23A1E60
    float get_minHeight();
    // public System.Single get_preferredHeight()
    // Offset: 0x23A1E68
    float get_preferredHeight();
    // public System.Single get_flexibleHeight()
    // Offset: 0x23A1F4C
    float get_flexibleHeight();
    // public System.Int32 get_layoutPriority()
    // Offset: 0x23A1F54
    int get_layoutPriority();
    // protected System.Void .ctor()
    // Offset: 0x23A01F4
    // Implemented from: UnityEngine.UI.MaskableGraphic
    // Base method: System.Void MaskableGraphic::.ctor()
    // Base method: System.Void Graphic::.ctor()
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Text* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::UI::Text::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Text*, creationType>()));
    }
    // public override UnityEngine.Texture get_mainTexture()
    // Offset: 0x23A0384
    // Implemented from: UnityEngine.UI.Graphic
    // Base method: UnityEngine.Texture Graphic::get_mainTexture()
    UnityEngine::Texture* get_mainTexture();
    // protected override System.Void OnEnable()
    // Offset: 0x23A0F64
    // Implemented from: UnityEngine.UI.MaskableGraphic
    // Base method: System.Void MaskableGraphic::OnEnable()
    void OnEnable();
    // protected override System.Void OnDisable()
    // Offset: 0x23A0FF0
    // Implemented from: UnityEngine.UI.MaskableGraphic
    // Base method: System.Void MaskableGraphic::OnDisable()
    void OnDisable();
    // protected override System.Void UpdateGeometry()
    // Offset: 0x23A1064
    // Implemented from: UnityEngine.UI.Graphic
    // Base method: System.Void Graphic::UpdateGeometry()
    void UpdateGeometry();
    // protected override System.Void OnPopulateMesh(UnityEngine.UI.VertexHelper toFill)
    // Offset: 0x23A1488
    // Implemented from: UnityEngine.UI.Graphic
    // Base method: System.Void Graphic::OnPopulateMesh(UnityEngine.UI.VertexHelper toFill)
    void OnPopulateMesh(UnityEngine::UI::VertexHelper* toFill);
    // static private System.Void .cctor()
    // Offset: 0x23A1F5C
    // Implemented from: UnityEngine.UI.Graphic
    // Base method: System.Void Graphic::.cctor()
    // Base method: System.Void Object::.cctor()
    static void _cctor();
  }; // UnityEngine.UI.Text
  #pragma pack(pop)
  static check_size<sizeof(Text), 232 + sizeof(::Array<UnityEngine::UIVertex>*)> __UnityEngine_UI_TextSizeCheck;
  static_assert(sizeof(Text) == 0xF0);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::Text*, "UnityEngine.UI", "Text");
// Writing MetadataGetter for method: UnityEngine::UI::Text::get_cachedTextGenerator
// Il2CppName: get_cachedTextGenerator
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<UnityEngine::TextGenerator* (UnityEngine::UI::Text::*)()>(&UnityEngine::UI::Text::get_cachedTextGenerator)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UI::Text*), "get_cachedTextGenerator", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::UI::Text::get_cachedTextGeneratorForLayout
// Il2CppName: get_cachedTextGeneratorForLayout
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<UnityEngine::TextGenerator* (UnityEngine::UI::Text::*)()>(&UnityEngine::UI::Text::get_cachedTextGeneratorForLayout)> {
