// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.UI.Selectable
#include "UnityEngine/UI/Selectable.hpp"
// Including type: UnityEngine.EventSystems.IPointerClickHandler
#include "UnityEngine/EventSystems/IPointerClickHandler.hpp"
// Including type: UnityEngine.EventSystems.ISubmitHandler
#include "UnityEngine/EventSystems/ISubmitHandler.hpp"
// Including type: UnityEngine.UI.ICanvasElement
#include "UnityEngine/UI/ICanvasElement.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Graphic
  class Graphic;
  // Forward declaring type: ToggleGroup
  class ToggleGroup;
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Forward declaring type: BaseEventData
  class BaseEventData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: UnityEngine.UI
namespace UnityEngine::UI {
  // Size: 0x119
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UI.Toggle
  // [AddComponentMenu] Offset: CD9D14
  // [RequireComponent] Offset: CD9D14
  class Toggle : public UnityEngine::UI::Selectable/*, public UnityEngine::EventSystems::IPointerClickHandler, public UnityEngine::EventSystems::ISubmitHandler, public UnityEngine::UI::ICanvasElement*/ {
    public:
    // Nested type: UnityEngine::UI::Toggle::ToggleTransition
    struct ToggleTransition;
    // Nested type: UnityEngine::UI::Toggle::ToggleEvent
    class ToggleEvent;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UI.Toggle/ToggleTransition
    struct ToggleTransition/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: ToggleTransition
      constexpr ToggleTransition(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UI.Toggle/ToggleTransition None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.UI.Toggle/ToggleTransition None
      static UnityEngine::UI::Toggle::ToggleTransition _get_None();
      // Set static field: static public UnityEngine.UI.Toggle/ToggleTransition None
      static void _set_None(UnityEngine::UI::Toggle::ToggleTransition value);
      // static field const value: static public UnityEngine.UI.Toggle/ToggleTransition Fade
      static constexpr const int Fade = 1;
      // Get static field: static public UnityEngine.UI.Toggle/ToggleTransition Fade
      static UnityEngine::UI::Toggle::ToggleTransition _get_Fade();
      // Set static field: static public UnityEngine.UI.Toggle/ToggleTransition Fade
      static void _set_Fade(UnityEngine::UI::Toggle::ToggleTransition value);
    }; // UnityEngine.UI.Toggle/ToggleTransition
    #pragma pack(pop)
    static check_size<sizeof(Toggle::ToggleTransition), 0 + sizeof(int)> __UnityEngine_UI_Toggle_ToggleTransitionSizeCheck;
    static_assert(sizeof(Toggle::ToggleTransition) == 0x4);
    // public UnityEngine.UI.Toggle/ToggleTransition toggleTransition
    // Size: 0x4
    // Offset: 0xF8
    UnityEngine::UI::Toggle::ToggleTransition toggleTransition;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Toggle::ToggleTransition) == 0x4);
    // Padding between fields: toggleTransition and: graphic
    char __padding0[0x4] = {};
    // public UnityEngine.UI.Graphic graphic
    // Size: 0x8
    // Offset: 0x100
    UnityEngine::UI::Graphic* graphic;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Graphic*) == 0x8);
    // private UnityEngine.UI.ToggleGroup m_Group
    // Size: 0x8
    // Offset: 0x108
    UnityEngine::UI::ToggleGroup* m_Group;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::ToggleGroup*) == 0x8);
    // public UnityEngine.UI.Toggle/ToggleEvent onValueChanged
    // Size: 0x8
    // Offset: 0x110
    UnityEngine::UI::Toggle::ToggleEvent* onValueChanged;
    // Field size check
    static_assert(sizeof(UnityEngine::UI::Toggle::ToggleEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0xCDBDC0
    // private System.Boolean m_IsOn
    // Size: 0x1
    // Offset: 0x118
    bool m_IsOn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: Toggle
    Toggle(UnityEngine::UI::Toggle::ToggleTransition toggleTransition_ = {}, UnityEngine::UI::Graphic* graphic_ = {}, UnityEngine::UI::ToggleGroup* m_Group_ = {}, UnityEngine::UI::Toggle::ToggleEvent* onValueChanged_ = {}, bool m_IsOn_ = {}) noexcept : toggleTransition{toggleTransition_}, graphic{graphic_}, m_Group{m_Group_}, onValueChanged{onValueChanged_}, m_IsOn{m_IsOn_} {}
    // Creating interface conversion operator: operator UnityEngine::EventSystems::IPointerClickHandler
    operator UnityEngine::EventSystems::IPointerClickHandler() noexcept {
      return *reinterpret_cast<UnityEngine::EventSystems::IPointerClickHandler*>(this);
    }
    // Creating interface conversion operator: operator UnityEngine::EventSystems::ISubmitHandler
    operator UnityEngine::EventSystems::ISubmitHandler() noexcept {
      return *reinterpret_cast<UnityEngine::EventSystems::ISubmitHandler*>(this);
    }
    // Creating interface conversion operator: operator UnityEngine::UI::ICanvasElement
    operator UnityEngine::UI::ICanvasElement() noexcept {
      return *reinterpret_cast<UnityEngine::UI::ICanvasElement*>(this);
    }
    // public UnityEngine.UI.ToggleGroup get_group()
    // Offset: 0x2136948
    UnityEngine::UI::ToggleGroup* get_group();
    // public System.Void set_group(UnityEngine.UI.ToggleGroup value)
    // Offset: 0x2136950
    void set_group(UnityEngine::UI::ToggleGroup* value);
    // public System.Void Rebuild(UnityEngine.UI.CanvasUpdate executing)
    // Offset: 0x2136C94
    void Rebuild(UnityEngine::UI::CanvasUpdate executing);
    // public System.Void LayoutComplete()
    // Offset: 0x2136C98
    void LayoutComplete();
    // public System.Void GraphicUpdateComplete()
    // Offset: 0x2136C9C
    void GraphicUpdateComplete();
    // private System.Void SetToggleGroup(UnityEngine.UI.ToggleGroup newGroup, System.Boolean setMemberValue)
    // Offset: 0x213697C
    void SetToggleGroup(UnityEngine::UI::ToggleGroup* newGroup, bool setMemberValue);
    // public System.Boolean get_isOn()
    // Offset: 0x213731C
    bool get_isOn();
    // public System.Void set_isOn(System.Boolean value)
    // Offset: 0x2137324
    void set_isOn(bool value);
    // public System.Void SetIsOnWithoutNotify(System.Boolean value)
    // Offset: 0x2137330
    void SetIsOnWithoutNotify(bool value);
    // private System.Void Set(System.Boolean value, System.Boolean sendCallback)
    // Offset: 0x2136F5C
    void Set(bool value, bool sendCallback);
    // private System.Void PlayEffect(System.Boolean instant)
    // Offset: 0x2136AE4
    void PlayEffect(bool instant);
    // private System.Void InternalToggle()
    // Offset: 0x2137474
    void InternalToggle();
    // public System.Void OnPointerClick(UnityEngine.EventSystems.PointerEventData eventData)
    // Offset: 0x21374D8
    void OnPointerClick(UnityEngine::EventSystems::PointerEventData* eventData);
    // public System.Void OnSubmit(UnityEngine.EventSystems.BaseEventData eventData)
    // Offset: 0x21374F8
    void OnSubmit(UnityEngine::EventSystems::BaseEventData* eventData);
    // private UnityEngine.Transform UnityEngine.UI.ICanvasElement.get_transform()
    // Offset: 0x21374FC
    UnityEngine::Transform* UnityEngine_UI_ICanvasElement_get_transform();
    // protected System.Void .ctor()
    // Offset: 0x2136BB8
    // Implemented from: UnityEngine.UI.Selectable
    // Base method: System.Void Selectable::.ctor()
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Toggle* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::UI::Toggle::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Toggle*, creationType>()));
    }
    // protected override System.Void OnDestroy()
    // Offset: 0x2136CA0
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::OnDestroy()
    void OnDestroy();
    // protected override System.Void OnEnable()
    // Offset: 0x2136DE4
    // Implemented from: UnityEngine.UI.Selectable
    // Base method: System.Void Selectable::OnEnable()
    void OnEnable();
    // protected override System.Void OnDisable()
    // Offset: 0x2136E20
    // Implemented from: UnityEngine.UI.Selectable
    // Base method: System.Void Selectable::OnDisable()
    void OnDisable();
    // protected override System.Void OnDidApplyAnimationProperties()
    // Offset: 0x2136E50
    // Implemented from: UnityEngine.UI.Selectable
    // Base method: System.Void Selectable::OnDidApplyAnimationProperties()
    void OnDidApplyAnimationProperties();
    // protected override System.Void Start()
    // Offset: 0x213746C
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::Start()
    void Start();
  }; // UnityEngine.UI.Toggle
  #pragma pack(pop)
  static check_size<sizeof(Toggle), 280 + sizeof(bool)> __UnityEngine_UI_ToggleSizeCheck;
  static_assert(sizeof(Toggle) == 0x119);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::Toggle*, "UnityEngine.UI", "Toggle");
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::UI::Toggle::ToggleTransition, "UnityEngine.UI", "Toggle/ToggleTransition");
