// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ExitGames.Client.Photon.PeerBase
#include "ExitGames/Client/Photon/PeerBase.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
// Including type: System.Int16
#include "System/Int16.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: NCommandPool
  class NCommandPool;
  // Forward declaring type: NCommand
  class NCommand;
  // Forward declaring type: StreamBuffer
  class StreamBuffer;
  // Forward declaring type: EnetChannel
  class EnetChannel;
  // Forward declaring type: SendOptions
  struct SendOptions;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Completed forward declares
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: EnetPeer
  class EnetPeer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExitGames::Client::Photon::EnetPeer);
DEFINE_IL2CPP_ARG_TYPE(::ExitGames::Client::Photon::EnetPeer*, "ExitGames.Client.Photon", "EnetPeer");
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Size: 0x1A8
  #pragma pack(push, 1)
  // Autogenerated type: ExitGames.Client.Photon.EnetPeer
  // [TokenAttribute] Offset: FFFFFFFF
  class EnetPeer : public ::ExitGames::Client::Photon::PeerBase {
    public:
    // Writing base type padding for base size: 0x11C to desired offset: 0x120
    char ___base_padding[0x4] = {};
    public:
    // ExitGames.Client.Photon.NCommandPool nCommandPool
    // Size: 0x8
    // Offset: 0x120
    ::ExitGames::Client::Photon::NCommandPool* nCommandPool;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::NCommandPool*) == 0x8);
    // private System.Collections.Generic.List`1<ExitGames.Client.Photon.NCommand> sentReliableCommands
    // Size: 0x8
    // Offset: 0x128
    ::System::Collections::Generic::List_1<::ExitGames::Client::Photon::NCommand*>* sentReliableCommands;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::ExitGames::Client::Photon::NCommand*>*) == 0x8);
    // private ExitGames.Client.Photon.StreamBuffer outgoingAcknowledgementsPool
    // Size: 0x8
    // Offset: 0x130
    ::ExitGames::Client::Photon::StreamBuffer* outgoingAcknowledgementsPool;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::StreamBuffer*) == 0x8);
    // readonly System.Int32[] unsequencedWindow
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<int> unsequencedWindow;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // System.Int32 outgoingUnsequencedGroupNumber
    // Size: 0x4
    // Offset: 0x140
    int outgoingUnsequencedGroupNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 incomingUnsequencedGroupNumber
    // Size: 0x4
    // Offset: 0x144
    int incomingUnsequencedGroupNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Byte udpCommandCount
    // Size: 0x1
    // Offset: 0x148
    uint8_t udpCommandCount;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: udpCommandCount and: udpBuffer
    char __padding6[0x7] = {};
    // private System.Byte[] udpBuffer
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<uint8_t> udpBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Int32 udpBufferIndex
    // Size: 0x4
    // Offset: 0x158
    int udpBufferIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: udpBufferIndex and: bufferForEncryption
    char __padding8[0x4] = {};
    // private System.Byte[] bufferForEncryption
    // Size: 0x8
    // Offset: 0x160
    ::ArrayW<uint8_t> bufferForEncryption;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Int32 commandBufferSize
    // Size: 0x4
    // Offset: 0x168
    int commandBufferSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 challenge
    // Size: 0x4
    // Offset: 0x16C
    int challenge;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 reliableCommandsRepeated
    // Size: 0x4
    // Offset: 0x170
    int reliableCommandsRepeated;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 reliableCommandsSent
    // Size: 0x4
    // Offset: 0x174
    int reliableCommandsSent;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 serverSentTime
    // Size: 0x4
    // Offset: 0x178
    int serverSentTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean datagramEncryptedConnection
    // Size: 0x1
    // Offset: 0x17C
    bool datagramEncryptedConnection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: datagramEncryptedConnection and: channelArray
    char __padding15[0x3] = {};
    // private ExitGames.Client.Photon.EnetChannel[] channelArray
    // Size: 0x8
    // Offset: 0x180
    ::ArrayW<::ExitGames::Client::Photon::EnetChannel*> channelArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::ExitGames::Client::Photon::EnetChannel*>) == 0x8);
    // private System.Collections.Generic.Queue`1<System.Int32> commandsToRemove
    // Size: 0x8
    // Offset: 0x188
    ::System::Collections::Generic::Queue_1<int>* commandsToRemove;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<int>*) == 0x8);
    // private System.Int32 fragmentLength
    // Size: 0x4
    // Offset: 0x190
    int fragmentLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 fragmentLengthDatagramEncrypt
    // Size: 0x4
    // Offset: 0x194
    int fragmentLengthDatagramEncrypt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 fragmentLengthMtuValue
    // Size: 0x4
    // Offset: 0x198
    int fragmentLengthMtuValue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: fragmentLengthMtuValue and: CommandQueue
    char __padding20[0x4] = {};
    // private System.Collections.Generic.Queue`1<ExitGames.Client.Photon.NCommand> CommandQueue
    // Size: 0x8
    // Offset: 0x1A0
    ::System::Collections::Generic::Queue_1<::ExitGames::Client::Photon::NCommand*>* CommandQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::ExitGames::Client::Photon::NCommand*>*) == 0x8);
    public:
    // static field const value: static private System.Int32 CRC_LENGTH
    static constexpr const int CRC_LENGTH = 4;
    // Get static field: static private System.Int32 CRC_LENGTH
    static int _get_CRC_LENGTH();
    // Set static field: static private System.Int32 CRC_LENGTH
    static void _set_CRC_LENGTH(int value);
    // static field const value: static private System.Int32 EncryptedDataGramHeaderSize
    static constexpr const int EncryptedDataGramHeaderSize = 7;
    // Get static field: static private System.Int32 EncryptedDataGramHeaderSize
    static int _get_EncryptedDataGramHeaderSize();
    // Set static field: static private System.Int32 EncryptedDataGramHeaderSize
