// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ExitGames.Client.Photon.ConnectionProtocol
#include "ExitGames/Client/Photon/ConnectionProtocol.hpp"
// Including type: ExitGames.Client.Photon.PhotonSocketState
#include "ExitGames/Client/Photon/PhotonSocketState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: PeerBase
  class PeerBase;
  // Forward declaring type: IPhotonPeerListener
  class IPhotonPeerListener;
  // Forward declaring type: PhotonSocketError
  struct PhotonSocketError;
  // Forward declaring type: DebugLevel
  struct DebugLevel;
  // Forward declaring type: StatusCode
  struct StatusCode;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPAddress
  class IPAddress;
}
// Completed forward declares
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: IPhotonSocket
  class IPhotonSocket;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExitGames::Client::Photon::IPhotonSocket);
DEFINE_IL2CPP_ARG_TYPE(::ExitGames::Client::Photon::IPhotonSocket*, "ExitGames.Client.Photon", "IPhotonSocket");
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: ExitGames.Client.Photon.IPhotonSocket
  // [TokenAttribute] Offset: FFFFFFFF
  class IPhotonSocket : public ::Il2CppObject {
    public:
    // Nested type: ::ExitGames::Client::Photon::IPhotonSocket::$$c
    class $$c;
    public:
    // protected internal ExitGames.Client.Photon.PeerBase peerBase
    // Size: 0x8
    // Offset: 0x10
    ::ExitGames::Client::Photon::PeerBase* peerBase;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::PeerBase*) == 0x8);
    // protected readonly ExitGames.Client.Photon.ConnectionProtocol Protocol
    // Size: 0x1
    // Offset: 0x18
    ::ExitGames::Client::Photon::ConnectionProtocol Protocol;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::ConnectionProtocol) == 0x1);
    // public System.Boolean PollReceive
    // Size: 0x1
    // Offset: 0x19
    bool PollReceive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PollReceive and: State
    char __padding2[0x2] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x94C718
    // private ExitGames.Client.Photon.PhotonSocketState <State>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    ::ExitGames::Client::Photon::PhotonSocketState State;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::PhotonSocketState) == 0x4);
    // public System.String ConnectAddress
    // Size: 0x8
    // Offset: 0x20
    ::StringW ConnectAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94C754
    // private System.String <ServerAddress>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::StringW ServerAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94C790
    // private System.String <ProxyServerAddress>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::StringW ProxyServerAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94C808
    // private System.Int32 <ServerPort>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    int ServerPort;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94C844
    // private System.Boolean <AddressResolvedAsIpv6>k__BackingField
    // Size: 0x1
    // Offset: 0x3C
    bool AddressResolvedAsIpv6;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AddressResolvedAsIpv6 and: UrlProtocol
    char __padding8[0x3] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x94C880
    // private System.String <UrlProtocol>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::StringW UrlProtocol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94C8BC
    // private System.String <UrlPath>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::StringW UrlPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // [DebuggerBrowsableAttribute] Offset: 0x94C7CC
    // Get static field: static private System.String <ServerIpAddress>k__BackingField
    static ::StringW _get_$ServerIpAddress$k__BackingField();
    // Set static field: static private System.String <ServerIpAddress>k__BackingField
    static void _set_$ServerIpAddress$k__BackingField(::StringW value);
    // Get instance field reference: protected internal ExitGames.Client.Photon.PeerBase peerBase
    [[deprecated("Use field access instead!")]] ::ExitGames::Client::Photon::PeerBase*& dyn_peerBase();
    // Get instance field reference: protected readonly ExitGames.Client.Photon.ConnectionProtocol Protocol
    [[deprecated("Use field access instead!")]] ::ExitGames::Client::Photon::ConnectionProtocol& dyn_Protocol();
    // Get instance field reference: public System.Boolean PollReceive
