// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IComparable`1
#include "System/IComparable_1.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: StreamBuffer
  class StreamBuffer;
  // Forward declaring type: NCommandPool
  class NCommandPool;
  // Forward declaring type: EnetPeer
  class EnetPeer;
}
// Completed forward declares
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: NCommand
  class NCommand;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExitGames::Client::Photon::NCommand);
DEFINE_IL2CPP_ARG_TYPE(::ExitGames::Client::Photon::NCommand*, "ExitGames.Client.Photon", "NCommand");
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: ExitGames.Client.Photon.NCommand
  // [TokenAttribute] Offset: FFFFFFFF
  class NCommand : public ::Il2CppObject/*, public ::System::IComparable_1<::ExitGames::Client::Photon::NCommand*>*/ {
    public:
    public:
    // System.Byte commandFlags
    // Size: 0x1
    // Offset: 0x10
    uint8_t commandFlags;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // System.Byte commandType
    // Size: 0x1
    // Offset: 0x11
    uint8_t commandType;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // System.Byte commandChannelID
    // Size: 0x1
    // Offset: 0x12
    uint8_t commandChannelID;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: commandChannelID and: reliableSequenceNumber
    char __padding2[0x1] = {};
    // System.Int32 reliableSequenceNumber
    // Size: 0x4
    // Offset: 0x14
    int reliableSequenceNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 unreliableSequenceNumber
    // Size: 0x4
    // Offset: 0x18
    int unreliableSequenceNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 unsequencedGroupNumber
    // Size: 0x4
    // Offset: 0x1C
    int unsequencedGroupNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Byte reservedByte
    // Size: 0x1
    // Offset: 0x20
    uint8_t reservedByte;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: reservedByte and: startSequenceNumber
    char __padding6[0x3] = {};
    // System.Int32 startSequenceNumber
    // Size: 0x4
    // Offset: 0x24
    int startSequenceNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 fragmentCount
    // Size: 0x4
    // Offset: 0x28
    int fragmentCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 fragmentNumber
    // Size: 0x4
    // Offset: 0x2C
    int fragmentNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 totalLength
    // Size: 0x4
    // Offset: 0x30
    int totalLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 fragmentOffset
    // Size: 0x4
    // Offset: 0x34
    int fragmentOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 fragmentsRemaining
    // Size: 0x4
    // Offset: 0x38
    int fragmentsRemaining;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 commandSentTime
    // Size: 0x4
    // Offset: 0x3C
    int commandSentTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Byte commandSentCount
    // Size: 0x1
    // Offset: 0x40
    uint8_t commandSentCount;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: commandSentCount and: roundTripTimeout
    char __padding14[0x3] = {};
    // System.Int32 roundTripTimeout
    // Size: 0x4
    // Offset: 0x44
    int roundTripTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 timeoutTime
    // Size: 0x4
    // Offset: 0x48
    int timeoutTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 ackReceivedReliableSequenceNumber
    // Size: 0x4
    // Offset: 0x4C
    int ackReceivedReliableSequenceNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 ackReceivedSentTime
    // Size: 0x4
    // Offset: 0x50
    int ackReceivedSentTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 Size
    // Size: 0x4
    // Offset: 0x54
    int Size;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // ExitGames.Client.Photon.StreamBuffer Payload
    // Size: 0x8
    // Offset: 0x58
    ::ExitGames::Client::Photon::StreamBuffer* Payload;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::StreamBuffer*) == 0x8);
    // ExitGames.Client.Photon.NCommandPool returnPool
    // Size: 0x8
    // Offset: 0x60
    ::ExitGames::Client::Photon::NCommandPool* returnPool;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::NCommandPool*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IComparable_1<::ExitGames::Client::Photon::NCommand*>
    operator ::System::IComparable_1<::ExitGames::Client::Photon::NCommand*>() noexcept {
      return *reinterpret_cast<::System::IComparable_1<::ExitGames::Client::Photon::NCommand*>*>(this);
    }
    // static field const value: static System.Byte FV_UNRELIABLE
    static constexpr const uint8_t FV_UNRELIABLE = 0u;
    // Get static field: static System.Byte FV_UNRELIABLE
    static uint8_t _get_FV_UNRELIABLE();
    // Set static field: static System.Byte FV_UNRELIABLE
    static void _set_FV_UNRELIABLE(uint8_t value);
    // static field const value: static System.Byte FV_RELIABLE
    static constexpr const uint8_t FV_RELIABLE = 1u;
