// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ExitGames.Client.Photon.ConnectionProtocol
#include "ExitGames/Client/Photon/ConnectionProtocol.hpp"
// Including type: ExitGames.Client.Photon.ConnectionStateValue
#include "ExitGames/Client/Photon/ConnectionStateValue.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: PhotonPeer
  class PhotonPeer;
  // Forward declaring type: IProtocol
  class IProtocol;
  // Forward declaring type: IPhotonSocket
  class IPhotonSocket;
  // Forward declaring type: NCommand
  class NCommand;
  // Forward declaring type: EventData
  class EventData;
  // Forward declaring type: SimulationItem
  class SimulationItem;
  // Forward declaring type: NetworkSimulationSet
  class NetworkSimulationSet;
  // Forward declaring type: StreamBuffer
  class StreamBuffer;
  // Forward declaring type: IPhotonPeerListener
  class IPhotonPeerListener;
  // Forward declaring type: DebugLevel
  struct DebugLevel;
  // Forward declaring type: TrafficStats
  class TrafficStats;
  // Forward declaring type: TrafficStatsGameLevel
  class TrafficStatsGameLevel;
  // Forward declaring type: SendOptions
  struct SendOptions;
  // Forward declaring type: EgMessageType
  struct EgMessageType;
  // Forward declaring type: ParameterDictionary
  class ParameterDictionary;
  // Forward declaring type: OperationResponse
  class OperationResponse;
  // Forward declaring type: StatusCode
  struct StatusCode;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: LinkedList`1<T>
  template<typename T>
  class LinkedList_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Diagnostics
namespace System::Diagnostics {
  // Forward declaring type: Stopwatch
  class Stopwatch;
}
// Forward declaring namespace: Photon::SocketServer::Security
namespace Photon::SocketServer::Security {
  // Forward declaring type: ICryptoProvider
  class ICryptoProvider;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Random
  class Random;
}
// Completed forward declares
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: PeerBase
  class PeerBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExitGames::Client::Photon::PeerBase);
DEFINE_IL2CPP_ARG_TYPE(::ExitGames::Client::Photon::PeerBase*, "ExitGames.Client.Photon", "PeerBase");
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Size: 0x11C
  #pragma pack(push, 1)
  // Autogenerated type: ExitGames.Client.Photon.PeerBase
  // [TokenAttribute] Offset: FFFFFFFF
  class PeerBase : public ::Il2CppObject {
    public:
    // Nested type: ::ExitGames::Client::Photon::PeerBase::MyAction
    class MyAction;
    // Nested type: ::ExitGames::Client::Photon::PeerBase::GpBinaryV3Parameters
    class GpBinaryV3Parameters;
    // Nested type: ::ExitGames::Client::Photon::PeerBase::$$c__DisplayClass108_0
    class $$c__DisplayClass108_0;
    // Nested type: ::ExitGames::Client::Photon::PeerBase::$$c__DisplayClass109_0
    class $$c__DisplayClass109_0;
    public:
    // ExitGames.Client.Photon.PhotonPeer photonPeer
    // Size: 0x8
    // Offset: 0x10
    ::ExitGames::Client::Photon::PhotonPeer* photonPeer;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::PhotonPeer*) == 0x8);
    // public ExitGames.Client.Photon.IProtocol SerializationProtocol
    // Size: 0x8
    // Offset: 0x18
    ::ExitGames::Client::Photon::IProtocol* SerializationProtocol;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::IProtocol*) == 0x8);
    // ExitGames.Client.Photon.ConnectionProtocol usedTransportProtocol
    // Size: 0x1
    // Offset: 0x20
    ::ExitGames::Client::Photon::ConnectionProtocol usedTransportProtocol;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::ConnectionProtocol) == 0x1);
    // Padding between fields: usedTransportProtocol and: PhotonSocket
    char __padding2[0x7] = {};
    // ExitGames.Client.Photon.IPhotonSocket PhotonSocket
    // Size: 0x8
    // Offset: 0x28
    ::ExitGames::Client::Photon::IPhotonSocket* PhotonSocket;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::IPhotonSocket*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94C9AC
    // private System.String <ServerAddress>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::StringW ServerAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94C9E8
    // private System.String <ProxyServerAddress>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::StringW ProxyServerAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // ExitGames.Client.Photon.ConnectionStateValue peerConnectionState
    // Size: 0x1
    // Offset: 0x40
    ::ExitGames::Client::Photon::ConnectionStateValue peerConnectionState;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::ConnectionStateValue) == 0x1);
    // Padding between fields: peerConnectionState and: ByteCountLastOperation
    char __padding6[0x3] = {};
    // System.Int32 ByteCountLastOperation
    // Size: 0x4
    // Offset: 0x44
    int ByteCountLastOperation;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 ByteCountCurrentDispatch
    // Size: 0x4
    // Offset: 0x48
    int ByteCountCurrentDispatch;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: ByteCountCurrentDispatch and: CommandInCurrentDispatch
    char __padding8[0x4] = {};
    // ExitGames.Client.Photon.NCommand CommandInCurrentDispatch
    // Size: 0x8
    // Offset: 0x50
    ::ExitGames::Client::Photon::NCommand* CommandInCurrentDispatch;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::NCommand*) == 0x8);
    // System.Int32 packetLossByCrc
    // Size: 0x4
    // Offset: 0x58
    int packetLossByCrc;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 packetLossByChallenge
    // Size: 0x4
    // Offset: 0x5C
    int packetLossByChallenge;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // readonly System.Collections.Generic.Queue`1<ExitGames.Client.Photon.PeerBase/ExitGames.Client.Photon.MyAction> ActionQueue
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::Queue_1<::ExitGames::Client::Photon::PeerBase::MyAction*>* ActionQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::ExitGames::Client::Photon::PeerBase::MyAction*>*) == 0x8);
    // System.Int16 peerID
    // Size: 0x2
    // Offset: 0x68
    int16_t peerID;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // Padding between fields: peerID and: serverTimeOffset
    char __padding13[0x2] = {};
    // System.Int32 serverTimeOffset
    // Size: 0x4
    // Offset: 0x6C
    int serverTimeOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean serverTimeOffsetIsAvailable
    // Size: 0x1
    // Offset: 0x70
    bool serverTimeOffsetIsAvailable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: serverTimeOffsetIsAvailable and: roundTripTime
    char __padding15[0x3] = {};
    // System.Int32 roundTripTime
    // Size: 0x4
    // Offset: 0x74
    int roundTripTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 roundTripTimeVariance
    // Size: 0x4
    // Offset: 0x78
    int roundTripTimeVariance;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 lastRoundTripTime
    // Size: 0x4
    // Offset: 0x7C
    int lastRoundTripTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 lowestRoundTripTime
    // Size: 0x4
    // Offset: 0x80
    int lowestRoundTripTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 highestRoundTripTimeVariance
    // Size: 0x4
    // Offset: 0x84
    int highestRoundTripTimeVariance;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 timestampOfLastReceive
    // Size: 0x4
    // Offset: 0x88
    int timestampOfLastReceive;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: timestampOfLastReceive and: bytesOut
    char __padding21[0x4] = {};
    // System.Int64 bytesOut
    // Size: 0x8
    // Offset: 0x90
    int64_t bytesOut;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Int64 bytesIn
    // Size: 0x8
    // Offset: 0x98
    int64_t bytesIn;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Object PhotonToken
    // Size: 0x8
    // Offset: 0xA0
    ::Il2CppObject* PhotonToken;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Object CustomInitData
    // Size: 0x8
    // Offset: 0xA8
    ::Il2CppObject* CustomInitData;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public System.String AppId
    // Size: 0x8
    // Offset: 0xB0
    ::StringW AppId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // ExitGames.Client.Photon.EventData reusableEventData
    // Size: 0x8
    // Offset: 0xB8
    ::ExitGames::Client::Photon::EventData* reusableEventData;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::EventData*) == 0x8);
    // private System.Diagnostics.Stopwatch watch
    // Size: 0x8
    // Offset: 0xC0
    ::System::Diagnostics::Stopwatch* watch;
    // Field size check
    static_assert(sizeof(::System::Diagnostics::Stopwatch*) == 0x8);
    // System.Int32 timeoutInt
    // Size: 0x4
    // Offset: 0xC8
    int timeoutInt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 timeLastAckReceive
    // Size: 0x4
    // Offset: 0xCC
    int timeLastAckReceive;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 longestSentCall
    // Size: 0x4
    // Offset: 0xD0
    int longestSentCall;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 timeLastSendAck
    // Size: 0x4
    // Offset: 0xD4
    int timeLastSendAck;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 timeLastSendOutgoing
    // Size: 0x4
    // Offset: 0xD8
    int timeLastSendOutgoing;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean ApplicationIsInitialized
    // Size: 0x1
    // Offset: 0xDC
    bool ApplicationIsInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean isEncryptionAvailable
    // Size: 0x1
    // Offset: 0xDD
    bool isEncryptionAvailable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isEncryptionAvailable and: outgoingCommandsInStream
    char __padding35[0x2] = {};
    // System.Int32 outgoingCommandsInStream
    // Size: 0x4
    // Offset: 0xE0
    int outgoingCommandsInStream;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: outgoingCommandsInStream and: messageHeader
    char __padding36[0x4] = {};
    // System.Byte[] messageHeader
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<uint8_t> messageHeader;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // Photon.SocketServer.Security.ICryptoProvider CryptoProvider
    // Size: 0x8
    // Offset: 0xF0
    ::Photon::SocketServer::Security::ICryptoProvider* CryptoProvider;
    // Field size check
    static_assert(sizeof(::Photon::SocketServer::Security::ICryptoProvider*) == 0x8);
    // private readonly System.Random lagRandomizer
    // Size: 0x8
    // Offset: 0xF8
    ::System::Random* lagRandomizer;
    // Field size check
    static_assert(sizeof(::System::Random*) == 0x8);
    // readonly System.Collections.Generic.LinkedList`1<ExitGames.Client.Photon.SimulationItem> NetSimListOutgoing
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::LinkedList_1<::ExitGames::Client::Photon::SimulationItem*>* NetSimListOutgoing;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::LinkedList_1<::ExitGames::Client::Photon::SimulationItem*>*) == 0x8);
    // readonly System.Collections.Generic.LinkedList`1<ExitGames.Client.Photon.SimulationItem> NetSimListIncoming
    // Size: 0x8
    // Offset: 0x108
    ::System::Collections::Generic::LinkedList_1<::ExitGames::Client::Photon::SimulationItem*>* NetSimListIncoming;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::LinkedList_1<::ExitGames::Client::Photon::SimulationItem*>*) == 0x8);
    // private readonly ExitGames.Client.Photon.NetworkSimulationSet networkSimulationSettings
    // Size: 0x8
    // Offset: 0x110
    ::ExitGames::Client::Photon::NetworkSimulationSet* networkSimulationSettings;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::NetworkSimulationSet*) == 0x8);
    // System.Int32 TrafficPackageHeaderSize
    // Size: 0x4
    // Offset: 0x118
    int TrafficPackageHeaderSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static System.Int16 peerCount
    static int16_t _get_peerCount();
    // Set static field: static System.Int16 peerCount
    static void _set_peerCount(int16_t value);
    // Get static field: static protected internal System.Collections.Generic.Queue`1<ExitGames.Client.Photon.StreamBuffer> MessageBufferPool
    static ::System::Collections::Generic::Queue_1<::ExitGames::Client::Photon::StreamBuffer*>* _get_MessageBufferPool();
    // Set static field: static protected internal System.Collections.Generic.Queue`1<ExitGames.Client.Photon.StreamBuffer> MessageBufferPool
    static void _set_MessageBufferPool(::System::Collections::Generic::Queue_1<::ExitGames::Client::Photon::StreamBuffer*>* value);
    // Get instance field reference: ExitGames.Client.Photon.PhotonPeer photonPeer
