// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ExitGames.Client.Photon.TargetFrameworks
#include "ExitGames/Client/Photon/TargetFrameworks.hpp"
// Including type: ExitGames.Client.Photon.SerializationProtocol
#include "ExitGames/Client/Photon/SerializationProtocol.hpp"
// Including type: ExitGames.Client.Photon.ConnectionProtocol
#include "ExitGames/Client/Photon/ConnectionProtocol.hpp"
// Including type: ExitGames.Client.Photon.DebugLevel
#include "ExitGames/Client/Photon/DebugLevel.hpp"
// Including type: System.Boolean
#include "System/Boolean.hpp"
// Including type: ExitGames.Client.Photon.SupportClass
#include "ExitGames/Client/Photon/SupportClass.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: IPhotonPeerListener
  class IPhotonPeerListener;
  // Forward declaring type: DisconnectMessage
  class DisconnectMessage;
  // Forward declaring type: ITrafficRecorder
  class ITrafficRecorder;
  // Forward declaring type: TrafficStats
  class TrafficStats;
  // Forward declaring type: TrafficStatsGameLevel
  class TrafficStatsGameLevel;
  // Forward declaring type: PeerBase
  class PeerBase;
  // Forward declaring type: ByteArraySlicePool
  class ByteArraySlicePool;
  // Forward declaring type: PeerStateValue
  struct PeerStateValue;
  // Forward declaring type: NetworkSimulationSet
  class NetworkSimulationSet;
  // Forward declaring type: SendOptions
  struct SendOptions;
  // Forward declaring type: ParameterDictionary
  class ParameterDictionary;
  // Forward declaring type: SerializeMethod
  class SerializeMethod;
  // Forward declaring type: DeserializeMethod
  class DeserializeMethod;
  // Forward declaring type: SerializeStreamMethod
  class SerializeStreamMethod;
  // Forward declaring type: DeserializeStreamMethod
  class DeserializeStreamMethod;
}
// Forward declaring namespace: System::Diagnostics
namespace System::Diagnostics {
  // Forward declaring type: Stopwatch
  class Stopwatch;
}
// Forward declaring namespace: ExitGames::Client::Photon::Encryption
namespace ExitGames::Client::Photon::Encryption {
  // Forward declaring type: IPhotonEncryptor
  class IPhotonEncryptor;
}
// Completed forward declares
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: PhotonPeer
  class PhotonPeer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExitGames::Client::Photon::PhotonPeer);
DEFINE_IL2CPP_ARG_TYPE(::ExitGames::Client::Photon::PhotonPeer*, "ExitGames.Client.Photon", "PhotonPeer");
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Size: 0x118
  #pragma pack(push, 1)
  // Autogenerated type: ExitGames.Client.Photon.PhotonPeer
  // [TokenAttribute] Offset: FFFFFFFF
  class PhotonPeer : public ::Il2CppObject {
    public:
    public:
    // [DebuggerBrowsableAttribute] Offset: 0x94CA24
    // private System.Int32 <CommandBufferSize>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    int CommandBufferSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94CA60
    // private System.Int32 <LimitOfUnreliableCommands>k__BackingField
    // Size: 0x4
    // Offset: 0x14
    int LimitOfUnreliableCommands;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [ObsoleteAttribute] Offset: 0x94CA9C
    // public System.Int32 WarningSize
    // Size: 0x4
    // Offset: 0x18
    int WarningSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [ObsoleteAttribute] Offset: 0x94CB0C
    // public System.Int32 CommandLogSize
    // Size: 0x4
    // Offset: 0x1C
    int CommandLogSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public ExitGames.Client.Photon.TargetFrameworks TargetFramework
    // Size: 0x4
    // Offset: 0x20
    ::ExitGames::Client::Photon::TargetFrameworks TargetFramework;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::TargetFrameworks) == 0x4);
    // public System.Boolean RemoveAppIdFromWebSocketPath
    // Size: 0x1
    // Offset: 0x24
    bool RemoveAppIdFromWebSocketPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected internal System.Byte ClientSdkId
    // Size: 0x1
    // Offset: 0x25
    uint8_t ClientSdkId;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // System.Boolean UseInitV3
    // Size: 0x1
    // Offset: 0x26
    bool UseInitV3;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UseInitV3 and: SerializationProtocolType
    char __padding7[0x1] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x94CBEC
    // private ExitGames.Client.Photon.SerializationProtocol <SerializationProtocolType>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    ::ExitGames::Client::Photon::SerializationProtocol SerializationProtocolType;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::SerializationProtocol) == 0x4);
    // Padding between fields: SerializationProtocolType and: SocketImplementationConfig
    char __padding8[0x4] = {};
    // public System.Collections.Generic.Dictionary`2<ExitGames.Client.Photon.ConnectionProtocol,System.Type> SocketImplementationConfig
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::Dictionary_2<::ExitGames::Client::Photon::ConnectionProtocol, ::System::Type*>* SocketImplementationConfig;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::ExitGames::Client::Photon::ConnectionProtocol, ::System::Type*>*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94CC28
    // private System.Type <SocketImplementation>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::System::Type* SocketImplementation;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // public ExitGames.Client.Photon.DebugLevel DebugOut
    // Size: 0x1
    // Offset: 0x40
    ::ExitGames::Client::Photon::DebugLevel DebugOut;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::DebugLevel) == 0x1);
    // Padding between fields: DebugOut and: Listener
    char __padding11[0x7] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x94CC64
    // private ExitGames.Client.Photon.IPhotonPeerListener <Listener>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::ExitGames::Client::Photon::IPhotonPeerListener* Listener;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::IPhotonPeerListener*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94CCA0
    // private System.Action`1<ExitGames.Client.Photon.DisconnectMessage> OnDisconnectMessage
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_1<::ExitGames::Client::Photon::DisconnectMessage*>* OnDisconnectMessage;
    // Field size check
    static_assert(sizeof(::System::Action_1<::ExitGames::Client::Photon::DisconnectMessage*>*) == 0x8);
    // private System.Boolean reuseEventInstance
    // Size: 0x1
    // Offset: 0x58
    bool reuseEventInstance;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean useByteArraySlicePoolForEvents
    // Size: 0x1
    // Offset: 0x59
    bool useByteArraySlicePoolForEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean wrapIncomingStructs
    // Size: 0x1
    // Offset: 0x5A
    bool wrapIncomingStructs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean SendInCreationOrder
    // Size: 0x1
    // Offset: 0x5B
    bool SendInCreationOrder;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Int32 SequenceDeltaLimitResends
    // Size: 0x4
    // Offset: 0x5C
    int SequenceDeltaLimitResends;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SequenceDeltaLimitSends
    // Size: 0x4
    // Offset: 0x60
    int SequenceDeltaLimitSends;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: SequenceDeltaLimitSends and: TrafficRecorder
    char __padding19[0x4] = {};
    // public ExitGames.Client.Photon.ITrafficRecorder TrafficRecorder
    // Size: 0x8
    // Offset: 0x68
    ::ExitGames::Client::Photon::ITrafficRecorder* TrafficRecorder;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::ITrafficRecorder*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94CCDC
    // private System.Boolean <EnableServerTracing>k__BackingField
    // Size: 0x1
    // Offset: 0x70
    bool EnableServerTracing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Byte quickResendAttempts
    // Size: 0x1
    // Offset: 0x71
    uint8_t quickResendAttempts;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte ChannelCount
    // Size: 0x1
    // Offset: 0x72
    uint8_t ChannelCount;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Boolean EnableEncryptedFlag
    // Size: 0x1
    // Offset: 0x73
    bool EnableEncryptedFlag;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean crcEnabled
    // Size: 0x1
    // Offset: 0x74
    bool crcEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: crcEnabled and: SentCountAllowance
    char __padding25[0x3] = {};
    // public System.Int32 SentCountAllowance
    // Size: 0x4
    // Offset: 0x78
    int SentCountAllowance;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 InitialResendTimeMax
    // Size: 0x4
    // Offset: 0x7C
    int InitialResendTimeMax;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 TimePingInterval
    // Size: 0x4
    // Offset: 0x80
    int TimePingInterval;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 disconnectTimeout
    // Size: 0x4
    // Offset: 0x84
    int disconnectTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94CD18
    // private ExitGames.Client.Photon.ConnectionProtocol <TransportProtocol>k__BackingField
    // Size: 0x1
    // Offset: 0x88
    ::ExitGames::Client::Photon::ConnectionProtocol TransportProtocol;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::ConnectionProtocol) == 0x1);
    // Padding between fields: TransportProtocol and: mtu
    char __padding30[0x3] = {};
    // private System.Int32 mtu
    // Size: 0x4
    // Offset: 0x8C
    int mtu;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94CD54
    // private System.Boolean <IsSendingOnlyAcks>k__BackingField
    // Size: 0x1
    // Offset: 0x90
    bool IsSendingOnlyAcks;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean RandomizeSequenceNumbers
    // Size: 0x1
    // Offset: 0x91
    bool RandomizeSequenceNumbers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: RandomizeSequenceNumbers and: RandomizedSequenceNumbers
    char __padding33[0x6] = {};
    // System.Byte[] RandomizedSequenceNumbers
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<uint8_t> RandomizedSequenceNumbers;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // System.Boolean GcmDatagramEncryption
    // Size: 0x1
    // Offset: 0xA0
    bool GcmDatagramEncryption;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GcmDatagramEncryption and: TrafficStatsIncoming
    char __padding35[0x7] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x94CD90
    // private ExitGames.Client.Photon.TrafficStats <TrafficStatsIncoming>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::ExitGames::Client::Photon::TrafficStats* TrafficStatsIncoming;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::TrafficStats*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94CDCC
    // private ExitGames.Client.Photon.TrafficStats <TrafficStatsOutgoing>k__BackingField
    // Size: 0x8
    // Offset: 0xB0
    ::ExitGames::Client::Photon::TrafficStats* TrafficStatsOutgoing;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::TrafficStats*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94CE08
    // private ExitGames.Client.Photon.TrafficStatsGameLevel <TrafficStatsGameLevel>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::ExitGames::Client::Photon::TrafficStatsGameLevel* TrafficStatsGameLevel;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::TrafficStatsGameLevel*) == 0x8);
    // private System.Diagnostics.Stopwatch trafficStatsStopwatch
    // Size: 0x8
    // Offset: 0xC0
    ::System::Diagnostics::Stopwatch* trafficStatsStopwatch;
    // Field size check
    static_assert(sizeof(::System::Diagnostics::Stopwatch*) == 0x8);
    // private System.Boolean trafficStatsEnabled
    // Size: 0x1
    // Offset: 0xC8
    bool trafficStatsEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: trafficStatsEnabled and: peerBase
    char __padding40[0x7] = {};
    // ExitGames.Client.Photon.PeerBase peerBase
    // Size: 0x8
    // Offset: 0xD0
    ::ExitGames::Client::Photon::PeerBase* peerBase;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::PeerBase*) == 0x8);
    // private readonly System.Object SendOutgoingLockObject
    // Size: 0x8
    // Offset: 0xD8
    ::Il2CppObject* SendOutgoingLockObject;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private readonly System.Object DispatchLockObject
    // Size: 0x8
    // Offset: 0xE0
    ::Il2CppObject* DispatchLockObject;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private readonly System.Object EnqueueLock
    // Size: 0x8
    // Offset: 0xE8
    ::Il2CppObject* EnqueueLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Type payloadEncryptorType
    // Size: 0x8
    // Offset: 0xF0
    ::System::Type* payloadEncryptorType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // protected internal System.Byte[] PayloadEncryptionSecret
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<uint8_t> PayloadEncryptionSecret;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Type encryptorType
    // Size: 0x8
    // Offset: 0x100
    ::System::Type* encryptorType;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // protected internal ExitGames.Client.Photon.Encryption.IPhotonEncryptor Encryptor
    // Size: 0x8
    // Offset: 0x108
    ::ExitGames::Client::Photon::Encryption::IPhotonEncryptor* Encryptor;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::Encryption::IPhotonEncryptor*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0x94CE44
    // private System.Int32 <CountDiscarded>k__BackingField
    // Size: 0x4
    // Offset: 0x110
    int CountDiscarded;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94CE80
    // private System.Int32 <DeltaUnreliableNumber>k__BackingField
    // Size: 0x4
    // Offset: 0x114
    int DeltaUnreliableNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // [ObsoleteAttribute] Offset: 0x94CAD4
    // static field const value: static public System.Boolean NativeDatagramEncrypt
    static constexpr const bool NativeDatagramEncrypt = true;
    // Get static field: static public System.Boolean NativeDatagramEncrypt
    static bool _get_NativeDatagramEncrypt();
    // Set static field: static public System.Boolean NativeDatagramEncrypt
    static void _set_NativeDatagramEncrypt(bool value);
    // static field const value: static public System.Boolean NoSocket
    static constexpr const bool NoSocket = false;
    // Get static field: static public System.Boolean NoSocket
    static bool _get_NoSocket();
    // Set static field: static public System.Boolean NoSocket
    static void _set_NoSocket(bool value);
    // static field const value: static public System.Boolean DebugBuild
