// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ExitGames.Client.Photon.IProtocol
#include "ExitGames/Client/Photon/IProtocol.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: StreamBuffer
  class StreamBuffer;
  // Forward declaring type: OperationRequest
  class OperationRequest;
  // Forward declaring type: ParameterDictionary
  class ParameterDictionary;
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: OperationResponse
  class OperationResponse;
  // Forward declaring type: DisconnectMessage
  class DisconnectMessage;
  // Forward declaring type: EventData
  class EventData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Array
  class Array;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IList
  class IList;
  // Forward declaring type: IDictionary
  class IDictionary;
}
// Completed forward declares
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: Protocol16
  class Protocol16;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExitGames::Client::Photon::Protocol16);
DEFINE_IL2CPP_ARG_TYPE(::ExitGames::Client::Photon::Protocol16*, "ExitGames.Client.Photon", "Protocol16");
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: ExitGames.Client.Photon.Protocol16
  // [TokenAttribute] Offset: FFFFFFFF
  class Protocol16 : public ::ExitGames::Client::Photon::IProtocol {
    public:
    // Nested type: ::ExitGames::Client::Photon::Protocol16::GpType
    struct GpType;
    public:
    // private readonly System.Byte[] versionBytes
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<uint8_t> versionBytes;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private readonly System.Byte[] memShort
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<uint8_t> memShort;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private readonly System.Int64[] memLongBlock
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<int64_t> memLongBlock;
    // Field size check
    static_assert(sizeof(::ArrayW<int64_t>) == 0x8);
    // private readonly System.Byte[] memLongBlockBytes
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<uint8_t> memLongBlockBytes;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private readonly System.Double[] memDoubleBlock
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<double> memDoubleBlock;
    // Field size check
    static_assert(sizeof(::ArrayW<double>) == 0x8);
    // private readonly System.Byte[] memDoubleBlockBytes
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<uint8_t> memDoubleBlockBytes;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private readonly System.Byte[] memInteger
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<uint8_t> memInteger;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private readonly System.Byte[] memLong
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<uint8_t> memLong;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private readonly System.Byte[] memFloat
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<uint8_t> memFloat;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private readonly System.Byte[] memDouble
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<uint8_t> memDouble;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    public:
    // Deleting conversion operator: operator ::ExitGames::Client::Photon::ByteArraySlicePool*
    constexpr operator ::ExitGames::Client::Photon::ByteArraySlicePool*() const noexcept = delete;
    // Get static field: static private readonly System.Single[] memFloatBlock
    static ::ArrayW<float> _get_memFloatBlock();
    // Set static field: static private readonly System.Single[] memFloatBlock
    static void _set_memFloatBlock(::ArrayW<float> value);
    // Get static field: static private readonly System.Byte[] memFloatBlockBytes
    static ::ArrayW<uint8_t> _get_memFloatBlockBytes();
    // Set static field: static private readonly System.Byte[] memFloatBlockBytes
    static void _set_memFloatBlockBytes(::ArrayW<uint8_t> value);
    // Get instance field reference: private readonly System.Byte[] versionBytes
