// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Diagnostics
namespace System::Diagnostics {
  // Forward declaring type: Stopwatch
  class Stopwatch;
}
// Completed forward declares
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: TrafficStatsGameLevel
  class TrafficStatsGameLevel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExitGames::Client::Photon::TrafficStatsGameLevel);
DEFINE_IL2CPP_ARG_TYPE(::ExitGames::Client::Photon::TrafficStatsGameLevel*, "ExitGames.Client.Photon", "TrafficStatsGameLevel");
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: ExitGames.Client.Photon.TrafficStatsGameLevel
  // [TokenAttribute] Offset: FFFFFFFF
  class TrafficStatsGameLevel : public ::Il2CppObject {
    public:
    public:
    // private System.Diagnostics.Stopwatch watch
    // Size: 0x8
    // Offset: 0x10
    ::System::Diagnostics::Stopwatch* watch;
    // Field size check
    static_assert(sizeof(::System::Diagnostics::Stopwatch*) == 0x8);
    // private System.Int32 timeOfLastDispatchCall
    // Size: 0x4
    // Offset: 0x18
    int timeOfLastDispatchCall;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 timeOfLastSendCall
    // Size: 0x4
    // Offset: 0x1C
    int timeOfLastSendCall;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94CEF4
    // private System.Int32 <OperationByteCount>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    int OperationByteCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94CF30
    // private System.Int32 <OperationCount>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    int OperationCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94CF6C
    // private System.Int32 <ResultByteCount>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    int ResultByteCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94CFA8
    // private System.Int32 <ResultCount>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    int ResultCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94CFE4
    // private System.Int32 <EventByteCount>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    int EventByteCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94D020
    // private System.Int32 <EventCount>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    int EventCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94D05C
    // private System.Int32 <LongestOpResponseCallback>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    int LongestOpResponseCallback;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94D098
    // private System.Byte <LongestOpResponseCallbackOpCode>k__BackingField
    // Size: 0x1
    // Offset: 0x3C
    uint8_t LongestOpResponseCallbackOpCode;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: LongestOpResponseCallbackOpCode and: LongestEventCallback
    char __padding10[0x3] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x94D0D4
    // private System.Int32 <LongestEventCallback>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    int LongestEventCallback;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94D110
    // private System.Int32 <LongestMessageCallback>k__BackingField
    // Size: 0x4
    // Offset: 0x44
    int LongestMessageCallback;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94D14C
    // private System.Int32 <LongestRawMessageCallback>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    int LongestRawMessageCallback;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94D188
    // private System.Byte <LongestEventCallbackCode>k__BackingField
    // Size: 0x1
    // Offset: 0x4C
    uint8_t LongestEventCallbackCode;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: LongestEventCallbackCode and: LongestDeltaBetweenDispatching
    char __padding14[0x3] = {};
    // [DebuggerBrowsableAttribute] Offset: 0x94D1C4
    // private System.Int32 <LongestDeltaBetweenDispatching>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    int LongestDeltaBetweenDispatching;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94D200
    // private System.Int32 <LongestDeltaBetweenSending>k__BackingField
    // Size: 0x4
    // Offset: 0x54
    int LongestDeltaBetweenSending;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94D23C
    // private System.Int32 <DispatchIncomingCommandsCalls>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    int DispatchIncomingCommandsCalls;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0x94D278
    // private System.Int32 <SendOutgoingCommandsCalls>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    int SendOutgoingCommandsCalls;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private System.Diagnostics.Stopwatch watch
    [[deprecated("Use field access instead!")]] ::System::Diagnostics::Stopwatch*& dyn_watch();
    // Get instance field reference: private System.Int32 timeOfLastDispatchCall
    [[deprecated("Use field access instead!")]] int& dyn_timeOfLastDispatchCall();
    // Get instance field reference: private System.Int32 timeOfLastSendCall
    [[deprecated("Use field access instead!")]] int& dyn_timeOfLastSendCall();
    // Get instance field reference: private System.Int32 <OperationByteCount>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$OperationByteCount$k__BackingField();
    // Get instance field reference: private System.Int32 <OperationCount>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$OperationCount$k__BackingField();
