// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.InputControl`1
#include "UnityEngine/InputSystem/InputControl_1.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.TouchState
#include "UnityEngine/InputSystem/LowLevel/TouchState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::Controls
namespace UnityEngine::InputSystem::Controls {
  // Forward declaring type: TouchPressControl
  class TouchPressControl;
  // Forward declaring type: IntegerControl
  class IntegerControl;
  // Forward declaring type: Vector2Control
  class Vector2Control;
  // Forward declaring type: AxisControl
  class AxisControl;
  // Forward declaring type: TouchPhaseControl
  class TouchPhaseControl;
  // Forward declaring type: ButtonControl
  class ButtonControl;
  // Forward declaring type: DoubleControl
  class DoubleControl;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.Controls
namespace UnityEngine::InputSystem::Controls {
  // Forward declaring type: TouchControl
  class TouchControl;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::Controls::TouchControl);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::Controls::TouchControl*, "UnityEngine.InputSystem.Controls", "TouchControl");
// Type namespace: UnityEngine.InputSystem.Controls
namespace UnityEngine::InputSystem::Controls {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.Controls.TouchControl
  // [TokenAttribute] Offset: FFFFFFFF
  // [InputControlLayoutAttribute] Offset: 959004
  // [PreserveAttribute] Offset: FFFFFFFF
  class TouchControl : public ::UnityEngine::InputSystem::InputControl_1<::UnityEngine::InputSystem::LowLevel::TouchState> {
    public:
    public:
    // private UnityEngine.InputSystem.Controls.TouchPressControl <press>k__BackingField
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::InputSystem::Controls::TouchPressControl* press;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::TouchPressControl*) == 0x8);
    // private UnityEngine.InputSystem.Controls.IntegerControl <touchId>k__BackingField
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::InputSystem::Controls::IntegerControl* touchId;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::IntegerControl*) == 0x8);
    // private UnityEngine.InputSystem.Controls.Vector2Control <position>k__BackingField
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::InputSystem::Controls::Vector2Control* position;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::Vector2Control*) == 0x8);
    // private UnityEngine.InputSystem.Controls.Vector2Control <delta>k__BackingField
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::InputSystem::Controls::Vector2Control* delta;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::Vector2Control*) == 0x8);
    // private UnityEngine.InputSystem.Controls.AxisControl <pressure>k__BackingField
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::InputSystem::Controls::AxisControl* pressure;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::AxisControl*) == 0x8);
    // private UnityEngine.InputSystem.Controls.Vector2Control <radius>k__BackingField
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::InputSystem::Controls::Vector2Control* radius;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::Vector2Control*) == 0x8);
    // private UnityEngine.InputSystem.Controls.TouchPhaseControl <phase>k__BackingField
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::InputSystem::Controls::TouchPhaseControl* phase;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::TouchPhaseControl*) == 0x8);
    // private UnityEngine.InputSystem.Controls.ButtonControl <indirectTouch>k__BackingField
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::InputSystem::Controls::ButtonControl* indirectTouch;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::ButtonControl*) == 0x8);
    // private UnityEngine.InputSystem.Controls.ButtonControl <tap>k__BackingField
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::InputSystem::Controls::ButtonControl* tap;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::ButtonControl*) == 0x8);
    // private UnityEngine.InputSystem.Controls.IntegerControl <tapCount>k__BackingField
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::InputSystem::Controls::IntegerControl* tapCount;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::IntegerControl*) == 0x8);
    // private UnityEngine.InputSystem.Controls.DoubleControl <startTime>k__BackingField
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::InputSystem::Controls::DoubleControl* startTime;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::DoubleControl*) == 0x8);
    // private UnityEngine.InputSystem.Controls.Vector2Control <startPosition>k__BackingField
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::InputSystem::Controls::Vector2Control* startPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Controls::Vector2Control*) == 0x8);
    public:
    // Deleting conversion operator: operator ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::InputProcessor_1<TValue>*>
    constexpr operator ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::InputProcessor_1<TValue>*>() const noexcept = delete;
    // Get instance field reference: private UnityEngine.InputSystem.Controls.TouchPressControl <press>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Controls::TouchPressControl*& dyn_$press$k__BackingField();
    // Get instance field reference: private UnityEngine.InputSystem.Controls.IntegerControl <touchId>k__BackingField
