// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabRequestCommon
#include "PlayFab/SharedModels/PlayFabRequestCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PlayFab::GroupsModels
namespace PlayFab::GroupsModels {
  // Forward declaring type: EntityKey
  class EntityKey;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: PlayFab.GroupsModels
namespace PlayFab::GroupsModels {
  // Forward declaring type: ChangeMemberRoleRequest
  class ChangeMemberRoleRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::GroupsModels::ChangeMemberRoleRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::GroupsModels::ChangeMemberRoleRequest*, "PlayFab.GroupsModels", "ChangeMemberRoleRequest");
// Type namespace: PlayFab.GroupsModels
namespace PlayFab::GroupsModels {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.GroupsModels.ChangeMemberRoleRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class ChangeMemberRoleRequest : public ::PlayFab::SharedModels::PlayFabRequestCommon {
    public:
    public:
    // public System.String DestinationRoleId
    // Size: 0x8
    // Offset: 0x18
    ::StringW DestinationRoleId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PlayFab.GroupsModels.EntityKey Group
    // Size: 0x8
    // Offset: 0x20
    ::PlayFab::GroupsModels::EntityKey* Group;
    // Field size check
    static_assert(sizeof(::PlayFab::GroupsModels::EntityKey*) == 0x8);
    // public System.Collections.Generic.List`1<PlayFab.GroupsModels.EntityKey> Members
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::PlayFab::GroupsModels::EntityKey*>* Members;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PlayFab::GroupsModels::EntityKey*>*) == 0x8);
    // public System.String OriginRoleId
    // Size: 0x8
    // Offset: 0x30
    ::StringW OriginRoleId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public System.String DestinationRoleId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_DestinationRoleId();
    // Get instance field reference: public PlayFab.GroupsModels.EntityKey Group
    [[deprecated("Use field access instead!")]] ::PlayFab::GroupsModels::EntityKey*& dyn_Group();
    // Get instance field reference: public System.Collections.Generic.List`1<PlayFab.GroupsModels.EntityKey> Members
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::PlayFab::GroupsModels::EntityKey*>*& dyn_Members();
    // Get instance field reference: public System.String OriginRoleId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OriginRoleId();
    // public System.Void .ctor()
    // Offset: 0xBB7120
    // Implemented from: PlayFab.SharedModels.PlayFabRequestCommon
    // Base method: System.Void PlayFabRequestCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ChangeMemberRoleRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::GroupsModels::ChangeMemberRoleRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ChangeMemberRoleRequest*, creationType>()));
    }
  }; // PlayFab.GroupsModels.ChangeMemberRoleRequest
  #pragma pack(pop)
  static check_size<sizeof(ChangeMemberRoleRequest), 48 + sizeof(::StringW)> __PlayFab_GroupsModels_ChangeMemberRoleRequestSizeCheck;
  static_assert(sizeof(ChangeMemberRoleRequest) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::GroupsModels::ChangeMemberRoleRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
