// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PlayFab::GroupsModels
namespace PlayFab::GroupsModels {
  // Forward declaring type: EntityKey
  class EntityKey;
  // Forward declaring type: GroupRole
  class GroupRole;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: PlayFab.GroupsModels
namespace PlayFab::GroupsModels {
  // Forward declaring type: GroupWithRoles
  class GroupWithRoles;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::GroupsModels::GroupWithRoles);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::GroupsModels::GroupWithRoles*, "PlayFab.GroupsModels", "GroupWithRoles");
// Type namespace: PlayFab.GroupsModels
namespace PlayFab::GroupsModels {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.GroupsModels.GroupWithRoles
  // [TokenAttribute] Offset: FFFFFFFF
  class GroupWithRoles : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public PlayFab.GroupsModels.EntityKey Group
    // Size: 0x8
    // Offset: 0x10
    ::PlayFab::GroupsModels::EntityKey* Group;
    // Field size check
    static_assert(sizeof(::PlayFab::GroupsModels::EntityKey*) == 0x8);
    // public System.String GroupName
    // Size: 0x8
    // Offset: 0x18
    ::StringW GroupName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 ProfileVersion
    // Size: 0x4
    // Offset: 0x20
    int ProfileVersion;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: ProfileVersion and: Roles
    char __padding2[0x4] = {};
    // public System.Collections.Generic.List`1<PlayFab.GroupsModels.GroupRole> Roles
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::PlayFab::GroupsModels::GroupRole*>* Roles;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PlayFab::GroupsModels::GroupRole*>*) == 0x8);
    public:
    // Get instance field reference: public PlayFab.GroupsModels.EntityKey Group
    [[deprecated("Use field access instead!")]] ::PlayFab::GroupsModels::EntityKey*& dyn_Group();
    // Get instance field reference: public System.String GroupName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_GroupName();
    // Get instance field reference: public System.Int32 ProfileVersion
    [[deprecated("Use field access instead!")]] int& dyn_ProfileVersion();
    // Get instance field reference: public System.Collections.Generic.List`1<PlayFab.GroupsModels.GroupRole> Roles
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::PlayFab::GroupsModels::GroupRole*>*& dyn_Roles();
    // public System.Void .ctor()
    // Offset: 0xBB71A8
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GroupWithRoles* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::GroupsModels::GroupWithRoles::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GroupWithRoles*, creationType>()));
    }
  }; // PlayFab.GroupsModels.GroupWithRoles
  #pragma pack(pop)
  static check_size<sizeof(GroupWithRoles), 40 + sizeof(::System::Collections::Generic::List_1<::PlayFab::GroupsModels::GroupRole*>*)> __PlayFab_GroupsModels_GroupWithRolesSizeCheck;
  static_assert(sizeof(GroupWithRoles) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::GroupsModels::GroupWithRoles::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
