// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PlayFab::GroupsModels
namespace PlayFab::GroupsModels {
  // Forward declaring type: EntityKey
  class EntityKey;
  // Forward declaring type: EntityWithLineage
  class EntityWithLineage;
}
// Completed forward declares
// Type namespace: PlayFab.GroupsModels
namespace PlayFab::GroupsModels {
  // Forward declaring type: GroupInvitation
  class GroupInvitation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::GroupsModels::GroupInvitation);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::GroupsModels::GroupInvitation*, "PlayFab.GroupsModels", "GroupInvitation");
// Type namespace: PlayFab.GroupsModels
namespace PlayFab::GroupsModels {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.GroupsModels.GroupInvitation
  // [TokenAttribute] Offset: FFFFFFFF
  class GroupInvitation : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public System.DateTime Expires
    // Size: 0x8
    // Offset: 0x10
    ::System::DateTime Expires;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // public PlayFab.GroupsModels.EntityKey Group
    // Size: 0x8
    // Offset: 0x18
    ::PlayFab::GroupsModels::EntityKey* Group;
    // Field size check
    static_assert(sizeof(::PlayFab::GroupsModels::EntityKey*) == 0x8);
    // public PlayFab.GroupsModels.EntityWithLineage InvitedByEntity
    // Size: 0x8
    // Offset: 0x20
    ::PlayFab::GroupsModels::EntityWithLineage* InvitedByEntity;
    // Field size check
    static_assert(sizeof(::PlayFab::GroupsModels::EntityWithLineage*) == 0x8);
    // public PlayFab.GroupsModels.EntityWithLineage InvitedEntity
    // Size: 0x8
    // Offset: 0x28
    ::PlayFab::GroupsModels::EntityWithLineage* InvitedEntity;
    // Field size check
    static_assert(sizeof(::PlayFab::GroupsModels::EntityWithLineage*) == 0x8);
    // public System.String RoleId
    // Size: 0x8
    // Offset: 0x30
    ::StringW RoleId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.DateTime Expires
    [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_Expires();
    // Get instance field reference: public PlayFab.GroupsModels.EntityKey Group
    [[deprecated("Use field access instead!")]] ::PlayFab::GroupsModels::EntityKey*& dyn_Group();
    // Get instance field reference: public PlayFab.GroupsModels.EntityWithLineage InvitedByEntity
    [[deprecated("Use field access instead!")]] ::PlayFab::GroupsModels::EntityWithLineage*& dyn_InvitedByEntity();
    // Get instance field reference: public PlayFab.GroupsModels.EntityWithLineage InvitedEntity
    [[deprecated("Use field access instead!")]] ::PlayFab::GroupsModels::EntityWithLineage*& dyn_InvitedEntity();
    // Get instance field reference: public System.String RoleId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_RoleId();
    // public System.Void .ctor()
    // Offset: 0xBB7198
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GroupInvitation* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::GroupsModels::GroupInvitation::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GroupInvitation*, creationType>()));
    }
  }; // PlayFab.GroupsModels.GroupInvitation
  #pragma pack(pop)
  static check_size<sizeof(GroupInvitation), 48 + sizeof(::StringW)> __PlayFab_GroupsModels_GroupInvitationSizeCheck;
  static_assert(sizeof(GroupInvitation) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::GroupsModels::GroupInvitation::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
