// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LightMode
#include "UnityEngine/Experimental/GlobalIllumination/LightMode.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LinearColor
#include "UnityEngine/Experimental/GlobalIllumination/LinearColor.hpp"
// Completed includes
// Type namespace: UnityEngine.Experimental.GlobalIllumination
namespace UnityEngine::Experimental::GlobalIllumination {
  // Size: 0x38
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Experimental.GlobalIllumination.DirectionalLight
  // [TokenAttribute] Offset: FFFFFFFF
  struct DirectionalLight/*, public System::ValueType*/ {
    public:
    // public System.Int32 instanceID
    // Size: 0x4
    // Offset: 0x0
    int instanceID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean shadow
    // Size: 0x1
    // Offset: 0x4
    bool shadow;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.Experimental.GlobalIllumination.LightMode mode
    // Size: 0x1
    // Offset: 0x5
    UnityEngine::Experimental::GlobalIllumination::LightMode mode;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LightMode) == 0x1);
    // Padding between fields: mode and: direction
    char __padding2[0x2] = {};
    // public UnityEngine.Vector3 direction
    // Size: 0xC
    // Offset: 0x8
    UnityEngine::Vector3 direction;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Experimental.GlobalIllumination.LinearColor color
    // Size: 0x10
    // Offset: 0x14
    UnityEngine::Experimental::GlobalIllumination::LinearColor color;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LinearColor) == 0x10);
    // public UnityEngine.Experimental.GlobalIllumination.LinearColor indirectColor
    // Size: 0x10
    // Offset: 0x24
    UnityEngine::Experimental::GlobalIllumination::LinearColor indirectColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LinearColor) == 0x10);
    // public System.Single penumbraWidthRadian
    // Size: 0x4
    // Offset: 0x34
    float penumbraWidthRadian;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: DirectionalLight
    constexpr DirectionalLight(int instanceID_ = {}, bool shadow_ = {}, UnityEngine::Experimental::GlobalIllumination::LightMode mode_ = {}, UnityEngine::Vector3 direction_ = {}, UnityEngine::Experimental::GlobalIllumination::LinearColor color_ = {}, UnityEngine::Experimental::GlobalIllumination::LinearColor indirectColor_ = {}, float penumbraWidthRadian_ = {}) noexcept : instanceID{instanceID_}, shadow{shadow_}, mode{mode_}, direction{direction_}, color{color_}, indirectColor{indirectColor_}, penumbraWidthRadian{penumbraWidthRadian_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public System.Int32 instanceID
    int _get_instanceID();
    // Set instance field: public System.Int32 instanceID
    void _set_instanceID(int value);
    // Get instance field: public System.Boolean shadow
    bool _get_shadow();
    // Set instance field: public System.Boolean shadow
    void _set_shadow(bool value);
    // Get instance field: public UnityEngine.Experimental.GlobalIllumination.LightMode mode
    UnityEngine::Experimental::GlobalIllumination::LightMode _get_mode();
    // Set instance field: public UnityEngine.Experimental.GlobalIllumination.LightMode mode
    void _set_mode(UnityEngine::Experimental::GlobalIllumination::LightMode value);
    // Get instance field: public UnityEngine.Vector3 direction
    UnityEngine::Vector3 _get_direction();
    // Set instance field: public UnityEngine.Vector3 direction
    void _set_direction(UnityEngine::Vector3 value);
    // Get instance field: public UnityEngine.Experimental.GlobalIllumination.LinearColor color
    UnityEngine::Experimental::GlobalIllumination::LinearColor _get_color();
    // Set instance field: public UnityEngine.Experimental.GlobalIllumination.LinearColor color
    void _set_color(UnityEngine::Experimental::GlobalIllumination::LinearColor value);
    // Get instance field: public UnityEngine.Experimental.GlobalIllumination.LinearColor indirectColor
    UnityEngine::Experimental::GlobalIllumination::LinearColor _get_indirectColor();
    // Set instance field: public UnityEngine.Experimental.GlobalIllumination.LinearColor indirectColor
    void _set_indirectColor(UnityEngine::Experimental::GlobalIllumination::LinearColor value);
    // Get instance field: public System.Single penumbraWidthRadian
    float _get_penumbraWidthRadian();
    // Set instance field: public System.Single penumbraWidthRadian
    void _set_penumbraWidthRadian(float value);
  }; // UnityEngine.Experimental.GlobalIllumination.DirectionalLight
  #pragma pack(pop)
  static check_size<sizeof(DirectionalLight), 52 + sizeof(float)> __UnityEngine_Experimental_GlobalIllumination_DirectionalLightSizeCheck;
  static_assert(sizeof(DirectionalLight) == 0x38);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Experimental::GlobalIllumination::DirectionalLight, "UnityEngine.Experimental.GlobalIllumination", "DirectionalLight");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
