// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LinearColor
#include "UnityEngine/Experimental/GlobalIllumination/LinearColor.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LightType
#include "UnityEngine/Experimental/GlobalIllumination/LightType.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LightMode
#include "UnityEngine/Experimental/GlobalIllumination/LightMode.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.FalloffType
#include "UnityEngine/Experimental/GlobalIllumination/FalloffType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Experimental::GlobalIllumination
namespace UnityEngine::Experimental::GlobalIllumination {
  // Forward declaring type: DirectionalLight
  struct DirectionalLight;
  // Forward declaring type: PointLight
  struct PointLight;
  // Forward declaring type: SpotLight
  struct SpotLight;
  // Forward declaring type: RectangleLight
  struct RectangleLight;
  // Forward declaring type: DiscLight
  struct DiscLight;
}
// Completed forward declares
// Type namespace: UnityEngine.Experimental.GlobalIllumination
namespace UnityEngine::Experimental::GlobalIllumination {
  // Size: 0x58
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Experimental.GlobalIllumination.LightDataGI
  // [TokenAttribute] Offset: FFFFFFFF
  // [UsedByNativeCodeAttribute] Offset: D7FC94
  struct LightDataGI/*, public System::ValueType*/ {
    public:
    // public System.Int32 instanceID
    // Size: 0x4
    // Offset: 0x0
    int instanceID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Experimental.GlobalIllumination.LinearColor color
    // Size: 0x10
    // Offset: 0x4
    UnityEngine::Experimental::GlobalIllumination::LinearColor color;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LinearColor) == 0x10);
    // public UnityEngine.Experimental.GlobalIllumination.LinearColor indirectColor
    // Size: 0x10
    // Offset: 0x14
    UnityEngine::Experimental::GlobalIllumination::LinearColor indirectColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LinearColor) == 0x10);
    // public UnityEngine.Quaternion orientation
    // Size: 0x10
    // Offset: 0x24
    UnityEngine::Quaternion orientation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 position
    // Size: 0xC
    // Offset: 0x34
    UnityEngine::Vector3 position;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public System.Single range
    // Size: 0x4
    // Offset: 0x40
    float range;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single coneAngle
    // Size: 0x4
    // Offset: 0x44
    float coneAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single innerConeAngle
    // Size: 0x4
    // Offset: 0x48
    float innerConeAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single shape0
    // Size: 0x4
    // Offset: 0x4C
    float shape0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single shape1
    // Size: 0x4
    // Offset: 0x50
    float shape1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Experimental.GlobalIllumination.LightType type
    // Size: 0x1
    // Offset: 0x54
    UnityEngine::Experimental::GlobalIllumination::LightType type;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LightType) == 0x1);
    // public UnityEngine.Experimental.GlobalIllumination.LightMode mode
    // Size: 0x1
    // Offset: 0x55
    UnityEngine::Experimental::GlobalIllumination::LightMode mode;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LightMode) == 0x1);
    // public System.Byte shadow
    // Size: 0x1
    // Offset: 0x56
    uint8_t shadow;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public UnityEngine.Experimental.GlobalIllumination.FalloffType falloff
    // Size: 0x1
    // Offset: 0x57
    UnityEngine::Experimental::GlobalIllumination::FalloffType falloff;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::FalloffType) == 0x1);
    // Creating value type constructor for type: LightDataGI
    constexpr LightDataGI(int instanceID_ = {}, UnityEngine::Experimental::GlobalIllumination::LinearColor color_ = {}, UnityEngine::Experimental::GlobalIllumination::LinearColor indirectColor_ = {}, UnityEngine::Quaternion orientation_ = {}, UnityEngine::Vector3 position_ = {}, float range_ = {}, float coneAngle_ = {}, float innerConeAngle_ = {}, float shape0_ = {}, float shape1_ = {}, UnityEngine::Experimental::GlobalIllumination::LightType type_ = {}, UnityEngine::Experimental::GlobalIllumination::LightMode mode_ = {}, uint8_t shadow_ = {}, UnityEngine::Experimental::GlobalIllumination::FalloffType falloff_ = {}) noexcept : instanceID{instanceID_}, color{color_}, indirectColor{indirectColor_}, orientation{orientation_}, position{position_}, range{range_}, coneAngle{coneAngle_}, innerConeAngle{innerConeAngle_}, shape0{shape0_}, shape1{shape1_}, type{type_}, mode{mode_}, shadow{shadow_}, falloff{falloff_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public System.Int32 instanceID
    int _get_instanceID();
    // Set instance field: public System.Int32 instanceID
    void _set_instanceID(int value);
    // Get instance field: public UnityEngine.Experimental.GlobalIllumination.LinearColor color
    UnityEngine::Experimental::GlobalIllumination::LinearColor _get_color();
    // Set instance field: public UnityEngine.Experimental.GlobalIllumination.LinearColor color
    void _set_color(UnityEngine::Experimental::GlobalIllumination::LinearColor value);
    // Get instance field: public UnityEngine.Experimental.GlobalIllumination.LinearColor indirectColor
    UnityEngine::Experimental::GlobalIllumination::LinearColor _get_indirectColor();
    // Set instance field: public UnityEngine.Experimental.GlobalIllumination.LinearColor indirectColor
    void _set_indirectColor(UnityEngine::Experimental::GlobalIllumination::LinearColor value);
    // Get instance field: public UnityEngine.Quaternion orientation
    UnityEngine::Quaternion _get_orientation();
    // Set instance field: public UnityEngine.Quaternion orientation
    void _set_orientation(UnityEngine::Quaternion value);
    // Get instance field: public UnityEngine.Vector3 position
    UnityEngine::Vector3 _get_position();
    // Set instance field: public UnityEngine.Vector3 position
    void _set_position(UnityEngine::Vector3 value);
    // Get instance field: public System.Single range
    float _get_range();
    // Set instance field: public System.Single range
    void _set_range(float value);
    // Get instance field: public System.Single coneAngle
    float _get_coneAngle();
    // Set instance field: public System.Single coneAngle
    void _set_coneAngle(float value);
    // Get instance field: public System.Single innerConeAngle
    float _get_innerConeAngle();
    // Set instance field: public System.Single innerConeAngle
    void _set_innerConeAngle(float value);
    // Get instance field: public System.Single shape0
    float _get_shape0();
    // Set instance field: public System.Single shape0
    void _set_shape0(float value);
    // Get instance field: public System.Single shape1
    float _get_shape1();
    // Set instance field: public System.Single shape1
    void _set_shape1(float value);
    // Get instance field: public UnityEngine.Experimental.GlobalIllumination.LightType type
    UnityEngine::Experimental::GlobalIllumination::LightType _get_type();
    // Set instance field: public UnityEngine.Experimental.GlobalIllumination.LightType type
    void _set_type(UnityEngine::Experimental::GlobalIllumination::LightType value);
    // Get instance field: public UnityEngine.Experimental.GlobalIllumination.LightMode mode
    UnityEngine::Experimental::GlobalIllumination::LightMode _get_mode();
    // Set instance field: public UnityEngine.Experimental.GlobalIllumination.LightMode mode
    void _set_mode(UnityEngine::Experimental::GlobalIllumination::LightMode value);
    // Get instance field: public System.Byte shadow
    uint8_t _get_shadow();
    // Set instance field: public System.Byte shadow
    void _set_shadow(uint8_t value);
    // Get instance field: public UnityEngine.Experimental.GlobalIllumination.FalloffType falloff
    UnityEngine::Experimental::GlobalIllumination::FalloffType _get_falloff();
    // Set instance field: public UnityEngine.Experimental.GlobalIllumination.FalloffType falloff
    void _set_falloff(UnityEngine::Experimental::GlobalIllumination::FalloffType value);
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.DirectionalLight light)
    // Offset: 0xEF49B4
    void Init(UnityEngine::Experimental::GlobalIllumination::DirectionalLight& light);
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.PointLight light)
    // Offset: 0xEF49BC
    void Init(UnityEngine::Experimental::GlobalIllumination::PointLight& light);
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.SpotLight light)
    // Offset: 0xEF49C4
    void Init(UnityEngine::Experimental::GlobalIllumination::SpotLight& light);
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.RectangleLight light)
    // Offset: 0xEF49CC
    void Init(UnityEngine::Experimental::GlobalIllumination::RectangleLight& light);
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.DiscLight light)
    // Offset: 0xEF49D4
    void Init(UnityEngine::Experimental::GlobalIllumination::DiscLight& light);
    // public System.Void InitNoBake(System.Int32 lightInstanceID)
    // Offset: 0xEF49DC
    void InitNoBake(int lightInstanceID);
  }; // UnityEngine.Experimental.GlobalIllumination.LightDataGI
  #pragma pack(pop)
  static check_size<sizeof(LightDataGI), 87 + sizeof(UnityEngine::Experimental::GlobalIllumination::FalloffType)> __UnityEngine_Experimental_GlobalIllumination_LightDataGISizeCheck;
  static_assert(sizeof(LightDataGI) == 0x58);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Experimental::GlobalIllumination::LightDataGI, "UnityEngine.Experimental.GlobalIllumination", "LightDataGI");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::Experimental::GlobalIllumination::LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::DirectionalLight&)>(&UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init)> {
  static const MethodInfo* get() {
    static auto* light = &::il2cpp_utils::GetClassFromName("UnityEngine.Experimental.GlobalIllumination", "DirectionalLight")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Experimental::GlobalIllumination::LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{light});
  }
};
// Writing MetadataGetter for method: UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::Experimental::GlobalIllumination::LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::PointLight&)>(&UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init)> {
  static const MethodInfo* get() {
    static auto* light = &::il2cpp_utils::GetClassFromName("UnityEngine.Experimental.GlobalIllumination", "PointLight")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Experimental::GlobalIllumination::LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{light});
  }
};
// Writing MetadataGetter for method: UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::Experimental::GlobalIllumination::LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::SpotLight&)>(&UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init)> {
  static const MethodInfo* get() {
    static auto* light = &::il2cpp_utils::GetClassFromName("UnityEngine.Experimental.GlobalIllumination", "SpotLight")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Experimental::GlobalIllumination::LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{light});
  }
};
// Writing MetadataGetter for method: UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::Experimental::GlobalIllumination::LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::RectangleLight&)>(&UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init)> {
  static const MethodInfo* get() {
    static auto* light = &::il2cpp_utils::GetClassFromName("UnityEngine.Experimental.GlobalIllumination", "RectangleLight")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Experimental::GlobalIllumination::LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{light});
  }
};
// Writing MetadataGetter for method: UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::Experimental::GlobalIllumination::LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::DiscLight&)>(&UnityEngine::Experimental::GlobalIllumination::LightDataGI::Init)> {
  static const MethodInfo* get() {
    static auto* light = &::il2cpp_utils::GetClassFromName("UnityEngine.Experimental.GlobalIllumination", "DiscLight")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Experimental::GlobalIllumination::LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{light});
  }
};
// Writing MetadataGetter for method: UnityEngine::Experimental::GlobalIllumination::LightDataGI::InitNoBake
// Il2CppName: InitNoBake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::Experimental::GlobalIllumination::LightDataGI::*)(int)>(&UnityEngine::Experimental::GlobalIllumination::LightDataGI::InitNoBake)> {
  static const MethodInfo* get() {
    static auto* lightInstanceID = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Experimental::GlobalIllumination::LightDataGI), "InitNoBake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{lightInstanceID});
  }
};
