// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LinearColor
#include "UnityEngine/Experimental/GlobalIllumination/LinearColor.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LightType
#include "UnityEngine/Experimental/GlobalIllumination/LightType.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LightMode
#include "UnityEngine/Experimental/GlobalIllumination/LightMode.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.FalloffType
#include "UnityEngine/Experimental/GlobalIllumination/FalloffType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Experimental::GlobalIllumination
namespace UnityEngine::Experimental::GlobalIllumination {
  // Forward declaring type: DirectionalLight
  struct DirectionalLight;
  // Forward declaring type: PointLight
  struct PointLight;
  // Forward declaring type: SpotLight
  struct SpotLight;
  // Forward declaring type: RectangleLight
  struct RectangleLight;
  // Forward declaring type: DiscLight
  struct DiscLight;
}
// Completed forward declares
// Type namespace: UnityEngine.Experimental.GlobalIllumination
namespace UnityEngine::Experimental::GlobalIllumination {
  // Size: 0x58
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Experimental.GlobalIllumination.LightDataGI
  // [UsedByNativeCodeAttribute] Offset: D924D4
  struct LightDataGI/*, public System::ValueType*/ {
    public:
    // public System.Int32 instanceID
    // Size: 0x4
    // Offset: 0x0
    int instanceID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Experimental.GlobalIllumination.LinearColor color
    // Size: 0x10
    // Offset: 0x4
    UnityEngine::Experimental::GlobalIllumination::LinearColor color;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LinearColor) == 0x10);
    // public UnityEngine.Experimental.GlobalIllumination.LinearColor indirectColor
    // Size: 0x10
    // Offset: 0x14
    UnityEngine::Experimental::GlobalIllumination::LinearColor indirectColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LinearColor) == 0x10);
    // public UnityEngine.Quaternion orientation
    // Size: 0x10
    // Offset: 0x24
    UnityEngine::Quaternion orientation;
    // Field size check
    static_assert(sizeof(UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 position
    // Size: 0xC
    // Offset: 0x34
    UnityEngine::Vector3 position;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // public System.Single range
    // Size: 0x4
    // Offset: 0x40
    float range;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single coneAngle
    // Size: 0x4
    // Offset: 0x44
    float coneAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single innerConeAngle
    // Size: 0x4
    // Offset: 0x48
    float innerConeAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single shape0
    // Size: 0x4
    // Offset: 0x4C
    float shape0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single shape1
    // Size: 0x4
    // Offset: 0x50
    float shape1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Experimental.GlobalIllumination.LightType type
    // Size: 0x1
    // Offset: 0x54
    UnityEngine::Experimental::GlobalIllumination::LightType type;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LightType) == 0x1);
    // public UnityEngine.Experimental.GlobalIllumination.LightMode mode
    // Size: 0x1
    // Offset: 0x55
    UnityEngine::Experimental::GlobalIllumination::LightMode mode;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::LightMode) == 0x1);
    // public System.Byte shadow
    // Size: 0x1
    // Offset: 0x56
    uint8_t shadow;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public UnityEngine.Experimental.GlobalIllumination.FalloffType falloff
    // Size: 0x1
    // Offset: 0x57
    UnityEngine::Experimental::GlobalIllumination::FalloffType falloff;
    // Field size check
    static_assert(sizeof(UnityEngine::Experimental::GlobalIllumination::FalloffType) == 0x1);
    // Creating value type constructor for type: LightDataGI
    constexpr LightDataGI(int instanceID_ = {}, UnityEngine::Experimental::GlobalIllumination::LinearColor color_ = {}, UnityEngine::Experimental::GlobalIllumination::LinearColor indirectColor_ = {}, UnityEngine::Quaternion orientation_ = {}, UnityEngine::Vector3 position_ = {}, float range_ = {}, float coneAngle_ = {}, float innerConeAngle_ = {}, float shape0_ = {}, float shape1_ = {}, UnityEngine::Experimental::GlobalIllumination::LightType type_ = {}, UnityEngine::Experimental::GlobalIllumination::LightMode mode_ = {}, uint8_t shadow_ = {}, UnityEngine::Experimental::GlobalIllumination::FalloffType falloff_ = {}) noexcept : instanceID{instanceID_}, color{color_}, indirectColor{indirectColor_}, orientation{orientation_}, position{position_}, range{range_}, coneAngle{coneAngle_}, innerConeAngle{innerConeAngle_}, shape0{shape0_}, shape1{shape1_}, type{type_}, mode{mode_}, shadow{shadow_}, falloff{falloff_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.DirectionalLight light)
    // Offset: 0xF07B7C
    void Init(UnityEngine::Experimental::GlobalIllumination::DirectionalLight& light);
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.PointLight light)
    // Offset: 0xF07B84
    void Init(UnityEngine::Experimental::GlobalIllumination::PointLight& light);
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.SpotLight light)
    // Offset: 0xF07B8C
    void Init(UnityEngine::Experimental::GlobalIllumination::SpotLight& light);
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.RectangleLight light)
    // Offset: 0xF07B94
    void Init(UnityEngine::Experimental::GlobalIllumination::RectangleLight& light);
    // public System.Void Init(ref UnityEngine.Experimental.GlobalIllumination.DiscLight light)
    // Offset: 0xF07B9C
    void Init(UnityEngine::Experimental::GlobalIllumination::DiscLight& light);
    // public System.Void InitNoBake(System.Int32 lightInstanceID)
    // Offset: 0xF07BA4
    void InitNoBake(int lightInstanceID);
  }; // UnityEngine.Experimental.GlobalIllumination.LightDataGI
  #pragma pack(pop)
  static check_size<sizeof(LightDataGI), 87 + sizeof(UnityEngine::Experimental::GlobalIllumination::FalloffType)> __UnityEngine_Experimental_GlobalIllumination_LightDataGISizeCheck;
  static_assert(sizeof(LightDataGI) == 0x58);
  // Writing MetadataGetter for method: LightDataGI::Init
  // Il2CppName: Init
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::DirectionalLight&)>(&LightDataGI::Init)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<UnityEngine::Experimental::GlobalIllumination::DirectionalLight&>()});
    }
  };
  // Writing MetadataGetter for method: LightDataGI::Init
  // Il2CppName: Init
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::PointLight&)>(&LightDataGI::Init)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<UnityEngine::Experimental::GlobalIllumination::PointLight&>()});
    }
  };
  // Writing MetadataGetter for method: LightDataGI::Init
  // Il2CppName: Init
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::SpotLight&)>(&LightDataGI::Init)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<UnityEngine::Experimental::GlobalIllumination::SpotLight&>()});
    }
  };
  // Writing MetadataGetter for method: LightDataGI::Init
  // Il2CppName: Init
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::RectangleLight&)>(&LightDataGI::Init)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<UnityEngine::Experimental::GlobalIllumination::RectangleLight&>()});
    }
  };
  // Writing MetadataGetter for method: LightDataGI::Init
  // Il2CppName: Init
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LightDataGI::*)(UnityEngine::Experimental::GlobalIllumination::DiscLight&)>(&LightDataGI::Init)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LightDataGI), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<UnityEngine::Experimental::GlobalIllumination::DiscLight&>()});
    }
  };
  // Writing MetadataGetter for method: LightDataGI::InitNoBake
  // Il2CppName: InitNoBake
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (LightDataGI::*)(int)>(&LightDataGI::InitNoBake)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(LightDataGI), "InitNoBake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<int>()});
    }
  };
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Experimental::GlobalIllumination::LightDataGI, "UnityEngine.Experimental.GlobalIllumination", "LightDataGI");
