// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LightMode
#include "UnityEngine/Experimental/GlobalIllumination/LightMode.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.LinearColor
#include "UnityEngine/Experimental/GlobalIllumination/LinearColor.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.FalloffType
#include "UnityEngine/Experimental/GlobalIllumination/FalloffType.hpp"
// Including type: UnityEngine.Experimental.GlobalIllumination.AngularFalloffType
#include "UnityEngine/Experimental/GlobalIllumination/AngularFalloffType.hpp"
// Completed includes
// Type namespace: UnityEngine.Experimental.GlobalIllumination
namespace UnityEngine::Experimental::GlobalIllumination {
  // Autogenerated type: UnityEngine.Experimental.GlobalIllumination.SpotLight
  struct SpotLight : public System::ValueType {
    public:
    // public System.Int32 instanceID
    // Offset: 0x0
    int instanceID;
    // public System.Boolean shadow
    // Offset: 0x4
    bool shadow;
    // public UnityEngine.Experimental.GlobalIllumination.LightMode mode
    // Offset: 0x5
    UnityEngine::Experimental::GlobalIllumination::LightMode mode;
    // public UnityEngine.Vector3 position
    // Offset: 0x8
    UnityEngine::Vector3 position;
    // public UnityEngine.Quaternion orientation
    // Offset: 0x14
    UnityEngine::Quaternion orientation;
    // public UnityEngine.Experimental.GlobalIllumination.LinearColor color
    // Offset: 0x24
    UnityEngine::Experimental::GlobalIllumination::LinearColor color;
    // public UnityEngine.Experimental.GlobalIllumination.LinearColor indirectColor
    // Offset: 0x34
    UnityEngine::Experimental::GlobalIllumination::LinearColor indirectColor;
    // public System.Single range
    // Offset: 0x44
    float range;
    // public System.Single sphereRadius
    // Offset: 0x48
    float sphereRadius;
    // public System.Single coneAngle
    // Offset: 0x4C
    float coneAngle;
    // public System.Single innerConeAngle
    // Offset: 0x50
    float innerConeAngle;
    // public UnityEngine.Experimental.GlobalIllumination.FalloffType falloff
    // Offset: 0x54
    UnityEngine::Experimental::GlobalIllumination::FalloffType falloff;
    // public UnityEngine.Experimental.GlobalIllumination.AngularFalloffType angularFalloff
    // Offset: 0x55
    UnityEngine::Experimental::GlobalIllumination::AngularFalloffType angularFalloff;
    // Creating value type constructor for type: SpotLight
    constexpr SpotLight(int instanceID_ = {}, bool shadow_ = {}, UnityEngine::Experimental::GlobalIllumination::LightMode mode_ = {}, UnityEngine::Vector3 position_ = {}, UnityEngine::Quaternion orientation_ = {}, UnityEngine::Experimental::GlobalIllumination::LinearColor color_ = {}, UnityEngine::Experimental::GlobalIllumination::LinearColor indirectColor_ = {}, float range_ = {}, float sphereRadius_ = {}, float coneAngle_ = {}, float innerConeAngle_ = {}, UnityEngine::Experimental::GlobalIllumination::FalloffType falloff_ = {}, UnityEngine::Experimental::GlobalIllumination::AngularFalloffType angularFalloff_ = {}) noexcept : instanceID{instanceID_}, shadow{shadow_}, mode{mode_}, position{position_}, orientation{orientation_}, color{color_}, indirectColor{indirectColor_}, range{range_}, sphereRadius{sphereRadius_}, coneAngle{coneAngle_}, innerConeAngle{innerConeAngle_}, falloff{falloff_}, angularFalloff{angularFalloff_} {}
  }; // UnityEngine.Experimental.GlobalIllumination.SpotLight
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Experimental::GlobalIllumination::SpotLight, "UnityEngine.Experimental.GlobalIllumination", "SpotLight");
#pragma pack(pop)
