// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: BeatmapSaveDataVersion2_6_0AndEarlier.BeatmapSaveData
#include "BeatmapSaveDataVersion2_6_0AndEarlier/BeatmapSaveData.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: BeatmapSaveDataVersion3
namespace BeatmapSaveDataVersion3 {
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: BeatmapSaveDataVersion2_6_0AndEarlier
namespace BeatmapSaveDataVersion2_6_0AndEarlier {
  // Forward declaring type: BeatmapSaveDataItem
  class BeatmapSaveDataItem;
}
// Completed forward declares
// Type namespace: BeatmapSaveDataVersion3
namespace BeatmapSaveDataVersion3 {
  // Forward declaring type: BeatmapSaveData
  class BeatmapSaveData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::BeatmapSaveDataVersion3::BeatmapSaveData);
DEFINE_IL2CPP_ARG_TYPE(::BeatmapSaveDataVersion3::BeatmapSaveData*, "BeatmapSaveDataVersion3", "BeatmapSaveData");
// Type namespace: BeatmapSaveDataVersion3
namespace BeatmapSaveDataVersion3 {
  // Size: 0x89
  #pragma pack(push, 1)
  // Autogenerated type: BeatmapSaveDataVersion3.BeatmapSaveData
  // [TokenAttribute] Offset: FFFFFFFF
  class BeatmapSaveData : public ::Il2CppObject {
    public:
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::BeatmapSaveDataItem
    class BeatmapSaveDataItem;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::BasicEventData
    class BasicEventData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::ColorBoostEventData
    class ColorBoostEventData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::BpmChangeEventData
    class BpmChangeEventData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::ExecutionTime
    struct ExecutionTime;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::RotationEventData
    class RotationEventData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::BasicEventTypesWithKeywords
    class BasicEventTypesWithKeywords;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::EnvironmentColorType
    struct EnvironmentColorType;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::TransitionType
    struct TransitionType;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::Axis
    struct Axis;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::EaseType
    struct EaseType;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::EventBox
    class EventBox;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::IndexFilterRandomType
    struct IndexFilterRandomType;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::IndexFilterLimitAlsoAffectsType
    struct IndexFilterLimitAlsoAffectsType;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::IndexFilter
    class IndexFilter;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::LightColorEventBox
    class LightColorEventBox;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::LightColorBaseData
    class LightColorBaseData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::LightRotationEventBox
    class LightRotationEventBox;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::LightRotationBaseData
    class LightRotationBaseData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::LightTranslationEventBox
    class LightTranslationEventBox;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::LightTranslationBaseData
    class LightTranslationBaseData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::EventBoxGroup
    class EventBoxGroup;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::EventBoxGroup_1<T>
    template<typename T>
    class EventBoxGroup_1;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::LightColorEventBoxGroup
    class LightColorEventBoxGroup;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::LightRotationEventBoxGroup
    class LightRotationEventBoxGroup;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::LightTranslationEventBoxGroup
    class LightTranslationEventBoxGroup;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::NoteColorType
    struct NoteColorType;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::ColorNoteData
    class ColorNoteData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::BombNoteData
    class BombNoteData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::WaypointData
    class WaypointData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::SliderType
    struct SliderType;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::BaseSliderData
    class BaseSliderData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::SliderData
    class SliderData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::BurstSliderData
    class BurstSliderData;
    // Nested type: ::BeatmapSaveDataVersion3::BeatmapSaveData::ObstacleData
    class ObstacleData;
    public:
    // public System.String version
    // Size: 0x8
    // Offset: 0x10
    ::StringW version;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.BpmChangeEventData> bpmEvents
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::BpmChangeEventData*>* bpmEvents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::BpmChangeEventData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.RotationEventData> rotationEvents
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::RotationEventData*>* rotationEvents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::RotationEventData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.ColorNoteData> colorNotes
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::ColorNoteData*>* colorNotes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::ColorNoteData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.BombNoteData> bombNotes
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::BombNoteData*>* bombNotes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::BombNoteData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.ObstacleData> obstacles
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::ObstacleData*>* obstacles;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::ObstacleData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.SliderData> sliders
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::SliderData*>* sliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::SliderData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.BurstSliderData> burstSliders
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::BurstSliderData*>* burstSliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::BurstSliderData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.WaypointData> waypoints
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::WaypointData*>* waypoints;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::WaypointData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.BasicEventData> basicBeatmapEvents
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::BasicEventData*>* basicBeatmapEvents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::BasicEventData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.ColorBoostEventData> colorBoostBeatmapEvents
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::ColorBoostEventData*>* colorBoostBeatmapEvents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::ColorBoostEventData*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.LightColorEventBoxGroup> lightColorEventBoxGroups
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::LightColorEventBoxGroup*>* lightColorEventBoxGroups;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::LightColorEventBoxGroup*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.LightRotationEventBoxGroup> lightRotationEventBoxGroups
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::LightRotationEventBoxGroup*>* lightRotationEventBoxGroups;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::LightRotationEventBoxGroup*>*) == 0x8);
    // public System.Collections.Generic.List`1<BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.LightTranslationEventBoxGroup> lightTranslationEventBoxGroups
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::LightTranslationEventBoxGroup*>* lightTranslationEventBoxGroups;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::BeatmapSaveDataVersion3::BeatmapSaveData::LightTranslationEventBoxGroup*>*) == 0x8);
    // public BeatmapSaveDataVersion3.BeatmapSaveData/BeatmapSaveDataVersion3.BasicEventTypesWithKeywords basicEventTypesWithKeywords
    // Size: 0x8
    // Offset: 0x80
    ::BeatmapSaveDataVersion3::BeatmapSaveData::BasicEventTypesWithKeywords* basicEventTypesWithKeywords;
    // Field size check
    static_assert(sizeof(::BeatmapSaveDataVersion3::BeatmapSaveData::BasicEventTypesWithKeywords*) == 0x8);
    // public System.Boolean useNormalEventsAsCompatibleEvents
    // Size: 0x1
    // Offset: 0x88
    bool useNormalEventsAsCompatibleEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static private System.String kCurrentVersion
    static constexpr const char* kCurrentVersion = "3.2.0";
    // Get static field: static private System.String kCurrentVersion
    static ::StringW _get_kCurrentVersion();
    // Set static field: static private System.String kCurrentVersion
    static void _set_kCurrentVersion(::StringW value);
    // [DoesNotRequireDomainReloadInitAttribute] Offset: 0x10EB3A4
    // Get static field: static private readonly System.Version version2_6_0
    static ::System::Version* _get_version2_6_0();
    // Set static field: static private readonly System.Version version2_6_0
    static void _set_version2_6_0(::System::Version* value);
    // [DoesNotRequireDomainReloadInitAttribute] Offset: 0x10EB3B4
