// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IEquatable`1
#include "System/IEquatable_1.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputStateHistory`1/UnityEngine.InputSystem.LowLevel.Record
#include "UnityEngine/InputSystem/LowLevel/InputStateHistory_1.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.TouchState
#include "UnityEngine/InputSystem/LowLevel/TouchState.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: TouchPhase
  struct TouchPhase;
  // Forward declaring type: Touchscreen
  class Touchscreen;
}
// Forward declaring namespace: UnityEngine::InputSystem::EnhancedTouch
namespace UnityEngine::InputSystem::EnhancedTouch {
  // Forward declaring type: Finger
  class Finger;
  // Forward declaring type: TouchHistory
  struct TouchHistory;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector2 because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Skipping declaration: IEnumerable`1 because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Skipping declaration: InputStateHistory`1 because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.EnhancedTouch
namespace UnityEngine::InputSystem::EnhancedTouch {
  // Forward declaring type: Touch
  struct Touch;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::EnhancedTouch::Touch, "UnityEngine.InputSystem.EnhancedTouch", "Touch");
// Type namespace: UnityEngine.InputSystem.EnhancedTouch
namespace UnityEngine::InputSystem::EnhancedTouch {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.EnhancedTouch.Touch
  // [TokenAttribute] Offset: FFFFFFFF
  struct Touch/*, public ::System::ValueType, public ::System::IEquatable_1<::UnityEngine::InputSystem::EnhancedTouch::Touch>*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::EnhancedTouch::Touch::FingerAndTouchState
    struct FingerAndTouchState;
    // Nested type: ::UnityEngine::InputSystem::EnhancedTouch::Touch::ExtraDataPerTouchState
    struct ExtraDataPerTouchState;
    // Size: 0x40
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.EnhancedTouch.Touch/UnityEngine.InputSystem.EnhancedTouch.FingerAndTouchState
    // [TokenAttribute] Offset: FFFFFFFF
    struct FingerAndTouchState/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.InputSystem.LowLevel.InputUpdateType updateMask
      // Size: 0x4
      // Offset: 0x0
      ::UnityEngine::InputSystem::LowLevel::InputUpdateType updateMask;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputUpdateType) == 0x4);
      // public System.UInt32 updateStepCount
      // Size: 0x4
      // Offset: 0x4
      uint updateStepCount;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public UnityEngine.InputSystem.EnhancedTouch.Finger[] fingers
      // Size: 0x8
      // Offset: 0x8
      ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*> fingers;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*>) == 0x8);
      // public UnityEngine.InputSystem.EnhancedTouch.Finger[] activeFingers
      // Size: 0x8
      // Offset: 0x10
      ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*> activeFingers;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*>) == 0x8);
      // public UnityEngine.InputSystem.EnhancedTouch.Touch[] activeTouches
      // Size: 0x8
      // Offset: 0x18
      ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Touch> activeTouches;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Touch>) == 0x8);
      // public System.Int32 activeFingerCount
      // Size: 0x4
      // Offset: 0x20
      int activeFingerCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 activeTouchCount
      // Size: 0x4
      // Offset: 0x24
      int activeTouchCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 totalFingerCount
      // Size: 0x4
      // Offset: 0x28
      int totalFingerCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.UInt32 lastId
      // Size: 0x4
      // Offset: 0x2C
      uint lastId;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.Boolean haveBuiltActiveTouches
      // Size: 0x1
      // Offset: 0x30
      bool haveBuiltActiveTouches;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: haveBuiltActiveTouches and: activeTouchState
      char __padding9[0x7] = {};
      // public UnityEngine.InputSystem.LowLevel.InputStateHistory`1<UnityEngine.InputSystem.LowLevel.TouchState> activeTouchState
      // Size: 0x8
      // Offset: 0x38
      ::UnityEngine::InputSystem::LowLevel::InputStateHistory_1<::UnityEngine::InputSystem::LowLevel::TouchState>* activeTouchState;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputStateHistory_1<::UnityEngine::InputSystem::LowLevel::TouchState>*) == 0x8);
      public:
      // Creating value type constructor for type: FingerAndTouchState
      constexpr FingerAndTouchState(::UnityEngine::InputSystem::LowLevel::InputUpdateType updateMask_ = {}, uint updateStepCount_ = {}, ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*> fingers_ = ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*> activeFingers_ = ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Touch> activeTouches_ = ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Touch>(static_cast<void*>(nullptr)), int activeFingerCount_ = {}, int activeTouchCount_ = {}, int totalFingerCount_ = {}, uint lastId_ = {}, bool haveBuiltActiveTouches_ = {}, ::UnityEngine::InputSystem::LowLevel::InputStateHistory_1<::UnityEngine::InputSystem::LowLevel::TouchState>* activeTouchState_ = {}) noexcept : updateMask{updateMask_}, updateStepCount{updateStepCount_}, fingers{fingers_}, activeFingers{activeFingers_}, activeTouches{activeTouches_}, activeFingerCount{activeFingerCount_}, activeTouchCount{activeTouchCount_}, totalFingerCount{totalFingerCount_}, lastId{lastId_}, haveBuiltActiveTouches{haveBuiltActiveTouches_}, activeTouchState{activeTouchState_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.InputSystem.LowLevel.InputUpdateType updateMask
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::LowLevel::InputUpdateType& dyn_updateMask();
      // Get instance field reference: public System.UInt32 updateStepCount
      [[deprecated("Use field access instead!")]] uint& dyn_updateStepCount();
      // Get instance field reference: public UnityEngine.InputSystem.EnhancedTouch.Finger[] fingers
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*>& dyn_fingers();
      // Get instance field reference: public UnityEngine.InputSystem.EnhancedTouch.Finger[] activeFingers
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Finger*>& dyn_activeFingers();
      // Get instance field reference: public UnityEngine.InputSystem.EnhancedTouch.Touch[] activeTouches
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::EnhancedTouch::Touch>& dyn_activeTouches();
      // Get instance field reference: public System.Int32 activeFingerCount
      [[deprecated("Use field access instead!")]] int& dyn_activeFingerCount();
      // Get instance field reference: public System.Int32 activeTouchCount
      [[deprecated("Use field access instead!")]] int& dyn_activeTouchCount();
      // Get instance field reference: public System.Int32 totalFingerCount
      [[deprecated("Use field access instead!")]] int& dyn_totalFingerCount();
      // Get instance field reference: public System.UInt32 lastId
      [[deprecated("Use field access instead!")]] uint& dyn_lastId();
      // Get instance field reference: public System.Boolean haveBuiltActiveTouches
      [[deprecated("Use field access instead!")]] bool& dyn_haveBuiltActiveTouches();
      // Get instance field reference: public UnityEngine.InputSystem.LowLevel.InputStateHistory`1<UnityEngine.InputSystem.LowLevel.TouchState> activeTouchState
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::LowLevel::InputStateHistory_1<::UnityEngine::InputSystem::LowLevel::TouchState>*& dyn_activeTouchState();
      // public System.Void AddFingers(UnityEngine.InputSystem.Touchscreen screen)
      // Offset: 0xA44AC8
      void AddFingers(::UnityEngine::InputSystem::Touchscreen* screen);
      // public System.Void RemoveFingers(UnityEngine.InputSystem.Touchscreen screen)
      // Offset: 0xA44AD0
      void RemoveFingers(::UnityEngine::InputSystem::Touchscreen* screen);
      // public System.Void Destroy()
      // Offset: 0xA44AD8
      void Destroy();
      // public System.Void UpdateActiveFingers()
      // Offset: 0xA44AE0
      void UpdateActiveFingers();
      // public System.Void UpdateActiveTouches()
      // Offset: 0xA44AE8
      void UpdateActiveTouches();
    }; // UnityEngine.InputSystem.EnhancedTouch.Touch/UnityEngine.InputSystem.EnhancedTouch.FingerAndTouchState
    #pragma pack(pop)
    static check_size<sizeof(Touch::FingerAndTouchState), 56 + sizeof(::UnityEngine::InputSystem::LowLevel::InputStateHistory_1<::UnityEngine::InputSystem::LowLevel::TouchState>*)> __UnityEngine_InputSystem_EnhancedTouch_Touch_FingerAndTouchStateSizeCheck;
    static_assert(sizeof(Touch::FingerAndTouchState) == 0x40);
    public:
    // private readonly UnityEngine.InputSystem.EnhancedTouch.Finger m_Finger
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::InputSystem::EnhancedTouch::Finger* m_Finger;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::EnhancedTouch::Finger*) == 0x8);
    // UnityEngine.InputSystem.LowLevel.InputStateHistory`1/UnityEngine.InputSystem.LowLevel.Record<UnityEngine.InputSystem.LowLevel.TouchState> m_TouchRecord
    // Size: 0xFFFFFFFF
    // Offset: 0x8
    typename ::UnityEngine::InputSystem::LowLevel::InputStateHistory_1<::UnityEngine::InputSystem::LowLevel::TouchState>::Record m_TouchRecord;
    public:
    // Creating value type constructor for type: Touch
    constexpr Touch(::UnityEngine::InputSystem::EnhancedTouch::Finger* m_Finger_ = {}, typename ::UnityEngine::InputSystem::LowLevel::InputStateHistory_1<::UnityEngine::InputSystem::LowLevel::TouchState>::Record m_TouchRecord_ = {}) noexcept : m_Finger{m_Finger_}, m_TouchRecord{m_TouchRecord_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
