// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ComponentModel.Component
#include "System/ComponentModel/Component.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Diagnostics
namespace System::Diagnostics {
  // Forward declaring type: AsyncStreamReader
  class AsyncStreamReader;
  // Forward declaring type: ProcessThreadCollection
  class ProcessThreadCollection;
  // Forward declaring type: ProcessModuleCollection
  class ProcessModuleCollection;
  // Forward declaring type: ProcessStartInfo
  class ProcessStartInfo;
  // Forward declaring type: ProcessInfo
  class ProcessInfo;
  // Forward declaring type: ProcessThreadTimes
  class ProcessThreadTimes;
}
// Forward declaring namespace: Microsoft::Win32::SafeHandles
namespace Microsoft::Win32::SafeHandles {
  // Forward declaring type: SafeProcessHandle
  class SafeProcessHandle;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: IntPtr
  struct IntPtr;
  // Forward declaring type: TimeSpan
  struct TimeSpan;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: RegisteredWaitHandle
  class RegisteredWaitHandle;
  // Forward declaring type: WaitHandle
  class WaitHandle;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: ISynchronizeInvoke
  class ISynchronizeInvoke;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: StreamReader
  class StreamReader;
  // Forward declaring type: StreamWriter
  class StreamWriter;
}
// Completed forward declares
// Type namespace: System.Diagnostics
namespace System::Diagnostics {
  // Forward declaring type: Process
  class Process;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Diagnostics::Process);
DEFINE_IL2CPP_ARG_TYPE(System::Diagnostics::Process*, "System.Diagnostics", "Process");
// Type namespace: System.Diagnostics
namespace System::Diagnostics {
  // Size: 0xF0
  #pragma pack(push, 1)
  // Autogenerated type: System.Diagnostics.Process
  // [TokenAttribute] Offset: FFFFFFFF
  // [MonitoringDescriptionAttribute] Offset: EAA79C
  // [DefaultEventAttribute] Offset: EAA79C
  // [DefaultPropertyAttribute] Offset: EAA79C
  // [DesignerAttribute] Offset: EAA79C
  class Process : public System::ComponentModel::Component {
    public:
    // Nested type: System::Diagnostics::Process::StreamReadMode
    struct StreamReadMode;
    // Nested type: System::Diagnostics::Process::State
    struct State;
    // Nested type: System::Diagnostics::Process::ProcInfo
    struct ProcInfo;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Diagnostics.Process/System.Diagnostics.StreamReadMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct StreamReadMode/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StreamReadMode
      constexpr StreamReadMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Diagnostics.Process/System.Diagnostics.StreamReadMode undefined
      static constexpr const int undefined = 0;
      // Get static field: static public System.Diagnostics.Process/System.Diagnostics.StreamReadMode undefined
      static System::Diagnostics::Process::StreamReadMode _get_undefined();
      // Set static field: static public System.Diagnostics.Process/System.Diagnostics.StreamReadMode undefined
      static void _set_undefined(System::Diagnostics::Process::StreamReadMode value);
      // static field const value: static public System.Diagnostics.Process/System.Diagnostics.StreamReadMode syncMode
      static constexpr const int syncMode = 1;
      // Get static field: static public System.Diagnostics.Process/System.Diagnostics.StreamReadMode syncMode
      static System::Diagnostics::Process::StreamReadMode _get_syncMode();
      // Set static field: static public System.Diagnostics.Process/System.Diagnostics.StreamReadMode syncMode
      static void _set_syncMode(System::Diagnostics::Process::StreamReadMode value);
      // static field const value: static public System.Diagnostics.Process/System.Diagnostics.StreamReadMode asyncMode
      static constexpr const int asyncMode = 2;
      // Get static field: static public System.Diagnostics.Process/System.Diagnostics.StreamReadMode asyncMode
      static System::Diagnostics::Process::StreamReadMode _get_asyncMode();
      // Set static field: static public System.Diagnostics.Process/System.Diagnostics.StreamReadMode asyncMode
      static void _set_asyncMode(System::Diagnostics::Process::StreamReadMode value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Diagnostics.Process/System.Diagnostics.StreamReadMode
    #pragma pack(pop)
    static check_size<sizeof(Process::StreamReadMode), 0 + sizeof(int)> __System_Diagnostics_Process_StreamReadModeSizeCheck;
    static_assert(sizeof(Process::StreamReadMode) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean haveProcessId
    // Size: 0x1
    // Offset: 0x28
    bool haveProcessId;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: haveProcessId and: processId
    char __padding0[0x3] = {};
    // private System.Int32 processId
    // Size: 0x4
    // Offset: 0x2C
    int processId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean haveProcessHandle
    // Size: 0x1
    // Offset: 0x30
    bool haveProcessHandle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: haveProcessHandle and: m_processHandle
    char __padding2[0x7] = {};
    // private Microsoft.Win32.SafeHandles.SafeProcessHandle m_processHandle
    // Size: 0x8
    // Offset: 0x38
    Microsoft::Win32::SafeHandles::SafeProcessHandle* m_processHandle;
    // Field size check
    static_assert(sizeof(Microsoft::Win32::SafeHandles::SafeProcessHandle*) == 0x8);
    // private System.Boolean isRemoteMachine
    // Size: 0x1
    // Offset: 0x40
    bool isRemoteMachine;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isRemoteMachine and: machineName
    char __padding4[0x7] = {};
    // private System.String machineName
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* machineName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Int32 m_processAccess
    // Size: 0x4
    // Offset: 0x50
    int m_processAccess;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_processAccess and: threads
    char __padding6[0x4] = {};
    // private System.Diagnostics.ProcessThreadCollection threads
    // Size: 0x8
    // Offset: 0x58
    System::Diagnostics::ProcessThreadCollection* threads;
    // Field size check
    static_assert(sizeof(System::Diagnostics::ProcessThreadCollection*) == 0x8);
    // private System.Diagnostics.ProcessModuleCollection modules
    // Size: 0x8
    // Offset: 0x60
    System::Diagnostics::ProcessModuleCollection* modules;
    // Field size check
    static_assert(sizeof(System::Diagnostics::ProcessModuleCollection*) == 0x8);
    // private System.Boolean haveWorkingSetLimits
    // Size: 0x1
    // Offset: 0x68
    bool haveWorkingSetLimits;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean havePriorityClass
    // Size: 0x1
    // Offset: 0x69
    bool havePriorityClass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: havePriorityClass and: startInfo
    char __padding10[0x6] = {};
    // private System.Diagnostics.ProcessStartInfo startInfo
    // Size: 0x8
    // Offset: 0x70
    System::Diagnostics::ProcessStartInfo* startInfo;
    // Field size check
    static_assert(sizeof(System::Diagnostics::ProcessStartInfo*) == 0x8);
    // private System.Boolean watchForExit
    // Size: 0x1
    // Offset: 0x78
    bool watchForExit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean watchingForExit
    // Size: 0x1
    // Offset: 0x79
    bool watchingForExit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: watchingForExit and: onExited
    char __padding13[0x6] = {};
    // private System.EventHandler onExited
    // Size: 0x8
    // Offset: 0x80
    System::EventHandler* onExited;
    // Field size check
    static_assert(sizeof(System::EventHandler*) == 0x8);
    // private System.Boolean exited
    // Size: 0x1
    // Offset: 0x88
    bool exited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: exited and: exitCode
    char __padding15[0x3] = {};
    // private System.Int32 exitCode
    // Size: 0x4
    // Offset: 0x8C
    int exitCode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean signaled
    // Size: 0x1
    // Offset: 0x90
    bool signaled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean haveExitTime
    // Size: 0x1
    // Offset: 0x91
    bool haveExitTime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean raisedOnExited
    // Size: 0x1
    // Offset: 0x92
    bool raisedOnExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: raisedOnExited and: registeredWaitHandle
    char __padding19[0x5] = {};
    // private System.Threading.RegisteredWaitHandle registeredWaitHandle
    // Size: 0x8
    // Offset: 0x98
    System::Threading::RegisteredWaitHandle* registeredWaitHandle;
    // Field size check
    static_assert(sizeof(System::Threading::RegisteredWaitHandle*) == 0x8);
    // private System.Threading.WaitHandle waitHandle
    // Size: 0x8
    // Offset: 0xA0
    System::Threading::WaitHandle* waitHandle;
    // Field size check
    static_assert(sizeof(System::Threading::WaitHandle*) == 0x8);
    // private System.ComponentModel.ISynchronizeInvoke synchronizingObject
    // Size: 0x8
    // Offset: 0xA8
    System::ComponentModel::ISynchronizeInvoke* synchronizingObject;
    // Field size check
    static_assert(sizeof(System::ComponentModel::ISynchronizeInvoke*) == 0x8);
    // private System.IO.StreamReader standardOutput
    // Size: 0x8
    // Offset: 0xB0
    System::IO::StreamReader* standardOutput;
    // Field size check
    static_assert(sizeof(System::IO::StreamReader*) == 0x8);
    // private System.IO.StreamWriter standardInput
    // Size: 0x8
    // Offset: 0xB8
    System::IO::StreamWriter* standardInput;
    // Field size check
    static_assert(sizeof(System::IO::StreamWriter*) == 0x8);
    // private System.IO.StreamReader standardError
    // Size: 0x8
    // Offset: 0xC0
    System::IO::StreamReader* standardError;
    // Field size check
    static_assert(sizeof(System::IO::StreamReader*) == 0x8);
    // private System.Boolean disposed
    // Size: 0x1
    // Offset: 0xC8
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disposed and: outputStreamReadMode
    char __padding26[0x3] = {};
    // private System.Diagnostics.Process/System.Diagnostics.StreamReadMode outputStreamReadMode
    // Size: 0x4
    // Offset: 0xCC
    System::Diagnostics::Process::StreamReadMode outputStreamReadMode;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Process::StreamReadMode) == 0x4);
    // private System.Diagnostics.Process/System.Diagnostics.StreamReadMode errorStreamReadMode
    // Size: 0x4
    // Offset: 0xD0
    System::Diagnostics::Process::StreamReadMode errorStreamReadMode;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Process::StreamReadMode) == 0x4);
    // private System.Diagnostics.Process/System.Diagnostics.StreamReadMode inputStreamReadMode
    // Size: 0x4
    // Offset: 0xD4
    System::Diagnostics::Process::StreamReadMode inputStreamReadMode;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Process::StreamReadMode) == 0x4);
    // System.Diagnostics.AsyncStreamReader output
    // Size: 0x8
    // Offset: 0xD8
    System::Diagnostics::AsyncStreamReader* output;
    // Field size check
    static_assert(sizeof(System::Diagnostics::AsyncStreamReader*) == 0x8);
    // System.Diagnostics.AsyncStreamReader error
    // Size: 0x8
    // Offset: 0xE0
    System::Diagnostics::AsyncStreamReader* error;
    // Field size check
    static_assert(sizeof(System::Diagnostics::AsyncStreamReader*) == 0x8);
    // private System.String process_name
    // Size: 0x8
    // Offset: 0xE8
    ::Il2CppString* process_name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    public:
    // Get instance field reference: private System.Boolean haveProcessId
    bool& dyn_haveProcessId();
    // Get instance field reference: private System.Int32 processId
    int& dyn_processId();
    // Get instance field reference: private System.Boolean haveProcessHandle
    bool& dyn_haveProcessHandle();
    // Get instance field reference: private Microsoft.Win32.SafeHandles.SafeProcessHandle m_processHandle
    Microsoft::Win32::SafeHandles::SafeProcessHandle*& dyn_m_processHandle();
    // Get instance field reference: private System.Boolean isRemoteMachine
    bool& dyn_isRemoteMachine();
    // Get instance field reference: private System.String machineName
    ::Il2CppString*& dyn_machineName();
    // Get instance field reference: private System.Int32 m_processAccess
    int& dyn_m_processAccess();
