// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Int32
#include "System/Int32.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: MethodBase
  class MethodBase;
}
// Completed forward declares
// Type namespace: System.Diagnostics
namespace System::Diagnostics {
  // Autogenerated type: System.Diagnostics.StackFrame
  class StackFrame : public ::CsObject {
    public:
    // static field const value: static public System.Int32 OFFSET_UNKNOWN
    static constexpr const int OFFSET_UNKNOWN = -1;
    // Get static field: static public System.Int32 OFFSET_UNKNOWN
    static int _get_OFFSET_UNKNOWN();
    // Set static field: static public System.Int32 OFFSET_UNKNOWN
    static void _set_OFFSET_UNKNOWN(int value);
    // private System.Int32 ilOffset
    // Offset: 0x10
    int ilOffset;
    // private System.Int32 nativeOffset
    // Offset: 0x14
    int nativeOffset;
    // private System.Int64 methodAddress
    // Offset: 0x18
    int64_t methodAddress;
    // private System.UInt32 methodIndex
    // Offset: 0x20
    uint methodIndex;
    // private System.Reflection.MethodBase methodBase
    // Offset: 0x28
    System::Reflection::MethodBase* methodBase;
    // private System.String fileName
    // Offset: 0x30
    ::CsString* fileName;
    // private System.Int32 lineNumber
    // Offset: 0x38
    int lineNumber;
    // private System.Int32 columnNumber
    // Offset: 0x3C
    int columnNumber;
    // private System.String internalMethodName
    // Offset: 0x40
    ::CsString* internalMethodName;
    // static private System.Boolean get_frame_info(System.Int32 skip, System.Boolean needFileInfo, System.Reflection.MethodBase method, System.Int32 iloffset, System.Int32 native_offset, System.String file, System.Int32 line, System.Int32 column)
    // Offset: 0xC920B4
    static bool get_frame_info(int skip, bool needFileInfo, System::Reflection::MethodBase*& method, int& iloffset, int& native_offset, ::CsString*& file, int& line, int& column);
    // public System.Void .ctor(System.Int32 skipFrames, System.Boolean fNeedFileInfo)
    // Offset: 0xC92118
    static StackFrame* New_ctor(int skipFrames, bool fNeedFileInfo);
    // public System.Int32 GetFileLineNumber()
    // Offset: 0xC92184
    int GetFileLineNumber();
    // public System.String GetFileName()
    // Offset: 0xC9218C
    ::CsString* GetFileName();
    // System.String GetSecureFileName()
    // Offset: 0xC92194
    ::CsString* GetSecureFileName();
    // public System.Int32 GetILOffset()
    // Offset: 0xC92270
    int GetILOffset();
    // public System.Reflection.MethodBase GetMethod()
    // Offset: 0xC92278
    System::Reflection::MethodBase* GetMethod();
    // public System.Int32 GetNativeOffset()
    // Offset: 0xC92280
    int GetNativeOffset();
    // System.Int64 GetMethodAddress()
    // Offset: 0xC92288
    int64_t GetMethodAddress();
    // System.UInt32 GetMethodIndex()
    // Offset: 0xC92290
    uint GetMethodIndex();
    // System.String GetInternalMethodName()
    // Offset: 0xC92298
    ::CsString* GetInternalMethodName();
    // public System.Void .ctor()
    // Offset: 0xC920BC
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static StackFrame* New_ctor();
    // public override System.String ToString()
    // Offset: 0xC922A0
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::CsString* ToString();
  }; // System.Diagnostics.StackFrame
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Diagnostics::StackFrame*, "System.Diagnostics", "StackFrame");
#pragma pack(pop)
