// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabRequestCommon
#include "PlayFab/SharedModels/PlayFabRequestCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PlayFab::MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Forward declaring type: MatchmakingPlayer
  class MatchmakingPlayer;
  // Forward declaring type: EntityKey
  class EntityKey;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: PlayFab.MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Forward declaring type: CreateMatchmakingTicketRequest
  class CreateMatchmakingTicketRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::MultiplayerModels::CreateMatchmakingTicketRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::MultiplayerModels::CreateMatchmakingTicketRequest*, "PlayFab.MultiplayerModels", "CreateMatchmakingTicketRequest");
// Type namespace: PlayFab.MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.MultiplayerModels.CreateMatchmakingTicketRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class CreateMatchmakingTicketRequest : public ::PlayFab::SharedModels::PlayFabRequestCommon {
    public:
    public:
    // public PlayFab.MultiplayerModels.MatchmakingPlayer Creator
    // Size: 0x8
    // Offset: 0x18
    ::PlayFab::MultiplayerModels::MatchmakingPlayer* Creator;
    // Field size check
    static_assert(sizeof(::PlayFab::MultiplayerModels::MatchmakingPlayer*) == 0x8);
    // public System.Int32 GiveUpAfterSeconds
    // Size: 0x4
    // Offset: 0x20
    int GiveUpAfterSeconds;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: GiveUpAfterSeconds and: MembersToMatchWith
    char __padding1[0x4] = {};
    // public System.Collections.Generic.List`1<PlayFab.MultiplayerModels.EntityKey> MembersToMatchWith
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::PlayFab::MultiplayerModels::EntityKey*>* MembersToMatchWith;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PlayFab::MultiplayerModels::EntityKey*>*) == 0x8);
    // public System.String QueueName
    // Size: 0x8
    // Offset: 0x30
    ::StringW QueueName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public PlayFab.MultiplayerModels.MatchmakingPlayer Creator
    [[deprecated("Use field access instead!")]] ::PlayFab::MultiplayerModels::MatchmakingPlayer*& dyn_Creator();
    // Get instance field reference: public System.Int32 GiveUpAfterSeconds
    [[deprecated("Use field access instead!")]] int& dyn_GiveUpAfterSeconds();
    // Get instance field reference: public System.Collections.Generic.List`1<PlayFab.MultiplayerModels.EntityKey> MembersToMatchWith
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::PlayFab::MultiplayerModels::EntityKey*>*& dyn_MembersToMatchWith();
    // Get instance field reference: public System.String QueueName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_QueueName();
    // public System.Void .ctor()
    // Offset: 0xBCCFA8
    // Implemented from: PlayFab.SharedModels.PlayFabRequestCommon
    // Base method: System.Void PlayFabRequestCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CreateMatchmakingTicketRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::MultiplayerModels::CreateMatchmakingTicketRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CreateMatchmakingTicketRequest*, creationType>()));
    }
  }; // PlayFab.MultiplayerModels.CreateMatchmakingTicketRequest
  #pragma pack(pop)
  static check_size<sizeof(CreateMatchmakingTicketRequest), 48 + sizeof(::StringW)> __PlayFab_MultiplayerModels_CreateMatchmakingTicketRequestSizeCheck;
  static_assert(sizeof(CreateMatchmakingTicketRequest) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::MultiplayerModels::CreateMatchmakingTicketRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
