// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabRequestCommon
#include "PlayFab/SharedModels/PlayFabRequestCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Forward declaring type: GetMatchRequest
  class GetMatchRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::MultiplayerModels::GetMatchRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::MultiplayerModels::GetMatchRequest*, "PlayFab.MultiplayerModels", "GetMatchRequest");
// Type namespace: PlayFab.MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Size: 0x31
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.MultiplayerModels.GetMatchRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class GetMatchRequest : public ::PlayFab::SharedModels::PlayFabRequestCommon {
    public:
    public:
    // public System.Boolean EscapeObject
    // Size: 0x1
    // Offset: 0x18
    bool EscapeObject;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EscapeObject and: MatchId
    char __padding0[0x7] = {};
    // public System.String MatchId
    // Size: 0x8
    // Offset: 0x20
    ::StringW MatchId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String QueueName
    // Size: 0x8
    // Offset: 0x28
    ::StringW QueueName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean ReturnMemberAttributes
    // Size: 0x1
    // Offset: 0x30
    bool ReturnMemberAttributes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public System.Boolean EscapeObject
    [[deprecated("Use field access instead!")]] bool& dyn_EscapeObject();
    // Get instance field reference: public System.String MatchId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_MatchId();
    // Get instance field reference: public System.String QueueName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_QueueName();
    // Get instance field reference: public System.Boolean ReturnMemberAttributes
    [[deprecated("Use field access instead!")]] bool& dyn_ReturnMemberAttributes();
    // public System.Void .ctor()
    // Offset: 0xBCD0C8
    // Implemented from: PlayFab.SharedModels.PlayFabRequestCommon
    // Base method: System.Void PlayFabRequestCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GetMatchRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::MultiplayerModels::GetMatchRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GetMatchRequest*, creationType>()));
    }
  }; // PlayFab.MultiplayerModels.GetMatchRequest
  #pragma pack(pop)
  static check_size<sizeof(GetMatchRequest), 48 + sizeof(bool)> __PlayFab_MultiplayerModels_GetMatchRequestSizeCheck;
  static_assert(sizeof(GetMatchRequest) == 0x31);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::MultiplayerModels::GetMatchRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
