// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabRequestCommon
#include "PlayFab/SharedModels/PlayFabRequestCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PlayFab::MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Forward declaring type: BuildAliasParams
  class BuildAliasParams;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: PlayFab.MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Forward declaring type: RequestMultiplayerServerRequest
  class RequestMultiplayerServerRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::MultiplayerModels::RequestMultiplayerServerRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::MultiplayerModels::RequestMultiplayerServerRequest*, "PlayFab.MultiplayerModels", "RequestMultiplayerServerRequest");
// Type namespace: PlayFab.MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.MultiplayerModels.RequestMultiplayerServerRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class RequestMultiplayerServerRequest : public ::PlayFab::SharedModels::PlayFabRequestCommon {
    public:
    public:
    // public PlayFab.MultiplayerModels.BuildAliasParams BuildAliasParams
    // Size: 0x8
    // Offset: 0x18
    ::PlayFab::MultiplayerModels::BuildAliasParams* BuildAliasParams;
    // Field size check
    static_assert(sizeof(::PlayFab::MultiplayerModels::BuildAliasParams*) == 0x8);
    // public System.String BuildId
    // Size: 0x8
    // Offset: 0x20
    ::StringW BuildId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.List`1<System.String> InitialPlayers
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::StringW>* InitialPlayers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> PreferredRegions
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::StringW>* PreferredRegions;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.String SessionCookie
    // Size: 0x8
    // Offset: 0x38
    ::StringW SessionCookie;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String SessionId
    // Size: 0x8
    // Offset: 0x40
    ::StringW SessionId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public PlayFab.MultiplayerModels.BuildAliasParams BuildAliasParams
    [[deprecated("Use field access instead!")]] ::PlayFab::MultiplayerModels::BuildAliasParams*& dyn_BuildAliasParams();
    // Get instance field reference: public System.String BuildId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_BuildId();
    // Get instance field reference: public System.Collections.Generic.List`1<System.String> InitialPlayers
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::StringW>*& dyn_InitialPlayers();
    // Get instance field reference: public System.Collections.Generic.List`1<System.String> PreferredRegions
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::StringW>*& dyn_PreferredRegions();
    // Get instance field reference: public System.String SessionCookie
    [[deprecated("Use field access instead!")]] ::StringW& dyn_SessionCookie();
    // Get instance field reference: public System.String SessionId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_SessionId();
    // public System.Void .ctor()
    // Offset: 0xBCD310
    // Implemented from: PlayFab.SharedModels.PlayFabRequestCommon
    // Base method: System.Void PlayFabRequestCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RequestMultiplayerServerRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::MultiplayerModels::RequestMultiplayerServerRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RequestMultiplayerServerRequest*, creationType>()));
    }
  }; // PlayFab.MultiplayerModels.RequestMultiplayerServerRequest
  #pragma pack(pop)
  static check_size<sizeof(RequestMultiplayerServerRequest), 64 + sizeof(::StringW)> __PlayFab_MultiplayerModels_RequestMultiplayerServerRequestSizeCheck;
  static_assert(sizeof(RequestMultiplayerServerRequest) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::MultiplayerModels::RequestMultiplayerServerRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
