// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PlayFab::MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Forward declaring type: QueueRuleAttribute
  class QueueRuleAttribute;
  // Forward declaring type: CustomTeamDifferenceRuleExpansion
  class CustomTeamDifferenceRuleExpansion;
  // Forward declaring type: LinearTeamDifferenceRuleExpansion
  class LinearTeamDifferenceRuleExpansion;
}
// Completed forward declares
// Type namespace: PlayFab.MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // Forward declaring type: TeamDifferenceRule
  class TeamDifferenceRule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::MultiplayerModels::TeamDifferenceRule);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::MultiplayerModels::TeamDifferenceRule*, "PlayFab.MultiplayerModels", "TeamDifferenceRule");
// Type namespace: PlayFab.MultiplayerModels
namespace PlayFab::MultiplayerModels {
  // WARNING Size may be invalid!
  // Autogenerated type: PlayFab.MultiplayerModels.TeamDifferenceRule
  // [TokenAttribute] Offset: FFFFFFFF
  class TeamDifferenceRule : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public PlayFab.MultiplayerModels.QueueRuleAttribute Attribute
    // Size: 0x8
    // Offset: 0x10
    ::PlayFab::MultiplayerModels::QueueRuleAttribute* Attribute;
    // Field size check
    static_assert(sizeof(::PlayFab::MultiplayerModels::QueueRuleAttribute*) == 0x8);
    // public PlayFab.MultiplayerModels.CustomTeamDifferenceRuleExpansion CustomExpansion
    // Size: 0x8
    // Offset: 0x18
    ::PlayFab::MultiplayerModels::CustomTeamDifferenceRuleExpansion* CustomExpansion;
    // Field size check
    static_assert(sizeof(::PlayFab::MultiplayerModels::CustomTeamDifferenceRuleExpansion*) == 0x8);
    // public System.Double DefaultAttributeValue
    // Size: 0x8
    // Offset: 0x20
    double DefaultAttributeValue;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Double Difference
    // Size: 0x8
    // Offset: 0x28
    double Difference;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public PlayFab.MultiplayerModels.LinearTeamDifferenceRuleExpansion LinearExpansion
    // Size: 0x8
    // Offset: 0x30
    ::PlayFab::MultiplayerModels::LinearTeamDifferenceRuleExpansion* LinearExpansion;
    // Field size check
    static_assert(sizeof(::PlayFab::MultiplayerModels::LinearTeamDifferenceRuleExpansion*) == 0x8);
    // public System.String Name
    // Size: 0x8
    // Offset: 0x38
    ::StringW Name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Nullable`1<System.UInt32> SecondsUntilOptional
    // Size: 0xFFFFFFFF
    // Offset: 0x40
    ::System::Nullable_1<uint> SecondsUntilOptional;
    public:
    // Get instance field reference: public PlayFab.MultiplayerModels.QueueRuleAttribute Attribute
    [[deprecated("Use field access instead!")]] ::PlayFab::MultiplayerModels::QueueRuleAttribute*& dyn_Attribute();
    // Get instance field reference: public PlayFab.MultiplayerModels.CustomTeamDifferenceRuleExpansion CustomExpansion
    [[deprecated("Use field access instead!")]] ::PlayFab::MultiplayerModels::CustomTeamDifferenceRuleExpansion*& dyn_CustomExpansion();
    // Get instance field reference: public System.Double DefaultAttributeValue
    [[deprecated("Use field access instead!")]] double& dyn_DefaultAttributeValue();
    // Get instance field reference: public System.Double Difference
    [[deprecated("Use field access instead!")]] double& dyn_Difference();
    // Get instance field reference: public PlayFab.MultiplayerModels.LinearTeamDifferenceRuleExpansion LinearExpansion
    [[deprecated("Use field access instead!")]] ::PlayFab::MultiplayerModels::LinearTeamDifferenceRuleExpansion*& dyn_LinearExpansion();
    // Get instance field reference: public System.String Name
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Name();
    // Get instance field reference: public System.Nullable`1<System.UInt32> SecondsUntilOptional
    [[deprecated("Use field access instead!")]] ::System::Nullable_1<uint>& dyn_SecondsUntilOptional();
    // public System.Void .ctor()
    // Offset: 0xBCD378
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TeamDifferenceRule* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::MultiplayerModels::TeamDifferenceRule::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TeamDifferenceRule*, creationType>()));
    }
  }; // PlayFab.MultiplayerModels.TeamDifferenceRule
  // WARNING Not writing size check since size may be invalid!
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::MultiplayerModels::TeamDifferenceRule::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
