// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Org.BouncyCastle.Crypto.Modes.IAeadBlockCipher
#include "Org/BouncyCastle/Crypto/Modes/IAeadBlockCipher.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Org::BouncyCastle::Crypto
namespace Org::BouncyCastle::Crypto {
  // Forward declaring type: IBlockCipher
  class IBlockCipher;
  // Forward declaring type: ICipherParameters
  class ICipherParameters;
}
// Forward declaring namespace: Org::BouncyCastle::Crypto::Modes::Gcm
namespace Org::BouncyCastle::Crypto::Modes::Gcm {
  // Forward declaring type: IGcmMultiplier
  class IGcmMultiplier;
  // Forward declaring type: IGcmExponentiator
  class IGcmExponentiator;
}
// Completed forward declares
// Type namespace: Org.BouncyCastle.Crypto.Modes
namespace Org::BouncyCastle::Crypto::Modes {
  // Size: 0xB8
  #pragma pack(push, 1)
  // Autogenerated type: Org.BouncyCastle.Crypto.Modes.GcmBlockCipher
  // [TokenAttribute] Offset: FFFFFFFF
  class GcmBlockCipher : public ::Il2CppObject/*, public Org::BouncyCastle::Crypto::Modes::IAeadBlockCipher*/ {
    public:
    // private readonly Org.BouncyCastle.Crypto.IBlockCipher cipher
    // Size: 0x8
    // Offset: 0x10
    Org::BouncyCastle::Crypto::IBlockCipher* cipher;
    // Field size check
    static_assert(sizeof(Org::BouncyCastle::Crypto::IBlockCipher*) == 0x8);
    // private readonly Org.BouncyCastle.Crypto.Modes.Gcm.IGcmMultiplier multiplier
    // Size: 0x8
    // Offset: 0x18
    Org::BouncyCastle::Crypto::Modes::Gcm::IGcmMultiplier* multiplier;
    // Field size check
    static_assert(sizeof(Org::BouncyCastle::Crypto::Modes::Gcm::IGcmMultiplier*) == 0x8);
    // private Org.BouncyCastle.Crypto.Modes.Gcm.IGcmExponentiator exp
    // Size: 0x8
    // Offset: 0x20
    Org::BouncyCastle::Crypto::Modes::Gcm::IGcmExponentiator* exp;
    // Field size check
    static_assert(sizeof(Org::BouncyCastle::Crypto::Modes::Gcm::IGcmExponentiator*) == 0x8);
    // private System.Boolean forEncryption
    // Size: 0x1
    // Offset: 0x28
    bool forEncryption;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean initialised
    // Size: 0x1
    // Offset: 0x29
    bool initialised;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: initialised and: macSize
    char __padding4[0x2] = {};
    // private System.Int32 macSize
    // Size: 0x4
    // Offset: 0x2C
    int macSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Byte[] lastKey
    // Size: 0x8
    // Offset: 0x30
    ::Array<uint8_t>* lastKey;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] nonce
    // Size: 0x8
    // Offset: 0x38
    ::Array<uint8_t>* nonce;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] initialAssociatedText
    // Size: 0x8
    // Offset: 0x40
    ::Array<uint8_t>* initialAssociatedText;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] H
    // Size: 0x8
    // Offset: 0x48
    ::Array<uint8_t>* H;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] J0
    // Size: 0x8
    // Offset: 0x50
    ::Array<uint8_t>* J0;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] bufBlock
    // Size: 0x8
    // Offset: 0x58
    ::Array<uint8_t>* bufBlock;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] macBlock
    // Size: 0x8
    // Offset: 0x60
    ::Array<uint8_t>* macBlock;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] S
    // Size: 0x8
    // Offset: 0x68
    ::Array<uint8_t>* S;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] S_at
    // Size: 0x8
    // Offset: 0x70
    ::Array<uint8_t>* S_at;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] S_atPre
    // Size: 0x8
    // Offset: 0x78
    ::Array<uint8_t>* S_atPre;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] counter
    // Size: 0x8
    // Offset: 0x80
    ::Array<uint8_t>* counter;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.UInt32 blocksRemaining
    // Size: 0x4
    // Offset: 0x88
    uint blocksRemaining;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Int32 bufOff
    // Size: 0x4
    // Offset: 0x8C
    int bufOff;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.UInt64 totalLength
    // Size: 0x8
    // Offset: 0x90
    uint64_t totalLength;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.Byte[] atBlock
    // Size: 0x8
    // Offset: 0x98
    ::Array<uint8_t>* atBlock;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Int32 atBlockPos
    // Size: 0x4
    // Offset: 0xA0
    int atBlockPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: atBlockPos and: atLength
    char __padding21[0x4] = {};
    // private System.UInt64 atLength
    // Size: 0x8
    // Offset: 0xA8
    uint64_t atLength;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.UInt64 atLengthPre
    // Size: 0x8
    // Offset: 0xB0
    uint64_t atLengthPre;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // Creating value type constructor for type: GcmBlockCipher
