// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Voice.AudioOutDelayControl
#include "Photon/Voice/AudioOutDelayControl.hpp"
// Including type: Photon.Voice.IAudioOut`1
#include "Photon/Voice/IAudioOut_1.hpp"
// Including type: Photon.Voice.AudioUtil
#include "Photon/Voice/AudioUtil.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice
namespace Photon::Voice {
  // Forward declaring type: ILogger
  class ILogger;
  // Forward declaring type: PrimitiveArrayPool`1<T>
  template<typename T>
  class PrimitiveArrayPool_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Completed forward declares
// Type namespace: Photon.Voice
namespace Photon::Voice {
  // Forward declaring type: AudioOutDelayControl`1<T>
  template<typename T>
  class AudioOutDelayControl_1;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(::Photon::Voice::AudioOutDelayControl_1, "Photon.Voice", "AudioOutDelayControl`1");
// Type namespace: Photon.Voice
namespace Photon::Voice {
  // WARNING Size may be invalid!
  // Autogenerated type: Photon.Voice.AudioOutDelayControl`1
  // [TokenAttribute] Offset: FFFFFFFF
  template<typename T>
  class AudioOutDelayControl_1 : public ::Photon::Voice::AudioOutDelayControl/*, public ::Photon::Voice::IAudioOut_1<T>*/ {
    public:
    public:
    // private readonly System.Int32 sizeofT
    // Size: 0x4
    // Offset: 0x0
    int sizeofT;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 frameSamples
    // Size: 0x4
    // Offset: 0x0
    int frameSamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 frameSize
    // Size: 0x4
    // Offset: 0x0
    int frameSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 bufferSamples
    // Size: 0x4
    // Offset: 0x0
    int bufferSamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 frequency
    // Size: 0x4
    // Offset: 0x0
    int frequency;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 clipWriteSamplePos
    // Size: 0x4
    // Offset: 0x0
    int clipWriteSamplePos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 playSamplePosPrev
    // Size: 0x4
    // Offset: 0x0
    int playSamplePosPrev;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 sourceTimeSamplesPrev
    // Size: 0x4
    // Offset: 0x0
    int sourceTimeSamplesPrev;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 playLoopCount
    // Size: 0x4
    // Offset: 0x0
    int playLoopCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Photon.Voice.AudioOutDelayControl/Photon.Voice.PlayDelayConfig playDelayConfig
    // Size: 0x8
    // Offset: 0x0
    ::Photon::Voice::AudioOutDelayControl::PlayDelayConfig* playDelayConfig;
    // Field size check
    static_assert(sizeof(::Photon::Voice::AudioOutDelayControl::PlayDelayConfig*) == 0x8);
    // protected System.Int32 channels
    // Size: 0x4
    // Offset: 0x0
    int channels;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean started
    // Size: 0x1
    // Offset: 0x0
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean flushed
    // Size: 0x1
    // Offset: 0x0
    bool flushed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 targetDelaySamples
    // Size: 0x4
    // Offset: 0x0
    int targetDelaySamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 upperTargetDelaySamples
    // Size: 0x4
    // Offset: 0x0
    int upperTargetDelaySamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 maxDelaySamples
    // Size: 0x4
    // Offset: 0x0
    int maxDelaySamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 lastPushTime
    // Size: 0x4
    // Offset: 0x0
    int lastPushTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected readonly Photon.Voice.ILogger logger
    // Size: 0x8
    // Offset: 0x0
    ::Photon::Voice::ILogger* logger;
    // Field size check
    static_assert(sizeof(::Photon::Voice::ILogger*) == 0x8);
    // protected readonly System.String logPrefix
    // Size: 0x8
    // Offset: 0x0
    ::StringW logPrefix;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.Boolean debugInfo
    // Size: 0x1
    // Offset: 0x0
    bool debugInfo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.Boolean processInService
    // Size: 0x1
    // Offset: 0x0
    bool processInService;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private T[] zeroFrame
    // Size: 0x8
    // Offset: 0x0
    ::ArrayW<T> zeroFrame;
    // Field size check
    static_assert(sizeof(::ArrayW<T>) == 0x8);
    // private T[] resampledFrame
    // Size: 0x8
    // Offset: 0x0
    ::ArrayW<T> resampledFrame;
    // Field size check
    static_assert(sizeof(::ArrayW<T>) == 0x8);
    // private Photon.Voice.AudioUtil/Photon.Voice.TempoUp`1<T> tempoUp
    // Size: 0x8
    // Offset: 0x0
    ::Photon::Voice::AudioUtil::TempoUp_1<T>* tempoUp;
    // Field size check
    static_assert(sizeof(::Photon::Voice::AudioUtil::TempoUp_1<T>*) == 0x8);
    // private System.Boolean tempoChangeHQ
    // Size: 0x1
    // Offset: 0x0
    bool tempoChangeHQ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Collections.Generic.Queue`1<T[]> frameQueue
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::Queue_1<::ArrayW<T>>* frameQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::ArrayW<T>>*) == 0x8);
    // private Photon.Voice.PrimitiveArrayPool`1<T> framePool
    // Size: 0x8
    // Offset: 0x0
    ::Photon::Voice::PrimitiveArrayPool_1<T>* framePool;
    // Field size check
    static_assert(sizeof(::Photon::Voice::PrimitiveArrayPool_1<T>*) == 0x8);
    // private System.Boolean catchingUp
    // Size: 0x1
    // Offset: 0x0
    bool catchingUp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Photon::Voice::IAudioOut_1<T>
    operator ::Photon::Voice::IAudioOut_1<T>() noexcept {
      return *reinterpret_cast<::Photon::Voice::IAudioOut_1<T>*>(this);
    }
    // Autogenerated static field getter
    // Get static field: static private System.Int32 TEMPO_UP_SKIP_GROUP
    static int _get_TEMPO_UP_SKIP_GROUP() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Photon::Voice::AudioOutDelayControl_1::_get_TEMPO_UP_SKIP_GROUP");
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<int>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<AudioOutDelayControl_1<T>*>::get(), "TEMPO_UP_SKIP_GROUP"));
    }
    // Autogenerated static field setter
    // Set static field: static private System.Int32 TEMPO_UP_SKIP_GROUP
    static void _set_TEMPO_UP_SKIP_GROUP(int value) {
