// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: Photon.Voice.VoiceInfo
#include "Photon/Voice/VoiceInfo.hpp"
// Including type: System.ArraySegment`1
#include "System/ArraySegment_1.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice
namespace Photon::Voice {
  // Forward declaring type: IServiceable
  class IServiceable;
  // Forward declaring type: IEncoder
  class IEncoder;
  // Forward declaring type: VoiceClient
  class VoiceClient;
  // Forward declaring type: SpacingProfile
  class SpacingProfile;
  // Forward declaring type: FrameFlags
  struct FrameFlags;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: Photon.Voice
namespace Photon::Voice {
  // Forward declaring type: LocalVoice
  class LocalVoice;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Voice::LocalVoice);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Voice::LocalVoice*, "Photon.Voice", "LocalVoice");
// Type namespace: Photon.Voice
namespace Photon::Voice {
  // WARNING Size may be invalid!
  // Autogenerated type: Photon.Voice.LocalVoice
  // [TokenAttribute] Offset: FFFFFFFF
  class LocalVoice : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    public:
    // private System.Byte <InterestGroup>k__BackingField
    // Size: 0x1
    // Offset: 0x10
    uint8_t InterestGroup;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean transmitEnabled
    // Size: 0x1
    // Offset: 0x11
    bool transmitEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 <FramesSent>k__BackingField
    // Size: 0x4
    // Offset: 0x14
    int FramesSent;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <FramesSentBytes>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    int FramesSentBytes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <Reliable>k__BackingField
    // Size: 0x1
    // Offset: 0x1C
    bool Reliable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <Encrypt>k__BackingField
    // Size: 0x1
    // Offset: 0x1D
    bool Encrypt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Photon.Voice.IServiceable <LocalUserServiceable>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::Photon::Voice::IServiceable* LocalUserServiceable;
    // Field size check
    static_assert(sizeof(::Photon::Voice::IServiceable*) == 0x8);
    // private System.Boolean debugEchoMode
    // Size: 0x1
    // Offset: 0x28
    bool debugEchoMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected Photon.Voice.VoiceInfo info
    // Size: 0x30
    // Offset: 0x30
    ::Photon::Voice::VoiceInfo info;
    // Field size check
    static_assert(sizeof(::Photon::Voice::VoiceInfo) == 0x30);
    // protected Photon.Voice.IEncoder encoder
    // Size: 0x8
    // Offset: 0x60
    ::Photon::Voice::IEncoder* encoder;
    // Field size check
    static_assert(sizeof(::Photon::Voice::IEncoder*) == 0x8);
    // System.Byte id
    // Size: 0x1
    // Offset: 0x68
    uint8_t id;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // System.Int32 channelId
    // Size: 0x4
    // Offset: 0x6C
    int channelId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Byte evNumber
    // Size: 0x1
    // Offset: 0x70
    uint8_t evNumber;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // protected Photon.Voice.VoiceClient voiceClient
    // Size: 0x8
    // Offset: 0x78
    ::Photon::Voice::VoiceClient* voiceClient;
    // Field size check
    static_assert(sizeof(::Photon::Voice::VoiceClient*) == 0x8);
    // protected System.ArraySegment`1<System.Byte> configFrame
    // Size: 0xFFFFFFFF
    // Offset: 0x80
    ::System::ArraySegment_1<uint8_t> configFrame;
    // protected System.Boolean disposed
    // Size: 0x1
    // Offset: 0x90
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Object disposeLock
    // Size: 0x8
    // Offset: 0x98
    ::Il2CppObject* disposeLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Int32 lastTransmitTime
    // Size: 0x4
    // Offset: 0xA0
    int lastTransmitTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Collections.Generic.Dictionary`2<System.Byte,System.Int32> eventTimestamps
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::Dictionary_2<uint8_t, int>* eventTimestamps;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint8_t, int>*) == 0x8);
    // private Photon.Voice.SpacingProfile sendSpacingProfile
    // Size: 0x8
    // Offset: 0xB0
    ::Photon::Voice::SpacingProfile* sendSpacingProfile;
    // Field size check
    static_assert(sizeof(::Photon::Voice::SpacingProfile*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // static field const value: static public System.Int32 DATA_POOL_CAPACITY
    static constexpr const int DATA_POOL_CAPACITY = 50;
    // Get static field: static public System.Int32 DATA_POOL_CAPACITY
    static int _get_DATA_POOL_CAPACITY();
    // Set static field: static public System.Int32 DATA_POOL_CAPACITY
    static void _set_DATA_POOL_CAPACITY(int value);
    // static field const value: static private System.Int32 NO_TRANSMIT_TIMEOUT_MS
    static constexpr const int NO_TRANSMIT_TIMEOUT_MS = 100;
    // Get static field: static private System.Int32 NO_TRANSMIT_TIMEOUT_MS
