// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: Photon.Voice.Codec
#include "Photon/Voice/Codec.hpp"
// Including type: Photon.Voice.VoiceInfo
#include "Photon/Voice/VoiceInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice
namespace Photon::Voice {
  // Forward declaring type: IVoiceTransport
  class IVoiceTransport;
  // Forward declaring type: ILogger
  class ILogger;
  // Forward declaring type: LocalVoice
  class LocalVoice;
  // Forward declaring type: RemoteVoice
  class RemoteVoice;
  // Forward declaring type: RemoteVoiceInfo
  class RemoteVoiceInfo;
  // Forward declaring type: LocalVoiceAudio`1<T>
  template<typename T>
  class LocalVoiceAudio_1;
  // Forward declaring type: IEncoder
  class IEncoder;
  // Forward declaring type: LocalVoiceFramed`1<T>
  template<typename T>
  class LocalVoiceFramed_1;
  // Forward declaring type: IAudioDesc
  class IAudioDesc;
  // Forward declaring type: AudioSampleType
  struct AudioSampleType;
  // Forward declaring type: FrameBuffer
  struct FrameBuffer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Random
  class Random;
  // Forward declaring type: Func`3<T1, T2, TResult>
  template<typename T1, typename T2, typename TResult>
  class Func_3;
}
// Completed forward declares
// Type namespace: Photon.Voice
namespace Photon::Voice {
  // Forward declaring type: VoiceClient
  class VoiceClient;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Voice::VoiceClient);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Voice::VoiceClient*, "Photon.Voice", "VoiceClient");
// Type namespace: Photon.Voice
namespace Photon::Voice {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Voice.VoiceClient
  // [TokenAttribute] Offset: FFFFFFFF
  class VoiceClient : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::Photon::Voice::VoiceClient::RemoteVoiceInfoDelegate
    class RemoteVoiceInfoDelegate;
    // Nested type: ::Photon::Voice::VoiceClient::$get_RemoteVoiceInfos$d__40
    class $get_RemoteVoiceInfos$d__40;
    // Nested type: ::Photon::Voice::VoiceClient::$$c__DisplayClass48_0
    class $$c__DisplayClass48_0;
    // Nested type: ::Photon::Voice::VoiceClient::$$c__DisplayClass49_0_1<T>
    template<typename T>
    class $$c__DisplayClass49_0_1;
    // Nested type: ::Photon::Voice::VoiceClient::$$c__DisplayClass50_0_1<T>
    template<typename T>
    class $$c__DisplayClass50_0_1;
    // Nested type: ::Photon::Voice::VoiceClient::$$c__DisplayClass51_0
    class $$c__DisplayClass51_0;
    // Nested type: ::Photon::Voice::VoiceClient::$$c__DisplayClass51_1
    class $$c__DisplayClass51_1;
    // Nested type: ::Photon::Voice::VoiceClient::$$c__DisplayClass51_2
    class $$c__DisplayClass51_2;
    // Nested type: ::Photon::Voice::VoiceClient::$$c__DisplayClass51_3
    class $$c__DisplayClass51_3;
    // Nested type: ::Photon::Voice::VoiceClient::$$c
    class $$c;
    public:
    // Photon.Voice.IVoiceTransport transport
    // Size: 0x8
    // Offset: 0x10
    ::Photon::Voice::IVoiceTransport* transport;
    // Field size check
    static_assert(sizeof(::Photon::Voice::IVoiceTransport*) == 0x8);
    // Photon.Voice.ILogger logger
    // Size: 0x8
    // Offset: 0x18
    ::Photon::Voice::ILogger* logger;
    // Field size check
    static_assert(sizeof(::Photon::Voice::ILogger*) == 0x8);
    // private System.Int32 <FramesLost>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    int FramesLost;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <FramesReceived>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    int FramesReceived;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <RoundTripTime>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    int RoundTripTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <RoundTripTimeVariance>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    int RoundTripTimeVariance;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <SuppressInfoDuplicateWarning>k__BackingField
    // Size: 0x1
    // Offset: 0x30
    bool SuppressInfoDuplicateWarning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: SuppressInfoDuplicateWarning and: OnRemoteVoiceInfoAction
    char __padding6[0x7] = {};
    // private Photon.Voice.VoiceClient/Photon.Voice.RemoteVoiceInfoDelegate <OnRemoteVoiceInfoAction>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::Photon::Voice::VoiceClient::RemoteVoiceInfoDelegate* OnRemoteVoiceInfoAction;
    // Field size check
    static_assert(sizeof(::Photon::Voice::VoiceClient::RemoteVoiceInfoDelegate*) == 0x8);
    // private System.Int32 <DebugLostPercent>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    int DebugLostPercent;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 prevRtt
    // Size: 0x4
    // Offset: 0x44
    int prevRtt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.Dictionary`2<Photon.Voice.Codec,System.Int32> remoteVoiceDelayFrames
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::Dictionary_2<::Photon::Voice::Codec, int>* remoteVoiceDelayFrames;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Photon::Voice::Codec, int>*) == 0x8);
    // private System.Byte globalInterestGroup
    // Size: 0x1
    // Offset: 0x50
    uint8_t globalInterestGroup;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte voiceIdCnt
    // Size: 0x1
    // Offset: 0x51
    uint8_t voiceIdCnt;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: voiceIdCnt and: localVoices
    char __padding12[0x6] = {};
    // private System.Collections.Generic.Dictionary`2<System.Byte,Photon.Voice.LocalVoice> localVoices
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::Dictionary_2<uint8_t, ::Photon::Voice::LocalVoice*>* localVoices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint8_t, ::Photon::Voice::LocalVoice*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Collections.Generic.List`1<Photon.Voice.LocalVoice>> localVoicesPerChannel
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::Dictionary_2<int, ::System::Collections::Generic::List_1<::Photon::Voice::LocalVoice*>*>* localVoicesPerChannel;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::System::Collections::Generic::List_1<::Photon::Voice::LocalVoice*>*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Collections.Generic.Dictionary`2<System.Byte,Photon.Voice.RemoteVoice>> remoteVoices
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::Dictionary_2<int, ::System::Collections::Generic::Dictionary_2<uint8_t, ::Photon::Voice::RemoteVoice*>*>* remoteVoices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::System::Collections::Generic::Dictionary_2<uint8_t, ::Photon::Voice::RemoteVoice*>*>*) == 0x8);
    // private System.Random rnd
    // Size: 0x8
    // Offset: 0x70
    ::System::Random* rnd;
    // Field size check
    static_assert(sizeof(::System::Random*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: Photon.Voice.IVoiceTransport transport
    [[deprecated("Use field access instead!")]] ::Photon::Voice::IVoiceTransport*& dyn_transport();
    // Get instance field reference: Photon.Voice.ILogger logger
    [[deprecated("Use field access instead!")]] ::Photon::Voice::ILogger*& dyn_logger();
    // Get instance field reference: private System.Int32 <FramesLost>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$FramesLost$k__BackingField();
    // Get instance field reference: private System.Int32 <FramesReceived>k__BackingField
