// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabRequestCommon
#include "PlayFab/SharedModels/PlayFabRequestCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: AddFriendRequest
  class AddFriendRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::AddFriendRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::AddFriendRequest*, "PlayFab.ClientModels", "AddFriendRequest");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.AddFriendRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class AddFriendRequest : public ::PlayFab::SharedModels::PlayFabRequestCommon {
    public:
    public:
    // public System.String FriendEmail
    // Size: 0x8
    // Offset: 0x18
    ::StringW FriendEmail;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String FriendPlayFabId
    // Size: 0x8
    // Offset: 0x20
    ::StringW FriendPlayFabId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String FriendTitleDisplayName
    // Size: 0x8
    // Offset: 0x28
    ::StringW FriendTitleDisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String FriendUsername
    // Size: 0x8
    // Offset: 0x30
    ::StringW FriendUsername;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public System.String FriendEmail
    [[deprecated("Use field access instead!")]] ::StringW& dyn_FriendEmail();
    // Get instance field reference: public System.String FriendPlayFabId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_FriendPlayFabId();
    // Get instance field reference: public System.String FriendTitleDisplayName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_FriendTitleDisplayName();
    // Get instance field reference: public System.String FriendUsername
    [[deprecated("Use field access instead!")]] ::StringW& dyn_FriendUsername();
    // public System.Void .ctor()
    // Offset: 0xB5D210
    // Implemented from: PlayFab.SharedModels.PlayFabRequestCommon
    // Base method: System.Void PlayFabRequestCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AddFriendRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::AddFriendRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AddFriendRequest*, creationType>()));
    }
  }; // PlayFab.ClientModels.AddFriendRequest
  #pragma pack(pop)
  static check_size<sizeof(AddFriendRequest), 48 + sizeof(::StringW)> __PlayFab_ClientModels_AddFriendRequestSizeCheck;
  static_assert(sizeof(AddFriendRequest) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::AddFriendRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
