// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: AdPlacementDetails
  class AdPlacementDetails;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::AdPlacementDetails);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::AdPlacementDetails*, "PlayFab.ClientModels", "AdPlacementDetails");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // WARNING Size may be invalid!
  // Autogenerated type: PlayFab.ClientModels.AdPlacementDetails
  // [TokenAttribute] Offset: FFFFFFFF
  class AdPlacementDetails : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public System.String PlacementId
    // Size: 0x8
    // Offset: 0x10
    ::StringW PlacementId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String PlacementName
    // Size: 0x8
    // Offset: 0x18
    ::StringW PlacementName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Nullable`1<System.Int32> PlacementViewsRemaining
    // Size: 0xFFFFFFFF
    // Offset: 0x20
    ::System::Nullable_1<int> PlacementViewsRemaining;
    // public System.Nullable`1<System.Double> PlacementViewsResetMinutes
    // Size: 0xFFFFFFFF
    // Offset: 0x28
    ::System::Nullable_1<double> PlacementViewsResetMinutes;
    // public System.String RewardAssetUrl
    // Size: 0x8
    // Offset: 0x38
    ::StringW RewardAssetUrl;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String RewardDescription
    // Size: 0x8
    // Offset: 0x40
    ::StringW RewardDescription;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String RewardId
    // Size: 0x8
    // Offset: 0x48
    ::StringW RewardId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String RewardName
    // Size: 0x8
    // Offset: 0x50
    ::StringW RewardName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String PlacementId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PlacementId();
    // Get instance field reference: public System.String PlacementName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PlacementName();
    // Get instance field reference: public System.Nullable`1<System.Int32> PlacementViewsRemaining
    [[deprecated("Use field access instead!")]] ::System::Nullable_1<int>& dyn_PlacementViewsRemaining();
    // Get instance field reference: public System.Nullable`1<System.Double> PlacementViewsResetMinutes
    [[deprecated("Use field access instead!")]] ::System::Nullable_1<double>& dyn_PlacementViewsResetMinutes();
    // Get instance field reference: public System.String RewardAssetUrl
    [[deprecated("Use field access instead!")]] ::StringW& dyn_RewardAssetUrl();
    // Get instance field reference: public System.String RewardDescription
    [[deprecated("Use field access instead!")]] ::StringW& dyn_RewardDescription();
    // Get instance field reference: public System.String RewardId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_RewardId();
    // Get instance field reference: public System.String RewardName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_RewardName();
    // public System.Void .ctor()
    // Offset: 0xB5D1F8
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AdPlacementDetails* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::AdPlacementDetails::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AdPlacementDetails*, creationType>()));
    }
  }; // PlayFab.ClientModels.AdPlacementDetails
  // WARNING Not writing size check since size may be invalid!
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::AdPlacementDetails::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
