// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: AdRewardItemGranted
  class AdRewardItemGranted;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::AdRewardItemGranted);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::AdRewardItemGranted*, "PlayFab.ClientModels", "AdRewardItemGranted");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.AdRewardItemGranted
  // [TokenAttribute] Offset: FFFFFFFF
  class AdRewardItemGranted : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public System.String CatalogId
    // Size: 0x8
    // Offset: 0x10
    ::StringW CatalogId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String DisplayName
    // Size: 0x8
    // Offset: 0x18
    ::StringW DisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String InstanceId
    // Size: 0x8
    // Offset: 0x20
    ::StringW InstanceId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ItemId
    // Size: 0x8
    // Offset: 0x28
    ::StringW ItemId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String CatalogId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_CatalogId();
    // Get instance field reference: public System.String DisplayName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_DisplayName();
    // Get instance field reference: public System.String InstanceId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_InstanceId();
    // Get instance field reference: public System.String ItemId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ItemId();
    // public System.Void .ctor()
    // Offset: 0xB5D200
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AdRewardItemGranted* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::AdRewardItemGranted::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AdRewardItemGranted*, creationType>()));
    }
  }; // PlayFab.ClientModels.AdRewardItemGranted
  #pragma pack(pop)
  static check_size<sizeof(AdRewardItemGranted), 40 + sizeof(::StringW)> __PlayFab_ClientModels_AdRewardItemGrantedSizeCheck;
  static_assert(sizeof(AdRewardItemGranted) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::AdRewardItemGranted::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
