// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: CartItem
  class CartItem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::CartItem);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::CartItem*, "PlayFab.ClientModels", "CartItem");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.CartItem
  // [TokenAttribute] Offset: FFFFFFFF
  class CartItem : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public System.String Description
    // Size: 0x8
    // Offset: 0x10
    ::StringW Description;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String DisplayName
    // Size: 0x8
    // Offset: 0x18
    ::StringW DisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ItemClass
    // Size: 0x8
    // Offset: 0x20
    ::StringW ItemClass;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ItemId
    // Size: 0x8
    // Offset: 0x28
    ::StringW ItemId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ItemInstanceId
    // Size: 0x8
    // Offset: 0x30
    ::StringW ItemInstanceId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.UInt32> RealCurrencyPrices
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::Dictionary_2<::StringW, uint>* RealCurrencyPrices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, uint>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.UInt32> VCAmount
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<::StringW, uint>* VCAmount;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, uint>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.UInt32> VirtualCurrencyPrices
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::Dictionary_2<::StringW, uint>* VirtualCurrencyPrices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, uint>*) == 0x8);
    public:
    // Get instance field reference: public System.String Description
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Description();
    // Get instance field reference: public System.String DisplayName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_DisplayName();
    // Get instance field reference: public System.String ItemClass
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ItemClass();
    // Get instance field reference: public System.String ItemId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ItemId();
    // Get instance field reference: public System.String ItemInstanceId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ItemInstanceId();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.String,System.UInt32> RealCurrencyPrices
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::StringW, uint>*& dyn_RealCurrencyPrices();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.String,System.UInt32> VCAmount
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::StringW, uint>*& dyn_VCAmount();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.String,System.UInt32> VirtualCurrencyPrices
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::StringW, uint>*& dyn_VirtualCurrencyPrices();
    // public System.Void .ctor()
    // Offset: 0xB5D298
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CartItem* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::CartItem::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CartItem*, creationType>()));
    }
  }; // PlayFab.ClientModels.CartItem
  #pragma pack(pop)
  static check_size<sizeof(CartItem), 72 + sizeof(::System::Collections::Generic::Dictionary_2<::StringW, uint>*)> __PlayFab_ClientModels_CartItemSizeCheck;
  static_assert(sizeof(CartItem) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::CartItem::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
