// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabResultCommon
#include "PlayFab/SharedModels/PlayFabResultCommon.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: GetPurchaseResult
  class GetPurchaseResult;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::GetPurchaseResult);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::GetPurchaseResult*, "PlayFab.ClientModels", "GetPurchaseResult");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.GetPurchaseResult
  // [TokenAttribute] Offset: FFFFFFFF
  class GetPurchaseResult : public ::PlayFab::SharedModels::PlayFabResultCommon {
    public:
    public:
    // public System.String OrderId
    // Size: 0x8
    // Offset: 0x20
    ::StringW OrderId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String PaymentProvider
    // Size: 0x8
    // Offset: 0x28
    ::StringW PaymentProvider;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.DateTime PurchaseDate
    // Size: 0x8
    // Offset: 0x30
    ::System::DateTime PurchaseDate;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // public System.String TransactionId
    // Size: 0x8
    // Offset: 0x38
    ::StringW TransactionId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String TransactionStatus
    // Size: 0x8
    // Offset: 0x40
    ::StringW TransactionStatus;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String OrderId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrderId();
    // Get instance field reference: public System.String PaymentProvider
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PaymentProvider();
    // Get instance field reference: public System.DateTime PurchaseDate
    [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_PurchaseDate();
    // Get instance field reference: public System.String TransactionId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_TransactionId();
    // Get instance field reference: public System.String TransactionStatus
    [[deprecated("Use field access instead!")]] ::StringW& dyn_TransactionStatus();
    // public System.Void .ctor()
    // Offset: 0xB5D620
    // Implemented from: PlayFab.SharedModels.PlayFabResultCommon
    // Base method: System.Void PlayFabResultCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GetPurchaseResult* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::GetPurchaseResult::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GetPurchaseResult*, creationType>()));
    }
  }; // PlayFab.ClientModels.GetPurchaseResult
  #pragma pack(pop)
  static check_size<sizeof(GetPurchaseResult), 64 + sizeof(::StringW)> __PlayFab_ClientModels_GetPurchaseResultSizeCheck;
  static_assert(sizeof(GetPurchaseResult) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::GetPurchaseResult::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
