// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: ItemPurchaseRequest
  class ItemPurchaseRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::ItemPurchaseRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::ItemPurchaseRequest*, "PlayFab.ClientModels", "ItemPurchaseRequest");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.ItemPurchaseRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class ItemPurchaseRequest : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public System.String Annotation
    // Size: 0x8
    // Offset: 0x10
    ::StringW Annotation;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ItemId
    // Size: 0x8
    // Offset: 0x18
    ::StringW ItemId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.UInt32 Quantity
    // Size: 0x4
    // Offset: 0x20
    uint Quantity;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: Quantity and: UpgradeFromItems
    char __padding2[0x4] = {};
    // public System.Collections.Generic.List`1<System.String> UpgradeFromItems
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::StringW>* UpgradeFromItems;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    public:
    // Get instance field reference: public System.String Annotation
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Annotation();
    // Get instance field reference: public System.String ItemId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ItemId();
    // Get instance field reference: public System.UInt32 Quantity
    [[deprecated("Use field access instead!")]] uint& dyn_Quantity();
    // Get instance field reference: public System.Collections.Generic.List`1<System.String> UpgradeFromItems
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::StringW>*& dyn_UpgradeFromItems();
    // public System.Void .ctor()
    // Offset: 0xB5D6F0
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ItemPurchaseRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::ItemPurchaseRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ItemPurchaseRequest*, creationType>()));
    }
  }; // PlayFab.ClientModels.ItemPurchaseRequest
  #pragma pack(pop)
  static check_size<sizeof(ItemPurchaseRequest), 40 + sizeof(::System::Collections::Generic::List_1<::StringW>*)> __PlayFab_ClientModels_ItemPurchaseRequestSizeCheck;
  static_assert(sizeof(ItemPurchaseRequest) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::ItemPurchaseRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
