// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabRequestCommon
#include "PlayFab/SharedModels/PlayFabRequestCommon.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: LinkGameCenterAccountRequest
  class LinkGameCenterAccountRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::LinkGameCenterAccountRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::LinkGameCenterAccountRequest*, "PlayFab.ClientModels", "LinkGameCenterAccountRequest");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // WARNING Size may be invalid!
  // Autogenerated type: PlayFab.ClientModels.LinkGameCenterAccountRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class LinkGameCenterAccountRequest : public ::PlayFab::SharedModels::PlayFabRequestCommon {
    public:
    public:
    // public System.Nullable`1<System.Boolean> ForceLink
    // Size: 0xFFFFFFFF
    // Offset: 0x18
    ::System::Nullable_1<bool> ForceLink;
    // public System.String GameCenterId
    // Size: 0x8
    // Offset: 0x20
    ::StringW GameCenterId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String PublicKeyUrl
    // Size: 0x8
    // Offset: 0x28
    ::StringW PublicKeyUrl;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Salt
    // Size: 0x8
    // Offset: 0x30
    ::StringW Salt;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Signature
    // Size: 0x8
    // Offset: 0x38
    ::StringW Signature;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Timestamp
    // Size: 0x8
    // Offset: 0x40
    ::StringW Timestamp;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public System.Nullable`1<System.Boolean> ForceLink
    [[deprecated("Use field access instead!")]] ::System::Nullable_1<bool>& dyn_ForceLink();
    // Get instance field reference: public System.String GameCenterId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_GameCenterId();
    // Get instance field reference: public System.String PublicKeyUrl
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PublicKeyUrl();
    // Get instance field reference: public System.String Salt
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Salt();
    // Get instance field reference: public System.String Signature
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Signature();
    // Get instance field reference: public System.String Timestamp
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Timestamp();
    // public System.Void .ctor()
    // Offset: 0xB5D748
    // Implemented from: PlayFab.SharedModels.PlayFabRequestCommon
    // Base method: System.Void PlayFabRequestCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LinkGameCenterAccountRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::LinkGameCenterAccountRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LinkGameCenterAccountRequest*, creationType>()));
    }
  }; // PlayFab.ClientModels.LinkGameCenterAccountRequest
  // WARNING Not writing size check since size may be invalid!
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::LinkGameCenterAccountRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
