// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabResultCommon
#include "PlayFab/SharedModels/PlayFabResultCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: ModifyUserVirtualCurrencyResult
  class ModifyUserVirtualCurrencyResult;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::ModifyUserVirtualCurrencyResult);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::ModifyUserVirtualCurrencyResult*, "PlayFab.ClientModels", "ModifyUserVirtualCurrencyResult");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.ModifyUserVirtualCurrencyResult
  // [TokenAttribute] Offset: FFFFFFFF
  class ModifyUserVirtualCurrencyResult : public ::PlayFab::SharedModels::PlayFabResultCommon {
    public:
    public:
    // public System.Int32 Balance
    // Size: 0x4
    // Offset: 0x20
    int Balance;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 BalanceChange
    // Size: 0x4
    // Offset: 0x24
    int BalanceChange;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.String PlayFabId
    // Size: 0x8
    // Offset: 0x28
    ::StringW PlayFabId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String VirtualCurrency
    // Size: 0x8
    // Offset: 0x30
    ::StringW VirtualCurrency;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.Int32 Balance
    [[deprecated("Use field access instead!")]] int& dyn_Balance();
    // Get instance field reference: public System.Int32 BalanceChange
    [[deprecated("Use field access instead!")]] int& dyn_BalanceChange();
    // Get instance field reference: public System.String PlayFabId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PlayFabId();
    // Get instance field reference: public System.String VirtualCurrency
    [[deprecated("Use field access instead!")]] ::StringW& dyn_VirtualCurrency();
    // public System.Void .ctor()
    // Offset: 0xB5D8D8
    // Implemented from: PlayFab.SharedModels.PlayFabResultCommon
    // Base method: System.Void PlayFabResultCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ModifyUserVirtualCurrencyResult* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::ModifyUserVirtualCurrencyResult::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ModifyUserVirtualCurrencyResult*, creationType>()));
    }
  }; // PlayFab.ClientModels.ModifyUserVirtualCurrencyResult
  #pragma pack(pop)
  static check_size<sizeof(ModifyUserVirtualCurrencyResult), 48 + sizeof(::StringW)> __PlayFab_ClientModels_ModifyUserVirtualCurrencyResultSizeCheck;
  static_assert(sizeof(ModifyUserVirtualCurrencyResult) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::ModifyUserVirtualCurrencyResult::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
