// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: PaymentOption
  class PaymentOption;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::PaymentOption);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::PaymentOption*, "PlayFab.ClientModels", "PaymentOption");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.PaymentOption
  // [TokenAttribute] Offset: FFFFFFFF
  class PaymentOption : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public System.String Currency
    // Size: 0x8
    // Offset: 0x10
    ::StringW Currency;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.UInt32 Price
    // Size: 0x4
    // Offset: 0x18
    uint Price;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: Price and: ProviderName
    char __padding1[0x4] = {};
    // public System.String ProviderName
    // Size: 0x8
    // Offset: 0x20
    ::StringW ProviderName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.UInt32 StoreCredit
    // Size: 0x4
    // Offset: 0x28
    uint StoreCredit;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    public:
    // Get instance field reference: public System.String Currency
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Currency();
    // Get instance field reference: public System.UInt32 Price
    [[deprecated("Use field access instead!")]] uint& dyn_Price();
    // Get instance field reference: public System.String ProviderName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ProviderName();
    // Get instance field reference: public System.UInt32 StoreCredit
    [[deprecated("Use field access instead!")]] uint& dyn_StoreCredit();
    // public System.Void .ctor()
    // Offset: 0xB5D918
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PaymentOption* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::PaymentOption::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PaymentOption*, creationType>()));
    }
  }; // PlayFab.ClientModels.PaymentOption
  #pragma pack(pop)
  static check_size<sizeof(PaymentOption), 40 + sizeof(uint)> __PlayFab_ClientModels_PaymentOptionSizeCheck;
  static_assert(sizeof(PaymentOption) == 0x2C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::PaymentOption::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
