// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabRequestCommon
#include "PlayFab/SharedModels/PlayFabRequestCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: PurchaseItemRequest
  class PurchaseItemRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::PurchaseItemRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::PurchaseItemRequest*, "PlayFab.ClientModels", "PurchaseItemRequest");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.PurchaseItemRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class PurchaseItemRequest : public ::PlayFab::SharedModels::PlayFabRequestCommon {
    public:
    public:
    // public System.String CatalogVersion
    // Size: 0x8
    // Offset: 0x18
    ::StringW CatalogVersion;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String CharacterId
    // Size: 0x8
    // Offset: 0x20
    ::StringW CharacterId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ItemId
    // Size: 0x8
    // Offset: 0x28
    ::StringW ItemId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 Price
    // Size: 0x4
    // Offset: 0x30
    int Price;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Price and: StoreId
    char __padding3[0x4] = {};
    // public System.String StoreId
    // Size: 0x8
    // Offset: 0x38
    ::StringW StoreId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String VirtualCurrency
    // Size: 0x8
    // Offset: 0x40
    ::StringW VirtualCurrency;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public System.String CatalogVersion
    [[deprecated("Use field access instead!")]] ::StringW& dyn_CatalogVersion();
    // Get instance field reference: public System.String CharacterId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_CharacterId();
    // Get instance field reference: public System.String ItemId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ItemId();
    // Get instance field reference: public System.Int32 Price
    [[deprecated("Use field access instead!")]] int& dyn_Price();
    // Get instance field reference: public System.String StoreId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_StoreId();
    // Get instance field reference: public System.String VirtualCurrency
    [[deprecated("Use field access instead!")]] ::StringW& dyn_VirtualCurrency();
    // public System.Void .ctor()
    // Offset: 0xB5D940
    // Implemented from: PlayFab.SharedModels.PlayFabRequestCommon
    // Base method: System.Void PlayFabRequestCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PurchaseItemRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::PurchaseItemRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PurchaseItemRequest*, creationType>()));
    }
  }; // PlayFab.ClientModels.PurchaseItemRequest
  #pragma pack(pop)
  static check_size<sizeof(PurchaseItemRequest), 64 + sizeof(::StringW)> __PlayFab_ClientModels_PurchaseItemRequestSizeCheck;
  static_assert(sizeof(PurchaseItemRequest) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::PurchaseItemRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
