// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabRequestCommon
#include "PlayFab/SharedModels/PlayFabRequestCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: GetPlayerCombinedInfoRequestParams
  class GetPlayerCombinedInfoRequestParams;
}
// Completed forward declares
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: RegisterWithWindowsHelloRequest
  class RegisterWithWindowsHelloRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::RegisterWithWindowsHelloRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::RegisterWithWindowsHelloRequest*, "PlayFab.ClientModels", "RegisterWithWindowsHelloRequest");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.RegisterWithWindowsHelloRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class RegisterWithWindowsHelloRequest : public ::PlayFab::SharedModels::PlayFabRequestCommon {
    public:
    public:
    // public System.String DeviceName
    // Size: 0x8
    // Offset: 0x18
    ::StringW DeviceName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String EncryptedRequest
    // Size: 0x8
    // Offset: 0x20
    ::StringW EncryptedRequest;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PlayFab.ClientModels.GetPlayerCombinedInfoRequestParams InfoRequestParameters
    // Size: 0x8
    // Offset: 0x28
    ::PlayFab::ClientModels::GetPlayerCombinedInfoRequestParams* InfoRequestParameters;
    // Field size check
    static_assert(sizeof(::PlayFab::ClientModels::GetPlayerCombinedInfoRequestParams*) == 0x8);
    // public System.String PlayerSecret
    // Size: 0x8
    // Offset: 0x30
    ::StringW PlayerSecret;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String PublicKey
    // Size: 0x8
    // Offset: 0x38
    ::StringW PublicKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String TitleId
    // Size: 0x8
    // Offset: 0x40
    ::StringW TitleId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String UserName
    // Size: 0x8
    // Offset: 0x48
    ::StringW UserName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public System.String DeviceName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_DeviceName();
    // Get instance field reference: public System.String EncryptedRequest
    [[deprecated("Use field access instead!")]] ::StringW& dyn_EncryptedRequest();
    // Get instance field reference: public PlayFab.ClientModels.GetPlayerCombinedInfoRequestParams InfoRequestParameters
    [[deprecated("Use field access instead!")]] ::PlayFab::ClientModels::GetPlayerCombinedInfoRequestParams*& dyn_InfoRequestParameters();
    // Get instance field reference: public System.String PlayerSecret
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PlayerSecret();
    // Get instance field reference: public System.String PublicKey
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PublicKey();
    // Get instance field reference: public System.String TitleId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_TitleId();
    // Get instance field reference: public System.String UserName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_UserName();
    // public System.Void .ctor()
    // Offset: 0xB5D9A0
    // Implemented from: PlayFab.SharedModels.PlayFabRequestCommon
    // Base method: System.Void PlayFabRequestCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RegisterWithWindowsHelloRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::RegisterWithWindowsHelloRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RegisterWithWindowsHelloRequest*, creationType>()));
    }
  }; // PlayFab.ClientModels.RegisterWithWindowsHelloRequest
  #pragma pack(pop)
  static check_size<sizeof(RegisterWithWindowsHelloRequest), 72 + sizeof(::StringW)> __PlayFab_ClientModels_RegisterWithWindowsHelloRequestSizeCheck;
  static_assert(sizeof(RegisterWithWindowsHelloRequest) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::RegisterWithWindowsHelloRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
