// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabLoginResultCommon
#include "PlayFab/SharedModels/PlayFabLoginResultCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: EntityTokenResponse
  class EntityTokenResponse;
  // Forward declaring type: UserSettings
  class UserSettings;
}
// Completed forward declares
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: RegisterPlayFabUserResult
  class RegisterPlayFabUserResult;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::RegisterPlayFabUserResult);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::RegisterPlayFabUserResult*, "PlayFab.ClientModels", "RegisterPlayFabUserResult");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.RegisterPlayFabUserResult
  // [TokenAttribute] Offset: FFFFFFFF
  class RegisterPlayFabUserResult : public ::PlayFab::SharedModels::PlayFabLoginResultCommon {
    public:
    public:
    // public PlayFab.ClientModels.EntityTokenResponse EntityToken
    // Size: 0x8
    // Offset: 0x28
    ::PlayFab::ClientModels::EntityTokenResponse* EntityToken;
    // Field size check
    static_assert(sizeof(::PlayFab::ClientModels::EntityTokenResponse*) == 0x8);
    // public System.String PlayFabId
    // Size: 0x8
    // Offset: 0x30
    ::StringW PlayFabId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String SessionTicket
    // Size: 0x8
    // Offset: 0x38
    ::StringW SessionTicket;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PlayFab.ClientModels.UserSettings SettingsForUser
    // Size: 0x8
    // Offset: 0x40
    ::PlayFab::ClientModels::UserSettings* SettingsForUser;
    // Field size check
    static_assert(sizeof(::PlayFab::ClientModels::UserSettings*) == 0x8);
    // public System.String Username
    // Size: 0x8
    // Offset: 0x48
    ::StringW Username;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public PlayFab.ClientModels.EntityTokenResponse EntityToken
    [[deprecated("Use field access instead!")]] ::PlayFab::ClientModels::EntityTokenResponse*& dyn_EntityToken();
    // Get instance field reference: public System.String PlayFabId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PlayFabId();
    // Get instance field reference: public System.String SessionTicket
    [[deprecated("Use field access instead!")]] ::StringW& dyn_SessionTicket();
    // Get instance field reference: public PlayFab.ClientModels.UserSettings SettingsForUser
    [[deprecated("Use field access instead!")]] ::PlayFab::ClientModels::UserSettings*& dyn_SettingsForUser();
    // Get instance field reference: public System.String Username
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Username();
    // public System.Void .ctor()
    // Offset: 0xB5D998
    // Implemented from: PlayFab.SharedModels.PlayFabLoginResultCommon
    // Base method: System.Void PlayFabLoginResultCommon::.ctor()
    // Base method: System.Void PlayFabResultCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RegisterPlayFabUserResult* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::RegisterPlayFabUserResult::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RegisterPlayFabUserResult*, creationType>()));
    }
  }; // PlayFab.ClientModels.RegisterPlayFabUserResult
  #pragma pack(pop)
  static check_size<sizeof(RegisterPlayFabUserResult), 72 + sizeof(::StringW)> __PlayFab_ClientModels_RegisterPlayFabUserResultSizeCheck;
  static_assert(sizeof(RegisterPlayFabUserResult) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::RegisterPlayFabUserResult::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
