// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabRequestCommon
#include "PlayFab/SharedModels/PlayFabRequestCommon.hpp"
// Including type: PlayFab.ClientModels.Region
#include "PlayFab/ClientModels/Region.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: StartGameRequest
  class StartGameRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::StartGameRequest);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::StartGameRequest*, "PlayFab.ClientModels", "StartGameRequest");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.StartGameRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class StartGameRequest : public ::PlayFab::SharedModels::PlayFabRequestCommon {
    public:
    public:
    // public System.String BuildVersion
    // Size: 0x8
    // Offset: 0x18
    ::StringW BuildVersion;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String CharacterId
    // Size: 0x8
    // Offset: 0x20
    ::StringW CharacterId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String CustomCommandLineData
    // Size: 0x8
    // Offset: 0x28
    ::StringW CustomCommandLineData;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String GameMode
    // Size: 0x8
    // Offset: 0x30
    ::StringW GameMode;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PlayFab.ClientModels.Region Region
    // Size: 0x4
    // Offset: 0x38
    ::PlayFab::ClientModels::Region Region;
    // Field size check
    static_assert(sizeof(::PlayFab::ClientModels::Region) == 0x4);
    // Padding between fields: Region and: StatisticName
    char __padding4[0x4] = {};
    // public System.String StatisticName
    // Size: 0x8
    // Offset: 0x40
    ::StringW StatisticName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::PlayFab::PlayFabAuthenticationContext*
    constexpr operator ::PlayFab::PlayFabAuthenticationContext*() const noexcept = delete;
    // Get instance field reference: public System.String BuildVersion
    [[deprecated("Use field access instead!")]] ::StringW& dyn_BuildVersion();
    // Get instance field reference: public System.String CharacterId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_CharacterId();
    // Get instance field reference: public System.String CustomCommandLineData
    [[deprecated("Use field access instead!")]] ::StringW& dyn_CustomCommandLineData();
    // Get instance field reference: public System.String GameMode
    [[deprecated("Use field access instead!")]] ::StringW& dyn_GameMode();
    // Get instance field reference: public PlayFab.ClientModels.Region Region
    [[deprecated("Use field access instead!")]] ::PlayFab::ClientModels::Region& dyn_Region();
    // Get instance field reference: public System.String StatisticName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_StatisticName();
    // public System.Void .ctor()
    // Offset: 0xB5DA68
    // Implemented from: PlayFab.SharedModels.PlayFabRequestCommon
    // Base method: System.Void PlayFabRequestCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static StartGameRequest* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::StartGameRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<StartGameRequest*, creationType>()));
    }
  }; // PlayFab.ClientModels.StartGameRequest
  #pragma pack(pop)
  static check_size<sizeof(StartGameRequest), 64 + sizeof(::StringW)> __PlayFab_ClientModels_StartGameRequestSizeCheck;
  static_assert(sizeof(StartGameRequest) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::StartGameRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
