// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: TitleNewsItem
  class TitleNewsItem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::TitleNewsItem);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::TitleNewsItem*, "PlayFab.ClientModels", "TitleNewsItem");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.TitleNewsItem
  // [TokenAttribute] Offset: FFFFFFFF
  class TitleNewsItem : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public System.String Body
    // Size: 0x8
    // Offset: 0x10
    ::StringW Body;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String NewsId
    // Size: 0x8
    // Offset: 0x18
    ::StringW NewsId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.DateTime Timestamp
    // Size: 0x8
    // Offset: 0x20
    ::System::DateTime Timestamp;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // public System.String Title
    // Size: 0x8
    // Offset: 0x28
    ::StringW Title;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String Body
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Body();
    // Get instance field reference: public System.String NewsId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_NewsId();
    // Get instance field reference: public System.DateTime Timestamp
    [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_Timestamp();
    // Get instance field reference: public System.String Title
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Title();
    // public System.Void .ctor()
    // Offset: 0xB5DAD8
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TitleNewsItem* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::TitleNewsItem::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TitleNewsItem*, creationType>()));
    }
  }; // PlayFab.ClientModels.TitleNewsItem
  #pragma pack(pop)
  static check_size<sizeof(TitleNewsItem), 40 + sizeof(::StringW)> __PlayFab_ClientModels_TitleNewsItemSizeCheck;
  static_assert(sizeof(TitleNewsItem) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::TitleNewsItem::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
