// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabResultCommon
#include "PlayFab/SharedModels/PlayFabResultCommon.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: ItemInstance
  class ItemInstance;
}
// Completed forward declares
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: UnlockContainerItemResult
  class UnlockContainerItemResult;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::UnlockContainerItemResult);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::UnlockContainerItemResult*, "PlayFab.ClientModels", "UnlockContainerItemResult");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.UnlockContainerItemResult
  // [TokenAttribute] Offset: FFFFFFFF
  class UnlockContainerItemResult : public ::PlayFab::SharedModels::PlayFabResultCommon {
    public:
    public:
    // public System.Collections.Generic.List`1<PlayFab.ClientModels.ItemInstance> GrantedItems
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::PlayFab::ClientModels::ItemInstance*>* GrantedItems;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PlayFab::ClientModels::ItemInstance*>*) == 0x8);
    // public System.String UnlockedItemInstanceId
    // Size: 0x8
    // Offset: 0x28
    ::StringW UnlockedItemInstanceId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String UnlockedWithItemInstanceId
    // Size: 0x8
    // Offset: 0x30
    ::StringW UnlockedWithItemInstanceId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.UInt32> VirtualCurrency
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::Dictionary_2<::StringW, uint>* VirtualCurrency;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, uint>*) == 0x8);
    public:
    // Get instance field reference: public System.Collections.Generic.List`1<PlayFab.ClientModels.ItemInstance> GrantedItems
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::PlayFab::ClientModels::ItemInstance*>*& dyn_GrantedItems();
    // Get instance field reference: public System.String UnlockedItemInstanceId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_UnlockedItemInstanceId();
    // Get instance field reference: public System.String UnlockedWithItemInstanceId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_UnlockedWithItemInstanceId();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.String,System.UInt32> VirtualCurrency
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::StringW, uint>*& dyn_VirtualCurrency();
    // public System.Void .ctor()
    // Offset: 0xB5DC00
    // Implemented from: PlayFab.SharedModels.PlayFabResultCommon
    // Base method: System.Void PlayFabResultCommon::.ctor()
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UnlockContainerItemResult* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::UnlockContainerItemResult::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UnlockContainerItemResult*, creationType>()));
    }
  }; // PlayFab.ClientModels.UnlockContainerItemResult
  #pragma pack(pop)
  static check_size<sizeof(UnlockContainerItemResult), 56 + sizeof(::System::Collections::Generic::Dictionary_2<::StringW, uint>*)> __PlayFab_ClientModels_UnlockContainerItemResultSizeCheck;
  static_assert(sizeof(UnlockContainerItemResult) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::UnlockContainerItemResult::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
