// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: UserGoogleInfo
  class UserGoogleInfo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::ClientModels::UserGoogleInfo);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::ClientModels::UserGoogleInfo*, "PlayFab.ClientModels", "UserGoogleInfo");
// Type namespace: PlayFab.ClientModels
namespace PlayFab::ClientModels {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.ClientModels.UserGoogleInfo
  // [TokenAttribute] Offset: FFFFFFFF
  class UserGoogleInfo : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public System.String GoogleEmail
    // Size: 0x8
    // Offset: 0x10
    ::StringW GoogleEmail;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String GoogleGender
    // Size: 0x8
    // Offset: 0x18
    ::StringW GoogleGender;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String GoogleId
    // Size: 0x8
    // Offset: 0x20
    ::StringW GoogleId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String GoogleLocale
    // Size: 0x8
    // Offset: 0x28
    ::StringW GoogleLocale;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String GoogleName
    // Size: 0x8
    // Offset: 0x30
    ::StringW GoogleName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String GoogleEmail
    [[deprecated("Use field access instead!")]] ::StringW& dyn_GoogleEmail();
    // Get instance field reference: public System.String GoogleGender
    [[deprecated("Use field access instead!")]] ::StringW& dyn_GoogleGender();
    // Get instance field reference: public System.String GoogleId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_GoogleId();
    // Get instance field reference: public System.String GoogleLocale
    [[deprecated("Use field access instead!")]] ::StringW& dyn_GoogleLocale();
    // Get instance field reference: public System.String GoogleName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_GoogleName();
    // public System.Void .ctor()
    // Offset: 0xB5DCB0
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UserGoogleInfo* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::ClientModels::UserGoogleInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UserGoogleInfo*, creationType>()));
    }
  }; // PlayFab.ClientModels.UserGoogleInfo
  #pragma pack(pop)
  static check_size<sizeof(UserGoogleInfo), 48 + sizeof(::StringW)> __PlayFab_ClientModels_UserGoogleInfoSizeCheck;
  static_assert(sizeof(UserGoogleInfo) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::ClientModels::UserGoogleInfo::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
