// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.Collections.IDictionary
#include "System/Collections/IDictionary.hpp"
// Including type: System.Runtime.Serialization.ISerializable
#include "System/Runtime/Serialization/ISerializable.hpp"
// Including type: System.Runtime.Serialization.IDeserializationCallback
#include "System/Runtime/Serialization/IDeserializationCallback.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Runtime.Serialization.StreamingContext
#include "System/Runtime/Serialization/StreamingContext.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: ICollection because it is already included!
  // Forward declaring type: IEqualityComparer
  class IEqualityComparer;
  // Forward declaring type: IHashCodeProvider
  class IHashCodeProvider;
  // Forward declaring type: IComparer
  class IComparer;
  // Forward declaring type: IEnumerator
  class IEnumerator;
  // Forward declaring type: IDictionaryEnumerator
  class IDictionaryEnumerator;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Array
  class Array;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
}
// Completed forward declares
// Type namespace: System.Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Collections::Hashtable);
DEFINE_IL2CPP_ARG_TYPE(::System::Collections::Hashtable*, "System.Collections", "Hashtable");
// Type namespace: System.Collections
namespace System::Collections {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: System.Collections.Hashtable
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerTypeProxyAttribute] Offset: 105B238
  // [DefaultMemberAttribute] Offset: 105B238
  // [DebuggerDisplayAttribute] Offset: 105B238
  // [ComVisibleAttribute] Offset: 105B238
  class Hashtable : public ::Il2CppObject/*, public ::System::ICloneable, public ::System::Collections::IDictionary, public ::System::Runtime::Serialization::ISerializable, public ::System::Runtime::Serialization::IDeserializationCallback*/ {
    public:
    // Nested type: ::System::Collections::Hashtable::bucket
    struct bucket;
    // Nested type: ::System::Collections::Hashtable::KeyCollection
    class KeyCollection;
    // Nested type: ::System::Collections::Hashtable::ValueCollection
    class ValueCollection;
    // Nested type: ::System::Collections::Hashtable::SyncHashtable
    class SyncHashtable;
    // Nested type: ::System::Collections::Hashtable::HashtableEnumerator
    class HashtableEnumerator;
    // Nested type: ::System::Collections::Hashtable::HashtableDebugView
    class HashtableDebugView;
    // Size: 0x14
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Collections.Hashtable/System.Collections.bucket
    // [TokenAttribute] Offset: FFFFFFFF
    struct bucket/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Object key
      // Size: 0x8
      // Offset: 0x0
      ::Il2CppObject* key;
      // Field size check
      static_assert(sizeof(::Il2CppObject*) == 0x8);
      // public System.Object val
      // Size: 0x8
      // Offset: 0x8
      ::Il2CppObject* val;
      // Field size check
      static_assert(sizeof(::Il2CppObject*) == 0x8);
      // public System.Int32 hash_coll
      // Size: 0x4
      // Offset: 0x10
      int hash_coll;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: bucket
      constexpr bucket(::Il2CppObject* key_ = {}, ::Il2CppObject* val_ = {}, int hash_coll_ = {}) noexcept : key{key_}, val{val_}, hash_coll{hash_coll_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating interface conversion operator: i_ValueType
      inline ::System::ValueType* i_ValueType() noexcept {
        return reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Object key
      [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_key();
      // Get instance field reference: public System.Object val
      [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_val();
      // Get instance field reference: public System.Int32 hash_coll
      [[deprecated("Use field access instead!")]] int& dyn_hash_coll();
    }; // System.Collections.Hashtable/System.Collections.bucket
    #pragma pack(pop)
    static check_size<sizeof(Hashtable::bucket), 16 + sizeof(int)> __System_Collections_Hashtable_bucketSizeCheck;
    static_assert(sizeof(Hashtable::bucket) == 0x14);
    public:
    // private System.Collections.Hashtable/System.Collections.bucket[] buckets
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::System::Collections::Hashtable::bucket> buckets;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Hashtable::bucket>) == 0x8);
    // private System.Int32 count
    // Size: 0x4
    // Offset: 0x18
    int count;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 occupancy
    // Size: 0x4
    // Offset: 0x1C
    int occupancy;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 loadsize
    // Size: 0x4
    // Offset: 0x20
    int loadsize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single loadFactor
    // Size: 0x4
    // Offset: 0x24
    float loadFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 version
    // Size: 0x4
    // Offset: 0x28
    int version;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean isWriterInProgress
    // Size: 0x1
    // Offset: 0x2C
    bool isWriterInProgress;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isWriterInProgress and: keys
    char __padding6[0x3] = {};
    // private System.Collections.ICollection keys
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::ICollection* keys;
    // Field size check
    static_assert(sizeof(::System::Collections::ICollection*) == 0x8);
    // private System.Collections.ICollection values
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::ICollection* values;
    // Field size check
    static_assert(sizeof(::System::Collections::ICollection*) == 0x8);
    // private System.Collections.IEqualityComparer _keycomparer
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::IEqualityComparer* keycomparer;
    // Field size check
    static_assert(sizeof(::System::Collections::IEqualityComparer*) == 0x8);
    // private System.Object _syncRoot
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* syncRoot;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::ICloneable
    operator ::System::ICloneable() noexcept {
      return *reinterpret_cast<::System::ICloneable*>(this);
    }
    // Creating interface conversion operator: i_ICloneable
    inline ::System::ICloneable* i_ICloneable() noexcept {
      return reinterpret_cast<::System::ICloneable*>(this);
    }
    // Creating interface conversion operator: operator ::System::Collections::IDictionary
    operator ::System::Collections::IDictionary() noexcept {
      return *reinterpret_cast<::System::Collections::IDictionary*>(this);
    }
    // Creating interface conversion operator: i_IDictionary
    inline ::System::Collections::IDictionary* i_IDictionary() noexcept {
      return reinterpret_cast<::System::Collections::IDictionary*>(this);
    }
