// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.CursorLockMode
#include "UnityEngine/CursorLockMode.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRSimulatedHMDState
#include "UnityEngine/XR/Interaction/Toolkit/Inputs/Simulation/XRSimulatedHMDState.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRSimulatedControllerState
#include "UnityEngine/XR/Interaction/Toolkit/Inputs/Simulation/XRSimulatedControllerState.hpp"
// Including type: UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext
#include "UnityEngine/InputSystem/InputAction_CallbackContext.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation
namespace UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation {
  // Skipping declaration: Space because it is already included!
  // Forward declaring type: XRSimulatedController
  class XRSimulatedController;
  // Forward declaring type: XRSimulatedHMD
  class XRSimulatedHMD;
  // Skipping declaration: TransformationMode because it is already included!
  // Skipping declaration: Axis2DTargets because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionReference
  class InputActionReference;
  // Forward declaring type: InputAction
  class InputAction;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation
namespace UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation {
  // Forward declaring type: XRDeviceSimulator
  class XRDeviceSimulator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator*, "UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation", "XRDeviceSimulator");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation
namespace UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation {
  // Size: 0x2E8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: 97F284
  class XRDeviceSimulator : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space
    struct Space;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::TransformationMode
    struct TransformationMode;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets
    struct Axis2DTargets;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space
    // [TokenAttribute] Offset: FFFFFFFF
    struct Space/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Space
      constexpr Space(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space Local
      static constexpr const int Local = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space Local
      static ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space _get_Local();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space Local
      static void _set_Local(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space Parent
      static constexpr const int Parent = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space Parent
      static ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space _get_Parent();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space Parent
      static void _set_Parent(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space Screen
      static constexpr const int Screen = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space Screen
      static ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space _get_Screen();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space Screen
      static void _set_Screen(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space
    #pragma pack(pop)
    static check_size<sizeof(XRDeviceSimulator::Space), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_Inputs_Simulation_XRDeviceSimulator_SpaceSizeCheck;
    static_assert(sizeof(XRDeviceSimulator::Space) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.TransformationMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct TransformationMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TransformationMode
      constexpr TransformationMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.TransformationMode Translate
      static constexpr const int Translate = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.TransformationMode Translate
      static ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::TransformationMode _get_Translate();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.TransformationMode Translate
      static void _set_Translate(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::TransformationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.TransformationMode Rotate
      static constexpr const int Rotate = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.TransformationMode Rotate
      static ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::TransformationMode _get_Rotate();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.TransformationMode Rotate
      static void _set_Rotate(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::TransformationMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.TransformationMode
    #pragma pack(pop)
    static check_size<sizeof(XRDeviceSimulator::TransformationMode), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_Inputs_Simulation_XRDeviceSimulator_TransformationModeSizeCheck;
    static_assert(sizeof(XRDeviceSimulator::TransformationMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct Axis2DTargets/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Axis2DTargets
      constexpr Axis2DTargets(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets None
      static ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets _get_None();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets None
      static void _set_None(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets Position
      static constexpr const int Position = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets Position
      static ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets _get_Position();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets Position
      static void _set_Position(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets Primary2DAxis
      static constexpr const int Primary2DAxis = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets Primary2DAxis
      static ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets _get_Primary2DAxis();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets Primary2DAxis
      static void _set_Primary2DAxis(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets Secondary2DAxis
      static constexpr const int Secondary2DAxis = 4;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets Secondary2DAxis
      static ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets _get_Secondary2DAxis();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets Secondary2DAxis
      static void _set_Secondary2DAxis(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets
    #pragma pack(pop)
    static check_size<sizeof(XRDeviceSimulator::Axis2DTargets), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_Inputs_Simulation_XRDeviceSimulator_Axis2DTargetsSizeCheck;
    static_assert(sizeof(XRDeviceSimulator::Axis2DTargets) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0x982A7C
    // private UnityEngine.InputSystem.InputActionReference m_KeyboardXTranslateAction
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::InputSystem::InputActionReference* m_KeyboardXTranslateAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982AC8
    // private UnityEngine.InputSystem.InputActionReference m_KeyboardYTranslateAction
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::InputSystem::InputActionReference* m_KeyboardYTranslateAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982B14
    // private UnityEngine.InputSystem.InputActionReference m_KeyboardZTranslateAction
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::InputSystem::InputActionReference* m_KeyboardZTranslateAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982B60
    // private UnityEngine.InputSystem.InputActionReference m_ManipulateLeftAction
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::InputSystem::InputActionReference* m_ManipulateLeftAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982BAC
    // private UnityEngine.InputSystem.InputActionReference m_ManipulateRightAction
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::InputSystem::InputActionReference* m_ManipulateRightAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982BF8
    // private UnityEngine.InputSystem.InputActionReference m_ToggleManipulateLeftAction
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::InputSystem::InputActionReference* m_ToggleManipulateLeftAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982C44
    // private UnityEngine.InputSystem.InputActionReference m_ToggleManipulateRightAction
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::InputSystem::InputActionReference* m_ToggleManipulateRightAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982C90
    // private UnityEngine.InputSystem.InputActionReference m_ManipulateHeadAction
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::InputSystem::InputActionReference* m_ManipulateHeadAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982CDC
    // private UnityEngine.InputSystem.InputActionReference m_MouseDeltaAction
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::InputSystem::InputActionReference* m_MouseDeltaAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982D28
    // private UnityEngine.InputSystem.InputActionReference m_MouseScrollAction
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::InputSystem::InputActionReference* m_MouseScrollAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982D74
    // private UnityEngine.InputSystem.InputActionReference m_RotateModeOverrideAction
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::InputSystem::InputActionReference* m_RotateModeOverrideAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982DC0
    // private UnityEngine.InputSystem.InputActionReference m_ToggleMouseTransformationModeAction
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::InputSystem::InputActionReference* m_ToggleMouseTransformationModeAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982E0C
    // private UnityEngine.InputSystem.InputActionReference m_NegateModeAction
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::InputSystem::InputActionReference* m_NegateModeAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982E58
    // private UnityEngine.InputSystem.InputActionReference m_XConstraintAction
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::InputSystem::InputActionReference* m_XConstraintAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982EA4
    // private UnityEngine.InputSystem.InputActionReference m_YConstraintAction
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::InputSystem::InputActionReference* m_YConstraintAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982EF0
    // private UnityEngine.InputSystem.InputActionReference m_ZConstraintAction
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::InputSystem::InputActionReference* m_ZConstraintAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982F3C
    // private UnityEngine.InputSystem.InputActionReference m_ResetAction
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::InputSystem::InputActionReference* m_ResetAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982F88
    // private UnityEngine.InputSystem.InputActionReference m_ToggleCursorLockAction
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::InputSystem::InputActionReference* m_ToggleCursorLockAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x982FD4
    // private UnityEngine.InputSystem.InputActionReference m_ToggleDevicePositionTargetAction
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::InputSystem::InputActionReference* m_ToggleDevicePositionTargetAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x983020
    // private UnityEngine.InputSystem.InputActionReference m_TogglePrimary2DAxisTargetAction
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::InputSystem::InputActionReference* m_TogglePrimary2DAxisTargetAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x98306C
    // private UnityEngine.InputSystem.InputActionReference m_ToggleSecondary2DAxisTargetAction
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::InputSystem::InputActionReference* m_ToggleSecondary2DAxisTargetAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x9830B8
    // private UnityEngine.InputSystem.InputActionReference m_Axis2DAction
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::InputSystem::InputActionReference* m_Axis2DAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x983104
    // private UnityEngine.InputSystem.InputActionReference m_RestingHandAxis2DAction
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::InputSystem::InputActionReference* m_RestingHandAxis2DAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x983150
    // private UnityEngine.InputSystem.InputActionReference m_GripAction
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::InputSystem::InputActionReference* m_GripAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x98319C
    // private UnityEngine.InputSystem.InputActionReference m_TriggerAction
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::InputSystem::InputActionReference* m_TriggerAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x9831E8
    // private UnityEngine.InputSystem.InputActionReference m_PrimaryButtonAction
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::InputSystem::InputActionReference* m_PrimaryButtonAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x983234
    // private UnityEngine.InputSystem.InputActionReference m_SecondaryButtonAction
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::InputSystem::InputActionReference* m_SecondaryButtonAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x983280
    // private UnityEngine.InputSystem.InputActionReference m_MenuAction
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::InputSystem::InputActionReference* m_MenuAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x9832CC
    // private UnityEngine.InputSystem.InputActionReference m_Primary2DAxisClickAction
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::InputSystem::InputActionReference* m_Primary2DAxisClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x983318
    // private UnityEngine.InputSystem.InputActionReference m_Secondary2DAxisClickAction
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::InputSystem::InputActionReference* m_Secondary2DAxisClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x983364
    // private UnityEngine.InputSystem.InputActionReference m_Primary2DAxisTouchAction
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::InputSystem::InputActionReference* m_Primary2DAxisTouchAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x9833B0
    // private UnityEngine.InputSystem.InputActionReference m_Secondary2DAxisTouchAction
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::InputSystem::InputActionReference* m_Secondary2DAxisTouchAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x9833FC
    // private UnityEngine.InputSystem.InputActionReference m_PrimaryTouchAction
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::InputSystem::InputActionReference* m_PrimaryTouchAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x983448
    // private UnityEngine.InputSystem.InputActionReference m_SecondaryTouchAction
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::InputSystem::InputActionReference* m_SecondaryTouchAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // [TooltipAttribute] Offset: 0x983494
    // private UnityEngine.Transform m_CameraTransform
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::Transform* m_CameraTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x9834E0
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space m_KeyboardTranslateSpace
    // Size: 0x4
    // Offset: 0x130
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space m_KeyboardTranslateSpace;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space) == 0x4);
    // [TooltipAttribute] Offset: 0x98352C
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Space m_MouseTranslateSpace
    // Size: 0x4
    // Offset: 0x134
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space m_MouseTranslateSpace;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Space) == 0x4);
    // [TooltipAttribute] Offset: 0x983578
    // private System.Single m_KeyboardXTranslateSpeed
    // Size: 0x4
    // Offset: 0x138
    float m_KeyboardXTranslateSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x9835C4
    // private System.Single m_KeyboardYTranslateSpeed
    // Size: 0x4
    // Offset: 0x13C
    float m_KeyboardYTranslateSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x983610
    // private System.Single m_KeyboardZTranslateSpeed
    // Size: 0x4
    // Offset: 0x140
    float m_KeyboardZTranslateSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98365C
    // private System.Single m_MouseXTranslateSensitivity
    // Size: 0x4
    // Offset: 0x144
    float m_MouseXTranslateSensitivity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x9836A8
    // private System.Single m_MouseYTranslateSensitivity
    // Size: 0x4
    // Offset: 0x148
    float m_MouseYTranslateSensitivity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x9836F4
    // private System.Single m_MouseScrollTranslateSensitivity
    // Size: 0x4
    // Offset: 0x14C
    float m_MouseScrollTranslateSensitivity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x983740
    // private System.Single m_MouseXRotateSensitivity
    // Size: 0x4
    // Offset: 0x150
    float m_MouseXRotateSensitivity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98378C
    // private System.Single m_MouseYRotateSensitivity
    // Size: 0x4
    // Offset: 0x154
    float m_MouseYRotateSensitivity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x9837D8
    // private System.Single m_MouseScrollRotateSensitivity
    // Size: 0x4
    // Offset: 0x158
    float m_MouseScrollRotateSensitivity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x983824
    // private System.Boolean m_MouseYRotateInvert
    // Size: 0x1
    // Offset: 0x15C
    bool m_MouseYRotateInvert;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_MouseYRotateInvert and: m_DesiredCursorLockMode
    char __padding46[0x3] = {};
    // [TooltipAttribute] Offset: 0x983870
    // private UnityEngine.CursorLockMode m_DesiredCursorLockMode
    // Size: 0x4
    // Offset: 0x160
    ::UnityEngine::CursorLockMode m_DesiredCursorLockMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::CursorLockMode) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.TransformationMode <mouseTransformationMode>k__BackingField
    // Size: 0x4
    // Offset: 0x164
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::TransformationMode mouseTransformationMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::TransformationMode) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRDeviceSimulator/UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.Axis2DTargets <axis2DTargets>k__BackingField
    // Size: 0x4
    // Offset: 0x168
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets axis2DTargets;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRDeviceSimulator::Axis2DTargets) == 0x4);
    // private System.Single m_KeyboardXTranslateInput
    // Size: 0x4
    // Offset: 0x16C
    float m_KeyboardXTranslateInput;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_KeyboardYTranslateInput
    // Size: 0x4
    // Offset: 0x170
    float m_KeyboardYTranslateInput;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_KeyboardZTranslateInput
    // Size: 0x4
    // Offset: 0x174
    float m_KeyboardZTranslateInput;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_ManipulateLeftInput
    // Size: 0x1
    // Offset: 0x178
    bool m_ManipulateLeftInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ManipulateRightInput
    // Size: 0x1
    // Offset: 0x179
    bool m_ManipulateRightInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ManipulateHeadInput
    // Size: 0x1
    // Offset: 0x17A
    bool m_ManipulateHeadInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ManipulateHeadInput and: m_MouseDeltaInput
    char __padding55[0x1] = {};
    // private UnityEngine.Vector2 m_MouseDeltaInput
    // Size: 0x8
    // Offset: 0x17C
    ::UnityEngine::Vector2 m_MouseDeltaInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_MouseScrollInput
    // Size: 0x8
    // Offset: 0x184
    ::UnityEngine::Vector2 m_MouseScrollInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean m_RotateModeOverrideInput
    // Size: 0x1
    // Offset: 0x18C
    bool m_RotateModeOverrideInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_NegateModeInput
    // Size: 0x1
    // Offset: 0x18D
    bool m_NegateModeInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_XConstraintInput
    // Size: 0x1
    // Offset: 0x18E
    bool m_XConstraintInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_YConstraintInput
    // Size: 0x1
    // Offset: 0x18F
    bool m_YConstraintInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ZConstraintInput
    // Size: 0x1
    // Offset: 0x190
    bool m_ZConstraintInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ResetInput
    // Size: 0x1
    // Offset: 0x191
    bool m_ResetInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ResetInput and: m_Axis2DInput
    char __padding63[0x2] = {};
    // private UnityEngine.Vector2 m_Axis2DInput
    // Size: 0x8
    // Offset: 0x194
    ::UnityEngine::Vector2 m_Axis2DInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_RestingHandAxis2DInput
    // Size: 0x8
    // Offset: 0x19C
    ::UnityEngine::Vector2 m_RestingHandAxis2DInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean m_GripInput
    // Size: 0x1
    // Offset: 0x1A4
    bool m_GripInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_TriggerInput
    // Size: 0x1
    // Offset: 0x1A5
    bool m_TriggerInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_PrimaryButtonInput
    // Size: 0x1
    // Offset: 0x1A6
    bool m_PrimaryButtonInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SecondaryButtonInput
    // Size: 0x1
    // Offset: 0x1A7
    bool m_SecondaryButtonInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_MenuInput
    // Size: 0x1
    // Offset: 0x1A8
    bool m_MenuInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Primary2DAxisClickInput
    // Size: 0x1
    // Offset: 0x1A9
    bool m_Primary2DAxisClickInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Secondary2DAxisClickInput
    // Size: 0x1
    // Offset: 0x1AA
    bool m_Secondary2DAxisClickInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Primary2DAxisTouchInput
    // Size: 0x1
    // Offset: 0x1AB
    bool m_Primary2DAxisTouchInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Secondary2DAxisTouchInput
    // Size: 0x1
    // Offset: 0x1AC
    bool m_Secondary2DAxisTouchInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_PrimaryTouchInput
    // Size: 0x1
    // Offset: 0x1AD
    bool m_PrimaryTouchInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SecondaryTouchInput
    // Size: 0x1
    // Offset: 0x1AE
    bool m_SecondaryTouchInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ManipulatedRestingHandAxis2D
    // Size: 0x1
    // Offset: 0x1AF
    bool m_ManipulatedRestingHandAxis2D;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Vector3 m_LeftControllerEuler
    // Size: 0xC
    // Offset: 0x1B0
    ::UnityEngine::Vector3 m_LeftControllerEuler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_RightControllerEuler
    // Size: 0xC
    // Offset: 0x1BC
    ::UnityEngine::Vector3 m_RightControllerEuler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_CenterEyeEuler
    // Size: 0xC
    // Offset: 0x1C8
    ::UnityEngine::Vector3 m_CenterEyeEuler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRSimulatedHMDState m_HMDState
    // Size: 0x75
    // Offset: 0x1D4
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedHMDState m_HMDState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedHMDState) == 0x75);
    // Padding between fields: m_HMDState and: m_LeftControllerState
    char __padding81[0x3] = {};
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRSimulatedControllerState m_LeftControllerState
    // Size: 0x3F
    // Offset: 0x24C
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedControllerState m_LeftControllerState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedControllerState) == 0x3F);
    // Padding between fields: m_LeftControllerState and: m_RightControllerState
    char __padding82[0x1] = {};
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRSimulatedControllerState m_RightControllerState
    // Size: 0x3F
    // Offset: 0x28C
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedControllerState m_RightControllerState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedControllerState) == 0x3F);
    // Padding between fields: m_RightControllerState and: m_HMDDevice
    char __padding83[0x5] = {};
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRSimulatedHMD m_HMDDevice
    // Size: 0x8
    // Offset: 0x2D0
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedHMD* m_HMDDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedHMD*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRSimulatedController m_LeftControllerDevice
    // Size: 0x8
    // Offset: 0x2D8
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedController* m_LeftControllerDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedController*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.Inputs.Simulation.XRSimulatedController m_RightControllerDevice
    // Size: 0x8
    // Offset: 0x2E0
    ::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedController* m_RightControllerDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Inputs::Simulation::XRSimulatedController*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.InputSystem.InputActionReference m_KeyboardXTranslateAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionReference*& dyn_m_KeyboardXTranslateAction();
    // Get instance field reference: private UnityEngine.InputSystem.InputActionReference m_KeyboardYTranslateAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionReference*& dyn_m_KeyboardYTranslateAction();
