// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.WebSockets.WebSocket
#include "System/Net/WebSockets/WebSocket.hpp"
// Including type: System.Net.WebSockets.WebSocketState
#include "System/Net/WebSockets/WebSocketState.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: System.Net.WebSockets.WebSocketCloseStatus
#include "System/Net/WebSockets/WebSocketCloseStatus.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
// Including type: System.ArraySegment`1
#include "System/ArraySegment_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net::WebSockets
namespace System::Net::WebSockets {
  // Skipping declaration: MessageOpcode because it is already included!
  // Forward declaring type: WebSocketReceiveResult
  class WebSocketReceiveResult;
  // Skipping declaration: MessageHeader because it is already included!
  // Forward declaring type: WebSocketError
  struct WebSocketError;
  // Forward declaring type: WebSocketMessageType
  struct WebSocketMessageType;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: Timer
  class Timer;
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
  // Forward declaring type: SemaphoreSlim
  class SemaphoreSlim;
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: RandomNumberGenerator
  class RandomNumberGenerator;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: UTF8Encoding
  class UTF8Encoding;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: System.Net.WebSockets
namespace System::Net::WebSockets {
  // Forward declaring type: ManagedWebSocket
  class ManagedWebSocket;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::WebSockets::ManagedWebSocket);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::WebSockets::ManagedWebSocket*, "System.Net.WebSockets", "ManagedWebSocket");
// Type namespace: System.Net.WebSockets
namespace System::Net::WebSockets {
  // WARNING Size may be invalid!
  // Autogenerated type: System.Net.WebSockets.ManagedWebSocket
  // [TokenAttribute] Offset: FFFFFFFF
  class ManagedWebSocket : public ::System::Net::WebSockets::WebSocket {
    public:
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::Utf8MessageState
    class Utf8MessageState;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::MessageOpcode
    struct MessageOpcode;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::MessageHeader
    struct MessageHeader;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::$$c
    class $$c;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::$SendFrameFallbackAsync$d__55
    struct $SendFrameFallbackAsync$d__55;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::$ReceiveAsyncPrivate$d__60
    struct $ReceiveAsyncPrivate$d__60;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::$HandleReceivedCloseAsync$d__61
    struct $HandleReceivedCloseAsync$d__61;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::$HandleReceivedPingPongAsync$d__62
    struct $HandleReceivedPingPongAsync$d__62;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::$CloseWithReceiveErrorAndThrowAsync$d__64
    struct $CloseWithReceiveErrorAndThrowAsync$d__64;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::$SendCloseFrameAsync$d__67
    struct $SendCloseFrameAsync$d__67;
    // Nested type: ::System::Net::WebSockets::ManagedWebSocket::$EnsureBufferContainsAsync$d__69
    struct $EnsureBufferContainsAsync$d__69;
    // Size: 0x1
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode
    // [TokenAttribute] Offset: FFFFFFFF
    struct MessageOpcode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Byte value__
      // Size: 0x1
      // Offset: 0x0
      uint8_t value;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      public:
      // Creating value type constructor for type: MessageOpcode
      constexpr MessageOpcode(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Continuation
      static constexpr const uint8_t Continuation = 0u;
      // Get static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Continuation
      static ::System::Net::WebSockets::ManagedWebSocket::MessageOpcode _get_Continuation();
      // Set static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Continuation
      static void _set_Continuation(::System::Net::WebSockets::ManagedWebSocket::MessageOpcode value);
      // static field const value: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Text
      static constexpr const uint8_t Text = 1u;
      // Get static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Text
      static ::System::Net::WebSockets::ManagedWebSocket::MessageOpcode _get_Text();
      // Set static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Text
      static void _set_Text(::System::Net::WebSockets::ManagedWebSocket::MessageOpcode value);
      // static field const value: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Binary
      static constexpr const uint8_t Binary = 2u;
      // Get static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Binary
      static ::System::Net::WebSockets::ManagedWebSocket::MessageOpcode _get_Binary();
      // Set static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Binary
      static void _set_Binary(::System::Net::WebSockets::ManagedWebSocket::MessageOpcode value);
      // static field const value: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Close
      static constexpr const uint8_t Close = 8u;
      // Get static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Close
      static ::System::Net::WebSockets::ManagedWebSocket::MessageOpcode _get_Close();
      // Set static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Close
      static void _set_Close(::System::Net::WebSockets::ManagedWebSocket::MessageOpcode value);
      // static field const value: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Ping
      static constexpr const uint8_t Ping = 9u;
      // Get static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Ping
      static ::System::Net::WebSockets::ManagedWebSocket::MessageOpcode _get_Ping();
      // Set static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Ping
      static void _set_Ping(::System::Net::WebSockets::ManagedWebSocket::MessageOpcode value);
      // static field const value: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Pong
      static constexpr const uint8_t Pong = 10u;
      // Get static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Pong
      static ::System::Net::WebSockets::ManagedWebSocket::MessageOpcode _get_Pong();
      // Set static field: static public System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Pong
      static void _set_Pong(::System::Net::WebSockets::ManagedWebSocket::MessageOpcode value);
      // Get instance field reference: public System.Byte value__
      [[deprecated("Use field access instead!")]] uint8_t& dyn_value__();
    }; // System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode
    #pragma pack(pop)
    static check_size<sizeof(ManagedWebSocket::MessageOpcode), 0 + sizeof(uint8_t)> __System_Net_WebSockets_ManagedWebSocket_MessageOpcodeSizeCheck;
    static_assert(sizeof(ManagedWebSocket::MessageOpcode) == 0x1);
    // Size: 0x14
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageHeader
    // [TokenAttribute] Offset: FFFFFFFF
    struct MessageHeader/*, public ::System::ValueType*/ {
      public:
      public:
      // System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Opcode
      // Size: 0x1
      // Offset: 0x0
      ::System::Net::WebSockets::ManagedWebSocket::MessageOpcode Opcode;
      // Field size check
      static_assert(sizeof(::System::Net::WebSockets::ManagedWebSocket::MessageOpcode) == 0x1);
      // System.Boolean Fin
      // Size: 0x1
      // Offset: 0x1
      bool Fin;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: Fin and: PayloadLength
      char __padding1[0x6] = {};
      // System.Int64 PayloadLength
      // Size: 0x8
      // Offset: 0x8
      int64_t PayloadLength;
      // Field size check
      static_assert(sizeof(int64_t) == 0x8);
      // System.Int32 Mask
      // Size: 0x4
      // Offset: 0x10
      int Mask;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: MessageHeader
      constexpr MessageHeader(::System::Net::WebSockets::ManagedWebSocket::MessageOpcode Opcode_ = {}, bool Fin_ = {}, int64_t PayloadLength_ = {}, int Mask_ = {}) noexcept : Opcode{Opcode_}, Fin{Fin_}, PayloadLength{PayloadLength_}, Mask{Mask_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageOpcode Opcode
      [[deprecated("Use field access instead!")]] ::System::Net::WebSockets::ManagedWebSocket::MessageOpcode& dyn_Opcode();
      // Get instance field reference: System.Boolean Fin
      [[deprecated("Use field access instead!")]] bool& dyn_Fin();
      // Get instance field reference: System.Int64 PayloadLength
      [[deprecated("Use field access instead!")]] int64_t& dyn_PayloadLength();
      // Get instance field reference: System.Int32 Mask
      [[deprecated("Use field access instead!")]] int& dyn_Mask();
    }; // System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageHeader
    #pragma pack(pop)
    static check_size<sizeof(ManagedWebSocket::MessageHeader), 16 + sizeof(int)> __System_Net_WebSockets_ManagedWebSocket_MessageHeaderSizeCheck;
    static_assert(sizeof(ManagedWebSocket::MessageHeader) == 0x14);
    public:
    // private readonly System.IO.Stream _stream
    // Size: 0x8
    // Offset: 0x10
    ::System::IO::Stream* stream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private readonly System.Boolean _isServer
    // Size: 0x1
    // Offset: 0x18
    bool isServer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.String _subprotocol
    // Size: 0x8
    // Offset: 0x20
    ::StringW subprotocol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.Threading.Timer _keepAliveTimer
    // Size: 0x8
    // Offset: 0x28
    ::System::Threading::Timer* keepAliveTimer;
    // Field size check
    static_assert(sizeof(::System::Threading::Timer*) == 0x8);
    // private readonly System.Threading.CancellationTokenSource _abortSource
    // Size: 0x8
    // Offset: 0x30
    ::System::Threading::CancellationTokenSource* abortSource;
    // Field size check
    static_assert(sizeof(::System::Threading::CancellationTokenSource*) == 0x8);
    // private System.Byte[] _receiveBuffer
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<uint8_t> receiveBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private readonly System.Boolean _receiveBufferFromPool
    // Size: 0x1
    // Offset: 0x40
    bool receiveBufferFromPool;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.Utf8MessageState _utf8TextState
    // Size: 0x8
    // Offset: 0x48
    ::System::Net::WebSockets::ManagedWebSocket::Utf8MessageState* utf8TextState;
    // Field size check
    static_assert(sizeof(::System::Net::WebSockets::ManagedWebSocket::Utf8MessageState*) == 0x8);
    // private readonly System.Threading.SemaphoreSlim _sendFrameAsyncLock
    // Size: 0x8
    // Offset: 0x50
    ::System::Threading::SemaphoreSlim* sendFrameAsyncLock;
    // Field size check
    static_assert(sizeof(::System::Threading::SemaphoreSlim*) == 0x8);
    // private System.Net.WebSockets.WebSocketState _state
    // Size: 0x4
    // Offset: 0x58
    ::System::Net::WebSockets::WebSocketState state;
    // Field size check
    static_assert(sizeof(::System::Net::WebSockets::WebSocketState) == 0x4);
    // private System.Boolean _disposed
    // Size: 0x1
    // Offset: 0x5C
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _sentCloseFrame
    // Size: 0x1
    // Offset: 0x5D
    bool sentCloseFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _receivedCloseFrame
    // Size: 0x1
    // Offset: 0x5E
    bool receivedCloseFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Net.WebSockets.WebSocketCloseStatus> _closeStatus
    // Size: 0xFFFFFFFF
    // Offset: 0x60
    ::System::Nullable_1<::System::Net::WebSockets::WebSocketCloseStatus> closeStatus;
    // private System.String _closeStatusDescription
    // Size: 0x8
    // Offset: 0x68
    ::StringW closeStatusDescription;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Net.WebSockets.ManagedWebSocket/System.Net.WebSockets.MessageHeader _lastReceiveHeader
    // Size: 0x14
    // Offset: 0x70
    ::System::Net::WebSockets::ManagedWebSocket::MessageHeader lastReceiveHeader;
    // Field size check
    static_assert(sizeof(::System::Net::WebSockets::ManagedWebSocket::MessageHeader) == 0x14);
    // private System.Int32 _receiveBufferOffset
    // Size: 0x4
    // Offset: 0x88
    int receiveBufferOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _receiveBufferCount
    // Size: 0x4
    // Offset: 0x8C
    int receiveBufferCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _receivedMaskOffsetOffset
    // Size: 0x4
    // Offset: 0x90
    int receivedMaskOffsetOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Byte[] _sendBuffer
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<uint8_t> sendBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Boolean _lastSendWasFragment
    // Size: 0x1
    // Offset: 0xA0
    bool lastSendWasFragment;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Threading.Tasks.Task _lastSendAsync
    // Size: 0x8
    // Offset: 0xA8
    ::System::Threading::Tasks::Task* lastSendAsync;
    // Field size check
    static_assert(sizeof(::System::Threading::Tasks::Task*) == 0x8);
    // private System.Threading.Tasks.Task`1<System.Net.WebSockets.WebSocketReceiveResult> _lastReceiveAsync
    // Size: 0x8
    // Offset: 0xB0
    ::System::Threading::Tasks::Task_1<::System::Net::WebSockets::WebSocketReceiveResult*>* lastReceiveAsync;
    // Field size check
    static_assert(sizeof(::System::Threading::Tasks::Task_1<::System::Net::WebSockets::WebSocketReceiveResult*>*) == 0x8);
    public:
    // Get static field: static private readonly System.Security.Cryptography.RandomNumberGenerator s_random
    static ::System::Security::Cryptography::RandomNumberGenerator* _get_s_random();
    // Set static field: static private readonly System.Security.Cryptography.RandomNumberGenerator s_random
    static void _set_s_random(::System::Security::Cryptography::RandomNumberGenerator* value);
    // Get static field: static private readonly System.Text.UTF8Encoding s_textEncoding
    static ::System::Text::UTF8Encoding* _get_s_textEncoding();
    // Set static field: static private readonly System.Text.UTF8Encoding s_textEncoding
