// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Mono.Security.Protocol.Ntlm.MessageBase
#include "Mono/Security/Protocol/Ntlm/MessageBase.hpp"
// Including type: Mono.Security.Protocol.Ntlm.NtlmAuthLevel
#include "Mono/Security/Protocol/Ntlm/NtlmAuthLevel.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Security::Protocol::Ntlm
namespace Mono::Security::Protocol::Ntlm {
  // Forward declaring type: Type2Message
  class Type2Message;
}
// Completed forward declares
// Type namespace: Mono.Security.Protocol.Ntlm
namespace Mono::Security::Protocol::Ntlm {
  // Autogenerated type: Mono.Security.Protocol.Ntlm.Type3Message
  class Type3Message : public Mono::Security::Protocol::Ntlm::MessageBase {
    public:
    // private Mono.Security.Protocol.Ntlm.NtlmAuthLevel _level
    // Offset: 0x18
    Mono::Security::Protocol::Ntlm::NtlmAuthLevel level;
    // private System.Byte[] _challenge
    // Offset: 0x20
    ::Array<uint8_t>* challenge;
    // private System.String _host
    // Offset: 0x28
    ::Il2CppString* host;
    // private System.String _domain
    // Offset: 0x30
    ::Il2CppString* domain;
    // private System.String _username
    // Offset: 0x38
    ::Il2CppString* username;
    // private System.String _password
    // Offset: 0x40
    ::Il2CppString* password;
    // private Mono.Security.Protocol.Ntlm.Type2Message _type2
    // Offset: 0x48
    Mono::Security::Protocol::Ntlm::Type2Message* type2;
    // private System.Byte[] _lm
    // Offset: 0x50
    ::Array<uint8_t>* lm;
    // private System.Byte[] _nt
    // Offset: 0x58
    ::Array<uint8_t>* nt;
    // public System.Void .ctor(Mono.Security.Protocol.Ntlm.Type2Message type2)
    // Offset: 0x192D134
    static Type3Message* New_ctor(Mono::Security::Protocol::Ntlm::Type2Message* type2);
    // public System.Void set_Domain(System.String value)
    // Offset: 0x192D430
    void set_Domain(::Il2CppString* value);
    // public System.Void set_Password(System.String value)
    // Offset: 0x192D4C0
    void set_Password(::Il2CppString* value);
    // public System.Void set_Username(System.String value)
    // Offset: 0x192D4C8
    void set_Username(::Il2CppString* value);
    // private System.String DecodeString(System.Byte[] buffer, System.Int32 offset, System.Int32 len)
    // Offset: 0x192D740
    ::Il2CppString* DecodeString(::Array<uint8_t>* buffer, int offset, int len);
    // private System.Byte[] EncodeString(System.String text)
    // Offset: 0x192D7A4
    ::Array<uint8_t>* EncodeString(::Il2CppString* text);
    // protected override System.Void Finalize()
    // Offset: 0x192D37C
    // Implemented from: System.Object
    // Base method: System.Void Object::Finalize()
    void Finalize();
    // protected override System.Void Decode(System.Byte[] message)
    // Offset: 0x192D4D0
    // Implemented from: Mono.Security.Protocol.Ntlm.MessageBase
    // Base method: System.Void MessageBase::Decode(System.Byte[] message)
    void Decode(::Array<uint8_t>* message);
    // public override System.Byte[] GetBytes()
    // Offset: 0x192D848
    // Implemented from: Mono.Security.Protocol.Ntlm.MessageBase
    // Base method: System.Byte[] MessageBase::GetBytes()
    ::Array<uint8_t>* GetBytes();
  }; // Mono.Security.Protocol.Ntlm.Type3Message
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Mono::Security::Protocol::Ntlm::Type3Message*, "Mono.Security.Protocol.Ntlm", "Type3Message");
#pragma pack(pop)
