// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.EventSystems.BaseRaycaster
#include "UnityEngine/EventSystems/BaseRaycaster.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Ray
  struct Ray;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Canvas
  class Canvas;
}
// Forward declaring namespace: VRUIControls
namespace VRUIControls {
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Graphic
  class Graphic;
}
// Completed forward declares
// Type namespace: VRUIControls
namespace VRUIControls {
  // Autogenerated type: VRUIControls.VRGraphicRaycaster
  class VRGraphicRaycaster : public UnityEngine::EventSystems::BaseRaycaster {
    public:
    // Nested type: VRUIControls::VRGraphicRaycaster::TGraphicRaycastResult
    struct TGraphicRaycastResult;
    // Nested type: VRUIControls::VRGraphicRaycaster::$$c
    class $$c;
    // Autogenerated type: VRUIControls.VRGraphicRaycaster/TGraphicRaycastResult
    struct TGraphicRaycastResult : public System::ValueType {
      public:
      // public UnityEngine.UI.Graphic graphic
      // Offset: 0x0
      UnityEngine::UI::Graphic* graphic;
      // public System.Single distance
      // Offset: 0x8
      float distance;
      // public UnityEngine.Vector3 position
      // Offset: 0xC
      UnityEngine::Vector3 position;
      // public UnityEngine.Vector2 pointerPosition
      // Offset: 0x18
      UnityEngine::Vector2 pointerPosition;
      // Creating value type constructor for type: TGraphicRaycastResult
      constexpr TGraphicRaycastResult(UnityEngine::UI::Graphic* graphic_ = {}, float distance_ = {}, UnityEngine::Vector3 position_ = {}, UnityEngine::Vector2 pointerPosition_ = {}) noexcept : graphic{graphic_}, distance{distance_}, position{position_}, pointerPosition{pointerPosition_} {}
      // public override System.String ToString()
      // Offset: 0xA5D99C
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::Il2CppString* ToString();
    }; // VRUIControls.VRGraphicRaycaster/TGraphicRaycastResult
    // private UnityEngine.LayerMask _blockingMask
    // Offset: 0x20
    UnityEngine::LayerMask blockingMask;
    // private UnityEngine.Camera _mainCamera
    // Offset: 0x28
    UnityEngine::Camera* mainCamera;
    // private UnityEngine.Canvas _canvas
    // Offset: 0x30
    UnityEngine::Canvas* canvas;
    // private UnityEngine.Camera _eventCamera
    // Offset: 0x38
    UnityEngine::Camera* eventCamera;
    // private readonly System.Collections.Generic.List`1<VRUIControls.VRGraphicRaycaster/TGraphicRaycastResult> _raycastResults
    // Offset: 0x40
    System::Collections::Generic::List_1<VRUIControls::VRGraphicRaycaster::TGraphicRaycastResult>* raycastResults;
    // Get static field: static private System.Collections.Generic.List`1<VRUIControls.VRGraphicRaycaster/TGraphicRaycastResult> _sortedGraphics
    static System::Collections::Generic::List_1<VRUIControls::VRGraphicRaycaster::TGraphicRaycastResult>* _get__sortedGraphics();
    // Set static field: static private System.Collections.Generic.List`1<VRUIControls.VRGraphicRaycaster/TGraphicRaycastResult> _sortedGraphics
    static void _set__sortedGraphics(System::Collections::Generic::List_1<VRUIControls::VRGraphicRaycaster::TGraphicRaycastResult>* value);
    // private UnityEngine.Canvas get_canvas()
    // Offset: 0x1939090
    UnityEngine::Canvas* get_canvas();
    // static private System.Void NoDomainReloadInit()
    // Offset: 0x19391EC
    static void NoDomainReloadInit();
    // static private System.Void Raycast(UnityEngine.Canvas canvas, UnityEngine.Ray ray, System.Single hitDistance, UnityEngine.Camera eventCamera, System.Collections.Generic.List`1<VRUIControls.VRGraphicRaycaster/TGraphicRaycastResult> results)
    // Offset: 0x1939794
    static void Raycast(UnityEngine::Canvas* canvas, UnityEngine::Ray ray, float hitDistance, UnityEngine::Camera* eventCamera, System::Collections::Generic::List_1<VRUIControls::VRGraphicRaycaster::TGraphicRaycastResult>* results);
    // public override UnityEngine.Camera get_eventCamera()
    // Offset: 0x1939110
    // Implemented from: UnityEngine.EventSystems.BaseRaycaster
    // Base method: UnityEngine.Camera BaseRaycaster::get_eventCamera()
    UnityEngine::Camera* get_eventCamera();
    // public override System.Void Raycast(UnityEngine.EventSystems.PointerEventData eventData, System.Collections.Generic.List`1<UnityEngine.EventSystems.RaycastResult> resultAppendList)
    // Offset: 0x193927C
    // Implemented from: UnityEngine.EventSystems.BaseRaycaster
    // Base method: System.Void BaseRaycaster::Raycast(UnityEngine.EventSystems.PointerEventData eventData, System.Collections.Generic.List`1<UnityEngine.EventSystems.RaycastResult> resultAppendList)
    void Raycast(UnityEngine::EventSystems::PointerEventData* eventData, System::Collections::Generic::List_1<UnityEngine::EventSystems::RaycastResult>* resultAppendList);
    // public System.Void .ctor()
    // Offset: 0x1939DCC
    // Implemented from: UnityEngine.EventSystems.BaseRaycaster
    // Base method: System.Void BaseRaycaster::.ctor()
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    static VRGraphicRaycaster* New_ctor();
    // static private System.Void .cctor()
    // Offset: 0x1939E58
    // Implemented from: UnityEngine.Object
    // Base method: System.Void Object::.cctor()
    static void _cctor();
  }; // VRUIControls.VRGraphicRaycaster
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(VRUIControls::VRGraphicRaycaster*, "VRUIControls", "VRGraphicRaycaster");
DEFINE_IL2CPP_ARG_TYPE(VRUIControls::VRGraphicRaycaster::TGraphicRaycastResult, "VRUIControls", "VRGraphicRaycaster/TGraphicRaycastResult");
#pragma pack(pop)
