// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Tweening.InterpolationType
#include "Tweening/InterpolationType.hpp"
// Including type: Tweening.EaseType
#include "Tweening/EaseType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
}
// Completed forward declares
// Type namespace: Tweening
namespace Tweening {
  // Autogenerated type: Tweening.Tween
  class Tween : public ::Il2CppObject {
    public:
    // private System.Single <time>k__BackingField
    // Offset: 0x10
    float time;
    // private System.Single <duration>k__BackingField
    // Offset: 0x14
    float duration;
    // private System.Boolean <loop>k__BackingField
    // Offset: 0x18
    bool loop;
    // private System.Single <delay>k__BackingField
    // Offset: 0x1C
    float delay;
    // public System.Action onStart
    // Offset: 0x20
    System::Action* onStart;
    // public System.Action onCompleted
    // Offset: 0x28
    System::Action* onCompleted;
    // public System.Action onKilled
    // Offset: 0x30
    System::Action* onKilled;
    // private System.Boolean <isStarted>k__BackingField
    // Offset: 0x38
    bool isStarted;
    // private System.Boolean <isKilled>k__BackingField
    // Offset: 0x39
    bool isKilled;
    // private Tweening.InterpolationType <interpolationType>k__BackingField
    // Offset: 0x3C
    Tweening::InterpolationType interpolationType;
    // private Tweening.EaseType <easeType>k__BackingField
    // Offset: 0x40
    Tweening::EaseType easeType;
    // private UnityEngine.AnimationCurve <animationCurve>k__BackingField
    // Offset: 0x48
    UnityEngine::AnimationCurve* animationCurve;
    // public System.Single get_progress()
    // Offset: 0x1FA2DAC
    float get_progress();
    // public System.Single get_time()
    // Offset: 0x1FA2E48
    float get_time();
    // protected System.Void set_time(System.Single value)
    // Offset: 0x1FA2E50
    void set_time(float value);
    // public System.Single get_duration()
    // Offset: 0x1FA2E58
    float get_duration();
    // public System.Void set_duration(System.Single value)
    // Offset: 0x1FA2E60
    void set_duration(float value);
    // public System.Boolean get_loop()
    // Offset: 0x1FA2E68
    bool get_loop();
    // public System.Void set_loop(System.Boolean value)
    // Offset: 0x1FA2E70
    void set_loop(bool value);
    // public System.Single get_delay()
    // Offset: 0x1FA2E7C
    float get_delay();
    // public System.Void set_delay(System.Single value)
    // Offset: 0x1FA2E84
    void set_delay(float value);
    // public System.Boolean get_isStarted()
    // Offset: 0x1FA2E8C
    bool get_isStarted();
    // protected System.Void set_isStarted(System.Boolean value)
    // Offset: 0x1FA2E94
    void set_isStarted(bool value);
    // public System.Boolean get_isActive()
    // Offset: 0x1FA2EA0
    bool get_isActive();
    // public System.Boolean get_isComplete()
    // Offset: 0x1FA2ED0
    bool get_isComplete();
    // public System.Boolean get_isKilled()
    // Offset: 0x1FA2EF0
    bool get_isKilled();
    // private System.Void set_isKilled(System.Boolean value)
    // Offset: 0x1FA2EF8
    void set_isKilled(bool value);
    // public Tweening.InterpolationType get_interpolationType()
    // Offset: 0x1FA2F04
    Tweening::InterpolationType get_interpolationType();
    // protected System.Void set_interpolationType(Tweening.InterpolationType value)
    // Offset: 0x1FA2F0C
    void set_interpolationType(Tweening::InterpolationType value);
    // public Tweening.EaseType get_easeType()
    // Offset: 0x1FA2F14
    Tweening::EaseType get_easeType();
    // public System.Void set_easeType(Tweening.EaseType value)
    // Offset: 0x1FA2F1C
    void set_easeType(Tweening::EaseType value);
    // public UnityEngine.AnimationCurve get_animationCurve()
    // Offset: 0x1FA2F24
    UnityEngine::AnimationCurve* get_animationCurve();
    // protected System.Void set_animationCurve(UnityEngine.AnimationCurve value)
    // Offset: 0x1FA2F2C
    void set_animationCurve(UnityEngine::AnimationCurve* value);
    // public System.Void Kill()
    // Offset: 0x1FA2F34
    void Kill();
    // public System.Void Restart()
    // Offset: 0x1FA2F40
    void Restart();
    // public System.Void Update(System.Single deltaTime)
    // Offset: 0xFFFFFFFF
    void Update(float deltaTime);
    // public System.Void Sample(System.Single t)
    // Offset: 0xFFFFFFFF
    void Sample(float t);
    // protected System.Single Interpolate(System.Single t)
    // Offset: 0x1FA2784
    float Interpolate(float t);
    // protected System.Void .ctor()
    // Offset: 0x1FA2F4C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static Tween* New_ctor();
  }; // Tweening.Tween
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Tweening::Tween*, "Tweening", "Tween");
#pragma pack(pop)
