// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Threading.CancellationTokenRegistration
#include "System/Threading/CancellationTokenRegistration.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
  // Forward declaring type: SparselyPopulatedArray`1<T>
  template<typename T>
  class SparselyPopulatedArray_1;
  // Forward declaring type: CancellationCallbackInfo
  class CancellationCallbackInfo;
  // Forward declaring type: Timer
  class Timer;
  // Forward declaring type: TimerCallback
  class TimerCallback;
  // Forward declaring type: CancellationToken
  struct CancellationToken;
  // Forward declaring type: SynchronizationContext
  class SynchronizationContext;
  // Forward declaring type: ExecutionContext
  class ExecutionContext;
  // Forward declaring type: CancellationCallbackCoreWorkArguments
  struct CancellationCallbackCoreWorkArguments;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: TimeSpan
  struct TimeSpan;
}
// Completed forward declares
// Type namespace: System.Threading
namespace System::Threading {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: System.Threading.CancellationTokenSource
  // [ComVisibleAttribute] Offset: D7CD34
  class CancellationTokenSource : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // private System.Threading.ManualResetEvent m_kernelEvent
    // Size: 0x8
    // Offset: 0x10
    System::Threading::ManualResetEvent* m_kernelEvent;
    // Field size check
    static_assert(sizeof(System::Threading::ManualResetEvent*) == 0x8);
    // private System.Threading.SparselyPopulatedArray`1<System.Threading.CancellationCallbackInfo>[] m_registeredCallbacksLists
    // Size: 0x8
    // Offset: 0x18
    ::Array<System::Threading::SparselyPopulatedArray_1<System::Threading::CancellationCallbackInfo*>*>* m_registeredCallbacksLists;
    // Field size check
    static_assert(sizeof(::Array<System::Threading::SparselyPopulatedArray_1<System::Threading::CancellationCallbackInfo*>*>*) == 0x8);
    // private System.Int32 m_state
    // Size: 0x4
    // Offset: 0x20
    int m_state;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_threadIDExecutingCallbacks
    // Size: 0x4
    // Offset: 0x24
    int m_threadIDExecutingCallbacks;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_disposed
    // Size: 0x1
    // Offset: 0x28
    bool m_disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_disposed and: m_linkingRegistrations
    char __padding4[0x7] = {};
    // private System.Threading.CancellationTokenRegistration[] m_linkingRegistrations
    // Size: 0x8
    // Offset: 0x30
    ::Array<System::Threading::CancellationTokenRegistration>* m_linkingRegistrations;
    // Field size check
    static_assert(sizeof(::Array<System::Threading::CancellationTokenRegistration>*) == 0x8);
    // private System.Threading.CancellationCallbackInfo m_executingCallback
    // Size: 0x8
    // Offset: 0x38
    System::Threading::CancellationCallbackInfo* m_executingCallback;
    // Field size check
    static_assert(sizeof(System::Threading::CancellationCallbackInfo*) == 0x8);
    // private System.Threading.Timer m_timer
    // Size: 0x8
    // Offset: 0x40
    System::Threading::Timer* m_timer;
    // Field size check
    static_assert(sizeof(System::Threading::Timer*) == 0x8);
    // Creating value type constructor for type: CancellationTokenSource
