// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Threading.CancellationTokenRegistration
#include "System/Threading/CancellationTokenRegistration.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
  // Forward declaring type: SparselyPopulatedArray`1<T>
  template<typename T>
  class SparselyPopulatedArray_1;
  // Forward declaring type: CancellationCallbackInfo
  class CancellationCallbackInfo;
  // Forward declaring type: Timer
  class Timer;
  // Forward declaring type: TimerCallback
  class TimerCallback;
  // Forward declaring type: CancellationToken
  struct CancellationToken;
  // Forward declaring type: SynchronizationContext
  class SynchronizationContext;
  // Forward declaring type: ExecutionContext
  class ExecutionContext;
  // Forward declaring type: CancellationCallbackCoreWorkArguments
  struct CancellationCallbackCoreWorkArguments;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: TimeSpan
  struct TimeSpan;
}
// Completed forward declares
// Type namespace: System.Threading
namespace System::Threading {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: System.Threading.CancellationTokenSource
  // [] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: C95A08
  class CancellationTokenSource : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // private System.Threading.ManualResetEvent m_kernelEvent
    // Size: 0x8
    // Offset: 0x10
    System::Threading::ManualResetEvent* m_kernelEvent;
    // Field size check
    static_assert(sizeof(System::Threading::ManualResetEvent*) == 0x8);
    // private System.Threading.SparselyPopulatedArray`1<System.Threading.CancellationCallbackInfo>[] m_registeredCallbacksLists
    // Size: 0x8
    // Offset: 0x18
    ::Array<System::Threading::SparselyPopulatedArray_1<System::Threading::CancellationCallbackInfo*>*>* m_registeredCallbacksLists;
    // Field size check
    static_assert(sizeof(::Array<System::Threading::SparselyPopulatedArray_1<System::Threading::CancellationCallbackInfo*>*>*) == 0x8);
    // private System.Int32 m_state
    // Size: 0x4
    // Offset: 0x20
    int m_state;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_threadIDExecutingCallbacks
    // Size: 0x4
    // Offset: 0x24
    int m_threadIDExecutingCallbacks;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_disposed
    // Size: 0x1
    // Offset: 0x28
    bool m_disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_disposed and: m_linkingRegistrations
    char __padding4[0x7] = {};
    // private System.Threading.CancellationTokenRegistration[] m_linkingRegistrations
    // Size: 0x8
    // Offset: 0x30
    ::Array<System::Threading::CancellationTokenRegistration>* m_linkingRegistrations;
    // Field size check
    static_assert(sizeof(::Array<System::Threading::CancellationTokenRegistration>*) == 0x8);
    // private System.Threading.CancellationCallbackInfo m_executingCallback
    // Size: 0x8
    // Offset: 0x38
    System::Threading::CancellationCallbackInfo* m_executingCallback;
    // Field size check
    static_assert(sizeof(System::Threading::CancellationCallbackInfo*) == 0x8);
    // private System.Threading.Timer m_timer
    // Size: 0x8
    // Offset: 0x40
    System::Threading::Timer* m_timer;
    // Field size check
    static_assert(sizeof(System::Threading::Timer*) == 0x8);
    // Creating value type constructor for type: CancellationTokenSource
    CancellationTokenSource(System::Threading::ManualResetEvent* m_kernelEvent_ = {}, ::Array<System::Threading::SparselyPopulatedArray_1<System::Threading::CancellationCallbackInfo*>*>* m_registeredCallbacksLists_ = {}, int m_state_ = {}, int m_threadIDExecutingCallbacks_ = {}, bool m_disposed_ = {}, ::Array<System::Threading::CancellationTokenRegistration>* m_linkingRegistrations_ = {}, System::Threading::CancellationCallbackInfo* m_executingCallback_ = {}, System::Threading::Timer* m_timer_ = {}) noexcept : m_kernelEvent{m_kernelEvent_}, m_registeredCallbacksLists{m_registeredCallbacksLists_}, m_state{m_state_}, m_threadIDExecutingCallbacks{m_threadIDExecutingCallbacks_}, m_disposed{m_disposed_}, m_linkingRegistrations{m_linkingRegistrations_}, m_executingCallback{m_executingCallback_}, m_timer{m_timer_} {}
    // Creating interface conversion operator: operator System::IDisposable
    operator System::IDisposable() noexcept {
      return *reinterpret_cast<System::IDisposable*>(this);
    }
    // Get static field: static private readonly System.Threading.CancellationTokenSource _staticSource_Set
    static System::Threading::CancellationTokenSource* _get__staticSource_Set();
    // Set static field: static private readonly System.Threading.CancellationTokenSource _staticSource_Set
    static void _set__staticSource_Set(System::Threading::CancellationTokenSource* value);
    // Get static field: static private readonly System.Threading.CancellationTokenSource _staticSource_NotCancelable
    static System::Threading::CancellationTokenSource* _get__staticSource_NotCancelable();
    // Set static field: static private readonly System.Threading.CancellationTokenSource _staticSource_NotCancelable
    static void _set__staticSource_NotCancelable(System::Threading::CancellationTokenSource* value);
    // Get static field: static private readonly System.Int32 s_nLists
    static int _get_s_nLists();
    // Set static field: static private readonly System.Int32 s_nLists
    static void _set_s_nLists(int value);
    // static field const value: static private System.Int32 CANNOT_BE_CANCELED
    static constexpr const int CANNOT_BE_CANCELED = 0;
    // Get static field: static private System.Int32 CANNOT_BE_CANCELED
    static int _get_CANNOT_BE_CANCELED();
    // Set static field: static private System.Int32 CANNOT_BE_CANCELED
    static void _set_CANNOT_BE_CANCELED(int value);
    // static field const value: static private System.Int32 NOT_CANCELED
    static constexpr const int NOT_CANCELED = 1;
    // Get static field: static private System.Int32 NOT_CANCELED
    static int _get_NOT_CANCELED();
    // Set static field: static private System.Int32 NOT_CANCELED
    static void _set_NOT_CANCELED(int value);
    // static field const value: static private System.Int32 NOTIFYING
    static constexpr const int NOTIFYING = 2;
    // Get static field: static private System.Int32 NOTIFYING
    static int _get_NOTIFYING();
    // Set static field: static private System.Int32 NOTIFYING
    static void _set_NOTIFYING(int value);
    // static field const value: static private System.Int32 NOTIFYINGCOMPLETE
    static constexpr const int NOTIFYINGCOMPLETE = 3;
    // Get static field: static private System.Int32 NOTIFYINGCOMPLETE
    static int _get_NOTIFYINGCOMPLETE();
    // Set static field: static private System.Int32 NOTIFYINGCOMPLETE
    static void _set_NOTIFYINGCOMPLETE(int value);
    // Get static field: static private readonly System.Action`1<System.Object> s_LinkedTokenCancelDelegate
    static System::Action_1<::Il2CppObject*>* _get_s_LinkedTokenCancelDelegate();
    // Set static field: static private readonly System.Action`1<System.Object> s_LinkedTokenCancelDelegate
    static void _set_s_LinkedTokenCancelDelegate(System::Action_1<::Il2CppObject*>* value);
    // Get static field: static private readonly System.Threading.TimerCallback s_timerCallback
    static System::Threading::TimerCallback* _get_s_timerCallback();
    // Set static field: static private readonly System.Threading.TimerCallback s_timerCallback
    static void _set_s_timerCallback(System::Threading::TimerCallback* value);
    // static private System.Void LinkedTokenCancelDelegate(System.Object source)
    // Offset: 0x16FA408
    static void LinkedTokenCancelDelegate(::Il2CppObject* source);
    // public System.Boolean get_IsCancellationRequested()
    // Offset: 0x16F9320
    bool get_IsCancellationRequested();
    // System.Boolean get_IsCancellationCompleted()
    // Offset: 0x16FA1B8
    bool get_IsCancellationCompleted();
    // System.Boolean get_IsDisposed()
    // Offset: 0x16FA4BC
    bool get_IsDisposed();
    // System.Void set_ThreadIDExecutingCallbacks(System.Int32 value)
    // Offset: 0x16FA4C4
    void set_ThreadIDExecutingCallbacks(int value);
    // System.Int32 get_ThreadIDExecutingCallbacks()
    // Offset: 0x16FA1E0
    int get_ThreadIDExecutingCallbacks();
    // public System.Threading.CancellationToken get_Token()
    // Offset: 0x16FA4EC
    System::Threading::CancellationToken get_Token();
    // System.Boolean get_CanBeCanceled()
    // Offset: 0x16F9380
    bool get_CanBeCanceled();
    // System.Threading.CancellationCallbackInfo get_ExecutingCallback()
    // Offset: 0x16FA57C
    System::Threading::CancellationCallbackInfo* get_ExecutingCallback();
    // private System.Void .ctor(System.Boolean set)
    // Offset: 0x16FA5E0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CancellationTokenSource* New_ctor(bool set) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Threading::CancellationTokenSource::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CancellationTokenSource*, creationType>(set)));
    }
    // public System.Void Cancel()
    // Offset: 0x16FA494
    void Cancel();
    // public System.Void Cancel(System.Boolean throwOnFirstException)
    // Offset: 0x16FA634
    void Cancel(bool throwOnFirstException);
    // public System.Void CancelAfter(System.TimeSpan delay)
    // Offset: 0x16FA7D0
    void CancelAfter(System::TimeSpan delay);
    // public System.Void CancelAfter(System.Int32 millisecondsDelay)
    // Offset: 0x16FA880
    void CancelAfter(int millisecondsDelay);
    // static private System.Void TimerCallbackLogic(System.Object obj)
    // Offset: 0x16FAA68
    static void TimerCallbackLogic(::Il2CppObject* obj);
    // public System.Void Dispose()
    // Offset: 0x16FAB98
    void Dispose();
    // protected System.Void Dispose(System.Boolean disposing)
    // Offset: 0x16FAC14
    void Dispose(bool disposing);
    // System.Void ThrowIfDisposed()
    // Offset: 0x16FA510
    void ThrowIfDisposed();
    // static private System.Void ThrowObjectDisposedException()
    // Offset: 0x16FACF8
    static void ThrowObjectDisposedException();
    // static System.Threading.CancellationTokenSource InternalGetStaticSource(System.Boolean set)
    // Offset: 0x16F9C64
    static System::Threading::CancellationTokenSource* InternalGetStaticSource(bool set);
    // System.Threading.CancellationTokenRegistration InternalRegister(System.Action`1<System.Object> callback, System.Object stateForCallback, System.Threading.SynchronizationContext targetSyncContext, System.Threading.ExecutionContext executionContext)
    // Offset: 0x16F98E8
    System::Threading::CancellationTokenRegistration InternalRegister(System::Action_1<::Il2CppObject*>* callback, ::Il2CppObject* stateForCallback, System::Threading::SynchronizationContext* targetSyncContext, System::Threading::ExecutionContext* executionContext);
    // private System.Void NotifyCancellation(System.Boolean throwOnFirstException)
    // Offset: 0x16FA660
    void NotifyCancellation(bool throwOnFirstException);
    // private System.Void ExecuteCallbackHandlers(System.Boolean throwOnFirstException)
    // Offset: 0x16FAE08
    void ExecuteCallbackHandlers(bool throwOnFirstException);
    // private System.Void CancellationCallbackCoreWork_OnSyncContext(System.Object obj)
    // Offset: 0x16FB328
    void CancellationCallbackCoreWork_OnSyncContext(::Il2CppObject* obj);
    // private System.Void CancellationCallbackCoreWork(System.Threading.CancellationCallbackCoreWorkArguments args)
    // Offset: 0x16FB250
    void CancellationCallbackCoreWork(System::Threading::CancellationCallbackCoreWorkArguments args);
    // static public System.Threading.CancellationTokenSource CreateLinkedTokenSource(System.Threading.CancellationToken token1, System.Threading.CancellationToken token2)
    // Offset: 0x16FB3B0
    static System::Threading::CancellationTokenSource* CreateLinkedTokenSource(System::Threading::CancellationToken token1, System::Threading::CancellationToken token2);
    // System.Void WaitForCallbackToComplete(System.Threading.CancellationCallbackInfo callbackInfo)
    // Offset: 0x16FA204
    void WaitForCallbackToComplete(System::Threading::CancellationCallbackInfo* callbackInfo);
    // static private System.Void .cctor()
    // Offset: 0x16FB684
    static void _cctor();
    // public System.Void .ctor()
    // Offset: 0x16FA5A0
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CancellationTokenSource* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Threading::CancellationTokenSource::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CancellationTokenSource*, creationType>()));
    }
  }; // System.Threading.CancellationTokenSource
  #pragma pack(pop)
  static check_size<sizeof(CancellationTokenSource), 64 + sizeof(System::Threading::Timer*)> __System_Threading_CancellationTokenSourceSizeCheck;
  static_assert(sizeof(CancellationTokenSource) == 0x48);
}
DEFINE_IL2CPP_ARG_TYPE(System::Threading::CancellationTokenSource*, "System.Threading", "CancellationTokenSource");
