// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.UInt32
#include "System/UInt32.hpp"
// Including type: System.Threading.LockRecursionPolicy
#include "System/Threading/LockRecursionPolicy.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: EventWaitHandle
  class EventWaitHandle;
  // Forward declaring type: ReaderWriterCount
  class ReaderWriterCount;
}
// Completed forward declares
// Type namespace: System.Threading
namespace System::Threading {
  // Size: 0x69
  #pragma pack(push, 1)
  // Autogenerated type: System.Threading.ReaderWriterLockSlim
  // [TokenAttribute] Offset: FFFFFFFF
  class ReaderWriterLockSlim : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // Nested type: System::Threading::ReaderWriterLockSlim::TimeoutTracker
    struct TimeoutTracker;
    // private System.Boolean fIsReentrant
    // Size: 0x1
    // Offset: 0x10
    bool fIsReentrant;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fIsReentrant and: myLock
    char __padding0[0x3] = {};
    // private System.Int32 myLock
    // Size: 0x4
    // Offset: 0x14
    int myLock;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.UInt32 numWriteWaiters
    // Size: 0x4
    // Offset: 0x18
    uint numWriteWaiters;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 numReadWaiters
    // Size: 0x4
    // Offset: 0x1C
    uint numReadWaiters;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 numWriteUpgradeWaiters
    // Size: 0x4
    // Offset: 0x20
    uint numWriteUpgradeWaiters;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 numUpgradeWaiters
    // Size: 0x4
    // Offset: 0x24
    uint numUpgradeWaiters;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Boolean fNoWaiters
    // Size: 0x1
    // Offset: 0x28
    bool fNoWaiters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fNoWaiters and: upgradeLockOwnerId
    char __padding6[0x3] = {};
    // private System.Int32 upgradeLockOwnerId
    // Size: 0x4
    // Offset: 0x2C
    int upgradeLockOwnerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 writeLockOwnerId
    // Size: 0x4
    // Offset: 0x30
    int writeLockOwnerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: writeLockOwnerId and: writeEvent
    char __padding8[0x4] = {};
    // private System.Threading.EventWaitHandle writeEvent
    // Size: 0x8
    // Offset: 0x38
    System::Threading::EventWaitHandle* writeEvent;
    // Field size check
    static_assert(sizeof(System::Threading::EventWaitHandle*) == 0x8);
    // private System.Threading.EventWaitHandle readEvent
    // Size: 0x8
    // Offset: 0x40
    System::Threading::EventWaitHandle* readEvent;
    // Field size check
    static_assert(sizeof(System::Threading::EventWaitHandle*) == 0x8);
    // private System.Threading.EventWaitHandle upgradeEvent
    // Size: 0x8
    // Offset: 0x48
    System::Threading::EventWaitHandle* upgradeEvent;
    // Field size check
    static_assert(sizeof(System::Threading::EventWaitHandle*) == 0x8);
    // private System.Threading.EventWaitHandle waitUpgradeEvent
    // Size: 0x8
    // Offset: 0x50
    System::Threading::EventWaitHandle* waitUpgradeEvent;
    // Field size check
    static_assert(sizeof(System::Threading::EventWaitHandle*) == 0x8);
    // private System.Int64 lockID
    // Size: 0x8
    // Offset: 0x58
    int64_t lockID;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean fUpgradeThreadHoldingRead
    // Size: 0x1
    // Offset: 0x60
    bool fUpgradeThreadHoldingRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fUpgradeThreadHoldingRead and: owners
    char __padding14[0x3] = {};
    // private System.UInt32 owners
    // Size: 0x4
    // Offset: 0x64
    uint owners;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Boolean fDisposed
    // Size: 0x1
    // Offset: 0x68
    bool fDisposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: ReaderWriterLockSlim
