// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.MarshalByRefObject
#include "System/MarshalByRefObject.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: WaitHandle
  class WaitHandle;
  // Forward declaring type: WaitOrTimerCallback
  class WaitOrTimerCallback;
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
}
// Completed forward declares
// Type namespace: System.Threading
namespace System::Threading {
  // Size: 0x4E
  #pragma pack(push, 1)
  // Autogenerated type: System.Threading.RegisteredWaitHandle
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: D9C44C
  class RegisteredWaitHandle : public System::MarshalByRefObject {
    public:
    // private System.Threading.WaitHandle _waitObject
    // Size: 0x8
    // Offset: 0x18
    System::Threading::WaitHandle* waitObject;
    // Field size check
    static_assert(sizeof(System::Threading::WaitHandle*) == 0x8);
    // private System.Threading.WaitOrTimerCallback _callback
    // Size: 0x8
    // Offset: 0x20
    System::Threading::WaitOrTimerCallback* callback;
    // Field size check
    static_assert(sizeof(System::Threading::WaitOrTimerCallback*) == 0x8);
    // private System.Object _state
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* state;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Threading.WaitHandle _finalEvent
    // Size: 0x8
    // Offset: 0x30
    System::Threading::WaitHandle* finalEvent;
    // Field size check
    static_assert(sizeof(System::Threading::WaitHandle*) == 0x8);
    // private System.Threading.ManualResetEvent _cancelEvent
    // Size: 0x8
    // Offset: 0x38
    System::Threading::ManualResetEvent* cancelEvent;
    // Field size check
    static_assert(sizeof(System::Threading::ManualResetEvent*) == 0x8);
    // private System.TimeSpan _timeout
    // Size: 0x8
    // Offset: 0x40
    System::TimeSpan timeout;
    // Field size check
    static_assert(sizeof(System::TimeSpan) == 0x8);
    // private System.Int32 _callsInProcess
    // Size: 0x4
    // Offset: 0x48
    int callsInProcess;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _executeOnlyOnce
    // Size: 0x1
    // Offset: 0x4C
    bool executeOnlyOnce;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _unregistered
    // Size: 0x1
    // Offset: 0x4D
    bool unregistered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: RegisteredWaitHandle
    RegisteredWaitHandle(System::Threading::WaitHandle* waitObject_ = {}, System::Threading::WaitOrTimerCallback* callback_ = {}, ::Il2CppObject* state_ = {}, System::Threading::WaitHandle* finalEvent_ = {}, System::Threading::ManualResetEvent* cancelEvent_ = {}, System::TimeSpan timeout_ = {}, int callsInProcess_ = {}, bool executeOnlyOnce_ = {}, bool unregistered_ = {}) noexcept : waitObject{waitObject_}, callback{callback_}, state{state_}, finalEvent{finalEvent_}, cancelEvent{cancelEvent_}, timeout{timeout_}, callsInProcess{callsInProcess_}, executeOnlyOnce{executeOnlyOnce_}, unregistered{unregistered_} {}
    // Deleting conversion operator: operator ::Il2CppObject*
    constexpr operator ::Il2CppObject*() const noexcept = delete;
    // Get instance field: private System.Threading.WaitHandle _waitObject
    System::Threading::WaitHandle* _get__waitObject();
    // Set instance field: private System.Threading.WaitHandle _waitObject
    void _set__waitObject(System::Threading::WaitHandle* value);
    // Get instance field: private System.Threading.WaitOrTimerCallback _callback
    System::Threading::WaitOrTimerCallback* _get__callback();
    // Set instance field: private System.Threading.WaitOrTimerCallback _callback
    void _set__callback(System::Threading::WaitOrTimerCallback* value);
    // Get instance field: private System.Object _state
    ::Il2CppObject* _get__state();
    // Set instance field: private System.Object _state
    void _set__state(::Il2CppObject* value);
    // Get instance field: private System.Threading.WaitHandle _finalEvent
    System::Threading::WaitHandle* _get__finalEvent();
    // Set instance field: private System.Threading.WaitHandle _finalEvent
    void _set__finalEvent(System::Threading::WaitHandle* value);
    // Get instance field: private System.Threading.ManualResetEvent _cancelEvent
    System::Threading::ManualResetEvent* _get__cancelEvent();
    // Set instance field: private System.Threading.ManualResetEvent _cancelEvent
    void _set__cancelEvent(System::Threading::ManualResetEvent* value);
    // Get instance field: private System.TimeSpan _timeout
    System::TimeSpan _get__timeout();
    // Set instance field: private System.TimeSpan _timeout
    void _set__timeout(System::TimeSpan value);
    // Get instance field: private System.Int32 _callsInProcess
    int _get__callsInProcess();
    // Set instance field: private System.Int32 _callsInProcess
    void _set__callsInProcess(int value);
    // Get instance field: private System.Boolean _executeOnlyOnce
    bool _get__executeOnlyOnce();
    // Set instance field: private System.Boolean _executeOnlyOnce
    void _set__executeOnlyOnce(bool value);
    // Get instance field: private System.Boolean _unregistered
    bool _get__unregistered();
    // Set instance field: private System.Boolean _unregistered
    void _set__unregistered(bool value);
    // System.Void .ctor(System.Threading.WaitHandle waitObject, System.Threading.WaitOrTimerCallback callback, System.Object state, System.TimeSpan timeout, System.Boolean executeOnlyOnce)
    // Offset: 0x18F8798
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RegisteredWaitHandle* New_ctor(System::Threading::WaitHandle* waitObject, System::Threading::WaitOrTimerCallback* callback, ::Il2CppObject* state, System::TimeSpan timeout, bool executeOnlyOnce) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Threading::RegisteredWaitHandle::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RegisteredWaitHandle*, creationType>(waitObject, callback, state, timeout, executeOnlyOnce)));
    }
    // System.Void Wait(System.Object state)
    // Offset: 0x18F8854
    void Wait(::Il2CppObject* state);
    // private System.Void DoCallBack(System.Object timedOut)
    // Offset: 0x18F8DB4
    void DoCallBack(::Il2CppObject* timedOut);
    // public System.Boolean Unregister(System.Threading.WaitHandle waitObject)
    // Offset: 0x18F8F04
    bool Unregister(System::Threading::WaitHandle* waitObject);
  }; // System.Threading.RegisteredWaitHandle
  #pragma pack(pop)
  static check_size<sizeof(RegisteredWaitHandle), 77 + sizeof(bool)> __System_Threading_RegisteredWaitHandleSizeCheck;
  static_assert(sizeof(RegisteredWaitHandle) == 0x4E);
}
DEFINE_IL2CPP_ARG_TYPE(System::Threading::RegisteredWaitHandle*, "System.Threading", "RegisteredWaitHandle");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Threading::RegisteredWaitHandle::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::Threading::RegisteredWaitHandle::Wait
// Il2CppName: Wait
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Threading::RegisteredWaitHandle::*)(::Il2CppObject*)>(&System::Threading::RegisteredWaitHandle::Wait)> {
  static const MethodInfo* get() {
    static auto* state = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Threading::RegisteredWaitHandle*), "Wait", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{state});
  }
};
// Writing MetadataGetter for method: System::Threading::RegisteredWaitHandle::DoCallBack
// Il2CppName: DoCallBack
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Threading::RegisteredWaitHandle::*)(::Il2CppObject*)>(&System::Threading::RegisteredWaitHandle::DoCallBack)> {
  static const MethodInfo* get() {
    static auto* timedOut = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Threading::RegisteredWaitHandle*), "DoCallBack", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{timedOut});
  }
};
// Writing MetadataGetter for method: System::Threading::RegisteredWaitHandle::Unregister
// Il2CppName: Unregister
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (System::Threading::RegisteredWaitHandle::*)(System::Threading::WaitHandle*)>(&System::Threading::RegisteredWaitHandle::Unregister)> {
  static const MethodInfo* get() {
    static auto* waitObject = &::il2cpp_utils::GetClassFromName("System.Threading", "WaitHandle")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Threading::RegisteredWaitHandle*), "Unregister", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{waitObject});
  }
};
