// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: System.Threading
namespace System::Threading {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: System.Threading.SemaphoreSlim
  // [] Offset: FFFFFFFF
  // [DebuggerDisplayAttribute] Offset: C95AA4
  // [ComVisibleAttribute] Offset: C95AA4
  class SemaphoreSlim : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // Nested type: System::Threading::SemaphoreSlim::TaskNode
    class TaskNode;
    // Nested type: System::Threading::SemaphoreSlim::$WaitUntilCountOrTimeoutAsync$d__31
    struct $WaitUntilCountOrTimeoutAsync$d__31;
    // private System.Int32 m_currentCount
    // Size: 0x4
    // Offset: 0x10
    int m_currentCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 m_maxCount
    // Size: 0x4
    // Offset: 0x14
    int m_maxCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_waitCount
    // Size: 0x4
    // Offset: 0x18
    int m_waitCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_waitCount and: m_lockObj
    char __padding2[0x4] = {};
    // private System.Object m_lockObj
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* m_lockObj;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Threading.ManualResetEvent m_waitHandle
    // Size: 0x8
    // Offset: 0x28
    System::Threading::ManualResetEvent* m_waitHandle;
    // Field size check
    static_assert(sizeof(System::Threading::ManualResetEvent*) == 0x8);
    // private System.Threading.SemaphoreSlim/TaskNode m_asyncHead
    // Size: 0x8
    // Offset: 0x30
    System::Threading::SemaphoreSlim::TaskNode* m_asyncHead;
    // Field size check
    static_assert(sizeof(System::Threading::SemaphoreSlim::TaskNode*) == 0x8);
    // private System.Threading.SemaphoreSlim/TaskNode m_asyncTail
    // Size: 0x8
    // Offset: 0x38
    System::Threading::SemaphoreSlim::TaskNode* m_asyncTail;
    // Field size check
    static_assert(sizeof(System::Threading::SemaphoreSlim::TaskNode*) == 0x8);
    // Creating value type constructor for type: SemaphoreSlim
    SemaphoreSlim(int m_currentCount_ = {}, int m_maxCount_ = {}, int m_waitCount_ = {}, ::Il2CppObject* m_lockObj_ = {}, System::Threading::ManualResetEvent* m_waitHandle_ = {}, System::Threading::SemaphoreSlim::TaskNode* m_asyncHead_ = {}, System::Threading::SemaphoreSlim::TaskNode* m_asyncTail_ = {}) noexcept : m_currentCount{m_currentCount_}, m_maxCount{m_maxCount_}, m_waitCount{m_waitCount_}, m_lockObj{m_lockObj_}, m_waitHandle{m_waitHandle_}, m_asyncHead{m_asyncHead_}, m_asyncTail{m_asyncTail_} {}
    // Creating interface conversion operator: operator System::IDisposable
    operator System::IDisposable() noexcept {
      return *reinterpret_cast<System::IDisposable*>(this);
    }
    // Get static field: static private readonly System.Threading.Tasks.Task`1<System.Boolean> s_trueTask
    static System::Threading::Tasks::Task_1<bool>* _get_s_trueTask();
    // Set static field: static private readonly System.Threading.Tasks.Task`1<System.Boolean> s_trueTask
    static void _set_s_trueTask(System::Threading::Tasks::Task_1<bool>* value);
    // static field const value: static private System.Int32 NO_MAXIMUM
    static constexpr const int NO_MAXIMUM = 2147483647;
    // Get static field: static private System.Int32 NO_MAXIMUM
    static int _get_NO_MAXIMUM();
    // Set static field: static private System.Int32 NO_MAXIMUM
    static void _set_NO_MAXIMUM(int value);
    // Get static field: static private System.Action`1<System.Object> s_cancellationTokenCanceledEventHandler
    static System::Action_1<::Il2CppObject*>* _get_s_cancellationTokenCanceledEventHandler();
    // Set static field: static private System.Action`1<System.Object> s_cancellationTokenCanceledEventHandler
    static void _set_s_cancellationTokenCanceledEventHandler(System::Action_1<::Il2CppObject*>* value);
    // public System.Void .ctor(System.Int32 initialCount, System.Int32 maxCount)
    // Offset: 0x1700914
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SemaphoreSlim* New_ctor(int initialCount, int maxCount) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Threading::SemaphoreSlim::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SemaphoreSlim*, creationType>(initialCount, maxCount)));
    }
    // public System.Void Wait()
    // Offset: 0x1700AD0
    void Wait();
    // public System.Boolean Wait(System.Int32 millisecondsTimeout, System.Threading.CancellationToken cancellationToken)
    // Offset: 0x1700ADC
    bool Wait(int millisecondsTimeout, System::Threading::CancellationToken cancellationToken);
    // private System.Boolean WaitUntilCountOrTimeout(System.Int32 millisecondsTimeout, System.UInt32 startTime, System.Threading.CancellationToken cancellationToken)
    // Offset: 0x1701314
    bool WaitUntilCountOrTimeout(int millisecondsTimeout, uint startTime, System::Threading::CancellationToken cancellationToken);
    // public System.Threading.Tasks.Task WaitAsync()
    // Offset: 0x17013A8
    System::Threading::Tasks::Task* WaitAsync();
    // public System.Threading.Tasks.Task WaitAsync(System.Threading.CancellationToken cancellationToken)
    // Offset: 0x17013B4
    System::Threading::Tasks::Task* WaitAsync(System::Threading::CancellationToken cancellationToken);
    // public System.Threading.Tasks.Task`1<System.Boolean> WaitAsync(System.Int32 millisecondsTimeout, System.Threading.CancellationToken cancellationToken)
    // Offset: 0x1701070
    System::Threading::Tasks::Task_1<bool>* WaitAsync(int millisecondsTimeout, System::Threading::CancellationToken cancellationToken);
    // private System.Threading.SemaphoreSlim/TaskNode CreateAndAddAsyncWaiter()
    // Offset: 0x17013C0
    System::Threading::SemaphoreSlim::TaskNode* CreateAndAddAsyncWaiter();
    // private System.Boolean RemoveAsyncWaiter(System.Threading.SemaphoreSlim/TaskNode task)
    // Offset: 0x17015F4
    bool RemoveAsyncWaiter(System::Threading::SemaphoreSlim::TaskNode* task);
    // private System.Threading.Tasks.Task`1<System.Boolean> WaitUntilCountOrTimeoutAsync(System.Threading.SemaphoreSlim/TaskNode asyncWaiter, System.Int32 millisecondsTimeout, System.Threading.CancellationToken cancellationToken)
    // Offset: 0x1701450
    System::Threading::Tasks::Task_1<bool>* WaitUntilCountOrTimeoutAsync(System::Threading::SemaphoreSlim::TaskNode* asyncWaiter, int millisecondsTimeout, System::Threading::CancellationToken cancellationToken);
    // public System.Int32 Release()
    // Offset: 0x1701680
    int Release();
    // public System.Int32 Release(System.Int32 releaseCount)
    // Offset: 0x1701688
    int Release(int releaseCount);
    // static private System.Void QueueWaiterTask(System.Threading.SemaphoreSlim/TaskNode waiterTask)
    // Offset: 0x1701938
    static void QueueWaiterTask(System::Threading::SemaphoreSlim::TaskNode* waiterTask);
    // public System.Void Dispose()
    // Offset: 0x1701944
    void Dispose();
    // protected System.Void Dispose(System.Boolean disposing)
    // Offset: 0x17019C0
    void Dispose(bool disposing);
    // static private System.Void CancellationTokenCanceledEventHandler(System.Object obj)
    // Offset: 0x1701A20
    static void CancellationTokenCanceledEventHandler(::Il2CppObject* obj);
    // private System.Void CheckDispose()
    // Offset: 0x1700F88
    void CheckDispose();
    // static private System.String GetResourceString(System.String str)
    // Offset: 0x1700AC8
    static ::Il2CppString* GetResourceString(::Il2CppString* str);
    // static private System.Void .cctor()
    // Offset: 0x1701B08
    static void _cctor();
  }; // System.Threading.SemaphoreSlim
  #pragma pack(pop)
  static check_size<sizeof(SemaphoreSlim), 56 + sizeof(System::Threading::SemaphoreSlim::TaskNode*)> __System_Threading_SemaphoreSlimSizeCheck;
  static_assert(sizeof(SemaphoreSlim) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(System::Threading::SemaphoreSlim*, "System.Threading", "SemaphoreSlim");
