// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.AnimationEventSource
#include "UnityEngine/AnimationEventSource.hpp"
// Including type: UnityEngine.AnimatorStateInfo
#include "UnityEngine/AnimatorStateInfo.hpp"
// Including type: UnityEngine.AnimatorClipInfo
#include "UnityEngine/AnimatorClipInfo.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Object
  class Object;
  // Forward declaring type: AnimationState
  class AnimationState;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Autogenerated type: UnityEngine.AnimationEvent
  class AnimationEvent : public ::Il2CppObject {
    public:
    // System.Single m_Time
    // Offset: 0x10
    float m_Time;
    // System.String m_FunctionName
    // Offset: 0x18
    ::Il2CppString* m_FunctionName;
    // System.String m_StringParameter
    // Offset: 0x20
    ::Il2CppString* m_StringParameter;
    // UnityEngine.Object m_ObjectReferenceParameter
    // Offset: 0x28
    UnityEngine::Object* m_ObjectReferenceParameter;
    // System.Single m_FloatParameter
    // Offset: 0x30
    float m_FloatParameter;
    // System.Int32 m_IntParameter
    // Offset: 0x34
    int m_IntParameter;
    // System.Int32 m_MessageOptions
    // Offset: 0x38
    int m_MessageOptions;
    // UnityEngine.AnimationEventSource m_Source
    // Offset: 0x3C
    UnityEngine::AnimationEventSource m_Source;
    // UnityEngine.AnimationState m_StateSender
    // Offset: 0x40
    UnityEngine::AnimationState* m_StateSender;
    // UnityEngine.AnimatorStateInfo m_AnimatorStateInfo
    // Offset: 0x48
    UnityEngine::AnimatorStateInfo m_AnimatorStateInfo;
    // UnityEngine.AnimatorClipInfo m_AnimatorClipInfo
    // Offset: 0x6C
    UnityEngine::AnimatorClipInfo m_AnimatorClipInfo;
    // public System.Void .ctor()
    // Offset: 0x193DC3C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static AnimationEvent* New_ctor();
  }; // UnityEngine.AnimationEvent
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::AnimationEvent*, "UnityEngine", "AnimationEvent");
#pragma pack(pop)
