// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ContactPoint2D
  struct ContactPoint2D;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Autogenerated type: UnityEngine.Collision2D
  class Collision2D : public ::Il2CppObject {
    public:
    // System.Int32 m_Collider
    // Offset: 0x10
    int m_Collider;
    // System.Int32 m_OtherCollider
    // Offset: 0x14
    int m_OtherCollider;
    // System.Int32 m_Rigidbody
    // Offset: 0x18
    int m_Rigidbody;
    // System.Int32 m_OtherRigidbody
    // Offset: 0x1C
    int m_OtherRigidbody;
    // UnityEngine.Vector2 m_RelativeVelocity
    // Offset: 0x20
    UnityEngine::Vector2 m_RelativeVelocity;
    // System.Int32 m_Enabled
    // Offset: 0x28
    int m_Enabled;
    // System.Int32 m_ContactCount
    // Offset: 0x2C
    int m_ContactCount;
    // UnityEngine.ContactPoint2D[] m_ReusedContacts
    // Offset: 0x30
    ::Array<UnityEngine::ContactPoint2D>* m_ReusedContacts;
    // UnityEngine.ContactPoint2D[] m_LegacyContacts
    // Offset: 0x38
    ::Array<UnityEngine::ContactPoint2D>* m_LegacyContacts;
  }; // UnityEngine.Collision2D
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Collision2D*, "UnityEngine", "Collision2D");
#pragma pack(pop)
