// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Completed includes
// Type namespace: UnityEngine
namespace UnityEngine {
  // Autogenerated type: UnityEngine.ContactPoint2D
  struct ContactPoint2D : public System::ValueType {
    public:
    // private UnityEngine.Vector2 m_Point
    // Offset: 0x0
    UnityEngine::Vector2 m_Point;
    // private UnityEngine.Vector2 m_Normal
    // Offset: 0x8
    UnityEngine::Vector2 m_Normal;
    // private UnityEngine.Vector2 m_RelativeVelocity
    // Offset: 0x10
    UnityEngine::Vector2 m_RelativeVelocity;
    // private System.Single m_Separation
    // Offset: 0x18
    float m_Separation;
    // private System.Single m_NormalImpulse
    // Offset: 0x1C
    float m_NormalImpulse;
    // private System.Single m_TangentImpulse
    // Offset: 0x20
    float m_TangentImpulse;
    // private System.Int32 m_Collider
    // Offset: 0x24
    int m_Collider;
    // private System.Int32 m_OtherCollider
    // Offset: 0x28
    int m_OtherCollider;
    // private System.Int32 m_Rigidbody
    // Offset: 0x2C
    int m_Rigidbody;
    // private System.Int32 m_OtherRigidbody
    // Offset: 0x30
    int m_OtherRigidbody;
    // private System.Int32 m_Enabled
    // Offset: 0x34
    int m_Enabled;
    // Creating value type constructor for type: ContactPoint2D
    constexpr ContactPoint2D(UnityEngine::Vector2 m_Point_ = {}, UnityEngine::Vector2 m_Normal_ = {}, UnityEngine::Vector2 m_RelativeVelocity_ = {}, float m_Separation_ = {}, float m_NormalImpulse_ = {}, float m_TangentImpulse_ = {}, int m_Collider_ = {}, int m_OtherCollider_ = {}, int m_Rigidbody_ = {}, int m_OtherRigidbody_ = {}, int m_Enabled_ = {}) noexcept : m_Point{m_Point_}, m_Normal{m_Normal_}, m_RelativeVelocity{m_RelativeVelocity_}, m_Separation{m_Separation_}, m_NormalImpulse{m_NormalImpulse_}, m_TangentImpulse{m_TangentImpulse_}, m_Collider{m_Collider_}, m_OtherCollider{m_OtherCollider_}, m_Rigidbody{m_Rigidbody_}, m_OtherRigidbody{m_OtherRigidbody_}, m_Enabled{m_Enabled_} {}
  }; // UnityEngine.ContactPoint2D
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::ContactPoint2D, "UnityEngine", "ContactPoint2D");
#pragma pack(pop)
