// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.Object
#include "System/Object.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GUIStyle
  class GUIStyle;
  // Forward declaring type: GUILayoutOption
  class GUILayoutOption;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
struct CsObject;
template<class T>
struct Array;
struct CsString;
// Completed il2cpp-utils forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Autogenerated type: UnityEngine.GUILayoutEntry
  class GUILayoutEntry : public ::CsObject {
    public:
    // public System.Single minWidth
    // Offset: 0x10
    float minWidth;
    // public System.Single maxWidth
    // Offset: 0x14
    float maxWidth;
    // public System.Single minHeight
    // Offset: 0x18
    float minHeight;
    // public System.Single maxHeight
    // Offset: 0x1C
    float maxHeight;
    // public UnityEngine.Rect rect
    // Offset: 0x20
    UnityEngine::Rect rect;
    // public System.Int32 stretchWidth
    // Offset: 0x30
    int stretchWidth;
    // public System.Int32 stretchHeight
    // Offset: 0x34
    int stretchHeight;
    // public System.Boolean consideredForMargin
    // Offset: 0x38
    bool consideredForMargin;
    // private UnityEngine.GUIStyle m_Style
    // Offset: 0x40
    UnityEngine::GUIStyle* m_Style;
    // Get static field: static UnityEngine.Rect kDummyRect
    static UnityEngine::Rect _get_kDummyRect();
    // Set static field: static UnityEngine.Rect kDummyRect
    static void _set_kDummyRect(UnityEngine::Rect value);
    // Get static field: static protected System.Int32 indent
    static int _get_indent();
    // Set static field: static protected System.Int32 indent
    static void _set_indent(int value);
    // public UnityEngine.GUIStyle get_style()
    // Offset: 0x1255DD0
    UnityEngine::GUIStyle* get_style();
    // public System.Void set_style(UnityEngine.GUIStyle value)
    // Offset: 0x1255DD8
    void set_style(UnityEngine::GUIStyle* value);
    // public System.Int32 get_marginLeft()
    // Offset: 0x1255E10
    int get_marginLeft();
    // public System.Int32 get_marginRight()
    // Offset: 0x1255E38
    int get_marginRight();
    // public System.Int32 get_marginTop()
    // Offset: 0x1255E60
    int get_marginTop();
    // public System.Int32 get_marginBottom()
    // Offset: 0x1255E88
    int get_marginBottom();
    // public System.Int32 get_marginHorizontal()
    // Offset: 0x1255EB0
    int get_marginHorizontal();
    // public System.Int32 get_marginVertical()
    // Offset: 0x1255EF0
    int get_marginVertical();
    // public System.Void .ctor(System.Single _minWidth, System.Single _maxWidth, System.Single _minHeight, System.Single _maxHeight, UnityEngine.GUIStyle _style)
    // Offset: 0x1255F30
    static GUILayoutEntry* New_ctor(float _minWidth, float _maxWidth, float _minHeight, float _maxHeight, UnityEngine::GUIStyle* _style);
    // public System.Void .ctor(System.Single _minWidth, System.Single _maxWidth, System.Single _minHeight, System.Single _maxHeight, UnityEngine.GUIStyle _style, UnityEngine.GUILayoutOption[] options)
    // Offset: 0x1256068
    static GUILayoutEntry* New_ctor(float _minWidth, float _maxWidth, float _minHeight, float _maxHeight, UnityEngine::GUIStyle* _style, ::Array<UnityEngine::GUILayoutOption*>* options);
    // public System.Void CalcWidth()
    // Offset: 0x1256198
    void CalcWidth();
    // public System.Void CalcHeight()
    // Offset: 0x125619C
    void CalcHeight();
    // public System.Void SetHorizontal(System.Single x, System.Single width)
    // Offset: 0x12561A0
    void SetHorizontal(float x, float width);
    // public System.Void SetVertical(System.Single y, System.Single height)
    // Offset: 0x12561E0
    void SetVertical(float y, float height);
    // protected System.Void ApplyStyleSettings(UnityEngine.GUIStyle style)
    // Offset: 0x1256220
    void ApplyStyleSettings(UnityEngine::GUIStyle* style);
    // public System.Void ApplyOptions(UnityEngine.GUILayoutOption[] options)
    // Offset: 0x12563B0
    void ApplyOptions(::Array<UnityEngine::GUILayoutOption*>* options);
    // static private System.Void .cctor()
    // Offset: 0x1256CEC
    static void _cctor();
    // public override System.String ToString()
    // Offset: 0x125668C
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::CsString* ToString();
  }; // UnityEngine.GUILayoutEntry
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::GUILayoutEntry*, "UnityEngine", "GUILayoutEntry");
#pragma pack(pop)
