// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GUIStyle
  class GUIStyle;
  // Forward declaring type: GUILayoutOption
  class GUILayoutOption;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Autogenerated type: UnityEngine.GUILayoutEntry
  class GUILayoutEntry : public ::CsObject {
    public:
    // public System.Single minWidth
    // Offset: 0x10
    float minWidth;
    // public System.Single maxWidth
    // Offset: 0x14
    float maxWidth;
    // public System.Single minHeight
    // Offset: 0x18
    float minHeight;
    // public System.Single maxHeight
    // Offset: 0x1C
    float maxHeight;
    // public UnityEngine.Rect rect
    // Offset: 0x20
    UnityEngine::Rect rect;
    // public System.Int32 stretchWidth
    // Offset: 0x30
    int stretchWidth;
    // public System.Int32 stretchHeight
    // Offset: 0x34
    int stretchHeight;
    // public System.Boolean consideredForMargin
    // Offset: 0x38
    bool consideredForMargin;
    // private UnityEngine.GUIStyle m_Style
    // Offset: 0x40
    UnityEngine::GUIStyle* m_Style;
    // Get static field: static UnityEngine.Rect kDummyRect
    static UnityEngine::Rect _get_kDummyRect();
    // Set static field: static UnityEngine.Rect kDummyRect
    static void _set_kDummyRect(UnityEngine::Rect value);
    // Get static field: static protected System.Int32 indent
    static int _get_indent();
    // Set static field: static protected System.Int32 indent
    static void _set_indent(int value);
    // public UnityEngine.GUIStyle get_style()
    // Offset: 0x1268814
    UnityEngine::GUIStyle* get_style();
    // public System.Void set_style(UnityEngine.GUIStyle value)
    // Offset: 0x126881C
    void set_style(UnityEngine::GUIStyle* value);
    // public System.Int32 get_marginLeft()
    // Offset: 0x1268854
    int get_marginLeft();
    // public System.Int32 get_marginRight()
    // Offset: 0x126887C
    int get_marginRight();
    // public System.Int32 get_marginTop()
    // Offset: 0x12688A4
    int get_marginTop();
    // public System.Int32 get_marginBottom()
    // Offset: 0x12688CC
    int get_marginBottom();
    // public System.Int32 get_marginHorizontal()
    // Offset: 0x12688F4
    int get_marginHorizontal();
    // public System.Int32 get_marginVertical()
    // Offset: 0x1268934
    int get_marginVertical();
    // public System.Void .ctor(System.Single _minWidth, System.Single _maxWidth, System.Single _minHeight, System.Single _maxHeight, UnityEngine.GUIStyle _style)
    // Offset: 0x1268974
    static GUILayoutEntry* New_ctor(float _minWidth, float _maxWidth, float _minHeight, float _maxHeight, UnityEngine::GUIStyle* _style);
    // public System.Void .ctor(System.Single _minWidth, System.Single _maxWidth, System.Single _minHeight, System.Single _maxHeight, UnityEngine.GUIStyle _style, UnityEngine.GUILayoutOption[] options)
    // Offset: 0x1268AAC
    static GUILayoutEntry* New_ctor(float _minWidth, float _maxWidth, float _minHeight, float _maxHeight, UnityEngine::GUIStyle* _style, ::Array<UnityEngine::GUILayoutOption*>* options);
    // public System.Void CalcWidth()
    // Offset: 0x1268BDC
    void CalcWidth();
    // public System.Void CalcHeight()
    // Offset: 0x1268BE0
    void CalcHeight();
    // public System.Void SetHorizontal(System.Single x, System.Single width)
    // Offset: 0x1268BE4
    void SetHorizontal(float x, float width);
    // public System.Void SetVertical(System.Single y, System.Single height)
    // Offset: 0x1268C24
    void SetVertical(float y, float height);
    // protected System.Void ApplyStyleSettings(UnityEngine.GUIStyle style)
    // Offset: 0x1268C64
    void ApplyStyleSettings(UnityEngine::GUIStyle* style);
    // public System.Void ApplyOptions(UnityEngine.GUILayoutOption[] options)
    // Offset: 0x1268DF4
    void ApplyOptions(::Array<UnityEngine::GUILayoutOption*>* options);
    // static private System.Void .cctor()
    // Offset: 0x1269730
    static void _cctor();
    // public override System.String ToString()
    // Offset: 0x12690D0
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::CsString* ToString();
  }; // UnityEngine.GUILayoutEntry
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::GUILayoutEntry*, "UnityEngine", "GUILayoutEntry");
#pragma pack(pop)
