// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.GUILayoutEntry
#include "UnityEngine/GUILayoutEntry.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GUILayoutOption
  class GUILayoutOption;
  // Forward declaring type: GUIStyle
  class GUIStyle;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Autogenerated type: UnityEngine.GUILayoutGroup
  class GUILayoutGroup : public UnityEngine::GUILayoutEntry {
    public:
    // public System.Collections.Generic.List`1<UnityEngine.GUILayoutEntry> entries
    // Offset: 0x48
    System::Collections::Generic::List_1<UnityEngine::GUILayoutEntry*>* entries;
    // public System.Boolean isVertical
    // Offset: 0x50
    bool isVertical;
    // public System.Boolean resetCoords
    // Offset: 0x51
    bool resetCoords;
    // public System.Single spacing
    // Offset: 0x54
    float spacing;
    // public System.Boolean sameSize
    // Offset: 0x58
    bool sameSize;
    // public System.Boolean isWindow
    // Offset: 0x59
    bool isWindow;
    // public System.Int32 windowID
    // Offset: 0x5C
    int windowID;
    // private System.Int32 m_Cursor
    // Offset: 0x60
    int m_Cursor;
    // protected System.Int32 m_StretchableCountX
    // Offset: 0x64
    int m_StretchableCountX;
    // protected System.Int32 m_StretchableCountY
    // Offset: 0x68
    int m_StretchableCountY;
    // protected System.Boolean m_UserSpecifiedWidth
    // Offset: 0x6C
    bool m_UserSpecifiedWidth;
    // protected System.Boolean m_UserSpecifiedHeight
    // Offset: 0x6D
    bool m_UserSpecifiedHeight;
    // protected System.Single m_ChildMinWidth
    // Offset: 0x70
    float m_ChildMinWidth;
    // protected System.Single m_ChildMaxWidth
    // Offset: 0x74
    float m_ChildMaxWidth;
    // protected System.Single m_ChildMinHeight
    // Offset: 0x78
    float m_ChildMinHeight;
    // protected System.Single m_ChildMaxHeight
    // Offset: 0x7C
    float m_ChildMaxHeight;
    // protected System.Int32 m_MarginLeft
    // Offset: 0x80
    int m_MarginLeft;
    // protected System.Int32 m_MarginRight
    // Offset: 0x84
    int m_MarginRight;
    // protected System.Int32 m_MarginTop
    // Offset: 0x88
    int m_MarginTop;
    // protected System.Int32 m_MarginBottom
    // Offset: 0x8C
    int m_MarginBottom;
    // public System.Void ResetCursor()
    // Offset: 0x126FE9C
    void ResetCursor();
    // public UnityEngine.GUILayoutEntry GetNext()
    // Offset: 0x126FEA4
    UnityEngine::GUILayoutEntry* GetNext();
    // public System.Void Add(UnityEngine.GUILayoutEntry e)
    // Offset: 0x1270130
    void Add(UnityEngine::GUILayoutEntry* e);
    // public override System.Int32 get_marginLeft()
    // Offset: 0x126FBC4
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Int32 GUILayoutEntry::get_marginLeft()
    int get_marginLeft();
    // public override System.Int32 get_marginRight()
    // Offset: 0x126FBCC
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Int32 GUILayoutEntry::get_marginRight()
    int get_marginRight();
    // public override System.Int32 get_marginTop()
    // Offset: 0x126FBD4
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Int32 GUILayoutEntry::get_marginTop()
    int get_marginTop();
    // public override System.Int32 get_marginBottom()
    // Offset: 0x126FBDC
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Int32 GUILayoutEntry::get_marginBottom()
    int get_marginBottom();
    // public System.Void .ctor()
    // Offset: 0x126FBE4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static GUILayoutGroup* New_ctor();
    // public override System.Void ApplyOptions(UnityEngine.GUILayoutOption[] options)
    // Offset: 0x126FCF4
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Void GUILayoutEntry::ApplyOptions(UnityEngine.GUILayoutOption[] options)
    void ApplyOptions(::Array<UnityEngine::GUILayoutOption*>* options);
    // protected override System.Void ApplyStyleSettings(UnityEngine.GUIStyle style)
    // Offset: 0x126FE24
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Void GUILayoutEntry::ApplyStyleSettings(UnityEngine.GUIStyle style)
    void ApplyStyleSettings(UnityEngine::GUIStyle* style);
    // public override System.Void CalcWidth()
    // Offset: 0x1270198
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Void GUILayoutEntry::CalcWidth()
    void CalcWidth();
    // public override System.Void SetHorizontal(System.Single x, System.Single width)
    // Offset: 0x127096C
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Void GUILayoutEntry::SetHorizontal(System.Single x, System.Single width)
    void SetHorizontal(float x, float width);
    // public override System.Void CalcHeight()
    // Offset: 0x1271274
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Void GUILayoutEntry::CalcHeight()
    void CalcHeight();
    // public override System.Void SetVertical(System.Single y, System.Single height)
    // Offset: 0x127191C
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.Void GUILayoutEntry::SetVertical(System.Single y, System.Single height)
    void SetVertical(float y, float height);
    // public override System.String ToString()
    // Offset: 0x1272220
    // Implemented from: UnityEngine.GUILayoutEntry
    // Base method: System.String GUILayoutEntry::ToString()
    ::Il2CppString* ToString();
  }; // UnityEngine.GUILayoutGroup
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::GUILayoutGroup*, "UnityEngine", "GUILayoutGroup");
#pragma pack(pop)
