// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Font
  class Font;
  // Forward declaring type: GUIStyle
  class GUIStyle;
  // Forward declaring type: GUISettings
  class GUISettings;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0xE8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.GUISkin
  // [TokenAttribute] Offset: FFFFFFFF
  // [AssetFileNameExtensionAttribute] Offset: E90234
  // [RequiredByNativeCodeAttribute] Offset: E90234
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class GUISkin : public UnityEngine::ScriptableObject {
    public:
    // Nested type: UnityEngine::GUISkin::SkinChangedDelegate
    class SkinChangedDelegate;
    // private UnityEngine.Font m_Font
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Font* m_Font;
    // Field size check
    static_assert(sizeof(UnityEngine::Font*) == 0x8);
    // private UnityEngine.GUIStyle m_box
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::GUIStyle* m_box;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_button
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::GUIStyle* m_button;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_toggle
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::GUIStyle* m_toggle;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_label
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::GUIStyle* m_label;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_textField
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::GUIStyle* m_textField;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_textArea
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::GUIStyle* m_textArea;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_window
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::GUIStyle* m_window;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalSlider
    // Size: 0x8
    // Offset: 0x58
    UnityEngine::GUIStyle* m_horizontalSlider;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalSliderThumb
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::GUIStyle* m_horizontalSliderThumb;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalSliderThumbExtent
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::GUIStyle* m_horizontalSliderThumbExtent;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalSlider
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::GUIStyle* m_verticalSlider;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalSliderThumb
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::GUIStyle* m_verticalSliderThumb;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalSliderThumbExtent
    // Size: 0x8
    // Offset: 0x80
    UnityEngine::GUIStyle* m_verticalSliderThumbExtent;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalScrollbar
    // Size: 0x8
    // Offset: 0x88
    UnityEngine::GUIStyle* m_horizontalScrollbar;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalScrollbarThumb
    // Size: 0x8
    // Offset: 0x90
    UnityEngine::GUIStyle* m_horizontalScrollbarThumb;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalScrollbarLeftButton
    // Size: 0x8
    // Offset: 0x98
    UnityEngine::GUIStyle* m_horizontalScrollbarLeftButton;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalScrollbarRightButton
    // Size: 0x8
    // Offset: 0xA0
    UnityEngine::GUIStyle* m_horizontalScrollbarRightButton;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalScrollbar
    // Size: 0x8
    // Offset: 0xA8
    UnityEngine::GUIStyle* m_verticalScrollbar;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalScrollbarThumb
    // Size: 0x8
    // Offset: 0xB0
    UnityEngine::GUIStyle* m_verticalScrollbarThumb;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalScrollbarUpButton
    // Size: 0x8
    // Offset: 0xB8
    UnityEngine::GUIStyle* m_verticalScrollbarUpButton;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalScrollbarDownButton
    // Size: 0x8
    // Offset: 0xC0
    UnityEngine::GUIStyle* m_verticalScrollbarDownButton;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_ScrollView
    // Size: 0x8
    // Offset: 0xC8
    UnityEngine::GUIStyle* m_ScrollView;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // UnityEngine.GUIStyle[] m_CustomStyles
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayWrapper<UnityEngine::GUIStyle*> m_CustomStyles;
    // Field size check
    static_assert(sizeof(::ArrayWrapper<UnityEngine::GUIStyle*>) == 0x8);
    // private UnityEngine.GUISettings m_Settings
    // Size: 0x8
    // Offset: 0xD8
    UnityEngine::GUISettings* m_Settings;
    // Field size check
    static_assert(sizeof(UnityEngine::GUISettings*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,UnityEngine.GUIStyle> m_Styles
    // Size: 0x8
    // Offset: 0xE0
    System::Collections::Generic::Dictionary_2<::Il2CppString*, UnityEngine::GUIStyle*>* m_Styles;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, UnityEngine::GUIStyle*>*) == 0x8);
    // Creating value type constructor for type: GUISkin
