// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Font
  class Font;
  // Forward declaring type: GUIStyle
  class GUIStyle;
  // Forward declaring type: GUISettings
  class GUISettings;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0xE8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.GUISkin
  // [] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: CC09DC
  // [RequiredByNativeCodeAttribute] Offset: CC09DC
  // [AssetFileNameExtensionAttribute] Offset: CC09DC
  class GUISkin : public UnityEngine::ScriptableObject {
    public:
    // Nested type: UnityEngine::GUISkin::SkinChangedDelegate
    class SkinChangedDelegate;
    // private UnityEngine.Font m_Font
    // Size: 0x8
    // Offset: 0x18
    UnityEngine::Font* m_Font;
    // Field size check
    static_assert(sizeof(UnityEngine::Font*) == 0x8);
    // private UnityEngine.GUIStyle m_box
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::GUIStyle* m_box;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_button
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::GUIStyle* m_button;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_toggle
    // Size: 0x8
    // Offset: 0x30
    UnityEngine::GUIStyle* m_toggle;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_label
    // Size: 0x8
    // Offset: 0x38
    UnityEngine::GUIStyle* m_label;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_textField
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::GUIStyle* m_textField;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_textArea
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::GUIStyle* m_textArea;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_window
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::GUIStyle* m_window;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalSlider
    // Size: 0x8
    // Offset: 0x58
    UnityEngine::GUIStyle* m_horizontalSlider;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalSliderThumb
    // Size: 0x8
    // Offset: 0x60
    UnityEngine::GUIStyle* m_horizontalSliderThumb;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalSliderThumbExtent
    // Size: 0x8
    // Offset: 0x68
    UnityEngine::GUIStyle* m_horizontalSliderThumbExtent;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalSlider
    // Size: 0x8
    // Offset: 0x70
    UnityEngine::GUIStyle* m_verticalSlider;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalSliderThumb
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::GUIStyle* m_verticalSliderThumb;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalSliderThumbExtent
    // Size: 0x8
    // Offset: 0x80
    UnityEngine::GUIStyle* m_verticalSliderThumbExtent;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalScrollbar
    // Size: 0x8
    // Offset: 0x88
    UnityEngine::GUIStyle* m_horizontalScrollbar;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalScrollbarThumb
    // Size: 0x8
    // Offset: 0x90
    UnityEngine::GUIStyle* m_horizontalScrollbarThumb;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalScrollbarLeftButton
    // Size: 0x8
    // Offset: 0x98
    UnityEngine::GUIStyle* m_horizontalScrollbarLeftButton;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_horizontalScrollbarRightButton
    // Size: 0x8
    // Offset: 0xA0
    UnityEngine::GUIStyle* m_horizontalScrollbarRightButton;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalScrollbar
    // Size: 0x8
    // Offset: 0xA8
    UnityEngine::GUIStyle* m_verticalScrollbar;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalScrollbarThumb
    // Size: 0x8
    // Offset: 0xB0
    UnityEngine::GUIStyle* m_verticalScrollbarThumb;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalScrollbarUpButton
    // Size: 0x8
    // Offset: 0xB8
    UnityEngine::GUIStyle* m_verticalScrollbarUpButton;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_verticalScrollbarDownButton
    // Size: 0x8
    // Offset: 0xC0
    UnityEngine::GUIStyle* m_verticalScrollbarDownButton;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // private UnityEngine.GUIStyle m_ScrollView
    // Size: 0x8
    // Offset: 0xC8
    UnityEngine::GUIStyle* m_ScrollView;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // UnityEngine.GUIStyle[] m_CustomStyles
    // Size: 0x8
    // Offset: 0xD0
    ::Array<UnityEngine::GUIStyle*>* m_CustomStyles;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::GUIStyle*>*) == 0x8);
    // private UnityEngine.GUISettings m_Settings
    // Size: 0x8
    // Offset: 0xD8
    UnityEngine::GUISettings* m_Settings;
    // Field size check
    static_assert(sizeof(UnityEngine::GUISettings*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,UnityEngine.GUIStyle> m_Styles
    // Size: 0x8
    // Offset: 0xE0
    System::Collections::Generic::Dictionary_2<::Il2CppString*, UnityEngine::GUIStyle*>* m_Styles;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, UnityEngine::GUIStyle*>*) == 0x8);
    // Creating value type constructor for type: GUISkin
    GUISkin(UnityEngine::Font* m_Font_ = {}, UnityEngine::GUIStyle* m_box_ = {}, UnityEngine::GUIStyle* m_button_ = {}, UnityEngine::GUIStyle* m_toggle_ = {}, UnityEngine::GUIStyle* m_label_ = {}, UnityEngine::GUIStyle* m_textField_ = {}, UnityEngine::GUIStyle* m_textArea_ = {}, UnityEngine::GUIStyle* m_window_ = {}, UnityEngine::GUIStyle* m_horizontalSlider_ = {}, UnityEngine::GUIStyle* m_horizontalSliderThumb_ = {}, UnityEngine::GUIStyle* m_horizontalSliderThumbExtent_ = {}, UnityEngine::GUIStyle* m_verticalSlider_ = {}, UnityEngine::GUIStyle* m_verticalSliderThumb_ = {}, UnityEngine::GUIStyle* m_verticalSliderThumbExtent_ = {}, UnityEngine::GUIStyle* m_horizontalScrollbar_ = {}, UnityEngine::GUIStyle* m_horizontalScrollbarThumb_ = {}, UnityEngine::GUIStyle* m_horizontalScrollbarLeftButton_ = {}, UnityEngine::GUIStyle* m_horizontalScrollbarRightButton_ = {}, UnityEngine::GUIStyle* m_verticalScrollbar_ = {}, UnityEngine::GUIStyle* m_verticalScrollbarThumb_ = {}, UnityEngine::GUIStyle* m_verticalScrollbarUpButton_ = {}, UnityEngine::GUIStyle* m_verticalScrollbarDownButton_ = {}, UnityEngine::GUIStyle* m_ScrollView_ = {}, ::Array<UnityEngine::GUIStyle*>* m_CustomStyles_ = {}, UnityEngine::GUISettings* m_Settings_ = {}, System::Collections::Generic::Dictionary_2<::Il2CppString*, UnityEngine::GUIStyle*>* m_Styles_ = {}) noexcept : m_Font{m_Font_}, m_box{m_box_}, m_button{m_button_}, m_toggle{m_toggle_}, m_label{m_label_}, m_textField{m_textField_}, m_textArea{m_textArea_}, m_window{m_window_}, m_horizontalSlider{m_horizontalSlider_}, m_horizontalSliderThumb{m_horizontalSliderThumb_}, m_horizontalSliderThumbExtent{m_horizontalSliderThumbExtent_}, m_verticalSlider{m_verticalSlider_}, m_verticalSliderThumb{m_verticalSliderThumb_}, m_verticalSliderThumbExtent{m_verticalSliderThumbExtent_}, m_horizontalScrollbar{m_horizontalScrollbar_}, m_horizontalScrollbarThumb{m_horizontalScrollbarThumb_}, m_horizontalScrollbarLeftButton{m_horizontalScrollbarLeftButton_}, m_horizontalScrollbarRightButton{m_horizontalScrollbarRightButton_}, m_verticalScrollbar{m_verticalScrollbar_}, m_verticalScrollbarThumb{m_verticalScrollbarThumb_}, m_verticalScrollbarUpButton{m_verticalScrollbarUpButton_}, m_verticalScrollbarDownButton{m_verticalScrollbarDownButton_}, m_ScrollView{m_ScrollView_}, m_CustomStyles{m_CustomStyles_}, m_Settings{m_Settings_}, m_Styles{m_Styles_} {}
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get static field: static UnityEngine.GUIStyle ms_Error
    static UnityEngine::GUIStyle* _get_ms_Error();
    // Set static field: static UnityEngine.GUIStyle ms_Error
    static void _set_ms_Error(UnityEngine::GUIStyle* value);
    // Get static field: static UnityEngine.GUISkin/SkinChangedDelegate m_SkinChanged
    static UnityEngine::GUISkin::SkinChangedDelegate* _get_m_SkinChanged();
    // Set static field: static UnityEngine.GUISkin/SkinChangedDelegate m_SkinChanged
    static void _set_m_SkinChanged(UnityEngine::GUISkin::SkinChangedDelegate* value);
    // Get static field: static UnityEngine.GUISkin current
    static UnityEngine::GUISkin* _get_current();
    // Set static field: static UnityEngine.GUISkin current
    static void _set_current(UnityEngine::GUISkin* value);
    // System.Void OnEnable()
    // Offset: 0x190C3A4
    void OnEnable();
    // static System.Void CleanupRoots()
    // Offset: 0x190C428
    static void CleanupRoots();
    // public UnityEngine.Font get_font()
    // Offset: 0x18FF75C
    UnityEngine::Font* get_font();
    // public System.Void set_font(UnityEngine.Font value)
    // Offset: 0x190C480
    void set_font(UnityEngine::Font* value);
    // public UnityEngine.GUIStyle get_box()
    // Offset: 0x1904ABC
    UnityEngine::GUIStyle* get_box();
    // public System.Void set_box(UnityEngine.GUIStyle value)
    // Offset: 0x190C5A8
    void set_box(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_label()
    // Offset: 0x190482C
    UnityEngine::GUIStyle* get_label();
    // public System.Void set_label(UnityEngine.GUIStyle value)
    // Offset: 0x190C5B0
    void set_label(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_textField()
    // Offset: 0x1904DBC
    UnityEngine::GUIStyle* get_textField();
    // public System.Void set_textField(UnityEngine.GUIStyle value)
    // Offset: 0x190C5B8
    void set_textField(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_textArea()
    // Offset: 0x190C5C0
    UnityEngine::GUIStyle* get_textArea();
    // public System.Void set_textArea(UnityEngine.GUIStyle value)
    // Offset: 0x190C5C8
    void set_textArea(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_button()
    // Offset: 0x1904C50
    UnityEngine::GUIStyle* get_button();
    // public System.Void set_button(UnityEngine.GUIStyle value)
    // Offset: 0x190C5D0
    void set_button(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_toggle()
    // Offset: 0x19050F4
    UnityEngine::GUIStyle* get_toggle();
    // public System.Void set_toggle(UnityEngine.GUIStyle value)
    // Offset: 0x190C5D8
    void set_toggle(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_window()
    // Offset: 0x190C5E0
    UnityEngine::GUIStyle* get_window();
    // public System.Void set_window(UnityEngine.GUIStyle value)
    // Offset: 0x190C5E8
    void set_window(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_horizontalSlider()
    // Offset: 0x1905290
    UnityEngine::GUIStyle* get_horizontalSlider();
    // public System.Void set_horizontalSlider(UnityEngine.GUIStyle value)
    // Offset: 0x190C5F0
    void set_horizontalSlider(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_horizontalSliderThumb()
    // Offset: 0x1905298
    UnityEngine::GUIStyle* get_horizontalSliderThumb();
    // public System.Void set_horizontalSliderThumb(UnityEngine.GUIStyle value)
    // Offset: 0x190C5F8
    void set_horizontalSliderThumb(UnityEngine::GUIStyle* value);
    // UnityEngine.GUIStyle get_horizontalSliderThumbExtent()
    // Offset: 0x190C600
    UnityEngine::GUIStyle* get_horizontalSliderThumbExtent();
    // System.Void set_horizontalSliderThumbExtent(UnityEngine.GUIStyle value)
    // Offset: 0x190C608
    void set_horizontalSliderThumbExtent(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_verticalSlider()
    // Offset: 0x190C610
    UnityEngine::GUIStyle* get_verticalSlider();
    // public System.Void set_verticalSlider(UnityEngine.GUIStyle value)
    // Offset: 0x190C618
    void set_verticalSlider(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_verticalSliderThumb()
    // Offset: 0x190C620
    UnityEngine::GUIStyle* get_verticalSliderThumb();
    // public System.Void set_verticalSliderThumb(UnityEngine.GUIStyle value)
    // Offset: 0x190C628
    void set_verticalSliderThumb(UnityEngine::GUIStyle* value);
    // UnityEngine.GUIStyle get_verticalSliderThumbExtent()
    // Offset: 0x190C630
    UnityEngine::GUIStyle* get_verticalSliderThumbExtent();
    // System.Void set_verticalSliderThumbExtent(UnityEngine.GUIStyle value)
    // Offset: 0x190C638
    void set_verticalSliderThumbExtent(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_horizontalScrollbar()
    // Offset: 0x1906D08
    UnityEngine::GUIStyle* get_horizontalScrollbar();
    // public System.Void set_horizontalScrollbar(UnityEngine.GUIStyle value)
    // Offset: 0x190C640
    void set_horizontalScrollbar(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_horizontalScrollbarThumb()
    // Offset: 0x190C648
    UnityEngine::GUIStyle* get_horizontalScrollbarThumb();
    // public System.Void set_horizontalScrollbarThumb(UnityEngine.GUIStyle value)
    // Offset: 0x190C650
    void set_horizontalScrollbarThumb(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_horizontalScrollbarLeftButton()
    // Offset: 0x190C658
    UnityEngine::GUIStyle* get_horizontalScrollbarLeftButton();
    // public System.Void set_horizontalScrollbarLeftButton(UnityEngine.GUIStyle value)
    // Offset: 0x190C660
    void set_horizontalScrollbarLeftButton(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_horizontalScrollbarRightButton()
    // Offset: 0x190C668
    UnityEngine::GUIStyle* get_horizontalScrollbarRightButton();
    // public System.Void set_horizontalScrollbarRightButton(UnityEngine.GUIStyle value)
    // Offset: 0x190C670
    void set_horizontalScrollbarRightButton(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_verticalScrollbar()
    // Offset: 0x1906D10
    UnityEngine::GUIStyle* get_verticalScrollbar();
    // public System.Void set_verticalScrollbar(UnityEngine.GUIStyle value)
    // Offset: 0x190C678
    void set_verticalScrollbar(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_verticalScrollbarThumb()
    // Offset: 0x190C680
    UnityEngine::GUIStyle* get_verticalScrollbarThumb();
    // public System.Void set_verticalScrollbarThumb(UnityEngine.GUIStyle value)
    // Offset: 0x190C688
    void set_verticalScrollbarThumb(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_verticalScrollbarUpButton()
    // Offset: 0x190C690
    UnityEngine::GUIStyle* get_verticalScrollbarUpButton();
    // public System.Void set_verticalScrollbarUpButton(UnityEngine.GUIStyle value)
    // Offset: 0x190C698
    void set_verticalScrollbarUpButton(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_verticalScrollbarDownButton()
    // Offset: 0x190C6A0
    UnityEngine::GUIStyle* get_verticalScrollbarDownButton();
    // public System.Void set_verticalScrollbarDownButton(UnityEngine.GUIStyle value)
    // Offset: 0x190C6A8
    void set_verticalScrollbarDownButton(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle get_scrollView()
    // Offset: 0x1906D18
    UnityEngine::GUIStyle* get_scrollView();
    // public System.Void set_scrollView(UnityEngine.GUIStyle value)
    // Offset: 0x190C6B0
    void set_scrollView(UnityEngine::GUIStyle* value);
    // public UnityEngine.GUIStyle[] get_customStyles()
    // Offset: 0x190C6B8
    ::Array<UnityEngine::GUIStyle*>* get_customStyles();
    // public System.Void set_customStyles(UnityEngine.GUIStyle[] value)
    // Offset: 0x190C6C0
    void set_customStyles(::Array<UnityEngine::GUIStyle*>* value);
    // public UnityEngine.GUISettings get_settings()
    // Offset: 0x18FF20C
    UnityEngine::GUISettings* get_settings();
    // static UnityEngine.GUIStyle get_error()
    // Offset: 0x190C6C8
    static UnityEngine::GUIStyle* get_error();
    // System.Void Apply()
    // Offset: 0x190C3A8
    void Apply();
    // private System.Void BuildStyleCache()
    // Offset: 0x190C7F8
    void BuildStyleCache();
    // public UnityEngine.GUIStyle GetStyle(System.String styleName)
    // Offset: 0x1900A0C
    UnityEngine::GUIStyle* GetStyle(::Il2CppString* styleName);
    // public UnityEngine.GUIStyle FindStyle(System.String styleName)
    // Offset: 0x190D5FC
    UnityEngine::GUIStyle* FindStyle(::Il2CppString* styleName);
    // System.Void MakeCurrent()
    // Offset: 0x18FBB40
    void MakeCurrent();
    // public System.Collections.IEnumerator GetEnumerator()
    // Offset: 0x190D898
    System::Collections::IEnumerator* GetEnumerator();
    // public System.Void .ctor()
    // Offset: 0x190C324
    // Implemented from: UnityEngine.ScriptableObject
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GUISkin* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::GUISkin::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GUISkin*, creationType>()));
    }
  }; // UnityEngine.GUISkin
  #pragma pack(pop)
  static check_size<sizeof(GUISkin), 224 + sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, UnityEngine::GUIStyle*>*)> __UnityEngine_GUISkinSizeCheck;
  static_assert(sizeof(GUISkin) == 0xE8);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::GUISkin*, "UnityEngine", "GUISkin");
