// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.GUILayoutGroup
#include "UnityEngine/GUILayoutGroup.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GUIStyle
  class GUIStyle;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.GUIScrollGroup
  // [] Offset: FFFFFFFF
  class GUIScrollGroup : public UnityEngine::GUILayoutGroup {
    public:
    // public System.Single calcMinWidth
    // Size: 0x4
    // Offset: 0x90
    float calcMinWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single calcMaxWidth
    // Size: 0x4
    // Offset: 0x94
    float calcMaxWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single calcMinHeight
    // Size: 0x4
    // Offset: 0x98
    float calcMinHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single calcMaxHeight
    // Size: 0x4
    // Offset: 0x9C
    float calcMaxHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single clientWidth
    // Size: 0x4
    // Offset: 0xA0
    float clientWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single clientHeight
    // Size: 0x4
    // Offset: 0xA4
    float clientHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean allowHorizontalScroll
    // Size: 0x1
    // Offset: 0xA8
    bool allowHorizontalScroll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean allowVerticalScroll
    // Size: 0x1
    // Offset: 0xA9
    bool allowVerticalScroll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean needsHorizontalScrollbar
    // Size: 0x1
    // Offset: 0xAA
    bool needsHorizontalScrollbar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean needsVerticalScrollbar
    // Size: 0x1
    // Offset: 0xAB
    bool needsVerticalScrollbar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: needsVerticalScrollbar and: horizontalScrollbar
    char __padding9[0x4] = {};
    // public UnityEngine.GUIStyle horizontalScrollbar
    // Size: 0x8
    // Offset: 0xB0
    UnityEngine::GUIStyle* horizontalScrollbar;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // public UnityEngine.GUIStyle verticalScrollbar
    // Size: 0x8
    // Offset: 0xB8
    UnityEngine::GUIStyle* verticalScrollbar;
    // Field size check
    static_assert(sizeof(UnityEngine::GUIStyle*) == 0x8);
    // Creating value type constructor for type: GUIScrollGroup
    GUIScrollGroup(float calcMinWidth_ = {}, float calcMaxWidth_ = {}, float calcMinHeight_ = {}, float calcMaxHeight_ = {}, float clientWidth_ = {}, float clientHeight_ = {}, bool allowHorizontalScroll_ = {}, bool allowVerticalScroll_ = {}, bool needsHorizontalScrollbar_ = {}, bool needsVerticalScrollbar_ = {}, UnityEngine::GUIStyle* horizontalScrollbar_ = {}, UnityEngine::GUIStyle* verticalScrollbar_ = {}) noexcept : calcMinWidth{calcMinWidth_}, calcMaxWidth{calcMaxWidth_}, calcMinHeight{calcMinHeight_}, calcMaxHeight{calcMaxHeight_}, clientWidth{clientWidth_}, clientHeight{clientHeight_}, allowHorizontalScroll{allowHorizontalScroll_}, allowVerticalScroll{allowVerticalScroll_}, needsHorizontalScrollbar{needsHorizontalScrollbar_}, needsVerticalScrollbar{needsVerticalScrollbar_}, horizontalScrollbar{horizontalScrollbar_}, verticalScrollbar{verticalScrollbar_} {}
    // public System.Void .ctor()
    // Offset: 0x198B278
    // Implemented from: UnityEngine.GUILayoutGroup
    // Base method: System.Void GUILayoutGroup::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GUIScrollGroup* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("UnityEngine::GUIScrollGroup::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GUIScrollGroup*, creationType>()));
    }
    // public override System.Void CalcWidth()
    // Offset: 0x198B284
    // Implemented from: UnityEngine.GUILayoutGroup
    // Base method: System.Void GUILayoutGroup::CalcWidth()
    void CalcWidth();
    // public override System.Void SetHorizontal(System.Single x, System.Single width)
    // Offset: 0x198B314
    // Implemented from: UnityEngine.GUILayoutGroup
    // Base method: System.Void GUILayoutGroup::SetHorizontal(System.Single x, System.Single width)
    void SetHorizontal(float x, float width);
    // public override System.Void CalcHeight()
    // Offset: 0x198B444
    // Implemented from: UnityEngine.GUILayoutGroup
    // Base method: System.Void GUILayoutGroup::CalcHeight()
    void CalcHeight();
    // public override System.Void SetVertical(System.Single y, System.Single height)
    // Offset: 0x198B54C
    // Implemented from: UnityEngine.GUILayoutGroup
    // Base method: System.Void GUILayoutGroup::SetVertical(System.Single y, System.Single height)
    void SetVertical(float y, float height);
  }; // UnityEngine.GUIScrollGroup
  #pragma pack(pop)
  static check_size<sizeof(GUIScrollGroup), 184 + sizeof(UnityEngine::GUIStyle*)> __UnityEngine_GUIScrollGroupSizeCheck;
  static_assert(sizeof(GUIScrollGroup) == 0xC0);
}
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::GUIScrollGroup*, "UnityEngine", "GUIScrollGroup");
