// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: HumanBone
  struct HumanBone;
  // Forward declaring type: SkeletonBone
  struct SkeletonBone;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
template<class T>
struct Array;
struct Il2CppString;
// Completed il2cpp-utils forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Autogenerated type: UnityEngine.HumanDescription
  struct HumanDescription : public System::ValueType {
    public:
    // public UnityEngine.HumanBone[] human
    // Offset: 0x0
    ::Array<UnityEngine::HumanBone>* human;
    // public UnityEngine.SkeletonBone[] skeleton
    // Offset: 0x8
    ::Array<UnityEngine::SkeletonBone>* skeleton;
    // System.Single m_ArmTwist
    // Offset: 0x10
    float m_ArmTwist;
    // System.Single m_ForeArmTwist
    // Offset: 0x14
    float m_ForeArmTwist;
    // System.Single m_UpperLegTwist
    // Offset: 0x18
    float m_UpperLegTwist;
    // System.Single m_LegTwist
    // Offset: 0x1C
    float m_LegTwist;
    // System.Single m_ArmStretch
    // Offset: 0x20
    float m_ArmStretch;
    // System.Single m_LegStretch
    // Offset: 0x24
    float m_LegStretch;
    // System.Single m_FeetSpacing
    // Offset: 0x28
    float m_FeetSpacing;
    // System.Single m_GlobalScale
    // Offset: 0x2C
    float m_GlobalScale;
    // System.String m_RootMotionBoneName
    // Offset: 0x30
    ::Il2CppString* m_RootMotionBoneName;
    // System.Boolean m_HasTranslationDoF
    // Offset: 0x38
    bool m_HasTranslationDoF;
    // System.Boolean m_HasExtraRoot
    // Offset: 0x39
    bool m_HasExtraRoot;
    // System.Boolean m_SkeletonHasParents
    // Offset: 0x3A
    bool m_SkeletonHasParents;
    // Creating value type constructor for type: HumanDescription
    constexpr HumanDescription(::Array<UnityEngine::HumanBone>* human_ = {}, ::Array<UnityEngine::SkeletonBone>* skeleton_ = {}, float m_ArmTwist_ = {}, float m_ForeArmTwist_ = {}, float m_UpperLegTwist_ = {}, float m_LegTwist_ = {}, float m_ArmStretch_ = {}, float m_LegStretch_ = {}, float m_FeetSpacing_ = {}, float m_GlobalScale_ = {}, ::Il2CppString* m_RootMotionBoneName_ = {}, bool m_HasTranslationDoF_ = {}, bool m_HasExtraRoot_ = {}, bool m_SkeletonHasParents_ = {}) noexcept : human{human_}, skeleton{skeleton_}, m_ArmTwist{m_ArmTwist_}, m_ForeArmTwist{m_ForeArmTwist_}, m_UpperLegTwist{m_UpperLegTwist_}, m_LegTwist{m_LegTwist_}, m_ArmStretch{m_ArmStretch_}, m_LegStretch{m_LegStretch_}, m_FeetSpacing{m_FeetSpacing_}, m_GlobalScale{m_GlobalScale_}, m_RootMotionBoneName{m_RootMotionBoneName_}, m_HasTranslationDoF{m_HasTranslationDoF_}, m_HasExtraRoot{m_HasExtraRoot_}, m_SkeletonHasParents{m_SkeletonHasParents_} {}
  }; // UnityEngine.HumanDescription
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::HumanDescription, "UnityEngine", "HumanDescription");
#pragma pack(pop)
