// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Autogenerated type: UnityEngine.Internal_DrawTextureArguments
  struct Internal_DrawTextureArguments : public System::ValueType {
    public:
    // public UnityEngine.Rect screenRect
    // Offset: 0x0
    UnityEngine::Rect screenRect;
    // public UnityEngine.Rect sourceRect
    // Offset: 0x10
    UnityEngine::Rect sourceRect;
    // public System.Int32 leftBorder
    // Offset: 0x20
    int leftBorder;
    // public System.Int32 rightBorder
    // Offset: 0x24
    int rightBorder;
    // public System.Int32 topBorder
    // Offset: 0x28
    int topBorder;
    // public System.Int32 bottomBorder
    // Offset: 0x2C
    int bottomBorder;
    // public UnityEngine.Color leftBorderColor
    // Offset: 0x30
    UnityEngine::Color leftBorderColor;
    // public UnityEngine.Color rightBorderColor
    // Offset: 0x40
    UnityEngine::Color rightBorderColor;
    // public UnityEngine.Color topBorderColor
    // Offset: 0x50
    UnityEngine::Color topBorderColor;
    // public UnityEngine.Color bottomBorderColor
    // Offset: 0x60
    UnityEngine::Color bottomBorderColor;
    // public UnityEngine.Color color
    // Offset: 0x70
    UnityEngine::Color color;
    // public UnityEngine.Vector4 borderWidths
    // Offset: 0x80
    UnityEngine::Vector4 borderWidths;
    // public UnityEngine.Vector4 cornerRadiuses
    // Offset: 0x90
    UnityEngine::Vector4 cornerRadiuses;
    // public System.Boolean smoothCorners
    // Offset: 0xA0
    bool smoothCorners;
    // public System.Int32 pass
    // Offset: 0xA4
    int pass;
    // public UnityEngine.Texture texture
    // Offset: 0xA8
    UnityEngine::Texture* texture;
    // public UnityEngine.Material mat
    // Offset: 0xB0
    UnityEngine::Material* mat;
    // Creating value type constructor for type: Internal_DrawTextureArguments
    constexpr Internal_DrawTextureArguments(UnityEngine::Rect screenRect_ = {}, UnityEngine::Rect sourceRect_ = {}, int leftBorder_ = {}, int rightBorder_ = {}, int topBorder_ = {}, int bottomBorder_ = {}, UnityEngine::Color leftBorderColor_ = {}, UnityEngine::Color rightBorderColor_ = {}, UnityEngine::Color topBorderColor_ = {}, UnityEngine::Color bottomBorderColor_ = {}, UnityEngine::Color color_ = {}, UnityEngine::Vector4 borderWidths_ = {}, UnityEngine::Vector4 cornerRadiuses_ = {}, bool smoothCorners_ = {}, int pass_ = {}, UnityEngine::Texture* texture_ = {}, UnityEngine::Material* mat_ = {}) noexcept : screenRect{screenRect_}, sourceRect{sourceRect_}, leftBorder{leftBorder_}, rightBorder{rightBorder_}, topBorder{topBorder_}, bottomBorder{bottomBorder_}, leftBorderColor{leftBorderColor_}, rightBorderColor{rightBorderColor_}, topBorderColor{topBorderColor_}, bottomBorderColor{bottomBorderColor_}, color{color_}, borderWidths{borderWidths_}, cornerRadiuses{cornerRadiuses_}, smoothCorners{smoothCorners_}, pass{pass_}, texture{texture_}, mat{mat_} {}
  }; // UnityEngine.Internal_DrawTextureArguments
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::Internal_DrawTextureArguments, "UnityEngine", "Internal_DrawTextureArguments");
#pragma pack(pop)
