// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// WARNING Layout: Sequential may not be correctly taken into account!
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.ParticleSystem
#include "UnityEngine/ParticleSystem.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
// Completed includes
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0x84
  // Autogenerated type: UnityEngine.ParticleSystem/Particle
  // [] Offset: FFFFFFFF
  // [RequiredByNativeCodeAttribute] Offset: D788F8
  struct ParticleSystem::Particle/*, public System::ValueType*/ {
    public:
    // private UnityEngine.Vector3 m_Position
    // Size: 0xC
    // Offset: 0x0
    UnityEngine::Vector3 m_Position;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_Velocity
    // Size: 0xC
    // Offset: 0xC
    UnityEngine::Vector3 m_Velocity;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_AnimatedVelocity
    // Size: 0xC
    // Offset: 0x18
    UnityEngine::Vector3 m_AnimatedVelocity;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_InitialVelocity
    // Size: 0xC
    // Offset: 0x24
    UnityEngine::Vector3 m_InitialVelocity;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_AxisOfRotation
    // Size: 0xC
    // Offset: 0x30
    UnityEngine::Vector3 m_AxisOfRotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_Rotation
    // Size: 0xC
    // Offset: 0x3C
    UnityEngine::Vector3 m_Rotation;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_AngularVelocity
    // Size: 0xC
    // Offset: 0x48
    UnityEngine::Vector3 m_AngularVelocity;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_StartSize
    // Size: 0xC
    // Offset: 0x54
    UnityEngine::Vector3 m_StartSize;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Color32 m_StartColor
    // Size: 0x4
    // Offset: 0x60
    UnityEngine::Color32 m_StartColor;
    // Field size check
    static_assert(sizeof(UnityEngine::Color32) == 0x4);
    // private System.UInt32 m_RandomSeed
    // Size: 0x4
    // Offset: 0x64
    uint m_RandomSeed;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_ParentRandomSeed
    // Size: 0x4
    // Offset: 0x68
    uint m_ParentRandomSeed;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Single m_Lifetime
    // Size: 0x4
    // Offset: 0x6C
    float m_Lifetime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_StartLifetime
    // Size: 0x4
    // Offset: 0x70
    float m_StartLifetime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_MeshIndex
    // Size: 0x4
    // Offset: 0x74
    int m_MeshIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_EmitAccumulator0
    // Size: 0x4
    // Offset: 0x78
    float m_EmitAccumulator0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_EmitAccumulator1
    // Size: 0x4
    // Offset: 0x7C
    float m_EmitAccumulator1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.UInt32 m_Flags
    // Size: 0x4
    // Offset: 0x80
    uint m_Flags;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Creating value type constructor for type: Particle
    constexpr Particle(UnityEngine::Vector3 m_Position_ = {}, UnityEngine::Vector3 m_Velocity_ = {}, UnityEngine::Vector3 m_AnimatedVelocity_ = {}, UnityEngine::Vector3 m_InitialVelocity_ = {}, UnityEngine::Vector3 m_AxisOfRotation_ = {}, UnityEngine::Vector3 m_Rotation_ = {}, UnityEngine::Vector3 m_AngularVelocity_ = {}, UnityEngine::Vector3 m_StartSize_ = {}, UnityEngine::Color32 m_StartColor_ = {}, uint m_RandomSeed_ = {}, uint m_ParentRandomSeed_ = {}, float m_Lifetime_ = {}, float m_StartLifetime_ = {}, int m_MeshIndex_ = {}, float m_EmitAccumulator0_ = {}, float m_EmitAccumulator1_ = {}, uint m_Flags_ = {}) noexcept : m_Position{m_Position_}, m_Velocity{m_Velocity_}, m_AnimatedVelocity{m_AnimatedVelocity_}, m_InitialVelocity{m_InitialVelocity_}, m_AxisOfRotation{m_AxisOfRotation_}, m_Rotation{m_Rotation_}, m_AngularVelocity{m_AngularVelocity_}, m_StartSize{m_StartSize_}, m_StartColor{m_StartColor_}, m_RandomSeed{m_RandomSeed_}, m_ParentRandomSeed{m_ParentRandomSeed_}, m_Lifetime{m_Lifetime_}, m_StartLifetime{m_StartLifetime_}, m_MeshIndex{m_MeshIndex_}, m_EmitAccumulator0{m_EmitAccumulator0_}, m_EmitAccumulator1{m_EmitAccumulator1_}, m_Flags{m_Flags_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // public System.Void set_lifetime(System.Single value)
    // Offset: 0xCB92BC
    void set_lifetime(float value);
    // public System.Void set_position(UnityEngine.Vector3 value)
    // Offset: 0xCB92C4
    void set_position(UnityEngine::Vector3 value);
    // public System.Void set_velocity(UnityEngine.Vector3 value)
    // Offset: 0xCB92D0
    void set_velocity(UnityEngine::Vector3 value);
    // public System.Void set_remainingLifetime(System.Single value)
    // Offset: 0xCB92DC
    void set_remainingLifetime(float value);
    // public System.Void set_startLifetime(System.Single value)
    // Offset: 0xCB92E4
    void set_startLifetime(float value);
    // public System.Void set_startColor(UnityEngine.Color32 value)
    // Offset: 0xCB92EC
    void set_startColor(UnityEngine::Color32 value);
    // public System.Void set_randomSeed(System.UInt32 value)
    // Offset: 0xCB92F4
    void set_randomSeed(uint value);
    // public System.Void set_startSize(System.Single value)
    // Offset: 0xCB92FC
    void set_startSize(float value);
    // public System.Void set_rotation3D(UnityEngine.Vector3 value)
    // Offset: 0xCB934C
    void set_rotation3D(UnityEngine::Vector3 value);
    // public System.Void set_angularVelocity3D(UnityEngine.Vector3 value)
    // Offset: 0xCB9354
    void set_angularVelocity3D(UnityEngine::Vector3 value);
  }; // UnityEngine.ParticleSystem/Particle
  static check_size<sizeof(ParticleSystem::Particle), 128 + sizeof(uint)> __UnityEngine_ParticleSystem_ParticleSizeCheck;
  static_assert(sizeof(ParticleSystem::Particle) == 0x84);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::ParticleSystem::Particle, "UnityEngine", "ParticleSystem/Particle");
#pragma pack(pop)
