// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Including type: UnityEngine.TextGenerationSettings
#include "UnityEngine/TextGenerationSettings.hpp"
// Including type: UnityEngine.TextGenerationError
#include "UnityEngine/TextGenerationError.hpp"
// Including type: UnityEngine.UIVertex
#include "UnityEngine/UIVertex.hpp"
// Including type: UnityEngine.UICharInfo
#include "UnityEngine/UICharInfo.hpp"
// Including type: UnityEngine.UILineInfo
#include "UnityEngine/UILineInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rect
  struct Rect;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Font
  class Font;
  // Skipping declaration: Color because it is already included!
  // Skipping declaration: FontStyle because it is already included!
  // Skipping declaration: TextAnchor because it is already included!
  // Skipping declaration: VerticalWrapMode because it is already included!
  // Skipping declaration: HorizontalWrapMode because it is already included!
  // Skipping declaration: Vector2 because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: TextGenerator
  class TextGenerator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::TextGenerator);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TextGenerator*, "UnityEngine", "TextGenerator");
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0xA3
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.TextGenerator
  // [TokenAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: 10A4838
  // [UsedByNativeCodeAttribute] Offset: 10A4838
  class TextGenerator : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    public:
    // System.IntPtr m_Ptr
    // Size: 0x8
    // Offset: 0x10
    ::System::IntPtr m_Ptr;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private System.String m_LastString
    // Size: 0x8
    // Offset: 0x18
    ::StringW m_LastString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.TextGenerationSettings m_LastSettings
    // Size: 0x59
    // Offset: 0x20
    ::UnityEngine::TextGenerationSettings m_LastSettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextGenerationSettings) == 0x59);
    // Padding between fields: m_LastSettings and: m_HasGenerated
    char __padding2[0x7] = {};
    // private System.Boolean m_HasGenerated
    // Size: 0x1
    // Offset: 0x80
    bool m_HasGenerated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasGenerated and: m_LastValid
    char __padding3[0x3] = {};
    // private UnityEngine.TextGenerationError m_LastValid
    // Size: 0x4
    // Offset: 0x84
    ::UnityEngine::TextGenerationError m_LastValid;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextGenerationError) == 0x4);
    // private readonly System.Collections.Generic.List`1<UnityEngine.UIVertex> m_Verts
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::UnityEngine::UIVertex>* m_Verts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIVertex>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.UICharInfo> m_Characters
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::List_1<::UnityEngine::UICharInfo>* m_Characters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UICharInfo>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.UILineInfo> m_Lines
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<::UnityEngine::UILineInfo>* m_Lines;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UILineInfo>*) == 0x8);
    // private System.Boolean m_CachedVerts
    // Size: 0x1
    // Offset: 0xA0
    bool m_CachedVerts;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CachedCharacters
    // Size: 0x1
    // Offset: 0xA1
    bool m_CachedCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CachedLines
    // Size: 0x1
    // Offset: 0xA2
    bool m_CachedLines;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Creating interface conversion operator: i_IDisposable
    inline ::System::IDisposable* i_IDisposable() noexcept {
      return reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: System.IntPtr m_Ptr
    [[deprecated("Use field access instead!")]] ::System::IntPtr& dyn_m_Ptr();
    // Get instance field reference: private System.String m_LastString
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_LastString();
    // Get instance field reference: private UnityEngine.TextGenerationSettings m_LastSettings
