// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ProBuilder.AutoUnwrapSettings
#include "UnityEngine/ProBuilder/AutoUnwrapSettings.hpp"
// Including type: UnityEngine.ProBuilder.Edge
#include "UnityEngine/ProBuilder/Edge.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.ProBuilder
namespace UnityEngine::ProBuilder {
  // Forward declaring type: Face
  class Face;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(UnityEngine::ProBuilder::Face);
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::ProBuilder::Face*, "UnityEngine.ProBuilder", "Face");
// Type namespace: UnityEngine.ProBuilder
namespace UnityEngine::ProBuilder {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.ProBuilder.Face
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: 126EE78
  class Face : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [FormerlySerializedAsAttribute] Offset: 0x126F9DC
    // private System.Int32[] m_Indexes
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<int> m_Indexes;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x126FA28
    // private System.Int32 m_SmoothingGroup
    // Size: 0x4
    // Offset: 0x18
    int m_SmoothingGroup;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x126FA74
    // private UnityEngine.ProBuilder.AutoUnwrapSettings m_Uv
    // Size: 0x20
    // Offset: 0x1C
    UnityEngine::ProBuilder::AutoUnwrapSettings m_Uv;
    // Field size check
    static_assert(sizeof(UnityEngine::ProBuilder::AutoUnwrapSettings) == 0x20);
    // Padding between fields: m_Uv and: m_Material
    char __padding2[0x4] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x126FAC0
    // private UnityEngine.Material m_Material
    // Size: 0x8
    // Offset: 0x40
    UnityEngine::Material* m_Material;
    // Field size check
    static_assert(sizeof(UnityEngine::Material*) == 0x8);
    // private System.Int32 m_SubmeshIndex
    // Size: 0x4
    // Offset: 0x48
    int m_SubmeshIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x126FB1C
    // private System.Boolean m_ManualUV
    // Size: 0x1
    // Offset: 0x4C
    bool m_ManualUV;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ManualUV and: elementGroup
    char __padding5[0x3] = {};
    // System.Int32 elementGroup
    // Size: 0x4
    // Offset: 0x50
    int elementGroup;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_TextureGroup
    // Size: 0x4
    // Offset: 0x54
    int m_TextureGroup;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32[] m_DistinctIndexes
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<int> m_DistinctIndexes;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private UnityEngine.ProBuilder.Edge[] m_Edges
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<UnityEngine::ProBuilder::Edge> m_Edges;
    // Field size check
    static_assert(sizeof(::ArrayW<UnityEngine::ProBuilder::Edge>) == 0x8);
    public:
    // Get instance field reference: private System.Int32[] m_Indexes
    ::ArrayW<int>& dyn_m_Indexes();
    // Get instance field reference: private System.Int32 m_SmoothingGroup
    int& dyn_m_SmoothingGroup();
    // Get instance field reference: private UnityEngine.ProBuilder.AutoUnwrapSettings m_Uv
    UnityEngine::ProBuilder::AutoUnwrapSettings& dyn_m_Uv();
    // Get instance field reference: private UnityEngine.Material m_Material
    UnityEngine::Material*& dyn_m_Material();
    // Get instance field reference: private System.Int32 m_SubmeshIndex
    int& dyn_m_SubmeshIndex();
    // Get instance field reference: private System.Boolean m_ManualUV
    bool& dyn_m_ManualUV();
    // Get instance field reference: System.Int32 elementGroup
    int& dyn_elementGroup();
