// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.UInt32
#include "System/UInt32.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.ProBuilder.Edge
#include "UnityEngine/ProBuilder/Edge.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine::ProBuilder
namespace UnityEngine::ProBuilder {
  // Forward declaring type: Face
  class Face;
  // Forward declaring type: SharedVertex
  class SharedVertex;
  // Forward declaring type: Vertex
  class Vertex;
  // Forward declaring type: UnwrapParameters
  class UnwrapParameters;
  // Forward declaring type: MeshArrays
  struct MeshArrays;
  // Forward declaring type: MeshSyncState
  struct MeshSyncState;
  // Forward declaring type: RefreshMask
  struct RefreshMask;
  // Forward declaring type: AutoUnwrapSettings
  struct AutoUnwrapSettings;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: MeshTopology
  struct MeshTopology;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: UnityEngine.ProBuilder
namespace UnityEngine::ProBuilder {
  // Autogenerated type: UnityEngine.ProBuilder.ProBuilderMesh
  class ProBuilderMesh : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState
    struct CacheValidState;
    // Nested type: UnityEngine::ProBuilder::ProBuilderMesh::$$c
    class $$c;
    // Nested type: UnityEngine::ProBuilder::ProBuilderMesh::$$c__DisplayClass143_0
    class $$c__DisplayClass143_0;
    // Nested type: UnityEngine::ProBuilder::ProBuilderMesh::$$c__DisplayClass145_0
    class $$c__DisplayClass145_0;
    // Autogenerated type: UnityEngine.ProBuilder.ProBuilderMesh/CacheValidState
    struct CacheValidState : public System::Enum {
      public:
      // public System.Byte value__
      // Offset: 0x0
      uint8_t value;
      // Creating value type constructor for type: CacheValidState
      constexpr CacheValidState(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.ProBuilder.ProBuilderMesh/CacheValidState SharedVertex
      static constexpr const uint8_t SharedVertex = 1u;
      // Get static field: static public UnityEngine.ProBuilder.ProBuilderMesh/CacheValidState SharedVertex
      static UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState _get_SharedVertex();
      // Set static field: static public UnityEngine.ProBuilder.ProBuilderMesh/CacheValidState SharedVertex
      static void _set_SharedVertex(UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState value);
      // static field const value: static public UnityEngine.ProBuilder.ProBuilderMesh/CacheValidState SharedTexture
      static constexpr const uint8_t SharedTexture = 2u;
      // Get static field: static public UnityEngine.ProBuilder.ProBuilderMesh/CacheValidState SharedTexture
      static UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState _get_SharedTexture();
      // Set static field: static public UnityEngine.ProBuilder.ProBuilderMesh/CacheValidState SharedTexture
      static void _set_SharedTexture(UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState value);
    }; // UnityEngine.ProBuilder.ProBuilderMesh/CacheValidState
    // private System.Int32 m_MeshFormatVersion
    // Offset: 0x18
    int m_MeshFormatVersion;
    // private UnityEngine.ProBuilder.Face[] m_Faces
    // Offset: 0x20
    ::Array<UnityEngine::ProBuilder::Face*>* m_Faces;
    // private UnityEngine.ProBuilder.SharedVertex[] m_SharedVertices
    // Offset: 0x28
    ::Array<UnityEngine::ProBuilder::SharedVertex*>* m_SharedVertices;
    // private UnityEngine.ProBuilder.ProBuilderMesh/CacheValidState m_CacheValid
    // Offset: 0x30
    UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState m_CacheValid;
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_SharedVertexLookup
    // Offset: 0x38
    System::Collections::Generic::Dictionary_2<int, int>* m_SharedVertexLookup;
    // private UnityEngine.ProBuilder.SharedVertex[] m_SharedTextures
    // Offset: 0x40
    ::Array<UnityEngine::ProBuilder::SharedVertex*>* m_SharedTextures;
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_SharedTextureLookup
    // Offset: 0x48
    System::Collections::Generic::Dictionary_2<int, int>* m_SharedTextureLookup;
    // private UnityEngine.Vector3[] m_Positions
    // Offset: 0x50
    ::Array<UnityEngine::Vector3>* m_Positions;
    // private UnityEngine.Vector2[] m_Textures0
    // Offset: 0x58
    ::Array<UnityEngine::Vector2>* m_Textures0;
    // private System.Collections.Generic.List`1<UnityEngine.Vector4> m_Textures2
    // Offset: 0x60
    System::Collections::Generic::List_1<UnityEngine::Vector4>* m_Textures2;
    // private System.Collections.Generic.List`1<UnityEngine.Vector4> m_Textures3
    // Offset: 0x68
    System::Collections::Generic::List_1<UnityEngine::Vector4>* m_Textures3;
    // private UnityEngine.Vector4[] m_Tangents
    // Offset: 0x70
    ::Array<UnityEngine::Vector4>* m_Tangents;
    // private UnityEngine.Vector3[] m_Normals
    // Offset: 0x78
    ::Array<UnityEngine::Vector3>* m_Normals;
    // private UnityEngine.Color[] m_Colors
    // Offset: 0x80
    ::Array<UnityEngine::Color>* m_Colors;
    // private System.Boolean <userCollisions>k__BackingField
    // Offset: 0x88
    bool userCollisions;
    // private UnityEngine.ProBuilder.UnwrapParameters m_UnwrapParameters
    // Offset: 0x90
    UnityEngine::ProBuilder::UnwrapParameters* m_UnwrapParameters;
    // private System.Boolean m_PreserveMeshAssetOnDestroy
    // Offset: 0x98
    bool m_PreserveMeshAssetOnDestroy;
    // System.String assetGuid
    // Offset: 0xA0
    ::Il2CppString* assetGuid;
    // private UnityEngine.MeshRenderer m_MeshRenderer
    // Offset: 0xA8
    UnityEngine::MeshRenderer* m_MeshRenderer;
    // private UnityEngine.MeshFilter m_MeshFilter
    // Offset: 0xB0
    UnityEngine::MeshFilter* m_MeshFilter;
    // private System.Boolean m_IsSelectable
    // Offset: 0xB8
    bool m_IsSelectable;
    // private System.Int32[] m_SelectedFaces
    // Offset: 0xC0
    ::Array<int>* m_SelectedFaces;
    // private UnityEngine.ProBuilder.Edge[] m_SelectedEdges
    // Offset: 0xC8
    ::Array<UnityEngine::ProBuilder::Edge>* m_SelectedEdges;
    // private System.Int32[] m_SelectedVertices
    // Offset: 0xD0
    ::Array<int>* m_SelectedVertices;
    // private System.Boolean m_SelectedCacheDirty
    // Offset: 0xD8
    bool m_SelectedCacheDirty;
    // private System.Int32 m_SelectedSharedVerticesCount
    // Offset: 0xDC
    int m_SelectedSharedVerticesCount;
    // private System.Int32 m_SelectedCoincidentVertexCount
    // Offset: 0xE0
    int m_SelectedCoincidentVertexCount;
    // private System.Collections.Generic.HashSet`1<System.Int32> m_SelectedSharedVertices
    // Offset: 0xE8
    System::Collections::Generic::HashSet_1<int>* m_SelectedSharedVertices;
    // private System.Collections.Generic.List`1<System.Int32> m_SelectedCoincidentVertices
    // Offset: 0xF0
    System::Collections::Generic::List_1<int>* m_SelectedCoincidentVertices;
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Int32 k_UVChannelCount
    static constexpr const int k_UVChannelCount = 4;
    // Get static field: static private System.Int32 k_UVChannelCount
    static int _get_k_UVChannelCount();
    // Set static field: static private System.Int32 k_UVChannelCount
    static void _set_k_UVChannelCount(int value);
    // static field const value: static private System.Int32 k_MeshFormatVersion
    static constexpr const int k_MeshFormatVersion = 1;
    // Get static field: static private System.Int32 k_MeshFormatVersion
    static int _get_k_MeshFormatVersion();
    // Set static field: static private System.Int32 k_MeshFormatVersion
    static void _set_k_MeshFormatVersion(int value);
