// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.ProBuilder.Edge
#include "UnityEngine/ProBuilder/Edge.hpp"
// Including type: UnityEngine.HideFlags
#include "UnityEngine/HideFlags.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.UInt32
#include "System/UInt32.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine::ProBuilder
namespace UnityEngine::ProBuilder {
  // Forward declaring type: Face
  class Face;
  // Forward declaring type: SharedVertex
  class SharedVertex;
  // Forward declaring type: UnwrapParameters
  class UnwrapParameters;
  // Forward declaring type: MeshSyncState
  struct MeshSyncState;
  // Forward declaring type: MeshArrays
  struct MeshArrays;
  // Forward declaring type: Vertex
  class Vertex;
  // Forward declaring type: RefreshMask
  struct RefreshMask;
  // Forward declaring type: AutoUnwrapSettings
  struct AutoUnwrapSettings;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: MeshTopology
  struct MeshTopology;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Completed forward declares
// Type namespace: UnityEngine.ProBuilder
namespace UnityEngine::ProBuilder {
  // Size: 0x100
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.ProBuilder.ProBuilderMesh
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: F67F20
  // [RequireComponent] Offset: F67F20
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  // [ExcludeFromObjectFactoryAttribute] Offset: FFFFFFFF
  class ProBuilderMesh : public UnityEngine::MonoBehaviour {
    public:
    // Nested type: UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState
    struct CacheValidState;
    // Nested type: UnityEngine::ProBuilder::ProBuilderMesh::$$c
    class $$c;
    // Nested type: UnityEngine::ProBuilder::ProBuilderMesh::$$c__DisplayClass150_0
    class $$c__DisplayClass150_0;
    // Nested type: UnityEngine::ProBuilder::ProBuilderMesh::$$c__DisplayClass152_0
    class $$c__DisplayClass152_0;
    // Size: 0x1
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.ProBuilder.ProBuilderMesh/UnityEngine.ProBuilder.CacheValidState
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct CacheValidState/*, public System::Enum*/ {
      public:
      // public System.Byte value__
      // Size: 0x1
      // Offset: 0x0
      uint8_t value;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      // Creating value type constructor for type: CacheValidState
      constexpr CacheValidState(uint8_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.ProBuilder.ProBuilderMesh/UnityEngine.ProBuilder.CacheValidState SharedVertex
      static constexpr const uint8_t SharedVertex = 1u;
      // Get static field: static public UnityEngine.ProBuilder.ProBuilderMesh/UnityEngine.ProBuilder.CacheValidState SharedVertex
      static UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState _get_SharedVertex();
      // Set static field: static public UnityEngine.ProBuilder.ProBuilderMesh/UnityEngine.ProBuilder.CacheValidState SharedVertex
      static void _set_SharedVertex(UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState value);
      // static field const value: static public UnityEngine.ProBuilder.ProBuilderMesh/UnityEngine.ProBuilder.CacheValidState SharedTexture
      static constexpr const uint8_t SharedTexture = 2u;
      // Get static field: static public UnityEngine.ProBuilder.ProBuilderMesh/UnityEngine.ProBuilder.CacheValidState SharedTexture
      static UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState _get_SharedTexture();
      // Set static field: static public UnityEngine.ProBuilder.ProBuilderMesh/UnityEngine.ProBuilder.CacheValidState SharedTexture
      static void _set_SharedTexture(UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState value);
      // Get instance field reference: public System.Byte value__
      uint8_t& dyn_value__();
    }; // UnityEngine.ProBuilder.ProBuilderMesh/UnityEngine.ProBuilder.CacheValidState
    #pragma pack(pop)
    static check_size<sizeof(ProBuilderMesh::CacheValidState), 0 + sizeof(uint8_t)> __UnityEngine_ProBuilder_ProBuilderMesh_CacheValidStateSizeCheck;
    static_assert(sizeof(ProBuilderMesh::CacheValidState) == 0x1);
    // private System.Int32 m_MeshFormatVersion
    // Size: 0x4
    // Offset: 0x18
    int m_MeshFormatVersion;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_MeshFormatVersion and: m_Faces
    char __padding0[0x4] = {};
    // [FormerlySerializedAsAttribute] Offset: 0xF69F44
    // private UnityEngine.ProBuilder.Face[] m_Faces
    // Size: 0x8
    // Offset: 0x20
    ::Array<UnityEngine::ProBuilder::Face*>* m_Faces;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::ProBuilder::Face*>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF69F90
    // [FormerlySerializedAsAttribute] Offset: 0xF69F90
    // private UnityEngine.ProBuilder.SharedVertex[] m_SharedVertices
    // Size: 0x8
    // Offset: 0x28
    ::Array<UnityEngine::ProBuilder::SharedVertex*>* m_SharedVertices;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::ProBuilder::SharedVertex*>*) == 0x8);
    // private UnityEngine.ProBuilder.ProBuilderMesh/UnityEngine.ProBuilder.CacheValidState m_CacheValid
    // Size: 0x1
    // Offset: 0x30
    UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState m_CacheValid;
    // Field size check
    static_assert(sizeof(UnityEngine::ProBuilder::ProBuilderMesh::CacheValidState) == 0x1);
    // Padding between fields: m_CacheValid and: m_SharedVertexLookup
    char __padding3[0x7] = {};
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_SharedVertexLookup
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Generic::Dictionary_2<int, int>* m_SharedVertexLookup;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF6A000
    // private UnityEngine.ProBuilder.SharedVertex[] m_SharedTextures
    // Size: 0x8
    // Offset: 0x40
    ::Array<UnityEngine::ProBuilder::SharedVertex*>* m_SharedTextures;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::ProBuilder::SharedVertex*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_SharedTextureLookup
    // Size: 0x8
    // Offset: 0x48
    System::Collections::Generic::Dictionary_2<int, int>* m_SharedTextureLookup;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF6A04C
    // private UnityEngine.Vector3[] m_Positions
    // Size: 0x8
    // Offset: 0x50
    ::Array<UnityEngine::Vector3>* m_Positions;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector3>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF6A098
    // private UnityEngine.Vector2[] m_Textures0
    // Size: 0x8
    // Offset: 0x58
    ::Array<UnityEngine::Vector2>* m_Textures0;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector2>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF6A0E4
    // private System.Collections.Generic.List`1<UnityEngine.Vector4> m_Textures2
    // Size: 0x8
    // Offset: 0x60
    System::Collections::Generic::List_1<UnityEngine::Vector4>* m_Textures2;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::Vector4>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF6A130
    // private System.Collections.Generic.List`1<UnityEngine.Vector4> m_Textures3
    // Size: 0x8
    // Offset: 0x68
    System::Collections::Generic::List_1<UnityEngine::Vector4>* m_Textures3;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::Vector4>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF6A17C
    // private UnityEngine.Vector4[] m_Tangents
    // Size: 0x8
    // Offset: 0x70
    ::Array<UnityEngine::Vector4>* m_Tangents;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector4>*) == 0x8);
    // private UnityEngine.Vector3[] m_Normals
    // Size: 0x8
    // Offset: 0x78
    ::Array<UnityEngine::Vector3>* m_Normals;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Vector3>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF6A1C8
    // private UnityEngine.Color[] m_Colors
    // Size: 0x8
    // Offset: 0x80
    ::Array<UnityEngine::Color>* m_Colors;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::Color>*) == 0x8);
    // private System.Boolean <userCollisions>k__BackingField
    // Size: 0x1
    // Offset: 0x88
    bool userCollisions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: userCollisions and: m_UnwrapParameters
    char __padding14[0x7] = {};
    // [FormerlySerializedAsAttribute] Offset: 0xF6A224
    // private UnityEngine.ProBuilder.UnwrapParameters m_UnwrapParameters
    // Size: 0x8
    // Offset: 0x90
    UnityEngine::ProBuilder::UnwrapParameters* m_UnwrapParameters;
    // Field size check
    static_assert(sizeof(UnityEngine::ProBuilder::UnwrapParameters*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF6A270
    // private System.Boolean m_PreserveMeshAssetOnDestroy
    // Size: 0x1
    // Offset: 0x98
    bool m_PreserveMeshAssetOnDestroy;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PreserveMeshAssetOnDestroy and: assetGuid
    char __padding16[0x7] = {};
    // System.String assetGuid
    // Size: 0x8
    // Offset: 0xA0
    ::Il2CppString* assetGuid;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private UnityEngine.Mesh m_Mesh
    // Size: 0x8
    // Offset: 0xA8
    UnityEngine::Mesh* m_Mesh;
    // Field size check
    static_assert(sizeof(UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.MeshRenderer m_MeshRenderer
    // Size: 0x8
    // Offset: 0xB0
    UnityEngine::MeshRenderer* m_MeshRenderer;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.MeshFilter m_MeshFilter
    // Size: 0x8
    // Offset: 0xB8
    UnityEngine::MeshFilter* m_MeshFilter;
    // Field size check
    static_assert(sizeof(UnityEngine::MeshFilter*) == 0x8);
    // private System.Boolean m_IsSelectable
    // Size: 0x1
    // Offset: 0xC0
    bool m_IsSelectable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_IsSelectable and: m_SelectedFaces
    char __padding21[0x7] = {};
    // private System.Int32[] m_SelectedFaces
    // Size: 0x8
    // Offset: 0xC8
    ::Array<int>* m_SelectedFaces;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private UnityEngine.ProBuilder.Edge[] m_SelectedEdges
    // Size: 0x8
    // Offset: 0xD0
    ::Array<UnityEngine::ProBuilder::Edge>* m_SelectedEdges;
    // Field size check
    static_assert(sizeof(::Array<UnityEngine::ProBuilder::Edge>*) == 0x8);
    // private System.Int32[] m_SelectedVertices
    // Size: 0x8
    // Offset: 0xD8
    ::Array<int>* m_SelectedVertices;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Boolean m_SelectedCacheDirty
    // Size: 0x1
    // Offset: 0xE0
    bool m_SelectedCacheDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SelectedCacheDirty and: m_SelectedSharedVerticesCount
    char __padding25[0x3] = {};
    // private System.Int32 m_SelectedSharedVerticesCount
    // Size: 0x4
    // Offset: 0xE4
    int m_SelectedSharedVerticesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_SelectedCoincidentVertexCount
    // Size: 0x4
    // Offset: 0xE8
    int m_SelectedCoincidentVertexCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_SelectedCoincidentVertexCount and: m_SelectedSharedVertices
    char __padding27[0x4] = {};
    // private System.Collections.Generic.HashSet`1<System.Int32> m_SelectedSharedVertices
    // Size: 0x8
    // Offset: 0xF0
    System::Collections::Generic::HashSet_1<int>* m_SelectedSharedVertices;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> m_SelectedCoincidentVertices
    // Size: 0x8
    // Offset: 0xF8
    System::Collections::Generic::List_1<int>* m_SelectedCoincidentVertices;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<int>*) == 0x8);
    // Creating value type constructor for type: ProBuilderMesh
