// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IEquatable`1
#include "System/IEquatable_1.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.ProBuilder.MeshArrays
#include "UnityEngine/ProBuilder/MeshArrays.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
}
// Completed forward declares
// Type namespace: UnityEngine.ProBuilder
namespace UnityEngine::ProBuilder {
  // Forward declaring type: Vertex
  class Vertex;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(UnityEngine::ProBuilder::Vertex);
DEFINE_IL2CPP_ARG_TYPE(UnityEngine::ProBuilder::Vertex*, "UnityEngine.ProBuilder", "Vertex");
// Type namespace: UnityEngine.ProBuilder
namespace UnityEngine::ProBuilder {
  // Size: 0x7C
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.ProBuilder.Vertex
  // [TokenAttribute] Offset: FFFFFFFF
  class Vertex : public ::Il2CppObject/*, public System::IEquatable_1<UnityEngine::ProBuilder::Vertex*>*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private UnityEngine.Vector3 m_Position
    // Size: 0xC
    // Offset: 0x10
    UnityEngine::Vector3 m_Position;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Color m_Color
    // Size: 0x10
    // Offset: 0x1C
    UnityEngine::Color m_Color;
    // Field size check
    static_assert(sizeof(UnityEngine::Color) == 0x10);
    // private UnityEngine.Vector3 m_Normal
    // Size: 0xC
    // Offset: 0x2C
    UnityEngine::Vector3 m_Normal;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector4 m_Tangent
    // Size: 0x10
    // Offset: 0x38
    UnityEngine::Vector4 m_Tangent;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Vector2 m_UV0
    // Size: 0x8
    // Offset: 0x48
    UnityEngine::Vector2 m_UV0;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_UV2
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::Vector2 m_UV2;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector4 m_UV3
    // Size: 0x10
    // Offset: 0x58
    UnityEngine::Vector4 m_UV3;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Vector4 m_UV4
    // Size: 0x10
    // Offset: 0x68
    UnityEngine::Vector4 m_UV4;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector4) == 0x10);
    // private UnityEngine.ProBuilder.MeshArrays m_Attributes
    // Size: 0x4
    // Offset: 0x78
    UnityEngine::ProBuilder::MeshArrays m_Attributes;
    // Field size check
    static_assert(sizeof(UnityEngine::ProBuilder::MeshArrays) == 0x4);
    public:
    // Creating interface conversion operator: operator System::IEquatable_1<UnityEngine::ProBuilder::Vertex*>
    operator System::IEquatable_1<UnityEngine::ProBuilder::Vertex*>() noexcept {
      return *reinterpret_cast<System::IEquatable_1<UnityEngine::ProBuilder::Vertex*>*>(this);
    }
    // Get instance field reference: private UnityEngine.Vector3 m_Position
    UnityEngine::Vector3& dyn_m_Position();
    // Get instance field reference: private UnityEngine.Color m_Color
    UnityEngine::Color& dyn_m_Color();
    // Get instance field reference: private UnityEngine.Vector3 m_Normal
    UnityEngine::Vector3& dyn_m_Normal();
    // Get instance field reference: private UnityEngine.Vector4 m_Tangent
    UnityEngine::Vector4& dyn_m_Tangent();
