// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Type namespace: Valve.VR
namespace Valve::VR {
  // Autogenerated type: Valve.VR.Compositor_CumulativeStats
  struct Compositor_CumulativeStats : public System::ValueType {
    public:
    // public System.UInt32 m_nPid
    // Offset: 0x0
    uint m_nPid;
    // public System.UInt32 m_nNumFramePresents
    // Offset: 0x4
    uint m_nNumFramePresents;
    // public System.UInt32 m_nNumDroppedFrames
    // Offset: 0x8
    uint m_nNumDroppedFrames;
    // public System.UInt32 m_nNumReprojectedFrames
    // Offset: 0xC
    uint m_nNumReprojectedFrames;
    // public System.UInt32 m_nNumFramePresentsOnStartup
    // Offset: 0x10
    uint m_nNumFramePresentsOnStartup;
    // public System.UInt32 m_nNumDroppedFramesOnStartup
    // Offset: 0x14
    uint m_nNumDroppedFramesOnStartup;
    // public System.UInt32 m_nNumReprojectedFramesOnStartup
    // Offset: 0x18
    uint m_nNumReprojectedFramesOnStartup;
    // public System.UInt32 m_nNumLoading
    // Offset: 0x1C
    uint m_nNumLoading;
    // public System.UInt32 m_nNumFramePresentsLoading
    // Offset: 0x20
    uint m_nNumFramePresentsLoading;
    // public System.UInt32 m_nNumDroppedFramesLoading
    // Offset: 0x24
    uint m_nNumDroppedFramesLoading;
    // public System.UInt32 m_nNumReprojectedFramesLoading
    // Offset: 0x28
    uint m_nNumReprojectedFramesLoading;
    // public System.UInt32 m_nNumTimedOut
    // Offset: 0x2C
    uint m_nNumTimedOut;
    // public System.UInt32 m_nNumFramePresentsTimedOut
    // Offset: 0x30
    uint m_nNumFramePresentsTimedOut;
    // public System.UInt32 m_nNumDroppedFramesTimedOut
    // Offset: 0x34
    uint m_nNumDroppedFramesTimedOut;
    // public System.UInt32 m_nNumReprojectedFramesTimedOut
    // Offset: 0x38
    uint m_nNumReprojectedFramesTimedOut;
    // Creating value type constructor for type: Compositor_CumulativeStats
    constexpr Compositor_CumulativeStats(uint m_nPid_ = {}, uint m_nNumFramePresents_ = {}, uint m_nNumDroppedFrames_ = {}, uint m_nNumReprojectedFrames_ = {}, uint m_nNumFramePresentsOnStartup_ = {}, uint m_nNumDroppedFramesOnStartup_ = {}, uint m_nNumReprojectedFramesOnStartup_ = {}, uint m_nNumLoading_ = {}, uint m_nNumFramePresentsLoading_ = {}, uint m_nNumDroppedFramesLoading_ = {}, uint m_nNumReprojectedFramesLoading_ = {}, uint m_nNumTimedOut_ = {}, uint m_nNumFramePresentsTimedOut_ = {}, uint m_nNumDroppedFramesTimedOut_ = {}, uint m_nNumReprojectedFramesTimedOut_ = {}) noexcept : m_nPid{m_nPid_}, m_nNumFramePresents{m_nNumFramePresents_}, m_nNumDroppedFrames{m_nNumDroppedFrames_}, m_nNumReprojectedFrames{m_nNumReprojectedFrames_}, m_nNumFramePresentsOnStartup{m_nNumFramePresentsOnStartup_}, m_nNumDroppedFramesOnStartup{m_nNumDroppedFramesOnStartup_}, m_nNumReprojectedFramesOnStartup{m_nNumReprojectedFramesOnStartup_}, m_nNumLoading{m_nNumLoading_}, m_nNumFramePresentsLoading{m_nNumFramePresentsLoading_}, m_nNumDroppedFramesLoading{m_nNumDroppedFramesLoading_}, m_nNumReprojectedFramesLoading{m_nNumReprojectedFramesLoading_}, m_nNumTimedOut{m_nNumTimedOut_}, m_nNumFramePresentsTimedOut{m_nNumFramePresentsTimedOut_}, m_nNumDroppedFramesTimedOut{m_nNumDroppedFramesTimedOut_}, m_nNumReprojectedFramesTimedOut{m_nNumReprojectedFramesTimedOut_} {}
  }; // Valve.VR.Compositor_CumulativeStats
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::Compositor_CumulativeStats, "Valve.VR", "Compositor_CumulativeStats");
#pragma pack(pop)
