// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Valve.VR.HmdMatrix44_t
#include "Valve/VR/HmdMatrix44_t.hpp"
// Completed includes
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0x70
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.Compositor_OverlaySettings
  // [TokenAttribute] Offset: FFFFFFFF
  struct Compositor_OverlaySettings/*, public System::ValueType*/ {
    public:
    // public System.UInt32 size
    // Size: 0x4
    // Offset: 0x0
    uint size;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.Boolean curved
    // Size: 0x1
    // Offset: 0x4
    bool curved;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean antialias
    // Size: 0x1
    // Offset: 0x5
    bool antialias;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: antialias and: scale
    char __padding2[0x2] = {};
    // public System.Single scale
    // Size: 0x4
    // Offset: 0x8
    float scale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single distance
    // Size: 0x4
    // Offset: 0xC
    float distance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single alpha
    // Size: 0x4
    // Offset: 0x10
    float alpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single uOffset
    // Size: 0x4
    // Offset: 0x14
    float uOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single vOffset
    // Size: 0x4
    // Offset: 0x18
    float vOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single uScale
    // Size: 0x4
    // Offset: 0x1C
    float uScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single vScale
    // Size: 0x4
    // Offset: 0x20
    float vScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single gridDivs
    // Size: 0x4
    // Offset: 0x24
    float gridDivs;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single gridWidth
    // Size: 0x4
    // Offset: 0x28
    float gridWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single gridScale
    // Size: 0x4
    // Offset: 0x2C
    float gridScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Valve.VR.HmdMatrix44_t transform
    // Size: 0x40
    // Offset: 0x30
    Valve::VR::HmdMatrix44_t transform;
    // Field size check
    static_assert(sizeof(Valve::VR::HmdMatrix44_t) == 0x40);
    // Creating value type constructor for type: Compositor_OverlaySettings
    constexpr Compositor_OverlaySettings(uint size_ = {}, bool curved_ = {}, bool antialias_ = {}, float scale_ = {}, float distance_ = {}, float alpha_ = {}, float uOffset_ = {}, float vOffset_ = {}, float uScale_ = {}, float vScale_ = {}, float gridDivs_ = {}, float gridWidth_ = {}, float gridScale_ = {}, Valve::VR::HmdMatrix44_t transform_ = {}) noexcept : size{size_}, curved{curved_}, antialias{antialias_}, scale{scale_}, distance{distance_}, alpha{alpha_}, uOffset{uOffset_}, vOffset{vOffset_}, uScale{uScale_}, vScale{vScale_}, gridDivs{gridDivs_}, gridWidth{gridWidth_}, gridScale{gridScale_}, transform{transform_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public System.UInt32 size
    uint _get_size();
    // Set instance field: public System.UInt32 size
    void _set_size(uint value);
    // Get instance field: public System.Boolean curved
    bool _get_curved();
    // Set instance field: public System.Boolean curved
    void _set_curved(bool value);
    // Get instance field: public System.Boolean antialias
    bool _get_antialias();
    // Set instance field: public System.Boolean antialias
    void _set_antialias(bool value);
    // Get instance field: public System.Single scale
    float _get_scale();
    // Set instance field: public System.Single scale
    void _set_scale(float value);
    // Get instance field: public System.Single distance
    float _get_distance();
    // Set instance field: public System.Single distance
    void _set_distance(float value);
    // Get instance field: public System.Single alpha
    float _get_alpha();
    // Set instance field: public System.Single alpha
    void _set_alpha(float value);
    // Get instance field: public System.Single uOffset
    float _get_uOffset();
    // Set instance field: public System.Single uOffset
    void _set_uOffset(float value);
    // Get instance field: public System.Single vOffset
    float _get_vOffset();
    // Set instance field: public System.Single vOffset
    void _set_vOffset(float value);
    // Get instance field: public System.Single uScale
    float _get_uScale();
    // Set instance field: public System.Single uScale
    void _set_uScale(float value);
    // Get instance field: public System.Single vScale
    float _get_vScale();
    // Set instance field: public System.Single vScale
    void _set_vScale(float value);
    // Get instance field: public System.Single gridDivs
    float _get_gridDivs();
    // Set instance field: public System.Single gridDivs
    void _set_gridDivs(float value);
    // Get instance field: public System.Single gridWidth
    float _get_gridWidth();
    // Set instance field: public System.Single gridWidth
    void _set_gridWidth(float value);
    // Get instance field: public System.Single gridScale
    float _get_gridScale();
    // Set instance field: public System.Single gridScale
    void _set_gridScale(float value);
    // Get instance field: public Valve.VR.HmdMatrix44_t transform
    Valve::VR::HmdMatrix44_t _get_transform();
    // Set instance field: public Valve.VR.HmdMatrix44_t transform
    void _set_transform(Valve::VR::HmdMatrix44_t value);
  }; // Valve.VR.Compositor_OverlaySettings
  #pragma pack(pop)
  static check_size<sizeof(Compositor_OverlaySettings), 48 + sizeof(Valve::VR::HmdMatrix44_t)> __Valve_VR_Compositor_OverlaySettingsSizeCheck;
  static_assert(sizeof(Compositor_OverlaySettings) == 0x70);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::Compositor_OverlaySettings, "Valve.VR", "Compositor_OverlaySettings");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
