// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0x10
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.HmdColor_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct HmdColor_t/*, public System::ValueType*/ {
    public:
    // public System.Single r
    // Size: 0x4
    // Offset: 0x0
    float r;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single g
    // Size: 0x4
    // Offset: 0x4
    float g;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single b
    // Size: 0x4
    // Offset: 0x8
    float b;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single a
    // Size: 0x4
    // Offset: 0xC
    float a;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: HmdColor_t
    constexpr HmdColor_t(float r_ = {}, float g_ = {}, float b_ = {}, float a_ = {}) noexcept : r{r_}, g{g_}, b{b_}, a{a_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public System.Single r
    float _get_r();
    // Set instance field: public System.Single r
    void _set_r(float value);
    // Get instance field: public System.Single g
    float _get_g();
    // Set instance field: public System.Single g
    void _set_g(float value);
    // Get instance field: public System.Single b
    float _get_b();
    // Set instance field: public System.Single b
    void _set_b(float value);
    // Get instance field: public System.Single a
    float _get_a();
    // Set instance field: public System.Single a
    void _set_a(float value);
  }; // Valve.VR.HmdColor_t
  #pragma pack(pop)
  static check_size<sizeof(HmdColor_t), 12 + sizeof(float)> __Valve_VR_HmdColor_tSizeCheck;
  static_assert(sizeof(HmdColor_t) == 0x10);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::HmdColor_t, "Valve.VR", "HmdColor_t");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
