// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0x30
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.HmdMatrix34_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct HmdMatrix34_t/*, public System::ValueType*/ {
    public:
    // public System.Single m0
    // Size: 0x4
    // Offset: 0x0
    float m0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m1
    // Size: 0x4
    // Offset: 0x4
    float m1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m2
    // Size: 0x4
    // Offset: 0x8
    float m2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m3
    // Size: 0x4
    // Offset: 0xC
    float m3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m4
    // Size: 0x4
    // Offset: 0x10
    float m4;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m5
    // Size: 0x4
    // Offset: 0x14
    float m5;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m6
    // Size: 0x4
    // Offset: 0x18
    float m6;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m7
    // Size: 0x4
    // Offset: 0x1C
    float m7;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m8
    // Size: 0x4
    // Offset: 0x20
    float m8;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m9
    // Size: 0x4
    // Offset: 0x24
    float m9;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m10
    // Size: 0x4
    // Offset: 0x28
    float m10;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m11
    // Size: 0x4
    // Offset: 0x2C
    float m11;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: HmdMatrix34_t
    constexpr HmdMatrix34_t(float m0_ = {}, float m1_ = {}, float m2_ = {}, float m3_ = {}, float m4_ = {}, float m5_ = {}, float m6_ = {}, float m7_ = {}, float m8_ = {}, float m9_ = {}, float m10_ = {}, float m11_ = {}) noexcept : m0{m0_}, m1{m1_}, m2{m2_}, m3{m3_}, m4{m4_}, m5{m5_}, m6{m6_}, m7{m7_}, m8{m8_}, m9{m9_}, m10{m10_}, m11{m11_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public System.Single m0
    float _get_m0();
    // Set instance field: public System.Single m0
    void _set_m0(float value);
    // Get instance field: public System.Single m1
    float _get_m1();
    // Set instance field: public System.Single m1
    void _set_m1(float value);
    // Get instance field: public System.Single m2
    float _get_m2();
    // Set instance field: public System.Single m2
    void _set_m2(float value);
    // Get instance field: public System.Single m3
    float _get_m3();
    // Set instance field: public System.Single m3
    void _set_m3(float value);
    // Get instance field: public System.Single m4
    float _get_m4();
    // Set instance field: public System.Single m4
    void _set_m4(float value);
    // Get instance field: public System.Single m5
    float _get_m5();
    // Set instance field: public System.Single m5
    void _set_m5(float value);
    // Get instance field: public System.Single m6
    float _get_m6();
    // Set instance field: public System.Single m6
    void _set_m6(float value);
    // Get instance field: public System.Single m7
    float _get_m7();
    // Set instance field: public System.Single m7
    void _set_m7(float value);
    // Get instance field: public System.Single m8
    float _get_m8();
    // Set instance field: public System.Single m8
    void _set_m8(float value);
    // Get instance field: public System.Single m9
    float _get_m9();
    // Set instance field: public System.Single m9
    void _set_m9(float value);
    // Get instance field: public System.Single m10
    float _get_m10();
    // Set instance field: public System.Single m10
    void _set_m10(float value);
    // Get instance field: public System.Single m11
    float _get_m11();
    // Set instance field: public System.Single m11
    void _set_m11(float value);
  }; // Valve.VR.HmdMatrix34_t
  #pragma pack(pop)
  static check_size<sizeof(HmdMatrix34_t), 44 + sizeof(float)> __Valve_VR_HmdMatrix34_tSizeCheck;
  static_assert(sizeof(HmdMatrix34_t) == 0x30);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::HmdMatrix34_t, "Valve.VR", "HmdMatrix34_t");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
