// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Forward declaring type: IVRChaperoneSetup
  struct IVRChaperoneSetup;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRChaperoneSetup, "Valve.VR", "IVRChaperoneSetup");
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0xA0
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.IVRChaperoneSetup
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRChaperoneSetup/*, public System::ValueType*/ {
    public:
    // Nested type: Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy
    class _CommitWorkingCopy;
    // Nested type: Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy
    class _RevertWorkingCopy;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize
    class _GetWorkingPlayAreaSize;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect
    class _GetWorkingPlayAreaRect;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo
    class _GetWorkingCollisionBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo
    class _GetLiveCollisionBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose
    class _GetWorkingSeatedZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose
    class _GetWorkingStandingZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize
    class _SetWorkingPlayAreaSize;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo
    class _SetWorkingCollisionBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose
    class _SetWorkingSeatedZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose
    class _SetWorkingStandingZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_ReloadFromDisk
    class _ReloadFromDisk;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose
    class _GetLiveSeatedZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo
    class _SetWorkingCollisionBoundsTagsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo
    class _GetLiveCollisionBoundsTagsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo
    class _SetWorkingPhysicalBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo
    class _GetLivePhysicalBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer
    class _ExportLiveToBuffer;
    // Nested type: Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking
    class _ImportFromBufferToWorking;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // Valve.VR.IVRChaperoneSetup/Valve.VR._CommitWorkingCopy CommitWorkingCopy
    // Size: 0x8
    // Offset: 0x0
    Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy* CommitWorkingCopy;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._RevertWorkingCopy RevertWorkingCopy
    // Size: 0x8
    // Offset: 0x8
    Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy* RevertWorkingCopy;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaSize GetWorkingPlayAreaSize
    // Size: 0x8
    // Offset: 0x10
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* GetWorkingPlayAreaSize;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaRect GetWorkingPlayAreaRect
    // Size: 0x8
    // Offset: 0x18
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* GetWorkingPlayAreaRect;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingCollisionBoundsInfo GetWorkingCollisionBoundsInfo
    // Size: 0x8
    // Offset: 0x20
    Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* GetWorkingCollisionBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsInfo GetLiveCollisionBoundsInfo
    // Size: 0x8
    // Offset: 0x28
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* GetLiveCollisionBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingSeatedZeroPoseToRawTrackingPose GetWorkingSeatedZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x30
    Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* GetWorkingSeatedZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingStandingZeroPoseToRawTrackingPose GetWorkingStandingZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x38
    Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* GetWorkingStandingZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPlayAreaSize SetWorkingPlayAreaSize
    // Size: 0x8
    // Offset: 0x40
    Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* SetWorkingPlayAreaSize;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsInfo SetWorkingCollisionBoundsInfo
    // Size: 0x8
    // Offset: 0x48
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* SetWorkingCollisionBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingSeatedZeroPoseToRawTrackingPose SetWorkingSeatedZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x50
    Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* SetWorkingSeatedZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingStandingZeroPoseToRawTrackingPose SetWorkingStandingZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x58
    Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* SetWorkingStandingZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._ReloadFromDisk ReloadFromDisk
    // Size: 0x8
    // Offset: 0x60
    Valve::VR::IVRChaperoneSetup::_ReloadFromDisk* ReloadFromDisk;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_ReloadFromDisk*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveSeatedZeroPoseToRawTrackingPose GetLiveSeatedZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x68
    Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* GetLiveSeatedZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsTagsInfo SetWorkingCollisionBoundsTagsInfo
    // Size: 0x8
    // Offset: 0x70
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* SetWorkingCollisionBoundsTagsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsTagsInfo GetLiveCollisionBoundsTagsInfo
    // Size: 0x8
    // Offset: 0x78
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* GetLiveCollisionBoundsTagsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPhysicalBoundsInfo SetWorkingPhysicalBoundsInfo
    // Size: 0x8
    // Offset: 0x80
    Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* SetWorkingPhysicalBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetLivePhysicalBoundsInfo GetLivePhysicalBoundsInfo
    // Size: 0x8
    // Offset: 0x88
    Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* GetLivePhysicalBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._ExportLiveToBuffer ExportLiveToBuffer
    // Size: 0x8
    // Offset: 0x90
    Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer* ExportLiveToBuffer;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._ImportFromBufferToWorking ImportFromBufferToWorking
    // Size: 0x8
    // Offset: 0x98
    Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking* ImportFromBufferToWorking;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking*) == 0x8);
    public:
    // Creating value type constructor for type: IVRChaperoneSetup
    constexpr IVRChaperoneSetup(Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy* CommitWorkingCopy_ = {}, Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy* RevertWorkingCopy_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* GetWorkingPlayAreaSize_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* GetWorkingPlayAreaRect_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* GetWorkingCollisionBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* GetLiveCollisionBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* GetWorkingSeatedZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* GetWorkingStandingZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* SetWorkingPlayAreaSize_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* SetWorkingCollisionBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* SetWorkingSeatedZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* SetWorkingStandingZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_ReloadFromDisk* ReloadFromDisk_ = {}, Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* GetLiveSeatedZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* SetWorkingCollisionBoundsTagsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* GetLiveCollisionBoundsTagsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* SetWorkingPhysicalBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* GetLivePhysicalBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer* ExportLiveToBuffer_ = {}, Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking* ImportFromBufferToWorking_ = {}) noexcept : CommitWorkingCopy{CommitWorkingCopy_}, RevertWorkingCopy{RevertWorkingCopy_}, GetWorkingPlayAreaSize{GetWorkingPlayAreaSize_}, GetWorkingPlayAreaRect{GetWorkingPlayAreaRect_}, GetWorkingCollisionBoundsInfo{GetWorkingCollisionBoundsInfo_}, GetLiveCollisionBoundsInfo{GetLiveCollisionBoundsInfo_}, GetWorkingSeatedZeroPoseToRawTrackingPose{GetWorkingSeatedZeroPoseToRawTrackingPose_}, GetWorkingStandingZeroPoseToRawTrackingPose{GetWorkingStandingZeroPoseToRawTrackingPose_}, SetWorkingPlayAreaSize{SetWorkingPlayAreaSize_}, SetWorkingCollisionBoundsInfo{SetWorkingCollisionBoundsInfo_}, SetWorkingSeatedZeroPoseToRawTrackingPose{SetWorkingSeatedZeroPoseToRawTrackingPose_}, SetWorkingStandingZeroPoseToRawTrackingPose{SetWorkingStandingZeroPoseToRawTrackingPose_}, ReloadFromDisk{ReloadFromDisk_}, GetLiveSeatedZeroPoseToRawTrackingPose{GetLiveSeatedZeroPoseToRawTrackingPose_}, SetWorkingCollisionBoundsTagsInfo{SetWorkingCollisionBoundsTagsInfo_}, GetLiveCollisionBoundsTagsInfo{GetLiveCollisionBoundsTagsInfo_}, SetWorkingPhysicalBoundsInfo{SetWorkingPhysicalBoundsInfo_}, GetLivePhysicalBoundsInfo{GetLivePhysicalBoundsInfo_}, ExportLiveToBuffer{ExportLiveToBuffer_}, ImportFromBufferToWorking{ImportFromBufferToWorking_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._CommitWorkingCopy CommitWorkingCopy
    Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy*& dyn_CommitWorkingCopy();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._RevertWorkingCopy RevertWorkingCopy
    Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy*& dyn_RevertWorkingCopy();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaSize GetWorkingPlayAreaSize
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize*& dyn_GetWorkingPlayAreaSize();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaRect GetWorkingPlayAreaRect
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect*& dyn_GetWorkingPlayAreaRect();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingCollisionBoundsInfo GetWorkingCollisionBoundsInfo
    Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo*& dyn_GetWorkingCollisionBoundsInfo();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsInfo GetLiveCollisionBoundsInfo
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo*& dyn_GetLiveCollisionBoundsInfo();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingSeatedZeroPoseToRawTrackingPose GetWorkingSeatedZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose*& dyn_GetWorkingSeatedZeroPoseToRawTrackingPose();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingStandingZeroPoseToRawTrackingPose GetWorkingStandingZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose*& dyn_GetWorkingStandingZeroPoseToRawTrackingPose();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPlayAreaSize SetWorkingPlayAreaSize
    Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize*& dyn_SetWorkingPlayAreaSize();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsInfo SetWorkingCollisionBoundsInfo
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo*& dyn_SetWorkingCollisionBoundsInfo();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingSeatedZeroPoseToRawTrackingPose SetWorkingSeatedZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose*& dyn_SetWorkingSeatedZeroPoseToRawTrackingPose();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingStandingZeroPoseToRawTrackingPose SetWorkingStandingZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose*& dyn_SetWorkingStandingZeroPoseToRawTrackingPose();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._ReloadFromDisk ReloadFromDisk
    Valve::VR::IVRChaperoneSetup::_ReloadFromDisk*& dyn_ReloadFromDisk();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveSeatedZeroPoseToRawTrackingPose GetLiveSeatedZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose*& dyn_GetLiveSeatedZeroPoseToRawTrackingPose();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsTagsInfo SetWorkingCollisionBoundsTagsInfo
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo*& dyn_SetWorkingCollisionBoundsTagsInfo();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsTagsInfo GetLiveCollisionBoundsTagsInfo
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo*& dyn_GetLiveCollisionBoundsTagsInfo();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPhysicalBoundsInfo SetWorkingPhysicalBoundsInfo
    Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo*& dyn_SetWorkingPhysicalBoundsInfo();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLivePhysicalBoundsInfo GetLivePhysicalBoundsInfo
    Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo*& dyn_GetLivePhysicalBoundsInfo();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._ExportLiveToBuffer ExportLiveToBuffer
    Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer*& dyn_ExportLiveToBuffer();
    // Get instance field reference: Valve.VR.IVRChaperoneSetup/Valve.VR._ImportFromBufferToWorking ImportFromBufferToWorking
    Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking*& dyn_ImportFromBufferToWorking();
  }; // Valve.VR.IVRChaperoneSetup
  #pragma pack(pop)
  static check_size<sizeof(IVRChaperoneSetup), 152 + sizeof(Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking*)> __Valve_VR_IVRChaperoneSetupSizeCheck;
  static_assert(sizeof(IVRChaperoneSetup) == 0xA0);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
