// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Autogenerated type: Valve.VR.IVRCompositor
  struct IVRCompositor : public System::ValueType {
    public:
    // Nested type: Valve::VR::IVRCompositor::_SetTrackingSpace
    class _SetTrackingSpace;
    // Nested type: Valve::VR::IVRCompositor::_GetTrackingSpace
    class _GetTrackingSpace;
    // Nested type: Valve::VR::IVRCompositor::_WaitGetPoses
    class _WaitGetPoses;
    // Nested type: Valve::VR::IVRCompositor::_GetLastPoses
    class _GetLastPoses;
    // Nested type: Valve::VR::IVRCompositor::_GetLastPoseForTrackedDeviceIndex
    class _GetLastPoseForTrackedDeviceIndex;
    // Nested type: Valve::VR::IVRCompositor::_Submit
    class _Submit;
    // Nested type: Valve::VR::IVRCompositor::_ClearLastSubmittedFrame
    class _ClearLastSubmittedFrame;
    // Nested type: Valve::VR::IVRCompositor::_PostPresentHandoff
    class _PostPresentHandoff;
    // Nested type: Valve::VR::IVRCompositor::_GetFrameTiming
    class _GetFrameTiming;
    // Nested type: Valve::VR::IVRCompositor::_GetFrameTimings
    class _GetFrameTimings;
    // Nested type: Valve::VR::IVRCompositor::_GetFrameTimeRemaining
    class _GetFrameTimeRemaining;
    // Nested type: Valve::VR::IVRCompositor::_GetCumulativeStats
    class _GetCumulativeStats;
    // Nested type: Valve::VR::IVRCompositor::_FadeToColor
    class _FadeToColor;
    // Nested type: Valve::VR::IVRCompositor::_GetCurrentFadeColor
    class _GetCurrentFadeColor;
    // Nested type: Valve::VR::IVRCompositor::_FadeGrid
    class _FadeGrid;
    // Nested type: Valve::VR::IVRCompositor::_GetCurrentGridAlpha
    class _GetCurrentGridAlpha;
    // Nested type: Valve::VR::IVRCompositor::_SetSkyboxOverride
    class _SetSkyboxOverride;
    // Nested type: Valve::VR::IVRCompositor::_ClearSkyboxOverride
    class _ClearSkyboxOverride;
    // Nested type: Valve::VR::IVRCompositor::_CompositorBringToFront
    class _CompositorBringToFront;
    // Nested type: Valve::VR::IVRCompositor::_CompositorGoToBack
    class _CompositorGoToBack;
    // Nested type: Valve::VR::IVRCompositor::_CompositorQuit
    class _CompositorQuit;
    // Nested type: Valve::VR::IVRCompositor::_IsFullscreen
    class _IsFullscreen;
    // Nested type: Valve::VR::IVRCompositor::_GetCurrentSceneFocusProcess
    class _GetCurrentSceneFocusProcess;
    // Nested type: Valve::VR::IVRCompositor::_GetLastFrameRenderer
    class _GetLastFrameRenderer;
    // Nested type: Valve::VR::IVRCompositor::_CanRenderScene
    class _CanRenderScene;
    // Nested type: Valve::VR::IVRCompositor::_ShowMirrorWindow
    class _ShowMirrorWindow;
    // Nested type: Valve::VR::IVRCompositor::_HideMirrorWindow
    class _HideMirrorWindow;
    // Nested type: Valve::VR::IVRCompositor::_IsMirrorWindowVisible
    class _IsMirrorWindowVisible;
    // Nested type: Valve::VR::IVRCompositor::_CompositorDumpImages
    class _CompositorDumpImages;
    // Nested type: Valve::VR::IVRCompositor::_ShouldAppRenderWithLowResources
    class _ShouldAppRenderWithLowResources;
    // Nested type: Valve::VR::IVRCompositor::_ForceInterleavedReprojectionOn
    class _ForceInterleavedReprojectionOn;
    // Nested type: Valve::VR::IVRCompositor::_ForceReconnectProcess
    class _ForceReconnectProcess;
    // Nested type: Valve::VR::IVRCompositor::_SuspendRendering
    class _SuspendRendering;
    // Nested type: Valve::VR::IVRCompositor::_GetMirrorTextureD3D11
    class _GetMirrorTextureD3D11;
    // Nested type: Valve::VR::IVRCompositor::_ReleaseMirrorTextureD3D11
    class _ReleaseMirrorTextureD3D11;
    // Nested type: Valve::VR::IVRCompositor::_GetMirrorTextureGL
    class _GetMirrorTextureGL;
    // Nested type: Valve::VR::IVRCompositor::_ReleaseSharedGLTexture
    class _ReleaseSharedGLTexture;
    // Nested type: Valve::VR::IVRCompositor::_LockGLSharedTextureForAccess
    class _LockGLSharedTextureForAccess;
    // Nested type: Valve::VR::IVRCompositor::_UnlockGLSharedTextureForAccess
    class _UnlockGLSharedTextureForAccess;
    // Nested type: Valve::VR::IVRCompositor::_GetVulkanInstanceExtensionsRequired
    class _GetVulkanInstanceExtensionsRequired;
    // Nested type: Valve::VR::IVRCompositor::_GetVulkanDeviceExtensionsRequired
    class _GetVulkanDeviceExtensionsRequired;
    // Nested type: Valve::VR::IVRCompositor::_SetExplicitTimingMode
    class _SetExplicitTimingMode;
    // Nested type: Valve::VR::IVRCompositor::_SubmitExplicitTimingData
    class _SubmitExplicitTimingData;
    // Valve.VR.IVRCompositor/_SetTrackingSpace SetTrackingSpace
    // Offset: 0x0
    Valve::VR::IVRCompositor::_SetTrackingSpace* SetTrackingSpace;
    // Valve.VR.IVRCompositor/_GetTrackingSpace GetTrackingSpace
    // Offset: 0x8
    Valve::VR::IVRCompositor::_GetTrackingSpace* GetTrackingSpace;
    // Valve.VR.IVRCompositor/_WaitGetPoses WaitGetPoses
    // Offset: 0x10
    Valve::VR::IVRCompositor::_WaitGetPoses* WaitGetPoses;
    // Valve.VR.IVRCompositor/_GetLastPoses GetLastPoses
    // Offset: 0x18
    Valve::VR::IVRCompositor::_GetLastPoses* GetLastPoses;
    // Valve.VR.IVRCompositor/_GetLastPoseForTrackedDeviceIndex GetLastPoseForTrackedDeviceIndex
    // Offset: 0x20
    Valve::VR::IVRCompositor::_GetLastPoseForTrackedDeviceIndex* GetLastPoseForTrackedDeviceIndex;
    // Valve.VR.IVRCompositor/_Submit Submit
    // Offset: 0x28
    Valve::VR::IVRCompositor::_Submit* Submit;
    // Valve.VR.IVRCompositor/_ClearLastSubmittedFrame ClearLastSubmittedFrame
    // Offset: 0x30
    Valve::VR::IVRCompositor::_ClearLastSubmittedFrame* ClearLastSubmittedFrame;
    // Valve.VR.IVRCompositor/_PostPresentHandoff PostPresentHandoff
    // Offset: 0x38
    Valve::VR::IVRCompositor::_PostPresentHandoff* PostPresentHandoff;
    // Valve.VR.IVRCompositor/_GetFrameTiming GetFrameTiming
    // Offset: 0x40
    Valve::VR::IVRCompositor::_GetFrameTiming* GetFrameTiming;
    // Valve.VR.IVRCompositor/_GetFrameTimings GetFrameTimings
    // Offset: 0x48
    Valve::VR::IVRCompositor::_GetFrameTimings* GetFrameTimings;
    // Valve.VR.IVRCompositor/_GetFrameTimeRemaining GetFrameTimeRemaining
    // Offset: 0x50
    Valve::VR::IVRCompositor::_GetFrameTimeRemaining* GetFrameTimeRemaining;
    // Valve.VR.IVRCompositor/_GetCumulativeStats GetCumulativeStats
    // Offset: 0x58
    Valve::VR::IVRCompositor::_GetCumulativeStats* GetCumulativeStats;
    // Valve.VR.IVRCompositor/_FadeToColor FadeToColor
    // Offset: 0x60
    Valve::VR::IVRCompositor::_FadeToColor* FadeToColor;
    // Valve.VR.IVRCompositor/_GetCurrentFadeColor GetCurrentFadeColor
    // Offset: 0x68
    Valve::VR::IVRCompositor::_GetCurrentFadeColor* GetCurrentFadeColor;
    // Valve.VR.IVRCompositor/_FadeGrid FadeGrid
    // Offset: 0x70
    Valve::VR::IVRCompositor::_FadeGrid* FadeGrid;
    // Valve.VR.IVRCompositor/_GetCurrentGridAlpha GetCurrentGridAlpha
    // Offset: 0x78
    Valve::VR::IVRCompositor::_GetCurrentGridAlpha* GetCurrentGridAlpha;
    // Valve.VR.IVRCompositor/_SetSkyboxOverride SetSkyboxOverride
    // Offset: 0x80
    Valve::VR::IVRCompositor::_SetSkyboxOverride* SetSkyboxOverride;
    // Valve.VR.IVRCompositor/_ClearSkyboxOverride ClearSkyboxOverride
    // Offset: 0x88
    Valve::VR::IVRCompositor::_ClearSkyboxOverride* ClearSkyboxOverride;
    // Valve.VR.IVRCompositor/_CompositorBringToFront CompositorBringToFront
    // Offset: 0x90
    Valve::VR::IVRCompositor::_CompositorBringToFront* CompositorBringToFront;
    // Valve.VR.IVRCompositor/_CompositorGoToBack CompositorGoToBack
    // Offset: 0x98
    Valve::VR::IVRCompositor::_CompositorGoToBack* CompositorGoToBack;
    // Valve.VR.IVRCompositor/_CompositorQuit CompositorQuit
    // Offset: 0xA0
    Valve::VR::IVRCompositor::_CompositorQuit* CompositorQuit;
    // Valve.VR.IVRCompositor/_IsFullscreen IsFullscreen
    // Offset: 0xA8
    Valve::VR::IVRCompositor::_IsFullscreen* IsFullscreen;
    // Valve.VR.IVRCompositor/_GetCurrentSceneFocusProcess GetCurrentSceneFocusProcess
    // Offset: 0xB0
    Valve::VR::IVRCompositor::_GetCurrentSceneFocusProcess* GetCurrentSceneFocusProcess;
    // Valve.VR.IVRCompositor/_GetLastFrameRenderer GetLastFrameRenderer
    // Offset: 0xB8
    Valve::VR::IVRCompositor::_GetLastFrameRenderer* GetLastFrameRenderer;
    // Valve.VR.IVRCompositor/_CanRenderScene CanRenderScene
    // Offset: 0xC0
    Valve::VR::IVRCompositor::_CanRenderScene* CanRenderScene;
    // Valve.VR.IVRCompositor/_ShowMirrorWindow ShowMirrorWindow
    // Offset: 0xC8
    Valve::VR::IVRCompositor::_ShowMirrorWindow* ShowMirrorWindow;
    // Valve.VR.IVRCompositor/_HideMirrorWindow HideMirrorWindow
    // Offset: 0xD0
    Valve::VR::IVRCompositor::_HideMirrorWindow* HideMirrorWindow;
    // Valve.VR.IVRCompositor/_IsMirrorWindowVisible IsMirrorWindowVisible
    // Offset: 0xD8
    Valve::VR::IVRCompositor::_IsMirrorWindowVisible* IsMirrorWindowVisible;
    // Valve.VR.IVRCompositor/_CompositorDumpImages CompositorDumpImages
    // Offset: 0xE0
    Valve::VR::IVRCompositor::_CompositorDumpImages* CompositorDumpImages;
    // Valve.VR.IVRCompositor/_ShouldAppRenderWithLowResources ShouldAppRenderWithLowResources
    // Offset: 0xE8
    Valve::VR::IVRCompositor::_ShouldAppRenderWithLowResources* ShouldAppRenderWithLowResources;
    // Valve.VR.IVRCompositor/_ForceInterleavedReprojectionOn ForceInterleavedReprojectionOn
    // Offset: 0xF0
    Valve::VR::IVRCompositor::_ForceInterleavedReprojectionOn* ForceInterleavedReprojectionOn;
    // Valve.VR.IVRCompositor/_ForceReconnectProcess ForceReconnectProcess
    // Offset: 0xF8
    Valve::VR::IVRCompositor::_ForceReconnectProcess* ForceReconnectProcess;
    // Valve.VR.IVRCompositor/_SuspendRendering SuspendRendering
    // Offset: 0x100
    Valve::VR::IVRCompositor::_SuspendRendering* SuspendRendering;
    // Valve.VR.IVRCompositor/_GetMirrorTextureD3D11 GetMirrorTextureD3D11
    // Offset: 0x108
    Valve::VR::IVRCompositor::_GetMirrorTextureD3D11* GetMirrorTextureD3D11;
    // Valve.VR.IVRCompositor/_ReleaseMirrorTextureD3D11 ReleaseMirrorTextureD3D11
    // Offset: 0x110
    Valve::VR::IVRCompositor::_ReleaseMirrorTextureD3D11* ReleaseMirrorTextureD3D11;
    // Valve.VR.IVRCompositor/_GetMirrorTextureGL GetMirrorTextureGL
    // Offset: 0x118
    Valve::VR::IVRCompositor::_GetMirrorTextureGL* GetMirrorTextureGL;
    // Valve.VR.IVRCompositor/_ReleaseSharedGLTexture ReleaseSharedGLTexture
    // Offset: 0x120
    Valve::VR::IVRCompositor::_ReleaseSharedGLTexture* ReleaseSharedGLTexture;
    // Valve.VR.IVRCompositor/_LockGLSharedTextureForAccess LockGLSharedTextureForAccess
    // Offset: 0x128
    Valve::VR::IVRCompositor::_LockGLSharedTextureForAccess* LockGLSharedTextureForAccess;
    // Valve.VR.IVRCompositor/_UnlockGLSharedTextureForAccess UnlockGLSharedTextureForAccess
    // Offset: 0x130
    Valve::VR::IVRCompositor::_UnlockGLSharedTextureForAccess* UnlockGLSharedTextureForAccess;
    // Valve.VR.IVRCompositor/_GetVulkanInstanceExtensionsRequired GetVulkanInstanceExtensionsRequired
    // Offset: 0x138
    Valve::VR::IVRCompositor::_GetVulkanInstanceExtensionsRequired* GetVulkanInstanceExtensionsRequired;
    // Valve.VR.IVRCompositor/_GetVulkanDeviceExtensionsRequired GetVulkanDeviceExtensionsRequired
    // Offset: 0x140
    Valve::VR::IVRCompositor::_GetVulkanDeviceExtensionsRequired* GetVulkanDeviceExtensionsRequired;
    // Valve.VR.IVRCompositor/_SetExplicitTimingMode SetExplicitTimingMode
    // Offset: 0x148
    Valve::VR::IVRCompositor::_SetExplicitTimingMode* SetExplicitTimingMode;
    // Valve.VR.IVRCompositor/_SubmitExplicitTimingData SubmitExplicitTimingData
    // Offset: 0x150
    Valve::VR::IVRCompositor::_SubmitExplicitTimingData* SubmitExplicitTimingData;
    // Creating value type constructor for type: IVRCompositor
    constexpr IVRCompositor(Valve::VR::IVRCompositor::_SetTrackingSpace* SetTrackingSpace_ = {}, Valve::VR::IVRCompositor::_GetTrackingSpace* GetTrackingSpace_ = {}, Valve::VR::IVRCompositor::_WaitGetPoses* WaitGetPoses_ = {}, Valve::VR::IVRCompositor::_GetLastPoses* GetLastPoses_ = {}, Valve::VR::IVRCompositor::_GetLastPoseForTrackedDeviceIndex* GetLastPoseForTrackedDeviceIndex_ = {}, Valve::VR::IVRCompositor::_Submit* Submit_ = {}, Valve::VR::IVRCompositor::_ClearLastSubmittedFrame* ClearLastSubmittedFrame_ = {}, Valve::VR::IVRCompositor::_PostPresentHandoff* PostPresentHandoff_ = {}, Valve::VR::IVRCompositor::_GetFrameTiming* GetFrameTiming_ = {}, Valve::VR::IVRCompositor::_GetFrameTimings* GetFrameTimings_ = {}, Valve::VR::IVRCompositor::_GetFrameTimeRemaining* GetFrameTimeRemaining_ = {}, Valve::VR::IVRCompositor::_GetCumulativeStats* GetCumulativeStats_ = {}, Valve::VR::IVRCompositor::_FadeToColor* FadeToColor_ = {}, Valve::VR::IVRCompositor::_GetCurrentFadeColor* GetCurrentFadeColor_ = {}, Valve::VR::IVRCompositor::_FadeGrid* FadeGrid_ = {}, Valve::VR::IVRCompositor::_GetCurrentGridAlpha* GetCurrentGridAlpha_ = {}, Valve::VR::IVRCompositor::_SetSkyboxOverride* SetSkyboxOverride_ = {}, Valve::VR::IVRCompositor::_ClearSkyboxOverride* ClearSkyboxOverride_ = {}, Valve::VR::IVRCompositor::_CompositorBringToFront* CompositorBringToFront_ = {}, Valve::VR::IVRCompositor::_CompositorGoToBack* CompositorGoToBack_ = {}, Valve::VR::IVRCompositor::_CompositorQuit* CompositorQuit_ = {}, Valve::VR::IVRCompositor::_IsFullscreen* IsFullscreen_ = {}, Valve::VR::IVRCompositor::_GetCurrentSceneFocusProcess* GetCurrentSceneFocusProcess_ = {}, Valve::VR::IVRCompositor::_GetLastFrameRenderer* GetLastFrameRenderer_ = {}, Valve::VR::IVRCompositor::_CanRenderScene* CanRenderScene_ = {}, Valve::VR::IVRCompositor::_ShowMirrorWindow* ShowMirrorWindow_ = {}, Valve::VR::IVRCompositor::_HideMirrorWindow* HideMirrorWindow_ = {}, Valve::VR::IVRCompositor::_IsMirrorWindowVisible* IsMirrorWindowVisible_ = {}, Valve::VR::IVRCompositor::_CompositorDumpImages* CompositorDumpImages_ = {}, Valve::VR::IVRCompositor::_ShouldAppRenderWithLowResources* ShouldAppRenderWithLowResources_ = {}, Valve::VR::IVRCompositor::_ForceInterleavedReprojectionOn* ForceInterleavedReprojectionOn_ = {}, Valve::VR::IVRCompositor::_ForceReconnectProcess* ForceReconnectProcess_ = {}, Valve::VR::IVRCompositor::_SuspendRendering* SuspendRendering_ = {}, Valve::VR::IVRCompositor::_GetMirrorTextureD3D11* GetMirrorTextureD3D11_ = {}, Valve::VR::IVRCompositor::_ReleaseMirrorTextureD3D11* ReleaseMirrorTextureD3D11_ = {}, Valve::VR::IVRCompositor::_GetMirrorTextureGL* GetMirrorTextureGL_ = {}, Valve::VR::IVRCompositor::_ReleaseSharedGLTexture* ReleaseSharedGLTexture_ = {}, Valve::VR::IVRCompositor::_LockGLSharedTextureForAccess* LockGLSharedTextureForAccess_ = {}, Valve::VR::IVRCompositor::_UnlockGLSharedTextureForAccess* UnlockGLSharedTextureForAccess_ = {}, Valve::VR::IVRCompositor::_GetVulkanInstanceExtensionsRequired* GetVulkanInstanceExtensionsRequired_ = {}, Valve::VR::IVRCompositor::_GetVulkanDeviceExtensionsRequired* GetVulkanDeviceExtensionsRequired_ = {}, Valve::VR::IVRCompositor::_SetExplicitTimingMode* SetExplicitTimingMode_ = {}, Valve::VR::IVRCompositor::_SubmitExplicitTimingData* SubmitExplicitTimingData_ = {}) noexcept : SetTrackingSpace{SetTrackingSpace_}, GetTrackingSpace{GetTrackingSpace_}, WaitGetPoses{WaitGetPoses_}, GetLastPoses{GetLastPoses_}, GetLastPoseForTrackedDeviceIndex{GetLastPoseForTrackedDeviceIndex_}, Submit{Submit_}, ClearLastSubmittedFrame{ClearLastSubmittedFrame_}, PostPresentHandoff{PostPresentHandoff_}, GetFrameTiming{GetFrameTiming_}, GetFrameTimings{GetFrameTimings_}, GetFrameTimeRemaining{GetFrameTimeRemaining_}, GetCumulativeStats{GetCumulativeStats_}, FadeToColor{FadeToColor_}, GetCurrentFadeColor{GetCurrentFadeColor_}, FadeGrid{FadeGrid_}, GetCurrentGridAlpha{GetCurrentGridAlpha_}, SetSkyboxOverride{SetSkyboxOverride_}, ClearSkyboxOverride{ClearSkyboxOverride_}, CompositorBringToFront{CompositorBringToFront_}, CompositorGoToBack{CompositorGoToBack_}, CompositorQuit{CompositorQuit_}, IsFullscreen{IsFullscreen_}, GetCurrentSceneFocusProcess{GetCurrentSceneFocusProcess_}, GetLastFrameRenderer{GetLastFrameRenderer_}, CanRenderScene{CanRenderScene_}, ShowMirrorWindow{ShowMirrorWindow_}, HideMirrorWindow{HideMirrorWindow_}, IsMirrorWindowVisible{IsMirrorWindowVisible_}, CompositorDumpImages{CompositorDumpImages_}, ShouldAppRenderWithLowResources{ShouldAppRenderWithLowResources_}, ForceInterleavedReprojectionOn{ForceInterleavedReprojectionOn_}, ForceReconnectProcess{ForceReconnectProcess_}, SuspendRendering{SuspendRendering_}, GetMirrorTextureD3D11{GetMirrorTextureD3D11_}, ReleaseMirrorTextureD3D11{ReleaseMirrorTextureD3D11_}, GetMirrorTextureGL{GetMirrorTextureGL_}, ReleaseSharedGLTexture{ReleaseSharedGLTexture_}, LockGLSharedTextureForAccess{LockGLSharedTextureForAccess_}, UnlockGLSharedTextureForAccess{UnlockGLSharedTextureForAccess_}, GetVulkanInstanceExtensionsRequired{GetVulkanInstanceExtensionsRequired_}, GetVulkanDeviceExtensionsRequired{GetVulkanDeviceExtensionsRequired_}, SetExplicitTimingMode{SetExplicitTimingMode_}, SubmitExplicitTimingData{SubmitExplicitTimingData_} {}
  }; // Valve.VR.IVRCompositor
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRCompositor, "Valve.VR", "IVRCompositor");
#pragma pack(pop)
