// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Autogenerated type: Valve.VR.IVRChaperone
  struct IVRChaperone : public System::ValueType {
    public:
    // Nested type: Valve::VR::IVRChaperone::_GetCalibrationState
    class _GetCalibrationState;
    // Nested type: Valve::VR::IVRChaperone::_GetPlayAreaSize
    class _GetPlayAreaSize;
    // Nested type: Valve::VR::IVRChaperone::_GetPlayAreaRect
    class _GetPlayAreaRect;
    // Nested type: Valve::VR::IVRChaperone::_ReloadInfo
    class _ReloadInfo;
    // Nested type: Valve::VR::IVRChaperone::_SetSceneColor
    class _SetSceneColor;
    // Nested type: Valve::VR::IVRChaperone::_GetBoundsColor
    class _GetBoundsColor;
    // Nested type: Valve::VR::IVRChaperone::_AreBoundsVisible
    class _AreBoundsVisible;
    // Nested type: Valve::VR::IVRChaperone::_ForceBoundsVisible
    class _ForceBoundsVisible;
    // Valve.VR.IVRChaperone/_GetCalibrationState GetCalibrationState
    // Offset: 0x0
    Valve::VR::IVRChaperone::_GetCalibrationState* GetCalibrationState;
    // Valve.VR.IVRChaperone/_GetPlayAreaSize GetPlayAreaSize
    // Offset: 0x8
    Valve::VR::IVRChaperone::_GetPlayAreaSize* GetPlayAreaSize;
    // Valve.VR.IVRChaperone/_GetPlayAreaRect GetPlayAreaRect
    // Offset: 0x10
    Valve::VR::IVRChaperone::_GetPlayAreaRect* GetPlayAreaRect;
    // Valve.VR.IVRChaperone/_ReloadInfo ReloadInfo
    // Offset: 0x18
    Valve::VR::IVRChaperone::_ReloadInfo* ReloadInfo;
    // Valve.VR.IVRChaperone/_SetSceneColor SetSceneColor
    // Offset: 0x20
    Valve::VR::IVRChaperone::_SetSceneColor* SetSceneColor;
    // Valve.VR.IVRChaperone/_GetBoundsColor GetBoundsColor
    // Offset: 0x28
    Valve::VR::IVRChaperone::_GetBoundsColor* GetBoundsColor;
    // Valve.VR.IVRChaperone/_AreBoundsVisible AreBoundsVisible
    // Offset: 0x30
    Valve::VR::IVRChaperone::_AreBoundsVisible* AreBoundsVisible;
    // Valve.VR.IVRChaperone/_ForceBoundsVisible ForceBoundsVisible
    // Offset: 0x38
    Valve::VR::IVRChaperone::_ForceBoundsVisible* ForceBoundsVisible;
    // Creating value type constructor for type: IVRChaperone
    constexpr IVRChaperone(Valve::VR::IVRChaperone::_GetCalibrationState* GetCalibrationState_ = {}, Valve::VR::IVRChaperone::_GetPlayAreaSize* GetPlayAreaSize_ = {}, Valve::VR::IVRChaperone::_GetPlayAreaRect* GetPlayAreaRect_ = {}, Valve::VR::IVRChaperone::_ReloadInfo* ReloadInfo_ = {}, Valve::VR::IVRChaperone::_SetSceneColor* SetSceneColor_ = {}, Valve::VR::IVRChaperone::_GetBoundsColor* GetBoundsColor_ = {}, Valve::VR::IVRChaperone::_AreBoundsVisible* AreBoundsVisible_ = {}, Valve::VR::IVRChaperone::_ForceBoundsVisible* ForceBoundsVisible_ = {}) noexcept : GetCalibrationState{GetCalibrationState_}, GetPlayAreaSize{GetPlayAreaSize_}, GetPlayAreaRect{GetPlayAreaRect_}, ReloadInfo{ReloadInfo_}, SetSceneColor{SetSceneColor_}, GetBoundsColor{GetBoundsColor_}, AreBoundsVisible{AreBoundsVisible_}, ForceBoundsVisible{ForceBoundsVisible_} {}
  }; // Valve.VR.IVRChaperone
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRChaperone, "Valve.VR", "IVRChaperone");
#pragma pack(pop)
