// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0xA0
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.IVRChaperoneSetup
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRChaperoneSetup/*, public System::ValueType*/ {
    public:
    // Nested type: Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy
    class _CommitWorkingCopy;
    // Nested type: Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy
    class _RevertWorkingCopy;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize
    class _GetWorkingPlayAreaSize;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect
    class _GetWorkingPlayAreaRect;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo
    class _GetWorkingCollisionBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo
    class _GetLiveCollisionBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose
    class _GetWorkingSeatedZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose
    class _GetWorkingStandingZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize
    class _SetWorkingPlayAreaSize;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo
    class _SetWorkingCollisionBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose
    class _SetWorkingSeatedZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose
    class _SetWorkingStandingZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_ReloadFromDisk
    class _ReloadFromDisk;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose
    class _GetLiveSeatedZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo
    class _SetWorkingCollisionBoundsTagsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo
    class _GetLiveCollisionBoundsTagsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo
    class _SetWorkingPhysicalBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo
    class _GetLivePhysicalBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer
    class _ExportLiveToBuffer;
    // Nested type: Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking
    class _ImportFromBufferToWorking;
    // Valve.VR.IVRChaperoneSetup/Valve.VR._CommitWorkingCopy CommitWorkingCopy
    // Size: 0x8
    // Offset: 0x0
    Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy* CommitWorkingCopy;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._RevertWorkingCopy RevertWorkingCopy
    // Size: 0x8
    // Offset: 0x8
    Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy* RevertWorkingCopy;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaSize GetWorkingPlayAreaSize
    // Size: 0x8
    // Offset: 0x10
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* GetWorkingPlayAreaSize;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaRect GetWorkingPlayAreaRect
    // Size: 0x8
    // Offset: 0x18
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* GetWorkingPlayAreaRect;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingCollisionBoundsInfo GetWorkingCollisionBoundsInfo
    // Size: 0x8
    // Offset: 0x20
    Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* GetWorkingCollisionBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsInfo GetLiveCollisionBoundsInfo
    // Size: 0x8
    // Offset: 0x28
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* GetLiveCollisionBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingSeatedZeroPoseToRawTrackingPose GetWorkingSeatedZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x30
    Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* GetWorkingSeatedZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingStandingZeroPoseToRawTrackingPose GetWorkingStandingZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x38
    Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* GetWorkingStandingZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPlayAreaSize SetWorkingPlayAreaSize
    // Size: 0x8
    // Offset: 0x40
    Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* SetWorkingPlayAreaSize;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsInfo SetWorkingCollisionBoundsInfo
    // Size: 0x8
    // Offset: 0x48
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* SetWorkingCollisionBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingSeatedZeroPoseToRawTrackingPose SetWorkingSeatedZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x50
    Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* SetWorkingSeatedZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingStandingZeroPoseToRawTrackingPose SetWorkingStandingZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x58
    Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* SetWorkingStandingZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._ReloadFromDisk ReloadFromDisk
    // Size: 0x8
    // Offset: 0x60
    Valve::VR::IVRChaperoneSetup::_ReloadFromDisk* ReloadFromDisk;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_ReloadFromDisk*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveSeatedZeroPoseToRawTrackingPose GetLiveSeatedZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x68
    Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* GetLiveSeatedZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsTagsInfo SetWorkingCollisionBoundsTagsInfo
    // Size: 0x8
    // Offset: 0x70
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* SetWorkingCollisionBoundsTagsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsTagsInfo GetLiveCollisionBoundsTagsInfo
    // Size: 0x8
    // Offset: 0x78
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* GetLiveCollisionBoundsTagsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPhysicalBoundsInfo SetWorkingPhysicalBoundsInfo
    // Size: 0x8
    // Offset: 0x80
    Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* SetWorkingPhysicalBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._GetLivePhysicalBoundsInfo GetLivePhysicalBoundsInfo
    // Size: 0x8
    // Offset: 0x88
    Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* GetLivePhysicalBoundsInfo;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._ExportLiveToBuffer ExportLiveToBuffer
    // Size: 0x8
    // Offset: 0x90
    Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer* ExportLiveToBuffer;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer*) == 0x8);
    // Valve.VR.IVRChaperoneSetup/Valve.VR._ImportFromBufferToWorking ImportFromBufferToWorking
    // Size: 0x8
    // Offset: 0x98
    Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking* ImportFromBufferToWorking;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking*) == 0x8);
    // Creating value type constructor for type: IVRChaperoneSetup
    constexpr IVRChaperoneSetup(Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy* CommitWorkingCopy_ = {}, Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy* RevertWorkingCopy_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* GetWorkingPlayAreaSize_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* GetWorkingPlayAreaRect_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* GetWorkingCollisionBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* GetLiveCollisionBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* GetWorkingSeatedZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* GetWorkingStandingZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* SetWorkingPlayAreaSize_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* SetWorkingCollisionBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* SetWorkingSeatedZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* SetWorkingStandingZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_ReloadFromDisk* ReloadFromDisk_ = {}, Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* GetLiveSeatedZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* SetWorkingCollisionBoundsTagsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* GetLiveCollisionBoundsTagsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* SetWorkingPhysicalBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* GetLivePhysicalBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer* ExportLiveToBuffer_ = {}, Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking* ImportFromBufferToWorking_ = {}) noexcept : CommitWorkingCopy{CommitWorkingCopy_}, RevertWorkingCopy{RevertWorkingCopy_}, GetWorkingPlayAreaSize{GetWorkingPlayAreaSize_}, GetWorkingPlayAreaRect{GetWorkingPlayAreaRect_}, GetWorkingCollisionBoundsInfo{GetWorkingCollisionBoundsInfo_}, GetLiveCollisionBoundsInfo{GetLiveCollisionBoundsInfo_}, GetWorkingSeatedZeroPoseToRawTrackingPose{GetWorkingSeatedZeroPoseToRawTrackingPose_}, GetWorkingStandingZeroPoseToRawTrackingPose{GetWorkingStandingZeroPoseToRawTrackingPose_}, SetWorkingPlayAreaSize{SetWorkingPlayAreaSize_}, SetWorkingCollisionBoundsInfo{SetWorkingCollisionBoundsInfo_}, SetWorkingSeatedZeroPoseToRawTrackingPose{SetWorkingSeatedZeroPoseToRawTrackingPose_}, SetWorkingStandingZeroPoseToRawTrackingPose{SetWorkingStandingZeroPoseToRawTrackingPose_}, ReloadFromDisk{ReloadFromDisk_}, GetLiveSeatedZeroPoseToRawTrackingPose{GetLiveSeatedZeroPoseToRawTrackingPose_}, SetWorkingCollisionBoundsTagsInfo{SetWorkingCollisionBoundsTagsInfo_}, GetLiveCollisionBoundsTagsInfo{GetLiveCollisionBoundsTagsInfo_}, SetWorkingPhysicalBoundsInfo{SetWorkingPhysicalBoundsInfo_}, GetLivePhysicalBoundsInfo{GetLivePhysicalBoundsInfo_}, ExportLiveToBuffer{ExportLiveToBuffer_}, ImportFromBufferToWorking{ImportFromBufferToWorking_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._CommitWorkingCopy CommitWorkingCopy
    Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy* _get_CommitWorkingCopy();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._CommitWorkingCopy CommitWorkingCopy
    void _set_CommitWorkingCopy(Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._RevertWorkingCopy RevertWorkingCopy
    Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy* _get_RevertWorkingCopy();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._RevertWorkingCopy RevertWorkingCopy
    void _set_RevertWorkingCopy(Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaSize GetWorkingPlayAreaSize
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* _get_GetWorkingPlayAreaSize();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaSize GetWorkingPlayAreaSize
    void _set_GetWorkingPlayAreaSize(Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaRect GetWorkingPlayAreaRect
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* _get_GetWorkingPlayAreaRect();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingPlayAreaRect GetWorkingPlayAreaRect
    void _set_GetWorkingPlayAreaRect(Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingCollisionBoundsInfo GetWorkingCollisionBoundsInfo
    Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* _get_GetWorkingCollisionBoundsInfo();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingCollisionBoundsInfo GetWorkingCollisionBoundsInfo
    void _set_GetWorkingCollisionBoundsInfo(Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsInfo GetLiveCollisionBoundsInfo
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* _get_GetLiveCollisionBoundsInfo();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsInfo GetLiveCollisionBoundsInfo
    void _set_GetLiveCollisionBoundsInfo(Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingSeatedZeroPoseToRawTrackingPose GetWorkingSeatedZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* _get_GetWorkingSeatedZeroPoseToRawTrackingPose();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingSeatedZeroPoseToRawTrackingPose GetWorkingSeatedZeroPoseToRawTrackingPose
    void _set_GetWorkingSeatedZeroPoseToRawTrackingPose(Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingStandingZeroPoseToRawTrackingPose GetWorkingStandingZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* _get_GetWorkingStandingZeroPoseToRawTrackingPose();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetWorkingStandingZeroPoseToRawTrackingPose GetWorkingStandingZeroPoseToRawTrackingPose
    void _set_GetWorkingStandingZeroPoseToRawTrackingPose(Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPlayAreaSize SetWorkingPlayAreaSize
    Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* _get_SetWorkingPlayAreaSize();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPlayAreaSize SetWorkingPlayAreaSize
    void _set_SetWorkingPlayAreaSize(Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsInfo SetWorkingCollisionBoundsInfo
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* _get_SetWorkingCollisionBoundsInfo();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsInfo SetWorkingCollisionBoundsInfo
    void _set_SetWorkingCollisionBoundsInfo(Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingSeatedZeroPoseToRawTrackingPose SetWorkingSeatedZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* _get_SetWorkingSeatedZeroPoseToRawTrackingPose();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingSeatedZeroPoseToRawTrackingPose SetWorkingSeatedZeroPoseToRawTrackingPose
    void _set_SetWorkingSeatedZeroPoseToRawTrackingPose(Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingStandingZeroPoseToRawTrackingPose SetWorkingStandingZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* _get_SetWorkingStandingZeroPoseToRawTrackingPose();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingStandingZeroPoseToRawTrackingPose SetWorkingStandingZeroPoseToRawTrackingPose
    void _set_SetWorkingStandingZeroPoseToRawTrackingPose(Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._ReloadFromDisk ReloadFromDisk
    Valve::VR::IVRChaperoneSetup::_ReloadFromDisk* _get_ReloadFromDisk();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._ReloadFromDisk ReloadFromDisk
    void _set_ReloadFromDisk(Valve::VR::IVRChaperoneSetup::_ReloadFromDisk* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveSeatedZeroPoseToRawTrackingPose GetLiveSeatedZeroPoseToRawTrackingPose
    Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* _get_GetLiveSeatedZeroPoseToRawTrackingPose();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveSeatedZeroPoseToRawTrackingPose GetLiveSeatedZeroPoseToRawTrackingPose
    void _set_GetLiveSeatedZeroPoseToRawTrackingPose(Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsTagsInfo SetWorkingCollisionBoundsTagsInfo
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* _get_SetWorkingCollisionBoundsTagsInfo();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingCollisionBoundsTagsInfo SetWorkingCollisionBoundsTagsInfo
    void _set_SetWorkingCollisionBoundsTagsInfo(Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsTagsInfo GetLiveCollisionBoundsTagsInfo
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* _get_GetLiveCollisionBoundsTagsInfo();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLiveCollisionBoundsTagsInfo GetLiveCollisionBoundsTagsInfo
    void _set_GetLiveCollisionBoundsTagsInfo(Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPhysicalBoundsInfo SetWorkingPhysicalBoundsInfo
    Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* _get_SetWorkingPhysicalBoundsInfo();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._SetWorkingPhysicalBoundsInfo SetWorkingPhysicalBoundsInfo
    void _set_SetWorkingPhysicalBoundsInfo(Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLivePhysicalBoundsInfo GetLivePhysicalBoundsInfo
    Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* _get_GetLivePhysicalBoundsInfo();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._GetLivePhysicalBoundsInfo GetLivePhysicalBoundsInfo
    void _set_GetLivePhysicalBoundsInfo(Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._ExportLiveToBuffer ExportLiveToBuffer
    Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer* _get_ExportLiveToBuffer();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._ExportLiveToBuffer ExportLiveToBuffer
    void _set_ExportLiveToBuffer(Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer* value);
    // Get instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._ImportFromBufferToWorking ImportFromBufferToWorking
    Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking* _get_ImportFromBufferToWorking();
    // Set instance field: Valve.VR.IVRChaperoneSetup/Valve.VR._ImportFromBufferToWorking ImportFromBufferToWorking
    void _set_ImportFromBufferToWorking(Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking* value);
  }; // Valve.VR.IVRChaperoneSetup
  #pragma pack(pop)
  static check_size<sizeof(IVRChaperoneSetup), 152 + sizeof(Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking*)> __Valve_VR_IVRChaperoneSetupSizeCheck;
  static_assert(sizeof(IVRChaperoneSetup) == 0xA0);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRChaperoneSetup, "Valve.VR", "IVRChaperoneSetup");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
