// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Autogenerated type: Valve.VR.IVRChaperoneSetup
  struct IVRChaperoneSetup : public System::ValueType {
    public:
    // Nested type: Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy
    class _CommitWorkingCopy;
    // Nested type: Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy
    class _RevertWorkingCopy;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize
    class _GetWorkingPlayAreaSize;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect
    class _GetWorkingPlayAreaRect;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo
    class _GetWorkingCollisionBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo
    class _GetLiveCollisionBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose
    class _GetWorkingSeatedZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose
    class _GetWorkingStandingZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize
    class _SetWorkingPlayAreaSize;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo
    class _SetWorkingCollisionBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose
    class _SetWorkingSeatedZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose
    class _SetWorkingStandingZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_ReloadFromDisk
    class _ReloadFromDisk;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose
    class _GetLiveSeatedZeroPoseToRawTrackingPose;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo
    class _SetWorkingCollisionBoundsTagsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo
    class _GetLiveCollisionBoundsTagsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo
    class _SetWorkingPhysicalBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo
    class _GetLivePhysicalBoundsInfo;
    // Nested type: Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer
    class _ExportLiveToBuffer;
    // Nested type: Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking
    class _ImportFromBufferToWorking;
    // Valve.VR.IVRChaperoneSetup/_CommitWorkingCopy CommitWorkingCopy
    // Offset: 0x0
    Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy* CommitWorkingCopy;
    // Valve.VR.IVRChaperoneSetup/_RevertWorkingCopy RevertWorkingCopy
    // Offset: 0x8
    Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy* RevertWorkingCopy;
    // Valve.VR.IVRChaperoneSetup/_GetWorkingPlayAreaSize GetWorkingPlayAreaSize
    // Offset: 0x10
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* GetWorkingPlayAreaSize;
    // Valve.VR.IVRChaperoneSetup/_GetWorkingPlayAreaRect GetWorkingPlayAreaRect
    // Offset: 0x18
    Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* GetWorkingPlayAreaRect;
    // Valve.VR.IVRChaperoneSetup/_GetWorkingCollisionBoundsInfo GetWorkingCollisionBoundsInfo
    // Offset: 0x20
    Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* GetWorkingCollisionBoundsInfo;
    // Valve.VR.IVRChaperoneSetup/_GetLiveCollisionBoundsInfo GetLiveCollisionBoundsInfo
    // Offset: 0x28
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* GetLiveCollisionBoundsInfo;
    // Valve.VR.IVRChaperoneSetup/_GetWorkingSeatedZeroPoseToRawTrackingPose GetWorkingSeatedZeroPoseToRawTrackingPose
    // Offset: 0x30
    Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* GetWorkingSeatedZeroPoseToRawTrackingPose;
    // Valve.VR.IVRChaperoneSetup/_GetWorkingStandingZeroPoseToRawTrackingPose GetWorkingStandingZeroPoseToRawTrackingPose
    // Offset: 0x38
    Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* GetWorkingStandingZeroPoseToRawTrackingPose;
    // Valve.VR.IVRChaperoneSetup/_SetWorkingPlayAreaSize SetWorkingPlayAreaSize
    // Offset: 0x40
    Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* SetWorkingPlayAreaSize;
    // Valve.VR.IVRChaperoneSetup/_SetWorkingCollisionBoundsInfo SetWorkingCollisionBoundsInfo
    // Offset: 0x48
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* SetWorkingCollisionBoundsInfo;
    // Valve.VR.IVRChaperoneSetup/_SetWorkingSeatedZeroPoseToRawTrackingPose SetWorkingSeatedZeroPoseToRawTrackingPose
    // Offset: 0x50
    Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* SetWorkingSeatedZeroPoseToRawTrackingPose;
    // Valve.VR.IVRChaperoneSetup/_SetWorkingStandingZeroPoseToRawTrackingPose SetWorkingStandingZeroPoseToRawTrackingPose
    // Offset: 0x58
    Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* SetWorkingStandingZeroPoseToRawTrackingPose;
    // Valve.VR.IVRChaperoneSetup/_ReloadFromDisk ReloadFromDisk
    // Offset: 0x60
    Valve::VR::IVRChaperoneSetup::_ReloadFromDisk* ReloadFromDisk;
    // Valve.VR.IVRChaperoneSetup/_GetLiveSeatedZeroPoseToRawTrackingPose GetLiveSeatedZeroPoseToRawTrackingPose
    // Offset: 0x68
    Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* GetLiveSeatedZeroPoseToRawTrackingPose;
    // Valve.VR.IVRChaperoneSetup/_SetWorkingCollisionBoundsTagsInfo SetWorkingCollisionBoundsTagsInfo
    // Offset: 0x70
    Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* SetWorkingCollisionBoundsTagsInfo;
    // Valve.VR.IVRChaperoneSetup/_GetLiveCollisionBoundsTagsInfo GetLiveCollisionBoundsTagsInfo
    // Offset: 0x78
    Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* GetLiveCollisionBoundsTagsInfo;
    // Valve.VR.IVRChaperoneSetup/_SetWorkingPhysicalBoundsInfo SetWorkingPhysicalBoundsInfo
    // Offset: 0x80
    Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* SetWorkingPhysicalBoundsInfo;
    // Valve.VR.IVRChaperoneSetup/_GetLivePhysicalBoundsInfo GetLivePhysicalBoundsInfo
    // Offset: 0x88
    Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* GetLivePhysicalBoundsInfo;
    // Valve.VR.IVRChaperoneSetup/_ExportLiveToBuffer ExportLiveToBuffer
    // Offset: 0x90
    Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer* ExportLiveToBuffer;
    // Valve.VR.IVRChaperoneSetup/_ImportFromBufferToWorking ImportFromBufferToWorking
    // Offset: 0x98
    Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking* ImportFromBufferToWorking;
    // Creating value type constructor for type: IVRChaperoneSetup
    constexpr IVRChaperoneSetup(Valve::VR::IVRChaperoneSetup::_CommitWorkingCopy* CommitWorkingCopy_ = {}, Valve::VR::IVRChaperoneSetup::_RevertWorkingCopy* RevertWorkingCopy_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* GetWorkingPlayAreaSize_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* GetWorkingPlayAreaRect_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* GetWorkingCollisionBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* GetLiveCollisionBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* GetWorkingSeatedZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* GetWorkingStandingZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* SetWorkingPlayAreaSize_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* SetWorkingCollisionBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* SetWorkingSeatedZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* SetWorkingStandingZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_ReloadFromDisk* ReloadFromDisk_ = {}, Valve::VR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* GetLiveSeatedZeroPoseToRawTrackingPose_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* SetWorkingCollisionBoundsTagsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* GetLiveCollisionBoundsTagsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* SetWorkingPhysicalBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* GetLivePhysicalBoundsInfo_ = {}, Valve::VR::IVRChaperoneSetup::_ExportLiveToBuffer* ExportLiveToBuffer_ = {}, Valve::VR::IVRChaperoneSetup::_ImportFromBufferToWorking* ImportFromBufferToWorking_ = {}) noexcept : CommitWorkingCopy{CommitWorkingCopy_}, RevertWorkingCopy{RevertWorkingCopy_}, GetWorkingPlayAreaSize{GetWorkingPlayAreaSize_}, GetWorkingPlayAreaRect{GetWorkingPlayAreaRect_}, GetWorkingCollisionBoundsInfo{GetWorkingCollisionBoundsInfo_}, GetLiveCollisionBoundsInfo{GetLiveCollisionBoundsInfo_}, GetWorkingSeatedZeroPoseToRawTrackingPose{GetWorkingSeatedZeroPoseToRawTrackingPose_}, GetWorkingStandingZeroPoseToRawTrackingPose{GetWorkingStandingZeroPoseToRawTrackingPose_}, SetWorkingPlayAreaSize{SetWorkingPlayAreaSize_}, SetWorkingCollisionBoundsInfo{SetWorkingCollisionBoundsInfo_}, SetWorkingSeatedZeroPoseToRawTrackingPose{SetWorkingSeatedZeroPoseToRawTrackingPose_}, SetWorkingStandingZeroPoseToRawTrackingPose{SetWorkingStandingZeroPoseToRawTrackingPose_}, ReloadFromDisk{ReloadFromDisk_}, GetLiveSeatedZeroPoseToRawTrackingPose{GetLiveSeatedZeroPoseToRawTrackingPose_}, SetWorkingCollisionBoundsTagsInfo{SetWorkingCollisionBoundsTagsInfo_}, GetLiveCollisionBoundsTagsInfo{GetLiveCollisionBoundsTagsInfo_}, SetWorkingPhysicalBoundsInfo{SetWorkingPhysicalBoundsInfo_}, GetLivePhysicalBoundsInfo{GetLivePhysicalBoundsInfo_}, ExportLiveToBuffer{ExportLiveToBuffer_}, ImportFromBufferToWorking{ImportFromBufferToWorking_} {}
  }; // Valve.VR.IVRChaperoneSetup
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRChaperoneSetup, "Valve.VR", "IVRChaperoneSetup");
#pragma pack(pop)
