// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Forward declaring type: IVROverlay
  struct IVROverlay;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Valve::VR::IVROverlay, "Valve.VR", "IVROverlay");
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0x290
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.IVROverlay
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVROverlay/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::Valve::VR::IVROverlay::_FindOverlay
    class _FindOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_CreateOverlay
    class _CreateOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_DestroyOverlay
    class _DestroyOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_SetHighQualityOverlay
    class _SetHighQualityOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_GetHighQualityOverlay
    class _GetHighQualityOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayKey
    class _GetOverlayKey;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayName
    class _GetOverlayName;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayName
    class _SetOverlayName;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayImageData
    class _GetOverlayImageData;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayErrorNameFromEnum
    class _GetOverlayErrorNameFromEnum;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayRenderingPid
    class _SetOverlayRenderingPid;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayRenderingPid
    class _GetOverlayRenderingPid;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayFlag
    class _SetOverlayFlag;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayFlag
    class _GetOverlayFlag;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayColor
    class _SetOverlayColor;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayColor
    class _GetOverlayColor;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayAlpha
    class _SetOverlayAlpha;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayAlpha
    class _GetOverlayAlpha;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayTexelAspect
    class _SetOverlayTexelAspect;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTexelAspect
    class _GetOverlayTexelAspect;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlaySortOrder
    class _SetOverlaySortOrder;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlaySortOrder
    class _GetOverlaySortOrder;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayWidthInMeters
    class _SetOverlayWidthInMeters;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayWidthInMeters
    class _GetOverlayWidthInMeters;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayAutoCurveDistanceRangeInMeters
    class _SetOverlayAutoCurveDistanceRangeInMeters;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayAutoCurveDistanceRangeInMeters
    class _GetOverlayAutoCurveDistanceRangeInMeters;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayTextureColorSpace
    class _SetOverlayTextureColorSpace;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTextureColorSpace
    class _GetOverlayTextureColorSpace;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayTextureBounds
    class _SetOverlayTextureBounds;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTextureBounds
    class _GetOverlayTextureBounds;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayRenderModel
    class _GetOverlayRenderModel;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayRenderModel
    class _SetOverlayRenderModel;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTransformType
    class _GetOverlayTransformType;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayTransformAbsolute
    class _SetOverlayTransformAbsolute;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTransformAbsolute
    class _GetOverlayTransformAbsolute;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayTransformTrackedDeviceRelative
    class _SetOverlayTransformTrackedDeviceRelative;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTransformTrackedDeviceRelative
    class _GetOverlayTransformTrackedDeviceRelative;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayTransformTrackedDeviceComponent
    class _SetOverlayTransformTrackedDeviceComponent;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTransformTrackedDeviceComponent
    class _GetOverlayTransformTrackedDeviceComponent;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTransformOverlayRelative
    class _GetOverlayTransformOverlayRelative;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayTransformOverlayRelative
    class _SetOverlayTransformOverlayRelative;
    // Nested type: ::Valve::VR::IVROverlay::_ShowOverlay
    class _ShowOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_HideOverlay
    class _HideOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_IsOverlayVisible
    class _IsOverlayVisible;
    // Nested type: ::Valve::VR::IVROverlay::_GetTransformForOverlayCoordinates
    class _GetTransformForOverlayCoordinates;
    // Nested type: ::Valve::VR::IVROverlay::_PollNextOverlayEvent
    class _PollNextOverlayEvent;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayInputMethod
    class _GetOverlayInputMethod;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayInputMethod
    class _SetOverlayInputMethod;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayMouseScale
    class _GetOverlayMouseScale;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayMouseScale
    class _SetOverlayMouseScale;
    // Nested type: ::Valve::VR::IVROverlay::_ComputeOverlayIntersection
    class _ComputeOverlayIntersection;
    // Nested type: ::Valve::VR::IVROverlay::_IsHoverTargetOverlay
    class _IsHoverTargetOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_GetGamepadFocusOverlay
    class _GetGamepadFocusOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_SetGamepadFocusOverlay
    class _SetGamepadFocusOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayNeighbor
    class _SetOverlayNeighbor;
    // Nested type: ::Valve::VR::IVROverlay::_MoveGamepadFocusToNeighbor
    class _MoveGamepadFocusToNeighbor;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayDualAnalogTransform
    class _SetOverlayDualAnalogTransform;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayDualAnalogTransform
    class _GetOverlayDualAnalogTransform;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayTexture
    class _SetOverlayTexture;
    // Nested type: ::Valve::VR::IVROverlay::_ClearOverlayTexture
    class _ClearOverlayTexture;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayRaw
    class _SetOverlayRaw;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayFromFile
    class _SetOverlayFromFile;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTexture
    class _GetOverlayTexture;
    // Nested type: ::Valve::VR::IVROverlay::_ReleaseNativeOverlayHandle
    class _ReleaseNativeOverlayHandle;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayTextureSize
    class _GetOverlayTextureSize;
    // Nested type: ::Valve::VR::IVROverlay::_CreateDashboardOverlay
    class _CreateDashboardOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_IsDashboardVisible
    class _IsDashboardVisible;
    // Nested type: ::Valve::VR::IVROverlay::_IsActiveDashboardOverlay
    class _IsActiveDashboardOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_SetDashboardOverlaySceneProcess
    class _SetDashboardOverlaySceneProcess;
    // Nested type: ::Valve::VR::IVROverlay::_GetDashboardOverlaySceneProcess
    class _GetDashboardOverlaySceneProcess;
    // Nested type: ::Valve::VR::IVROverlay::_ShowDashboard
    class _ShowDashboard;
    // Nested type: ::Valve::VR::IVROverlay::_GetPrimaryDashboardDevice
    class _GetPrimaryDashboardDevice;
    // Nested type: ::Valve::VR::IVROverlay::_ShowKeyboard
    class _ShowKeyboard;
    // Nested type: ::Valve::VR::IVROverlay::_ShowKeyboardForOverlay
    class _ShowKeyboardForOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_GetKeyboardText
    class _GetKeyboardText;
    // Nested type: ::Valve::VR::IVROverlay::_HideKeyboard
    class _HideKeyboard;
    // Nested type: ::Valve::VR::IVROverlay::_SetKeyboardTransformAbsolute
    class _SetKeyboardTransformAbsolute;
    // Nested type: ::Valve::VR::IVROverlay::_SetKeyboardPositionForOverlay
    class _SetKeyboardPositionForOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_SetOverlayIntersectionMask
    class _SetOverlayIntersectionMask;
    // Nested type: ::Valve::VR::IVROverlay::_GetOverlayFlags
    class _GetOverlayFlags;
    // Nested type: ::Valve::VR::IVROverlay::_ShowMessageOverlay
    class _ShowMessageOverlay;
    // Nested type: ::Valve::VR::IVROverlay::_CloseMessageOverlay
    class _CloseMessageOverlay;
    public:
    // Valve.VR.IVROverlay/Valve.VR._FindOverlay FindOverlay
    // Size: 0x8
    // Offset: 0x0
    ::Valve::VR::IVROverlay::_FindOverlay* FindOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_FindOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._CreateOverlay CreateOverlay
    // Size: 0x8
    // Offset: 0x8
    ::Valve::VR::IVROverlay::_CreateOverlay* CreateOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_CreateOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._DestroyOverlay DestroyOverlay
    // Size: 0x8
    // Offset: 0x10
    ::Valve::VR::IVROverlay::_DestroyOverlay* DestroyOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_DestroyOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetHighQualityOverlay SetHighQualityOverlay
    // Size: 0x8
    // Offset: 0x18
    ::Valve::VR::IVROverlay::_SetHighQualityOverlay* SetHighQualityOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetHighQualityOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetHighQualityOverlay GetHighQualityOverlay
    // Size: 0x8
    // Offset: 0x20
    ::Valve::VR::IVROverlay::_GetHighQualityOverlay* GetHighQualityOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetHighQualityOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayKey GetOverlayKey
    // Size: 0x8
    // Offset: 0x28
    ::Valve::VR::IVROverlay::_GetOverlayKey* GetOverlayKey;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayKey*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayName GetOverlayName
    // Size: 0x8
    // Offset: 0x30
    ::Valve::VR::IVROverlay::_GetOverlayName* GetOverlayName;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayName*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayName SetOverlayName
    // Size: 0x8
    // Offset: 0x38
    ::Valve::VR::IVROverlay::_SetOverlayName* SetOverlayName;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayName*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayImageData GetOverlayImageData
    // Size: 0x8
    // Offset: 0x40
    ::Valve::VR::IVROverlay::_GetOverlayImageData* GetOverlayImageData;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayImageData*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayErrorNameFromEnum GetOverlayErrorNameFromEnum
    // Size: 0x8
    // Offset: 0x48
    ::Valve::VR::IVROverlay::_GetOverlayErrorNameFromEnum* GetOverlayErrorNameFromEnum;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayErrorNameFromEnum*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayRenderingPid SetOverlayRenderingPid
    // Size: 0x8
    // Offset: 0x50
    ::Valve::VR::IVROverlay::_SetOverlayRenderingPid* SetOverlayRenderingPid;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayRenderingPid*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayRenderingPid GetOverlayRenderingPid
    // Size: 0x8
    // Offset: 0x58
    ::Valve::VR::IVROverlay::_GetOverlayRenderingPid* GetOverlayRenderingPid;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayRenderingPid*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayFlag SetOverlayFlag
    // Size: 0x8
    // Offset: 0x60
    ::Valve::VR::IVROverlay::_SetOverlayFlag* SetOverlayFlag;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayFlag*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayFlag GetOverlayFlag
    // Size: 0x8
    // Offset: 0x68
    ::Valve::VR::IVROverlay::_GetOverlayFlag* GetOverlayFlag;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayFlag*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayColor SetOverlayColor
    // Size: 0x8
    // Offset: 0x70
    ::Valve::VR::IVROverlay::_SetOverlayColor* SetOverlayColor;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayColor*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayColor GetOverlayColor
    // Size: 0x8
    // Offset: 0x78
    ::Valve::VR::IVROverlay::_GetOverlayColor* GetOverlayColor;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayColor*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayAlpha SetOverlayAlpha
    // Size: 0x8
    // Offset: 0x80
    ::Valve::VR::IVROverlay::_SetOverlayAlpha* SetOverlayAlpha;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayAlpha*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayAlpha GetOverlayAlpha
    // Size: 0x8
    // Offset: 0x88
    ::Valve::VR::IVROverlay::_GetOverlayAlpha* GetOverlayAlpha;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayAlpha*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayTexelAspect SetOverlayTexelAspect
    // Size: 0x8
    // Offset: 0x90
    ::Valve::VR::IVROverlay::_SetOverlayTexelAspect* SetOverlayTexelAspect;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayTexelAspect*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTexelAspect GetOverlayTexelAspect
    // Size: 0x8
    // Offset: 0x98
    ::Valve::VR::IVROverlay::_GetOverlayTexelAspect* GetOverlayTexelAspect;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTexelAspect*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlaySortOrder SetOverlaySortOrder
    // Size: 0x8
    // Offset: 0xA0
    ::Valve::VR::IVROverlay::_SetOverlaySortOrder* SetOverlaySortOrder;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlaySortOrder*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlaySortOrder GetOverlaySortOrder
    // Size: 0x8
    // Offset: 0xA8
    ::Valve::VR::IVROverlay::_GetOverlaySortOrder* GetOverlaySortOrder;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlaySortOrder*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayWidthInMeters SetOverlayWidthInMeters
    // Size: 0x8
    // Offset: 0xB0
    ::Valve::VR::IVROverlay::_SetOverlayWidthInMeters* SetOverlayWidthInMeters;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayWidthInMeters*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayWidthInMeters GetOverlayWidthInMeters
    // Size: 0x8
    // Offset: 0xB8
    ::Valve::VR::IVROverlay::_GetOverlayWidthInMeters* GetOverlayWidthInMeters;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayWidthInMeters*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayAutoCurveDistanceRangeInMeters SetOverlayAutoCurveDistanceRangeInMeters
    // Size: 0x8
    // Offset: 0xC0
    ::Valve::VR::IVROverlay::_SetOverlayAutoCurveDistanceRangeInMeters* SetOverlayAutoCurveDistanceRangeInMeters;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayAutoCurveDistanceRangeInMeters*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayAutoCurveDistanceRangeInMeters GetOverlayAutoCurveDistanceRangeInMeters
    // Size: 0x8
    // Offset: 0xC8
    ::Valve::VR::IVROverlay::_GetOverlayAutoCurveDistanceRangeInMeters* GetOverlayAutoCurveDistanceRangeInMeters;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayAutoCurveDistanceRangeInMeters*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayTextureColorSpace SetOverlayTextureColorSpace
    // Size: 0x8
    // Offset: 0xD0
    ::Valve::VR::IVROverlay::_SetOverlayTextureColorSpace* SetOverlayTextureColorSpace;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayTextureColorSpace*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTextureColorSpace GetOverlayTextureColorSpace
    // Size: 0x8
    // Offset: 0xD8
    ::Valve::VR::IVROverlay::_GetOverlayTextureColorSpace* GetOverlayTextureColorSpace;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTextureColorSpace*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayTextureBounds SetOverlayTextureBounds
    // Size: 0x8
    // Offset: 0xE0
    ::Valve::VR::IVROverlay::_SetOverlayTextureBounds* SetOverlayTextureBounds;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayTextureBounds*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTextureBounds GetOverlayTextureBounds
    // Size: 0x8
    // Offset: 0xE8
    ::Valve::VR::IVROverlay::_GetOverlayTextureBounds* GetOverlayTextureBounds;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTextureBounds*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayRenderModel GetOverlayRenderModel
    // Size: 0x8
    // Offset: 0xF0
    ::Valve::VR::IVROverlay::_GetOverlayRenderModel* GetOverlayRenderModel;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayRenderModel*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayRenderModel SetOverlayRenderModel
    // Size: 0x8
    // Offset: 0xF8
    ::Valve::VR::IVROverlay::_SetOverlayRenderModel* SetOverlayRenderModel;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayRenderModel*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTransformType GetOverlayTransformType
    // Size: 0x8
    // Offset: 0x100
    ::Valve::VR::IVROverlay::_GetOverlayTransformType* GetOverlayTransformType;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTransformType*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayTransformAbsolute SetOverlayTransformAbsolute
    // Size: 0x8
    // Offset: 0x108
    ::Valve::VR::IVROverlay::_SetOverlayTransformAbsolute* SetOverlayTransformAbsolute;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayTransformAbsolute*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTransformAbsolute GetOverlayTransformAbsolute
    // Size: 0x8
    // Offset: 0x110
    ::Valve::VR::IVROverlay::_GetOverlayTransformAbsolute* GetOverlayTransformAbsolute;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTransformAbsolute*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayTransformTrackedDeviceRelative SetOverlayTransformTrackedDeviceRelative
    // Size: 0x8
    // Offset: 0x118
    ::Valve::VR::IVROverlay::_SetOverlayTransformTrackedDeviceRelative* SetOverlayTransformTrackedDeviceRelative;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayTransformTrackedDeviceRelative*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTransformTrackedDeviceRelative GetOverlayTransformTrackedDeviceRelative
    // Size: 0x8
    // Offset: 0x120
    ::Valve::VR::IVROverlay::_GetOverlayTransformTrackedDeviceRelative* GetOverlayTransformTrackedDeviceRelative;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTransformTrackedDeviceRelative*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayTransformTrackedDeviceComponent SetOverlayTransformTrackedDeviceComponent
    // Size: 0x8
    // Offset: 0x128
    ::Valve::VR::IVROverlay::_SetOverlayTransformTrackedDeviceComponent* SetOverlayTransformTrackedDeviceComponent;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayTransformTrackedDeviceComponent*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTransformTrackedDeviceComponent GetOverlayTransformTrackedDeviceComponent
    // Size: 0x8
    // Offset: 0x130
    ::Valve::VR::IVROverlay::_GetOverlayTransformTrackedDeviceComponent* GetOverlayTransformTrackedDeviceComponent;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTransformTrackedDeviceComponent*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTransformOverlayRelative GetOverlayTransformOverlayRelative
    // Size: 0x8
    // Offset: 0x138
    ::Valve::VR::IVROverlay::_GetOverlayTransformOverlayRelative* GetOverlayTransformOverlayRelative;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTransformOverlayRelative*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayTransformOverlayRelative SetOverlayTransformOverlayRelative
    // Size: 0x8
    // Offset: 0x140
    ::Valve::VR::IVROverlay::_SetOverlayTransformOverlayRelative* SetOverlayTransformOverlayRelative;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayTransformOverlayRelative*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._ShowOverlay ShowOverlay
    // Size: 0x8
    // Offset: 0x148
    ::Valve::VR::IVROverlay::_ShowOverlay* ShowOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_ShowOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._HideOverlay HideOverlay
    // Size: 0x8
    // Offset: 0x150
    ::Valve::VR::IVROverlay::_HideOverlay* HideOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_HideOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._IsOverlayVisible IsOverlayVisible
    // Size: 0x8
    // Offset: 0x158
    ::Valve::VR::IVROverlay::_IsOverlayVisible* IsOverlayVisible;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_IsOverlayVisible*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetTransformForOverlayCoordinates GetTransformForOverlayCoordinates
    // Size: 0x8
    // Offset: 0x160
    ::Valve::VR::IVROverlay::_GetTransformForOverlayCoordinates* GetTransformForOverlayCoordinates;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetTransformForOverlayCoordinates*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._PollNextOverlayEvent PollNextOverlayEvent
    // Size: 0x8
    // Offset: 0x168
    ::Valve::VR::IVROverlay::_PollNextOverlayEvent* PollNextOverlayEvent;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_PollNextOverlayEvent*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayInputMethod GetOverlayInputMethod
    // Size: 0x8
    // Offset: 0x170
    ::Valve::VR::IVROverlay::_GetOverlayInputMethod* GetOverlayInputMethod;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayInputMethod*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayInputMethod SetOverlayInputMethod
    // Size: 0x8
    // Offset: 0x178
    ::Valve::VR::IVROverlay::_SetOverlayInputMethod* SetOverlayInputMethod;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayInputMethod*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayMouseScale GetOverlayMouseScale
    // Size: 0x8
    // Offset: 0x180
    ::Valve::VR::IVROverlay::_GetOverlayMouseScale* GetOverlayMouseScale;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayMouseScale*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayMouseScale SetOverlayMouseScale
    // Size: 0x8
    // Offset: 0x188
    ::Valve::VR::IVROverlay::_SetOverlayMouseScale* SetOverlayMouseScale;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayMouseScale*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._ComputeOverlayIntersection ComputeOverlayIntersection
    // Size: 0x8
    // Offset: 0x190
    ::Valve::VR::IVROverlay::_ComputeOverlayIntersection* ComputeOverlayIntersection;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_ComputeOverlayIntersection*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._IsHoverTargetOverlay IsHoverTargetOverlay
    // Size: 0x8
    // Offset: 0x198
    ::Valve::VR::IVROverlay::_IsHoverTargetOverlay* IsHoverTargetOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_IsHoverTargetOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetGamepadFocusOverlay GetGamepadFocusOverlay
    // Size: 0x8
    // Offset: 0x1A0
    ::Valve::VR::IVROverlay::_GetGamepadFocusOverlay* GetGamepadFocusOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetGamepadFocusOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetGamepadFocusOverlay SetGamepadFocusOverlay
    // Size: 0x8
    // Offset: 0x1A8
    ::Valve::VR::IVROverlay::_SetGamepadFocusOverlay* SetGamepadFocusOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetGamepadFocusOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayNeighbor SetOverlayNeighbor
    // Size: 0x8
    // Offset: 0x1B0
    ::Valve::VR::IVROverlay::_SetOverlayNeighbor* SetOverlayNeighbor;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayNeighbor*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._MoveGamepadFocusToNeighbor MoveGamepadFocusToNeighbor
    // Size: 0x8
    // Offset: 0x1B8
    ::Valve::VR::IVROverlay::_MoveGamepadFocusToNeighbor* MoveGamepadFocusToNeighbor;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_MoveGamepadFocusToNeighbor*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayDualAnalogTransform SetOverlayDualAnalogTransform
    // Size: 0x8
    // Offset: 0x1C0
    ::Valve::VR::IVROverlay::_SetOverlayDualAnalogTransform* SetOverlayDualAnalogTransform;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayDualAnalogTransform*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayDualAnalogTransform GetOverlayDualAnalogTransform
    // Size: 0x8
    // Offset: 0x1C8
    ::Valve::VR::IVROverlay::_GetOverlayDualAnalogTransform* GetOverlayDualAnalogTransform;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayDualAnalogTransform*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayTexture SetOverlayTexture
    // Size: 0x8
    // Offset: 0x1D0
    ::Valve::VR::IVROverlay::_SetOverlayTexture* SetOverlayTexture;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayTexture*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._ClearOverlayTexture ClearOverlayTexture
    // Size: 0x8
    // Offset: 0x1D8
    ::Valve::VR::IVROverlay::_ClearOverlayTexture* ClearOverlayTexture;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_ClearOverlayTexture*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayRaw SetOverlayRaw
    // Size: 0x8
    // Offset: 0x1E0
    ::Valve::VR::IVROverlay::_SetOverlayRaw* SetOverlayRaw;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayRaw*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayFromFile SetOverlayFromFile
    // Size: 0x8
    // Offset: 0x1E8
    ::Valve::VR::IVROverlay::_SetOverlayFromFile* SetOverlayFromFile;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayFromFile*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTexture GetOverlayTexture
    // Size: 0x8
    // Offset: 0x1F0
    ::Valve::VR::IVROverlay::_GetOverlayTexture* GetOverlayTexture;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTexture*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._ReleaseNativeOverlayHandle ReleaseNativeOverlayHandle
    // Size: 0x8
    // Offset: 0x1F8
    ::Valve::VR::IVROverlay::_ReleaseNativeOverlayHandle* ReleaseNativeOverlayHandle;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_ReleaseNativeOverlayHandle*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayTextureSize GetOverlayTextureSize
    // Size: 0x8
    // Offset: 0x200
    ::Valve::VR::IVROverlay::_GetOverlayTextureSize* GetOverlayTextureSize;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayTextureSize*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._CreateDashboardOverlay CreateDashboardOverlay
    // Size: 0x8
    // Offset: 0x208
    ::Valve::VR::IVROverlay::_CreateDashboardOverlay* CreateDashboardOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_CreateDashboardOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._IsDashboardVisible IsDashboardVisible
    // Size: 0x8
    // Offset: 0x210
    ::Valve::VR::IVROverlay::_IsDashboardVisible* IsDashboardVisible;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_IsDashboardVisible*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._IsActiveDashboardOverlay IsActiveDashboardOverlay
    // Size: 0x8
    // Offset: 0x218
    ::Valve::VR::IVROverlay::_IsActiveDashboardOverlay* IsActiveDashboardOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_IsActiveDashboardOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetDashboardOverlaySceneProcess SetDashboardOverlaySceneProcess
    // Size: 0x8
    // Offset: 0x220
    ::Valve::VR::IVROverlay::_SetDashboardOverlaySceneProcess* SetDashboardOverlaySceneProcess;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetDashboardOverlaySceneProcess*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetDashboardOverlaySceneProcess GetDashboardOverlaySceneProcess
    // Size: 0x8
    // Offset: 0x228
    ::Valve::VR::IVROverlay::_GetDashboardOverlaySceneProcess* GetDashboardOverlaySceneProcess;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetDashboardOverlaySceneProcess*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._ShowDashboard ShowDashboard
    // Size: 0x8
    // Offset: 0x230
    ::Valve::VR::IVROverlay::_ShowDashboard* ShowDashboard;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_ShowDashboard*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetPrimaryDashboardDevice GetPrimaryDashboardDevice
    // Size: 0x8
    // Offset: 0x238
    ::Valve::VR::IVROverlay::_GetPrimaryDashboardDevice* GetPrimaryDashboardDevice;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetPrimaryDashboardDevice*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._ShowKeyboard ShowKeyboard
    // Size: 0x8
    // Offset: 0x240
    ::Valve::VR::IVROverlay::_ShowKeyboard* ShowKeyboard;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_ShowKeyboard*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._ShowKeyboardForOverlay ShowKeyboardForOverlay
    // Size: 0x8
    // Offset: 0x248
    ::Valve::VR::IVROverlay::_ShowKeyboardForOverlay* ShowKeyboardForOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_ShowKeyboardForOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetKeyboardText GetKeyboardText
    // Size: 0x8
    // Offset: 0x250
    ::Valve::VR::IVROverlay::_GetKeyboardText* GetKeyboardText;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetKeyboardText*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._HideKeyboard HideKeyboard
    // Size: 0x8
    // Offset: 0x258
    ::Valve::VR::IVROverlay::_HideKeyboard* HideKeyboard;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_HideKeyboard*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetKeyboardTransformAbsolute SetKeyboardTransformAbsolute
    // Size: 0x8
    // Offset: 0x260
    ::Valve::VR::IVROverlay::_SetKeyboardTransformAbsolute* SetKeyboardTransformAbsolute;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetKeyboardTransformAbsolute*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetKeyboardPositionForOverlay SetKeyboardPositionForOverlay
    // Size: 0x8
    // Offset: 0x268
    ::Valve::VR::IVROverlay::_SetKeyboardPositionForOverlay* SetKeyboardPositionForOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetKeyboardPositionForOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._SetOverlayIntersectionMask SetOverlayIntersectionMask
    // Size: 0x8
    // Offset: 0x270
    ::Valve::VR::IVROverlay::_SetOverlayIntersectionMask* SetOverlayIntersectionMask;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_SetOverlayIntersectionMask*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._GetOverlayFlags GetOverlayFlags
    // Size: 0x8
    // Offset: 0x278
    ::Valve::VR::IVROverlay::_GetOverlayFlags* GetOverlayFlags;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_GetOverlayFlags*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._ShowMessageOverlay ShowMessageOverlay
    // Size: 0x8
    // Offset: 0x280
    ::Valve::VR::IVROverlay::_ShowMessageOverlay* ShowMessageOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_ShowMessageOverlay*) == 0x8);
    // Valve.VR.IVROverlay/Valve.VR._CloseMessageOverlay CloseMessageOverlay
    // Size: 0x8
    // Offset: 0x288
    ::Valve::VR::IVROverlay::_CloseMessageOverlay* CloseMessageOverlay;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVROverlay::_CloseMessageOverlay*) == 0x8);
    public:
    // Creating value type constructor for type: IVROverlay
