// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Autogenerated type: Valve.VR.IVRRenderModels
  struct IVRRenderModels : public System::ValueType {
    public:
    // Nested type: Valve::VR::IVRRenderModels::_LoadRenderModel_Async
    class _LoadRenderModel_Async;
    // Nested type: Valve::VR::IVRRenderModels::_FreeRenderModel
    class _FreeRenderModel;
    // Nested type: Valve::VR::IVRRenderModels::_LoadTexture_Async
    class _LoadTexture_Async;
    // Nested type: Valve::VR::IVRRenderModels::_FreeTexture
    class _FreeTexture;
    // Nested type: Valve::VR::IVRRenderModels::_LoadTextureD3D11_Async
    class _LoadTextureD3D11_Async;
    // Nested type: Valve::VR::IVRRenderModels::_LoadIntoTextureD3D11_Async
    class _LoadIntoTextureD3D11_Async;
    // Nested type: Valve::VR::IVRRenderModels::_FreeTextureD3D11
    class _FreeTextureD3D11;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelName
    class _GetRenderModelName;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelCount
    class _GetRenderModelCount;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentCount
    class _GetComponentCount;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentName
    class _GetComponentName;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentButtonMask
    class _GetComponentButtonMask;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentRenderModelName
    class _GetComponentRenderModelName;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentState
    class _GetComponentState;
    // Nested type: Valve::VR::IVRRenderModels::_RenderModelHasComponent
    class _RenderModelHasComponent;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelThumbnailURL
    class _GetRenderModelThumbnailURL;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelOriginalPath
    class _GetRenderModelOriginalPath;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum
    class _GetRenderModelErrorNameFromEnum;
    // Valve.VR.IVRRenderModels/_LoadRenderModel_Async LoadRenderModel_Async
    // Offset: 0x0
    Valve::VR::IVRRenderModels::_LoadRenderModel_Async* LoadRenderModel_Async;
    // Valve.VR.IVRRenderModels/_FreeRenderModel FreeRenderModel
    // Offset: 0x8
    Valve::VR::IVRRenderModels::_FreeRenderModel* FreeRenderModel;
    // Valve.VR.IVRRenderModels/_LoadTexture_Async LoadTexture_Async
    // Offset: 0x10
    Valve::VR::IVRRenderModels::_LoadTexture_Async* LoadTexture_Async;
    // Valve.VR.IVRRenderModels/_FreeTexture FreeTexture
    // Offset: 0x18
    Valve::VR::IVRRenderModels::_FreeTexture* FreeTexture;
    // Valve.VR.IVRRenderModels/_LoadTextureD3D11_Async LoadTextureD3D11_Async
    // Offset: 0x20
    Valve::VR::IVRRenderModels::_LoadTextureD3D11_Async* LoadTextureD3D11_Async;
    // Valve.VR.IVRRenderModels/_LoadIntoTextureD3D11_Async LoadIntoTextureD3D11_Async
    // Offset: 0x28
    Valve::VR::IVRRenderModels::_LoadIntoTextureD3D11_Async* LoadIntoTextureD3D11_Async;
    // Valve.VR.IVRRenderModels/_FreeTextureD3D11 FreeTextureD3D11
    // Offset: 0x30
    Valve::VR::IVRRenderModels::_FreeTextureD3D11* FreeTextureD3D11;
    // Valve.VR.IVRRenderModels/_GetRenderModelName GetRenderModelName
    // Offset: 0x38
    Valve::VR::IVRRenderModels::_GetRenderModelName* GetRenderModelName;
    // Valve.VR.IVRRenderModels/_GetRenderModelCount GetRenderModelCount
    // Offset: 0x40
    Valve::VR::IVRRenderModels::_GetRenderModelCount* GetRenderModelCount;
    // Valve.VR.IVRRenderModels/_GetComponentCount GetComponentCount
    // Offset: 0x48
    Valve::VR::IVRRenderModels::_GetComponentCount* GetComponentCount;
    // Valve.VR.IVRRenderModels/_GetComponentName GetComponentName
    // Offset: 0x50
    Valve::VR::IVRRenderModels::_GetComponentName* GetComponentName;
    // Valve.VR.IVRRenderModels/_GetComponentButtonMask GetComponentButtonMask
    // Offset: 0x58
    Valve::VR::IVRRenderModels::_GetComponentButtonMask* GetComponentButtonMask;
    // Valve.VR.IVRRenderModels/_GetComponentRenderModelName GetComponentRenderModelName
    // Offset: 0x60
    Valve::VR::IVRRenderModels::_GetComponentRenderModelName* GetComponentRenderModelName;
    // Valve.VR.IVRRenderModels/_GetComponentState GetComponentState
    // Offset: 0x68
    Valve::VR::IVRRenderModels::_GetComponentState* GetComponentState;
    // Valve.VR.IVRRenderModels/_RenderModelHasComponent RenderModelHasComponent
    // Offset: 0x70
    Valve::VR::IVRRenderModels::_RenderModelHasComponent* RenderModelHasComponent;
    // Valve.VR.IVRRenderModels/_GetRenderModelThumbnailURL GetRenderModelThumbnailURL
    // Offset: 0x78
    Valve::VR::IVRRenderModels::_GetRenderModelThumbnailURL* GetRenderModelThumbnailURL;
    // Valve.VR.IVRRenderModels/_GetRenderModelOriginalPath GetRenderModelOriginalPath
    // Offset: 0x80
    Valve::VR::IVRRenderModels::_GetRenderModelOriginalPath* GetRenderModelOriginalPath;
    // Valve.VR.IVRRenderModels/_GetRenderModelErrorNameFromEnum GetRenderModelErrorNameFromEnum
    // Offset: 0x88
    Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* GetRenderModelErrorNameFromEnum;
    // Creating value type constructor for type: IVRRenderModels
    constexpr IVRRenderModels(Valve::VR::IVRRenderModels::_LoadRenderModel_Async* LoadRenderModel_Async_ = {}, Valve::VR::IVRRenderModels::_FreeRenderModel* FreeRenderModel_ = {}, Valve::VR::IVRRenderModels::_LoadTexture_Async* LoadTexture_Async_ = {}, Valve::VR::IVRRenderModels::_FreeTexture* FreeTexture_ = {}, Valve::VR::IVRRenderModels::_LoadTextureD3D11_Async* LoadTextureD3D11_Async_ = {}, Valve::VR::IVRRenderModels::_LoadIntoTextureD3D11_Async* LoadIntoTextureD3D11_Async_ = {}, Valve::VR::IVRRenderModels::_FreeTextureD3D11* FreeTextureD3D11_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelName* GetRenderModelName_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelCount* GetRenderModelCount_ = {}, Valve::VR::IVRRenderModels::_GetComponentCount* GetComponentCount_ = {}, Valve::VR::IVRRenderModels::_GetComponentName* GetComponentName_ = {}, Valve::VR::IVRRenderModels::_GetComponentButtonMask* GetComponentButtonMask_ = {}, Valve::VR::IVRRenderModels::_GetComponentRenderModelName* GetComponentRenderModelName_ = {}, Valve::VR::IVRRenderModels::_GetComponentState* GetComponentState_ = {}, Valve::VR::IVRRenderModels::_RenderModelHasComponent* RenderModelHasComponent_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelThumbnailURL* GetRenderModelThumbnailURL_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelOriginalPath* GetRenderModelOriginalPath_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* GetRenderModelErrorNameFromEnum_ = {}) noexcept : LoadRenderModel_Async{LoadRenderModel_Async_}, FreeRenderModel{FreeRenderModel_}, LoadTexture_Async{LoadTexture_Async_}, FreeTexture{FreeTexture_}, LoadTextureD3D11_Async{LoadTextureD3D11_Async_}, LoadIntoTextureD3D11_Async{LoadIntoTextureD3D11_Async_}, FreeTextureD3D11{FreeTextureD3D11_}, GetRenderModelName{GetRenderModelName_}, GetRenderModelCount{GetRenderModelCount_}, GetComponentCount{GetComponentCount_}, GetComponentName{GetComponentName_}, GetComponentButtonMask{GetComponentButtonMask_}, GetComponentRenderModelName{GetComponentRenderModelName_}, GetComponentState{GetComponentState_}, RenderModelHasComponent{RenderModelHasComponent_}, GetRenderModelThumbnailURL{GetRenderModelThumbnailURL_}, GetRenderModelOriginalPath{GetRenderModelOriginalPath_}, GetRenderModelErrorNameFromEnum{GetRenderModelErrorNameFromEnum_} {}
  }; // Valve.VR.IVRRenderModels
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRRenderModels, "Valve.VR", "IVRRenderModels");
#pragma pack(pop)
