// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0x90
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.IVRRenderModels
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRRenderModels/*, public System::ValueType*/ {
    public:
    // Nested type: Valve::VR::IVRRenderModels::_LoadRenderModel_Async
    class _LoadRenderModel_Async;
    // Nested type: Valve::VR::IVRRenderModels::_FreeRenderModel
    class _FreeRenderModel;
    // Nested type: Valve::VR::IVRRenderModels::_LoadTexture_Async
    class _LoadTexture_Async;
    // Nested type: Valve::VR::IVRRenderModels::_FreeTexture
    class _FreeTexture;
    // Nested type: Valve::VR::IVRRenderModels::_LoadTextureD3D11_Async
    class _LoadTextureD3D11_Async;
    // Nested type: Valve::VR::IVRRenderModels::_LoadIntoTextureD3D11_Async
    class _LoadIntoTextureD3D11_Async;
    // Nested type: Valve::VR::IVRRenderModels::_FreeTextureD3D11
    class _FreeTextureD3D11;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelName
    class _GetRenderModelName;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelCount
    class _GetRenderModelCount;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentCount
    class _GetComponentCount;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentName
    class _GetComponentName;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentButtonMask
    class _GetComponentButtonMask;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentRenderModelName
    class _GetComponentRenderModelName;
    // Nested type: Valve::VR::IVRRenderModels::_GetComponentState
    class _GetComponentState;
    // Nested type: Valve::VR::IVRRenderModels::_RenderModelHasComponent
    class _RenderModelHasComponent;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelThumbnailURL
    class _GetRenderModelThumbnailURL;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelOriginalPath
    class _GetRenderModelOriginalPath;
    // Nested type: Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum
    class _GetRenderModelErrorNameFromEnum;
    // Valve.VR.IVRRenderModels/Valve.VR._LoadRenderModel_Async LoadRenderModel_Async
    // Size: 0x8
    // Offset: 0x0
    Valve::VR::IVRRenderModels::_LoadRenderModel_Async* LoadRenderModel_Async;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_LoadRenderModel_Async*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._FreeRenderModel FreeRenderModel
    // Size: 0x8
    // Offset: 0x8
    Valve::VR::IVRRenderModels::_FreeRenderModel* FreeRenderModel;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_FreeRenderModel*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._LoadTexture_Async LoadTexture_Async
    // Size: 0x8
    // Offset: 0x10
    Valve::VR::IVRRenderModels::_LoadTexture_Async* LoadTexture_Async;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_LoadTexture_Async*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._FreeTexture FreeTexture
    // Size: 0x8
    // Offset: 0x18
    Valve::VR::IVRRenderModels::_FreeTexture* FreeTexture;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_FreeTexture*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._LoadTextureD3D11_Async LoadTextureD3D11_Async
    // Size: 0x8
    // Offset: 0x20
    Valve::VR::IVRRenderModels::_LoadTextureD3D11_Async* LoadTextureD3D11_Async;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_LoadTextureD3D11_Async*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._LoadIntoTextureD3D11_Async LoadIntoTextureD3D11_Async
    // Size: 0x8
    // Offset: 0x28
    Valve::VR::IVRRenderModels::_LoadIntoTextureD3D11_Async* LoadIntoTextureD3D11_Async;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_LoadIntoTextureD3D11_Async*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._FreeTextureD3D11 FreeTextureD3D11
    // Size: 0x8
    // Offset: 0x30
    Valve::VR::IVRRenderModels::_FreeTextureD3D11* FreeTextureD3D11;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_FreeTextureD3D11*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelName GetRenderModelName
    // Size: 0x8
    // Offset: 0x38
    Valve::VR::IVRRenderModels::_GetRenderModelName* GetRenderModelName;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetRenderModelName*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelCount GetRenderModelCount
    // Size: 0x8
    // Offset: 0x40
    Valve::VR::IVRRenderModels::_GetRenderModelCount* GetRenderModelCount;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetRenderModelCount*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetComponentCount GetComponentCount
    // Size: 0x8
    // Offset: 0x48
    Valve::VR::IVRRenderModels::_GetComponentCount* GetComponentCount;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetComponentCount*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetComponentName GetComponentName
    // Size: 0x8
    // Offset: 0x50
    Valve::VR::IVRRenderModels::_GetComponentName* GetComponentName;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetComponentName*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetComponentButtonMask GetComponentButtonMask
    // Size: 0x8
    // Offset: 0x58
    Valve::VR::IVRRenderModels::_GetComponentButtonMask* GetComponentButtonMask;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetComponentButtonMask*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetComponentRenderModelName GetComponentRenderModelName
    // Size: 0x8
    // Offset: 0x60
    Valve::VR::IVRRenderModels::_GetComponentRenderModelName* GetComponentRenderModelName;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetComponentRenderModelName*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetComponentState GetComponentState
    // Size: 0x8
    // Offset: 0x68
    Valve::VR::IVRRenderModels::_GetComponentState* GetComponentState;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetComponentState*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._RenderModelHasComponent RenderModelHasComponent
    // Size: 0x8
    // Offset: 0x70
    Valve::VR::IVRRenderModels::_RenderModelHasComponent* RenderModelHasComponent;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_RenderModelHasComponent*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelThumbnailURL GetRenderModelThumbnailURL
    // Size: 0x8
    // Offset: 0x78
    Valve::VR::IVRRenderModels::_GetRenderModelThumbnailURL* GetRenderModelThumbnailURL;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetRenderModelThumbnailURL*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelOriginalPath GetRenderModelOriginalPath
    // Size: 0x8
    // Offset: 0x80
    Valve::VR::IVRRenderModels::_GetRenderModelOriginalPath* GetRenderModelOriginalPath;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetRenderModelOriginalPath*) == 0x8);
    // Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelErrorNameFromEnum GetRenderModelErrorNameFromEnum
    // Size: 0x8
    // Offset: 0x88
    Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* GetRenderModelErrorNameFromEnum;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum*) == 0x8);
    // Creating value type constructor for type: IVRRenderModels
    constexpr IVRRenderModels(Valve::VR::IVRRenderModels::_LoadRenderModel_Async* LoadRenderModel_Async_ = {}, Valve::VR::IVRRenderModels::_FreeRenderModel* FreeRenderModel_ = {}, Valve::VR::IVRRenderModels::_LoadTexture_Async* LoadTexture_Async_ = {}, Valve::VR::IVRRenderModels::_FreeTexture* FreeTexture_ = {}, Valve::VR::IVRRenderModels::_LoadTextureD3D11_Async* LoadTextureD3D11_Async_ = {}, Valve::VR::IVRRenderModels::_LoadIntoTextureD3D11_Async* LoadIntoTextureD3D11_Async_ = {}, Valve::VR::IVRRenderModels::_FreeTextureD3D11* FreeTextureD3D11_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelName* GetRenderModelName_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelCount* GetRenderModelCount_ = {}, Valve::VR::IVRRenderModels::_GetComponentCount* GetComponentCount_ = {}, Valve::VR::IVRRenderModels::_GetComponentName* GetComponentName_ = {}, Valve::VR::IVRRenderModels::_GetComponentButtonMask* GetComponentButtonMask_ = {}, Valve::VR::IVRRenderModels::_GetComponentRenderModelName* GetComponentRenderModelName_ = {}, Valve::VR::IVRRenderModels::_GetComponentState* GetComponentState_ = {}, Valve::VR::IVRRenderModels::_RenderModelHasComponent* RenderModelHasComponent_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelThumbnailURL* GetRenderModelThumbnailURL_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelOriginalPath* GetRenderModelOriginalPath_ = {}, Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* GetRenderModelErrorNameFromEnum_ = {}) noexcept : LoadRenderModel_Async{LoadRenderModel_Async_}, FreeRenderModel{FreeRenderModel_}, LoadTexture_Async{LoadTexture_Async_}, FreeTexture{FreeTexture_}, LoadTextureD3D11_Async{LoadTextureD3D11_Async_}, LoadIntoTextureD3D11_Async{LoadIntoTextureD3D11_Async_}, FreeTextureD3D11{FreeTextureD3D11_}, GetRenderModelName{GetRenderModelName_}, GetRenderModelCount{GetRenderModelCount_}, GetComponentCount{GetComponentCount_}, GetComponentName{GetComponentName_}, GetComponentButtonMask{GetComponentButtonMask_}, GetComponentRenderModelName{GetComponentRenderModelName_}, GetComponentState{GetComponentState_}, RenderModelHasComponent{RenderModelHasComponent_}, GetRenderModelThumbnailURL{GetRenderModelThumbnailURL_}, GetRenderModelOriginalPath{GetRenderModelOriginalPath_}, GetRenderModelErrorNameFromEnum{GetRenderModelErrorNameFromEnum_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._LoadRenderModel_Async LoadRenderModel_Async
    Valve::VR::IVRRenderModels::_LoadRenderModel_Async* _get_LoadRenderModel_Async();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._LoadRenderModel_Async LoadRenderModel_Async
    void _set_LoadRenderModel_Async(Valve::VR::IVRRenderModels::_LoadRenderModel_Async* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._FreeRenderModel FreeRenderModel
    Valve::VR::IVRRenderModels::_FreeRenderModel* _get_FreeRenderModel();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._FreeRenderModel FreeRenderModel
    void _set_FreeRenderModel(Valve::VR::IVRRenderModels::_FreeRenderModel* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._LoadTexture_Async LoadTexture_Async
    Valve::VR::IVRRenderModels::_LoadTexture_Async* _get_LoadTexture_Async();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._LoadTexture_Async LoadTexture_Async
    void _set_LoadTexture_Async(Valve::VR::IVRRenderModels::_LoadTexture_Async* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._FreeTexture FreeTexture
    Valve::VR::IVRRenderModels::_FreeTexture* _get_FreeTexture();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._FreeTexture FreeTexture
    void _set_FreeTexture(Valve::VR::IVRRenderModels::_FreeTexture* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._LoadTextureD3D11_Async LoadTextureD3D11_Async
    Valve::VR::IVRRenderModels::_LoadTextureD3D11_Async* _get_LoadTextureD3D11_Async();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._LoadTextureD3D11_Async LoadTextureD3D11_Async
    void _set_LoadTextureD3D11_Async(Valve::VR::IVRRenderModels::_LoadTextureD3D11_Async* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._LoadIntoTextureD3D11_Async LoadIntoTextureD3D11_Async
    Valve::VR::IVRRenderModels::_LoadIntoTextureD3D11_Async* _get_LoadIntoTextureD3D11_Async();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._LoadIntoTextureD3D11_Async LoadIntoTextureD3D11_Async
    void _set_LoadIntoTextureD3D11_Async(Valve::VR::IVRRenderModels::_LoadIntoTextureD3D11_Async* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._FreeTextureD3D11 FreeTextureD3D11
    Valve::VR::IVRRenderModels::_FreeTextureD3D11* _get_FreeTextureD3D11();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._FreeTextureD3D11 FreeTextureD3D11
    void _set_FreeTextureD3D11(Valve::VR::IVRRenderModels::_FreeTextureD3D11* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelName GetRenderModelName
    Valve::VR::IVRRenderModels::_GetRenderModelName* _get_GetRenderModelName();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelName GetRenderModelName
    void _set_GetRenderModelName(Valve::VR::IVRRenderModels::_GetRenderModelName* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelCount GetRenderModelCount
    Valve::VR::IVRRenderModels::_GetRenderModelCount* _get_GetRenderModelCount();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelCount GetRenderModelCount
    void _set_GetRenderModelCount(Valve::VR::IVRRenderModels::_GetRenderModelCount* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentCount GetComponentCount
    Valve::VR::IVRRenderModels::_GetComponentCount* _get_GetComponentCount();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentCount GetComponentCount
    void _set_GetComponentCount(Valve::VR::IVRRenderModels::_GetComponentCount* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentName GetComponentName
    Valve::VR::IVRRenderModels::_GetComponentName* _get_GetComponentName();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentName GetComponentName
    void _set_GetComponentName(Valve::VR::IVRRenderModels::_GetComponentName* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentButtonMask GetComponentButtonMask
    Valve::VR::IVRRenderModels::_GetComponentButtonMask* _get_GetComponentButtonMask();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentButtonMask GetComponentButtonMask
    void _set_GetComponentButtonMask(Valve::VR::IVRRenderModels::_GetComponentButtonMask* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentRenderModelName GetComponentRenderModelName
    Valve::VR::IVRRenderModels::_GetComponentRenderModelName* _get_GetComponentRenderModelName();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentRenderModelName GetComponentRenderModelName
    void _set_GetComponentRenderModelName(Valve::VR::IVRRenderModels::_GetComponentRenderModelName* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentState GetComponentState
    Valve::VR::IVRRenderModels::_GetComponentState* _get_GetComponentState();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetComponentState GetComponentState
    void _set_GetComponentState(Valve::VR::IVRRenderModels::_GetComponentState* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._RenderModelHasComponent RenderModelHasComponent
    Valve::VR::IVRRenderModels::_RenderModelHasComponent* _get_RenderModelHasComponent();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._RenderModelHasComponent RenderModelHasComponent
    void _set_RenderModelHasComponent(Valve::VR::IVRRenderModels::_RenderModelHasComponent* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelThumbnailURL GetRenderModelThumbnailURL
    Valve::VR::IVRRenderModels::_GetRenderModelThumbnailURL* _get_GetRenderModelThumbnailURL();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelThumbnailURL GetRenderModelThumbnailURL
    void _set_GetRenderModelThumbnailURL(Valve::VR::IVRRenderModels::_GetRenderModelThumbnailURL* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelOriginalPath GetRenderModelOriginalPath
    Valve::VR::IVRRenderModels::_GetRenderModelOriginalPath* _get_GetRenderModelOriginalPath();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelOriginalPath GetRenderModelOriginalPath
    void _set_GetRenderModelOriginalPath(Valve::VR::IVRRenderModels::_GetRenderModelOriginalPath* value);
    // Get instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelErrorNameFromEnum GetRenderModelErrorNameFromEnum
    Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* _get_GetRenderModelErrorNameFromEnum();
    // Set instance field: Valve.VR.IVRRenderModels/Valve.VR._GetRenderModelErrorNameFromEnum GetRenderModelErrorNameFromEnum
    void _set_GetRenderModelErrorNameFromEnum(Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* value);
  }; // Valve.VR.IVRRenderModels
  #pragma pack(pop)
  static check_size<sizeof(IVRRenderModels), 136 + sizeof(Valve::VR::IVRRenderModels::_GetRenderModelErrorNameFromEnum*)> __Valve_VR_IVRRenderModelsSizeCheck;
  static_assert(sizeof(IVRRenderModels) == 0x90);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRRenderModels, "Valve.VR", "IVRRenderModels");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
