// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Autogenerated type: Valve.VR.IVRSettings
  struct IVRSettings : public System::ValueType {
    public:
    // Nested type: Valve::VR::IVRSettings::_GetSettingsErrorNameFromEnum
    class _GetSettingsErrorNameFromEnum;
    // Nested type: Valve::VR::IVRSettings::_Sync
    class _Sync;
    // Nested type: Valve::VR::IVRSettings::_SetBool
    class _SetBool;
    // Nested type: Valve::VR::IVRSettings::_SetInt32
    class _SetInt32;
    // Nested type: Valve::VR::IVRSettings::_SetFloat
    class _SetFloat;
    // Nested type: Valve::VR::IVRSettings::_SetString
    class _SetString;
    // Nested type: Valve::VR::IVRSettings::_GetBool
    class _GetBool;
    // Nested type: Valve::VR::IVRSettings::_GetInt32
    class _GetInt32;
    // Nested type: Valve::VR::IVRSettings::_GetFloat
    class _GetFloat;
    // Nested type: Valve::VR::IVRSettings::_GetString
    class _GetString;
    // Nested type: Valve::VR::IVRSettings::_RemoveSection
    class _RemoveSection;
    // Nested type: Valve::VR::IVRSettings::_RemoveKeyInSection
    class _RemoveKeyInSection;
    // Valve.VR.IVRSettings/_GetSettingsErrorNameFromEnum GetSettingsErrorNameFromEnum
    // Offset: 0x0
    Valve::VR::IVRSettings::_GetSettingsErrorNameFromEnum* GetSettingsErrorNameFromEnum;
    // Valve.VR.IVRSettings/_Sync Sync
    // Offset: 0x8
    Valve::VR::IVRSettings::_Sync* Sync;
    // Valve.VR.IVRSettings/_SetBool SetBool
    // Offset: 0x10
    Valve::VR::IVRSettings::_SetBool* SetBool;
    // Valve.VR.IVRSettings/_SetInt32 SetInt32
    // Offset: 0x18
    Valve::VR::IVRSettings::_SetInt32* SetInt32;
    // Valve.VR.IVRSettings/_SetFloat SetFloat
    // Offset: 0x20
    Valve::VR::IVRSettings::_SetFloat* SetFloat;
    // Valve.VR.IVRSettings/_SetString SetString
    // Offset: 0x28
    Valve::VR::IVRSettings::_SetString* SetString;
    // Valve.VR.IVRSettings/_GetBool GetBool
    // Offset: 0x30
    Valve::VR::IVRSettings::_GetBool* GetBool;
    // Valve.VR.IVRSettings/_GetInt32 GetInt32
    // Offset: 0x38
    Valve::VR::IVRSettings::_GetInt32* GetInt32;
    // Valve.VR.IVRSettings/_GetFloat GetFloat
    // Offset: 0x40
    Valve::VR::IVRSettings::_GetFloat* GetFloat;
    // Valve.VR.IVRSettings/_GetString GetString
    // Offset: 0x48
    Valve::VR::IVRSettings::_GetString* GetString;
    // Valve.VR.IVRSettings/_RemoveSection RemoveSection
    // Offset: 0x50
    Valve::VR::IVRSettings::_RemoveSection* RemoveSection;
    // Valve.VR.IVRSettings/_RemoveKeyInSection RemoveKeyInSection
    // Offset: 0x58
    Valve::VR::IVRSettings::_RemoveKeyInSection* RemoveKeyInSection;
    // Creating value type constructor for type: IVRSettings
    constexpr IVRSettings(Valve::VR::IVRSettings::_GetSettingsErrorNameFromEnum* GetSettingsErrorNameFromEnum_ = {}, Valve::VR::IVRSettings::_Sync* Sync_ = {}, Valve::VR::IVRSettings::_SetBool* SetBool_ = {}, Valve::VR::IVRSettings::_SetInt32* SetInt32_ = {}, Valve::VR::IVRSettings::_SetFloat* SetFloat_ = {}, Valve::VR::IVRSettings::_SetString* SetString_ = {}, Valve::VR::IVRSettings::_GetBool* GetBool_ = {}, Valve::VR::IVRSettings::_GetInt32* GetInt32_ = {}, Valve::VR::IVRSettings::_GetFloat* GetFloat_ = {}, Valve::VR::IVRSettings::_GetString* GetString_ = {}, Valve::VR::IVRSettings::_RemoveSection* RemoveSection_ = {}, Valve::VR::IVRSettings::_RemoveKeyInSection* RemoveKeyInSection_ = {}) noexcept : GetSettingsErrorNameFromEnum{GetSettingsErrorNameFromEnum_}, Sync{Sync_}, SetBool{SetBool_}, SetInt32{SetInt32_}, SetFloat{SetFloat_}, SetString{SetString_}, GetBool{GetBool_}, GetInt32{GetInt32_}, GetFloat{GetFloat_}, GetString{GetString_}, RemoveSection{RemoveSection_}, RemoveKeyInSection{RemoveKeyInSection_} {}
  }; // Valve.VR.IVRSettings
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRSettings, "Valve.VR", "IVRSettings");
#pragma pack(pop)
