// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0x38
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.IVRScreenshots
  struct IVRScreenshots/*, public System::ValueType*/ {
    public:
    // Nested type: Valve::VR::IVRScreenshots::_RequestScreenshot
    class _RequestScreenshot;
    // Nested type: Valve::VR::IVRScreenshots::_HookScreenshot
    class _HookScreenshot;
    // Nested type: Valve::VR::IVRScreenshots::_GetScreenshotPropertyType
    class _GetScreenshotPropertyType;
    // Nested type: Valve::VR::IVRScreenshots::_GetScreenshotPropertyFilename
    class _GetScreenshotPropertyFilename;
    // Nested type: Valve::VR::IVRScreenshots::_UpdateScreenshotProgress
    class _UpdateScreenshotProgress;
    // Nested type: Valve::VR::IVRScreenshots::_TakeStereoScreenshot
    class _TakeStereoScreenshot;
    // Nested type: Valve::VR::IVRScreenshots::_SubmitScreenshot
    class _SubmitScreenshot;
    // Valve.VR.IVRScreenshots/_RequestScreenshot RequestScreenshot
    // Size: 0x8
    // Offset: 0x0
    Valve::VR::IVRScreenshots::_RequestScreenshot* RequestScreenshot;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRScreenshots::_RequestScreenshot*) == 0x8);
    // Valve.VR.IVRScreenshots/_HookScreenshot HookScreenshot
    // Size: 0x8
    // Offset: 0x8
    Valve::VR::IVRScreenshots::_HookScreenshot* HookScreenshot;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRScreenshots::_HookScreenshot*) == 0x8);
    // Valve.VR.IVRScreenshots/_GetScreenshotPropertyType GetScreenshotPropertyType
    // Size: 0x8
    // Offset: 0x10
    Valve::VR::IVRScreenshots::_GetScreenshotPropertyType* GetScreenshotPropertyType;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRScreenshots::_GetScreenshotPropertyType*) == 0x8);
    // Valve.VR.IVRScreenshots/_GetScreenshotPropertyFilename GetScreenshotPropertyFilename
    // Size: 0x8
    // Offset: 0x18
    Valve::VR::IVRScreenshots::_GetScreenshotPropertyFilename* GetScreenshotPropertyFilename;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRScreenshots::_GetScreenshotPropertyFilename*) == 0x8);
    // Valve.VR.IVRScreenshots/_UpdateScreenshotProgress UpdateScreenshotProgress
    // Size: 0x8
    // Offset: 0x20
    Valve::VR::IVRScreenshots::_UpdateScreenshotProgress* UpdateScreenshotProgress;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRScreenshots::_UpdateScreenshotProgress*) == 0x8);
    // Valve.VR.IVRScreenshots/_TakeStereoScreenshot TakeStereoScreenshot
    // Size: 0x8
    // Offset: 0x28
    Valve::VR::IVRScreenshots::_TakeStereoScreenshot* TakeStereoScreenshot;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRScreenshots::_TakeStereoScreenshot*) == 0x8);
    // Valve.VR.IVRScreenshots/_SubmitScreenshot SubmitScreenshot
    // Size: 0x8
    // Offset: 0x30
    Valve::VR::IVRScreenshots::_SubmitScreenshot* SubmitScreenshot;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRScreenshots::_SubmitScreenshot*) == 0x8);
    // Creating value type constructor for type: IVRScreenshots
    constexpr IVRScreenshots(Valve::VR::IVRScreenshots::_RequestScreenshot* RequestScreenshot_ = {}, Valve::VR::IVRScreenshots::_HookScreenshot* HookScreenshot_ = {}, Valve::VR::IVRScreenshots::_GetScreenshotPropertyType* GetScreenshotPropertyType_ = {}, Valve::VR::IVRScreenshots::_GetScreenshotPropertyFilename* GetScreenshotPropertyFilename_ = {}, Valve::VR::IVRScreenshots::_UpdateScreenshotProgress* UpdateScreenshotProgress_ = {}, Valve::VR::IVRScreenshots::_TakeStereoScreenshot* TakeStereoScreenshot_ = {}, Valve::VR::IVRScreenshots::_SubmitScreenshot* SubmitScreenshot_ = {}) noexcept : RequestScreenshot{RequestScreenshot_}, HookScreenshot{HookScreenshot_}, GetScreenshotPropertyType{GetScreenshotPropertyType_}, GetScreenshotPropertyFilename{GetScreenshotPropertyFilename_}, UpdateScreenshotProgress{UpdateScreenshotProgress_}, TakeStereoScreenshot{TakeStereoScreenshot_}, SubmitScreenshot{SubmitScreenshot_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
  }; // Valve.VR.IVRScreenshots
  #pragma pack(pop)
  static check_size<sizeof(IVRScreenshots), 48 + sizeof(Valve::VR::IVRScreenshots::_SubmitScreenshot*)> __Valve_VR_IVRScreenshotsSizeCheck;
  static_assert(sizeof(IVRScreenshots) == 0x38);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRScreenshots, "Valve.VR", "IVRScreenshots");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
