// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0x60
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.IVRSettings
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRSettings/*, public System::ValueType*/ {
    public:
    // Nested type: Valve::VR::IVRSettings::_GetSettingsErrorNameFromEnum
    class _GetSettingsErrorNameFromEnum;
    // Nested type: Valve::VR::IVRSettings::_Sync
    class _Sync;
    // Nested type: Valve::VR::IVRSettings::_SetBool
    class _SetBool;
    // Nested type: Valve::VR::IVRSettings::_SetInt32
    class _SetInt32;
    // Nested type: Valve::VR::IVRSettings::_SetFloat
    class _SetFloat;
    // Nested type: Valve::VR::IVRSettings::_SetString
    class _SetString;
    // Nested type: Valve::VR::IVRSettings::_GetBool
    class _GetBool;
    // Nested type: Valve::VR::IVRSettings::_GetInt32
    class _GetInt32;
    // Nested type: Valve::VR::IVRSettings::_GetFloat
    class _GetFloat;
    // Nested type: Valve::VR::IVRSettings::_GetString
    class _GetString;
    // Nested type: Valve::VR::IVRSettings::_RemoveSection
    class _RemoveSection;
    // Nested type: Valve::VR::IVRSettings::_RemoveKeyInSection
    class _RemoveKeyInSection;
    // Valve.VR.IVRSettings/Valve.VR._GetSettingsErrorNameFromEnum GetSettingsErrorNameFromEnum
    // Size: 0x8
    // Offset: 0x0
    Valve::VR::IVRSettings::_GetSettingsErrorNameFromEnum* GetSettingsErrorNameFromEnum;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_GetSettingsErrorNameFromEnum*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._Sync Sync
    // Size: 0x8
    // Offset: 0x8
    Valve::VR::IVRSettings::_Sync* Sync;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_Sync*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._SetBool SetBool
    // Size: 0x8
    // Offset: 0x10
    Valve::VR::IVRSettings::_SetBool* SetBool;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_SetBool*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._SetInt32 SetInt32
    // Size: 0x8
    // Offset: 0x18
    Valve::VR::IVRSettings::_SetInt32* SetInt32;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_SetInt32*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._SetFloat SetFloat
    // Size: 0x8
    // Offset: 0x20
    Valve::VR::IVRSettings::_SetFloat* SetFloat;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_SetFloat*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._SetString SetString
    // Size: 0x8
    // Offset: 0x28
    Valve::VR::IVRSettings::_SetString* SetString;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_SetString*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._GetBool GetBool
    // Size: 0x8
    // Offset: 0x30
    Valve::VR::IVRSettings::_GetBool* GetBool;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_GetBool*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._GetInt32 GetInt32
    // Size: 0x8
    // Offset: 0x38
    Valve::VR::IVRSettings::_GetInt32* GetInt32;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_GetInt32*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._GetFloat GetFloat
    // Size: 0x8
    // Offset: 0x40
    Valve::VR::IVRSettings::_GetFloat* GetFloat;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_GetFloat*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._GetString GetString
    // Size: 0x8
    // Offset: 0x48
    Valve::VR::IVRSettings::_GetString* GetString;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_GetString*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._RemoveSection RemoveSection
    // Size: 0x8
    // Offset: 0x50
    Valve::VR::IVRSettings::_RemoveSection* RemoveSection;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_RemoveSection*) == 0x8);
    // Valve.VR.IVRSettings/Valve.VR._RemoveKeyInSection RemoveKeyInSection
    // Size: 0x8
    // Offset: 0x58
    Valve::VR::IVRSettings::_RemoveKeyInSection* RemoveKeyInSection;
    // Field size check
    static_assert(sizeof(Valve::VR::IVRSettings::_RemoveKeyInSection*) == 0x8);
    // Creating value type constructor for type: IVRSettings
    constexpr IVRSettings(Valve::VR::IVRSettings::_GetSettingsErrorNameFromEnum* GetSettingsErrorNameFromEnum_ = {}, Valve::VR::IVRSettings::_Sync* Sync_ = {}, Valve::VR::IVRSettings::_SetBool* SetBool_ = {}, Valve::VR::IVRSettings::_SetInt32* SetInt32_ = {}, Valve::VR::IVRSettings::_SetFloat* SetFloat_ = {}, Valve::VR::IVRSettings::_SetString* SetString_ = {}, Valve::VR::IVRSettings::_GetBool* GetBool_ = {}, Valve::VR::IVRSettings::_GetInt32* GetInt32_ = {}, Valve::VR::IVRSettings::_GetFloat* GetFloat_ = {}, Valve::VR::IVRSettings::_GetString* GetString_ = {}, Valve::VR::IVRSettings::_RemoveSection* RemoveSection_ = {}, Valve::VR::IVRSettings::_RemoveKeyInSection* RemoveKeyInSection_ = {}) noexcept : GetSettingsErrorNameFromEnum{GetSettingsErrorNameFromEnum_}, Sync{Sync_}, SetBool{SetBool_}, SetInt32{SetInt32_}, SetFloat{SetFloat_}, SetString{SetString_}, GetBool{GetBool_}, GetInt32{GetInt32_}, GetFloat{GetFloat_}, GetString{GetString_}, RemoveSection{RemoveSection_}, RemoveKeyInSection{RemoveKeyInSection_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._GetSettingsErrorNameFromEnum GetSettingsErrorNameFromEnum
    Valve::VR::IVRSettings::_GetSettingsErrorNameFromEnum* _get_GetSettingsErrorNameFromEnum();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._GetSettingsErrorNameFromEnum GetSettingsErrorNameFromEnum
    void _set_GetSettingsErrorNameFromEnum(Valve::VR::IVRSettings::_GetSettingsErrorNameFromEnum* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._Sync Sync
    Valve::VR::IVRSettings::_Sync* _get_Sync();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._Sync Sync
    void _set_Sync(Valve::VR::IVRSettings::_Sync* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._SetBool SetBool
    Valve::VR::IVRSettings::_SetBool* _get_SetBool();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._SetBool SetBool
    void _set_SetBool(Valve::VR::IVRSettings::_SetBool* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._SetInt32 SetInt32
    Valve::VR::IVRSettings::_SetInt32* _get_SetInt32();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._SetInt32 SetInt32
    void _set_SetInt32(Valve::VR::IVRSettings::_SetInt32* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._SetFloat SetFloat
    Valve::VR::IVRSettings::_SetFloat* _get_SetFloat();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._SetFloat SetFloat
    void _set_SetFloat(Valve::VR::IVRSettings::_SetFloat* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._SetString SetString
    Valve::VR::IVRSettings::_SetString* _get_SetString();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._SetString SetString
    void _set_SetString(Valve::VR::IVRSettings::_SetString* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._GetBool GetBool
    Valve::VR::IVRSettings::_GetBool* _get_GetBool();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._GetBool GetBool
    void _set_GetBool(Valve::VR::IVRSettings::_GetBool* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._GetInt32 GetInt32
    Valve::VR::IVRSettings::_GetInt32* _get_GetInt32();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._GetInt32 GetInt32
    void _set_GetInt32(Valve::VR::IVRSettings::_GetInt32* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._GetFloat GetFloat
    Valve::VR::IVRSettings::_GetFloat* _get_GetFloat();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._GetFloat GetFloat
    void _set_GetFloat(Valve::VR::IVRSettings::_GetFloat* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._GetString GetString
    Valve::VR::IVRSettings::_GetString* _get_GetString();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._GetString GetString
    void _set_GetString(Valve::VR::IVRSettings::_GetString* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._RemoveSection RemoveSection
    Valve::VR::IVRSettings::_RemoveSection* _get_RemoveSection();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._RemoveSection RemoveSection
    void _set_RemoveSection(Valve::VR::IVRSettings::_RemoveSection* value);
    // Get instance field: Valve.VR.IVRSettings/Valve.VR._RemoveKeyInSection RemoveKeyInSection
    Valve::VR::IVRSettings::_RemoveKeyInSection* _get_RemoveKeyInSection();
    // Set instance field: Valve.VR.IVRSettings/Valve.VR._RemoveKeyInSection RemoveKeyInSection
    void _set_RemoveKeyInSection(Valve::VR::IVRSettings::_RemoveKeyInSection* value);
  }; // Valve.VR.IVRSettings
  #pragma pack(pop)
  static check_size<sizeof(IVRSettings), 88 + sizeof(Valve::VR::IVRSettings::_RemoveKeyInSection*)> __Valve_VR_IVRSettingsSizeCheck;
  static_assert(sizeof(IVRSettings) == 0x60);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRSettings, "Valve.VR", "IVRSettings");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
