// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Autogenerated type: Valve.VR.IVRTrackedCamera
  struct IVRTrackedCamera : public System::ValueType {
    public:
    // Nested type: Valve::VR::IVRTrackedCamera::_GetCameraErrorNameFromEnum
    class _GetCameraErrorNameFromEnum;
    // Nested type: Valve::VR::IVRTrackedCamera::_HasCamera
    class _HasCamera;
    // Nested type: Valve::VR::IVRTrackedCamera::_GetCameraFrameSize
    class _GetCameraFrameSize;
    // Nested type: Valve::VR::IVRTrackedCamera::_GetCameraIntrinsics
    class _GetCameraIntrinsics;
    // Nested type: Valve::VR::IVRTrackedCamera::_GetCameraProjection
    class _GetCameraProjection;
    // Nested type: Valve::VR::IVRTrackedCamera::_AcquireVideoStreamingService
    class _AcquireVideoStreamingService;
    // Nested type: Valve::VR::IVRTrackedCamera::_ReleaseVideoStreamingService
    class _ReleaseVideoStreamingService;
    // Nested type: Valve::VR::IVRTrackedCamera::_GetVideoStreamFrameBuffer
    class _GetVideoStreamFrameBuffer;
    // Nested type: Valve::VR::IVRTrackedCamera::_GetVideoStreamTextureSize
    class _GetVideoStreamTextureSize;
    // Nested type: Valve::VR::IVRTrackedCamera::_GetVideoStreamTextureD3D11
    class _GetVideoStreamTextureD3D11;
    // Nested type: Valve::VR::IVRTrackedCamera::_GetVideoStreamTextureGL
    class _GetVideoStreamTextureGL;
    // Nested type: Valve::VR::IVRTrackedCamera::_ReleaseVideoStreamTextureGL
    class _ReleaseVideoStreamTextureGL;
    // Valve.VR.IVRTrackedCamera/_GetCameraErrorNameFromEnum GetCameraErrorNameFromEnum
    // Offset: 0x0
    Valve::VR::IVRTrackedCamera::_GetCameraErrorNameFromEnum* GetCameraErrorNameFromEnum;
    // Valve.VR.IVRTrackedCamera/_HasCamera HasCamera
    // Offset: 0x8
    Valve::VR::IVRTrackedCamera::_HasCamera* HasCamera;
    // Valve.VR.IVRTrackedCamera/_GetCameraFrameSize GetCameraFrameSize
    // Offset: 0x10
    Valve::VR::IVRTrackedCamera::_GetCameraFrameSize* GetCameraFrameSize;
    // Valve.VR.IVRTrackedCamera/_GetCameraIntrinsics GetCameraIntrinsics
    // Offset: 0x18
    Valve::VR::IVRTrackedCamera::_GetCameraIntrinsics* GetCameraIntrinsics;
    // Valve.VR.IVRTrackedCamera/_GetCameraProjection GetCameraProjection
    // Offset: 0x20
    Valve::VR::IVRTrackedCamera::_GetCameraProjection* GetCameraProjection;
    // Valve.VR.IVRTrackedCamera/_AcquireVideoStreamingService AcquireVideoStreamingService
    // Offset: 0x28
    Valve::VR::IVRTrackedCamera::_AcquireVideoStreamingService* AcquireVideoStreamingService;
    // Valve.VR.IVRTrackedCamera/_ReleaseVideoStreamingService ReleaseVideoStreamingService
    // Offset: 0x30
    Valve::VR::IVRTrackedCamera::_ReleaseVideoStreamingService* ReleaseVideoStreamingService;
    // Valve.VR.IVRTrackedCamera/_GetVideoStreamFrameBuffer GetVideoStreamFrameBuffer
    // Offset: 0x38
    Valve::VR::IVRTrackedCamera::_GetVideoStreamFrameBuffer* GetVideoStreamFrameBuffer;
    // Valve.VR.IVRTrackedCamera/_GetVideoStreamTextureSize GetVideoStreamTextureSize
    // Offset: 0x40
    Valve::VR::IVRTrackedCamera::_GetVideoStreamTextureSize* GetVideoStreamTextureSize;
    // Valve.VR.IVRTrackedCamera/_GetVideoStreamTextureD3D11 GetVideoStreamTextureD3D11
    // Offset: 0x48
    Valve::VR::IVRTrackedCamera::_GetVideoStreamTextureD3D11* GetVideoStreamTextureD3D11;
    // Valve.VR.IVRTrackedCamera/_GetVideoStreamTextureGL GetVideoStreamTextureGL
    // Offset: 0x50
    Valve::VR::IVRTrackedCamera::_GetVideoStreamTextureGL* GetVideoStreamTextureGL;
    // Valve.VR.IVRTrackedCamera/_ReleaseVideoStreamTextureGL ReleaseVideoStreamTextureGL
    // Offset: 0x58
    Valve::VR::IVRTrackedCamera::_ReleaseVideoStreamTextureGL* ReleaseVideoStreamTextureGL;
    // Creating value type constructor for type: IVRTrackedCamera
    constexpr IVRTrackedCamera(Valve::VR::IVRTrackedCamera::_GetCameraErrorNameFromEnum* GetCameraErrorNameFromEnum_ = {}, Valve::VR::IVRTrackedCamera::_HasCamera* HasCamera_ = {}, Valve::VR::IVRTrackedCamera::_GetCameraFrameSize* GetCameraFrameSize_ = {}, Valve::VR::IVRTrackedCamera::_GetCameraIntrinsics* GetCameraIntrinsics_ = {}, Valve::VR::IVRTrackedCamera::_GetCameraProjection* GetCameraProjection_ = {}, Valve::VR::IVRTrackedCamera::_AcquireVideoStreamingService* AcquireVideoStreamingService_ = {}, Valve::VR::IVRTrackedCamera::_ReleaseVideoStreamingService* ReleaseVideoStreamingService_ = {}, Valve::VR::IVRTrackedCamera::_GetVideoStreamFrameBuffer* GetVideoStreamFrameBuffer_ = {}, Valve::VR::IVRTrackedCamera::_GetVideoStreamTextureSize* GetVideoStreamTextureSize_ = {}, Valve::VR::IVRTrackedCamera::_GetVideoStreamTextureD3D11* GetVideoStreamTextureD3D11_ = {}, Valve::VR::IVRTrackedCamera::_GetVideoStreamTextureGL* GetVideoStreamTextureGL_ = {}, Valve::VR::IVRTrackedCamera::_ReleaseVideoStreamTextureGL* ReleaseVideoStreamTextureGL_ = {}) noexcept : GetCameraErrorNameFromEnum{GetCameraErrorNameFromEnum_}, HasCamera{HasCamera_}, GetCameraFrameSize{GetCameraFrameSize_}, GetCameraIntrinsics{GetCameraIntrinsics_}, GetCameraProjection{GetCameraProjection_}, AcquireVideoStreamingService{AcquireVideoStreamingService_}, ReleaseVideoStreamingService{ReleaseVideoStreamingService_}, GetVideoStreamFrameBuffer{GetVideoStreamFrameBuffer_}, GetVideoStreamTextureSize{GetVideoStreamTextureSize_}, GetVideoStreamTextureD3D11{GetVideoStreamTextureD3D11_}, GetVideoStreamTextureGL{GetVideoStreamTextureGL_}, ReleaseVideoStreamTextureGL{ReleaseVideoStreamTextureGL_} {}
  }; // Valve.VR.IVRTrackedCamera
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::IVRTrackedCamera, "Valve.VR", "IVRTrackedCamera");
#pragma pack(pop)
