// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Valve.VR.OpenVR
#include "Valve/VR/OpenVR.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
  // Forward declaring type: CVRSystem
  class CVRSystem;
  // Forward declaring type: CVRChaperone
  class CVRChaperone;
  // Forward declaring type: CVRChaperoneSetup
  class CVRChaperoneSetup;
  // Forward declaring type: CVRCompositor
  class CVRCompositor;
  // Forward declaring type: CVROverlay
  class CVROverlay;
  // Forward declaring type: CVRRenderModels
  class CVRRenderModels;
  // Forward declaring type: CVRExtendedDisplay
  class CVRExtendedDisplay;
  // Forward declaring type: CVRSettings
  class CVRSettings;
  // Forward declaring type: CVRApplications
  class CVRApplications;
  // Forward declaring type: CVRScreenshots
  class CVRScreenshots;
  // Forward declaring type: CVRTrackedCamera
  class CVRTrackedCamera;
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: Valve.VR.OpenVR/COpenVRContext
  // [] Offset: FFFFFFFF
  class OpenVR::COpenVRContext : public ::Il2CppObject {
    public:
    // private Valve.VR.CVRSystem m_pVRSystem
    // Size: 0x8
    // Offset: 0x10
    Valve::VR::CVRSystem* m_pVRSystem;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRSystem*) == 0x8);
    // private Valve.VR.CVRChaperone m_pVRChaperone
    // Size: 0x8
    // Offset: 0x18
    Valve::VR::CVRChaperone* m_pVRChaperone;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRChaperone*) == 0x8);
    // private Valve.VR.CVRChaperoneSetup m_pVRChaperoneSetup
    // Size: 0x8
    // Offset: 0x20
    Valve::VR::CVRChaperoneSetup* m_pVRChaperoneSetup;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRChaperoneSetup*) == 0x8);
    // private Valve.VR.CVRCompositor m_pVRCompositor
    // Size: 0x8
    // Offset: 0x28
    Valve::VR::CVRCompositor* m_pVRCompositor;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRCompositor*) == 0x8);
    // private Valve.VR.CVROverlay m_pVROverlay
    // Size: 0x8
    // Offset: 0x30
    Valve::VR::CVROverlay* m_pVROverlay;
    // Field size check
    static_assert(sizeof(Valve::VR::CVROverlay*) == 0x8);
    // private Valve.VR.CVRRenderModels m_pVRRenderModels
    // Size: 0x8
    // Offset: 0x38
    Valve::VR::CVRRenderModels* m_pVRRenderModels;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRRenderModels*) == 0x8);
    // private Valve.VR.CVRExtendedDisplay m_pVRExtendedDisplay
    // Size: 0x8
    // Offset: 0x40
    Valve::VR::CVRExtendedDisplay* m_pVRExtendedDisplay;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRExtendedDisplay*) == 0x8);
    // private Valve.VR.CVRSettings m_pVRSettings
    // Size: 0x8
    // Offset: 0x48
    Valve::VR::CVRSettings* m_pVRSettings;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRSettings*) == 0x8);
    // private Valve.VR.CVRApplications m_pVRApplications
    // Size: 0x8
    // Offset: 0x50
    Valve::VR::CVRApplications* m_pVRApplications;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRApplications*) == 0x8);
    // private Valve.VR.CVRScreenshots m_pVRScreenshots
    // Size: 0x8
    // Offset: 0x58
    Valve::VR::CVRScreenshots* m_pVRScreenshots;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRScreenshots*) == 0x8);
    // private Valve.VR.CVRTrackedCamera m_pVRTrackedCamera
    // Size: 0x8
    // Offset: 0x60
    Valve::VR::CVRTrackedCamera* m_pVRTrackedCamera;
    // Field size check
    static_assert(sizeof(Valve::VR::CVRTrackedCamera*) == 0x8);
    // Creating value type constructor for type: COpenVRContext
    COpenVRContext(Valve::VR::CVRSystem* m_pVRSystem_ = {}, Valve::VR::CVRChaperone* m_pVRChaperone_ = {}, Valve::VR::CVRChaperoneSetup* m_pVRChaperoneSetup_ = {}, Valve::VR::CVRCompositor* m_pVRCompositor_ = {}, Valve::VR::CVROverlay* m_pVROverlay_ = {}, Valve::VR::CVRRenderModels* m_pVRRenderModels_ = {}, Valve::VR::CVRExtendedDisplay* m_pVRExtendedDisplay_ = {}, Valve::VR::CVRSettings* m_pVRSettings_ = {}, Valve::VR::CVRApplications* m_pVRApplications_ = {}, Valve::VR::CVRScreenshots* m_pVRScreenshots_ = {}, Valve::VR::CVRTrackedCamera* m_pVRTrackedCamera_ = {}) noexcept : m_pVRSystem{m_pVRSystem_}, m_pVRChaperone{m_pVRChaperone_}, m_pVRChaperoneSetup{m_pVRChaperoneSetup_}, m_pVRCompositor{m_pVRCompositor_}, m_pVROverlay{m_pVROverlay_}, m_pVRRenderModels{m_pVRRenderModels_}, m_pVRExtendedDisplay{m_pVRExtendedDisplay_}, m_pVRSettings{m_pVRSettings_}, m_pVRApplications{m_pVRApplications_}, m_pVRScreenshots{m_pVRScreenshots_}, m_pVRTrackedCamera{m_pVRTrackedCamera_} {}
    // public System.Void Clear()
    // Offset: 0x22728B0
    void Clear();
    // private System.Void CheckClear()
    // Offset: 0x22729DC
    void CheckClear();
    // public Valve.VR.CVRSystem VRSystem()
    // Offset: 0x2271ADC
    Valve::VR::CVRSystem* VRSystem();
    // public Valve.VR.CVRChaperone VRChaperone()
    // Offset: 0x2271C08
    Valve::VR::CVRChaperone* VRChaperone();
    // public Valve.VR.CVRChaperoneSetup VRChaperoneSetup()
    // Offset: 0x2271D34
    Valve::VR::CVRChaperoneSetup* VRChaperoneSetup();
    // public Valve.VR.CVRCompositor VRCompositor()
    // Offset: 0x2271E60
    Valve::VR::CVRCompositor* VRCompositor();
    // public Valve.VR.CVROverlay VROverlay()
    // Offset: 0x2271F8C
    Valve::VR::CVROverlay* VROverlay();
    // public Valve.VR.CVRRenderModels VRRenderModels()
    // Offset: 0x22720B8
    Valve::VR::CVRRenderModels* VRRenderModels();
    // public Valve.VR.CVRExtendedDisplay VRExtendedDisplay()
    // Offset: 0x22721E4
    Valve::VR::CVRExtendedDisplay* VRExtendedDisplay();
    // public Valve.VR.CVRSettings VRSettings()
    // Offset: 0x2272310
    Valve::VR::CVRSettings* VRSettings();
    // public Valve.VR.CVRApplications VRApplications()
    // Offset: 0x227243C
    Valve::VR::CVRApplications* VRApplications();
    // public Valve.VR.CVRScreenshots VRScreenshots()
    // Offset: 0x2272568
    Valve::VR::CVRScreenshots* VRScreenshots();
    // public Valve.VR.CVRTrackedCamera VRTrackedCamera()
    // Offset: 0x2272694
    Valve::VR::CVRTrackedCamera* VRTrackedCamera();
    // public System.Void .ctor()
    // Offset: 0x2271A4C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OpenVR::COpenVRContext* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("Valve::VR::OpenVR::COpenVRContext::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OpenVR::COpenVRContext*, creationType>()));
    }
  }; // Valve.VR.OpenVR/COpenVRContext
  #pragma pack(pop)
  static check_size<sizeof(OpenVR::COpenVRContext), 96 + sizeof(Valve::VR::CVRTrackedCamera*)> __Valve_VR_OpenVR_COpenVRContextSizeCheck;
  static_assert(sizeof(OpenVR::COpenVRContext) == 0x68);
}
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::OpenVR::COpenVRContext*, "Valve.VR", "OpenVR/COpenVRContext");
