// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include <stdint.h>
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Valve.VR.VRControllerAxis_t
#include "Valve/VR/VRControllerAxis_t.hpp"
// Completed includes
// Type namespace: Valve.VR
namespace Valve::VR {
  // Autogenerated type: Valve.VR.VRControllerState_t
  struct VRControllerState_t : public System::ValueType {
    public:
    // public System.UInt32 unPacketNum
    // Offset: 0x0
    uint unPacketNum;
    // public System.UInt64 ulButtonPressed
    // Offset: 0x8
    uint64_t ulButtonPressed;
    // public System.UInt64 ulButtonTouched
    // Offset: 0x10
    uint64_t ulButtonTouched;
    // public Valve.VR.VRControllerAxis_t rAxis0
    // Offset: 0x18
    Valve::VR::VRControllerAxis_t rAxis0;
    // public Valve.VR.VRControllerAxis_t rAxis1
    // Offset: 0x20
    Valve::VR::VRControllerAxis_t rAxis1;
    // public Valve.VR.VRControllerAxis_t rAxis2
    // Offset: 0x28
    Valve::VR::VRControllerAxis_t rAxis2;
    // public Valve.VR.VRControllerAxis_t rAxis3
    // Offset: 0x30
    Valve::VR::VRControllerAxis_t rAxis3;
    // public Valve.VR.VRControllerAxis_t rAxis4
    // Offset: 0x38
    Valve::VR::VRControllerAxis_t rAxis4;
    // Creating value type constructor for type: VRControllerState_t
    constexpr VRControllerState_t(uint unPacketNum_ = {}, uint64_t ulButtonPressed_ = {}, uint64_t ulButtonTouched_ = {}, Valve::VR::VRControllerAxis_t rAxis0_ = {}, Valve::VR::VRControllerAxis_t rAxis1_ = {}, Valve::VR::VRControllerAxis_t rAxis2_ = {}, Valve::VR::VRControllerAxis_t rAxis3_ = {}, Valve::VR::VRControllerAxis_t rAxis4_ = {}) noexcept : unPacketNum{unPacketNum_}, ulButtonPressed{ulButtonPressed_}, ulButtonTouched{ulButtonTouched_}, rAxis0{rAxis0_}, rAxis1{rAxis1_}, rAxis2{rAxis2_}, rAxis3{rAxis3_}, rAxis4{rAxis4_} {}
  }; // Valve.VR.VRControllerState_t
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::VRControllerState_t, "Valve.VR", "VRControllerState_t");
#pragma pack(pop)
