// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include <stdint.h>
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Completed includes
// Type namespace: Valve.VR
namespace Valve::VR {
  // Autogenerated type: Valve.VR.VRVulkanTextureData_t
  struct VRVulkanTextureData_t : public System::ValueType {
    public:
    // public System.UInt64 m_nImage
    // Offset: 0x0
    uint64_t m_nImage;
    // public System.IntPtr m_pDevice
    // Offset: 0x8
    System::IntPtr m_pDevice;
    // public System.IntPtr m_pPhysicalDevice
    // Offset: 0x10
    System::IntPtr m_pPhysicalDevice;
    // public System.IntPtr m_pInstance
    // Offset: 0x18
    System::IntPtr m_pInstance;
    // public System.IntPtr m_pQueue
    // Offset: 0x20
    System::IntPtr m_pQueue;
    // public System.UInt32 m_nQueueFamilyIndex
    // Offset: 0x28
    uint m_nQueueFamilyIndex;
    // public System.UInt32 m_nWidth
    // Offset: 0x2C
    uint m_nWidth;
    // public System.UInt32 m_nHeight
    // Offset: 0x30
    uint m_nHeight;
    // public System.UInt32 m_nFormat
    // Offset: 0x34
    uint m_nFormat;
    // public System.UInt32 m_nSampleCount
    // Offset: 0x38
    uint m_nSampleCount;
    // Creating value type constructor for type: VRVulkanTextureData_t
    constexpr VRVulkanTextureData_t(uint64_t m_nImage_ = {}, System::IntPtr m_pDevice_ = {}, System::IntPtr m_pPhysicalDevice_ = {}, System::IntPtr m_pInstance_ = {}, System::IntPtr m_pQueue_ = {}, uint m_nQueueFamilyIndex_ = {}, uint m_nWidth_ = {}, uint m_nHeight_ = {}, uint m_nFormat_ = {}, uint m_nSampleCount_ = {}) noexcept : m_nImage{m_nImage_}, m_pDevice{m_pDevice_}, m_pPhysicalDevice{m_pPhysicalDevice_}, m_pInstance{m_pInstance_}, m_pQueue{m_pQueue_}, m_nQueueFamilyIndex{m_nQueueFamilyIndex_}, m_nWidth{m_nWidth_}, m_nHeight{m_nHeight_}, m_nFormat{m_nFormat_}, m_nSampleCount{m_nSampleCount_} {}
  }; // Valve.VR.VRVulkanTextureData_t
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Valve::VR::VRVulkanTextureData_t, "Valve.VR", "VRVulkanTextureData_t");
#pragma pack(pop)
