// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Security.Principal.IIdentity
#include "System/Security/Principal/IIdentity.hpp"
// Including type: System.Runtime.Serialization.StreamingContext
#include "System/Runtime/Serialization/StreamingContext.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Security::Claims
namespace System::Security::Claims {
  // Forward declaring type: Claim
  class Claim;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: Collection`1<T>
  template<typename T>
  class Collection_1;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
}
// Completed forward declares
// Type namespace: System.Security.Claims
namespace System::Security::Claims {
  // Forward declaring type: ClaimsIdentity
  class ClaimsIdentity;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Security::Claims::ClaimsIdentity);
DEFINE_IL2CPP_ARG_TYPE(::System::Security::Claims::ClaimsIdentity*, "System.Security.Claims", "ClaimsIdentity");
// Type namespace: System.Security.Claims
namespace System::Security::Claims {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: System.Security.Claims.ClaimsIdentity
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: 1031C98
  class ClaimsIdentity : public ::Il2CppObject/*, public ::System::Security::Principal::IIdentity*/ {
    public:
    // Nested type: ::System::Security::Claims::ClaimsIdentity::$get_Claims$d__51
    class $get_Claims$d__51;
    public:
    // private System.Byte[] m_userSerializationData
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<uint8_t> m_userSerializationData;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Collections.Generic.List`1<System.Security.Claims.Claim> m_instanceClaims
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::System::Security::Claims::Claim*>* m_instanceClaims;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Security::Claims::Claim*>*) == 0x8);
    // private System.Collections.ObjectModel.Collection`1<System.Collections.Generic.IEnumerable`1<System.Security.Claims.Claim>> m_externalClaims
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::ObjectModel::Collection_1<::System::Collections::Generic::IEnumerable_1<::System::Security::Claims::Claim*>*>* m_externalClaims;
    // Field size check
    static_assert(sizeof(::System::Collections::ObjectModel::Collection_1<::System::Collections::Generic::IEnumerable_1<::System::Security::Claims::Claim*>*>*) == 0x8);
    // private System.String m_nameType
    // Size: 0x8
    // Offset: 0x28
    ::StringW m_nameType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_roleType
    // Size: 0x8
    // Offset: 0x30
    ::StringW m_roleType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x103674C
    // private System.String m_version
    // Size: 0x8
    // Offset: 0x38
    ::StringW m_version;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1036784
    // private System.Security.Claims.ClaimsIdentity m_actor
    // Size: 0x8
    // Offset: 0x40
    ::System::Security::Claims::ClaimsIdentity* m_actor;
    // Field size check
    static_assert(sizeof(::System::Security::Claims::ClaimsIdentity*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x10367BC
    // private System.String m_authenticationType
    // Size: 0x8
    // Offset: 0x48
    ::StringW m_authenticationType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x10367F4
    // private System.Object m_bootstrapContext
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppObject* m_bootstrapContext;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x103682C
    // private System.String m_label
    // Size: 0x8
    // Offset: 0x58
    ::StringW m_label;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x1036864
    // private System.String m_serializedNameType
    // Size: 0x8
    // Offset: 0x60
    ::StringW m_serializedNameType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x103689C
    // private System.String m_serializedRoleType
    // Size: 0x8
    // Offset: 0x68
    ::StringW m_serializedRoleType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [OptionalFieldAttribute] Offset: 0x10368D4
    // private System.String m_serializedClaims
    // Size: 0x8
    // Offset: 0x70
    ::StringW m_serializedClaims;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::Security::Principal::IIdentity
    operator ::System::Security::Principal::IIdentity() noexcept {
      return *reinterpret_cast<::System::Security::Principal::IIdentity*>(this);
    }
    // Get instance field reference: private System.Byte[] m_userSerializationData
    [[deprecated("Use field access instead!")]] ::ArrayW<uint8_t>& dyn_m_userSerializationData();
    // Get instance field reference: private System.Collections.Generic.List`1<System.Security.Claims.Claim> m_instanceClaims
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::System::Security::Claims::Claim*>*& dyn_m_instanceClaims();
