// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: ICollection`1<T>
  template<typename T>
  class ICollection_1;
}
// Forward declaring namespace: System::Net::Http::Headers
namespace System::Net::Http::Headers {
  // Forward declaring type: NameValueHeaderValue
  class NameValueHeaderValue;
}
// Completed forward declares
// Type namespace: System.Net.Http.Headers
namespace System::Net::Http::Headers {
  // Autogenerated type: System.Net.Http.Headers.CacheControlHeaderValue
  class CacheControlHeaderValue : public ::Il2CppObject/*, public System::ICloneable*/ {
    public:
    // private System.Collections.Generic.List`1<System.Net.Http.Headers.NameValueHeaderValue> extensions
    // Offset: 0x10
    System::Collections::Generic::List_1<System::Net::Http::Headers::NameValueHeaderValue*>* extensions;
    // private System.Collections.Generic.List`1<System.String> no_cache_headers
    // Offset: 0x18
    System::Collections::Generic::List_1<::Il2CppString*>* no_cache_headers;
    // private System.Collections.Generic.List`1<System.String> private_headers
    // Offset: 0x20
    System::Collections::Generic::List_1<::Il2CppString*>* private_headers;
    // private System.Nullable`1<System.TimeSpan> <MaxAge>k__BackingField
    // Offset: 0x28
    System::Nullable_1<System::TimeSpan> MaxAge;
    // private System.Boolean <MaxStale>k__BackingField
    // Offset: 0x38
    bool MaxStale;
    // private System.Nullable`1<System.TimeSpan> <MaxStaleLimit>k__BackingField
    // Offset: 0x40
    System::Nullable_1<System::TimeSpan> MaxStaleLimit;
    // private System.Nullable`1<System.TimeSpan> <MinFresh>k__BackingField
    // Offset: 0x50
    System::Nullable_1<System::TimeSpan> MinFresh;
    // private System.Boolean <MustRevalidate>k__BackingField
    // Offset: 0x60
    bool MustRevalidate;
    // private System.Boolean <NoCache>k__BackingField
    // Offset: 0x61
    bool NoCache;
    // private System.Boolean <NoStore>k__BackingField
    // Offset: 0x62
    bool NoStore;
    // private System.Boolean <NoTransform>k__BackingField
    // Offset: 0x63
    bool NoTransform;
    // private System.Boolean <OnlyIfCached>k__BackingField
    // Offset: 0x64
    bool OnlyIfCached;
    // private System.Boolean <Private>k__BackingField
    // Offset: 0x65
    bool Private;
    // private System.Boolean <ProxyRevalidate>k__BackingField
    // Offset: 0x66
    bool ProxyRevalidate;
    // private System.Boolean <Public>k__BackingField
    // Offset: 0x67
    bool Public;
    // private System.Nullable`1<System.TimeSpan> <SharedMaxAge>k__BackingField
    // Offset: 0x68
    System::Nullable_1<System::TimeSpan> SharedMaxAge;
    // Creating interface conversion operator: operator System::ICloneable
    operator System::ICloneable() noexcept {
      return *reinterpret_cast<System::ICloneable*>(this);
    }
    // public System.Collections.Generic.ICollection`1<System.Net.Http.Headers.NameValueHeaderValue> get_Extensions()
    // Offset: 0x11FCB08
    System::Collections::Generic::ICollection_1<System::Net::Http::Headers::NameValueHeaderValue*>* get_Extensions();
    // public System.Nullable`1<System.TimeSpan> get_MaxAge()
    // Offset: 0x11FCB88
    System::Nullable_1<System::TimeSpan> get_MaxAge();
    // public System.Void set_MaxAge(System.Nullable`1<System.TimeSpan> value)
    // Offset: 0x11FCB94
    void set_MaxAge(System::Nullable_1<System::TimeSpan> value);
    // public System.Boolean get_MaxStale()
    // Offset: 0x11FCB9C
    bool get_MaxStale();
    // public System.Void set_MaxStale(System.Boolean value)
    // Offset: 0x11FCBA4
    void set_MaxStale(bool value);
    // public System.Nullable`1<System.TimeSpan> get_MaxStaleLimit()
    // Offset: 0x11FCBB0
    System::Nullable_1<System::TimeSpan> get_MaxStaleLimit();
    // public System.Void set_MaxStaleLimit(System.Nullable`1<System.TimeSpan> value)
    // Offset: 0x11FCBBC
    void set_MaxStaleLimit(System::Nullable_1<System::TimeSpan> value);
    // public System.Nullable`1<System.TimeSpan> get_MinFresh()
    // Offset: 0x11FCBC4
    System::Nullable_1<System::TimeSpan> get_MinFresh();
    // public System.Void set_MinFresh(System.Nullable`1<System.TimeSpan> value)
    // Offset: 0x11FCBD0
    void set_MinFresh(System::Nullable_1<System::TimeSpan> value);
    // public System.Boolean get_MustRevalidate()
    // Offset: 0x11FCBD8
    bool get_MustRevalidate();
    // public System.Void set_MustRevalidate(System.Boolean value)
    // Offset: 0x11FCBE0
    void set_MustRevalidate(bool value);
    // public System.Boolean get_NoCache()
    // Offset: 0x11FCBEC
    bool get_NoCache();
    // public System.Void set_NoCache(System.Boolean value)
    // Offset: 0x11FCBF4
    void set_NoCache(bool value);
    // public System.Collections.Generic.ICollection`1<System.String> get_NoCacheHeaders()
    // Offset: 0x11FCC00
    System::Collections::Generic::ICollection_1<::Il2CppString*>* get_NoCacheHeaders();
    // public System.Boolean get_NoStore()
    // Offset: 0x11FCC80
    bool get_NoStore();
    // public System.Void set_NoStore(System.Boolean value)
    // Offset: 0x11FCC88
    void set_NoStore(bool value);
    // public System.Boolean get_NoTransform()
    // Offset: 0x11FCC94
    bool get_NoTransform();
    // public System.Void set_NoTransform(System.Boolean value)
    // Offset: 0x11FCC9C
    void set_NoTransform(bool value);
    // public System.Boolean get_OnlyIfCached()
    // Offset: 0x11FCCA8
    bool get_OnlyIfCached();
    // public System.Void set_OnlyIfCached(System.Boolean value)
    // Offset: 0x11FCCB0
    void set_OnlyIfCached(bool value);
    // public System.Boolean get_Private()
    // Offset: 0x11FCCBC
    bool get_Private();
    // public System.Void set_Private(System.Boolean value)
    // Offset: 0x11FCCC4
    void set_Private(bool value);
    // public System.Collections.Generic.ICollection`1<System.String> get_PrivateHeaders()
    // Offset: 0x11FCCD0
    System::Collections::Generic::ICollection_1<::Il2CppString*>* get_PrivateHeaders();
    // public System.Boolean get_ProxyRevalidate()
    // Offset: 0x11FCD50
    bool get_ProxyRevalidate();
    // public System.Void set_ProxyRevalidate(System.Boolean value)
    // Offset: 0x11FCD58
    void set_ProxyRevalidate(bool value);
    // public System.Boolean get_Public()
    // Offset: 0x11FCD64
    bool get_Public();
    // public System.Void set_Public(System.Boolean value)
    // Offset: 0x11FCD6C
    void set_Public(bool value);
    // public System.Nullable`1<System.TimeSpan> get_SharedMaxAge()
    // Offset: 0x11FCD78
    System::Nullable_1<System::TimeSpan> get_SharedMaxAge();
    // public System.Void set_SharedMaxAge(System.Nullable`1<System.TimeSpan> value)
    // Offset: 0x11FCD84
    void set_SharedMaxAge(System::Nullable_1<System::TimeSpan> value);
    // static public System.Boolean TryParse(System.String input, out System.Net.Http.Headers.CacheControlHeaderValue parsedValue)
    // Offset: 0x11FD6FC
    static bool TryParse(::Il2CppString* input, System::Net::Http::Headers::CacheControlHeaderValue*& parsedValue);
    // private System.Object System.ICloneable.Clone()
    // Offset: 0x11FCD8C
    // Implemented from: System.ICloneable
    // Base method: System.Object ICloneable::Clone()
    ::Il2CppObject* System_ICloneable_Clone();
    // public override System.Boolean Equals(System.Object obj)
    // Offset: 0x11FD17C
    // Implemented from: System.Object
    // Base method: System.Boolean Object::Equals(System.Object obj)
    bool Equals(::Il2CppObject* obj);
    // public override System.Int32 GetHashCode()
    // Offset: 0x11FD504
    // Implemented from: System.Object
    // Base method: System.Int32 Object::GetHashCode()
    int GetHashCode();
    // public override System.String ToString()
    // Offset: 0x11FE19C
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::Il2CppString* ToString();
    // public System.Void .ctor()
    // Offset: 0x11FE008
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static CacheControlHeaderValue* New_ctor();
  }; // System.Net.Http.Headers.CacheControlHeaderValue
  check_size<sizeof(CacheControlHeaderValue), 104 + sizeof(System::Nullable_1<System::TimeSpan>) + ((104 + sizeof(System::Nullable_1<System::TimeSpan>)) % 8 != 0 ? (8 - (104 + sizeof(System::Nullable_1<System::TimeSpan>)) % 8) : 0)> __System_Net_Http_Headers_CacheControlHeaderValueSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Net::Http::Headers::CacheControlHeaderValue*, "System.Net.Http.Headers", "CacheControlHeaderValue");
#pragma pack(pop)
