// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ExitGames.Client.Photon.IPhotonPeerListener
#include "ExitGames/Client/Photon/IPhotonPeerListener.hpp"
// Including type: Photon.Realtime.ClientAppType
#include "Photon/Realtime/ClientAppType.hpp"
// Including type: Photon.Realtime.AuthModeOption
#include "Photon/Realtime/AuthModeOption.hpp"
// Including type: Photon.Realtime.EncryptionMode
#include "Photon/Realtime/EncryptionMode.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: ExitGames.Client.Photon.ConnectionProtocol
#include "ExitGames/Client/Photon/ConnectionProtocol.hpp"
// Including type: Photon.Realtime.PhotonPortDefinition
#include "Photon/Realtime/PhotonPortDefinition.hpp"
// Including type: Photon.Realtime.ServerConnection
#include "Photon/Realtime/ServerConnection.hpp"
// Including type: Photon.Realtime.ClientState
#include "Photon/Realtime/ClientState.hpp"
// Including type: Photon.Realtime.DisconnectCause
#include "Photon/Realtime/DisconnectCause.hpp"
// Including type: Photon.Realtime.JoinType
#include "Photon/Realtime/JoinType.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"

  class InRoomCallbacksContainer;
  // Forward declaring type: LobbyCallbacksContainer
  class LobbyCallbacksContainer;
  // Forward declaring type: WebRpcCallbacksContainer
  class WebRpcCallbacksContainer;
  // Forward declaring type: ErrorInfoCallbacksContainer
  class ErrorInfoCallbacksContainer;
  // Forward declaring type: TypedLobby
  class TypedLobby;
  // Forward declaring type: TypedLobbyInfo
  class TypedLobbyInfo;
  // Forward declaring type: Player
  class Player;
  // Forward declaring type: Room
  class Room;
  // Forward declaring type: EnterRoomParams
  class EnterRoomParams;
  // Forward declaring type: RegionHandler
  class RegionHandler;
  // Forward declaring type: AppSettings
  class AppSettings;
  // Forward declaring type: FindFriendsOptions
  class FindFriendsOptions;
  // Forward declaring type: OpJoinRandomRoomParams
  class OpJoinRandomRoomParams;
  // Forward declaring type: WebFlags
  class WebFlags;
  // Forward declaring type: RaiseEventOptions
  class RaiseEventOptions;
  // Forward declaring type: RoomOptions
  class RoomOptions;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: EventData
  class EventData;
  // Forward declaring type: OperationResponse
  class OperationResponse;
  // Forward declaring type: SerializationProtocol
  struct SerializationProtocol;
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: SendOptions
  struct SendOptions;
  // Forward declaring type: DebugLevel
  struct DebugLevel;
  // Forward declaring type: StatusCode
  struct StatusCode;
  // Forward declaring type: DisconnectMessage
  class DisconnectMessage;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: Photon.Realtime
namespace Photon::Realtime {
  // Forward declaring type: LoadBalancingClient
  class LoadBalancingClient;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Realtime::LoadBalancingClient);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Realtime::LoadBalancingClient*, "Photon.Realtime", "LoadBalancingClient");
// Type namespace: Photon.Realtime
namespace Photon::Realtime {
  // WARNING Size may be invalid!
  // Autogenerated type: Photon.Realtime.LoadBalancingClient
  // [TokenAttribute] Offset: FFFFFFFF
  class LoadBalancingClient : public ::Il2CppObject/*, public ::ExitGames::Client::Photon::IPhotonPeerListener*/ {
    public:
    // Nested type: ::Photon::Realtime::LoadBalancingClient::EncryptionDataParameters
    class EncryptionDataParameters;
    // Nested type: ::Photon::Realtime::LoadBalancingClient::CallbackTargetChange
    class CallbackTargetChange;
    public:
    // private Photon.Realtime.LoadBalancingPeer <LoadBalancingPeer>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::Photon::Realtime::LoadBalancingPeer* LoadBalancingPeer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::LoadBalancingPeer*) == 0x8);
    // private System.String <AppVersion>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::StringW AppVersion;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <AppId>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::StringW AppId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Photon.Realtime.ClientAppType <ClientType>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    ::Photon::Realtime::ClientAppType ClientType;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::ClientAppType) == 0x4);
    // private Photon.Realtime.AuthenticationValues <AuthValues>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::Photon::Realtime::AuthenticationValues* AuthValues;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::AuthenticationValues*) == 0x8);
    // public Photon.Realtime.AuthModeOption AuthMode
    // Size: 0x4
    // Offset: 0x38
    ::Photon::Realtime::AuthModeOption AuthMode;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::AuthModeOption) == 0x4);
    // public Photon.Realtime.EncryptionMode EncryptionMode
    // Size: 0x4
    // Offset: 0x3C
    ::Photon::Realtime::EncryptionMode EncryptionMode;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::EncryptionMode) == 0x4);
    // private System.Nullable`1<ExitGames.Client.Photon.ConnectionProtocol> <ExpectedProtocol>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0x40
    ::System::Nullable_1<::ExitGames::Client::Photon::ConnectionProtocol> ExpectedProtocol;
    // private System.Object tokenCache
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* tokenCache;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean <IsUsingNameServer>k__BackingField
    // Size: 0x1
    // Offset: 0x50
    bool IsUsingNameServer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.String NameServerHost
    // Size: 0x8
    // Offset: 0x58
    ::StringW NameServerHost;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean <UseAlternativeUdpPorts>k__BackingField
    // Size: 0x1
    // Offset: 0x60
    bool UseAlternativeUdpPorts;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public Photon.Realtime.PhotonPortDefinition ServerPortOverrides
    // Size: 0x6
    // Offset: 0x62
    ::Photon::Realtime::PhotonPortDefinition ServerPortOverrides;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::PhotonPortDefinition) == 0x6);
    // private System.Boolean <EnableProtocolFallback>k__BackingField
    // Size: 0x1
    // Offset: 0x68
    bool EnableProtocolFallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.String <MasterServerAddress>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::StringW MasterServerAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <GameServerAddress>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::StringW GameServerAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Photon.Realtime.ServerConnection <Server>k__BackingField
    // Size: 0x4
    // Offset: 0x80
    ::Photon::Realtime::ServerConnection Server;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::ServerConnection) == 0x4);
    // public System.String ProxyServerAddress
    // Size: 0x8
    // Offset: 0x88
    ::StringW ProxyServerAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Photon.Realtime.ClientState state
    // Size: 0x4
    // Offset: 0x90
    ::Photon::Realtime::ClientState state;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::ClientState) == 0x4);
    // private System.Action`2<Photon.Realtime.ClientState,Photon.Realtime.ClientState> StateChanged
    // Size: 0x8
    // Offset: 0x98
    ::System::Action_2<::Photon::Realtime::ClientState, ::Photon::Realtime::ClientState>* StateChanged;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Photon::Realtime::ClientState, ::Photon::Realtime::ClientState>*) == 0x8);
    // private System.Action`1<ExitGames.Client.Photon.EventData> EventReceived
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_1<::ExitGames::Client::Photon::EventData*>* EventReceived;
    // Field size check
    static_assert(sizeof(::System::Action_1<::ExitGames::Client::Photon::EventData*>*) == 0x8);
    // private System.Action`1<ExitGames.Client.Photon.OperationResponse> OpResponseReceived
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action_1<::ExitGames::Client::Photon::OperationResponse*>* OpResponseReceived;
    // Field size check
    static_assert(sizeof(::System::Action_1<::ExitGames::Client::Photon::OperationResponse*>*) == 0x8);
    // public Photon.Realtime.ConnectionCallbacksContainer ConnectionCallbackTargets
    // Size: 0x8
    // Offset: 0xB0
    ::Photon::Realtime::ConnectionCallbacksContainer* ConnectionCallbackTargets;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::ConnectionCallbacksContainer*) == 0x8);
    // public Photon.Realtime.MatchMakingCallbacksContainer MatchMakingCallbackTargets
    // Size: 0x8
    // Offset: 0xB8
    ::Photon::Realtime::MatchMakingCallbacksContainer* MatchMakingCallbackTargets;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::MatchMakingCallbacksContainer*) == 0x8);
    // Photon.Realtime.InRoomCallbacksContainer InRoomCallbackTargets
    // Size: 0x8
    // Offset: 0xC0
    ::Photon::Realtime::InRoomCallbacksContainer* InRoomCallbackTargets;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::InRoomCallbacksContainer*) == 0x8);
    // Photon.Realtime.LobbyCallbacksContainer LobbyCallbackTargets
    // Size: 0x8
    // Offset: 0xC8
    ::Photon::Realtime::LobbyCallbacksContainer* LobbyCallbackTargets;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::LobbyCallbacksContainer*) == 0x8);
    // Photon.Realtime.WebRpcCallbacksContainer WebRpcCallbackTargets
    // Size: 0x8
    // Offset: 0xD0
    ::Photon::Realtime::WebRpcCallbacksContainer* WebRpcCallbackTargets;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::WebRpcCallbacksContainer*) == 0x8);
    // Photon.Realtime.ErrorInfoCallbacksContainer ErrorInfoCallbackTargets
    // Size: 0x8
    // Offset: 0xD8
    ::Photon::Realtime::ErrorInfoCallbacksContainer* ErrorInfoCallbackTargets;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::ErrorInfoCallbacksContainer*) == 0x8);
    // private Photon.Realtime.DisconnectCause <DisconnectedCause>k__BackingField
    // Size: 0x4
    // Offset: 0xE0
    ::Photon::Realtime::DisconnectCause DisconnectedCause;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::DisconnectCause) == 0x4);
    // private Photon.Realtime.TypedLobby <CurrentLobby>k__BackingField
    // Size: 0x8
    // Offset: 0xE8
    ::Photon::Realtime::TypedLobby* CurrentLobby;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::TypedLobby*) == 0x8);
    // public System.Boolean EnableLobbyStatistics
    // Size: 0x1
    // Offset: 0xF0
    bool EnableLobbyStatistics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.Collections.Generic.List`1<Photon.Realtime.TypedLobbyInfo> lobbyStatistics
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::Photon::Realtime::TypedLobbyInfo*>* lobbyStatistics;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Realtime::TypedLobbyInfo*>*) == 0x8);
    // private Photon.Realtime.Player <LocalPlayer>k__BackingField
    // Size: 0x8
    // Offset: 0x100
    ::Photon::Realtime::Player* LocalPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private Photon.Realtime.Room <CurrentRoom>k__BackingField
    // Size: 0x8
    // Offset: 0x108
    ::Photon::Realtime::Room* CurrentRoom;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Room*) == 0x8);
    // private System.Int32 <PlayersOnMasterCount>k__BackingField
    // Size: 0x4
    // Offset: 0x110
    int PlayersOnMasterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <PlayersInRoomsCount>k__BackingField
    // Size: 0x4
    // Offset: 0x114
    int PlayersInRoomsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <RoomsCount>k__BackingField
    // Size: 0x4
    // Offset: 0x118
    int RoomsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Photon.Realtime.JoinType lastJoinType
    // Size: 0x4
    // Offset: 0x11C
    ::Photon::Realtime::JoinType lastJoinType;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::JoinType) == 0x4);
    // private Photon.Realtime.EnterRoomParams enterRoomParamsCache
    // Size: 0x8
    // Offset: 0x120
    ::Photon::Realtime::EnterRoomParams* enterRoomParamsCache;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::EnterRoomParams*) == 0x8);
    // private ExitGames.Client.Photon.OperationResponse failedRoomEntryOperation
    // Size: 0x8
    // Offset: 0x128
    ::ExitGames::Client::Photon::OperationResponse* failedRoomEntryOperation;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::OperationResponse*) == 0x8);
    // private System.String[] friendListRequested
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<::StringW> friendListRequested;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String <CloudRegion>k__BackingField
    // Size: 0x8
    // Offset: 0x138
    ::StringW CloudRegion;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <CurrentCluster>k__BackingField
    // Size: 0x8
    // Offset: 0x140
    ::StringW CurrentCluster;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public Photon.Realtime.RegionHandler RegionHandler
    // Size: 0x8
    // Offset: 0x148
    ::Photon::Realtime::RegionHandler* RegionHandler;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::RegionHandler*) == 0x8);
    // private System.String bestRegionSummaryFromStorage
    // Size: 0x8
    // Offset: 0x150
    ::StringW bestRegionSummaryFromStorage;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String SummaryToCache
    // Size: 0x8
    // Offset: 0x158
    ::StringW SummaryToCache;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean connectToBestRegion
    // Size: 0x1
    // Offset: 0x160
    bool connectToBestRegion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.Collections.Generic.Queue`1<Photon.Realtime.LoadBalancingClient/Photon.Realtime.CallbackTargetChange> callbackTargetChanges
    // Size: 0x8
    // Offset: 0x168
    ::System::Collections::Generic::Queue_1<::Photon::Realtime::LoadBalancingClient::CallbackTargetChange*>* callbackTargetChanges;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::Photon::Realtime::LoadBalancingClient::CallbackTargetChange*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<System.Object> callbackTargets
    // Size: 0x8
    // Offset: 0x170
    ::System::Collections::Generic::HashSet_1<::Il2CppObject*>* callbackTargets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::Il2CppObject*>*) == 0x8);
    // public System.Int32 NameServerPortInAppSettings
    // Size: 0x4
    // Offset: 0x178
    int NameServerPortInAppSettings;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::ExitGames::Client::Photon::IPhotonPeerListener
    operator ::ExitGames::Client::Photon::IPhotonPeerListener() noexcept {
      return *reinterpret_cast<::ExitGames::Client::Photon::IPhotonPeerListener*>(this);
    }
    // Get static field: static private readonly System.Collections.Generic.Dictionary`2<ExitGames.Client.Photon.ConnectionProtocol,System.Int32> ProtocolToNameServerPort
    static ::System::Collections::Generic::Dictionary_2<::ExitGames::Client::Photon::ConnectionProtocol, int>* _get_ProtocolToNameServerPort();
    // Set static field: static private readonly System.Collections.Generic.Dictionary`2<ExitGames.Client.Photon.ConnectionProtocol,System.Int32> ProtocolToNameServerPort
