// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Region
  class Region;
  // Forward declaring type: PhotonPing
  class PhotonPing;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Photon.Realtime
namespace Photon::Realtime {
  // Forward declaring type: RegionPinger
  class RegionPinger;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Realtime::RegionPinger);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Realtime::RegionPinger*, "Photon.Realtime", "RegionPinger");
// Type namespace: Photon.Realtime
namespace Photon::Realtime {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Realtime.RegionPinger
  // [TokenAttribute] Offset: FFFFFFFF
  class RegionPinger : public ::Il2CppObject {
    public:
    // Nested type: ::Photon::Realtime::RegionPinger::$RegionPingCoroutine$d__19
    class $RegionPingCoroutine$d__19;
    public:
    // private Photon.Realtime.Region region
    // Size: 0x8
    // Offset: 0x10
    ::Photon::Realtime::Region* region;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Region*) == 0x8);
    // private System.String regionAddress
    // Size: 0x8
    // Offset: 0x18
    ::StringW regionAddress;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 CurrentAttempt
    // Size: 0x4
    // Offset: 0x20
    int CurrentAttempt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <Done>k__BackingField
    // Size: 0x1
    // Offset: 0x24
    bool Done;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Done and: onDoneCall
    char __padding3[0x3] = {};
    // private System.Action`1<Photon.Realtime.Region> onDoneCall
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_1<::Photon::Realtime::Region*>* onDoneCall;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Photon::Realtime::Region*>*) == 0x8);
    // private Photon.Realtime.PhotonPing ping
    // Size: 0x8
    // Offset: 0x30
    ::Photon::Realtime::PhotonPing* ping;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::PhotonPing*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> rttResults
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<int>* rttResults;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    public:
    // Get static field: static public System.Int32 Attempts
    static int _get_Attempts();
    // Set static field: static public System.Int32 Attempts
    static void _set_Attempts(int value);
    // Get static field: static public System.Boolean IgnoreInitialAttempt
    static bool _get_IgnoreInitialAttempt();
    // Set static field: static public System.Boolean IgnoreInitialAttempt
    static void _set_IgnoreInitialAttempt(bool value);
    // Get static field: static public System.Int32 MaxMilliseconsPerPing
    static int _get_MaxMilliseconsPerPing();
    // Set static field: static public System.Int32 MaxMilliseconsPerPing
    static void _set_MaxMilliseconsPerPing(int value);
    // Get static field: static public System.Int32 PingWhenFailed
    static int _get_PingWhenFailed();
    // Set static field: static public System.Int32 PingWhenFailed
    static void _set_PingWhenFailed(int value);
    // Get instance field reference: private Photon.Realtime.Region region
    [[deprecated("Use field access instead!")]] ::Photon::Realtime::Region*& dyn_region();
    // Get instance field reference: private System.String regionAddress
    [[deprecated("Use field access instead!")]] ::StringW& dyn_regionAddress();
    // Get instance field reference: public System.Int32 CurrentAttempt
    [[deprecated("Use field access instead!")]] int& dyn_CurrentAttempt();
    // Get instance field reference: private System.Boolean <Done>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$Done$k__BackingField();
    // Get instance field reference: private System.Action`1<Photon.Realtime.Region> onDoneCall
    [[deprecated("Use field access instead!")]] ::System::Action_1<::Photon::Realtime::Region*>*& dyn_onDoneCall();
    // Get instance field reference: private Photon.Realtime.PhotonPing ping
    [[deprecated("Use field access instead!")]] ::Photon::Realtime::PhotonPing*& dyn_ping();
    // Get instance field reference: private System.Collections.Generic.List`1<System.Int32> rttResults
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<int>*& dyn_rttResults();
    // public System.Boolean get_Done()
    // Offset: 0x133A46C
    bool get_Done();
    // private System.Void set_Done(System.Boolean value)
    // Offset: 0x133A474
    void set_Done(bool value);
    // public System.Void .ctor(Photon.Realtime.Region region, System.Action`1<Photon.Realtime.Region> onDoneCallback)
    // Offset: 0x1339DD4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RegionPinger* New_ctor(::Photon::Realtime::Region* region, ::System::Action_1<::Photon::Realtime::Region*>* onDoneCallback) {
      static auto ___internal__logger = ::Logger::get().WithContext("::Photon::Realtime::RegionPinger::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RegionPinger*, creationType>(region, onDoneCallback)));
    }
    // static private System.Void .cctor()
    // Offset: 0x133AC3C
    static void _cctor();
    // private Photon.Realtime.PhotonPing GetPingImplementation()
    // Offset: 0x133A480
    ::Photon::Realtime::PhotonPing* GetPingImplementation();
    // public System.Boolean Start()
    // Offset: 0x1339E74
    bool Start();
    // protected internal System.Void RegionPingPooled(System.Object context)
    // Offset: 0x133A888
    void RegionPingPooled(::Il2CppObject* context);
    // protected internal System.Boolean RegionPingThreaded()
    // Offset: 0x133A88C
    bool RegionPingThreaded();
    // protected internal System.Collections.IEnumerator RegionPingCoroutine()
    // Offset: 0x133ABA0
    ::System::Collections::IEnumerator* RegionPingCoroutine();
    // public System.String GetResults()
    // Offset: 0x1339A70
    ::StringW GetResults();
    // static public System.String ResolveHost(System.String hostName)
    // Offset: 0x133A610
    static ::StringW ResolveHost(::StringW hostName);
  }; // Photon.Realtime.RegionPinger
  #pragma pack(pop)
  static check_size<sizeof(RegionPinger), 56 + sizeof(::System::Collections::Generic::List_1<int>*)> __Photon_Realtime_RegionPingerSizeCheck;
  static_assert(sizeof(RegionPinger) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::get_Done
// Il2CppName: get_Done
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Photon::Realtime::RegionPinger::*)()>(&Photon::Realtime::RegionPinger::get_Done)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), "get_Done", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::set_Done
// Il2CppName: set_Done
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Realtime::RegionPinger::*)(bool)>(&Photon::Realtime::RegionPinger::set_Done)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), "set_Done", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Photon::Realtime::RegionPinger::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::GetPingImplementation
// Il2CppName: GetPingImplementation
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Photon::Realtime::PhotonPing* (Photon::Realtime::RegionPinger::*)()>(&Photon::Realtime::RegionPinger::GetPingImplementation)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), "GetPingImplementation", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Photon::Realtime::RegionPinger::*)()>(&Photon::Realtime::RegionPinger::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::RegionPingPooled
// Il2CppName: RegionPingPooled
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Photon::Realtime::RegionPinger::*)(::Il2CppObject*)>(&Photon::Realtime::RegionPinger::RegionPingPooled)> {
  static const MethodInfo* get() {
    static auto* context = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), "RegionPingPooled", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{context});
  }
};
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::RegionPingThreaded
// Il2CppName: RegionPingThreaded
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Photon::Realtime::RegionPinger::*)()>(&Photon::Realtime::RegionPinger::RegionPingThreaded)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), "RegionPingThreaded", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::RegionPingCoroutine
// Il2CppName: RegionPingCoroutine
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::IEnumerator* (Photon::Realtime::RegionPinger::*)()>(&Photon::Realtime::RegionPinger::RegionPingCoroutine)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), "RegionPingCoroutine", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::GetResults
// Il2CppName: GetResults
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Photon::Realtime::RegionPinger::*)()>(&Photon::Realtime::RegionPinger::GetResults)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), "GetResults", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Photon::Realtime::RegionPinger::ResolveHost
// Il2CppName: ResolveHost
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (*)(::StringW)>(&Photon::Realtime::RegionPinger::ResolveHost)> {
  static const MethodInfo* get() {
    static auto* hostName = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Photon::Realtime::RegionPinger*), "ResolveHost", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{hostName});
  }
};
