// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Realtime.RoomInfo
#include "Photon/Realtime/RoomInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: LoadBalancingClient
  class LoadBalancingClient;
  // Forward declaring type: Player
  class Player;
  // Forward declaring type: RoomOptions
  class RoomOptions;
  // Forward declaring type: WebFlags
  class WebFlags;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Completed forward declares
// Type namespace: Photon.Realtime
namespace Photon::Realtime {
  // Forward declaring type: Room
  class Room;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Realtime::Room);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Realtime::Room*, "Photon.Realtime", "Room");
// Type namespace: Photon.Realtime
namespace Photon::Realtime {
  // Size: 0x7D
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Realtime.Room
  // [TokenAttribute] Offset: FFFFFFFF
  class Room : public ::Photon::Realtime::RoomInfo {
    public:
    // Writing base type padding for base size: 0x5C to desired offset: 0x60
    char ___base_padding[0x4] = {};
    public:
    // private Photon.Realtime.LoadBalancingClient <LoadBalancingClient>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::Photon::Realtime::LoadBalancingClient* LoadBalancingClient;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::LoadBalancingClient*) == 0x8);
    // private System.Boolean isOffline
    // Size: 0x1
    // Offset: 0x68
    bool isOffline;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isOffline and: players
    char __padding1[0x7] = {};
    // private System.Collections.Generic.Dictionary`2<System.Int32,Photon.Realtime.Player> players
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::Dictionary_2<int, ::Photon::Realtime::Player*>* players;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::Photon::Realtime::Player*>*) == 0x8);
    // private System.Boolean <BroadcastPropertiesChangeToAll>k__BackingField
    // Size: 0x1
    // Offset: 0x78
    bool BroadcastPropertiesChangeToAll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <SuppressRoomEvents>k__BackingField
    // Size: 0x1
    // Offset: 0x79
    bool SuppressRoomEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <SuppressPlayerInfo>k__BackingField
    // Size: 0x1
    // Offset: 0x7A
    bool SuppressPlayerInfo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <PublishUserId>k__BackingField
    // Size: 0x1
    // Offset: 0x7B
    bool PublishUserId;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <DeleteNullProperties>k__BackingField
    // Size: 0x1
    // Offset: 0x7C
    bool DeleteNullProperties;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private Photon.Realtime.LoadBalancingClient <LoadBalancingClient>k__BackingField
    [[deprecated("Use field access instead!")]] ::Photon::Realtime::LoadBalancingClient*& dyn_$LoadBalancingClient$k__BackingField();
    // Get instance field reference: private System.Boolean isOffline
    [[deprecated("Use field access instead!")]] bool& dyn_isOffline();
    // Get instance field reference: private System.Collections.Generic.Dictionary`2<System.Int32,Photon.Realtime.Player> players
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<int, ::Photon::Realtime::Player*>*& dyn_players();
    // Get instance field reference: private System.Boolean <BroadcastPropertiesChangeToAll>k__BackingField
