// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.BaseInputModule
#include "UnityEngine/EventSystems/BaseInputModule.hpp"
// Including type: UnityEngine.InputSystem.UI.UIPointerBehavior
#include "UnityEngine/InputSystem/UI/UIPointerBehavior.hpp"
// Including type: UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext
#include "UnityEngine/InputSystem/InputAction_CallbackContext.hpp"
// Including type: UnityEngine.InputSystem.UI.UIPointerType
#include "UnityEngine/InputSystem/UI/UIPointerType.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
// Including type: UnityEngine.InputSystem.UI.PointerModel
#include "UnityEngine/InputSystem/UI/PointerModel.hpp"
// Including type: UnityEngine.InputSystem.UI.NavigationModel
#include "UnityEngine/InputSystem/UI/NavigationModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionAsset
  class InputActionAsset;
  // Forward declaring type: InputActionReference
  class InputActionReference;
  // Forward declaring type: InputControl
  class InputControl;
  // Forward declaring type: InputDevice
  class InputDevice;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: RaycastResult because it is already included!
  // Skipping declaration: PointerEventData because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::UI
namespace UnityEngine::InputSystem::UI {
  // Forward declaring type: ExtendedPointerEventData
  class ExtendedPointerEventData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.UI
namespace UnityEngine::InputSystem::UI {
  // Forward declaring type: InputSystemUIInputModule
  class InputSystemUIInputModule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::UI::InputSystemUIInputModule);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::UI::InputSystemUIInputModule*, "UnityEngine.InputSystem.UI", "InputSystemUIInputModule");
// Type namespace: UnityEngine.InputSystem.UI
namespace UnityEngine::InputSystem::UI {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.UI.InputSystemUIInputModule
  // [TokenAttribute] Offset: FFFFFFFF
  class InputSystemUIInputModule : public ::UnityEngine::EventSystems::BaseInputModule {
    public:
    public:
    // [FormerlySerializedAsAttribute] Offset: 0x95B538
    // [TooltipAttribute] Offset: 0x95B538
    // private System.Single m_MoveRepeatDelay
    // Size: 0x4
    // Offset: 0x48
    float m_MoveRepeatDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x95B5A8
    // [TooltipAttribute] Offset: 0x95B5A8
    // private System.Single m_MoveRepeatRate
    // Size: 0x4
    // Offset: 0x4C
    float m_MoveRepeatRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x95B618
    // private System.Single m_TrackedDeviceDragThresholdMultiplier
    // Size: 0x4
    // Offset: 0x50
    float m_TrackedDeviceDragThresholdMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.InputSystem.InputActionAsset m_ActionsAsset
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::InputSystem::InputActionAsset* m_ActionsAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionAsset*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_PointAction
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::InputSystem::InputActionReference* m_PointAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_MoveAction
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::InputSystem::InputActionReference* m_MoveAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_SubmitAction
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::InputSystem::InputActionReference* m_SubmitAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_CancelAction
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::InputSystem::InputActionReference* m_CancelAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_LeftClickAction
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::InputSystem::InputActionReference* m_LeftClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_MiddleClickAction
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::InputSystem::InputActionReference* m_MiddleClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_RightClickAction
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::InputSystem::InputActionReference* m_RightClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_ScrollWheelAction
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::InputSystem::InputActionReference* m_ScrollWheelAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_TrackedDevicePositionAction
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::InputSystem::InputActionReference* m_TrackedDevicePositionAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_TrackedDeviceOrientationAction
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::InputSystem::InputActionReference* m_TrackedDeviceOrientationAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private System.Boolean m_DeselectOnBackgroundClick
    // Size: 0x1
    // Offset: 0xB0
    bool m_DeselectOnBackgroundClick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.InputSystem.UI.UIPointerBehavior m_PointerBehavior
    // Size: 0x4
    // Offset: 0xB4
    ::UnityEngine::InputSystem::UI::UIPointerBehavior m_PointerBehavior;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::UI::UIPointerBehavior) == 0x4);
    // private System.Boolean m_OwnsEnabledState
    // Size: 0x1
    // Offset: 0xB8
    bool m_OwnsEnabledState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ActionsHooked
    // Size: 0x1
    // Offset: 0xB9
    bool m_ActionsHooked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnPointDelegate
    // Size: 0x8
    // Offset: 0xC0
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnPointDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnMoveDelegate
    // Size: 0x8
    // Offset: 0xC8
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnMoveDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnSubmitDelegate
    // Size: 0x8
    // Offset: 0xD0
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnSubmitDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnCancelDelegate
    // Size: 0x8
    // Offset: 0xD8
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnCancelDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnLeftClickDelegate
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnLeftClickDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnRightClickDelegate
    // Size: 0x8
    // Offset: 0xE8
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnRightClickDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnMiddleClickDelegate
    // Size: 0x8
    // Offset: 0xF0
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnMiddleClickDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnScrollWheelDelegate
    // Size: 0x8
    // Offset: 0xF8
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnScrollWheelDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnTrackedDevicePositionDelegate
    // Size: 0x8
    // Offset: 0x100
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnTrackedDevicePositionDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/UnityEngine.InputSystem.CallbackContext> m_OnTrackedDeviceOrientationDelegate
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnTrackedDeviceOrientationDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<System.Object> m_OnControlsChangedDelegate
    // Size: 0x8
    // Offset: 0x110
    ::System::Action_1<::Il2CppObject*>* m_OnControlsChangedDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Il2CppObject*>*) == 0x8);
    // private System.Int32 m_CurrentPointerId
    // Size: 0x4
    // Offset: 0x118
    int m_CurrentPointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_CurrentPointerIndex
    // Size: 0x4
    // Offset: 0x11C
    int m_CurrentPointerIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.InputSystem.UI.UIPointerType m_CurrentPointerType
    // Size: 0x4
    // Offset: 0x120
    ::UnityEngine::InputSystem::UI::UIPointerType m_CurrentPointerType;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::UI::UIPointerType) == 0x4);
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Int32> m_PointerIds
    // Size: 0xFFFFFFFF
    // Offset: 0x128
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<int> m_PointerIds;
    // private UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.UI.PointerModel> m_PointerStates
    // Size: 0xFFFFFFFF
    // Offset: 0x138
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::UI::PointerModel> m_PointerStates;
    // private UnityEngine.InputSystem.UI.NavigationModel m_NavigationState
    // Size: 0x30
    // Offset: 0x320
    ::UnityEngine::InputSystem::UI::NavigationModel m_NavigationState;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::UI::NavigationModel) == 0x30);
    public:
    // static field const value: static System.Single kPixelPerLine
    static constexpr const float kPixelPerLine = 20;
    // Get static field: static System.Single kPixelPerLine
    static float _get_kPixelPerLine();
    // Set static field: static System.Single kPixelPerLine
    static void _set_kPixelPerLine(float value);
    // Get instance field reference: private System.Single m_MoveRepeatDelay
    [[deprecated("Use field access instead!")]] float& dyn_m_MoveRepeatDelay();
    // Get instance field reference: private System.Single m_MoveRepeatRate
    [[deprecated("Use field access instead!")]] float& dyn_m_MoveRepeatRate();
    // Get instance field reference: private System.Single m_TrackedDeviceDragThresholdMultiplier
