// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.BaseRaycaster
#include "UnityEngine/EventSystems/BaseRaycaster.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Ray
  struct Ray;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: UnityEngine::InputSystem::UI
namespace UnityEngine::InputSystem::UI {
  // Forward declaring type: ExtendedPointerEventData
  class ExtendedPointerEventData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Graphic
  class Graphic;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.UI
namespace UnityEngine::InputSystem::UI {
  // Forward declaring type: TrackedDeviceRaycaster
  class TrackedDeviceRaycaster;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::UI::TrackedDeviceRaycaster);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::UI::TrackedDeviceRaycaster*, "UnityEngine.InputSystem.UI", "TrackedDeviceRaycaster");
// Type namespace: UnityEngine.InputSystem.UI
namespace UnityEngine::InputSystem::UI {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.UI.TrackedDeviceRaycaster
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 958284
  // [RequireComponent] Offset: 958284
  class TrackedDeviceRaycaster : public ::UnityEngine::EventSystems::BaseRaycaster {
    public:
    // Nested type: ::UnityEngine::InputSystem::UI::TrackedDeviceRaycaster::RaycastHitData
    struct RaycastHitData;
    // Nested type: ::UnityEngine::InputSystem::UI::TrackedDeviceRaycaster::$$c
    class $$c;
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.UI.TrackedDeviceRaycaster/UnityEngine.InputSystem.UI.RaycastHitData
    // [TokenAttribute] Offset: FFFFFFFF
    struct RaycastHitData/*, public ::System::ValueType*/ {
      public:
      public:
      // private readonly UnityEngine.UI.Graphic <graphic>k__BackingField
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UI::Graphic* graphic;
      // Field size check
      static_assert(sizeof(::UnityEngine::UI::Graphic*) == 0x8);
      // private readonly UnityEngine.Vector3 <worldHitPosition>k__BackingField
      // Size: 0xC
      // Offset: 0x8
      ::UnityEngine::Vector3 worldHitPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private readonly UnityEngine.Vector2 <screenPosition>k__BackingField
      // Size: 0x8
      // Offset: 0x14
      ::UnityEngine::Vector2 screenPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      // private readonly System.Single <distance>k__BackingField
      // Size: 0x4
      // Offset: 0x1C
      float distance;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: RaycastHitData
      constexpr RaycastHitData(::UnityEngine::UI::Graphic* graphic_ = {}, ::UnityEngine::Vector3 worldHitPosition_ = {}, ::UnityEngine::Vector2 screenPosition_ = {}, float distance_ = {}) noexcept : graphic{graphic_}, worldHitPosition{worldHitPosition_}, screenPosition{screenPosition_}, distance{distance_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private readonly UnityEngine.UI.Graphic <graphic>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Graphic*& dyn_$graphic$k__BackingField();
      // Get instance field reference: private readonly UnityEngine.Vector3 <worldHitPosition>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_$worldHitPosition$k__BackingField();
      // Get instance field reference: private readonly UnityEngine.Vector2 <screenPosition>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_$screenPosition$k__BackingField();
      // Get instance field reference: private readonly System.Single <distance>k__BackingField
      [[deprecated("Use field access instead!")]] float& dyn_$distance$k__BackingField();
      // public UnityEngine.UI.Graphic get_graphic()
      // Offset: 0xA4EFD8
      ::UnityEngine::UI::Graphic* get_graphic();
      // public UnityEngine.Vector3 get_worldHitPosition()
      // Offset: 0xA4EFE0
      ::UnityEngine::Vector3 get_worldHitPosition();
      // public UnityEngine.Vector2 get_screenPosition()
      // Offset: 0xA4EFEC
      ::UnityEngine::Vector2 get_screenPosition();
      // public System.Single get_distance()
      // Offset: 0xA4EFF4
      float get_distance();
      // public System.Void .ctor(UnityEngine.UI.Graphic graphic, UnityEngine.Vector3 worldHitPosition, UnityEngine.Vector2 screenPosition, System.Single distance)
      // Offset: 0xA4EFC4
      // ABORTED: conflicts with another method.  RaycastHitData(::UnityEngine::UI::Graphic* graphic, ::UnityEngine::Vector3 worldHitPosition, ::UnityEngine::Vector2 screenPosition, float distance);
    }; // UnityEngine.InputSystem.UI.TrackedDeviceRaycaster/UnityEngine.InputSystem.UI.RaycastHitData
    #pragma pack(pop)
    static check_size<sizeof(TrackedDeviceRaycaster::RaycastHitData), 28 + sizeof(float)> __UnityEngine_InputSystem_UI_TrackedDeviceRaycaster_RaycastHitDataSizeCheck;
    static_assert(sizeof(TrackedDeviceRaycaster::RaycastHitData) == 0x20);
    public:
    // private System.Collections.Generic.List`1<UnityEngine.InputSystem.UI.TrackedDeviceRaycaster/UnityEngine.InputSystem.UI.RaycastHitData> m_RaycastResultsCache
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::InputSystem::UI::TrackedDeviceRaycaster::RaycastHitData>* m_RaycastResultsCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::InputSystem::UI::TrackedDeviceRaycaster::RaycastHitData>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x95B924
    // private System.Boolean m_IgnoreReversedGraphics
    // Size: 0x1
    // Offset: 0x28
    bool m_IgnoreReversedGraphics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [FormerlySerializedAsAttribute] Offset: 0x95B970
    // private System.Boolean m_CheckFor2DOcclusion
    // Size: 0x1
    // Offset: 0x29
    bool m_CheckFor2DOcclusion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [FormerlySerializedAsAttribute] Offset: 0x95B9BC
    // private System.Boolean m_CheckFor3DOcclusion
    // Size: 0x1
    // Offset: 0x2A
    bool m_CheckFor3DOcclusion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CheckFor3DOcclusion and: m_MaxDistance
    char __padding3[0x1] = {};
    // [TooltipAttribute] Offset: 0x95BA08
    // private System.Single m_MaxDistance
    // Size: 0x4
    // Offset: 0x2C
    float m_MaxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.LayerMask m_BlockingMask
    // Size: 0x4
    // Offset: 0x30
    ::UnityEngine::LayerMask m_BlockingMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // Padding between fields: m_BlockingMask and: m_Canvas
    char __padding5[0x4] = {};
    // private UnityEngine.Canvas m_Canvas
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Canvas* m_Canvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    public:
    // Get static field: static UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.UI.TrackedDeviceRaycaster> s_Instances
    static ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::UI::TrackedDeviceRaycaster*> _get_s_Instances();
    // Set static field: static UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.UI.TrackedDeviceRaycaster> s_Instances
    static void _set_s_Instances(::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::UI::TrackedDeviceRaycaster*> value);
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.InputSystem.UI.TrackedDeviceRaycaster/UnityEngine.InputSystem.UI.RaycastHitData> s_SortedGraphics
