// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.UIntPtr
#include "System/UIntPtr.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Runtime::Remoting::Messaging
namespace System::Runtime::Remoting::Messaging {
  // Forward declaring type: IMessageSink
  class IMessageSink;
  // Forward declaring type: IMessage
  class IMessage;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Runtime::Remoting::Contexts
namespace System::Runtime::Remoting::Contexts {
  // Forward declaring type: IContextProperty
  class IContextProperty;
  // Forward declaring type: DynamicPropertyCollection
  class DynamicPropertyCollection;
  // Forward declaring type: ContextCallbackObject
  class ContextCallbackObject;
  // Forward declaring type: IDynamicProperty
  class IDynamicProperty;
  // Forward declaring type: CrossContextDelegate
  class CrossContextDelegate;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: LocalDataStoreHolder
  class LocalDataStoreHolder;
  // Forward declaring type: LocalDataStoreMgr
  class LocalDataStoreMgr;
  // Forward declaring type: LocalDataStore
  class LocalDataStore;
  // Forward declaring type: ContextBoundObject
  class ContextBoundObject;
  // Forward declaring type: MarshalByRefObject
  class MarshalByRefObject;
  // Forward declaring type: LocalDataStoreSlot
  class LocalDataStoreSlot;
}
// Forward declaring namespace: System::Runtime::Remoting::Activation
namespace System::Runtime::Remoting::Activation {
  // Forward declaring type: IConstructionCallMessage
  class IConstructionCallMessage;
}
// Completed forward declares
// Type namespace: System.Runtime.Remoting.Contexts
namespace System::Runtime::Remoting::Contexts {
  // Forward declaring type: Context
  class Context;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Runtime::Remoting::Contexts::Context);
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::Remoting::Contexts::Context*, "System.Runtime.Remoting.Contexts", "Context");
// Type namespace: System.Runtime.Remoting.Contexts
namespace System::Runtime::Remoting::Contexts {
  // Size: 0x58
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Runtime.Remoting.Contexts.Context
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: EA129C
  class Context : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Int32 domain_id
    // Size: 0x4
    // Offset: 0x10
    int domain_id;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 context_id
    // Size: 0x4
    // Offset: 0x14
    int context_id;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.UIntPtr static_data
    // Size: 0x8
    // Offset: 0x18
    System::UIntPtr static_data;
    // Field size check
    static_assert(sizeof(System::UIntPtr) == 0x8);
    // private System.UIntPtr data
    // Size: 0x8
    // Offset: 0x20
    System::UIntPtr data;
    // Field size check
    static_assert(sizeof(System::UIntPtr) == 0x8);
    // private System.Runtime.Remoting.Messaging.IMessageSink server_context_sink_chain
    // Size: 0x8
    // Offset: 0x28
    System::Runtime::Remoting::Messaging::IMessageSink* server_context_sink_chain;
    // Field size check
    static_assert(sizeof(System::Runtime::Remoting::Messaging::IMessageSink*) == 0x8);
    // private System.Runtime.Remoting.Messaging.IMessageSink client_context_sink_chain
    // Size: 0x8
    // Offset: 0x30
    System::Runtime::Remoting::Messaging::IMessageSink* client_context_sink_chain;
    // Field size check
    static_assert(sizeof(System::Runtime::Remoting::Messaging::IMessageSink*) == 0x8);
    // private System.Collections.Generic.List`1<System.Runtime.Remoting.Contexts.IContextProperty> context_properties
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Generic::List_1<System::Runtime::Remoting::Contexts::IContextProperty*>* context_properties;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<System::Runtime::Remoting::Contexts::IContextProperty*>*) == 0x8);
    // private System.LocalDataStoreHolder _localDataStore
    // Size: 0x8
    // Offset: 0x40
    System::LocalDataStoreHolder* localDataStore;
    // Field size check
    static_assert(sizeof(System::LocalDataStoreHolder*) == 0x8);
    // private System.Runtime.Remoting.Contexts.DynamicPropertyCollection context_dynamic_properties
    // Size: 0x8
    // Offset: 0x48
    System::Runtime::Remoting::Contexts::DynamicPropertyCollection* context_dynamic_properties;
    // Field size check
    static_assert(sizeof(System::Runtime::Remoting::Contexts::DynamicPropertyCollection*) == 0x8);
    // private System.Runtime.Remoting.Contexts.ContextCallbackObject callback_object
    // Size: 0x8
    // Offset: 0x50
    System::Runtime::Remoting::Contexts::ContextCallbackObject* callback_object;
    // Field size check
    static_assert(sizeof(System::Runtime::Remoting::Contexts::ContextCallbackObject*) == 0x8);
    public:
    // Get static field: static private System.Object[] local_slots
    static ::ArrayW<::Il2CppObject*> _get_local_slots();
    // Set static field: static private System.Object[] local_slots
    static void _set_local_slots(::ArrayW<::Il2CppObject*> value);
    // Get static field: static private System.Runtime.Remoting.Messaging.IMessageSink default_server_context_sink
    static System::Runtime::Remoting::Messaging::IMessageSink* _get_default_server_context_sink();
    // Set static field: static private System.Runtime.Remoting.Messaging.IMessageSink default_server_context_sink
    static void _set_default_server_context_sink(System::Runtime::Remoting::Messaging::IMessageSink* value);
