// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Security.Cryptography.ICryptoTransform
#include "System/Security/Cryptography/ICryptoTransform.hpp"
// Including type: System.Security.Cryptography.CipherMode
#include "System/Security/Cryptography/CipherMode.hpp"
// Including type: System.Security.Cryptography.PaddingMode
#include "System/Security/Cryptography/PaddingMode.hpp"
// Including type: System.Security.Cryptography.RijndaelManagedTransformMode
#include "System/Security/Cryptography/RijndaelManagedTransformMode.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: System.Security.Cryptography
namespace System::Security::Cryptography {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: System.Security.Cryptography.RijndaelManagedTransform
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: D9CC68
  class RijndaelManagedTransform : public ::Il2CppObject/*, public System::Security::Cryptography::ICryptoTransform*/ {
    public:
    // private System.Security.Cryptography.CipherMode m_cipherMode
    // Size: 0x4
    // Offset: 0x10
    System::Security::Cryptography::CipherMode m_cipherMode;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::CipherMode) == 0x4);
    // private System.Security.Cryptography.PaddingMode m_paddingValue
    // Size: 0x4
    // Offset: 0x14
    System::Security::Cryptography::PaddingMode m_paddingValue;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::PaddingMode) == 0x4);
    // private System.Security.Cryptography.RijndaelManagedTransformMode m_transformMode
    // Size: 0x4
    // Offset: 0x18
    System::Security::Cryptography::RijndaelManagedTransformMode m_transformMode;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::RijndaelManagedTransformMode) == 0x4);
    // private System.Int32 m_blockSizeBits
    // Size: 0x4
    // Offset: 0x1C
    int m_blockSizeBits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_blockSizeBytes
    // Size: 0x4
    // Offset: 0x20
    int m_blockSizeBytes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_inputBlockSize
    // Size: 0x4
    // Offset: 0x24
    int m_inputBlockSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_outputBlockSize
    // Size: 0x4
    // Offset: 0x28
    int m_outputBlockSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_outputBlockSize and: m_encryptKeyExpansion
    char __padding6[0x4] = {};
    // private System.Int32[] m_encryptKeyExpansion
    // Size: 0x8
    // Offset: 0x30
    ::Array<int>* m_encryptKeyExpansion;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Int32[] m_decryptKeyExpansion
    // Size: 0x8
    // Offset: 0x38
    ::Array<int>* m_decryptKeyExpansion;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Int32 m_Nr
    // Size: 0x4
    // Offset: 0x40
    int m_Nr;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_Nb
    // Size: 0x4
    // Offset: 0x44
    int m_Nb;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_Nk
    // Size: 0x4
    // Offset: 0x48
    int m_Nk;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_Nk and: m_encryptindex
    char __padding11[0x4] = {};
    // private System.Int32[] m_encryptindex
    // Size: 0x8
    // Offset: 0x50
    ::Array<int>* m_encryptindex;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Int32[] m_decryptindex
    // Size: 0x8
    // Offset: 0x58
    ::Array<int>* m_decryptindex;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Int32[] m_IV
    // Size: 0x8
    // Offset: 0x60
    ::Array<int>* m_IV;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Int32[] m_lastBlockBuffer
    // Size: 0x8
    // Offset: 0x68
    ::Array<int>* m_lastBlockBuffer;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Byte[] m_depadBuffer
    // Size: 0x8
    // Offset: 0x70
    ::Array<uint8_t>* m_depadBuffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] m_shiftRegister
    // Size: 0x8
    // Offset: 0x78
    ::Array<uint8_t>* m_shiftRegister;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // Creating value type constructor for type: RijndaelManagedTransform
