// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Voice.Unity.VoiceComponent
#include "Photon/Voice/Unity/VoiceComponent.hpp"
// Including type: POpusCodec.Enums.SamplingRate
#include "POpusCodec/Enums/SamplingRate.hpp"
// Including type: Photon.Voice.OpusCodec/Photon.Voice.FrameDuration
#include "Photon/Voice/OpusCodec_FrameDuration.hpp"
// Including type: Photon.Voice.Unity.NativeAndroidMicrophoneSettings
#include "Photon/Voice/Unity/NativeAndroidMicrophoneSettings.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: Photon.Voice.AudioUtil
#include "Photon/Voice/AudioUtil.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
  // Forward declaring type: Array
  class Array;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: VoiceConnection
  class VoiceConnection;
  // Forward declaring type: AudioInEnumerator
  class AudioInEnumerator;
  // Skipping declaration: InputSourceType because it is already included!
  // Skipping declaration: MicType because it is already included!
  // Skipping declaration: SampleTypeConv because it is already included!
}
// Forward declaring namespace: Photon::Voice
namespace Photon::Voice {
  // Forward declaring type: LocalVoice
  class LocalVoice;
  // Forward declaring type: IAudioDesc
  class IAudioDesc;
  // Forward declaring type: VoiceClient
  class VoiceClient;
  // Forward declaring type: IAudioInChangeNotifier
  class IAudioInChangeNotifier;
  // Forward declaring type: IDeviceEnumerator
  class IDeviceEnumerator;
  // Forward declaring type: ILocalVoiceAudio
  class ILocalVoiceAudio;
  // Forward declaring type: DeviceInfo
  struct DeviceInfo;
}
// Completed forward declares
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: Recorder
  class Recorder;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Voice::Unity::Recorder);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Voice::Unity::Recorder*, "Photon.Voice.Unity", "Recorder");
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Voice.Unity.Recorder
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 9558A4
  // [HelpURLAttribute] Offset: 9558A4
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class Recorder : public ::Photon::Voice::Unity::VoiceComponent {
    public:
    // Nested type: ::Photon::Voice::Unity::Recorder::InputSourceType
    struct InputSourceType;
    // Nested type: ::Photon::Voice::Unity::Recorder::MicType
    struct MicType;
    // Nested type: ::Photon::Voice::Unity::Recorder::SampleTypeConv
    struct SampleTypeConv;
    // Nested type: ::Photon::Voice::Unity::Recorder::PhotonVoiceCreatedParams
    class PhotonVoiceCreatedParams;
    // Nested type: ::Photon::Voice::Unity::Recorder::$$c__DisplayClass175_0
    class $$c__DisplayClass175_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputSourceType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputSourceType
      constexpr InputSourceType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType Microphone
      static constexpr const int Microphone = 0;
      // Get static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType Microphone
      static ::Photon::Voice::Unity::Recorder::InputSourceType _get_Microphone();
      // Set static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType Microphone
      static void _set_Microphone(::Photon::Voice::Unity::Recorder::InputSourceType value);
      // static field const value: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType AudioClip
      static constexpr const int AudioClip = 1;
      // Get static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType AudioClip
      static ::Photon::Voice::Unity::Recorder::InputSourceType _get_AudioClip();
      // Set static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType AudioClip
      static void _set_AudioClip(::Photon::Voice::Unity::Recorder::InputSourceType value);
      // static field const value: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType Factory
      static constexpr const int Factory = 2;
      // Get static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType Factory
      static ::Photon::Voice::Unity::Recorder::InputSourceType _get_Factory();
      // Set static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType Factory
      static void _set_Factory(::Photon::Voice::Unity::Recorder::InputSourceType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType
    #pragma pack(pop)
    static check_size<sizeof(Recorder::InputSourceType), 0 + sizeof(int)> __Photon_Voice_Unity_Recorder_InputSourceTypeSizeCheck;
    static_assert(sizeof(Recorder::InputSourceType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Photon.Voice.Unity.Recorder/Photon.Voice.Unity.MicType
    // [TokenAttribute] Offset: FFFFFFFF
    struct MicType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: MicType
      constexpr MicType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.MicType Unity
      static constexpr const int Unity = 0;
      // Get static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.MicType Unity
      static ::Photon::Voice::Unity::Recorder::MicType _get_Unity();
      // Set static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.MicType Unity
      static void _set_Unity(::Photon::Voice::Unity::Recorder::MicType value);
      // static field const value: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.MicType Photon
      static constexpr const int Photon = 1;
      // Get static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.MicType Photon
      static ::Photon::Voice::Unity::Recorder::MicType _get_Photon();
      // Set static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.MicType Photon
      static void _set_Photon(::Photon::Voice::Unity::Recorder::MicType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Photon.Voice.Unity.Recorder/Photon.Voice.Unity.MicType
    #pragma pack(pop)
    static check_size<sizeof(Recorder::MicType), 0 + sizeof(int)> __Photon_Voice_Unity_Recorder_MicTypeSizeCheck;
    static_assert(sizeof(Recorder::MicType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Photon.Voice.Unity.Recorder/Photon.Voice.Unity.SampleTypeConv
    // [TokenAttribute] Offset: FFFFFFFF
    // [ObsoleteAttribute] Offset: 955DB4
    struct SampleTypeConv/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SampleTypeConv
      constexpr SampleTypeConv(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.SampleTypeConv None
      static constexpr const int None = 0;
      // Get static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.SampleTypeConv None
      static ::Photon::Voice::Unity::Recorder::SampleTypeConv _get_None();
      // Set static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.SampleTypeConv None
      static void _set_None(::Photon::Voice::Unity::Recorder::SampleTypeConv value);
      // static field const value: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.SampleTypeConv Short
      static constexpr const int Short = 1;
      // Get static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.SampleTypeConv Short
      static ::Photon::Voice::Unity::Recorder::SampleTypeConv _get_Short();
      // Set static field: static public Photon.Voice.Unity.Recorder/Photon.Voice.Unity.SampleTypeConv Short
      static void _set_Short(::Photon::Voice::Unity::Recorder::SampleTypeConv value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Photon.Voice.Unity.Recorder/Photon.Voice.Unity.SampleTypeConv
    #pragma pack(pop)
    static check_size<sizeof(Recorder::SampleTypeConv), 0 + sizeof(int)> __Photon_Voice_Unity_Recorder_SampleTypeConvSizeCheck;
    static_assert(sizeof(Recorder::SampleTypeConv) == 0x4);
    public:
    // private System.Boolean voiceDetection
    // Size: 0x1
    // Offset: 0x22
    bool voiceDetection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: voiceDetection and: voiceDetectionThreshold
    char __padding0[0x1] = {};
    // private System.Single voiceDetectionThreshold
    // Size: 0x4
    // Offset: 0x24
    float voiceDetectionThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 voiceDetectionDelayMs
    // Size: 0x4
    // Offset: 0x28
    int voiceDetectionDelayMs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: voiceDetectionDelayMs and: userData
    char __padding2[0x4] = {};
    // private System.Object userData
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppObject* userData;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private Photon.Voice.LocalVoice voice
    // Size: 0x8
    // Offset: 0x38
    ::Photon::Voice::LocalVoice* voice;
    // Field size check
    static_assert(sizeof(::Photon::Voice::LocalVoice*) == 0x8);
    // private System.String unityMicrophoneDevice
    // Size: 0x8
    // Offset: 0x40
    ::StringW unityMicrophoneDevice;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 photonMicrophoneDeviceId
    // Size: 0x4
    // Offset: 0x48
    int photonMicrophoneDeviceId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: photonMicrophoneDeviceId and: inputSource
    char __padding6[0x4] = {};
    // private Photon.Voice.IAudioDesc inputSource
    // Size: 0x8
    // Offset: 0x50
    ::Photon::Voice::IAudioDesc* inputSource;
    // Field size check
    static_assert(sizeof(::Photon::Voice::IAudioDesc*) == 0x8);
    // private Photon.Voice.VoiceClient client
    // Size: 0x8
    // Offset: 0x58
    ::Photon::Voice::VoiceClient* client;
    // Field size check
    static_assert(sizeof(::Photon::Voice::VoiceClient*) == 0x8);
    // private Photon.Voice.Unity.VoiceConnection voiceConnection
    // Size: 0x8
    // Offset: 0x60
    ::Photon::Voice::Unity::VoiceConnection* voiceConnection;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::VoiceConnection*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x955EB4
    // private System.Byte interestGroup
    // Size: 0x1
    // Offset: 0x68
    uint8_t interestGroup;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean debugEchoMode
    // Size: 0x1
    // Offset: 0x69
    bool debugEchoMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean reliableMode
    // Size: 0x1
    // Offset: 0x6A
    bool reliableMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean encrypt
    // Size: 0x1
    // Offset: 0x6B
    bool encrypt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean transmitEnabled
    // Size: 0x1
    // Offset: 0x6C
    bool transmitEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: transmitEnabled and: samplingRate
    char __padding14[0x3] = {};
    // private POpusCodec.Enums.SamplingRate samplingRate
    // Size: 0x4
    // Offset: 0x70
    ::POpusCodec::Enums::SamplingRate samplingRate;
    // Field size check
    static_assert(sizeof(::POpusCodec::Enums::SamplingRate) == 0x4);
    // private Photon.Voice.OpusCodec/Photon.Voice.FrameDuration frameDuration
    // Size: 0x4
    // Offset: 0x74
    ::Photon::Voice::OpusCodec::FrameDuration frameDuration;
    // Field size check
    static_assert(sizeof(::Photon::Voice::OpusCodec::FrameDuration) == 0x4);
    // [RangeAttribute] Offset: 0x955F60
    // private System.Int32 bitrate
    // Size: 0x4
    // Offset: 0x78
    int bitrate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Photon.Voice.Unity.Recorder/Photon.Voice.Unity.InputSourceType sourceType
    // Size: 0x4
    // Offset: 0x7C
    ::Photon::Voice::Unity::Recorder::InputSourceType sourceType;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder::InputSourceType) == 0x4);
    // private Photon.Voice.Unity.Recorder/Photon.Voice.Unity.MicType microphoneType
    // Size: 0x4
    // Offset: 0x80
    ::Photon::Voice::Unity::Recorder::MicType microphoneType;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder::MicType) == 0x4);
    // Padding between fields: microphoneType and: audioClip
    char __padding19[0x4] = {};
    // private UnityEngine.AudioClip audioClip
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::AudioClip* audioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean loopAudioClip
    // Size: 0x1
    // Offset: 0x90
    bool loopAudioClip;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isRecording
    // Size: 0x1
    // Offset: 0x91
    bool isRecording;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isRecording and: inputFactory
    char __padding22[0x6] = {};
    // private System.Func`1<Photon.Voice.IAudioDesc> inputFactory
    // Size: 0x8
    // Offset: 0x98
    ::System::Func_1<::Photon::Voice::IAudioDesc*>* inputFactory;
    // Field size check
    static_assert(sizeof(::System::Func_1<::Photon::Voice::IAudioDesc*>*) == 0x8);
    // private Photon.Voice.IAudioInChangeNotifier photonMicChangeNotifier
    // Size: 0x8
    // Offset: 0xA0
    ::Photon::Voice::IAudioInChangeNotifier* photonMicChangeNotifier;
    // Field size check
    static_assert(sizeof(::Photon::Voice::IAudioInChangeNotifier*) == 0x8);
    // private System.Boolean reactOnSystemChanges
    // Size: 0x1
    // Offset: 0xA8
    bool reactOnSystemChanges;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean subscribedToSystemChangesPhoton
    // Size: 0x1
    // Offset: 0xA9
    bool subscribedToSystemChangesPhoton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean subscribedToSystemChangesUnity
    // Size: 0x1
    // Offset: 0xAA
    bool subscribedToSystemChangesUnity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean autoStart
    // Size: 0x1
    // Offset: 0xAB
    bool autoStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Photon.Voice.Unity.NativeAndroidMicrophoneSettings nativeAndroidMicrophoneSettings
    // Size: 0x3
    // Offset: 0xAC
    ::Photon::Voice::Unity::NativeAndroidMicrophoneSettings nativeAndroidMicrophoneSettings;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::NativeAndroidMicrophoneSettings) == 0x3);
    // private System.Boolean recordOnlyWhenEnabled
    // Size: 0x1
    // Offset: 0xAF
    bool recordOnlyWhenEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean skipDeviceChangeChecks
    // Size: 0x1
    // Offset: 0xB0
    bool skipDeviceChangeChecks;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean wasRecordingBeforePause
    // Size: 0x1
    // Offset: 0xB1
    bool wasRecordingBeforePause;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isPausedOrInBackground
    // Size: 0x1
    // Offset: 0xB2
    bool isPausedOrInBackground;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean stopRecordingWhenPaused
    // Size: 0x1
    // Offset: 0xB3
    bool stopRecordingWhenPaused;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean useOnAudioFilterRead
    // Size: 0x1
    // Offset: 0xB4
    bool useOnAudioFilterRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean trySamplingRateMatch
    // Size: 0x1
    // Offset: 0xB5
    bool trySamplingRateMatch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean useMicrophoneTypeFallback
    // Size: 0x1
    // Offset: 0xB6
    bool useMicrophoneTypeFallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean recordOnlyWhenJoined
    // Size: 0x1
    // Offset: 0xB7
    bool recordOnlyWhenJoined;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean recordingStoppedExplicitly
    // Size: 0x1
    // Offset: 0xB8
    bool recordingStoppedExplicitly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: recordingStoppedExplicitly and: photonMicrophonesEnumerator
    char __padding39[0x7] = {};
    // private Photon.Voice.IDeviceEnumerator photonMicrophonesEnumerator
    // Size: 0x8
    // Offset: 0xC0
    ::Photon::Voice::IDeviceEnumerator* photonMicrophonesEnumerator;
    // Field size check
    static_assert(sizeof(::Photon::Voice::IDeviceEnumerator*) == 0x8);
    // private Photon.Voice.Unity.AudioInEnumerator unityMicrophonesEnumerator
    // Size: 0x8
    // Offset: 0xC8
    ::Photon::Voice::Unity::AudioInEnumerator* unityMicrophonesEnumerator;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::AudioInEnumerator*) == 0x8);
    // private System.Object microphoneDeviceChangeDetectedLock
    // Size: 0x8
    // Offset: 0xD0
    ::Il2CppObject* microphoneDeviceChangeDetectedLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Boolean microphoneDeviceChangeDetected
    // Size: 0x1
    // Offset: 0xD8
    bool microphoneDeviceChangeDetected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <RequiresRestart>k__BackingField
    // Size: 0x1
    // Offset: 0xD9
    bool RequiresRestart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: RequiresRestart and: TypeConvert
    char __padding44[0x2] = {};
    // private Photon.Voice.Unity.Recorder/Photon.Voice.Unity.SampleTypeConv <TypeConvert>k__BackingField
    // Size: 0x4
    // Offset: 0xDC
    ::Photon::Voice::Unity::Recorder::SampleTypeConv TypeConvert;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder::SampleTypeConv) == 0x4);
    public:
    // static field const value: static public System.Int32 MIN_OPUS_BITRATE
    static constexpr const int MIN_OPUS_BITRATE = 6000;
    // Get static field: static public System.Int32 MIN_OPUS_BITRATE
    static int _get_MIN_OPUS_BITRATE();
    // Set static field: static public System.Int32 MIN_OPUS_BITRATE
    static void _set_MIN_OPUS_BITRATE(int value);
    // static field const value: static public System.Int32 MAX_OPUS_BITRATE
    static constexpr const int MAX_OPUS_BITRATE = 510000;
    // Get static field: static public System.Int32 MAX_OPUS_BITRATE
    static int _get_MAX_OPUS_BITRATE();
    // Set static field: static public System.Int32 MAX_OPUS_BITRATE
    static void _set_MAX_OPUS_BITRATE(int value);
