// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Voice.Unity.VoiceComponent
#include "Photon/Voice/Unity/VoiceComponent.hpp"
// Including type: Photon.Voice.Unity.PlaybackDelaySettings
#include "Photon/Voice/Unity/PlaybackDelaySettings.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: RemoteVoiceLink
  class RemoteVoiceLink;
}
// Forward declaring namespace: Photon::Voice
namespace Photon::Voice {
  // Forward declaring type: IAudioOut`1<T>
  template<typename T>
  class IAudioOut_1;
  // Forward declaring type: FrameOut`1<T>
  template<typename T>
  class FrameOut_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Completed forward declares
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: Speaker
  class Speaker;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Voice::Unity::Speaker);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Voice::Unity::Speaker*, "Photon.Voice.Unity", "Speaker");
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Size: 0x61
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Voice.Unity.Speaker
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 955914
  // [AddComponentMenu] Offset: 955914
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class Speaker : public ::Photon::Voice::Unity::VoiceComponent {
    public:
    // Writing base type padding for base size: 0x22 to desired offset: 0x28
    char ___base_padding[0x6] = {};
    // Nested type: ::Photon::Voice::Unity::Speaker::$$c__DisplayClass42_0
    class $$c__DisplayClass42_0;
    public:
    // private Photon.Voice.IAudioOut`1<System.Single> audioOutput
    // Size: 0x8
    // Offset: 0x28
    ::Photon::Voice::IAudioOut_1<float>* audioOutput;
    // Field size check
    static_assert(sizeof(::Photon::Voice::IAudioOut_1<float>*) == 0x8);
    // private Photon.Voice.Unity.RemoteVoiceLink remoteVoiceLink
    // Size: 0x8
    // Offset: 0x30
    ::Photon::Voice::Unity::RemoteVoiceLink* remoteVoiceLink;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::RemoteVoiceLink*) == 0x8);
    // private System.Boolean playbackOnlyWhenEnabled
    // Size: 0x1
    // Offset: 0x38
    bool playbackOnlyWhenEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: playbackOnlyWhenEnabled and: playDelayMs
    char __padding2[0x3] = {};
    // private System.Int32 playDelayMs
    // Size: 0x4
    // Offset: 0x3C
    int playDelayMs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Photon.Voice.Unity.PlaybackDelaySettings playbackDelaySettings
    // Size: 0xC
    // Offset: 0x40
    ::Photon::Voice::Unity::PlaybackDelaySettings playbackDelaySettings;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::PlaybackDelaySettings) == 0xC);
    // private System.Boolean playbackExplicitlyStopped
    // Size: 0x1
    // Offset: 0x4C
    bool playbackExplicitlyStopped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: playbackExplicitlyStopped and: OnRemoteVoiceRemoveAction
    char __padding5[0x3] = {};
    // private System.Action`1<Photon.Voice.Unity.Speaker> <OnRemoteVoiceRemoveAction>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_1<::Photon::Voice::Unity::Speaker*>* OnRemoteVoiceRemoveAction;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Photon::Voice::Unity::Speaker*>*) == 0x8);
    // private Photon.Realtime.Player <Actor>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::Photon::Realtime::Player* Actor;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private System.Boolean <PlaybackStarted>k__BackingField
    // Size: 0x1
    // Offset: 0x60
    bool PlaybackStarted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private Photon.Voice.IAudioOut`1<System.Single> audioOutput
    [[deprecated("Use field access instead!")]] ::Photon::Voice::IAudioOut_1<float>*& dyn_audioOutput();
    // Get instance field reference: private Photon.Voice.Unity.RemoteVoiceLink remoteVoiceLink
    [[deprecated("Use field access instead!")]] ::Photon::Voice::Unity::RemoteVoiceLink*& dyn_remoteVoiceLink();
    // Get instance field reference: private System.Boolean playbackOnlyWhenEnabled
    [[deprecated("Use field access instead!")]] bool& dyn_playbackOnlyWhenEnabled();
    // Get instance field reference: private System.Int32 playDelayMs
    [[deprecated("Use field access instead!")]] int& dyn_playDelayMs();
    // Get instance field reference: private Photon.Voice.Unity.PlaybackDelaySettings playbackDelaySettings
