// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Realtime.ConnectionHandler
#include "Photon/Realtime/ConnectionHandler.hpp"
// Including type: Photon.Voice.Unity.ILoggable
#include "Photon/Voice/Unity/ILoggable.hpp"
// Including type: ExitGames.Client.Photon.DebugLevel
#include "ExitGames/Client/Photon/DebugLevel.hpp"
// Including type: Photon.Voice.Unity.PlaybackDelaySettings
#include "Photon/Voice/Unity/PlaybackDelaySettings.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: VoiceLogger
  class VoiceLogger;
  // Forward declaring type: RemoteVoiceLink
  class RemoteVoiceLink;
  // Forward declaring type: Recorder
  class Recorder;
  // Forward declaring type: Speaker
  class Speaker;
}
// Forward declaring namespace: Photon::Voice
namespace Photon::Voice {
  // Forward declaring type: LoadBalancingTransport
  class LoadBalancingTransport;
  // Forward declaring type: VoiceClient
  class VoiceClient;
  // Forward declaring type: VoiceInfo
  struct VoiceInfo;
  // Forward declaring type: RemoteVoiceOptions
  struct RemoteVoiceOptions;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: SupportLogger
  class SupportLogger;
  // Forward declaring type: AppSettings
  class AppSettings;
  // Forward declaring type: ClientState
  struct ClientState;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`4<T1, T2, T3, TResult>
  template<typename T1, typename T2, typename T3, typename TResult>
  class Func_4;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: VoiceConnection
  class VoiceConnection;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Voice::Unity::VoiceConnection);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Voice::Unity::VoiceConnection*, "Photon.Voice.Unity", "VoiceConnection");
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Size: 0x104
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Voice.Unity.VoiceConnection
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 9559E4
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: 9559E4
  class VoiceConnection : public ::Photon::Realtime::ConnectionHandler/*, public ::Photon::Voice::Unity::ILoggable*/ {
    public:
    // Nested type: ::Photon::Voice::Unity::VoiceConnection::$$c__DisplayClass98_0
    class $$c__DisplayClass98_0;
    // Nested type: ::Photon::Voice::Unity::VoiceConnection::$$c__DisplayClass102_0
    class $$c__DisplayClass102_0;
    public:
    // private Photon.Voice.Unity.VoiceLogger logger
    // Size: 0x8
    // Offset: 0x38
    ::Photon::Voice::Unity::VoiceLogger* logger;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::VoiceLogger*) == 0x8);
    // private ExitGames.Client.Photon.DebugLevel logLevel
    // Size: 0x1
    // Offset: 0x40
    ::ExitGames::Client::Photon::DebugLevel logLevel;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::DebugLevel) == 0x1);
    // Padding between fields: logLevel and: client
    char __padding1[0x7] = {};
    // private Photon.Voice.LoadBalancingTransport client
    // Size: 0x8
    // Offset: 0x48
    ::Photon::Voice::LoadBalancingTransport* client;
    // Field size check
    static_assert(sizeof(::Photon::Voice::LoadBalancingTransport*) == 0x8);
    // private System.Boolean enableSupportLogger
    // Size: 0x1
    // Offset: 0x50
    bool enableSupportLogger;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableSupportLogger and: supportLoggerComponent
    char __padding3[0x7] = {};
    // private Photon.Realtime.SupportLogger supportLoggerComponent
    // Size: 0x8
    // Offset: 0x58
    ::Photon::Realtime::SupportLogger* supportLoggerComponent;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::SupportLogger*) == 0x8);
    // private System.Int32 updateInterval
    // Size: 0x4
    // Offset: 0x60
    int updateInterval;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 nextSendTickCount
    // Size: 0x4
    // Offset: 0x64
    int nextSendTickCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 statsResetInterval
    // Size: 0x4
    // Offset: 0x68
    int statsResetInterval;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 nextStatsTickCount
    // Size: 0x4
    // Offset: 0x6C
    int nextStatsTickCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single statsReferenceTime
    // Size: 0x4
    // Offset: 0x70
    float statsReferenceTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 referenceFramesLost
    // Size: 0x4
    // Offset: 0x74
    int referenceFramesLost;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 referenceFramesReceived
    // Size: 0x4
    // Offset: 0x78
    int referenceFramesReceived;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: referenceFramesReceived and: speakerPrefab
    char __padding11[0x4] = {};
    // private UnityEngine.GameObject speakerPrefab
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* speakerPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean cleanedUp
    // Size: 0x1
    // Offset: 0x88
    bool cleanedUp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cleanedUp and: cachedRemoteVoices
    char __padding13[0x7] = {};
    // protected System.Collections.Generic.List`1<Photon.Voice.Unity.RemoteVoiceLink> cachedRemoteVoices
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::List_1<::Photon::Voice::Unity::RemoteVoiceLink*>* cachedRemoteVoices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Voice::Unity::RemoteVoiceLink*>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x9561F8
    // private Photon.Voice.Unity.Recorder primaryRecorder
    // Size: 0x8
    // Offset: 0x98
    ::Photon::Voice::Unity::Recorder* primaryRecorder;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder*) == 0x8);
    // private System.Boolean primaryRecorderInitialized
    // Size: 0x1
    // Offset: 0xA0
    bool primaryRecorderInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private ExitGames.Client.Photon.DebugLevel globalRecordersLogLevel
    // Size: 0x1
    // Offset: 0xA1
    ::ExitGames::Client::Photon::DebugLevel globalRecordersLogLevel;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::DebugLevel) == 0x1);
    // private ExitGames.Client.Photon.DebugLevel globalSpeakersLogLevel
    // Size: 0x1
    // Offset: 0xA2
    ::ExitGames::Client::Photon::DebugLevel globalSpeakersLogLevel;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::DebugLevel) == 0x1);
    // Padding between fields: globalSpeakersLogLevel and: globalPlaybackDelay
    char __padding18[0x1] = {};
    // private System.Int32 globalPlaybackDelay
    // Size: 0x4
    // Offset: 0xA4
    int globalPlaybackDelay;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Photon.Voice.Unity.PlaybackDelaySettings globalPlaybackDelaySettings
    // Size: 0xC
    // Offset: 0xA8
    ::Photon::Voice::Unity::PlaybackDelaySettings globalPlaybackDelaySettings;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::PlaybackDelaySettings) == 0xC);
    // Padding between fields: globalPlaybackDelaySettings and: linkedSpeakers
    char __padding20[0x4] = {};
    // private System.Collections.Generic.List`1<Photon.Voice.Unity.Speaker> linkedSpeakers
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::List_1<::Photon::Voice::Unity::Speaker*>* linkedSpeakers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Voice::Unity::Speaker*>*) == 0x8);
    // private System.Collections.Generic.List`1<Photon.Voice.Unity.Recorder> initializedRecorders
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::Photon::Voice::Unity::Recorder*>* initializedRecorders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Voice::Unity::Recorder*>*) == 0x8);
    // public Photon.Realtime.AppSettings Settings
    // Size: 0x8
    // Offset: 0xC8
    ::Photon::Realtime::AppSettings* Settings;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::AppSettings*) == 0x8);
    // public System.Func`4<System.Int32,System.Byte,System.Object,Photon.Voice.Unity.Speaker> SpeakerFactory
    // Size: 0x8
    // Offset: 0xD0
    ::System::Func_4<int, uint8_t, ::Il2CppObject*, ::Photon::Voice::Unity::Speaker*>* SpeakerFactory;
    // Field size check
    static_assert(sizeof(::System::Func_4<int, uint8_t, ::Il2CppObject*, ::Photon::Voice::Unity::Speaker*>*) == 0x8);
    // private System.Action`1<Photon.Voice.Unity.Speaker> SpeakerLinked
    // Size: 0x8
    // Offset: 0xD8
    ::System::Action_1<::Photon::Voice::Unity::Speaker*>* SpeakerLinked;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Photon::Voice::Unity::Speaker*>*) == 0x8);
    // private System.Action`1<Photon.Voice.Unity.RemoteVoiceLink> RemoteVoiceAdded
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action_1<::Photon::Voice::Unity::RemoteVoiceLink*>* RemoteVoiceAdded;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Photon::Voice::Unity::RemoteVoiceLink*>*) == 0x8);
    // public System.Single MinimalTimeScaleToDispatchInFixedUpdate
    // Size: 0x4
    // Offset: 0xE8
    float MinimalTimeScaleToDispatchInFixedUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean AutoCreateSpeakerIfNotFound
    // Size: 0x1
    // Offset: 0xEC
    bool AutoCreateSpeakerIfNotFound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AutoCreateSpeakerIfNotFound and: MaxDatagrams
    char __padding28[0x3] = {};
    // public System.Int32 MaxDatagrams
    // Size: 0x4
    // Offset: 0xF0
    int MaxDatagrams;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean SendAsap
    // Size: 0x1
    // Offset: 0xF4
    bool SendAsap;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: SendAsap and: FramesReceivedPerSecond
    char __padding30[0x3] = {};
    // private System.Single <FramesReceivedPerSecond>k__BackingField
    // Size: 0x4
    // Offset: 0xF8
    float FramesReceivedPerSecond;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <FramesLostPerSecond>k__BackingField
    // Size: 0x4
    // Offset: 0xFC
    float FramesLostPerSecond;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <FramesLostPercent>k__BackingField
    // Size: 0x4
    // Offset: 0x100
    float FramesLostPercent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Photon::Voice::Unity::ILoggable
    operator ::Photon::Voice::Unity::ILoggable() noexcept {
      return *reinterpret_cast<::Photon::Voice::Unity::ILoggable*>(this);
    }
    // static field const value: static private System.String PlayerPrefsKey
    static constexpr const char* PlayerPrefsKey = "VoiceCloudBestRegion";
    // Get static field: static private System.String PlayerPrefsKey
    static ::StringW _get_PlayerPrefsKey();
    // Set static field: static private System.String PlayerPrefsKey
    static void _set_PlayerPrefsKey(::StringW value);
    // Get instance field reference: private Photon.Voice.Unity.VoiceLogger logger
    [[deprecated("Use field access instead!")]] ::Photon::Voice::Unity::VoiceLogger*& dyn_logger();
