// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Voice.Unity.VoiceComponent
#include "Photon/Voice/Unity/VoiceComponent.hpp"
// Including type: UnityEngine.AudioSpeakerMode
#include "UnityEngine/AudioSpeakerMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice
namespace Photon::Voice {
  // Forward declaring type: WebRTCAudioProcessor
  class WebRTCAudioProcessor;
  // Forward declaring type: LocalVoice
  class LocalVoice;
}
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: AudioOutCapture
  class AudioOutCapture;
  // Forward declaring type: Recorder
  class Recorder;
  // Forward declaring type: PhotonVoiceCreatedParams
  class PhotonVoiceCreatedParams;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioListener
  class AudioListener;
}
// Completed forward declares
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: WebRtcAudioDsp
  class WebRtcAudioDsp;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Voice::Unity::WebRtcAudioDsp);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Voice::Unity::WebRtcAudioDsp*, "Photon.Voice.Unity", "WebRtcAudioDsp");
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Size: 0x6A
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Voice.Unity.WebRtcAudioDsp
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 955A54
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class WebRtcAudioDsp : public ::Photon::Voice::Unity::VoiceComponent {
    public:
    public:
    // private System.Boolean aec
    // Size: 0x1
    // Offset: 0x22
    bool aec;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean aecHighPass
    // Size: 0x1
    // Offset: 0x23
    bool aecHighPass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean agc
    // Size: 0x1
    // Offset: 0x24
    bool agc;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: agc and: agcCompressionGain
    char __padding2[0x3] = {};
    // private System.Int32 agcCompressionGain
    // Size: 0x4
    // Offset: 0x28
    int agcCompressionGain;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean vad
    // Size: 0x1
    // Offset: 0x2C
    bool vad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean highPass
    // Size: 0x1
    // Offset: 0x2D
    bool highPass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bypass
    // Size: 0x1
    // Offset: 0x2E
    bool bypass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean noiseSuppression
    // Size: 0x1
    // Offset: 0x2F
    bool noiseSuppression;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 reverseStreamDelayMs
    // Size: 0x4
    // Offset: 0x30
    int reverseStreamDelayMs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 reverseChannels
    // Size: 0x4
    // Offset: 0x34
    int reverseChannels;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Photon.Voice.WebRTCAudioProcessor proc
    // Size: 0x8
    // Offset: 0x38
    ::Photon::Voice::WebRTCAudioProcessor* proc;
    // Field size check
    static_assert(sizeof(::Photon::Voice::WebRTCAudioProcessor*) == 0x8);
    // private Photon.Voice.Unity.AudioOutCapture ac
    // Size: 0x8
    // Offset: 0x40
    ::Photon::Voice::Unity::AudioOutCapture* ac;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::AudioOutCapture*) == 0x8);
    // private System.Boolean started
    // Size: 0x1
    // Offset: 0x48
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: started and: localVoice
    char __padding12[0x7] = {};
    // private Photon.Voice.LocalVoice localVoice
    // Size: 0x8
    // Offset: 0x50
    ::Photon::Voice::LocalVoice* localVoice;
    // Field size check
    static_assert(sizeof(::Photon::Voice::LocalVoice*) == 0x8);
    // private System.Int32 outputSampleRate
    // Size: 0x4
    // Offset: 0x58
    int outputSampleRate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: outputSampleRate and: recorder
    char __padding14[0x4] = {};
    // private Photon.Voice.Unity.Recorder recorder
    // Size: 0x8
    // Offset: 0x60
    ::Photon::Voice::Unity::Recorder* recorder;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder*) == 0x8);
    // private System.Boolean forceNormalAecInMobile
    // Size: 0x1
    // Offset: 0x68
    bool forceNormalAecInMobile;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [ObsoleteAttribute] Offset: 0x9563BC
    // public System.Boolean AECMobileComfortNoise
    // Size: 0x1
    // Offset: 0x69
    bool AECMobileComfortNoise;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Collections.Generic.Dictionary`2<UnityEngine.AudioSpeakerMode,System.Int32> channelsMap
    static ::System::Collections::Generic::Dictionary_2<::UnityEngine::AudioSpeakerMode, int>* _get_channelsMap();
    // Set static field: static private readonly System.Collections.Generic.Dictionary`2<UnityEngine.AudioSpeakerMode,System.Int32> channelsMap
    static void _set_channelsMap(::System::Collections::Generic::Dictionary_2<::UnityEngine::AudioSpeakerMode, int>* value);
    // Get instance field reference: private System.Boolean aec
    [[deprecated("Use field access instead!")]] bool& dyn_aec();
    // Get instance field reference: private System.Boolean aecHighPass
    [[deprecated("Use field access instead!")]] bool& dyn_aecHighPass();
    // Get instance field reference: private System.Boolean agc
