// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Diagnostics.Tracing.ActivityTracker
#include "System/Diagnostics/Tracing/ActivityTracker.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
// Including type: System.Diagnostics.Tracing.EventActivityOptions
#include "System/Diagnostics/Tracing/EventActivityOptions.hpp"
// Completed includes
// Type namespace: System.Diagnostics.Tracing
namespace System::Diagnostics::Tracing {
  // Autogenerated type: System.Diagnostics.Tracing.ActivityTracker/ActivityInfo
  class ActivityTracker::ActivityInfo : public ::CsObject {
    public:
    // readonly System.String m_name
    // Offset: 0x10
    ::CsString* m_name;
    // private readonly System.Int64 m_uniqueId
    // Offset: 0x18
    int64_t m_uniqueId;
    // readonly System.Guid m_guid
    // Offset: 0x20
    System::Guid m_guid;
    // readonly System.Int32 m_activityPathGuidOffset
    // Offset: 0x30
    int m_activityPathGuidOffset;
    // readonly System.Int32 m_level
    // Offset: 0x34
    int m_level;
    // readonly System.Diagnostics.Tracing.EventActivityOptions m_eventOptions
    // Offset: 0x38
    System::Diagnostics::Tracing::EventActivityOptions m_eventOptions;
    // System.Int64 m_lastChildID
    // Offset: 0x40
    int64_t m_lastChildID;
    // System.Int32 m_stopped
    // Offset: 0x48
    int m_stopped;
    // readonly System.Diagnostics.Tracing.ActivityTracker/ActivityInfo m_creator
    // Offset: 0x50
    System::Diagnostics::Tracing::ActivityTracker::ActivityInfo* m_creator;
    // readonly System.Guid m_activityIdToRestore
    // Offset: 0x58
    System::Guid m_activityIdToRestore;
    // public System.Void .ctor(System.String name, System.Int64 uniqueId, System.Diagnostics.Tracing.ActivityTracker/ActivityInfo creator, System.Guid activityIDToRestore, System.Diagnostics.Tracing.EventActivityOptions options)
    // Offset: 0xC955EC
    static ActivityTracker::ActivityInfo* New_ctor(::CsString* name, int64_t uniqueId, System::Diagnostics::Tracing::ActivityTracker::ActivityInfo* creator, System::Guid activityIDToRestore, System::Diagnostics::Tracing::EventActivityOptions options);
    // public System.Guid get_ActivityId()
    // Offset: 0xC95B08
    System::Guid get_ActivityId();
    // static public System.String Path(System.Diagnostics.Tracing.ActivityTracker/ActivityInfo activityInfo)
    // Offset: 0xC95B14
    static ::CsString* Path(System::Diagnostics::Tracing::ActivityTracker::ActivityInfo* activityInfo);
    // static public System.String LiveActivities(System.Diagnostics.Tracing.ActivityTracker/ActivityInfo list)
    // Offset: 0xC9520C
    static ::CsString* LiveActivities(System::Diagnostics::Tracing::ActivityTracker::ActivityInfo* list);
    // public System.Boolean CanBeOrphan()
    // Offset: 0xC95694
    bool CanBeOrphan();
    // private System.Void CreateActivityPathGuid(System.Guid idRet, System.Int32 activityPathGuidOffset)
    // Offset: 0xC95A70
    void CreateActivityPathGuid(System::Guid& idRet, int& activityPathGuidOffset);
    // private System.Void CreateOverflowGuid(System.Guid* outPtr)
    // Offset: 0xC95ED8
    void CreateOverflowGuid(System::Guid* outPtr);
    // static private System.Int32 AddIdToGuid(System.Guid* outPtr, System.Int32 whereToAddId, System.UInt32 id, System.Boolean overflow)
    // Offset: 0xC95D8C
    static int AddIdToGuid(System::Guid* outPtr, int whereToAddId, uint id, bool overflow);
    // static private System.Void WriteNibble(System.Byte* ptr, System.Byte* endPtr, System.UInt32 value)
    // Offset: 0xC95F40
    static void WriteNibble(uint8_t*& ptr, uint8_t* endPtr, uint value);
    // public override System.String ToString()
    // Offset: 0xC95BB4
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::CsString* ToString();
  }; // System.Diagnostics.Tracing.ActivityTracker/ActivityInfo
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Diagnostics::Tracing::ActivityTracker::ActivityInfo*, "System.Diagnostics.Tracing", "ActivityTracker/ActivityInfo");
#pragma pack(pop)
