// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Object
#include "System/Object.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
// Including type: System.Diagnostics.Tracing.EventSourceSettings
#include "System/Diagnostics/Tracing/EventSourceSettings.hpp"
// Including type: System.Diagnostics.Tracing.EventLevel
#include "System/Diagnostics/Tracing/EventLevel.hpp"
// Including type: System.Diagnostics.Tracing.EventKeywords
#include "System/Diagnostics/Tracing/EventKeywords.hpp"
// Including type: System.Diagnostics.Tracing.SessionMask
#include "System/Diagnostics/Tracing/SessionMask.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Diagnostics::Tracing
namespace System::Diagnostics::Tracing {
  // Forward declaring type: EventCommandEventArgs
  class EventCommandEventArgs;
  // Forward declaring type: EventDispatcher
  class EventDispatcher;
  // Forward declaring type: EtwSession
  class EtwSession;
  // Forward declaring type: ActivityTracker
  class ActivityTracker;
  // Forward declaring type: EventSourceOptions
  struct EventSourceOptions;
  // Forward declaring type: TraceLoggingEventTypes
  class TraceLoggingEventTypes;
  // Forward declaring type: NameInfo
  class NameInfo;
  // Forward declaring type: EventDescriptor
  struct EventDescriptor;
  // Forward declaring type: EventChannel
  struct EventChannel;
  // Forward declaring type: EventListener
  class EventListener;
  // Forward declaring type: EventManifestOptions
  struct EventManifestOptions;
  // Forward declaring type: EventWrittenEventArgs
  class EventWrittenEventArgs;
  // Forward declaring type: EventOpcode
  struct EventOpcode;
  // Forward declaring type: EventCommand
  struct EventCommand;
  // Forward declaring type: ManifestBuilder
  class ManifestBuilder;
  // Forward declaring type: EventAttribute
  class EventAttribute;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: IntPtr
  struct IntPtr;
  // Forward declaring type: Attribute
  class Attribute;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Runtime::InteropServices
namespace System::Runtime::InteropServices {
  // Forward declaring type: GCHandle
  struct GCHandle;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: ParameterInfo
  class ParameterInfo;
  // Forward declaring type: MemberInfo
  class MemberInfo;
  // Forward declaring type: FieldInfo
  class FieldInfo;
  // Forward declaring type: MethodInfo
  class MethodInfo;
}
// Completed forward declares
// Type namespace: System.Diagnostics.Tracing
namespace System::Diagnostics::Tracing {
  // Autogenerated type: System.Diagnostics.Tracing.EventSource
  class EventSource : public ::CsObject, public System::IDisposable {
    public:
    // Nested type: System::Diagnostics::Tracing::EventSource::EventData
    struct EventData;
    // Nested type: System::Diagnostics::Tracing::EventSource::Sha1ForNonSecretPurposes
    struct Sha1ForNonSecretPurposes;
    // Nested type: System::Diagnostics::Tracing::EventSource::OverideEventProvider
    class OverideEventProvider;
    // Nested type: System::Diagnostics::Tracing::EventSource::EventMetadata
    struct EventMetadata;
    // private System.Byte[] providerMetadata
    // Offset: 0x10
    ::Array<uint8_t>* providerMetadata;
    // private System.String m_name
    // Offset: 0x18
    ::CsString* m_name;
    // System.Int32 m_id
    // Offset: 0x20
    int m_id;
    // private System.Guid m_guid
    // Offset: 0x24
    System::Guid m_guid;
    // System.Diagnostics.Tracing.EventSource/EventMetadata[] m_eventData
    // Offset: 0x38
    ::Array<System::Diagnostics::Tracing::EventSource::EventMetadata>* m_eventData;
    // private System.Byte[] m_rawManifest
    // Offset: 0x40
    ::Array<uint8_t>* m_rawManifest;
    // private System.EventHandler`1<System.Diagnostics.Tracing.EventCommandEventArgs> m_eventCommandExecuted
    // Offset: 0x48
    System::EventHandler_1<System::Diagnostics::Tracing::EventCommandEventArgs*>* m_eventCommandExecuted;
    // private System.Diagnostics.Tracing.EventSourceSettings m_config
    // Offset: 0x50
    System::Diagnostics::Tracing::EventSourceSettings m_config;
    // private System.Boolean m_eventSourceEnabled
    // Offset: 0x54
    bool m_eventSourceEnabled;
    // System.Diagnostics.Tracing.EventLevel m_level
    // Offset: 0x58
    System::Diagnostics::Tracing::EventLevel m_level;
    // System.Diagnostics.Tracing.EventKeywords m_matchAnyKeyword
    // Offset: 0x60
    System::Diagnostics::Tracing::EventKeywords m_matchAnyKeyword;
    // System.Diagnostics.Tracing.EventDispatcher m_Dispatchers
    // Offset: 0x68
    System::Diagnostics::Tracing::EventDispatcher* m_Dispatchers;
    // private System.Diagnostics.Tracing.EventSource/OverideEventProvider m_provider
    // Offset: 0x70
    System::Diagnostics::Tracing::EventSource::OverideEventProvider* m_provider;
    // private System.Boolean m_completelyInited
    // Offset: 0x78
    bool m_completelyInited;
    // private System.Exception m_constructionException
    // Offset: 0x80
    System::Exception* m_constructionException;
    // private System.Byte m_outOfBandMessageCount
    // Offset: 0x88
    uint8_t m_outOfBandMessageCount;
    // private System.Diagnostics.Tracing.EventCommandEventArgs m_deferredCommands
    // Offset: 0x90
    System::Diagnostics::Tracing::EventCommandEventArgs* m_deferredCommands;
    // private System.String[] m_traits
    // Offset: 0x98
    ::Array<::CsString*>* m_traits;
    // Get static field: static System.UInt32 s_currentPid
    static uint _get_s_currentPid();
    // Set static field: static System.UInt32 s_currentPid
    static void _set_s_currentPid(uint value);
    // Get static field: static private System.Byte m_EventSourceExceptionRecurenceCount
    static uint8_t _get_m_EventSourceExceptionRecurenceCount();
    // Set static field: static private System.Byte m_EventSourceExceptionRecurenceCount
    static void _set_m_EventSourceExceptionRecurenceCount(uint8_t value);
    // private System.Diagnostics.Tracing.SessionMask m_curLiveSessions
    // Offset: 0xA0
    System::Diagnostics::Tracing::SessionMask m_curLiveSessions;
    // private System.Diagnostics.Tracing.EtwSession[] m_etwSessionIdMap
    // Offset: 0xA8
    ::Array<System::Diagnostics::Tracing::EtwSession*>* m_etwSessionIdMap;
    // private System.Collections.Generic.List`1<System.Diagnostics.Tracing.EtwSession> m_legacySessions
    // Offset: 0xB0
    System::Collections::Generic::List_1<System::Diagnostics::Tracing::EtwSession*>* m_legacySessions;
    // System.Int64 m_keywordTriggers
    // Offset: 0xB8
    int64_t m_keywordTriggers;
    // System.Diagnostics.Tracing.SessionMask m_activityFilteringForETWEnabled
    // Offset: 0xC0
    System::Diagnostics::Tracing::SessionMask m_activityFilteringForETWEnabled;
    // Get static field: static System.Action`1<System.Guid> s_activityDying
    static System::Action_1<System::Guid>* _get_s_activityDying();
    // Set static field: static System.Action`1<System.Guid> s_activityDying
    static void _set_s_activityDying(System::Action_1<System::Guid>* value);
    // private System.Diagnostics.Tracing.ActivityTracker m_activityTracker
    // Offset: 0xC8
    System::Diagnostics::Tracing::ActivityTracker* m_activityTracker;
    // Get static field: static private readonly System.Byte[] namespaceBytes
    static ::Array<uint8_t>* _get_namespaceBytes();
    // Set static field: static private readonly System.Byte[] namespaceBytes
    static void _set_namespaceBytes(::Array<uint8_t>* value);
    // Get static field: static private readonly System.Guid AspNetEventSourceGuid
    static System::Guid _get_AspNetEventSourceGuid();
    // Set static field: static private readonly System.Guid AspNetEventSourceGuid
    static void _set_AspNetEventSourceGuid(System::Guid value);
    // private System.Void WriteMultiMerge(System.String eventName, System.Diagnostics.Tracing.EventSourceOptions options, System.Diagnostics.Tracing.TraceLoggingEventTypes eventTypes, System.Guid* activityID, System.Guid* childActivityID, System.Object[] values)
    // Offset: 0xC8AFF0
