// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
  // Forward declaring type: WeakReference
  class WeakReference;
  // Forward declaring type: EventArgs
  class EventArgs;
}
// Forward declaring namespace: System::Diagnostics::Tracing
namespace System::Diagnostics::Tracing {
  // Forward declaring type: EventSourceCreatedEventArgs
  class EventSourceCreatedEventArgs;
  // Forward declaring type: EventWrittenEventArgs
  class EventWrittenEventArgs;
  // Forward declaring type: ActivityFilter
  class ActivityFilter;
  // Forward declaring type: EventSource
  class EventSource;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: System.Diagnostics.Tracing
namespace System::Diagnostics::Tracing {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.Diagnostics.Tracing.EventListener
  // [] Offset: FFFFFFFF
  class EventListener : public ::Il2CppObject {
    public:
    // [CompilerGeneratedAttribute] Offset: 0xD3F178
    // private System.EventHandler`1<System.Diagnostics.Tracing.EventSourceCreatedEventArgs> _EventSourceCreated
    // Size: 0x8
    // Offset: 0x10
    System::EventHandler_1<System::Diagnostics::Tracing::EventSourceCreatedEventArgs*>* EventSourceCreated;
    // Field size check
    static_assert(sizeof(System::EventHandler_1<System::Diagnostics::Tracing::EventSourceCreatedEventArgs*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD3F188
    // private System.EventHandler`1<System.Diagnostics.Tracing.EventWrittenEventArgs> EventWritten
    // Size: 0x8
    // Offset: 0x18
    System::EventHandler_1<System::Diagnostics::Tracing::EventWrittenEventArgs*>* EventWritten;
    // Field size check
    static_assert(sizeof(System::EventHandler_1<System::Diagnostics::Tracing::EventWrittenEventArgs*>*) == 0x8);
    // System.Diagnostics.Tracing.EventListener m_Next
    // Size: 0x8
    // Offset: 0x20
    System::Diagnostics::Tracing::EventListener* m_Next;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventListener*) == 0x8);
    // System.Diagnostics.Tracing.ActivityFilter m_activityFilter
    // Size: 0x8
    // Offset: 0x28
    System::Diagnostics::Tracing::ActivityFilter* m_activityFilter;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::ActivityFilter*) == 0x8);
    // Creating value type constructor for type: EventListener
    EventListener(System::EventHandler_1<System::Diagnostics::Tracing::EventSourceCreatedEventArgs*>* EventSourceCreated_ = {}, System::EventHandler_1<System::Diagnostics::Tracing::EventWrittenEventArgs*>* EventWritten_ = {}, System::Diagnostics::Tracing::EventListener* m_Next_ = {}, System::Diagnostics::Tracing::ActivityFilter* m_activityFilter_ = {}) noexcept : EventSourceCreated{EventSourceCreated_}, EventWritten{EventWritten_}, m_Next{m_Next_}, m_activityFilter{m_activityFilter_} {}
    // Get static field: static private readonly System.Object s_EventSourceCreatedLock
    static ::Il2CppObject* _get_s_EventSourceCreatedLock();
    // Set static field: static private readonly System.Object s_EventSourceCreatedLock
    static void _set_s_EventSourceCreatedLock(::Il2CppObject* value);
    // Get static field: static System.Diagnostics.Tracing.EventListener s_Listeners
    static System::Diagnostics::Tracing::EventListener* _get_s_Listeners();
    // Set static field: static System.Diagnostics.Tracing.EventListener s_Listeners
    static void _set_s_Listeners(System::Diagnostics::Tracing::EventListener* value);
    // Get static field: static System.Collections.Generic.List`1<System.WeakReference> s_EventSources
    static System::Collections::Generic::List_1<System::WeakReference*>* _get_s_EventSources();
    // Set static field: static System.Collections.Generic.List`1<System.WeakReference> s_EventSources
    static void _set_s_EventSources(System::Collections::Generic::List_1<System::WeakReference*>* value);
    // Get static field: static private System.Boolean s_CreatingListener
    static bool _get_s_CreatingListener();
    // Set static field: static private System.Boolean s_CreatingListener
    static void _set_s_CreatingListener(bool value);
    // Get static field: static private System.Boolean s_EventSourceShutdownRegistered
    static bool _get_s_EventSourceShutdownRegistered();
    // Set static field: static private System.Boolean s_EventSourceShutdownRegistered
    static void _set_s_EventSourceShutdownRegistered(bool value);
    // protected internal System.Void OnEventSourceCreated(System.Diagnostics.Tracing.EventSource eventSource)
    // Offset: 0x12C6EC8
    void OnEventSourceCreated(System::Diagnostics::Tracing::EventSource* eventSource);
    // protected internal System.Void OnEventWritten(System.Diagnostics.Tracing.EventWrittenEventArgs eventData)
    // Offset: 0x12C6FDC
    void OnEventWritten(System::Diagnostics::Tracing::EventWrittenEventArgs* eventData);
    // static System.Void AddEventSource(System.Diagnostics.Tracing.EventSource newEventSource)
    // Offset: 0x12C7054
    static void AddEventSource(System::Diagnostics::Tracing::EventSource* newEventSource);
    // static private System.Void DisposeOnShutdown(System.Object sender, System.EventArgs e)
    // Offset: 0x12C7730
    static void DisposeOnShutdown(::Il2CppObject* sender, System::EventArgs* e);
    // static System.Object get_EventListenersLock()
    // Offset: 0x12C74AC
    static ::Il2CppObject* get_EventListenersLock();
    // static private System.Void .cctor()
    // Offset: 0x12C79C4
    static void _cctor();
  }; // System.Diagnostics.Tracing.EventListener
  static check_size<sizeof(EventListener), 40 + sizeof(System::Diagnostics::Tracing::ActivityFilter*)> __System_Diagnostics_Tracing_EventListenerSizeCheck;
  static_assert(sizeof(EventListener) == 0x30);
}
#pragma pack(pop)
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Diagnostics::Tracing::EventListener*, "System.Diagnostics.Tracing", "EventListener");
