// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
// Including type: System.Diagnostics.Tracing.EventDescriptor
#include "System/Diagnostics/Tracing/EventDescriptor.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
// Including type: System.Diagnostics.Tracing.EventSourceSettings
#include "System/Diagnostics/Tracing/EventSourceSettings.hpp"
// Including type: System.Diagnostics.Tracing.EventLevel
#include "System/Diagnostics/Tracing/EventLevel.hpp"
// Including type: System.Diagnostics.Tracing.EventKeywords
#include "System/Diagnostics/Tracing/EventKeywords.hpp"
// Including type: System.Diagnostics.Tracing.SessionMask
#include "System/Diagnostics/Tracing/SessionMask.hpp"
// Including type: System.Diagnostics.Tracing.EventSourceOptions
#include "System/Diagnostics/Tracing/EventSourceOptions.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Diagnostics::Tracing
namespace System::Diagnostics::Tracing {
  // Forward declaring type: EventCommandEventArgs
  class EventCommandEventArgs;
  // Forward declaring type: EventDispatcher
  class EventDispatcher;
  // Forward declaring type: EtwSession
  class EtwSession;
  // Forward declaring type: ActivityTracker
  class ActivityTracker;
  // Forward declaring type: TraceLoggingEventTypes
  class TraceLoggingEventTypes;
  // Forward declaring type: NameInfo
  class NameInfo;
  // Forward declaring type: EventChannel
  struct EventChannel;
  // Forward declaring type: EventListener
  class EventListener;
  // Forward declaring type: EventManifestOptions
  struct EventManifestOptions;
  // Forward declaring type: EventWrittenEventArgs
  class EventWrittenEventArgs;
  // Skipping declaration: EventMetadata because it is already included!
  // Forward declaring type: EventOpcode
  struct EventOpcode;
  // Forward declaring type: EventCommand
  struct EventCommand;
  // Forward declaring type: ManifestBuilder
  class ManifestBuilder;
  // Forward declaring type: EventAttribute
  class EventAttribute;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: IntPtr
  struct IntPtr;
  // Forward declaring type: Attribute
  class Attribute;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Runtime::InteropServices
namespace System::Runtime::InteropServices {
  // Forward declaring type: GCHandle
  struct GCHandle;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: ParameterInfo
  class ParameterInfo;
  // Forward declaring type: MemberInfo
  class MemberInfo;
  // Forward declaring type: FieldInfo
  class FieldInfo;
  // Forward declaring type: MethodInfo
  class MethodInfo;
}
// Completed forward declares
// Type namespace: System.Diagnostics.Tracing
namespace System::Diagnostics::Tracing {
  // Size: 0xD0
  // Autogenerated type: System.Diagnostics.Tracing.EventSource
  // [] Offset: FFFFFFFF
  class EventSource : public ::Il2CppObject/*, public System::IDisposable*/ {
    public:
    // Nested type: System::Diagnostics::Tracing::EventSource::EventData
    struct EventData;
    // Nested type: System::Diagnostics::Tracing::EventSource::Sha1ForNonSecretPurposes
    struct Sha1ForNonSecretPurposes;
    // Nested type: System::Diagnostics::Tracing::EventSource::OverideEventProvider
    class OverideEventProvider;
    // Nested type: System::Diagnostics::Tracing::EventSource::EventMetadata
    struct EventMetadata;
    // Size: 0x3C
    // Autogenerated type: System.Diagnostics.Tracing.EventSource/EventMetadata
    // [] Offset: FFFFFFFF
    struct EventMetadata/*, public System::ValueType*/ {
      public:
      // public System.Diagnostics.Tracing.EventDescriptor Descriptor
      // Size: 0x10
      // Offset: 0x0
      System::Diagnostics::Tracing::EventDescriptor Descriptor;
      // Field size check
      static_assert(sizeof(System::Diagnostics::Tracing::EventDescriptor) == 0x10);
      // public System.Diagnostics.Tracing.EventTags Tags
      // Size: 0x4
      // Offset: 0x10
      System::Diagnostics::Tracing::EventTags Tags;
      // Field size check
      static_assert(sizeof(System::Diagnostics::Tracing::EventTags) == 0x4);
      // public System.Boolean EnabledForAnyListener
      // Size: 0x1
      // Offset: 0x14
      bool EnabledForAnyListener;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean EnabledForETW
      // Size: 0x1
      // Offset: 0x15
      bool EnabledForETW;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean HasRelatedActivityID
      // Size: 0x1
      // Offset: 0x16
      bool HasRelatedActivityID;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Byte TriggersActivityTracking
      // Size: 0x1
      // Offset: 0x17
      uint8_t TriggersActivityTracking;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      // public System.String Name
      // Size: 0x8
      // Offset: 0x18
      ::Il2CppString* Name;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // public System.String Message
      // Size: 0x8
      // Offset: 0x20
      ::Il2CppString* Message;
      // Field size check
      static_assert(sizeof(::Il2CppString*) == 0x8);
      // public System.Reflection.ParameterInfo[] Parameters
      // Size: 0x8
      // Offset: 0x28
      ::Array<System::Reflection::ParameterInfo*>* Parameters;
      // Field size check
      static_assert(sizeof(::Array<System::Reflection::ParameterInfo*>*) == 0x8);
      // public System.Diagnostics.Tracing.TraceLoggingEventTypes TraceLoggingEventTypes
      // Size: 0x8
      // Offset: 0x30
      System::Diagnostics::Tracing::TraceLoggingEventTypes* TraceLoggingEventTypes;
      // Field size check
      static_assert(sizeof(System::Diagnostics::Tracing::TraceLoggingEventTypes*) == 0x8);
      // public System.Diagnostics.Tracing.EventActivityOptions ActivityOptions
      // Size: 0x4
      // Offset: 0x38
      System::Diagnostics::Tracing::EventActivityOptions ActivityOptions;
      // Field size check
      static_assert(sizeof(System::Diagnostics::Tracing::EventActivityOptions) == 0x4);
      // Creating value type constructor for type: EventMetadata
      constexpr EventMetadata(System::Diagnostics::Tracing::EventDescriptor Descriptor_ = {}, System::Diagnostics::Tracing::EventTags Tags_ = {}, bool EnabledForAnyListener_ = {}, bool EnabledForETW_ = {}, bool HasRelatedActivityID_ = {}, uint8_t TriggersActivityTracking_ = {}, ::Il2CppString* Name_ = {}, ::Il2CppString* Message_ = {}, ::Array<System::Reflection::ParameterInfo*>* Parameters_ = {}, System::Diagnostics::Tracing::TraceLoggingEventTypes* TraceLoggingEventTypes_ = {}, System::Diagnostics::Tracing::EventActivityOptions ActivityOptions_ = {}) noexcept : Descriptor{Descriptor_}, Tags{Tags_}, EnabledForAnyListener{EnabledForAnyListener_}, EnabledForETW{EnabledForETW_}, HasRelatedActivityID{HasRelatedActivityID_}, TriggersActivityTracking{TriggersActivityTracking_}, Name{Name_}, Message{Message_}, Parameters{Parameters_}, TraceLoggingEventTypes{TraceLoggingEventTypes_}, ActivityOptions{ActivityOptions_} {}
      // Creating interface conversion operator: operator System::ValueType
      operator System::ValueType() noexcept {
        return *reinterpret_cast<System::ValueType*>(this);
      }
    }; // System.Diagnostics.Tracing.EventSource/EventMetadata
    static check_size<sizeof(EventSource::EventMetadata), 56 + sizeof(System::Diagnostics::Tracing::EventActivityOptions)> __System_Diagnostics_Tracing_EventSource_EventMetadataSizeCheck;
    static_assert(sizeof(EventSource::EventMetadata) == 0x3C);
    // private System.Byte[] providerMetadata
    // Size: 0x8
    // Offset: 0x10
    ::Array<uint8_t>* providerMetadata;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.String m_name
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* m_name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.Int32 m_id
    // Size: 0x4
    // Offset: 0x20
    int m_id;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Guid m_guid
    // Size: 0x10
    // Offset: 0x24
    System::Guid m_guid;
    // Field size check
    static_assert(sizeof(System::Guid) == 0x10);
    // Padding between fields: m_guid and: m_eventData
    char __padding3[0x4] = {};
    // System.Diagnostics.Tracing.EventSource/EventMetadata[] m_eventData
    // Size: 0x8
    // Offset: 0x38
    ::Array<System::Diagnostics::Tracing::EventSource::EventMetadata>* m_eventData;
    // Field size check
    static_assert(sizeof(::Array<System::Diagnostics::Tracing::EventSource::EventMetadata>*) == 0x8);
    // private System.Byte[] m_rawManifest
    // Size: 0x8
    // Offset: 0x40
    ::Array<uint8_t>* m_rawManifest;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.EventHandler`1<System.Diagnostics.Tracing.EventCommandEventArgs> m_eventCommandExecuted
    // Size: 0x8
    // Offset: 0x48
    System::EventHandler_1<System::Diagnostics::Tracing::EventCommandEventArgs*>* m_eventCommandExecuted;
    // Field size check
    static_assert(sizeof(System::EventHandler_1<System::Diagnostics::Tracing::EventCommandEventArgs*>*) == 0x8);
    // private System.Diagnostics.Tracing.EventSourceSettings m_config
    // Size: 0x4
    // Offset: 0x50
    System::Diagnostics::Tracing::EventSourceSettings m_config;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventSourceSettings) == 0x4);
    // private System.Boolean m_eventSourceEnabled
    // Size: 0x1
    // Offset: 0x54
    bool m_eventSourceEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_eventSourceEnabled and: m_level
    char __padding8[0x3] = {};
    // System.Diagnostics.Tracing.EventLevel m_level
    // Size: 0x4
    // Offset: 0x58
    System::Diagnostics::Tracing::EventLevel m_level;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventLevel) == 0x4);
    // Padding between fields: m_level and: m_matchAnyKeyword
    char __padding9[0x4] = {};
    // System.Diagnostics.Tracing.EventKeywords m_matchAnyKeyword
    // Size: 0x8
    // Offset: 0x60
    System::Diagnostics::Tracing::EventKeywords m_matchAnyKeyword;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventKeywords) == 0x8);
    // System.Diagnostics.Tracing.EventDispatcher m_Dispatchers
    // Size: 0x8
    // Offset: 0x68
    System::Diagnostics::Tracing::EventDispatcher* m_Dispatchers;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventDispatcher*) == 0x8);
    // private System.Diagnostics.Tracing.EventSource/OverideEventProvider m_provider
    // Size: 0x8
    // Offset: 0x70
    System::Diagnostics::Tracing::EventSource::OverideEventProvider* m_provider;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventSource::OverideEventProvider*) == 0x8);
    // private System.Boolean m_completelyInited
    // Size: 0x1
    // Offset: 0x78
    bool m_completelyInited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_completelyInited and: m_constructionException
    char __padding13[0x7] = {};
    // private System.Exception m_constructionException
    // Size: 0x8
    // Offset: 0x80
    System::Exception* m_constructionException;
    // Field size check
    static_assert(sizeof(System::Exception*) == 0x8);
    // private System.Byte m_outOfBandMessageCount
    // Size: 0x1
    // Offset: 0x88
    uint8_t m_outOfBandMessageCount;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: m_outOfBandMessageCount and: m_deferredCommands
    char __padding15[0x7] = {};
    // private System.Diagnostics.Tracing.EventCommandEventArgs m_deferredCommands
    // Size: 0x8
    // Offset: 0x90
    System::Diagnostics::Tracing::EventCommandEventArgs* m_deferredCommands;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventCommandEventArgs*) == 0x8);
    // private System.String[] m_traits
    // Size: 0x8
    // Offset: 0x98
    ::Array<::Il2CppString*>* m_traits;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppString*>*) == 0x8);
    // private System.Diagnostics.Tracing.SessionMask m_curLiveSessions
    // Size: 0x4
    // Offset: 0xA0
    System::Diagnostics::Tracing::SessionMask m_curLiveSessions;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::SessionMask) == 0x4);
    // Padding between fields: m_curLiveSessions and: m_etwSessionIdMap
    char __padding18[0x4] = {};
    // private System.Diagnostics.Tracing.EtwSession[] m_etwSessionIdMap
    // Size: 0x8
    // Offset: 0xA8
    ::Array<System::Diagnostics::Tracing::EtwSession*>* m_etwSessionIdMap;
    // Field size check
    static_assert(sizeof(::Array<System::Diagnostics::Tracing::EtwSession*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Diagnostics.Tracing.EtwSession> m_legacySessions
    // Size: 0x8
    // Offset: 0xB0
    System::Collections::Generic::List_1<System::Diagnostics::Tracing::EtwSession*>* m_legacySessions;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<System::Diagnostics::Tracing::EtwSession*>*) == 0x8);
    // System.Int64 m_keywordTriggers
    // Size: 0x8
    // Offset: 0xB8
    int64_t m_keywordTriggers;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Diagnostics.Tracing.SessionMask m_activityFilteringForETWEnabled
    // Size: 0x4
    // Offset: 0xC0
    System::Diagnostics::Tracing::SessionMask m_activityFilteringForETWEnabled;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::SessionMask) == 0x4);
    // Padding between fields: m_activityFilteringForETWEnabled and: m_activityTracker
    char __padding22[0x4] = {};
    // private System.Diagnostics.Tracing.ActivityTracker m_activityTracker
    // Size: 0x8
    // Offset: 0xC8
    System::Diagnostics::Tracing::ActivityTracker* m_activityTracker;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::ActivityTracker*) == 0x8);
    // Creating value type constructor for type: EventSource
