// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Attribute
#include "System/Attribute.hpp"
// Including type: System.Diagnostics.Tracing.EventLevel
#include "System/Diagnostics/Tracing/EventLevel.hpp"
// Including type: System.Diagnostics.Tracing.EventOpcode
#include "System/Diagnostics/Tracing/EventOpcode.hpp"
// Including type: System.Diagnostics.Tracing.EventKeywords
#include "System/Diagnostics/Tracing/EventKeywords.hpp"
// Including type: System.Diagnostics.Tracing.EventTags
#include "System/Diagnostics/Tracing/EventTags.hpp"
// Completed includes
// Type namespace: System.Diagnostics.Tracing
namespace System::Diagnostics::Tracing {
  // Size: 0x2C
  // Autogenerated type: System.Diagnostics.Tracing.EventDataAttribute
  // [] Offset: FFFFFFFF
  // [AttributeUsageAttribute] Offset: D3D9A0
  class EventDataAttribute : public System::Attribute {
    public:
    // private System.Diagnostics.Tracing.EventLevel level
    // Size: 0x4
    // Offset: 0x10
    System::Diagnostics::Tracing::EventLevel level;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventLevel) == 0x4);
    // private System.Diagnostics.Tracing.EventOpcode opcode
    // Size: 0x4
    // Offset: 0x14
    System::Diagnostics::Tracing::EventOpcode opcode;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventOpcode) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xD3F0E8
    // private System.String <Name>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* Name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD3F0F8
    // private System.Diagnostics.Tracing.EventKeywords <Keywords>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    System::Diagnostics::Tracing::EventKeywords Keywords;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventKeywords) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD3F108
    // private System.Diagnostics.Tracing.EventTags <Tags>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    System::Diagnostics::Tracing::EventTags Tags;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventTags) == 0x4);
    // Creating value type constructor for type: EventDataAttribute
    EventDataAttribute(System::Diagnostics::Tracing::EventLevel level_ = {}, System::Diagnostics::Tracing::EventOpcode opcode_ = {}, ::Il2CppString* Name_ = {}, System::Diagnostics::Tracing::EventKeywords Keywords_ = {}, System::Diagnostics::Tracing::EventTags Tags_ = {}) noexcept : level{level_}, opcode{opcode_}, Name{Name_}, Keywords{Keywords_}, Tags{Tags_} {}
    // public System.String get_Name()
    // Offset: 0x12C69DC
    ::Il2CppString* get_Name();
    // System.Diagnostics.Tracing.EventLevel get_Level()
    // Offset: 0x12C69E4
    System::Diagnostics::Tracing::EventLevel get_Level();
    // System.Diagnostics.Tracing.EventOpcode get_Opcode()
    // Offset: 0x12C69EC
    System::Diagnostics::Tracing::EventOpcode get_Opcode();
    // System.Diagnostics.Tracing.EventKeywords get_Keywords()
    // Offset: 0x12C69F4
    System::Diagnostics::Tracing::EventKeywords get_Keywords();
    // System.Diagnostics.Tracing.EventTags get_Tags()
    // Offset: 0x12C69FC
    System::Diagnostics::Tracing::EventTags get_Tags();
  }; // System.Diagnostics.Tracing.EventDataAttribute
  static check_size<sizeof(EventDataAttribute), 40 + sizeof(System::Diagnostics::Tracing::EventTags)> __System_Diagnostics_Tracing_EventDataAttributeSizeCheck;
  static_assert(sizeof(EventDataAttribute) == 0x2C);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Diagnostics::Tracing::EventDataAttribute*, "System.Diagnostics.Tracing", "EventDataAttribute");
#pragma pack(pop)
