// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.EventArgs
#include "System/EventArgs.hpp"
// Including type: System.Diagnostics.Tracing.EventCommand
#include "System/Diagnostics/Tracing/EventCommand.hpp"
// Including type: System.Diagnostics.Tracing.EventLevel
#include "System/Diagnostics/Tracing/EventLevel.hpp"
// Including type: System.Diagnostics.Tracing.EventKeywords
#include "System/Diagnostics/Tracing/EventKeywords.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
}
// Forward declaring namespace: System::Diagnostics::Tracing
namespace System::Diagnostics::Tracing {
  // Forward declaring type: EventSource
  class EventSource;
  // Forward declaring type: EventDispatcher
  class EventDispatcher;
  // Forward declaring type: EventListener
  class EventListener;
}
// Completed forward declares
// Type namespace: System.Diagnostics.Tracing
namespace System::Diagnostics::Tracing {
  // Size: 0x58
  // Autogenerated type: System.Diagnostics.Tracing.EventCommandEventArgs
  // [] Offset: FFFFFFFF
  class EventCommandEventArgs : public System::EventArgs {
    public:
    // [CompilerGeneratedAttribute] Offset: 0xD3F198
    // private System.Diagnostics.Tracing.EventCommand <Command>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    System::Diagnostics::Tracing::EventCommand Command;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventCommand) == 0x4);
    // Padding between fields: Command and: Arguments
    char __padding0[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xD3F1A8
    // private System.Collections.Generic.IDictionary`2<System.String,System.String> <Arguments>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    System::Collections::Generic::IDictionary_2<::Il2CppString*, ::Il2CppString*>* Arguments;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::IDictionary_2<::Il2CppString*, ::Il2CppString*>*) == 0x8);
    // System.Diagnostics.Tracing.EventSource eventSource
    // Size: 0x8
    // Offset: 0x20
    System::Diagnostics::Tracing::EventSource* eventSource;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventSource*) == 0x8);
    // System.Diagnostics.Tracing.EventDispatcher dispatcher
    // Size: 0x8
    // Offset: 0x28
    System::Diagnostics::Tracing::EventDispatcher* dispatcher;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventDispatcher*) == 0x8);
    // System.Diagnostics.Tracing.EventListener listener
    // Size: 0x8
    // Offset: 0x30
    System::Diagnostics::Tracing::EventListener* listener;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventListener*) == 0x8);
    // System.Int32 perEventSourceSessionId
    // Size: 0x4
    // Offset: 0x38
    int perEventSourceSessionId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 etwSessionId
    // Size: 0x4
    // Offset: 0x3C
    int etwSessionId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean enable
    // Size: 0x1
    // Offset: 0x40
    bool enable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enable and: level
    char __padding7[0x3] = {};
    // System.Diagnostics.Tracing.EventLevel level
    // Size: 0x4
    // Offset: 0x44
    System::Diagnostics::Tracing::EventLevel level;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventLevel) == 0x4);
    // System.Diagnostics.Tracing.EventKeywords matchAnyKeyword
    // Size: 0x8
    // Offset: 0x48
    System::Diagnostics::Tracing::EventKeywords matchAnyKeyword;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventKeywords) == 0x8);
    // System.Diagnostics.Tracing.EventCommandEventArgs nextCommand
    // Size: 0x8
    // Offset: 0x50
    System::Diagnostics::Tracing::EventCommandEventArgs* nextCommand;
    // Field size check
    static_assert(sizeof(System::Diagnostics::Tracing::EventCommandEventArgs*) == 0x8);
    // Creating value type constructor for type: EventCommandEventArgs
    EventCommandEventArgs(System::Diagnostics::Tracing::EventCommand Command_ = {}, System::Collections::Generic::IDictionary_2<::Il2CppString*, ::Il2CppString*>* Arguments_ = {}, System::Diagnostics::Tracing::EventSource* eventSource_ = {}, System::Diagnostics::Tracing::EventDispatcher* dispatcher_ = {}, System::Diagnostics::Tracing::EventListener* listener_ = {}, int perEventSourceSessionId_ = {}, int etwSessionId_ = {}, bool enable_ = {}, System::Diagnostics::Tracing::EventLevel level_ = {}, System::Diagnostics::Tracing::EventKeywords matchAnyKeyword_ = {}, System::Diagnostics::Tracing::EventCommandEventArgs* nextCommand_ = {}) noexcept : Command{Command_}, Arguments{Arguments_}, eventSource{eventSource_}, dispatcher{dispatcher_}, listener{listener_}, perEventSourceSessionId{perEventSourceSessionId_}, etwSessionId{etwSessionId_}, enable{enable_}, level{level_}, matchAnyKeyword{matchAnyKeyword_}, nextCommand{nextCommand_} {}
    // public System.Diagnostics.Tracing.EventCommand get_Command()
    // Offset: 0x12C68C4
    System::Diagnostics::Tracing::EventCommand get_Command();
    // System.Void set_Command(System.Diagnostics.Tracing.EventCommand value)
    // Offset: 0x12C68CC
    void set_Command(System::Diagnostics::Tracing::EventCommand value);
    // public System.Collections.Generic.IDictionary`2<System.String,System.String> get_Arguments()
    // Offset: 0x12C68D4
    System::Collections::Generic::IDictionary_2<::Il2CppString*, ::Il2CppString*>* get_Arguments();
    // System.Void set_Arguments(System.Collections.Generic.IDictionary`2<System.String,System.String> value)
    // Offset: 0x12C68DC
    void set_Arguments(System::Collections::Generic::IDictionary_2<::Il2CppString*, ::Il2CppString*>* value);
    // System.Void .ctor(System.Diagnostics.Tracing.EventCommand command, System.Collections.Generic.IDictionary`2<System.String,System.String> arguments, System.Diagnostics.Tracing.EventSource eventSource, System.Diagnostics.Tracing.EventListener listener, System.Int32 perEventSourceSessionId, System.Int32 etwSessionId, System.Boolean enable, System.Diagnostics.Tracing.EventLevel level, System.Diagnostics.Tracing.EventKeywords matchAnyKeyword)
    // Offset: 0x12C68E4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static EventCommandEventArgs* New_ctor(System::Diagnostics::Tracing::EventCommand command, System::Collections::Generic::IDictionary_2<::Il2CppString*, ::Il2CppString*>* arguments, System::Diagnostics::Tracing::EventSource* eventSource, System::Diagnostics::Tracing::EventListener* listener, int perEventSourceSessionId, int etwSessionId, bool enable, System::Diagnostics::Tracing::EventLevel level, System::Diagnostics::Tracing::EventKeywords matchAnyKeyword) {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("System::Diagnostics::Tracing").WithContext("EventCommandEventArgs").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<EventCommandEventArgs*, creationType>(command, arguments, eventSource, listener, perEventSourceSessionId, etwSessionId, enable, level, matchAnyKeyword)));
    }
  }; // System.Diagnostics.Tracing.EventCommandEventArgs
  static check_size<sizeof(EventCommandEventArgs), 80 + sizeof(System::Diagnostics::Tracing::EventCommandEventArgs*)> __System_Diagnostics_Tracing_EventCommandEventArgsSizeCheck;
  static_assert(sizeof(EventCommandEventArgs) == 0x58);
}
DEFINE_IL2CPP_ARG_TYPE(System::Diagnostics::Tracing::EventCommandEventArgs*, "System.Diagnostics.Tracing", "EventCommandEventArgs");
#pragma pack(pop)
