// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Diagnostics.Tracing.EventManifestOptions
#include "System/Diagnostics/Tracing/EventManifestOptions.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Diagnostics::Tracing
namespace System::Diagnostics::Tracing {
  // Forward declaring type: EventAttribute
  class EventAttribute;
  // Forward declaring type: EventLevel
  struct EventLevel;
  // Forward declaring type: EventTask
  struct EventTask;
  // Forward declaring type: EventOpcode
  struct EventOpcode;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Resources
namespace System::Resources {
  // Forward declaring type: ResourceManager
  class ResourceManager;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Completed forward declares
// Type namespace: System.Diagnostics.Tracing
namespace System::Diagnostics::Tracing {
  // Forward declaring type: ManifestBuilder
  class ManifestBuilder;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Diagnostics::Tracing::ManifestBuilder);
DEFINE_IL2CPP_ARG_TYPE(::System::Diagnostics::Tracing::ManifestBuilder*, "System.Diagnostics.Tracing", "ManifestBuilder");
// Type namespace: System.Diagnostics.Tracing
namespace System::Diagnostics::Tracing {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: System.Diagnostics.Tracing.ManifestBuilder
  // [TokenAttribute] Offset: FFFFFFFF
  class ManifestBuilder : public ::Il2CppObject {
    public:
    // Nested type: ::System::Diagnostics::Tracing::ManifestBuilder::$$c__DisplayClass22_0
    class $$c__DisplayClass22_0;
    // Nested type: ::System::Diagnostics::Tracing::ManifestBuilder::$$c__DisplayClass22_1
    class $$c__DisplayClass22_1;
    public:
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.String> opcodeTab
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::Dictionary_2<int, ::StringW>* opcodeTab;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::StringW>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.String> taskTab
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::Dictionary_2<int, ::StringW>* taskTab;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::StringW>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.UInt64,System.String> keywordTab
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::Dictionary_2<uint64_t, ::StringW>* keywordTab;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint64_t, ::StringW>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Type> mapsTab
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Type*>* mapsTab;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Type*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.String> stringTab
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>* stringTab;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*) == 0x8);
    // private System.Text.StringBuilder sb
    // Size: 0x8
    // Offset: 0x38
    ::System::Text::StringBuilder* sb;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Text.StringBuilder events
    // Size: 0x8
    // Offset: 0x40
    ::System::Text::StringBuilder* events;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Text.StringBuilder templates
    // Size: 0x8
    // Offset: 0x48
    ::System::Text::StringBuilder* templates;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Resources.ResourceManager resources
    // Size: 0x8
    // Offset: 0x50
    ::System::Resources::ResourceManager* resources;
    // Field size check
    static_assert(sizeof(::System::Resources::ResourceManager*) == 0x8);
    // private System.Diagnostics.Tracing.EventManifestOptions flags
    // Size: 0x4
    // Offset: 0x58
    ::System::Diagnostics::Tracing::EventManifestOptions flags;
    // Field size check
    static_assert(sizeof(::System::Diagnostics::Tracing::EventManifestOptions) == 0x4);
    // Padding between fields: flags and: errors
    char __padding9[0x4] = {};
    // private System.Collections.Generic.IList`1<System.String> errors
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::IList_1<::StringW>* errors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::StringW>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<System.Int32>> perEventByteArrayArgIndices
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<int>*>* perEventByteArrayArgIndices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<int>*>*) == 0x8);
    // private System.String eventName
    // Size: 0x8
    // Offset: 0x70
    ::StringW eventName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 numParams
    // Size: 0x4
    // Offset: 0x78
    int numParams;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: numParams and: byteArrArgIndices
    char __padding13[0x4] = {};
    // private System.Collections.Generic.List`1<System.Int32> byteArrArgIndices
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<int>* byteArrArgIndices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    public:
    // Get instance field reference: private System.Collections.Generic.Dictionary`2<System.Int32,System.String> opcodeTab
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<int, ::StringW>*& dyn_opcodeTab();
    // Get instance field reference: private System.Collections.Generic.Dictionary`2<System.Int32,System.String> taskTab
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<int, ::StringW>*& dyn_taskTab();
    // Get instance field reference: private System.Collections.Generic.Dictionary`2<System.UInt64,System.String> keywordTab
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<uint64_t, ::StringW>*& dyn_keywordTab();
