// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.EventArgs
#include "System/EventArgs.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlElement
  class XmlElement;
}
// Completed forward declares
// Type namespace: System.Xml.Serialization
namespace System::Xml::Serialization {
  // Forward declaring type: XmlElementEventArgs
  class XmlElementEventArgs;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Serialization::XmlElementEventArgs);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Serialization::XmlElementEventArgs*, "System.Xml.Serialization", "XmlElementEventArgs");
// Type namespace: System.Xml.Serialization
namespace System::Xml::Serialization {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Serialization.XmlElementEventArgs
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlElementEventArgs : public System::EventArgs {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Object o
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppObject* o;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Xml.XmlElement elem
    // Size: 0x8
    // Offset: 0x18
    System::Xml::XmlElement* elem;
    // Field size check
    static_assert(sizeof(System::Xml::XmlElement*) == 0x8);
    // private System.String qnames
    // Size: 0x8
    // Offset: 0x20
    ::StringW qnames;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 lineNumber
    // Size: 0x4
    // Offset: 0x28
    int lineNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 linePosition
    // Size: 0x4
    // Offset: 0x2C
    int linePosition;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private System.Object o
    ::Il2CppObject*& dyn_o();
    // Get instance field reference: private System.Xml.XmlElement elem
    System::Xml::XmlElement*& dyn_elem();
    // Get instance field reference: private System.String qnames
    ::StringW& dyn_qnames();
    // Get instance field reference: private System.Int32 lineNumber
    int& dyn_lineNumber();
    // Get instance field reference: private System.Int32 linePosition
    int& dyn_linePosition();
    // System.Void .ctor(System.Xml.XmlElement elem, System.Int32 lineNumber, System.Int32 linePosition, System.Object o, System.String qnames)
    // Offset: 0x1E038E4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static XmlElementEventArgs* New_ctor(System::Xml::XmlElement* elem, int lineNumber, int linePosition, ::Il2CppObject* o, ::StringW qnames) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Xml::Serialization::XmlElementEventArgs::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<XmlElementEventArgs*, creationType>(elem, lineNumber, linePosition, o, qnames)));
    }
  }; // System.Xml.Serialization.XmlElementEventArgs
  #pragma pack(pop)
  static check_size<sizeof(XmlElementEventArgs), 44 + sizeof(int)> __System_Xml_Serialization_XmlElementEventArgsSizeCheck;
  static_assert(sizeof(XmlElementEventArgs) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Xml::Serialization::XmlElementEventArgs::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
