// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Serialization.XmlSerializationGeneratedCode
#include "System/Xml/Serialization/XmlSerializationGeneratedCode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Serialization
namespace System::Xml::Serialization {
  // Forward declaring type: XmlSerializer
  class XmlSerializer;
  // Forward declaring type: XmlSerializationReadCallback
  class XmlSerializationReadCallback;
  // Forward declaring type: IXmlSerializable
  class IXmlSerializable;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlDocument
  class XmlDocument;
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: XmlAttribute
  class XmlAttribute;
  // Forward declaring type: XmlNode
  class XmlNode;
  // Forward declaring type: XmlElement
  class XmlElement;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: Array
  class Array;
}
// Completed forward declares
// Type namespace: System.Xml.Serialization
namespace System::Xml::Serialization {
  // Forward declaring type: XmlSerializationReader
  class XmlSerializationReader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Serialization::XmlSerializationReader);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Serialization::XmlSerializationReader*, "System.Xml.Serialization", "XmlSerializationReader");
// Type namespace: System.Xml.Serialization
namespace System::Xml::Serialization {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Serialization.XmlSerializationReader
  // [TokenAttribute] Offset: FFFFFFFF
  // [MonoTODOAttribute] Offset: FFFFFFFF
  class XmlSerializationReader : public System::Xml::Serialization::XmlSerializationGeneratedCode {
    public:
    // Nested type: System::Xml::Serialization::XmlSerializationReader::WriteCallbackInfo
    class WriteCallbackInfo;
    // Nested type: System::Xml::Serialization::XmlSerializationReader::CollectionFixup
    class CollectionFixup;
    // Nested type: System::Xml::Serialization::XmlSerializationReader::Fixup
    class Fixup;
    // Nested type: System::Xml::Serialization::XmlSerializationReader::CollectionItemFixup
    class CollectionItemFixup;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.XmlDocument document
    // Size: 0x8
    // Offset: 0x10
    System::Xml::XmlDocument* document;
    // Field size check
    static_assert(sizeof(System::Xml::XmlDocument*) == 0x8);
    // private System.Xml.XmlReader reader
    // Size: 0x8
    // Offset: 0x18
    System::Xml::XmlReader* reader;
    // Field size check
    static_assert(sizeof(System::Xml::XmlReader*) == 0x8);
    // private System.Collections.ArrayList fixups
    // Size: 0x8
    // Offset: 0x20
    System::Collections::ArrayList* fixups;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Collections.Hashtable collFixups
    // Size: 0x8
    // Offset: 0x28
    System::Collections::Hashtable* collFixups;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.ArrayList collItemFixups
    // Size: 0x8
    // Offset: 0x30
    System::Collections::ArrayList* collItemFixups;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Collections.Hashtable typesCallbacks
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Hashtable* typesCallbacks;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.ArrayList noIDTargets
    // Size: 0x8
    // Offset: 0x40
    System::Collections::ArrayList* noIDTargets;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Collections.Hashtable targets
    // Size: 0x8
    // Offset: 0x48
    System::Collections::Hashtable* targets;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable delayedListFixups
    // Size: 0x8
    // Offset: 0x50
    System::Collections::Hashtable* delayedListFixups;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Xml.Serialization.XmlSerializer eventSource
    // Size: 0x8
    // Offset: 0x58
    System::Xml::Serialization::XmlSerializer* eventSource;
    // Field size check
    static_assert(sizeof(System::Xml::Serialization::XmlSerializer*) == 0x8);
    // private System.Int32 delayedFixupId
    // Size: 0x4
    // Offset: 0x60
    int delayedFixupId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: delayedFixupId and: referencedObjects
    char __padding10[0x4] = {};
    // private System.Collections.Hashtable referencedObjects
    // Size: 0x8
    // Offset: 0x68
    System::Collections::Hashtable* referencedObjects;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Int32 readCount
    // Size: 0x4
    // Offset: 0x70
    int readCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 whileIterationCount
    // Size: 0x4
    // Offset: 0x74
    int whileIterationCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String w3SchemaNS
    // Size: 0x8
    // Offset: 0x78
    ::StringW w3SchemaNS;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String w3InstanceNS
    // Size: 0x8
    // Offset: 0x80
    ::StringW w3InstanceNS;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String w3InstanceNS2000
    // Size: 0x8
    // Offset: 0x88
    ::StringW w3InstanceNS2000;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String w3InstanceNS1999
    // Size: 0x8
    // Offset: 0x90
    ::StringW w3InstanceNS1999;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String soapNS
    // Size: 0x8
    // Offset: 0x98
    ::StringW soapNS;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String wsdlNS
    // Size: 0x8
    // Offset: 0xA0
    ::StringW wsdlNS;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String nullX
    // Size: 0x8
    // Offset: 0xA8
    ::StringW nullX;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String nil
    // Size: 0x8
    // Offset: 0xB0
    ::StringW nil;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String typeX
    // Size: 0x8
    // Offset: 0xB8
    ::StringW typeX;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String arrayType
    // Size: 0x8
    // Offset: 0xC0
    ::StringW arrayType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlQualifiedName arrayQName
    // Size: 0x8
    // Offset: 0xC8
    System::Xml::XmlQualifiedName* arrayQName;
    // Field size check
    static_assert(sizeof(System::Xml::XmlQualifiedName*) == 0x8);
    public:
    // Get instance field reference: private System.Xml.XmlDocument document
    System::Xml::XmlDocument*& dyn_document();
    // Get instance field reference: private System.Xml.XmlReader reader
    System::Xml::XmlReader*& dyn_reader();
    // Get instance field reference: private System.Collections.ArrayList fixups
    System::Collections::ArrayList*& dyn_fixups();
    // Get instance field reference: private System.Collections.Hashtable collFixups
    System::Collections::Hashtable*& dyn_collFixups();
    // Get instance field reference: private System.Collections.ArrayList collItemFixups
    System::Collections::ArrayList*& dyn_collItemFixups();
    // Get instance field reference: private System.Collections.Hashtable typesCallbacks
    System::Collections::Hashtable*& dyn_typesCallbacks();
