// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Serialization.XmlSerializationReader
#include "System/Xml/Serialization/XmlSerializationReader.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Serialization
namespace System::Xml::Serialization {
  // Forward declaring type: XmlSerializationCollectionFixupCallback
  class XmlSerializationCollectionFixupCallback;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Serialization::XmlSerializationReader::CollectionFixup);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Serialization::XmlSerializationReader::CollectionFixup*, "System.Xml.Serialization", "XmlSerializationReader/CollectionFixup");
// Type namespace: System.Xml.Serialization
namespace System::Xml::Serialization {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Serialization.XmlSerializationReader/System.Xml.Serialization.CollectionFixup
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlSerializationReader::CollectionFixup : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Xml.Serialization.XmlSerializationCollectionFixupCallback callback
    // Size: 0x8
    // Offset: 0x10
    ::System::Xml::Serialization::XmlSerializationCollectionFixupCallback* callback;
    // Field size check
    static_assert(sizeof(::System::Xml::Serialization::XmlSerializationCollectionFixupCallback*) == 0x8);
    // private System.Object collection
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppObject* collection;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object collectionItems
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* collectionItems;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.String id
    // Size: 0x8
    // Offset: 0x28
    ::StringW id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: private System.Xml.Serialization.XmlSerializationCollectionFixupCallback callback
    ::System::Xml::Serialization::XmlSerializationCollectionFixupCallback*& dyn_callback();
    // Get instance field reference: private System.Object collection
    ::Il2CppObject*& dyn_collection();
    // Get instance field reference: private System.Object collectionItems
    ::Il2CppObject*& dyn_collectionItems();
    // Get instance field reference: private System.String id
    ::StringW& dyn_id();
    // public System.Xml.Serialization.XmlSerializationCollectionFixupCallback get_Callback()
    // Offset: 0x1E1050C
    ::System::Xml::Serialization::XmlSerializationCollectionFixupCallback* get_Callback();
    // public System.Object get_Collection()
    // Offset: 0x1E10514
    ::Il2CppObject* get_Collection();
    // System.Object get_Id()
    // Offset: 0x1E1051C
    ::Il2CppObject* get_Id();
    // public System.Object get_CollectionItems()
    // Offset: 0x1E10524
    ::Il2CppObject* get_CollectionItems();
    // System.Void set_CollectionItems(System.Object value)
    // Offset: 0x1E1052C
    void set_CollectionItems(::Il2CppObject* value);
    // System.Void .ctor(System.Object collection, System.Xml.Serialization.XmlSerializationCollectionFixupCallback callback, System.String id)
    // Offset: 0x1E104CC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static XmlSerializationReader::CollectionFixup* New_ctor(::Il2CppObject* collection, ::System::Xml::Serialization::XmlSerializationCollectionFixupCallback* callback, ::StringW id) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Xml::Serialization::XmlSerializationReader::CollectionFixup::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<XmlSerializationReader::CollectionFixup*, creationType>(collection, callback, id)));
    }
  }; // System.Xml.Serialization.XmlSerializationReader/System.Xml.Serialization.CollectionFixup
  #pragma pack(pop)
  static check_size<sizeof(XmlSerializationReader::CollectionFixup), 40 + sizeof(::StringW)> __System_Xml_Serialization_XmlSerializationReader_CollectionFixupSizeCheck;
  static_assert(sizeof(XmlSerializationReader::CollectionFixup) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Xml::Serialization::XmlSerializationReader::CollectionFixup::get_Callback
// Il2CppName: get_Callback
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Xml::Serialization::XmlSerializationCollectionFixupCallback* (System::Xml::Serialization::XmlSerializationReader::CollectionFixup::*)()>(&System::Xml::Serialization::XmlSerializationReader::CollectionFixup::get_Callback)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Xml::Serialization::XmlSerializationReader::CollectionFixup*), "get_Callback", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Xml::Serialization::XmlSerializationReader::CollectionFixup::get_Collection
// Il2CppName: get_Collection
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Il2CppObject* (System::Xml::Serialization::XmlSerializationReader::CollectionFixup::*)()>(&System::Xml::Serialization::XmlSerializationReader::CollectionFixup::get_Collection)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Xml::Serialization::XmlSerializationReader::CollectionFixup*), "get_Collection", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Xml::Serialization::XmlSerializationReader::CollectionFixup::get_Id
// Il2CppName: get_Id
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Il2CppObject* (System::Xml::Serialization::XmlSerializationReader::CollectionFixup::*)()>(&System::Xml::Serialization::XmlSerializationReader::CollectionFixup::get_Id)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Xml::Serialization::XmlSerializationReader::CollectionFixup*), "get_Id", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Xml::Serialization::XmlSerializationReader::CollectionFixup::get_CollectionItems
// Il2CppName: get_CollectionItems
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Il2CppObject* (System::Xml::Serialization::XmlSerializationReader::CollectionFixup::*)()>(&System::Xml::Serialization::XmlSerializationReader::CollectionFixup::get_CollectionItems)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Xml::Serialization::XmlSerializationReader::CollectionFixup*), "get_CollectionItems", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Xml::Serialization::XmlSerializationReader::CollectionFixup::set_CollectionItems
// Il2CppName: set_CollectionItems
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Xml::Serialization::XmlSerializationReader::CollectionFixup::*)(::Il2CppObject*)>(&System::Xml::Serialization::XmlSerializationReader::CollectionFixup::set_CollectionItems)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Xml::Serialization::XmlSerializationReader::CollectionFixup*), "set_CollectionItems", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: System::Xml::Serialization::XmlSerializationReader::CollectionFixup::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
