// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.Serialization.XmlSerializationGeneratedCode
#include "System/Xml/Serialization/XmlSerializationGeneratedCode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml::Serialization
namespace System::Xml::Serialization {
  // Forward declaring type: XmlSerializerNamespaces
  class XmlSerializerNamespaces;
  // Forward declaring type: XmlSerializationWriteCallback
  class XmlSerializationWriteCallback;
  // Forward declaring type: TypeData
  class TypeData;
  // Forward declaring type: IXmlSerializable
  class IXmlSerializable;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: ObjectIDGenerator
  class ObjectIDGenerator;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Queue
  class Queue;
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: ICollection
  class ICollection;
}
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlWriter
  class XmlWriter;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
  // Forward declaring type: XmlNode
  class XmlNode;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: System.Xml.Serialization
namespace System::Xml::Serialization {
  // Forward declaring type: XmlSerializationWriter
  class XmlSerializationWriter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::Xml::Serialization::XmlSerializationWriter);
DEFINE_IL2CPP_ARG_TYPE(System::Xml::Serialization::XmlSerializationWriter*, "System.Xml.Serialization", "XmlSerializationWriter");
// Type namespace: System.Xml.Serialization
namespace System::Xml::Serialization {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Serialization.XmlSerializationWriter
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlSerializationWriter : public System::Xml::Serialization::XmlSerializationGeneratedCode {
    public:
    // Nested type: System::Xml::Serialization::XmlSerializationWriter::WriteCallbackInfo
    class WriteCallbackInfo;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Runtime.Serialization.ObjectIDGenerator idGenerator
    // Size: 0x8
    // Offset: 0x10
    System::Runtime::Serialization::ObjectIDGenerator* idGenerator;
    // Field size check
    static_assert(sizeof(System::Runtime::Serialization::ObjectIDGenerator*) == 0x8);
    // private System.Int32 qnameCount
    // Size: 0x4
    // Offset: 0x18
    int qnameCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean topLevelElement
    // Size: 0x1
    // Offset: 0x1C
    bool topLevelElement;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: topLevelElement and: namespaces
    char __padding2[0x3] = {};
    // private System.Collections.ArrayList namespaces
    // Size: 0x8
    // Offset: 0x20
    System::Collections::ArrayList* namespaces;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Xml.XmlWriter writer
    // Size: 0x8
    // Offset: 0x28
    System::Xml::XmlWriter* writer;
    // Field size check
    static_assert(sizeof(System::Xml::XmlWriter*) == 0x8);
    // private System.Collections.Queue referencedElements
    // Size: 0x8
    // Offset: 0x30
    System::Collections::Queue* referencedElements;
    // Field size check
    static_assert(sizeof(System::Collections::Queue*) == 0x8);
    // private System.Collections.Hashtable callbacks
    // Size: 0x8
    // Offset: 0x38
    System::Collections::Hashtable* callbacks;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable serializedObjects
    // Size: 0x8
    // Offset: 0x40
    System::Collections::Hashtable* serializedObjects;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    public:
    // Get instance field reference: private System.Runtime.Serialization.ObjectIDGenerator idGenerator
    System::Runtime::Serialization::ObjectIDGenerator*& dyn_idGenerator();
    // Get instance field reference: private System.Int32 qnameCount
    int& dyn_qnameCount();
    // Get instance field reference: private System.Boolean topLevelElement
    bool& dyn_topLevelElement();
    // Get instance field reference: private System.Collections.ArrayList namespaces
    System::Collections::ArrayList*& dyn_namespaces();
    // Get instance field reference: private System.Xml.XmlWriter writer
    System::Xml::XmlWriter*& dyn_writer();
    // Get instance field reference: private System.Collections.Queue referencedElements
    System::Collections::Queue*& dyn_referencedElements();
