// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Oculus.Platform.AchievementType
#include "Oculus/Platform/AchievementType.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: Oculus.Platform.Models
namespace Oculus::Platform::Models {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Platform.Models.AchievementDefinition
  // [TokenAttribute] Offset: FFFFFFFF
  class AchievementDefinition : public ::Il2CppObject {
    public:
    // public readonly Oculus.Platform.AchievementType Type
    // Size: 0x4
    // Offset: 0x10
    Oculus::Platform::AchievementType Type;
    // Field size check
    static_assert(sizeof(Oculus::Platform::AchievementType) == 0x4);
    // Padding between fields: Type and: Name
    char __padding0[0x4] = {};
    // public readonly System.String Name
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* Name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public readonly System.UInt32 BitfieldLength
    // Size: 0x4
    // Offset: 0x20
    uint BitfieldLength;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: BitfieldLength and: Target
    char __padding2[0x4] = {};
    // public readonly System.UInt64 Target
    // Size: 0x8
    // Offset: 0x28
    uint64_t Target;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // Creating value type constructor for type: AchievementDefinition
    AchievementDefinition(Oculus::Platform::AchievementType Type_ = {}, ::Il2CppString* Name_ = {}, uint BitfieldLength_ = {}, uint64_t Target_ = {}) noexcept : Type{Type_}, Name{Name_}, BitfieldLength{BitfieldLength_}, Target{Target_} {}
    // Get instance field: public readonly Oculus.Platform.AchievementType Type
    Oculus::Platform::AchievementType _get_Type();
    // Set instance field: public readonly Oculus.Platform.AchievementType Type
    void _set_Type(Oculus::Platform::AchievementType value);
    // Get instance field: public readonly System.String Name
    ::Il2CppString* _get_Name();
    // Set instance field: public readonly System.String Name
    void _set_Name(::Il2CppString* value);
    // Get instance field: public readonly System.UInt32 BitfieldLength
    uint _get_BitfieldLength();
    // Set instance field: public readonly System.UInt32 BitfieldLength
    void _set_BitfieldLength(uint value);
    // Get instance field: public readonly System.UInt64 Target
    uint64_t _get_Target();
    // Set instance field: public readonly System.UInt64 Target
    void _set_Target(uint64_t value);
    // public System.Void .ctor(System.IntPtr o)
    // Offset: 0x14A91B4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AchievementDefinition* New_ctor(System::IntPtr o) {
      static auto ___internal__logger = ::Logger::get().WithContext("Oculus::Platform::Models::AchievementDefinition::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AchievementDefinition*, creationType>(o)));
    }
  }; // Oculus.Platform.Models.AchievementDefinition
  #pragma pack(pop)
  static check_size<sizeof(AchievementDefinition), 40 + sizeof(uint64_t)> __Oculus_Platform_Models_AchievementDefinitionSizeCheck;
  static_assert(sizeof(AchievementDefinition) == 0x30);
}
DEFINE_IL2CPP_ARG_TYPE(Oculus::Platform::Models::AchievementDefinition*, "Oculus.Platform.Models", "AchievementDefinition");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Platform::Models::AchievementDefinition::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
