// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Oculus.Platform.CloudStorageDataStatus
#include "Oculus/Platform/CloudStorageDataStatus.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IntPtr
  struct IntPtr;
}
// Completed forward declares
// Type namespace: Oculus.Platform.Models
namespace Oculus::Platform::Models {
  // Autogenerated type: Oculus.Platform.Models.CloudStorageMetadata
  class CloudStorageMetadata : public ::Il2CppObject {
    public:
    // public readonly System.String Bucket
    // Offset: 0x10
    ::Il2CppString* Bucket;
    // public readonly System.Int64 Counter
    // Offset: 0x18
    int64_t Counter;
    // public readonly System.UInt32 DataSize
    // Offset: 0x20
    uint DataSize;
    // public readonly System.String ExtraData
    // Offset: 0x28
    ::Il2CppString* ExtraData;
    // public readonly System.String Key
    // Offset: 0x30
    ::Il2CppString* Key;
    // public readonly System.UInt64 SaveTime
    // Offset: 0x38
    uint64_t SaveTime;
    // public readonly Oculus.Platform.CloudStorageDataStatus Status
    // Offset: 0x40
    Oculus::Platform::CloudStorageDataStatus Status;
    // public readonly System.String VersionHandle
    // Offset: 0x48
    ::Il2CppString* VersionHandle;
    // public System.Void .ctor(System.IntPtr o)
    // Offset: 0xEA3190
    static CloudStorageMetadata* New_ctor(System::IntPtr o);
  }; // Oculus.Platform.Models.CloudStorageMetadata
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Oculus::Platform::Models::CloudStorageMetadata*, "Oculus.Platform.Models", "CloudStorageMetadata");
#pragma pack(pop)
