// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: UserList
  class UserList;
  // Forward declaring type: User
  class User;
  // Forward declaring type: Room
  class Room;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IntPtr
  struct IntPtr;
}
// Completed forward declares
// Type namespace: Oculus.Platform.Models
namespace Oculus::Platform::Models {
  // Autogenerated type: Oculus.Platform.Models.Party
  class Party : public ::Il2CppObject {
    public:
    // public readonly System.UInt64 ID
    // Offset: 0x10
    uint64_t ID;
    // public readonly Oculus.Platform.Models.UserList InvitedUsersOptional
    // Offset: 0x18
    Oculus::Platform::Models::UserList* InvitedUsersOptional;
    // public readonly Oculus.Platform.Models.UserList InvitedUsers
    // Offset: 0x20
    Oculus::Platform::Models::UserList* InvitedUsers;
    // public readonly Oculus.Platform.Models.User LeaderOptional
    // Offset: 0x28
    Oculus::Platform::Models::User* LeaderOptional;
    // public readonly Oculus.Platform.Models.User Leader
    // Offset: 0x30
    Oculus::Platform::Models::User* Leader;
    // public readonly Oculus.Platform.Models.Room RoomOptional
    // Offset: 0x38
    Oculus::Platform::Models::Room* RoomOptional;
    // public readonly Oculus.Platform.Models.Room Room
    // Offset: 0x40
    Oculus::Platform::Models::Room* Room;
    // public readonly Oculus.Platform.Models.UserList UsersOptional
    // Offset: 0x48
    Oculus::Platform::Models::UserList* UsersOptional;
    // public readonly Oculus.Platform.Models.UserList Users
    // Offset: 0x50
    Oculus::Platform::Models::UserList* Users;
    // public System.Void .ctor(System.IntPtr o)
    // Offset: 0xEA6D14
    static Party* New_ctor(System::IntPtr o);
  }; // Oculus.Platform.Models.Party
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Oculus::Platform::Models::Party*, "Oculus.Platform.Models", "Party");
#pragma pack(pop)
