// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: Oculus.Platform.Models
namespace Oculus::Platform::Models {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Platform.Models.Purchase
  class Purchase : public ::Il2CppObject {
    public:
    // public readonly System.DateTime ExpirationTime
    // Size: 0x8
    // Offset: 0x10
    System::DateTime ExpirationTime;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // public readonly System.DateTime GrantTime
    // Size: 0x8
    // Offset: 0x18
    System::DateTime GrantTime;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // public readonly System.String ID
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* _ID;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public readonly System.String Sku
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* Sku;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: Purchase
    Purchase(System::DateTime ExpirationTime_ = {}, System::DateTime GrantTime_ = {}, ::Il2CppString* _ID_ = {}, ::Il2CppString* Sku_ = {}) noexcept : ExpirationTime{ExpirationTime_}, GrantTime{GrantTime_}, _ID{_ID_}, Sku{Sku_} {}
    // public System.Void .ctor(System.IntPtr o)
    // Offset: 0x14D3DA4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Purchase* New_ctor(System::IntPtr o) {
      static auto ___internal__logger = ::Logger::get().WithContext("Oculus::Platform::Models::Purchase::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Purchase*, creationType>(o)));
    }
  }; // Oculus.Platform.Models.Purchase
  #pragma pack(pop)
  static check_size<sizeof(Purchase), 40 + sizeof(::Il2CppString*)> __Oculus_Platform_Models_PurchaseSizeCheck;
  static_assert(sizeof(Purchase) == 0x30);
}
DEFINE_IL2CPP_ARG_TYPE(Oculus::Platform::Models::Purchase*, "Oculus.Platform.Models", "Purchase");
// Writing MetadataGetter for method: Purchase::New_ctor
// Il2CppName: .ctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Purchase::*)(System::IntPtr)>(&Purchase::New_ctor<::il2cpp_utils::CreationType::Temporary>)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Purchase*), ".ctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<System::IntPtr>()});
  }
};
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Purchase::*)(System::IntPtr)>(&Purchase::New_ctor<::il2cpp_utils::CreationType::Manual>)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Purchase*), ".ctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<System::IntPtr>()});
  }
};
