// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: Oculus.Platform.Models
namespace Oculus::Platform::Models {
  // Size: 0x30
  // Autogenerated type: Oculus.Platform.Models.Purchase
  // [] Offset: FFFFFFFF
  class Purchase : public ::Il2CppObject {
    public:
    // public readonly System.DateTime ExpirationTime
    // Size: 0x8
    // Offset: 0x10
    System::DateTime ExpirationTime;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // public readonly System.DateTime GrantTime
    // Size: 0x8
    // Offset: 0x18
    System::DateTime GrantTime;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // public readonly System.UInt64 ID
    // Size: 0x8
    // Offset: 0x20
    uint64_t ID;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // public readonly System.String Sku
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* Sku;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: Purchase
    Purchase(System::DateTime ExpirationTime_ = {}, System::DateTime GrantTime_ = {}, uint64_t ID_ = {}, ::Il2CppString* Sku_ = {}) noexcept : ExpirationTime{ExpirationTime_}, GrantTime{GrantTime_}, ID{ID_}, Sku{Sku_} {}
    // public System.Void .ctor(System.IntPtr o)
    // Offset: 0x11DE8D8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Purchase* New_ctor(System::IntPtr o) {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("Oculus::Platform::Models").WithContext("Purchase").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Purchase*, creationType>(o)));
    }
  }; // Oculus.Platform.Models.Purchase
  static check_size<sizeof(Purchase), 40 + sizeof(::Il2CppString*)> __Oculus_Platform_Models_PurchaseSizeCheck;
  static_assert(sizeof(Purchase) == 0x30);
}
DEFINE_IL2CPP_ARG_TYPE(Oculus::Platform::Models::Purchase*, "Oculus.Platform.Models", "Purchase");
#pragma pack(pop)
