// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Org.BouncyCastle.Crypto.IDigest
#include "Org/BouncyCastle/Crypto/IDigest.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: Org.BouncyCastle.Crypto.Digests
namespace Org::BouncyCastle::Crypto::Digests {
  // Size: 0x68
  // Autogenerated type: Org.BouncyCastle.Crypto.Digests.Blake2bDigest
  // [] Offset: FFFFFFFF
  class Blake2bDigest : public ::Il2CppObject/*, public Org::BouncyCastle::Crypto::IDigest*/ {
    public:
    // private System.Int32 digestLength
    // Size: 0x4
    // Offset: 0x10
    int digestLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 keyLength
    // Size: 0x4
    // Offset: 0x14
    int keyLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Byte[] salt
    // Size: 0x8
    // Offset: 0x18
    ::Array<uint8_t>* salt;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] personalization
    // Size: 0x8
    // Offset: 0x20
    ::Array<uint8_t>* personalization;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] key
    // Size: 0x8
    // Offset: 0x28
    ::Array<uint8_t>* key;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Byte[] buffer
    // Size: 0x8
    // Offset: 0x30
    ::Array<uint8_t>* buffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Int32 bufferPos
    // Size: 0x4
    // Offset: 0x38
    int bufferPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: bufferPos and: internalState
    private: char __padding6[0x4] = {};
    public:
    // private System.UInt64[] internalState
    // Size: 0x8
    // Offset: 0x40
    ::Array<uint64_t>* internalState;
    // Field size check
    static_assert(sizeof(::Array<uint64_t>*) == 0x8);
    // private System.UInt64[] chainValue
    // Size: 0x8
    // Offset: 0x48
    ::Array<uint64_t>* chainValue;
    // Field size check
    static_assert(sizeof(::Array<uint64_t>*) == 0x8);
    // private System.UInt64 t0
    // Size: 0x8
    // Offset: 0x50
    uint64_t t0;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.UInt64 t1
    // Size: 0x8
    // Offset: 0x58
    uint64_t t1;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.UInt64 f0
    // Size: 0x8
    // Offset: 0x60
    uint64_t f0;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // Creating value type constructor for type: Blake2bDigest
    Blake2bDigest(int digestLength_ = {}, int keyLength_ = {}, ::Array<uint8_t>* salt_ = {}, ::Array<uint8_t>* personalization_ = {}, ::Array<uint8_t>* key_ = {}, ::Array<uint8_t>* buffer_ = {}, int bufferPos_ = {}, ::Array<uint64_t>* internalState_ = {}, ::Array<uint64_t>* chainValue_ = {}, uint64_t t0_ = {}, uint64_t t1_ = {}, uint64_t f0_ = {}) noexcept : digestLength{digestLength_}, keyLength{keyLength_}, salt{salt_}, personalization{personalization_}, key{key_}, buffer{buffer_}, bufferPos{bufferPos_}, internalState{internalState_}, chainValue{chainValue_}, t0{t0_}, t1{t1_}, f0{f0_} {}
    // Creating interface conversion operator: operator Org::BouncyCastle::Crypto::IDigest
    operator Org::BouncyCastle::Crypto::IDigest() noexcept {
      return *reinterpret_cast<Org::BouncyCastle::Crypto::IDigest*>(this);
    }
    // Get static field: static private readonly System.UInt64[] blake2b_IV
    static ::Array<uint64_t>* _get_blake2b_IV();
    // Set static field: static private readonly System.UInt64[] blake2b_IV
    static void _set_blake2b_IV(::Array<uint64_t>* value);
    // Get static field: static private readonly System.Byte[,] blake2b_sigma
    static ::Array<uint8_t>* _get_blake2b_sigma();
    // Set static field: static private readonly System.Byte[,] blake2b_sigma
    static void _set_blake2b_sigma(::Array<uint8_t>* value);
    // public System.Void .ctor(System.Int32 digestSize)
    // Offset: 0x1757F48
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Blake2bDigest* New_ctor(int digestSize) {
      static auto ___internal__logger = ::Logger::get().WithContext("codegen").WithContext("Org::BouncyCastle::Crypto::Digests").WithContext("Blake2bDigest").WithContext(".ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Blake2bDigest*, creationType>(digestSize)));
    }
    // private System.Void Init()
    // Offset: 0x17580B0
    void Init();
    // private System.Void InitializeInternalState()
    // Offset: 0x1758440
    void InitializeInternalState();
    // private System.Void Compress(System.Byte[] message, System.Int32 messagePos)
    // Offset: 0x17586B8
    void Compress(::Array<uint8_t>* message, int messagePos);
    // private System.Void G(System.UInt64 m1, System.UInt64 m2, System.Int32 posA, System.Int32 posB, System.Int32 posC, System.Int32 posD)
    // Offset: 0x1758F6C
    void G(uint64_t m1, uint64_t m2, int posA, int posB, int posC, int posD);
    // static private System.UInt64 Rotr64(System.UInt64 x, System.Int32 rot)
    // Offset: 0x175920C
    static uint64_t Rotr64(uint64_t x, int rot);
    // static private System.Void .cctor()
    // Offset: 0x175926C
    static void _cctor();
    // public System.Void Update(System.Byte b)
    // Offset: 0x17585F4
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Void IDigest::Update(System.Byte b)
    void Update(uint8_t b);
    // public System.Void BlockUpdate(System.Byte[] message, System.Int32 offset, System.Int32 len)
    // Offset: 0x1758C44
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Void IDigest::BlockUpdate(System.Byte[] message, System.Int32 offset, System.Int32 len)
    void BlockUpdate(::Array<uint8_t>* message, int offset, int len);
    // public System.Int32 DoFinal(System.Byte[] output, System.Int32 outOffset)
    // Offset: 0x1758D88
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Int32 IDigest::DoFinal(System.Byte[] output, System.Int32 outOffset)
    int DoFinal(::Array<uint8_t>* output, int outOffset);
    // public System.Void Reset()
    // Offset: 0x1758EE8
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Void IDigest::Reset()
    void Reset();
    // public System.String get_AlgorithmName()
    // Offset: 0x1759214
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.String IDigest::get_AlgorithmName()
    ::Il2CppString* get_AlgorithmName();
    // public System.Int32 GetDigestSize()
    // Offset: 0x175925C
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Int32 IDigest::GetDigestSize()
    int GetDigestSize();
    // public System.Int32 GetByteLength()
    // Offset: 0x1759264
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Int32 IDigest::GetByteLength()
    int GetByteLength();
  }; // Org.BouncyCastle.Crypto.Digests.Blake2bDigest
  static check_size<sizeof(Blake2bDigest), 96 + sizeof(uint64_t)> __Org_BouncyCastle_Crypto_Digests_Blake2bDigestSizeCheck;
  static_assert(sizeof(Blake2bDigest) == 0x68);
}
DEFINE_IL2CPP_ARG_TYPE(Org::BouncyCastle::Crypto::Digests::Blake2bDigest*, "Org.BouncyCastle.Crypto.Digests", "Blake2bDigest");
#pragma pack(pop)
