// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: Org.BouncyCastle.Crypto.IDigest
#include "Org/BouncyCastle/Crypto/IDigest.hpp"
// Completed includes
// Type namespace: Org.BouncyCastle.Crypto.Digests
namespace Org::BouncyCastle::Crypto::Digests {
  // Autogenerated type: Org.BouncyCastle.Crypto.Digests.Blake2bDigest
  class Blake2bDigest : public ::Il2CppObject/*, public Org::BouncyCastle::Crypto::IDigest*/ {
    public:
    // private System.Int32 digestLength
    // Offset: 0x10
    int digestLength;
    // private System.Int32 keyLength
    // Offset: 0x14
    int keyLength;
    // private System.Byte[] salt
    // Offset: 0x18
    ::Array<uint8_t>* salt;
    // private System.Byte[] personalization
    // Offset: 0x20
    ::Array<uint8_t>* personalization;
    // private System.Byte[] key
    // Offset: 0x28
    ::Array<uint8_t>* key;
    // private System.Byte[] buffer
    // Offset: 0x30
    ::Array<uint8_t>* buffer;
    // private System.Int32 bufferPos
    // Offset: 0x38
    int bufferPos;
    // private System.UInt64[] internalState
    // Offset: 0x40
    ::Array<uint64_t>* internalState;
    // private System.UInt64[] chainValue
    // Offset: 0x48
    ::Array<uint64_t>* chainValue;
    // private System.UInt64 t0
    // Offset: 0x50
    uint64_t t0;
    // private System.UInt64 t1
    // Offset: 0x58
    uint64_t t1;
    // private System.UInt64 f0
    // Offset: 0x60
    uint64_t f0;
    // Creating interface conversion operator: operator Org::BouncyCastle::Crypto::IDigest
    operator Org::BouncyCastle::Crypto::IDigest() noexcept {
      return *reinterpret_cast<Org::BouncyCastle::Crypto::IDigest*>(this);
    }
    // Get static field: static private readonly System.UInt64[] blake2b_IV
    static ::Array<uint64_t>* _get_blake2b_IV();
    // Set static field: static private readonly System.UInt64[] blake2b_IV
    static void _set_blake2b_IV(::Array<uint64_t>* value);
    // Get static field: static private readonly System.Byte[,] blake2b_sigma
    static ::Array<uint8_t>* _get_blake2b_sigma();
    // Set static field: static private readonly System.Byte[,] blake2b_sigma
    static void _set_blake2b_sigma(::Array<uint8_t>* value);
    // public System.Void .ctor(System.Int32 digestSize)
    // Offset: 0x1757F48
    static Blake2bDigest* New_ctor(int digestSize);
    // private System.Void Init()
    // Offset: 0x17580B0
    void Init();
    // private System.Void InitializeInternalState()
    // Offset: 0x1758440
    void InitializeInternalState();
    // private System.Void Compress(System.Byte[] message, System.Int32 messagePos)
    // Offset: 0x17586B8
    void Compress(::Array<uint8_t>* message, int messagePos);
    // private System.Void G(System.UInt64 m1, System.UInt64 m2, System.Int32 posA, System.Int32 posB, System.Int32 posC, System.Int32 posD)
    // Offset: 0x1758F6C
    void G(uint64_t m1, uint64_t m2, int posA, int posB, int posC, int posD);
    // static private System.UInt64 Rotr64(System.UInt64 x, System.Int32 rot)
    // Offset: 0x175920C
    static uint64_t Rotr64(uint64_t x, int rot);
    // static private System.Void .cctor()
    // Offset: 0x175926C
    static void _cctor();
    // public System.Void Update(System.Byte b)
    // Offset: 0x17585F4
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Void IDigest::Update(System.Byte b)
    void Update(uint8_t b);
    // public System.Void BlockUpdate(System.Byte[] message, System.Int32 offset, System.Int32 len)
    // Offset: 0x1758C44
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Void IDigest::BlockUpdate(System.Byte[] message, System.Int32 offset, System.Int32 len)
    void BlockUpdate(::Array<uint8_t>* message, int offset, int len);
    // public System.Int32 DoFinal(System.Byte[] output, System.Int32 outOffset)
    // Offset: 0x1758D88
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Int32 IDigest::DoFinal(System.Byte[] output, System.Int32 outOffset)
    int DoFinal(::Array<uint8_t>* output, int outOffset);
    // public System.Void Reset()
    // Offset: 0x1758EE8
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Void IDigest::Reset()
    void Reset();
    // public System.String get_AlgorithmName()
    // Offset: 0x1759214
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.String IDigest::get_AlgorithmName()
    ::Il2CppString* get_AlgorithmName();
    // public System.Int32 GetDigestSize()
    // Offset: 0x175925C
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Int32 IDigest::GetDigestSize()
    int GetDigestSize();
    // public System.Int32 GetByteLength()
    // Offset: 0x1759264
    // Implemented from: Org.BouncyCastle.Crypto.IDigest
    // Base method: System.Int32 IDigest::GetByteLength()
    int GetByteLength();
  }; // Org.BouncyCastle.Crypto.Digests.Blake2bDigest
  check_size<sizeof(Blake2bDigest), 96 + sizeof(uint64_t) + ((96 + sizeof(uint64_t)) % 8 != 0 ? (8 - (96 + sizeof(uint64_t)) % 8) : 0)> __Org_BouncyCastle_Crypto_Digests_Blake2bDigestSizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(Org::BouncyCastle::Crypto::Digests::Blake2bDigest*, "Org.BouncyCastle.Crypto.Digests", "Blake2bDigest");
#pragma pack(pop)
