// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineExtension
#include "Cinemachine/CinemachineExtension.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: SphereCollider
  class SphereCollider;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Plane
  struct Plane;
  // Forward declaring type: Ray
  struct Ray;
  // Forward declaring type: Bounds
  struct Bounds;
}
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: ICinemachineCamera
  class ICinemachineCamera;
  // Forward declaring type: CameraState
  struct CameraState;
  // Forward declaring type: CinemachineVirtualCameraBase
  class CinemachineVirtualCameraBase;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineCollider
  class CinemachineCollider;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineCollider);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineCollider*, "Cinemachine", "CinemachineCollider");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineCollider
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 98662C
  // [AddComponentMenu] Offset: 98662C
  // [SaveDuringPlayAttribute] Offset: 98662C
  // [ExecuteAlways] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: 98662C
  class CinemachineCollider : public ::Cinemachine::CinemachineExtension {
    public:
    // Nested type: ::Cinemachine::CinemachineCollider::ResolutionStrategy
    struct ResolutionStrategy;
    // Nested type: ::Cinemachine::CinemachineCollider::VcamExtraState
    class VcamExtraState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy
    // [TokenAttribute] Offset: FFFFFFFF
    struct ResolutionStrategy/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ResolutionStrategy
      constexpr ResolutionStrategy(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy PullCameraForward
      static constexpr const int PullCameraForward = 0;
      // Get static field: static public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy PullCameraForward
      static ::Cinemachine::CinemachineCollider::ResolutionStrategy _get_PullCameraForward();
      // Set static field: static public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy PullCameraForward
      static void _set_PullCameraForward(::Cinemachine::CinemachineCollider::ResolutionStrategy value);
      // static field const value: static public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy PreserveCameraHeight
      static constexpr const int PreserveCameraHeight = 1;
      // Get static field: static public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy PreserveCameraHeight
      static ::Cinemachine::CinemachineCollider::ResolutionStrategy _get_PreserveCameraHeight();
      // Set static field: static public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy PreserveCameraHeight
      static void _set_PreserveCameraHeight(::Cinemachine::CinemachineCollider::ResolutionStrategy value);
      // static field const value: static public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy PreserveCameraDistance
      static constexpr const int PreserveCameraDistance = 2;
      // Get static field: static public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy PreserveCameraDistance
      static ::Cinemachine::CinemachineCollider::ResolutionStrategy _get_PreserveCameraDistance();
      // Set static field: static public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy PreserveCameraDistance
      static void _set_PreserveCameraDistance(::Cinemachine::CinemachineCollider::ResolutionStrategy value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy
    #pragma pack(pop)
    static check_size<sizeof(CinemachineCollider::ResolutionStrategy), 0 + sizeof(int)> __Cinemachine_CinemachineCollider_ResolutionStrategySizeCheck;
    static_assert(sizeof(CinemachineCollider::ResolutionStrategy) == 0x4);
    public:
    // [HeaderAttribute] Offset: 0x988638
    // [TooltipAttribute] Offset: 0x988638
    // public UnityEngine.LayerMask m_CollideAgainst
    // Size: 0x4
    // Offset: 0x28
    ::UnityEngine::LayerMask m_CollideAgainst;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // Padding between fields: m_CollideAgainst and: m_IgnoreTag
    char __padding0[0x4] = {};
    // [TagFieldAttribute] Offset: 0x988698
    // [TooltipAttribute] Offset: 0x988698
    // public System.String m_IgnoreTag
    // Size: 0x8
    // Offset: 0x30
    ::StringW m_IgnoreTag;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [TooltipAttribute] Offset: 0x9886E4
    // public UnityEngine.LayerMask m_TransparentLayers
    // Size: 0x4
    // Offset: 0x38
    ::UnityEngine::LayerMask m_TransparentLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // [TooltipAttribute] Offset: 0x98871C
    // public System.Single m_MinimumDistanceFromTarget
    // Size: 0x4
    // Offset: 0x3C
    float m_MinimumDistanceFromTarget;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x988754
    // [TooltipAttribute] Offset: 0x988754
    // [FormerlySerializedAsAttribute] Offset: 0x988754
    // public System.Boolean m_AvoidObstacles
    // Size: 0x1
    // Offset: 0x40
    bool m_AvoidObstacles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AvoidObstacles and: m_DistanceLimit
    char __padding4[0x3] = {};
    // [TooltipAttribute] Offset: 0x9887C4
    // [FormerlySerializedAsAttribute] Offset: 0x9887C4
    // public System.Single m_DistanceLimit
    // Size: 0x4
    // Offset: 0x44
    float m_DistanceLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x988824
    // public System.Single m_MinimumOcclusionTime
    // Size: 0x4
    // Offset: 0x48
    float m_MinimumOcclusionTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98885C
    // public System.Single m_CameraRadius
    // Size: 0x4
    // Offset: 0x4C
    float m_CameraRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x988894
    // public Cinemachine.CinemachineCollider/Cinemachine.ResolutionStrategy m_Strategy
    // Size: 0x4
    // Offset: 0x50
    ::Cinemachine::CinemachineCollider::ResolutionStrategy m_Strategy;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineCollider::ResolutionStrategy) == 0x4);
    // [RangeAttribute] Offset: 0x9888CC
    // [TooltipAttribute] Offset: 0x9888CC
    // public System.Int32 m_MaximumEffort
    // Size: 0x4
    // Offset: 0x54
    int m_MaximumEffort;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x988920
    // [TooltipAttribute] Offset: 0x988920
    // public System.Single m_SmoothingTime
    // Size: 0x4
    // Offset: 0x58
    float m_SmoothingTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x988974
    // [TooltipAttribute] Offset: 0x988974
    // [FormerlySerializedAsAttribute] Offset: 0x988974
    // public System.Single m_Damping
    // Size: 0x4
    // Offset: 0x5C
    float m_Damping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x9889EC
    // [TooltipAttribute] Offset: 0x9889EC
    // public System.Single m_DampingWhenOccluded
    // Size: 0x4
    // Offset: 0x60
    float m_DampingWhenOccluded;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0x988A40
    // [TooltipAttribute] Offset: 0x988A40
    // public System.Single m_OptimalTargetDistance
    // Size: 0x4
    // Offset: 0x64
    float m_OptimalTargetDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.RaycastHit[] m_CornerBuffer
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::UnityEngine::RaycastHit> m_CornerBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.Collider[] mColliderBuffer
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::Collider*> mColliderBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    public:
    // static field const value: static private System.Single PrecisionSlush
    static constexpr const float PrecisionSlush = 0.001;
    // Get static field: static private System.Single PrecisionSlush
    static float _get_PrecisionSlush();
    // Set static field: static private System.Single PrecisionSlush
    static void _set_PrecisionSlush(float value);
    // static field const value: static private System.Single AngleThreshold
    static constexpr const float AngleThreshold = 0.1;
    // Get static field: static private System.Single AngleThreshold
    static float _get_AngleThreshold();
    // Set static field: static private System.Single AngleThreshold
    static void _set_AngleThreshold(float value);
    // Get static field: static private UnityEngine.SphereCollider mCameraCollider
