// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineVirtualCameraBase
#include "Cinemachine/CinemachineVirtualCameraBase.hpp"
// Including type: Cinemachine.CinemachineBlendDefinition
#include "Cinemachine/CinemachineBlendDefinition.hpp"
// Including type: Cinemachine.CameraState
#include "Cinemachine/CameraState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineBlenderSettings
  class CinemachineBlenderSettings;
  // Skipping declaration: ICinemachineCamera because it is already included!
  // Forward declaring type: CinemachineBlend
  class CinemachineBlend;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineClearShot
  class CinemachineClearShot;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineClearShot);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineClearShot*, "Cinemachine", "CinemachineClearShot");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x1D0
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineClearShot
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 986588
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 986588
  // [HelpURLAttribute] Offset: 986588
  class CinemachineClearShot : public ::Cinemachine::CinemachineVirtualCameraBase {
    public:
    // Writing base type padding for base size: 0x64 to desired offset: 0x68
    char ___base_padding[0x4] = {};
    // Nested type: ::Cinemachine::CinemachineClearShot::Pair
    struct Pair;
    // Nested type: ::Cinemachine::CinemachineClearShot::$$c
    class $$c;
    public:
    // [TooltipAttribute] Offset: 0x9883C8
    // [NoSaveDuringPlayAttribute] Offset: 0x9883C8
    // [VcamTargetPropertyAttribute] Offset: 0x9883C8
    // public UnityEngine.Transform m_LookAt
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* m_LookAt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x988424
    // [NoSaveDuringPlayAttribute] Offset: 0x988424
    // [VcamTargetPropertyAttribute] Offset: 0x988424
    // public UnityEngine.Transform m_Follow
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* m_Follow;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x988480
    // [NoSaveDuringPlayAttribute] Offset: 0x988480
    // public System.Boolean m_ShowDebugText
    // Size: 0x1
    // Offset: 0x78
    bool m_ShowDebugText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ShowDebugText and: m_ChildCameras
    char __padding2[0x7] = {};
    // [NoSaveDuringPlayAttribute] Offset: 0x9884CC
    // Cinemachine.CinemachineVirtualCameraBase[] m_ChildCameras
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::Cinemachine::CinemachineVirtualCameraBase*> m_ChildCameras;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineVirtualCameraBase*>) == 0x8);
    // [TooltipAttribute] Offset: 0x988514
    // public System.Single m_ActivateAfter
    // Size: 0x4
    // Offset: 0x88
    float m_ActivateAfter;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98854C
    // public System.Single m_MinDuration
    // Size: 0x4
    // Offset: 0x8C
    float m_MinDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x988584
    // public System.Boolean m_RandomizeChoice
    // Size: 0x1
    // Offset: 0x90
    bool m_RandomizeChoice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_RandomizeChoice and: m_DefaultBlend
    char __padding6[0x7] = {};
    // [CinemachineBlendDefinitionPropertyAttribute] Offset: 0x9885BC
    // [TooltipAttribute] Offset: 0x9885BC
    // public Cinemachine.CinemachineBlendDefinition m_DefaultBlend
    // Size: 0x10
    // Offset: 0x98
    ::Cinemachine::CinemachineBlendDefinition m_DefaultBlend;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlendDefinition) == 0x10);
    // public Cinemachine.CinemachineBlenderSettings m_CustomBlends
    // Size: 0x8
    // Offset: 0xA8
    ::Cinemachine::CinemachineBlenderSettings* m_CustomBlends;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlenderSettings*) == 0x8);
    // private Cinemachine.ICinemachineCamera <LiveChild>k__BackingField
    // Size: 0x8
    // Offset: 0xB0
    ::Cinemachine::ICinemachineCamera* LiveChild;
    // Field size check
    static_assert(sizeof(::Cinemachine::ICinemachineCamera*) == 0x8);
    // private Cinemachine.CameraState m_State
    // Size: 0xE4
    // Offset: 0xB8
    ::Cinemachine::CameraState m_State;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState) == 0xE4);
    // Padding between fields: m_State and: mActivationTime
    char __padding10[0x4] = {};
    // private System.Single mActivationTime
    // Size: 0x4
    // Offset: 0x1A0
    float mActivationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single mPendingActivationTime
    // Size: 0x4
    // Offset: 0x1A4
    float mPendingActivationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Cinemachine.ICinemachineCamera mPendingCamera
    // Size: 0x8
    // Offset: 0x1A8
    ::Cinemachine::ICinemachineCamera* mPendingCamera;
    // Field size check
    static_assert(sizeof(::Cinemachine::ICinemachineCamera*) == 0x8);
    // private Cinemachine.CinemachineBlend mActiveBlend
    // Size: 0x8
    // Offset: 0x1B0
    ::Cinemachine::CinemachineBlend* mActiveBlend;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlend*) == 0x8);
    // private System.Boolean mRandomizeNow
    // Size: 0x1
    // Offset: 0x1B8
    bool mRandomizeNow;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: mRandomizeNow and: m_RandomizedChilden
    char __padding15[0x7] = {};
    // private Cinemachine.CinemachineVirtualCameraBase[] m_RandomizedChilden
    // Size: 0x8
    // Offset: 0x1C0
    ::ArrayW<::Cinemachine::CinemachineVirtualCameraBase*> m_RandomizedChilden;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineVirtualCameraBase*>) == 0x8);
    // private Cinemachine.ICinemachineCamera <TransitioningFrom>k__BackingField
    // Size: 0x8
    // Offset: 0x1C8
    ::Cinemachine::ICinemachineCamera* TransitioningFrom;
    // Field size check
    static_assert(sizeof(::Cinemachine::ICinemachineCamera*) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.Transform m_LookAt
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_LookAt();
    // Get instance field reference: public UnityEngine.Transform m_Follow
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_Follow();
    // Get instance field reference: public System.Boolean m_ShowDebugText
    [[deprecated("Use field access instead!")]] bool& dyn_m_ShowDebugText();
    // Get instance field reference: Cinemachine.CinemachineVirtualCameraBase[] m_ChildCameras
    [[deprecated("Use field access instead!")]] ::ArrayW<::Cinemachine::CinemachineVirtualCameraBase*>& dyn_m_ChildCameras();
    // Get instance field reference: public System.Single m_ActivateAfter
