// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineComponentBase
#include "Cinemachine/CinemachineComponentBase.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine::Utility
namespace Cinemachine::Utility {
  // Forward declaring type: PositionPredictor
  class PositionPredictor;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rect
  struct Rect;
  // Forward declaring type: Vector2
  struct Vector2;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: ICinemachineTargetGroup
  class ICinemachineTargetGroup;
  // Forward declaring type: CameraState
  struct CameraState;
  // Skipping declaration: ICinemachineCamera because it is already included!
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineFramingTransposer
  class CinemachineFramingTransposer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineFramingTransposer);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineFramingTransposer*, "Cinemachine", "CinemachineFramingTransposer");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x164
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineFramingTransposer
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 987088
  // [AddComponentMenu] Offset: 987088
  // [SaveDuringPlayAttribute] Offset: 987088
  class CinemachineFramingTransposer : public ::Cinemachine::CinemachineComponentBase {
    public:
    // Nested type: ::Cinemachine::CinemachineFramingTransposer::FramingMode
    struct FramingMode;
    // Nested type: ::Cinemachine::CinemachineFramingTransposer::AdjustmentMode
    struct AdjustmentMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode
    // [TokenAttribute] Offset: FFFFFFFF
    // [DocumentationSortingAttribute] Offset: 987A14
    struct FramingMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: FramingMode
      constexpr FramingMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode Horizontal
      static constexpr const int Horizontal = 0;
      // Get static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode Horizontal
      static ::Cinemachine::CinemachineFramingTransposer::FramingMode _get_Horizontal();
      // Set static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode Horizontal
      static void _set_Horizontal(::Cinemachine::CinemachineFramingTransposer::FramingMode value);
      // static field const value: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode Vertical
      static constexpr const int Vertical = 1;
      // Get static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode Vertical
      static ::Cinemachine::CinemachineFramingTransposer::FramingMode _get_Vertical();
      // Set static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode Vertical
      static void _set_Vertical(::Cinemachine::CinemachineFramingTransposer::FramingMode value);
      // static field const value: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode HorizontalAndVertical
      static constexpr const int HorizontalAndVertical = 2;
      // Get static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode HorizontalAndVertical
      static ::Cinemachine::CinemachineFramingTransposer::FramingMode _get_HorizontalAndVertical();
      // Set static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode HorizontalAndVertical
      static void _set_HorizontalAndVertical(::Cinemachine::CinemachineFramingTransposer::FramingMode value);
      // static field const value: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode None
      static constexpr const int None = 3;
      // Get static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode None
      static ::Cinemachine::CinemachineFramingTransposer::FramingMode _get_None();
      // Set static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode None
      static void _set_None(::Cinemachine::CinemachineFramingTransposer::FramingMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode
    #pragma pack(pop)
    static check_size<sizeof(CinemachineFramingTransposer::FramingMode), 0 + sizeof(int)> __Cinemachine_CinemachineFramingTransposer_FramingModeSizeCheck;
    static_assert(sizeof(CinemachineFramingTransposer::FramingMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct AdjustmentMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AdjustmentMode
      constexpr AdjustmentMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode ZoomOnly
      static constexpr const int ZoomOnly = 0;
      // Get static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode ZoomOnly
      static ::Cinemachine::CinemachineFramingTransposer::AdjustmentMode _get_ZoomOnly();
      // Set static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode ZoomOnly
      static void _set_ZoomOnly(::Cinemachine::CinemachineFramingTransposer::AdjustmentMode value);
      // static field const value: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode DollyOnly
      static constexpr const int DollyOnly = 1;
      // Get static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode DollyOnly
      static ::Cinemachine::CinemachineFramingTransposer::AdjustmentMode _get_DollyOnly();
      // Set static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode DollyOnly
      static void _set_DollyOnly(::Cinemachine::CinemachineFramingTransposer::AdjustmentMode value);
      // static field const value: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode DollyThenZoom
      static constexpr const int DollyThenZoom = 2;
      // Get static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode DollyThenZoom
      static ::Cinemachine::CinemachineFramingTransposer::AdjustmentMode _get_DollyThenZoom();
      // Set static field: static public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode DollyThenZoom
      static void _set_DollyThenZoom(::Cinemachine::CinemachineFramingTransposer::AdjustmentMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode
    #pragma pack(pop)
    static check_size<sizeof(CinemachineFramingTransposer::AdjustmentMode), 0 + sizeof(int)> __Cinemachine_CinemachineFramingTransposer_AdjustmentModeSizeCheck;
    static_assert(sizeof(CinemachineFramingTransposer::AdjustmentMode) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0x98A8EC
    // public UnityEngine.Vector3 m_TrackedObjectOffset
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 m_TrackedObjectOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x98A924
    // [RangeAttribute] Offset: 0x98A924
    // [SpaceAttribute] Offset: 0x98A924
    // public System.Single m_LookaheadTime
    // Size: 0x4
    // Offset: 0x5C
    float m_LookaheadTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98A988
    // [RangeAttribute] Offset: 0x98A988
    // public System.Single m_LookaheadSmoothing
    // Size: 0x4
    // Offset: 0x60
    float m_LookaheadSmoothing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98A9DC
    // public System.Boolean m_LookaheadIgnoreY
    // Size: 0x1
    // Offset: 0x64
    bool m_LookaheadIgnoreY;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_LookaheadIgnoreY and: m_XDamping
    char __padding3[0x3] = {};
    // [SpaceAttribute] Offset: 0x98AA14
    // [RangeAttribute] Offset: 0x98AA14
    // [TooltipAttribute] Offset: 0x98AA14
    // public System.Single m_XDamping
    // Size: 0x4
    // Offset: 0x68
    float m_XDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98AA78
    // [TooltipAttribute] Offset: 0x98AA78
    // public System.Single m_YDamping
    // Size: 0x4
    // Offset: 0x6C
    float m_YDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98AACC
    // [TooltipAttribute] Offset: 0x98AACC
    // public System.Single m_ZDamping
    // Size: 0x4
    // Offset: 0x70
    float m_ZDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98AB20
    // public System.Boolean m_TargetMovementOnly
    // Size: 0x1
    // Offset: 0x74
    bool m_TargetMovementOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_TargetMovementOnly and: m_ScreenX
    char __padding7[0x3] = {};
    // [SpaceAttribute] Offset: 0x98AB58
    // [RangeAttribute] Offset: 0x98AB58
    // [TooltipAttribute] Offset: 0x98AB58
    // public System.Single m_ScreenX
    // Size: 0x4
    // Offset: 0x78
    float m_ScreenX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98ABBC
    // [TooltipAttribute] Offset: 0x98ABBC
    // public System.Single m_ScreenY
    // Size: 0x4
    // Offset: 0x7C
    float m_ScreenY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98AC10
    // public System.Single m_CameraDistance
    // Size: 0x4
    // Offset: 0x80
    float m_CameraDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x98AC48
    // [RangeAttribute] Offset: 0x98AC48
    // [TooltipAttribute] Offset: 0x98AC48
    // public System.Single m_DeadZoneWidth
    // Size: 0x4
    // Offset: 0x84
    float m_DeadZoneWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98ACAC
    // [TooltipAttribute] Offset: 0x98ACAC
    // public System.Single m_DeadZoneHeight
    // Size: 0x4
    // Offset: 0x88
    float m_DeadZoneHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98AD00
    // [FormerlySerializedAsAttribute] Offset: 0x98AD00
    // public System.Single m_DeadZoneDepth
    // Size: 0x4
    // Offset: 0x8C
    float m_DeadZoneDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x98AD60
    // [TooltipAttribute] Offset: 0x98AD60
    // public System.Boolean m_UnlimitedSoftZone
    // Size: 0x1
    // Offset: 0x90
    bool m_UnlimitedSoftZone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UnlimitedSoftZone and: m_SoftZoneWidth
    char __padding14[0x3] = {};
    // [RangeAttribute] Offset: 0x98ADAC
    // [TooltipAttribute] Offset: 0x98ADAC
    // public System.Single m_SoftZoneWidth
    // Size: 0x4
    // Offset: 0x94
    float m_SoftZoneWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98AE00
    // [TooltipAttribute] Offset: 0x98AE00
    // public System.Single m_SoftZoneHeight
    // Size: 0x4
    // Offset: 0x98
    float m_SoftZoneHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98AE54
    // [TooltipAttribute] Offset: 0x98AE54
    // public System.Single m_BiasX
    // Size: 0x4
    // Offset: 0x9C
    float m_BiasX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98AEA8
    // [TooltipAttribute] Offset: 0x98AEA8
    // public System.Single m_BiasY
    // Size: 0x4
    // Offset: 0xA0
    float m_BiasY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98AEFC
    // public System.Boolean m_CenterOnActivate
    // Size: 0x1
    // Offset: 0xA4
    bool m_CenterOnActivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CenterOnActivate and: m_GroupFramingMode
    char __padding19[0x3] = {};
    // [SpaceAttribute] Offset: 0x98AF34
    // [TooltipAttribute] Offset: 0x98AF34
    // [FormerlySerializedAsAttribute] Offset: 0x98AF34
    // public Cinemachine.CinemachineFramingTransposer/Cinemachine.FramingMode m_GroupFramingMode
    // Size: 0x4
    // Offset: 0xA8
    ::Cinemachine::CinemachineFramingTransposer::FramingMode m_GroupFramingMode;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineFramingTransposer::FramingMode) == 0x4);
    // [TooltipAttribute] Offset: 0x98AFA4
    // public Cinemachine.CinemachineFramingTransposer/Cinemachine.AdjustmentMode m_AdjustmentMode
    // Size: 0x4
    // Offset: 0xAC
    ::Cinemachine::CinemachineFramingTransposer::AdjustmentMode m_AdjustmentMode;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineFramingTransposer::AdjustmentMode) == 0x4);
    // [TooltipAttribute] Offset: 0x98AFDC
    // public System.Single m_GroupFramingSize
    // Size: 0x4
    // Offset: 0xB0
    float m_GroupFramingSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98B014
    // public System.Single m_MaxDollyIn
    // Size: 0x4
    // Offset: 0xB4
    float m_MaxDollyIn;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98B04C
    // public System.Single m_MaxDollyOut
    // Size: 0x4
    // Offset: 0xB8
    float m_MaxDollyOut;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98B084
    // public System.Single m_MinimumDistance
    // Size: 0x4
    // Offset: 0xBC
    float m_MinimumDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98B0BC
    // public System.Single m_MaximumDistance
    // Size: 0x4
    // Offset: 0xC0
    float m_MaximumDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98B0F4
    // [TooltipAttribute] Offset: 0x98B0F4
    // public System.Single m_MinimumFOV
    // Size: 0x4
    // Offset: 0xC4
    float m_MinimumFOV;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98B14C
    // [TooltipAttribute] Offset: 0x98B14C
    // public System.Single m_MaximumFOV
    // Size: 0x4
    // Offset: 0xC8
    float m_MaximumFOV;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98B1A4
    // public System.Single m_MinimumOrthoSize
    // Size: 0x4
    // Offset: 0xCC
    float m_MinimumOrthoSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98B1DC
    // public System.Single m_MaximumOrthoSize
    // Size: 0x4
    // Offset: 0xD0
    float m_MaximumOrthoSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 m_PreviousCameraPosition
    // Size: 0xC
    // Offset: 0xD4
    ::UnityEngine::Vector3 m_PreviousCameraPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private Cinemachine.Utility.PositionPredictor m_Predictor
    // Size: 0x8
    // Offset: 0xE0
    ::Cinemachine::Utility::PositionPredictor* m_Predictor;
    // Field size check
    static_assert(sizeof(::Cinemachine::Utility::PositionPredictor*) == 0x8);
    // private UnityEngine.Vector3 <TrackedPoint>k__BackingField
    // Size: 0xC
    // Offset: 0xE8
    ::UnityEngine::Vector3 TrackedPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean <InheritingPosition>k__BackingField
    // Size: 0x1
    // Offset: 0xF4
    bool InheritingPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: InheritingPosition and: m_prevFOV
    char __padding34[0x3] = {};
    // private System.Single m_prevFOV
    // Size: 0x4
    // Offset: 0xF8
    float m_prevFOV;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion m_prevRotation
    // Size: 0x10
    // Offset: 0xFC
    ::UnityEngine::Quaternion m_prevRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Bounds <LastBounds>k__BackingField
    // Size: 0x18
    // Offset: 0x10C
    ::UnityEngine::Bounds LastBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Bounds) == 0x18);
    // private UnityEngine.Matrix4x4 <LastBoundsMatrix>k__BackingField
    // Size: 0x40
    // Offset: 0x124
    ::UnityEngine::Matrix4x4 LastBoundsMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    public:
    // static field const value: static private System.Single kMinimumCameraDistance
    static constexpr const float kMinimumCameraDistance = 0.01;
    // Get static field: static private System.Single kMinimumCameraDistance
    static float _get_kMinimumCameraDistance();
    // Set static field: static private System.Single kMinimumCameraDistance
    static void _set_kMinimumCameraDistance(float value);
    // static field const value: static private System.Single kMinimumGroupSize
    static constexpr const float kMinimumGroupSize = 0.01;
    // Get static field: static private System.Single kMinimumGroupSize
    static float _get_kMinimumGroupSize();
    // Set static field: static private System.Single kMinimumGroupSize
    static void _set_kMinimumGroupSize(float value);
