// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineComponentBase
#include "Cinemachine/CinemachineComponentBase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CameraState
  struct CameraState;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineTransposer
  class CinemachineTransposer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineTransposer);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineTransposer*, "Cinemachine", "CinemachineTransposer");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineTransposer
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 987388
  // [AddComponentMenu] Offset: 987388
  // [SaveDuringPlayAttribute] Offset: 987388
  class CinemachineTransposer : public ::Cinemachine::CinemachineComponentBase {
    public:
    // Nested type: ::Cinemachine::CinemachineTransposer::BindingMode
    struct BindingMode;
    // Nested type: ::Cinemachine::CinemachineTransposer::AngularDampingMode
    struct AngularDampingMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Cinemachine.CinemachineTransposer/Cinemachine.BindingMode
    // [TokenAttribute] Offset: FFFFFFFF
    // [DocumentationSortingAttribute] Offset: 987A88
    struct BindingMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BindingMode
      constexpr BindingMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTargetOnAssign
      static constexpr const int LockToTargetOnAssign = 0;
      // Get static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTargetOnAssign
      static ::Cinemachine::CinemachineTransposer::BindingMode _get_LockToTargetOnAssign();
      // Set static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTargetOnAssign
      static void _set_LockToTargetOnAssign(::Cinemachine::CinemachineTransposer::BindingMode value);
      // static field const value: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTargetWithWorldUp
      static constexpr const int LockToTargetWithWorldUp = 1;
      // Get static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTargetWithWorldUp
      static ::Cinemachine::CinemachineTransposer::BindingMode _get_LockToTargetWithWorldUp();
      // Set static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTargetWithWorldUp
      static void _set_LockToTargetWithWorldUp(::Cinemachine::CinemachineTransposer::BindingMode value);
      // static field const value: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTargetNoRoll
      static constexpr const int LockToTargetNoRoll = 2;
      // Get static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTargetNoRoll
      static ::Cinemachine::CinemachineTransposer::BindingMode _get_LockToTargetNoRoll();
      // Set static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTargetNoRoll
      static void _set_LockToTargetNoRoll(::Cinemachine::CinemachineTransposer::BindingMode value);
      // static field const value: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTarget
      static constexpr const int LockToTarget = 3;
      // Get static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTarget
      static ::Cinemachine::CinemachineTransposer::BindingMode _get_LockToTarget();
      // Set static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode LockToTarget
      static void _set_LockToTarget(::Cinemachine::CinemachineTransposer::BindingMode value);
      // static field const value: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode WorldSpace
      static constexpr const int WorldSpace = 4;
      // Get static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode WorldSpace
      static ::Cinemachine::CinemachineTransposer::BindingMode _get_WorldSpace();
      // Set static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode WorldSpace
      static void _set_WorldSpace(::Cinemachine::CinemachineTransposer::BindingMode value);
      // static field const value: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode SimpleFollowWithWorldUp
      static constexpr const int SimpleFollowWithWorldUp = 5;
      // Get static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode SimpleFollowWithWorldUp
      static ::Cinemachine::CinemachineTransposer::BindingMode _get_SimpleFollowWithWorldUp();
      // Set static field: static public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode SimpleFollowWithWorldUp
      static void _set_SimpleFollowWithWorldUp(::Cinemachine::CinemachineTransposer::BindingMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Cinemachine.CinemachineTransposer/Cinemachine.BindingMode
    #pragma pack(pop)
    static check_size<sizeof(CinemachineTransposer::BindingMode), 0 + sizeof(int)> __Cinemachine_CinemachineTransposer_BindingModeSizeCheck;
    static_assert(sizeof(CinemachineTransposer::BindingMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Cinemachine.CinemachineTransposer/Cinemachine.AngularDampingMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct AngularDampingMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AngularDampingMode
      constexpr AngularDampingMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Cinemachine.CinemachineTransposer/Cinemachine.AngularDampingMode Euler
      static constexpr const int Euler = 0;
      // Get static field: static public Cinemachine.CinemachineTransposer/Cinemachine.AngularDampingMode Euler
      static ::Cinemachine::CinemachineTransposer::AngularDampingMode _get_Euler();
      // Set static field: static public Cinemachine.CinemachineTransposer/Cinemachine.AngularDampingMode Euler
      static void _set_Euler(::Cinemachine::CinemachineTransposer::AngularDampingMode value);
      // static field const value: static public Cinemachine.CinemachineTransposer/Cinemachine.AngularDampingMode Quaternion
      static constexpr const int Quaternion = 1;
      // Get static field: static public Cinemachine.CinemachineTransposer/Cinemachine.AngularDampingMode Quaternion
      static ::Cinemachine::CinemachineTransposer::AngularDampingMode _get_Quaternion();
      // Set static field: static public Cinemachine.CinemachineTransposer/Cinemachine.AngularDampingMode Quaternion
      static void _set_Quaternion(::Cinemachine::CinemachineTransposer::AngularDampingMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Cinemachine.CinemachineTransposer/Cinemachine.AngularDampingMode
    #pragma pack(pop)
    static check_size<sizeof(CinemachineTransposer::AngularDampingMode), 0 + sizeof(int)> __Cinemachine_CinemachineTransposer_AngularDampingModeSizeCheck;
    static_assert(sizeof(CinemachineTransposer::AngularDampingMode) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0x98BD04
    // public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode m_BindingMode
    // Size: 0x4
    // Offset: 0x50
    ::Cinemachine::CinemachineTransposer::BindingMode m_BindingMode;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineTransposer::BindingMode) == 0x4);
    // [TooltipAttribute] Offset: 0x98BD3C
    // public UnityEngine.Vector3 m_FollowOffset
    // Size: 0xC
    // Offset: 0x54
    ::UnityEngine::Vector3 m_FollowOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [RangeAttribute] Offset: 0x98BD74
    // [TooltipAttribute] Offset: 0x98BD74
    // public System.Single m_XDamping
    // Size: 0x4
    // Offset: 0x60
    float m_XDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98BDC8
    // [TooltipAttribute] Offset: 0x98BDC8
    // public System.Single m_YDamping
    // Size: 0x4
    // Offset: 0x64
    float m_YDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98BE1C
    // [TooltipAttribute] Offset: 0x98BE1C
    // public System.Single m_ZDamping
    // Size: 0x4
    // Offset: 0x68
    float m_ZDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Cinemachine.CinemachineTransposer/Cinemachine.AngularDampingMode m_AngularDampingMode
    // Size: 0x4
    // Offset: 0x6C
    ::Cinemachine::CinemachineTransposer::AngularDampingMode m_AngularDampingMode;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineTransposer::AngularDampingMode) == 0x4);
    // [RangeAttribute] Offset: 0x98BE70
    // [TooltipAttribute] Offset: 0x98BE70
    // public System.Single m_PitchDamping
    // Size: 0x4
    // Offset: 0x70
    float m_PitchDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98BEC4
    // [TooltipAttribute] Offset: 0x98BEC4
    // public System.Single m_YawDamping
    // Size: 0x4
    // Offset: 0x74
    float m_YawDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98BF18
    // [TooltipAttribute] Offset: 0x98BF18
    // public System.Single m_RollDamping
    // Size: 0x4
    // Offset: 0x78
    float m_RollDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98BF6C
    // [TooltipAttribute] Offset: 0x98BF6C
    // public System.Single m_AngularDamping
    // Size: 0x4
    // Offset: 0x7C
    float m_AngularDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <HideOffsetInInspector>k__BackingField
    // Size: 0x1
    // Offset: 0x80
    bool HideOffsetInInspector;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HideOffsetInInspector and: m_PreviousTargetPosition
    char __padding10[0x3] = {};
    // private UnityEngine.Vector3 m_PreviousTargetPosition
    // Size: 0xC
    // Offset: 0x84
    ::UnityEngine::Vector3 m_PreviousTargetPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_PreviousReferenceOrientation
    // Size: 0x10
    // Offset: 0x90
    ::UnityEngine::Quaternion m_PreviousReferenceOrientation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion m_targetOrientationOnAssign
    // Size: 0x10
    // Offset: 0xA0
    ::UnityEngine::Quaternion m_targetOrientationOnAssign;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 m_PreviousOffset
    // Size: 0xC
    // Offset: 0xB0
    ::UnityEngine::Vector3 m_PreviousOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: m_PreviousOffset and: m_previousTarget
    char __padding14[0x4] = {};
    // private UnityEngine.Transform m_previousTarget
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Transform* m_previousTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    public:
    // Get instance field reference: public Cinemachine.CinemachineTransposer/Cinemachine.BindingMode m_BindingMode
    [[deprecated("Use field access instead!")]] ::Cinemachine::CinemachineTransposer::BindingMode& dyn_m_BindingMode();
    // Get instance field reference: public UnityEngine.Vector3 m_FollowOffset
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_FollowOffset();
    // Get instance field reference: public System.Single m_XDamping
    [[deprecated("Use field access instead!")]] float& dyn_m_XDamping();
    // Get instance field reference: public System.Single m_YDamping
    [[deprecated("Use field access instead!")]] float& dyn_m_YDamping();
    // Get instance field reference: public System.Single m_ZDamping
    [[deprecated("Use field access instead!")]] float& dyn_m_ZDamping();
