// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineTransposer
#include "Cinemachine/CinemachineTransposer.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine::Utility
namespace Cinemachine::Utility {
  // Forward declaring type: HeadingTracker
  class HeadingTracker;
}
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Skipping declaration: ICinemachineCamera because it is already included!
  // Forward declaring type: CameraState
  struct CameraState;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Quaternion because it is already included!
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineOrbitalTransposer
  class CinemachineOrbitalTransposer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineOrbitalTransposer);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineOrbitalTransposer*, "Cinemachine", "CinemachineOrbitalTransposer");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x1A8
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineOrbitalTransposer
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 987208
  // [AddComponentMenu] Offset: 987208
  // [SaveDuringPlayAttribute] Offset: 987208
  class CinemachineOrbitalTransposer : public ::Cinemachine::CinemachineTransposer {
    public:
    // Nested type: ::Cinemachine::CinemachineOrbitalTransposer::Heading
    struct Heading;
    // Nested type: ::Cinemachine::CinemachineOrbitalTransposer::UpdateHeadingDelegate
    class UpdateHeadingDelegate;
    // Nested type: ::Cinemachine::CinemachineOrbitalTransposer::$$c
    class $$c;
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading
    // [TokenAttribute] Offset: FFFFFFFF
    // [DocumentationSortingAttribute] Offset: 987A3C
    struct Heading/*, public ::System::ValueType*/ {
      public:
      // Nested type: ::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition
      struct HeadingDefinition;
      // Size: 0x4
      #pragma pack(push, 1)
      // Autogenerated type: Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition
      // [TokenAttribute] Offset: FFFFFFFF
      // [DocumentationSortingAttribute] Offset: 987B34
      struct HeadingDefinition/*, public ::System::Enum*/ {
        public:
        public:
        // public System.Int32 value__
        // Size: 0x4
        // Offset: 0x0
        int value;
        // Field size check
        static_assert(sizeof(int) == 0x4);
        public:
        // Creating value type constructor for type: HeadingDefinition
        constexpr HeadingDefinition(int value_ = {}) noexcept : value{value_} {}
        // Creating interface conversion operator: operator ::System::Enum
        operator ::System::Enum() noexcept {
          return *reinterpret_cast<::System::Enum*>(this);
        }
        // Creating conversion operator: operator int
        constexpr operator int() const noexcept {
          return value;
        }
        // static field const value: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition PositionDelta
        static constexpr const int PositionDelta = 0;
        // Get static field: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition PositionDelta
        static ::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition _get_PositionDelta();
        // Set static field: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition PositionDelta
        static void _set_PositionDelta(::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition value);
        // static field const value: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition Velocity
        static constexpr const int Velocity = 1;
        // Get static field: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition Velocity
        static ::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition _get_Velocity();
        // Set static field: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition Velocity
        static void _set_Velocity(::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition value);
        // static field const value: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition TargetForward
        static constexpr const int TargetForward = 2;
        // Get static field: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition TargetForward
        static ::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition _get_TargetForward();
        // Set static field: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition TargetForward
        static void _set_TargetForward(::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition value);
        // static field const value: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition WorldForward
        static constexpr const int WorldForward = 3;
        // Get static field: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition WorldForward
        static ::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition _get_WorldForward();
        // Set static field: static public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition WorldForward
        static void _set_WorldForward(::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition value);
        // Get instance field reference: public System.Int32 value__
        [[deprecated("Use field access instead!")]] int& dyn_value__();
      }; // Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition
      #pragma pack(pop)
      static check_size<sizeof(CinemachineOrbitalTransposer::Heading::HeadingDefinition), 0 + sizeof(int)> __Cinemachine_CinemachineOrbitalTransposer_Heading_HeadingDefinitionSizeCheck;
      static_assert(sizeof(CinemachineOrbitalTransposer::Heading::HeadingDefinition) == 0x4);
      public:
      // [FormerlySerializedAsAttribute] Offset: 0x98DAF0
      // [TooltipAttribute] Offset: 0x98DAF0
      // public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition m_Definition
      // Size: 0x4
      // Offset: 0x0
      ::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition m_Definition;
      // Field size check
      static_assert(sizeof(::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition) == 0x4);
      // [RangeAttribute] Offset: 0x98DB50
      // [TooltipAttribute] Offset: 0x98DB50
      // public System.Int32 m_VelocityFilterStrength
      // Size: 0x4
      // Offset: 0x4
      int m_VelocityFilterStrength;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // [RangeAttribute] Offset: 0x98DBA4
      // [FormerlySerializedAsAttribute] Offset: 0x98DBA4
      // [TooltipAttribute] Offset: 0x98DBA4
      // public System.Single m_Bias
      // Size: 0x4
      // Offset: 0x8
      float m_Bias;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: Heading
      constexpr Heading(::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition m_Definition_ = {}, int m_VelocityFilterStrength_ = {}, float m_Bias_ = {}) noexcept : m_Definition{m_Definition_}, m_VelocityFilterStrength{m_VelocityFilterStrength_}, m_Bias{m_Bias_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition m_Definition
      [[deprecated("Use field access instead!")]] ::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition& dyn_m_Definition();
      // Get instance field reference: public System.Int32 m_VelocityFilterStrength
      [[deprecated("Use field access instead!")]] int& dyn_m_VelocityFilterStrength();
      // Get instance field reference: public System.Single m_Bias
      [[deprecated("Use field access instead!")]] float& dyn_m_Bias();
      // public System.Void .ctor(Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading/Cinemachine.HeadingDefinition def, System.Int32 filterStrength, System.Single bias)
      // Offset: 0xA51C74
      // ABORTED: conflicts with another method.  Heading(::Cinemachine::CinemachineOrbitalTransposer::Heading::HeadingDefinition def, int filterStrength, float bias);
    }; // Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading
    #pragma pack(pop)
    static check_size<sizeof(CinemachineOrbitalTransposer::Heading), 8 + sizeof(float)> __Cinemachine_CinemachineOrbitalTransposer_HeadingSizeCheck;
    static_assert(sizeof(CinemachineOrbitalTransposer::Heading) == 0xC);
    public:
    // [SpaceAttribute] Offset: 0x98B5BC
    // [OrbitalTransposerHeadingPropertyAttribute] Offset: 0x98B5BC
    // [TooltipAttribute] Offset: 0x98B5BC
    // public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading m_Heading
    // Size: 0xC
    // Offset: 0xC8
    ::Cinemachine::CinemachineOrbitalTransposer::Heading m_Heading;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineOrbitalTransposer::Heading) == 0xC);
    // [TooltipAttribute] Offset: 0x98B618
    // public Cinemachine.AxisState/Cinemachine.Recentering m_RecenterToTargetHeading
    // Size: 0x1C
    // Offset: 0xD4
    ::Cinemachine::AxisState::Recentering m_RecenterToTargetHeading;
    // Field size check
    static_assert(sizeof(::Cinemachine::AxisState::Recentering) == 0x1C);
    // [TooltipAttribute] Offset: 0x98B650
    // [AxisStatePropertyAttribute] Offset: 0x98B650
    // public Cinemachine.AxisState m_XAxis
    // Size: 0x66
    // Offset: 0xF0
    ::Cinemachine::AxisState m_XAxis;
    // Field size check
    static_assert(sizeof(::Cinemachine::AxisState) == 0x66);
    // Padding between fields: m_XAxis and: m_LegacyRadius
    char __padding2[0x2] = {};
    // [FormerlySerializedAsAttribute] Offset: 0x98B69C
    // private System.Single m_LegacyRadius
    // Size: 0x4
    // Offset: 0x158
    float m_LegacyRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x98B6F8
    // private System.Single m_LegacyHeightOffset
    // Size: 0x4
    // Offset: 0x15C
    float m_LegacyHeightOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x98B754
    // private System.Single m_LegacyHeadingBias
    // Size: 0x4
    // Offset: 0x160
    float m_LegacyHeadingBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [NoSaveDuringPlayAttribute] Offset: 0x98B7B0
    // public System.Boolean m_HeadingIsSlave
    // Size: 0x1
    // Offset: 0x164
    bool m_HeadingIsSlave;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HeadingIsSlave and: HeadingUpdater
    char __padding6[0x3] = {};
    // Cinemachine.CinemachineOrbitalTransposer/Cinemachine.UpdateHeadingDelegate HeadingUpdater
    // Size: 0x8
    // Offset: 0x168
    ::Cinemachine::CinemachineOrbitalTransposer::UpdateHeadingDelegate* HeadingUpdater;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineOrbitalTransposer::UpdateHeadingDelegate*) == 0x8);
    // private UnityEngine.Vector3 mLastTargetPosition
    // Size: 0xC
    // Offset: 0x170
    ::UnityEngine::Vector3 mLastTargetPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: mLastTargetPosition and: mHeadingTracker
    char __padding8[0x4] = {};
    // private Cinemachine.Utility.HeadingTracker mHeadingTracker
    // Size: 0x8
    // Offset: 0x180
    ::Cinemachine::Utility::HeadingTracker* mHeadingTracker;
    // Field size check
    static_assert(sizeof(::Cinemachine::Utility::HeadingTracker*) == 0x8);
    // private UnityEngine.Rigidbody mTargetRigidBody
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Rigidbody* mTargetRigidBody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Transform <PreviousTarget>k__BackingField
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::Transform* PreviousTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 mLastCameraPosition
    // Size: 0xC
    // Offset: 0x198
    ::UnityEngine::Vector3 mLastCameraPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single <LastHeading>k__BackingField
    // Size: 0x4
    // Offset: 0x1A4
    float LastHeading;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public Cinemachine.CinemachineOrbitalTransposer/Cinemachine.Heading m_Heading
    [[deprecated("Use field access instead!")]] ::Cinemachine::CinemachineOrbitalTransposer::Heading& dyn_m_Heading();
    // Get instance field reference: public Cinemachine.AxisState/Cinemachine.Recentering m_RecenterToTargetHeading
    [[deprecated("Use field access instead!")]] ::Cinemachine::AxisState::Recentering& dyn_m_RecenterToTargetHeading();
    // Get instance field reference: public Cinemachine.AxisState m_XAxis
    [[deprecated("Use field access instead!")]] ::Cinemachine::AxisState& dyn_m_XAxis();
    // Get instance field reference: private System.Single m_LegacyRadius
    [[deprecated("Use field access instead!")]] float& dyn_m_LegacyRadius();
    // Get instance field reference: private System.Single m_LegacyHeightOffset
