// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineVirtualCameraBase
#include "Cinemachine/CinemachineVirtualCameraBase.hpp"
// Including type: Cinemachine.LensSettings
#include "Cinemachine/LensSettings.hpp"
// Including type: Cinemachine.CinemachineVirtualCameraBase/Cinemachine.TransitionParams
#include "Cinemachine/CinemachineVirtualCameraBase_TransitionParams.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineComponentBase
  class CinemachineComponentBase;
  // Skipping declaration: ICinemachineCamera because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineVirtualCamera
  class CinemachineVirtualCamera;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineVirtualCamera);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineVirtualCamera*, "Cinemachine", "CinemachineVirtualCamera");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x1C8
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineVirtualCamera
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 986ED8
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 986ED8
  // [HelpURLAttribute] Offset: 986ED8
  class CinemachineVirtualCamera : public ::Cinemachine::CinemachineVirtualCameraBase {
    public:
    // Writing base type padding for base size: 0x64 to desired offset: 0x68
    char ___base_padding[0x4] = {};
    // Nested type: ::Cinemachine::CinemachineVirtualCamera::CreatePipelineDelegate
    class CreatePipelineDelegate;
    // Nested type: ::Cinemachine::CinemachineVirtualCamera::DestroyPipelineDelegate
    class DestroyPipelineDelegate;
    // Nested type: ::Cinemachine::CinemachineVirtualCamera::$$c
    class $$c;
    public:
    // [TooltipAttribute] Offset: 0x989EA4
    // [NoSaveDuringPlayAttribute] Offset: 0x989EA4
    // [VcamTargetPropertyAttribute] Offset: 0x989EA4
    // public UnityEngine.Transform m_LookAt
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* m_LookAt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x989F00
    // [NoSaveDuringPlayAttribute] Offset: 0x989F00
    // [VcamTargetPropertyAttribute] Offset: 0x989F00
    // public UnityEngine.Transform m_Follow
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* m_Follow;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x989F5C
    // [TooltipAttribute] Offset: 0x989F5C
    // public Cinemachine.LensSettings m_Lens
    // Size: 0x2E
    // Offset: 0x78
    ::Cinemachine::LensSettings m_Lens;
    // Field size check
    static_assert(sizeof(::Cinemachine::LensSettings) == 0x2E);
    // Padding between fields: m_Lens and: m_Transitions
    char __padding2[0x2] = {};
    // public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.TransitionParams m_Transitions
    // Size: 0x10
    // Offset: 0xA8
    ::Cinemachine::CinemachineVirtualCameraBase::TransitionParams m_Transitions;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineVirtualCameraBase::TransitionParams) == 0x10);
    // [FormerlySerializedAsAttribute] Offset: 0x989FBC
    // [FormerlySerializedAsAttribute] Offset: 0x989FBC
    // private Cinemachine.CinemachineVirtualCameraBase/Cinemachine.BlendHint m_LegacyBlendHint
    // Size: 0x4
    // Offset: 0xB8
    ::Cinemachine::CinemachineVirtualCameraBase::BlendHint m_LegacyBlendHint;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineVirtualCameraBase::BlendHint) == 0x4);
    // private System.Boolean <UserIsDragging>k__BackingField
    // Size: 0x1
    // Offset: 0xBC
    bool UserIsDragging;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UserIsDragging and: m_State
    char __padding5[0x3] = {};
    // private Cinemachine.CameraState m_State
    // Size: 0xE4
    // Offset: 0xC0
    ::Cinemachine::CameraState m_State;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState) == 0xE4);
    // Padding between fields: m_State and: m_ComponentPipeline
    char __padding6[0x4] = {};
    // private Cinemachine.CinemachineComponentBase[] m_ComponentPipeline
    // Size: 0x8
    // Offset: 0x1A8
    ::ArrayW<::Cinemachine::CinemachineComponentBase*> m_ComponentPipeline;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineComponentBase*>) == 0x8);
    // private UnityEngine.Transform m_ComponentOwner
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::Transform* m_ComponentOwner;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform mCachedLookAtTarget
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::Transform* mCachedLookAtTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private Cinemachine.CinemachineVirtualCameraBase mCachedLookAtTargetVcam
    // Size: 0x8
    // Offset: 0x1C0
    ::Cinemachine::CinemachineVirtualCameraBase* mCachedLookAtTargetVcam;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineVirtualCameraBase*) == 0x8);
    public:
    // static field const value: static public System.String PipelineName
    static constexpr const char* PipelineName = "cm";
    // Get static field: static public System.String PipelineName
    static ::StringW _get_PipelineName();
    // Set static field: static public System.String PipelineName
    static void _set_PipelineName(::StringW value);
    // Get static field: static public Cinemachine.CinemachineVirtualCamera/Cinemachine.CreatePipelineDelegate CreatePipelineOverride
    static ::Cinemachine::CinemachineVirtualCamera::CreatePipelineDelegate* _get_CreatePipelineOverride();
    // Set static field: static public Cinemachine.CinemachineVirtualCamera/Cinemachine.CreatePipelineDelegate CreatePipelineOverride
