// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineExtension
#include "Cinemachine/CinemachineExtension.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: Cinemachine.ConfinerOven
#include "Cinemachine/ConfinerOven.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CameraState
  struct CameraState;
  // Forward declaring type: CinemachineVirtualCameraBase
  class CinemachineVirtualCameraBase;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider2D
  class Collider2D;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineConfiner2D
  class CinemachineConfiner2D;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineConfiner2D);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineConfiner2D*, "Cinemachine", "CinemachineConfiner2D");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x128
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineConfiner2D
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 986774
  // [SaveDuringPlayAttribute] Offset: 986774
  // [ExecuteAlways] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: 986774
  class CinemachineConfiner2D : public ::Cinemachine::CinemachineExtension {
    public:
    // Nested type: ::Cinemachine::CinemachineConfiner2D::VcamExtraState
    class VcamExtraState;
    // Nested type: ::Cinemachine::CinemachineConfiner2D::ShapeCache
    struct ShapeCache;
    // Size: 0xE0
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.CinemachineConfiner2D/Cinemachine.ShapeCache
    // [TokenAttribute] Offset: FFFFFFFF
    struct ShapeCache/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Collections.Generic.List`1<System.Collections.Generic.List`1<UnityEngine.Vector2>> m_OriginalPath
      // Size: 0x8
      // Offset: 0x0
      ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>* m_OriginalPath;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>*) == 0x8);
      // public UnityEngine.Matrix4x4 m_DeltaWorldToBaked
      // Size: 0x40
      // Offset: 0x8
      ::UnityEngine::Matrix4x4 m_DeltaWorldToBaked;
      // Field size check
      static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
      // public UnityEngine.Matrix4x4 m_DeltaBakedToWorld
      // Size: 0x40
      // Offset: 0x48
      ::UnityEngine::Matrix4x4 m_DeltaBakedToWorld;
      // Field size check
      static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
      // private System.Single m_aspectRatio
      // Size: 0x4
      // Offset: 0x88
      float m_aspectRatio;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private System.Single m_maxOrthoSize
      // Size: 0x4
      // Offset: 0x8C
      float m_maxOrthoSize;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private UnityEngine.Matrix4x4 m_bakedToWorld
      // Size: 0x40
      // Offset: 0x90
      ::UnityEngine::Matrix4x4 m_bakedToWorld;
      // Field size check
      static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
      // private UnityEngine.Collider2D m_boundingShape2D
      // Size: 0x8
      // Offset: 0xD0
      ::UnityEngine::Collider2D* m_boundingShape2D;
      // Field size check
      static_assert(sizeof(::UnityEngine::Collider2D*) == 0x8);
      // private System.Collections.Generic.List`1<Cinemachine.ConfinerOven/Cinemachine.ConfinerState> m_confinerStates
      // Size: 0x8
      // Offset: 0xD8
      ::System::Collections::Generic::List_1<::Cinemachine::ConfinerOven::ConfinerState*>* m_confinerStates;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::ConfinerOven::ConfinerState*>*) == 0x8);
      public:
      // Creating value type constructor for type: ShapeCache
      constexpr ShapeCache(::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>* m_OriginalPath_ = {}, ::UnityEngine::Matrix4x4 m_DeltaWorldToBaked_ = {}, ::UnityEngine::Matrix4x4 m_DeltaBakedToWorld_ = {}, float m_aspectRatio_ = {}, float m_maxOrthoSize_ = {}, ::UnityEngine::Matrix4x4 m_bakedToWorld_ = {}, ::UnityEngine::Collider2D* m_boundingShape2D_ = {}, ::System::Collections::Generic::List_1<::Cinemachine::ConfinerOven::ConfinerState*>* m_confinerStates_ = {}) noexcept : m_OriginalPath{m_OriginalPath_}, m_DeltaWorldToBaked{m_DeltaWorldToBaked_}, m_DeltaBakedToWorld{m_DeltaBakedToWorld_}, m_aspectRatio{m_aspectRatio_}, m_maxOrthoSize{m_maxOrthoSize_}, m_bakedToWorld{m_bakedToWorld_}, m_boundingShape2D{m_boundingShape2D_}, m_confinerStates{m_confinerStates_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Collections.Generic.List`1<System.Collections.Generic.List`1<UnityEngine.Vector2>> m_OriginalPath
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>*& dyn_m_OriginalPath();
      // Get instance field reference: public UnityEngine.Matrix4x4 m_DeltaWorldToBaked
      [[deprecated("Use field access instead!")]] ::UnityEngine::Matrix4x4& dyn_m_DeltaWorldToBaked();
      // Get instance field reference: public UnityEngine.Matrix4x4 m_DeltaBakedToWorld
      [[deprecated("Use field access instead!")]] ::UnityEngine::Matrix4x4& dyn_m_DeltaBakedToWorld();
      // Get instance field reference: private System.Single m_aspectRatio
      [[deprecated("Use field access instead!")]] float& dyn_m_aspectRatio();
      // Get instance field reference: private System.Single m_maxOrthoSize
      [[deprecated("Use field access instead!")]] float& dyn_m_maxOrthoSize();
      // Get instance field reference: private UnityEngine.Matrix4x4 m_bakedToWorld
      [[deprecated("Use field access instead!")]] ::UnityEngine::Matrix4x4& dyn_m_bakedToWorld();
      // Get instance field reference: private UnityEngine.Collider2D m_boundingShape2D
      [[deprecated("Use field access instead!")]] ::UnityEngine::Collider2D*& dyn_m_boundingShape2D();
      // Get instance field reference: private System.Collections.Generic.List`1<Cinemachine.ConfinerOven/Cinemachine.ConfinerState> m_confinerStates
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::Cinemachine::ConfinerOven::ConfinerState*>*& dyn_m_confinerStates();
      // public System.Void Invalidate()
      // Offset: 0xA518B4
      void Invalidate();
      // public System.Boolean ValidateCache(UnityEngine.Collider2D boundingShape2D, System.Single maxOrthoSize, Cinemachine.ConfinerOven confinerBaker, System.Single aspectRatio, out System.Boolean confinerStateChanged)
      // Offset: 0xA518BC
      bool ValidateCache(::UnityEngine::Collider2D* boundingShape2D, float maxOrthoSize, ::Cinemachine::ConfinerOven* confinerBaker, float aspectRatio, ByRef<bool> confinerStateChanged);
      // private System.Boolean IsValid(in UnityEngine.Collider2D boundingShape2D, in System.Single aspectRatio, in System.Single maxOrthoSize)
      // Offset: 0xA518C4
      bool IsValid(ByRef<::UnityEngine::Collider2D*> boundingShape2D, ByRef<float> aspectRatio, ByRef<float> maxOrthoSize);
      // private System.Void CalculateDeltaTransformationMatrix()
      // Offset: 0xA518CC
      void CalculateDeltaTransformationMatrix();
    }; // Cinemachine.CinemachineConfiner2D/Cinemachine.ShapeCache
    #pragma pack(pop)
    static check_size<sizeof(CinemachineConfiner2D::ShapeCache), 216 + sizeof(::System::Collections::Generic::List_1<::Cinemachine::ConfinerOven::ConfinerState*>*)> __Cinemachine_CinemachineConfiner2D_ShapeCacheSizeCheck;
    static_assert(sizeof(CinemachineConfiner2D::ShapeCache) == 0xE0);
    public:
    // [TooltipAttribute] Offset: 0x988BD4
    // public UnityEngine.Collider2D m_BoundingShape2D
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Collider2D* m_BoundingShape2D;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider2D*) == 0x8);
    // [TooltipAttribute] Offset: 0x988C0C
    // [RangeAttribute] Offset: 0x988C0C
    // public System.Single m_Damping
    // Size: 0x4
    // Offset: 0x30
    float m_Damping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x988C60
    // public System.Single m_MaxWindowSize
    // Size: 0x4
    // Offset: 0x34
    float m_MaxWindowSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly Cinemachine.ConfinerOven m_confinerBaker
    // Size: 0x8
    // Offset: 0x38
    ::Cinemachine::ConfinerOven* m_confinerBaker;
    // Field size check
    static_assert(sizeof(::Cinemachine::ConfinerOven*) == 0x8);
    // private System.Single m_currentFrustumHeight
    // Size: 0x4
    // Offset: 0x40
    float m_currentFrustumHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_currentFrustumHeight and: m_shapeCache
    char __padding4[0x4] = {};
    // private Cinemachine.CinemachineConfiner2D/Cinemachine.ShapeCache m_shapeCache
    // Size: 0xE0
    // Offset: 0x48
    ::Cinemachine::CinemachineConfiner2D::ShapeCache m_shapeCache;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineConfiner2D::ShapeCache) == 0xE0);
    public:
    // static field const value: static private System.Single m_cornerAngleTreshold
    static constexpr const float m_cornerAngleTreshold = 10;
    // Get static field: static private System.Single m_cornerAngleTreshold
    static float _get_m_cornerAngleTreshold();
    // Set static field: static private System.Single m_cornerAngleTreshold
    static void _set_m_cornerAngleTreshold(float value);
    // Get instance field reference: public UnityEngine.Collider2D m_BoundingShape2D
    [[deprecated("Use field access instead!")]] ::UnityEngine::Collider2D*& dyn_m_BoundingShape2D();
    // Get instance field reference: public System.Single m_Damping
    [[deprecated("Use field access instead!")]] float& dyn_m_Damping();
    // Get instance field reference: public System.Single m_MaxWindowSize
    [[deprecated("Use field access instead!")]] float& dyn_m_MaxWindowSize();
    // Get instance field reference: private readonly Cinemachine.ConfinerOven m_confinerBaker
    [[deprecated("Use field access instead!")]] ::Cinemachine::ConfinerOven*& dyn_m_confinerBaker();
    // Get instance field reference: private System.Single m_currentFrustumHeight
    [[deprecated("Use field access instead!")]] float& dyn_m_currentFrustumHeight();
    // Get instance field reference: private Cinemachine.CinemachineConfiner2D/Cinemachine.ShapeCache m_shapeCache
    [[deprecated("Use field access instead!")]] ::Cinemachine::CinemachineConfiner2D::ShapeCache& dyn_m_shapeCache();
    // public System.Void InvalidateCache()
    // Offset: 0x1411744
    void InvalidateCache();
    // public System.Boolean ValidateCache(System.Single cameraAspectRatio)
    // Offset: 0x1411750
    bool ValidateCache(float cameraAspectRatio);
    // private System.Single CalculateHalfFrustumHeight(in Cinemachine.CameraState state, in System.Single cameraPosLocalZ)
    // Offset: 0x1411D90
    float CalculateHalfFrustumHeight(ByRef<::Cinemachine::CameraState> state, ByRef<float> cameraPosLocalZ);
    // private UnityEngine.Vector2 ConfinePoint(UnityEngine.Vector2 positionToConfine, in System.Collections.Generic.List`1<System.Collections.Generic.List`1<UnityEngine.Vector2>> pathCache, in System.Boolean hasBone, in System.Single windowWidth, in System.Single windowHeight)
    // Offset: 0x1411E8C
    ::UnityEngine::Vector2 ConfinePoint(::UnityEngine::Vector2 positionToConfine, ByRef<::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>*> pathCache, ByRef<bool> hasBone, ByRef<float> windowWidth, ByRef<float> windowHeight);
    // private System.Boolean DoesIntersectOriginal(UnityEngine.Vector2 l1, UnityEngine.Vector2 l2)
    // Offset: 0x141220C
    bool DoesIntersectOriginal(::UnityEngine::Vector2 l1, ::UnityEngine::Vector2 l2);
    // System.Boolean GetGizmoPaths(out System.Collections.Generic.List`1<System.Collections.Generic.List`1<UnityEngine.Vector2>> originalPath, ref System.Collections.Generic.List`1<System.Collections.Generic.List`1<UnityEngine.Vector2>> currentPath, out UnityEngine.Matrix4x4 pathLocalToWorld)
    // Offset: 0x14123B0
    bool GetGizmoPaths(ByRef<::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>*> originalPath, ByRef<::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>*> currentPath, ByRef<::UnityEngine::Matrix4x4> pathLocalToWorld);
    // System.Boolean IsOverCachedMaxFrustumHeight()
    // Offset: 0x14125B0
    bool IsOverCachedMaxFrustumHeight();
    // private System.Void OnValidate()
    // Offset: 0x14125EC
    void OnValidate();
    // private System.Void Reset()
    // Offset: 0x1412680
    void Reset();
    // public System.Void .ctor()
    // Offset: 0x1412690
    // Implemented from: Cinemachine.CinemachineExtension
    // Base method: System.Void CinemachineExtension::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CinemachineConfiner2D* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Cinemachine::CinemachineConfiner2D::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CinemachineConfiner2D*, creationType>()));
    }
    // protected override System.Void PostPipelineStageCallback(Cinemachine.CinemachineVirtualCameraBase vcam, Cinemachine.CinemachineCore/Cinemachine.Stage stage, ref Cinemachine.CameraState state, System.Single deltaTime)
    // Offset: 0x1411790
    // Implemented from: Cinemachine.CinemachineExtension
    // Base method: System.Void CinemachineExtension::PostPipelineStageCallback(Cinemachine.CinemachineVirtualCameraBase vcam, Cinemachine.CinemachineCore/Cinemachine.Stage stage, ref Cinemachine.CameraState state, System.Single deltaTime)
    void PostPipelineStageCallback(::Cinemachine::CinemachineVirtualCameraBase* vcam, ::Cinemachine::CinemachineCore::Stage stage, ByRef<::Cinemachine::CameraState> state, float deltaTime);
  }; // Cinemachine.CinemachineConfiner2D
  #pragma pack(pop)
  static check_size<sizeof(CinemachineConfiner2D), 72 + sizeof(::Cinemachine::CinemachineConfiner2D::ShapeCache)> __Cinemachine_CinemachineConfiner2DSizeCheck;
  static_assert(sizeof(CinemachineConfiner2D) == 0x128);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineConfiner2D::ShapeCache, "Cinemachine", "CinemachineConfiner2D/ShapeCache");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::InvalidateCache
// Il2CppName: InvalidateCache
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Cinemachine::CinemachineConfiner2D::*)()>(&Cinemachine::CinemachineConfiner2D::InvalidateCache)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "InvalidateCache", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::ValidateCache
// Il2CppName: ValidateCache
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Cinemachine::CinemachineConfiner2D::*)(float)>(&Cinemachine::CinemachineConfiner2D::ValidateCache)> {
  static const MethodInfo* get() {
    static auto* cameraAspectRatio = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "ValidateCache", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{cameraAspectRatio});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::CalculateHalfFrustumHeight
// Il2CppName: CalculateHalfFrustumHeight
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (Cinemachine::CinemachineConfiner2D::*)(ByRef<::Cinemachine::CameraState>, ByRef<float>)>(&Cinemachine::CinemachineConfiner2D::CalculateHalfFrustumHeight)> {
  static const MethodInfo* get() {
    static auto* state = &::il2cpp_utils::GetClassFromName("Cinemachine", "CameraState")->this_arg;
    static auto* cameraPosLocalZ = &::il2cpp_utils::GetClassFromName("System", "Single")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "CalculateHalfFrustumHeight", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{state, cameraPosLocalZ});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::ConfinePoint
// Il2CppName: ConfinePoint
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector2 (Cinemachine::CinemachineConfiner2D::*)(::UnityEngine::Vector2, ByRef<::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>*>, ByRef<bool>, ByRef<float>, ByRef<float>)>(&Cinemachine::CinemachineConfiner2D::ConfinePoint)> {
  static const MethodInfo* get() {
    static auto* positionToConfine = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector2")->byval_arg;
    static auto* pathCache = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("UnityEngine", "Vector2")})})->this_arg;
    static auto* hasBone = &::il2cpp_utils::GetClassFromName("System", "Boolean")->this_arg;
    static auto* windowWidth = &::il2cpp_utils::GetClassFromName("System", "Single")->this_arg;
    static auto* windowHeight = &::il2cpp_utils::GetClassFromName("System", "Single")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "ConfinePoint", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{positionToConfine, pathCache, hasBone, windowWidth, windowHeight});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::DoesIntersectOriginal
// Il2CppName: DoesIntersectOriginal
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Cinemachine::CinemachineConfiner2D::*)(::UnityEngine::Vector2, ::UnityEngine::Vector2)>(&Cinemachine::CinemachineConfiner2D::DoesIntersectOriginal)> {
  static const MethodInfo* get() {
    static auto* l1 = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector2")->byval_arg;
    static auto* l2 = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector2")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "DoesIntersectOriginal", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{l1, l2});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::GetGizmoPaths
// Il2CppName: GetGizmoPaths
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Cinemachine::CinemachineConfiner2D::*)(ByRef<::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>*>, ByRef<::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Vector2>*>*>, ByRef<::UnityEngine::Matrix4x4>)>(&Cinemachine::CinemachineConfiner2D::GetGizmoPaths)> {
  static const MethodInfo* get() {
    static auto* originalPath = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("UnityEngine", "Vector2")})})->this_arg;
    static auto* currentPath = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("UnityEngine", "Vector2")})})->this_arg;
    static auto* pathLocalToWorld = &::il2cpp_utils::GetClassFromName("UnityEngine", "Matrix4x4")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "GetGizmoPaths", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{originalPath, currentPath, pathLocalToWorld});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::IsOverCachedMaxFrustumHeight
// Il2CppName: IsOverCachedMaxFrustumHeight
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Cinemachine::CinemachineConfiner2D::*)()>(&Cinemachine::CinemachineConfiner2D::IsOverCachedMaxFrustumHeight)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "IsOverCachedMaxFrustumHeight", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::OnValidate
// Il2CppName: OnValidate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Cinemachine::CinemachineConfiner2D::*)()>(&Cinemachine::CinemachineConfiner2D::OnValidate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "OnValidate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::Reset
// Il2CppName: Reset
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Cinemachine::CinemachineConfiner2D::*)()>(&Cinemachine::CinemachineConfiner2D::Reset)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "Reset", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Cinemachine::CinemachineConfiner2D::PostPipelineStageCallback
// Il2CppName: PostPipelineStageCallback
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Cinemachine::CinemachineConfiner2D::*)(::Cinemachine::CinemachineVirtualCameraBase*, ::Cinemachine::CinemachineCore::Stage, ByRef<::Cinemachine::CameraState>, float)>(&Cinemachine::CinemachineConfiner2D::PostPipelineStageCallback)> {
  static const MethodInfo* get() {
    static auto* vcam = &::il2cpp_utils::GetClassFromName("Cinemachine", "CinemachineVirtualCameraBase")->byval_arg;
    static auto* stage = &::il2cpp_utils::GetClassFromName("Cinemachine", "CinemachineCore/Stage")->byval_arg;
    static auto* state = &::il2cpp_utils::GetClassFromName("Cinemachine", "CameraState")->this_arg;
    static auto* deltaTime = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineConfiner2D*), "PostPipelineStageCallback", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{vcam, stage, state, deltaTime});
  }
};
