// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineExtension
#include "Cinemachine/CinemachineExtension.hpp"
// Including type: Cinemachine.CinemachineCore/Cinemachine.Stage
#include "Cinemachine/CinemachineCore_Stage.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineVirtualCameraBase
  class CinemachineVirtualCameraBase;
  // Forward declaring type: CameraState
  struct CameraState;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineImpulseListener
  class CinemachineImpulseListener;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineImpulseListener);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineImpulseListener*, "Cinemachine", "CinemachineImpulseListener");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x35
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineImpulseListener
  // [TokenAttribute] Offset: FFFFFFFF
  // [SaveDuringPlayAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 987740
  // [DocumentationSortingAttribute] Offset: 987740
  // [ExecuteAlways] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: 987740
  class CinemachineImpulseListener : public ::Cinemachine::CinemachineExtension {
    public:
    public:
    // [TooltipAttribute] Offset: 0x98D5A4
    // public Cinemachine.CinemachineCore/Cinemachine.Stage m_ApplyAfter
    // Size: 0x4
    // Offset: 0x28
    ::Cinemachine::CinemachineCore::Stage m_ApplyAfter;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineCore::Stage) == 0x4);
    // [TooltipAttribute] Offset: 0x98D5DC
    // [CinemachineImpulseChannelPropertyAttribute] Offset: 0x98D5DC
    // public System.Int32 m_ChannelMask
    // Size: 0x4
    // Offset: 0x2C
    int m_ChannelMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0x98D628
    // public System.Single m_Gain
    // Size: 0x4
    // Offset: 0x30
    float m_Gain;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98D660
    // public System.Boolean m_Use2DDistance
    // Size: 0x1
    // Offset: 0x34
    bool m_Use2DDistance;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public Cinemachine.CinemachineCore/Cinemachine.Stage m_ApplyAfter
    [[deprecated("Use field access instead!")]] ::Cinemachine::CinemachineCore::Stage& dyn_m_ApplyAfter();
    // Get instance field reference: public System.Int32 m_ChannelMask
    [[deprecated("Use field access instead!")]] int& dyn_m_ChannelMask();
    // Get instance field reference: public System.Single m_Gain
    [[deprecated("Use field access instead!")]] float& dyn_m_Gain();
    // Get instance field reference: public System.Boolean m_Use2DDistance
    [[deprecated("Use field access instead!")]] bool& dyn_m_Use2DDistance();
    // private System.Void Reset()
    // Offset: 0x105A674
    void Reset();
    // public System.Void .ctor()
    // Offset: 0x105AC38
    // Implemented from: Cinemachine.CinemachineExtension
    // Base method: System.Void CinemachineExtension::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CinemachineImpulseListener* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Cinemachine::CinemachineImpulseListener::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CinemachineImpulseListener*, creationType>()));
    }
    // protected override System.Void PostPipelineStageCallback(Cinemachine.CinemachineVirtualCameraBase vcam, Cinemachine.CinemachineCore/Cinemachine.Stage stage, ref Cinemachine.CameraState state, System.Single deltaTime)
    // Offset: 0x105A690
    // Implemented from: Cinemachine.CinemachineExtension
    // Base method: System.Void CinemachineExtension::PostPipelineStageCallback(Cinemachine.CinemachineVirtualCameraBase vcam, Cinemachine.CinemachineCore/Cinemachine.Stage stage, ref Cinemachine.CameraState state, System.Single deltaTime)
    void PostPipelineStageCallback(::Cinemachine::CinemachineVirtualCameraBase* vcam, ::Cinemachine::CinemachineCore::Stage stage, ByRef<::Cinemachine::CameraState> state, float deltaTime);
  }; // Cinemachine.CinemachineImpulseListener
  #pragma pack(pop)
  static check_size<sizeof(CinemachineImpulseListener), 52 + sizeof(bool)> __Cinemachine_CinemachineImpulseListenerSizeCheck;
  static_assert(sizeof(CinemachineImpulseListener) == 0x35);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Cinemachine::CinemachineImpulseListener::Reset
// Il2CppName: Reset
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Cinemachine::CinemachineImpulseListener::*)()>(&Cinemachine::CinemachineImpulseListener::Reset)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineImpulseListener*), "Reset", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::CinemachineImpulseListener::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Cinemachine::CinemachineImpulseListener::PostPipelineStageCallback
// Il2CppName: PostPipelineStageCallback
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Cinemachine::CinemachineImpulseListener::*)(::Cinemachine::CinemachineVirtualCameraBase*, ::Cinemachine::CinemachineCore::Stage, ByRef<::Cinemachine::CameraState>, float)>(&Cinemachine::CinemachineImpulseListener::PostPipelineStageCallback)> {
  static const MethodInfo* get() {
    static auto* vcam = &::il2cpp_utils::GetClassFromName("Cinemachine", "CinemachineVirtualCameraBase")->byval_arg;
    static auto* stage = &::il2cpp_utils::GetClassFromName("Cinemachine", "CinemachineCore/Stage")->byval_arg;
    static auto* state = &::il2cpp_utils::GetClassFromName("Cinemachine", "CameraState")->this_arg;
    static auto* deltaTime = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::CinemachineImpulseListener*), "PostPipelineStageCallback", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{vcam, stage, state, deltaTime});
  }
};
