// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineVirtualCameraBase
#include "Cinemachine/CinemachineVirtualCameraBase.hpp"
// Including type: Cinemachine.CinemachineBlendDefinition
#include "Cinemachine/CinemachineBlendDefinition.hpp"
// Including type: Cinemachine.CameraState
#include "Cinemachine/CameraState.hpp"
// Including type: UnityEngine.AnimatorClipInfo
#include "UnityEngine/AnimatorClipInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineBlenderSettings
  class CinemachineBlenderSettings;
  // Skipping declaration: ICinemachineCamera because it is already included!
  // Forward declaring type: CinemachineBlend
  class CinemachineBlend;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: AnimationClip
  class AnimationClip;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineStateDrivenCamera
  class CinemachineStateDrivenCamera;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineStateDrivenCamera);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineStateDrivenCamera*, "Cinemachine", "CinemachineStateDrivenCamera");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x218
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineStateDrivenCamera
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 986CEC
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 986CEC
  // [HelpURLAttribute] Offset: 986CEC
  class CinemachineStateDrivenCamera : public ::Cinemachine::CinemachineVirtualCameraBase {
    public:
    // Writing base type padding for base size: 0x64 to desired offset: 0x68
    char ___base_padding[0x4] = {};
    // Nested type: ::Cinemachine::CinemachineStateDrivenCamera::Instruction
    struct Instruction;
    // Nested type: ::Cinemachine::CinemachineStateDrivenCamera::ParentHash
    struct ParentHash;
    // Nested type: ::Cinemachine::CinemachineStateDrivenCamera::HashPair
    struct HashPair;
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.CinemachineStateDrivenCamera/Cinemachine.Instruction
    // [TokenAttribute] Offset: FFFFFFFF
    struct Instruction/*, public ::System::ValueType*/ {
      public:
      public:
      // [TooltipAttribute] Offset: 0x98D968
      // public System.Int32 m_FullHash
      // Size: 0x4
      // Offset: 0x0
      int m_FullHash;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: m_FullHash and: m_VirtualCamera
      char __padding0[0x4] = {};
      // [TooltipAttribute] Offset: 0x98D9A0
      // public Cinemachine.CinemachineVirtualCameraBase m_VirtualCamera
      // Size: 0x8
      // Offset: 0x8
      ::Cinemachine::CinemachineVirtualCameraBase* m_VirtualCamera;
      // Field size check
      static_assert(sizeof(::Cinemachine::CinemachineVirtualCameraBase*) == 0x8);
      // [TooltipAttribute] Offset: 0x98D9D8
      // public System.Single m_ActivateAfter
      // Size: 0x4
      // Offset: 0x10
      float m_ActivateAfter;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // [TooltipAttribute] Offset: 0x98DA10
      // public System.Single m_MinDuration
      // Size: 0x4
      // Offset: 0x14
      float m_MinDuration;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: Instruction
      constexpr Instruction(int m_FullHash_ = {}, ::Cinemachine::CinemachineVirtualCameraBase* m_VirtualCamera_ = {}, float m_ActivateAfter_ = {}, float m_MinDuration_ = {}) noexcept : m_FullHash{m_FullHash_}, m_VirtualCamera{m_VirtualCamera_}, m_ActivateAfter{m_ActivateAfter_}, m_MinDuration{m_MinDuration_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 m_FullHash
      [[deprecated("Use field access instead!")]] int& dyn_m_FullHash();
      // Get instance field reference: public Cinemachine.CinemachineVirtualCameraBase m_VirtualCamera
      [[deprecated("Use field access instead!")]] ::Cinemachine::CinemachineVirtualCameraBase*& dyn_m_VirtualCamera();
      // Get instance field reference: public System.Single m_ActivateAfter
      [[deprecated("Use field access instead!")]] float& dyn_m_ActivateAfter();
      // Get instance field reference: public System.Single m_MinDuration
      [[deprecated("Use field access instead!")]] float& dyn_m_MinDuration();
    }; // Cinemachine.CinemachineStateDrivenCamera/Cinemachine.Instruction
    #pragma pack(pop)
    static check_size<sizeof(CinemachineStateDrivenCamera::Instruction), 20 + sizeof(float)> __Cinemachine_CinemachineStateDrivenCamera_InstructionSizeCheck;
    static_assert(sizeof(CinemachineStateDrivenCamera::Instruction) == 0x18);
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.CinemachineStateDrivenCamera/Cinemachine.ParentHash
    // [TokenAttribute] Offset: FFFFFFFF
    // [DocumentationSortingAttribute] Offset: 9879B4
    struct ParentHash/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 m_Hash
      // Size: 0x4
      // Offset: 0x0
      int m_Hash;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 m_ParentHash
      // Size: 0x4
      // Offset: 0x4
      int m_ParentHash;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ParentHash
      constexpr ParentHash(int m_Hash_ = {}, int m_ParentHash_ = {}) noexcept : m_Hash{m_Hash_}, m_ParentHash{m_ParentHash_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 m_Hash
      [[deprecated("Use field access instead!")]] int& dyn_m_Hash();
      // Get instance field reference: public System.Int32 m_ParentHash
      [[deprecated("Use field access instead!")]] int& dyn_m_ParentHash();
      // public System.Void .ctor(System.Int32 h, System.Int32 p)
      // Offset: 0xA5D538
      // ABORTED: conflicts with another method.  ParentHash(int h, int p);
    }; // Cinemachine.CinemachineStateDrivenCamera/Cinemachine.ParentHash
    #pragma pack(pop)
    static check_size<sizeof(CinemachineStateDrivenCamera::ParentHash), 4 + sizeof(int)> __Cinemachine_CinemachineStateDrivenCamera_ParentHashSizeCheck;
    static_assert(sizeof(CinemachineStateDrivenCamera::ParentHash) == 0x8);
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.CinemachineStateDrivenCamera/Cinemachine.HashPair
    // [TokenAttribute] Offset: FFFFFFFF
    struct HashPair/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 parentHash
      // Size: 0x4
      // Offset: 0x0
      int parentHash;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 hash
      // Size: 0x4
      // Offset: 0x4
      int hash;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: HashPair
      constexpr HashPair(int parentHash_ = {}, int hash_ = {}) noexcept : parentHash{parentHash_}, hash{hash_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 parentHash
      [[deprecated("Use field access instead!")]] int& dyn_parentHash();
      // Get instance field reference: public System.Int32 hash
      [[deprecated("Use field access instead!")]] int& dyn_hash();
    }; // Cinemachine.CinemachineStateDrivenCamera/Cinemachine.HashPair
    #pragma pack(pop)
    static check_size<sizeof(CinemachineStateDrivenCamera::HashPair), 4 + sizeof(int)> __Cinemachine_CinemachineStateDrivenCamera_HashPairSizeCheck;
    static_assert(sizeof(CinemachineStateDrivenCamera::HashPair) == 0x8);
    public:
    // [TooltipAttribute] Offset: 0x98980C
    // [NoSaveDuringPlayAttribute] Offset: 0x98980C
    // [VcamTargetPropertyAttribute] Offset: 0x98980C
    // public UnityEngine.Transform m_LookAt
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* m_LookAt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x989868
    // [NoSaveDuringPlayAttribute] Offset: 0x989868
    // [VcamTargetPropertyAttribute] Offset: 0x989868
    // public UnityEngine.Transform m_Follow
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* m_Follow;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [SpaceAttribute] Offset: 0x9898C4
    // [TooltipAttribute] Offset: 0x9898C4
    // [NoSaveDuringPlayAttribute] Offset: 0x9898C4
    // public UnityEngine.Animator m_AnimatedTarget
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Animator* m_AnimatedTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // [TooltipAttribute] Offset: 0x989920
    // [NoSaveDuringPlayAttribute] Offset: 0x989920
    // public System.Int32 m_LayerIndex
    // Size: 0x4
    // Offset: 0x80
    int m_LayerIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0x98996C
    // public System.Boolean m_ShowDebugText
    // Size: 0x1
    // Offset: 0x84
    bool m_ShowDebugText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ShowDebugText and: m_ChildCameras
    char __padding4[0x3] = {};
    // [NoSaveDuringPlayAttribute] Offset: 0x9899A4
    // Cinemachine.CinemachineVirtualCameraBase[] m_ChildCameras
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::Cinemachine::CinemachineVirtualCameraBase*> m_ChildCameras;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineVirtualCameraBase*>) == 0x8);
    // [TooltipAttribute] Offset: 0x9899EC
    // public Cinemachine.CinemachineStateDrivenCamera/Cinemachine.Instruction[] m_Instructions
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::Cinemachine::CinemachineStateDrivenCamera::Instruction> m_Instructions;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineStateDrivenCamera::Instruction>) == 0x8);
    // [CinemachineBlendDefinitionPropertyAttribute] Offset: 0x989A24
    // [TooltipAttribute] Offset: 0x989A24
    // public Cinemachine.CinemachineBlendDefinition m_DefaultBlend
    // Size: 0x10
    // Offset: 0x98
    ::Cinemachine::CinemachineBlendDefinition m_DefaultBlend;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlendDefinition) == 0x10);
    // [TooltipAttribute] Offset: 0x989A70
    // public Cinemachine.CinemachineBlenderSettings m_CustomBlends
    // Size: 0x8
    // Offset: 0xA8
    ::Cinemachine::CinemachineBlenderSettings* m_CustomBlends;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlenderSettings*) == 0x8);
    // Cinemachine.CinemachineStateDrivenCamera/Cinemachine.ParentHash[] m_ParentHash
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<::Cinemachine::CinemachineStateDrivenCamera::ParentHash> m_ParentHash;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineStateDrivenCamera::ParentHash>) == 0x8);
    // private Cinemachine.ICinemachineCamera <LiveChild>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::Cinemachine::ICinemachineCamera* LiveChild;
    // Field size check
    static_assert(sizeof(::Cinemachine::ICinemachineCamera*) == 0x8);
    // private Cinemachine.ICinemachineCamera <TransitioningFrom>k__BackingField
    // Size: 0x8
    // Offset: 0xC0
    ::Cinemachine::ICinemachineCamera* TransitioningFrom;
    // Field size check
    static_assert(sizeof(::Cinemachine::ICinemachineCamera*) == 0x8);
    // private Cinemachine.CameraState m_State
    // Size: 0xE4
    // Offset: 0xC8
    ::Cinemachine::CameraState m_State;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState) == 0xE4);
    // Padding between fields: m_State and: mHashCache
    char __padding12[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<UnityEngine.AnimationClip,System.Collections.Generic.List`1<Cinemachine.CinemachineStateDrivenCamera/Cinemachine.HashPair>> mHashCache
    // Size: 0x8
    // Offset: 0x1B0
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::AnimationClip*, ::System::Collections::Generic::List_1<::Cinemachine::CinemachineStateDrivenCamera::HashPair>*>* mHashCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::AnimationClip*, ::System::Collections::Generic::List_1<::Cinemachine::CinemachineStateDrivenCamera::HashPair>*>*) == 0x8);
    // private System.Single mActivationTime
    // Size: 0x4
    // Offset: 0x1B8
    float mActivationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: mActivationTime and: mActiveInstruction
    char __padding14[0x4] = {};
    // private Cinemachine.CinemachineStateDrivenCamera/Cinemachine.Instruction mActiveInstruction
    // Size: 0x18
    // Offset: 0x1C0
    ::Cinemachine::CinemachineStateDrivenCamera::Instruction mActiveInstruction;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineStateDrivenCamera::Instruction) == 0x18);
    // private System.Single mPendingActivationTime
    // Size: 0x4
    // Offset: 0x1D8
    float mPendingActivationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: mPendingActivationTime and: mPendingInstruction
    char __padding16[0x4] = {};
    // private Cinemachine.CinemachineStateDrivenCamera/Cinemachine.Instruction mPendingInstruction
    // Size: 0x18
    // Offset: 0x1E0
    ::Cinemachine::CinemachineStateDrivenCamera::Instruction mPendingInstruction;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineStateDrivenCamera::Instruction) == 0x18);
    // private Cinemachine.CinemachineBlend mActiveBlend
    // Size: 0x8
    // Offset: 0x1F8
    ::Cinemachine::CinemachineBlend* mActiveBlend;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlend*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> mInstructionDictionary
    // Size: 0x8
    // Offset: 0x200
    ::System::Collections::Generic::Dictionary_2<int, int>* mInstructionDictionary;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> mStateParentLookup
    // Size: 0x8
    // Offset: 0x208
    ::System::Collections::Generic::Dictionary_2<int, int>* mStateParentLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.AnimatorClipInfo> m_clipInfoList
    // Size: 0x8
    // Offset: 0x210
    ::System::Collections::Generic::List_1<::UnityEngine::AnimatorClipInfo>* m_clipInfoList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::AnimatorClipInfo>*) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.Transform m_LookAt
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_LookAt();
    // Get instance field reference: public UnityEngine.Transform m_Follow
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_Follow();
    // Get instance field reference: public UnityEngine.Animator m_AnimatedTarget
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animator*& dyn_m_AnimatedTarget();
    // Get instance field reference: public System.Int32 m_LayerIndex
    [[deprecated("Use field access instead!")]] int& dyn_m_LayerIndex();
    // Get instance field reference: public System.Boolean m_ShowDebugText
