// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Cinemachine.ICinemachineCamera
#include "Cinemachine/ICinemachineCamera.hpp"
// Including type: Cinemachine.CinemachineCore/Cinemachine.Stage
#include "Cinemachine/CinemachineCore_Stage.hpp"
// Including type: Cinemachine.AxisState
#include "Cinemachine/AxisState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineExtension
  class CinemachineExtension;
  // Forward declaring type: CameraState
  struct CameraState;
  // Forward declaring type: CinemachineBlend
  class CinemachineBlend;
  // Forward declaring type: CinemachineBlendDefinition
  struct CinemachineBlendDefinition;
  // Forward declaring type: LensSettings
  struct LensSettings;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineVirtualCameraBase
  class CinemachineVirtualCameraBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineVirtualCameraBase);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineVirtualCameraBase*, "Cinemachine", "CinemachineVirtualCameraBase");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x64
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineVirtualCameraBase
  // [TokenAttribute] Offset: FFFFFFFF
  // [SaveDuringPlayAttribute] Offset: FFFFFFFF
  class CinemachineVirtualCameraBase : public ::UnityEngine::MonoBehaviour/*, public ::Cinemachine::ICinemachineCamera*/ {
    public:
    // Nested type: ::Cinemachine::CinemachineVirtualCameraBase::StandbyUpdateMode
    struct StandbyUpdateMode;
    // Nested type: ::Cinemachine::CinemachineVirtualCameraBase::BlendHint
    struct BlendHint;
    // Nested type: ::Cinemachine::CinemachineVirtualCameraBase::TransitionParams
    struct TransitionParams;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct StandbyUpdateMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StandbyUpdateMode
      constexpr StandbyUpdateMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode Never
      static constexpr const int Never = 0;
      // Get static field: static public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode Never
      static ::Cinemachine::CinemachineVirtualCameraBase::StandbyUpdateMode _get_Never();
      // Set static field: static public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode Never
      static void _set_Never(::Cinemachine::CinemachineVirtualCameraBase::StandbyUpdateMode value);
      // static field const value: static public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode Always
      static constexpr const int Always = 1;
      // Get static field: static public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode Always
      static ::Cinemachine::CinemachineVirtualCameraBase::StandbyUpdateMode _get_Always();
      // Set static field: static public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode Always
      static void _set_Always(::Cinemachine::CinemachineVirtualCameraBase::StandbyUpdateMode value);
      // static field const value: static public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode RoundRobin
      static constexpr const int RoundRobin = 2;
      // Get static field: static public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode RoundRobin
      static ::Cinemachine::CinemachineVirtualCameraBase::StandbyUpdateMode _get_RoundRobin();
      // Set static field: static public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode RoundRobin
      static void _set_RoundRobin(::Cinemachine::CinemachineVirtualCameraBase::StandbyUpdateMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode
    #pragma pack(pop)
    static check_size<sizeof(CinemachineVirtualCameraBase::StandbyUpdateMode), 0 + sizeof(int)> __Cinemachine_CinemachineVirtualCameraBase_StandbyUpdateModeSizeCheck;
    static_assert(sizeof(CinemachineVirtualCameraBase::StandbyUpdateMode) == 0x4);
    public:
    // [NoSaveDuringPlayAttribute] Offset: 0x98C830
    // public System.String[] m_ExcludedPropertiesInInspector
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::StringW> m_ExcludedPropertiesInInspector;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [NoSaveDuringPlayAttribute] Offset: 0x98C878
    // public Cinemachine.CinemachineCore/Cinemachine.Stage[] m_LockStageInInspector
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::Cinemachine::CinemachineCore::Stage> m_LockStageInInspector;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineCore::Stage>) == 0x8);
    // private System.Int32 m_ValidatingStreamVersion
    // Size: 0x4
    // Offset: 0x28
    int m_ValidatingStreamVersion;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_OnValidateCalled
    // Size: 0x1
    // Offset: 0x2C
    bool m_OnValidateCalled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_OnValidateCalled and: m_StreamingVersion
    char __padding3[0x3] = {};
    // [NoSaveDuringPlayAttribute] Offset: 0x98C8C0
    // private System.Int32 m_StreamingVersion
    // Size: 0x4
    // Offset: 0x30
    int m_StreamingVersion;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [NoSaveDuringPlayAttribute] Offset: 0x98C908
    // [TooltipAttribute] Offset: 0x98C908
    // public System.Int32 m_Priority
    // Size: 0x4
    // Offset: 0x34
    int m_Priority;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <FollowTargetAttachment>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    float FollowTargetAttachment;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <LookAtTargetAttachment>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    float LookAtTargetAttachment;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98C974
    // public Cinemachine.CinemachineVirtualCameraBase/Cinemachine.StandbyUpdateMode m_StandbyUpdate
    // Size: 0x4
    // Offset: 0x40
    ::Cinemachine::CinemachineVirtualCameraBase::StandbyUpdateMode m_StandbyUpdate;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineVirtualCameraBase::StandbyUpdateMode) == 0x4);
    // Padding between fields: m_StandbyUpdate and: mExtensions
    char __padding8[0x4] = {};
    // private System.Collections.Generic.List`1<Cinemachine.CinemachineExtension> mExtensions
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::Cinemachine::CinemachineExtension*>* mExtensions;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::CinemachineExtension*>*) == 0x8);
    // private System.Boolean <PreviousStateIsValid>k__BackingField
    // Size: 0x1
    // Offset: 0x50
    bool PreviousStateIsValid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_WasStarted
    // Size: 0x1
    // Offset: 0x51
    bool m_WasStarted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean mSlaveStatusUpdated
    // Size: 0x1
    // Offset: 0x52
    bool mSlaveStatusUpdated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: mSlaveStatusUpdated and: m_parentVcam
    char __padding12[0x5] = {};
    // private Cinemachine.CinemachineVirtualCameraBase m_parentVcam
    // Size: 0x8
    // Offset: 0x58
    ::Cinemachine::CinemachineVirtualCameraBase* m_parentVcam;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineVirtualCameraBase*) == 0x8);
    // private System.Int32 m_QueuePriority
    // Size: 0x4
    // Offset: 0x60
    int m_QueuePriority;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Cinemachine::ICinemachineCamera
    operator ::Cinemachine::ICinemachineCamera() noexcept {
      return *reinterpret_cast<::Cinemachine::ICinemachineCamera*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String[] m_ExcludedPropertiesInInspector
    [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_m_ExcludedPropertiesInInspector();
    // Get instance field reference: public Cinemachine.CinemachineCore/Cinemachine.Stage[] m_LockStageInInspector
    [[deprecated("Use field access instead!")]] ::ArrayW<::Cinemachine::CinemachineCore::Stage>& dyn_m_LockStageInInspector();
