// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineVirtualCameraBase
#include "Cinemachine/CinemachineVirtualCameraBase.hpp"
// Including type: Cinemachine.CameraState
#include "Cinemachine/CameraState.hpp"
// Including type: Cinemachine.CinemachineBlendDefinition
#include "Cinemachine/CinemachineBlendDefinition.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Skipping declaration: ICinemachineCamera because it is already included!
  // Forward declaring type: CinemachineBlend
  class CinemachineBlend;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineBlendListCamera
  class CinemachineBlendListCamera;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineBlendListCamera);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineBlendListCamera*, "Cinemachine", "CinemachineBlendListCamera");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x198
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineBlendListCamera
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 986440
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 986440
  // [HelpURLAttribute] Offset: 986440
  class CinemachineBlendListCamera : public ::Cinemachine::CinemachineVirtualCameraBase {
    public:
    // Writing base type padding for base size: 0x64 to desired offset: 0x68
    char ___base_padding[0x4] = {};
    // Nested type: ::Cinemachine::CinemachineBlendListCamera::Instruction
    struct Instruction;
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.CinemachineBlendListCamera/Cinemachine.Instruction
    // [TokenAttribute] Offset: FFFFFFFF
    struct Instruction/*, public ::System::ValueType*/ {
      public:
      public:
      // [TooltipAttribute] Offset: 0x98D794
      // public Cinemachine.CinemachineVirtualCameraBase m_VirtualCamera
      // Size: 0x8
      // Offset: 0x0
      ::Cinemachine::CinemachineVirtualCameraBase* m_VirtualCamera;
      // Field size check
      static_assert(sizeof(::Cinemachine::CinemachineVirtualCameraBase*) == 0x8);
      // [TooltipAttribute] Offset: 0x98D7CC
      // public System.Single m_Hold
      // Size: 0x4
      // Offset: 0x8
      float m_Hold;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // Padding between fields: m_Hold and: m_Blend
      char __padding1[0x4] = {};
      // [CinemachineBlendDefinitionPropertyAttribute] Offset: 0x98D804
      // [TooltipAttribute] Offset: 0x98D804
      // public Cinemachine.CinemachineBlendDefinition m_Blend
      // Size: 0x10
      // Offset: 0x10
      ::Cinemachine::CinemachineBlendDefinition m_Blend;
      // Field size check
      static_assert(sizeof(::Cinemachine::CinemachineBlendDefinition) == 0x10);
      public:
      // Creating value type constructor for type: Instruction
      constexpr Instruction(::Cinemachine::CinemachineVirtualCameraBase* m_VirtualCamera_ = {}, float m_Hold_ = {}, ::Cinemachine::CinemachineBlendDefinition m_Blend_ = {}) noexcept : m_VirtualCamera{m_VirtualCamera_}, m_Hold{m_Hold_}, m_Blend{m_Blend_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Cinemachine.CinemachineVirtualCameraBase m_VirtualCamera
      [[deprecated("Use field access instead!")]] ::Cinemachine::CinemachineVirtualCameraBase*& dyn_m_VirtualCamera();
      // Get instance field reference: public System.Single m_Hold
      [[deprecated("Use field access instead!")]] float& dyn_m_Hold();
      // Get instance field reference: public Cinemachine.CinemachineBlendDefinition m_Blend
      [[deprecated("Use field access instead!")]] ::Cinemachine::CinemachineBlendDefinition& dyn_m_Blend();
    }; // Cinemachine.CinemachineBlendListCamera/Cinemachine.Instruction
    #pragma pack(pop)
    static check_size<sizeof(CinemachineBlendListCamera::Instruction), 16 + sizeof(::Cinemachine::CinemachineBlendDefinition)> __Cinemachine_CinemachineBlendListCamera_InstructionSizeCheck;
    static_assert(sizeof(CinemachineBlendListCamera::Instruction) == 0x20);
    public:
    // [TooltipAttribute] Offset: 0x987FAC
    // [NoSaveDuringPlayAttribute] Offset: 0x987FAC
    // [VcamTargetPropertyAttribute] Offset: 0x987FAC
    // public UnityEngine.Transform m_LookAt
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* m_LookAt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x988008
    // [NoSaveDuringPlayAttribute] Offset: 0x988008
    // [VcamTargetPropertyAttribute] Offset: 0x988008
    // public UnityEngine.Transform m_Follow
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* m_Follow;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x988064
    // public System.Boolean m_ShowDebugText
    // Size: 0x1
    // Offset: 0x78
    bool m_ShowDebugText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x98809C
    // public System.Boolean m_Loop
    // Size: 0x1
    // Offset: 0x79
    bool m_Loop;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Loop and: m_ChildCameras
    char __padding3[0x6] = {};
    // [NoSaveDuringPlayAttribute] Offset: 0x9880D4
    // Cinemachine.CinemachineVirtualCameraBase[] m_ChildCameras
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::Cinemachine::CinemachineVirtualCameraBase*> m_ChildCameras;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineVirtualCameraBase*>) == 0x8);
    // [TooltipAttribute] Offset: 0x98811C
    // public Cinemachine.CinemachineBlendListCamera/Cinemachine.Instruction[] m_Instructions
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::Cinemachine::CinemachineBlendListCamera::Instruction> m_Instructions;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineBlendListCamera::Instruction>) == 0x8);
    // private Cinemachine.ICinemachineCamera <LiveChild>k__BackingField
    // Size: 0x8
    // Offset: 0x90
    ::Cinemachine::ICinemachineCamera* LiveChild;
    // Field size check
    static_assert(sizeof(::Cinemachine::ICinemachineCamera*) == 0x8);
    // private Cinemachine.ICinemachineCamera <TransitioningFrom>k__BackingField
    // Size: 0x8
    // Offset: 0x98
    ::Cinemachine::ICinemachineCamera* TransitioningFrom;
    // Field size check
    static_assert(sizeof(::Cinemachine::ICinemachineCamera*) == 0x8);
    // private Cinemachine.CameraState m_State
    // Size: 0xE4
    // Offset: 0xA0
    ::Cinemachine::CameraState m_State;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState) == 0xE4);
    // Padding between fields: m_State and: mActivationTime
    char __padding8[0x4] = {};
    // private System.Single mActivationTime
    // Size: 0x4
    // Offset: 0x188
    float mActivationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 mCurrentInstruction
    // Size: 0x4
    // Offset: 0x18C
    int mCurrentInstruction;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Cinemachine.CinemachineBlend mActiveBlend
    // Size: 0x8
    // Offset: 0x190
    ::Cinemachine::CinemachineBlend* mActiveBlend;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlend*) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.Transform m_LookAt
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_LookAt();
    // Get instance field reference: public UnityEngine.Transform m_Follow
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_Follow();
    // Get instance field reference: public System.Boolean m_ShowDebugText
    [[deprecated("Use field access instead!")]] bool& dyn_m_ShowDebugText();
    // Get instance field reference: public System.Boolean m_Loop
    [[deprecated("Use field access instead!")]] bool& dyn_m_Loop();
    // Get instance field reference: Cinemachine.CinemachineVirtualCameraBase[] m_ChildCameras
