// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineComponentBase
#include "Cinemachine/CinemachineComponentBase.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine::Utility
namespace Cinemachine::Utility {
  // Forward declaring type: PositionPredictor
  class PositionPredictor;
}
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CameraState
  struct CameraState;
  // Forward declaring type: LensSettings
  struct LensSettings;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineComposer
  class CinemachineComposer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineComposer);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineComposer*, "Cinemachine", "CinemachineComposer");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x128
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineComposer
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 987028
  // [AddComponentMenu] Offset: 987028
  // [SaveDuringPlayAttribute] Offset: 987028
  class CinemachineComposer : public ::Cinemachine::CinemachineComponentBase {
    public:
    // Nested type: ::Cinemachine::CinemachineComposer::FovCache
    struct FovCache;
    // Size: 0x50
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.CinemachineComposer/Cinemachine.FovCache
    // [TokenAttribute] Offset: FFFFFFFF
    struct FovCache/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Rect mFovSoftGuideRect
      // Size: 0x10
      // Offset: 0x0
      ::UnityEngine::Rect mFovSoftGuideRect;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rect) == 0x10);
      // public UnityEngine.Rect mFovHardGuideRect
      // Size: 0x10
      // Offset: 0x10
      ::UnityEngine::Rect mFovHardGuideRect;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rect) == 0x10);
      // public System.Single mFovH
      // Size: 0x4
      // Offset: 0x20
      float mFovH;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single mFov
      // Size: 0x4
      // Offset: 0x24
      float mFov;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private System.Single mOrthoSizeOverDistance
      // Size: 0x4
      // Offset: 0x28
      float mOrthoSizeOverDistance;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private System.Single mAspect
      // Size: 0x4
      // Offset: 0x2C
      float mAspect;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private UnityEngine.Rect mSoftGuideRect
      // Size: 0x10
      // Offset: 0x30
      ::UnityEngine::Rect mSoftGuideRect;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rect) == 0x10);
      // private UnityEngine.Rect mHardGuideRect
      // Size: 0x10
      // Offset: 0x40
      ::UnityEngine::Rect mHardGuideRect;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rect) == 0x10);
      public:
      // Creating value type constructor for type: FovCache
      constexpr FovCache(::UnityEngine::Rect mFovSoftGuideRect_ = {}, ::UnityEngine::Rect mFovHardGuideRect_ = {}, float mFovH_ = {}, float mFov_ = {}, float mOrthoSizeOverDistance_ = {}, float mAspect_ = {}, ::UnityEngine::Rect mSoftGuideRect_ = {}, ::UnityEngine::Rect mHardGuideRect_ = {}) noexcept : mFovSoftGuideRect{mFovSoftGuideRect_}, mFovHardGuideRect{mFovHardGuideRect_}, mFovH{mFovH_}, mFov{mFov_}, mOrthoSizeOverDistance{mOrthoSizeOverDistance_}, mAspect{mAspect_}, mSoftGuideRect{mSoftGuideRect_}, mHardGuideRect{mHardGuideRect_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Rect mFovSoftGuideRect
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rect& dyn_mFovSoftGuideRect();
      // Get instance field reference: public UnityEngine.Rect mFovHardGuideRect
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rect& dyn_mFovHardGuideRect();
      // Get instance field reference: public System.Single mFovH
      [[deprecated("Use field access instead!")]] float& dyn_mFovH();
      // Get instance field reference: public System.Single mFov
      [[deprecated("Use field access instead!")]] float& dyn_mFov();
      // Get instance field reference: private System.Single mOrthoSizeOverDistance
      [[deprecated("Use field access instead!")]] float& dyn_mOrthoSizeOverDistance();
      // Get instance field reference: private System.Single mAspect
      [[deprecated("Use field access instead!")]] float& dyn_mAspect();
      // Get instance field reference: private UnityEngine.Rect mSoftGuideRect
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rect& dyn_mSoftGuideRect();
      // Get instance field reference: private UnityEngine.Rect mHardGuideRect
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rect& dyn_mHardGuideRect();
      // public System.Void UpdateCache(Cinemachine.LensSettings lens, UnityEngine.Rect softGuide, UnityEngine.Rect hardGuide, System.Single targetDistance)
      // Offset: 0xA5D080
      void UpdateCache(::Cinemachine::LensSettings lens, ::UnityEngine::Rect softGuide, ::UnityEngine::Rect hardGuide, float targetDistance);
      // private UnityEngine.Rect ScreenToFOV(UnityEngine.Rect rScreen, System.Single fov, System.Single fovH, System.Single aspect)
      // Offset: 0xA5D0BC
      ::UnityEngine::Rect ScreenToFOV(::UnityEngine::Rect rScreen, float fov, float fovH, float aspect);
    }; // Cinemachine.CinemachineComposer/Cinemachine.FovCache
    #pragma pack(pop)
    static check_size<sizeof(CinemachineComposer::FovCache), 64 + sizeof(::UnityEngine::Rect)> __Cinemachine_CinemachineComposer_FovCacheSizeCheck;
    static_assert(sizeof(CinemachineComposer::FovCache) == 0x50);
    public:
    // [TooltipAttribute] Offset: 0x98A414
    // public UnityEngine.Vector3 m_TrackedObjectOffset
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 m_TrackedObjectOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [SpaceAttribute] Offset: 0x98A44C
    // [TooltipAttribute] Offset: 0x98A44C
    // [RangeAttribute] Offset: 0x98A44C
    // public System.Single m_LookaheadTime
    // Size: 0x4
    // Offset: 0x5C
    float m_LookaheadTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98A4B0
    // [RangeAttribute] Offset: 0x98A4B0
    // public System.Single m_LookaheadSmoothing
    // Size: 0x4
    // Offset: 0x60
    float m_LookaheadSmoothing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98A504
    // public System.Boolean m_LookaheadIgnoreY
    // Size: 0x1
    // Offset: 0x64
    bool m_LookaheadIgnoreY;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_LookaheadIgnoreY and: m_HorizontalDamping
    char __padding3[0x3] = {};
    // [SpaceAttribute] Offset: 0x98A53C
    // [RangeAttribute] Offset: 0x98A53C
    // [TooltipAttribute] Offset: 0x98A53C
    // public System.Single m_HorizontalDamping
    // Size: 0x4
    // Offset: 0x68
    float m_HorizontalDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98A5A0
    // [TooltipAttribute] Offset: 0x98A5A0
    // public System.Single m_VerticalDamping
    // Size: 0x4
    // Offset: 0x6C
    float m_VerticalDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [SpaceAttribute] Offset: 0x98A5F4
    // [RangeAttribute] Offset: 0x98A5F4
    // [TooltipAttribute] Offset: 0x98A5F4
    // public System.Single m_ScreenX
    // Size: 0x4
    // Offset: 0x70
    float m_ScreenX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98A658
    // [TooltipAttribute] Offset: 0x98A658
    // public System.Single m_ScreenY
    // Size: 0x4
    // Offset: 0x74
    float m_ScreenY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98A6AC
    // [TooltipAttribute] Offset: 0x98A6AC
    // public System.Single m_DeadZoneWidth
    // Size: 0x4
    // Offset: 0x78
    float m_DeadZoneWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98A700
    // [TooltipAttribute] Offset: 0x98A700
    // public System.Single m_DeadZoneHeight
    // Size: 0x4
    // Offset: 0x7C
    float m_DeadZoneHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98A754
    // [TooltipAttribute] Offset: 0x98A754
    // public System.Single m_SoftZoneWidth
    // Size: 0x4
    // Offset: 0x80
    float m_SoftZoneWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98A7A8
    // [TooltipAttribute] Offset: 0x98A7A8
    // public System.Single m_SoftZoneHeight
    // Size: 0x4
    // Offset: 0x84
    float m_SoftZoneHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98A7FC
    // [TooltipAttribute] Offset: 0x98A7FC
    // public System.Single m_BiasX
    // Size: 0x4
    // Offset: 0x88
    float m_BiasX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x98A850
    // [TooltipAttribute] Offset: 0x98A850
    // public System.Single m_BiasY
    // Size: 0x4
    // Offset: 0x8C
    float m_BiasY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x98A8A4
    // public System.Boolean m_CenterOnActivate
    // Size: 0x1
    // Offset: 0x90
    bool m_CenterOnActivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CenterOnActivate and: TrackedPoint
    char __padding14[0x3] = {};
    // private UnityEngine.Vector3 <TrackedPoint>k__BackingField
    // Size: 0xC
    // Offset: 0x94
    ::UnityEngine::Vector3 TrackedPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_CameraPosPrevFrame
    // Size: 0xC
    // Offset: 0xA0
    ::UnityEngine::Vector3 m_CameraPosPrevFrame;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_LookAtPrevFrame
    // Size: 0xC
    // Offset: 0xAC
    ::UnityEngine::Vector3 m_LookAtPrevFrame;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector2 m_ScreenOffsetPrevFrame
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Vector2 m_ScreenOffsetPrevFrame;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Quaternion m_CameraOrientationPrevFrame
    // Size: 0x10
    // Offset: 0xC0
    ::UnityEngine::Quaternion m_CameraOrientationPrevFrame;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Cinemachine.Utility.PositionPredictor m_Predictor
    // Size: 0x8
    // Offset: 0xD0
    ::Cinemachine::Utility::PositionPredictor* m_Predictor;
    // Field size check
    static_assert(sizeof(::Cinemachine::Utility::PositionPredictor*) == 0x8);
    // private Cinemachine.CinemachineComposer/Cinemachine.FovCache mCache
    // Size: 0x50
    // Offset: 0xD8
    ::Cinemachine::CinemachineComposer::FovCache mCache;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineComposer::FovCache) == 0x50);
    public:
    // Get instance field reference: public UnityEngine.Vector3 m_TrackedObjectOffset
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_TrackedObjectOffset();
    // Get instance field reference: public System.Single m_LookaheadTime
    [[deprecated("Use field access instead!")]] float& dyn_m_LookaheadTime();
    // Get instance field reference: public System.Single m_LookaheadSmoothing
    [[deprecated("Use field access instead!")]] float& dyn_m_LookaheadSmoothing();
    // Get instance field reference: public System.Boolean m_LookaheadIgnoreY
    [[deprecated("Use field access instead!")]] bool& dyn_m_LookaheadIgnoreY();
    // Get instance field reference: public System.Single m_HorizontalDamping
