// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Cinemachine.CinemachineBlendDefinition
#include "Cinemachine/CinemachineBlendDefinition.hpp"
// Including type: Cinemachine.CameraState
#include "Cinemachine/CameraState.hpp"
// Including type: Cinemachine.CinemachineCore
#include "Cinemachine/CinemachineCore.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Camera because it is already included!
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: WaitForFixedUpdate
  class WaitForFixedUpdate;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Color
  struct Color;
}
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineBlenderSettings
  class CinemachineBlenderSettings;
  // Forward declaring type: BrainEvent
  class CinemachineBrain_BrainEvent;
  // Forward declaring type: CinemachineBlend
  class CinemachineBlend;
  // Forward declaring type: ICinemachineCamera
  class ICinemachineCamera;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::SceneManagement
namespace UnityEngine::SceneManagement {
  // Forward declaring type: Scene
  struct Scene;
  // Forward declaring type: LoadSceneMode
  struct LoadSceneMode;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineBrain
  class CinemachineBrain;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineBrain);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineBrain*, "Cinemachine", "CinemachineBrain");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x17C
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineBrain
  // [TokenAttribute] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: 9864E4
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 9864E4
  // [SaveDuringPlayAttribute] Offset: 9864E4
  // [HelpURLAttribute] Offset: 9864E4
  class CinemachineBrain : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Cinemachine::CinemachineBrain::UpdateMethod
    struct UpdateMethod;
    // Nested type: ::Cinemachine::CinemachineBrain::BrainUpdateMethod
    struct BrainUpdateMethod;
    // Nested type: ::Cinemachine::CinemachineBrain::VcamActivatedEvent
    class VcamActivatedEvent;
    // Nested type: ::Cinemachine::CinemachineBrain::BrainFrame
    class BrainFrame;
    // Nested type: ::Cinemachine::CinemachineBrain::$AfterPhysics$d__32
    class $AfterPhysics$d__32;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod
    // [TokenAttribute] Offset: FFFFFFFF
    // [DocumentationSortingAttribute] Offset: 987944
    struct UpdateMethod/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateMethod
      constexpr UpdateMethod(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod FixedUpdate
      static constexpr const int FixedUpdate = 0;
      // Get static field: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod FixedUpdate
      static ::Cinemachine::CinemachineBrain::UpdateMethod _get_FixedUpdate();
      // Set static field: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod FixedUpdate
      static void _set_FixedUpdate(::Cinemachine::CinemachineBrain::UpdateMethod value);
      // static field const value: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod LateUpdate
      static constexpr const int LateUpdate = 1;
      // Get static field: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod LateUpdate
      static ::Cinemachine::CinemachineBrain::UpdateMethod _get_LateUpdate();
      // Set static field: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod LateUpdate
      static void _set_LateUpdate(::Cinemachine::CinemachineBrain::UpdateMethod value);
      // static field const value: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod SmartUpdate
      static constexpr const int SmartUpdate = 2;
      // Get static field: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod SmartUpdate
      static ::Cinemachine::CinemachineBrain::UpdateMethod _get_SmartUpdate();
      // Set static field: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod SmartUpdate
      static void _set_SmartUpdate(::Cinemachine::CinemachineBrain::UpdateMethod value);
      // static field const value: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod ManualUpdate
      static constexpr const int ManualUpdate = 3;
      // Get static field: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod ManualUpdate
      static ::Cinemachine::CinemachineBrain::UpdateMethod _get_ManualUpdate();
      // Set static field: static public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod ManualUpdate
      static void _set_ManualUpdate(::Cinemachine::CinemachineBrain::UpdateMethod value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod
    #pragma pack(pop)
    static check_size<sizeof(CinemachineBrain::UpdateMethod), 0 + sizeof(int)> __Cinemachine_CinemachineBrain_UpdateMethodSizeCheck;
    static_assert(sizeof(CinemachineBrain::UpdateMethod) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Cinemachine.CinemachineBrain/Cinemachine.BrainUpdateMethod
    // [TokenAttribute] Offset: FFFFFFFF
    // [DocumentationSortingAttribute] Offset: 987958
    struct BrainUpdateMethod/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BrainUpdateMethod
      constexpr BrainUpdateMethod(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Cinemachine.CinemachineBrain/Cinemachine.BrainUpdateMethod FixedUpdate
      static constexpr const int FixedUpdate = 0;
      // Get static field: static public Cinemachine.CinemachineBrain/Cinemachine.BrainUpdateMethod FixedUpdate
      static ::Cinemachine::CinemachineBrain::BrainUpdateMethod _get_FixedUpdate();
      // Set static field: static public Cinemachine.CinemachineBrain/Cinemachine.BrainUpdateMethod FixedUpdate
      static void _set_FixedUpdate(::Cinemachine::CinemachineBrain::BrainUpdateMethod value);
      // static field const value: static public Cinemachine.CinemachineBrain/Cinemachine.BrainUpdateMethod LateUpdate
      static constexpr const int LateUpdate = 1;
      // Get static field: static public Cinemachine.CinemachineBrain/Cinemachine.BrainUpdateMethod LateUpdate
      static ::Cinemachine::CinemachineBrain::BrainUpdateMethod _get_LateUpdate();
      // Set static field: static public Cinemachine.CinemachineBrain/Cinemachine.BrainUpdateMethod LateUpdate
      static void _set_LateUpdate(::Cinemachine::CinemachineBrain::BrainUpdateMethod value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Cinemachine.CinemachineBrain/Cinemachine.BrainUpdateMethod
    #pragma pack(pop)
    static check_size<sizeof(CinemachineBrain::BrainUpdateMethod), 0 + sizeof(int)> __Cinemachine_CinemachineBrain_BrainUpdateMethodSizeCheck;
    static_assert(sizeof(CinemachineBrain::BrainUpdateMethod) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0x988174
    // public System.Boolean m_ShowDebugText
    // Size: 0x1
    // Offset: 0x18
    bool m_ShowDebugText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x9881AC
    // public System.Boolean m_ShowCameraFrustum
    // Size: 0x1
    // Offset: 0x19
    bool m_ShowCameraFrustum;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x9881E4
    // public System.Boolean m_IgnoreTimeScale
    // Size: 0x1
    // Offset: 0x1A
    bool m_IgnoreTimeScale;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_IgnoreTimeScale and: m_WorldUpOverride
    char __padding2[0x5] = {};
    // [TooltipAttribute] Offset: 0x98821C
    // public UnityEngine.Transform m_WorldUpOverride
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* m_WorldUpOverride;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x988254
    // public Cinemachine.CinemachineBrain/Cinemachine.UpdateMethod m_UpdateMethod
    // Size: 0x4
    // Offset: 0x28
    ::Cinemachine::CinemachineBrain::UpdateMethod m_UpdateMethod;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBrain::UpdateMethod) == 0x4);
    // [TooltipAttribute] Offset: 0x98828C
    // public Cinemachine.CinemachineBrain/Cinemachine.BrainUpdateMethod m_BlendUpdateMethod
    // Size: 0x4
    // Offset: 0x2C
    ::Cinemachine::CinemachineBrain::BrainUpdateMethod m_BlendUpdateMethod;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBrain::BrainUpdateMethod) == 0x4);
    // [CinemachineBlendDefinitionPropertyAttribute] Offset: 0x9882C4
    // [TooltipAttribute] Offset: 0x9882C4
    // public Cinemachine.CinemachineBlendDefinition m_DefaultBlend
    // Size: 0x10
    // Offset: 0x30
    ::Cinemachine::CinemachineBlendDefinition m_DefaultBlend;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlendDefinition) == 0x10);
    // [TooltipAttribute] Offset: 0x988310
    // public Cinemachine.CinemachineBlenderSettings m_CustomBlends
    // Size: 0x8
    // Offset: 0x40
    ::Cinemachine::CinemachineBlenderSettings* m_CustomBlends;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlenderSettings*) == 0x8);
    // private UnityEngine.Camera m_OutputCamera
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Camera* m_OutputCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // [TooltipAttribute] Offset: 0x988348
    // public Cinemachine.CinemachineBrain/Cinemachine.BrainEvent m_CameraCutEvent
    // Size: 0x8
    // Offset: 0x50
    ::Cinemachine::CinemachineBrain_BrainEvent* m_CameraCutEvent;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBrain_BrainEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0x988380
    // public Cinemachine.CinemachineBrain/Cinemachine.VcamActivatedEvent m_CameraActivatedEvent
    // Size: 0x8
    // Offset: 0x58
    ::Cinemachine::CinemachineBrain::VcamActivatedEvent* m_CameraActivatedEvent;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBrain::VcamActivatedEvent*) == 0x8);
    // private UnityEngine.Coroutine mPhysicsCoroutine
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Coroutine* mPhysicsCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.WaitForFixedUpdate mWaitForFixedUpdate
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::WaitForFixedUpdate* mWaitForFixedUpdate;
    // Field size check
    static_assert(sizeof(::UnityEngine::WaitForFixedUpdate*) == 0x8);
    // private System.Collections.Generic.List`1<Cinemachine.CinemachineBrain/Cinemachine.BrainFrame> mFrameStack
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::Cinemachine::CinemachineBrain::BrainFrame*>* mFrameStack;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::CinemachineBrain::BrainFrame*>*) == 0x8);
    // private System.Int32 mNextFrameId
    // Size: 0x4
    // Offset: 0x78
    int mNextFrameId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: mNextFrameId and: mCurrentLiveCameras
    char __padding14[0x4] = {};
    // private Cinemachine.CinemachineBlend mCurrentLiveCameras
    // Size: 0x8
    // Offset: 0x80
    ::Cinemachine::CinemachineBlend* mCurrentLiveCameras;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlend*) == 0x8);
    // private Cinemachine.ICinemachineCamera mActiveCameraPreviousFrame
    // Size: 0x8
    // Offset: 0x88
    ::Cinemachine::ICinemachineCamera* mActiveCameraPreviousFrame;
    // Field size check
    static_assert(sizeof(::Cinemachine::ICinemachineCamera*) == 0x8);
    // private UnityEngine.GameObject mActiveCameraPreviousFrameGameObject
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* mActiveCameraPreviousFrameGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private Cinemachine.CameraState <CurrentCameraState>k__BackingField
    // Size: 0xE4
    // Offset: 0x98
    ::Cinemachine::CameraState CurrentCameraState;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState) == 0xE4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private Cinemachine.ICinemachineCamera mSoloCamera
    static ::Cinemachine::ICinemachineCamera* _get_mSoloCamera();
    // Set static field: static private Cinemachine.ICinemachineCamera mSoloCamera
    static void _set_mSoloCamera(::Cinemachine::ICinemachineCamera* value);
    // Get static field: static private readonly UnityEngine.AnimationCurve mDefaultLinearAnimationCurve
    static ::UnityEngine::AnimationCurve* _get_mDefaultLinearAnimationCurve();
    // Set static field: static private readonly UnityEngine.AnimationCurve mDefaultLinearAnimationCurve
    static void _set_mDefaultLinearAnimationCurve(::UnityEngine::AnimationCurve* value);
