// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Skipping declaration: ShrinkablePoint2 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: ShrinkablePolygon
  class ShrinkablePolygon;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::ShrinkablePolygon);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::ShrinkablePolygon*, "Cinemachine", "ShrinkablePolygon");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.ShrinkablePolygon
  // [TokenAttribute] Offset: FFFFFFFF
  class ShrinkablePolygon : public ::Il2CppObject {
    public:
    // Nested type: ::Cinemachine::ShrinkablePolygon::ShrinkablePoint2
    struct ShrinkablePoint2;
    // Nested type: ::Cinemachine::ShrinkablePolygon::AspectData
    struct AspectData;
    // Nested type: ::Cinemachine::ShrinkablePolygon::$$c
    class $$c;
    // Size: 0x19
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.ShrinkablePolygon/Cinemachine.ShrinkablePoint2
    // [TokenAttribute] Offset: FFFFFFFF
    struct ShrinkablePoint2/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Vector2 m_Position
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Vector2 m_Position;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      // public UnityEngine.Vector2 m_OriginalPosition
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::Vector2 m_OriginalPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      // public UnityEngine.Vector2 m_ShrinkDirection
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::Vector2 m_ShrinkDirection;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      // public System.Boolean m_CantIntersect
      // Size: 0x1
      // Offset: 0x18
      bool m_CantIntersect;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: ShrinkablePoint2
      constexpr ShrinkablePoint2(::UnityEngine::Vector2 m_Position_ = {}, ::UnityEngine::Vector2 m_OriginalPosition_ = {}, ::UnityEngine::Vector2 m_ShrinkDirection_ = {}, bool m_CantIntersect_ = {}) noexcept : m_Position{m_Position_}, m_OriginalPosition{m_OriginalPosition_}, m_ShrinkDirection{m_ShrinkDirection_}, m_CantIntersect{m_CantIntersect_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get static field: static public readonly UnityEngine.Vector2 m_Vector2NaN
      static ::UnityEngine::Vector2 _get_m_Vector2NaN();
      // Set static field: static public readonly UnityEngine.Vector2 m_Vector2NaN
      static void _set_m_Vector2NaN(::UnityEngine::Vector2 value);
      // Get instance field reference: public UnityEngine.Vector2 m_Position
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_m_Position();
      // Get instance field reference: public UnityEngine.Vector2 m_OriginalPosition
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_m_OriginalPosition();
      // Get instance field reference: public UnityEngine.Vector2 m_ShrinkDirection
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_m_ShrinkDirection();
      // Get instance field reference: public System.Boolean m_CantIntersect
      [[deprecated("Use field access instead!")]] bool& dyn_m_CantIntersect();
      // static private System.Void .cctor()
      // Offset: 0x1453CA8
      static void _cctor();
    }; // Cinemachine.ShrinkablePolygon/Cinemachine.ShrinkablePoint2
    #pragma pack(pop)
    static check_size<sizeof(ShrinkablePolygon::ShrinkablePoint2), 24 + sizeof(bool)> __Cinemachine_ShrinkablePolygon_ShrinkablePoint2SizeCheck;
    static_assert(sizeof(ShrinkablePolygon::ShrinkablePoint2) == 0x19);
    public:
    // public System.Collections.Generic.List`1<Cinemachine.ShrinkablePolygon/Cinemachine.ShrinkablePoint2> m_Points
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::List_1<::Cinemachine::ShrinkablePolygon::ShrinkablePoint2>* m_Points;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::ShrinkablePolygon::ShrinkablePoint2>*) == 0x8);
    // public System.Single m_FrustumHeight
    // Size: 0x4
    // Offset: 0x18
    float m_FrustumHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 m_State
    // Size: 0x4
    // Offset: 0x1C
    int m_State;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Collections.Generic.List`1<UnityEngine.Vector2> m_IntersectionPoints
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::Vector2>* m_IntersectionPoints;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector2>*) == 0x8);
    // public System.Single m_Area
    // Size: 0x4
    // Offset: 0x28
    float m_Area;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.Vector2> s_edgeNormalsCache
    static ::System::Collections::Generic::List_1<::UnityEngine::Vector2>* _get_s_edgeNormalsCache();
    // Set static field: static private readonly System.Collections.Generic.List`1<UnityEngine.Vector2> s_edgeNormalsCache
    static void _set_s_edgeNormalsCache(::System::Collections::Generic::List_1<::UnityEngine::Vector2>* value);
    // Get static field: static private readonly System.Collections.Generic.List`1<Cinemachine.ShrinkablePolygon/Cinemachine.ShrinkablePoint2> s_extendedPointsCache
    static ::System::Collections::Generic::List_1<::Cinemachine::ShrinkablePolygon::ShrinkablePoint2>* _get_s_extendedPointsCache();
