// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Attribute
#include "System/Attribute.hpp"
// Including type: System.Runtime.InteropServices.CharSet
#include "System/Runtime/InteropServices/CharSet.hpp"
// Including type: System.Runtime.InteropServices.CallingConvention
#include "System/Runtime/InteropServices/CallingConvention.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: RuntimeMethodInfo
  class RuntimeMethodInfo;
}
// Completed forward declares
// Type namespace: System.Runtime.InteropServices
namespace System::Runtime::InteropServices {
  // Size: 0x2E
  // Autogenerated type: System.Runtime.InteropServices.DllImportAttribute
  // [] Offset: FFFFFFFF
  // [AttributeUsageAttribute] Offset: D3BC90
  // [ComVisibleAttribute] Offset: D3BC90
  class DllImportAttribute : public System::Attribute {
    public:
    // System.String _val
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* val;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String EntryPoint
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* EntryPoint;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.Runtime.InteropServices.CharSet CharSet
    // Size: 0x4
    // Offset: 0x20
    System::Runtime::InteropServices::CharSet CharSet;
    // Field size check
    static_assert(sizeof(System::Runtime::InteropServices::CharSet) == 0x4);
    // public System.Boolean SetLastError
    // Size: 0x1
    // Offset: 0x24
    bool SetLastError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean ExactSpelling
    // Size: 0x1
    // Offset: 0x25
    bool ExactSpelling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean PreserveSig
    // Size: 0x1
    // Offset: 0x26
    bool PreserveSig;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PreserveSig and: CallingConvention
    char __padding5[0x1] = {};
    // public System.Runtime.InteropServices.CallingConvention CallingConvention
    // Size: 0x4
    // Offset: 0x28
    System::Runtime::InteropServices::CallingConvention CallingConvention;
    // Field size check
    static_assert(sizeof(System::Runtime::InteropServices::CallingConvention) == 0x4);
    // public System.Boolean BestFitMapping
    // Size: 0x1
    // Offset: 0x2C
    bool BestFitMapping;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean ThrowOnUnmappableChar
    // Size: 0x1
    // Offset: 0x2D
    bool ThrowOnUnmappableChar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: DllImportAttribute
    DllImportAttribute(::Il2CppString* val_ = {}, ::Il2CppString* EntryPoint_ = {}, System::Runtime::InteropServices::CharSet CharSet_ = {}, bool SetLastError_ = {}, bool ExactSpelling_ = {}, bool PreserveSig_ = {}, System::Runtime::InteropServices::CallingConvention CallingConvention_ = {}, bool BestFitMapping_ = {}, bool ThrowOnUnmappableChar_ = {}) noexcept : val{val_}, EntryPoint{EntryPoint_}, CharSet{CharSet_}, SetLastError{SetLastError_}, ExactSpelling{ExactSpelling_}, PreserveSig{PreserveSig_}, CallingConvention{CallingConvention_}, BestFitMapping{BestFitMapping_}, ThrowOnUnmappableChar{ThrowOnUnmappableChar_} {}
    // static System.Attribute GetCustomAttribute(System.Reflection.RuntimeMethodInfo method)
    // Offset: 0x116454C
    static System::Attribute* GetCustomAttribute(System::Reflection::RuntimeMethodInfo* method);
    // static System.Boolean IsDefined(System.Reflection.RuntimeMethodInfo method)
    // Offset: 0x11647F4
    static bool IsDefined(System::Reflection::RuntimeMethodInfo* method);
    // System.Void .ctor(System.String dllName, System.String entryPoint, System.Runtime.InteropServices.CharSet charSet, System.Boolean exactSpelling, System.Boolean setLastError, System.Boolean preserveSig, System.Runtime.InteropServices.CallingConvention callingConvention, System.Boolean bestFitMapping, System.Boolean throwOnUnmappableChar)
    // Offset: 0x116473C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DllImportAttribute* New_ctor(::Il2CppString* dllName, ::Il2CppString* entryPoint, System::Runtime::InteropServices::CharSet charSet, bool exactSpelling, bool setLastError, bool preserveSig, System::Runtime::InteropServices::CallingConvention callingConvention, bool bestFitMapping, bool throwOnUnmappableChar) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Runtime::InteropServices::DllImportAttribute::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DllImportAttribute*, creationType>(dllName, entryPoint, charSet, exactSpelling, setLastError, preserveSig, callingConvention, bestFitMapping, throwOnUnmappableChar)));
    }
    // public System.Void .ctor(System.String dllName)
    // Offset: 0x1164820
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DllImportAttribute* New_ctor(::Il2CppString* dllName) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Runtime::InteropServices::DllImportAttribute::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DllImportAttribute*, creationType>(dllName)));
    }
    // public System.String get_Value()
    // Offset: 0x1164854
    ::Il2CppString* get_Value();
  }; // System.Runtime.InteropServices.DllImportAttribute
  static check_size<sizeof(DllImportAttribute), 45 + sizeof(bool)> __System_Runtime_InteropServices_DllImportAttributeSizeCheck;
  static_assert(sizeof(DllImportAttribute) == 0x2E);
}
DEFINE_IL2CPP_ARG_TYPE(System::Runtime::InteropServices::DllImportAttribute*, "System.Runtime.InteropServices", "DllImportAttribute");
#pragma pack(pop)
