// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: LeaderboardsDTO
namespace LeaderboardsDTO {
  // Forward declaring type: GameplayModifiersDTO
  struct GameplayModifiersDTO;
}
// Completed forward declares
// Type namespace: LeaderboardsDTO
namespace LeaderboardsDTO {
  // Autogenerated type: LeaderboardsDTO.LevelScoreResultDTO
  class LevelScoreResultDTO : public ::Il2CppObject {
    public:
    // public System.String guid
    // Offset: 0x10
    ::Il2CppString* guid;
    // public System.String guids
    // Offset: 0x18
    ::Il2CppString* guids;
    // public System.String guidInstance
    // Offset: 0x20
    ::Il2CppString* guidInstance;
    // public System.Int32 rawScore
    // Offset: 0x28
    int rawScore;
    // public System.Int32 modifiedScore
    // Offset: 0x2C
    int modifiedScore;
    // public System.Boolean fullCombo
    // Offset: 0x30
    bool fullCombo;
    // public System.Int32 goodCutsCount
    // Offset: 0x34
    int goodCutsCount;
    // public System.Int32 badCutsCount
    // Offset: 0x38
    int badCutsCount;
    // public System.Int32 missedCount
    // Offset: 0x3C
    int missedCount;
    // public System.Int32 maxCombo
    // Offset: 0x40
    int maxCombo;
    // public LeaderboardsDTO.GameplayModifiersDTO[] gameplayModifiers
    // Offset: 0x48
    ::Array<LeaderboardsDTO::GameplayModifiersDTO>* gameplayModifiers;
    // public System.String leaderboardId
    // Offset: 0x50
    ::Il2CppString* leaderboardId;
    // public System.String deviceModel
    // Offset: 0x58
    ::Il2CppString* deviceModel;
    // public System.String extraDataBase64
    // Offset: 0x60
    ::Il2CppString* extraDataBase64;
    // public System.Void .ctor()
    // Offset: 0xB43630
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static LevelScoreResultDTO* New_ctor();
  }; // LeaderboardsDTO.LevelScoreResultDTO
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(LeaderboardsDTO::LevelScoreResultDTO*, "LeaderboardsDTO", "LevelScoreResultDTO");
#pragma pack(pop)
