// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: LeaderboardsDTO
namespace LeaderboardsDTO {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: LeaderboardsDTO.LoginRequestDTO
  // [TokenAttribute] Offset: FFFFFFFF
  class LoginRequestDTO : public ::Il2CppObject {
    public:
    // public System.String platform
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* platform;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String platformUserId
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* platformUserId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String platformAuthToken
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* platformAuthToken;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String platformEnviroment
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* platformEnviroment;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String publicUserDisplayName
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppString* publicUserDisplayName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String buildVersion
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* buildVersion;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: LoginRequestDTO
    LoginRequestDTO(::Il2CppString* platform_ = {}, ::Il2CppString* platformUserId_ = {}, ::Il2CppString* platformAuthToken_ = {}, ::Il2CppString* platformEnviroment_ = {}, ::Il2CppString* publicUserDisplayName_ = {}, ::Il2CppString* buildVersion_ = {}) noexcept : platform{platform_}, platformUserId{platformUserId_}, platformAuthToken{platformAuthToken_}, platformEnviroment{platformEnviroment_}, publicUserDisplayName{publicUserDisplayName_}, buildVersion{buildVersion_} {}
    // Get instance field reference: public System.String platform
    ::Il2CppString*& dyn_platform();
    // Get instance field reference: public System.String platformUserId
    ::Il2CppString*& dyn_platformUserId();
    // Get instance field reference: public System.String platformAuthToken
    ::Il2CppString*& dyn_platformAuthToken();
    // Get instance field reference: public System.String platformEnviroment
    ::Il2CppString*& dyn_platformEnviroment();
    // Get instance field reference: public System.String publicUserDisplayName
    ::Il2CppString*& dyn_publicUserDisplayName();
    // Get instance field reference: public System.String buildVersion
    ::Il2CppString*& dyn_buildVersion();
    // public System.Void .ctor()
    // Offset: 0x11A3AC0
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LoginRequestDTO* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("LeaderboardsDTO::LoginRequestDTO::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LoginRequestDTO*, creationType>()));
    }
  }; // LeaderboardsDTO.LoginRequestDTO
  #pragma pack(pop)
  static check_size<sizeof(LoginRequestDTO), 56 + sizeof(::Il2CppString*)> __LeaderboardsDTO_LoginRequestDTOSizeCheck;
  static_assert(sizeof(LoginRequestDTO) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(LeaderboardsDTO::LoginRequestDTO*, "LeaderboardsDTO", "LoginRequestDTO");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: LeaderboardsDTO::LoginRequestDTO::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
