// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 1)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Net.RequestStream
#include "System/Net/RequestStream.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: MonoChunkStream
  class MonoChunkStream;
  // Forward declaring type: HttpListenerContext
  class HttpListenerContext;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Skipping declaration: Stream because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x69
  // Autogenerated type: System.Net.ChunkedInputStream
  // [] Offset: FFFFFFFF
  class ChunkedInputStream : public System::Net::RequestStream {
    public:
    // Nested type: System::Net::ChunkedInputStream::ReadBufferState
    class ReadBufferState;
    // private System.Boolean disposed
    // Size: 0x1
    // Offset: 0x50
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disposed and: decoder
    char __padding0[0x7] = {};
    // private System.Net.MonoChunkStream decoder
    // Size: 0x8
    // Offset: 0x58
    System::Net::MonoChunkStream* decoder;
    // Field size check
    static_assert(sizeof(System::Net::MonoChunkStream*) == 0x8);
    // private System.Net.HttpListenerContext context
    // Size: 0x8
    // Offset: 0x60
    System::Net::HttpListenerContext* context;
    // Field size check
    static_assert(sizeof(System::Net::HttpListenerContext*) == 0x8);
    // private System.Boolean no_more_data
    // Size: 0x1
    // Offset: 0x68
    bool no_more_data;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: ChunkedInputStream
    ChunkedInputStream(bool disposed_ = {}, System::Net::MonoChunkStream* decoder_ = {}, System::Net::HttpListenerContext* context_ = {}, bool no_more_data_ = {}) noexcept : disposed{disposed_}, decoder{decoder_}, context{context_}, no_more_data{no_more_data_} {}
    // public System.Void .ctor(System.Net.HttpListenerContext context, System.IO.Stream stream, System.Byte[] buffer, System.Int32 offset, System.Int32 length)
    // Offset: 0x130BCF8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ChunkedInputStream* New_ctor(System::Net::HttpListenerContext* context, System::IO::Stream* stream, ::Array<uint8_t>* buffer, int offset, int length) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Net::ChunkedInputStream::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ChunkedInputStream*, creationType>(context, stream, buffer, offset, length)));
    }
    // private System.Void OnRead(System.IAsyncResult base_ares)
    // Offset: 0x130C1A8
    void OnRead(System::IAsyncResult* base_ares);
    // public override System.Int32 Read(in System.Byte[] buffer, System.Int32 offset, System.Int32 count)
    // Offset: 0x130BE10
    // Implemented from: System.Net.RequestStream
    // Base method: System.Int32 RequestStream::Read(in System.Byte[] buffer, System.Int32 offset, System.Int32 count)
    int Read(::Array<uint8_t>*& buffer, int offset, int count);
    // public override System.IAsyncResult BeginRead(System.Byte[] buffer, System.Int32 offset, System.Int32 count, System.AsyncCallback cback, System.Object state)
    // Offset: 0x130BE58
    // Implemented from: System.Net.RequestStream
    // Base method: System.IAsyncResult RequestStream::BeginRead(System.Byte[] buffer, System.Int32 offset, System.Int32 count, System.AsyncCallback cback, System.Object state)
    System::IAsyncResult* BeginRead(::Array<uint8_t>* buffer, int offset, int count, System::AsyncCallback* cback, ::Il2CppObject* state);
    // public override System.Int32 EndRead(System.IAsyncResult ares)
    // Offset: 0x130C53C
    // Implemented from: System.Net.RequestStream
    // Base method: System.Int32 RequestStream::EndRead(System.IAsyncResult ares)
    int EndRead(System::IAsyncResult* ares);
    // public override System.Void Close()
    // Offset: 0x130C7CC
    // Implemented from: System.Net.RequestStream
    // Base method: System.Void RequestStream::Close()
    void Close();
  }; // System.Net.ChunkedInputStream
  static check_size<sizeof(ChunkedInputStream), 104 + sizeof(bool)> __System_Net_ChunkedInputStreamSizeCheck;
  static_assert(sizeof(ChunkedInputStream) == 0x69);
}
DEFINE_IL2CPP_ARG_TYPE(System::Net::ChunkedInputStream*, "System.Net", "ChunkedInputStream");
#pragma pack(pop)
