// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.ConnectionPool
#include "System/Net/ConnectionPool.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: GeneralAsyncDelegate
  class GeneralAsyncDelegate;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::ConnectionPool::AsyncConnectionPoolRequest);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::ConnectionPool::AsyncConnectionPoolRequest*, "System.Net", "ConnectionPool/AsyncConnectionPoolRequest");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.ConnectionPool/System.Net.AsyncConnectionPoolRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class ConnectionPool::AsyncConnectionPoolRequest : public ::Il2CppObject {
    public:
    public:
    // public System.Object OwningObject
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppObject* OwningObject;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public System.Net.GeneralAsyncDelegate AsyncCallback
    // Size: 0x8
    // Offset: 0x18
    ::System::Net::GeneralAsyncDelegate* AsyncCallback;
    // Field size check
    static_assert(sizeof(::System::Net::GeneralAsyncDelegate*) == 0x8);
    // public System.Net.ConnectionPool Pool
    // Size: 0x8
    // Offset: 0x20
    ::System::Net::ConnectionPool* Pool;
    // Field size check
    static_assert(sizeof(::System::Net::ConnectionPool*) == 0x8);
    // public System.Int32 CreationTimeout
    // Size: 0x4
    // Offset: 0x28
    int CreationTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public System.Object OwningObject
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_OwningObject();
    // Get instance field reference: public System.Net.GeneralAsyncDelegate AsyncCallback
    [[deprecated("Use field access instead!")]] ::System::Net::GeneralAsyncDelegate*& dyn_AsyncCallback();
    // Get instance field reference: public System.Net.ConnectionPool Pool
    [[deprecated("Use field access instead!")]] ::System::Net::ConnectionPool*& dyn_Pool();
    // Get instance field reference: public System.Int32 CreationTimeout
    [[deprecated("Use field access instead!")]] int& dyn_CreationTimeout();
    // public System.Void .ctor(System.Net.ConnectionPool pool, System.Object owningObject, System.Net.GeneralAsyncDelegate asyncCallback, System.Int32 creationTimeout)
    // Offset: 0x1302E68
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ConnectionPool::AsyncConnectionPoolRequest* New_ctor(::System::Net::ConnectionPool* pool, ::Il2CppObject* owningObject, ::System::Net::GeneralAsyncDelegate* asyncCallback, int creationTimeout) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Net::ConnectionPool::AsyncConnectionPoolRequest::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ConnectionPool::AsyncConnectionPoolRequest*, creationType>(pool, owningObject, asyncCallback, creationTimeout)));
    }
  }; // System.Net.ConnectionPool/System.Net.AsyncConnectionPoolRequest
  #pragma pack(pop)
  static check_size<sizeof(ConnectionPool::AsyncConnectionPoolRequest), 40 + sizeof(int)> __System_Net_ConnectionPool_AsyncConnectionPoolRequestSizeCheck;
  static_assert(sizeof(ConnectionPool::AsyncConnectionPoolRequest) == 0x2C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Net::ConnectionPool::AsyncConnectionPoolRequest::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
