// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.TimerThread
#include "System/Net/TimerThread.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: InterlockedStack
  class InterlockedStack;
  // Forward declaring type: ServicePoint
  class ServicePoint;
  // Forward declaring type: CreateConnectionDelegate
  class CreateConnectionDelegate;
  // Forward declaring type: Semaphore
  class Semaphore;
  // Forward declaring type: PooledStream
  class PooledStream;
  // Forward declaring type: GeneralAsyncDelegate
  class GeneralAsyncDelegate;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: WaitHandle
  class WaitHandle;
  // Forward declaring type: Thread
  class Thread;
  // Forward declaring type: Mutex
  class Mutex;
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Queue
  class Queue;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: ConnectionPool
  class ConnectionPool;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::ConnectionPool);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::ConnectionPool*, "System.Net", "ConnectionPool");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.ConnectionPool
  // [TokenAttribute] Offset: FFFFFFFF
  class ConnectionPool : public ::Il2CppObject {
    public:
    // Nested type: ::System::Net::ConnectionPool::State
    struct State;
    // Nested type: ::System::Net::ConnectionPool::AsyncConnectionPoolRequest
    class AsyncConnectionPoolRequest;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.ConnectionPool/System.Net.State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.ConnectionPool/System.Net.State Initializing
      static constexpr const int Initializing = 0;
      // Get static field: static public System.Net.ConnectionPool/System.Net.State Initializing
      static ::System::Net::ConnectionPool::State _get_Initializing();
      // Set static field: static public System.Net.ConnectionPool/System.Net.State Initializing
      static void _set_Initializing(::System::Net::ConnectionPool::State value);
      // static field const value: static public System.Net.ConnectionPool/System.Net.State Running
      static constexpr const int Running = 1;
      // Get static field: static public System.Net.ConnectionPool/System.Net.State Running
      static ::System::Net::ConnectionPool::State _get_Running();
      // Set static field: static public System.Net.ConnectionPool/System.Net.State Running
      static void _set_Running(::System::Net::ConnectionPool::State value);
      // static field const value: static public System.Net.ConnectionPool/System.Net.State ShuttingDown
      static constexpr const int ShuttingDown = 2;
      // Get static field: static public System.Net.ConnectionPool/System.Net.State ShuttingDown
      static ::System::Net::ConnectionPool::State _get_ShuttingDown();
      // Set static field: static public System.Net.ConnectionPool/System.Net.State ShuttingDown
      static void _set_ShuttingDown(::System::Net::ConnectionPool::State value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // System.Net.ConnectionPool/System.Net.State
    #pragma pack(pop)
    static check_size<sizeof(ConnectionPool::State), 0 + sizeof(int)> __System_Net_ConnectionPool_StateSizeCheck;
    static_assert(sizeof(ConnectionPool::State) == 0x4);
    public:
    // private readonly System.Net.TimerThread/System.Net.Queue m_CleanupQueue
    // Size: 0x8
    // Offset: 0x10
    ::System::Net::TimerThread::Queue* m_CleanupQueue;
    // Field size check
    static_assert(sizeof(::System::Net::TimerThread::Queue*) == 0x8);
    // private System.Net.ConnectionPool/System.Net.State m_State
    // Size: 0x4
    // Offset: 0x18
    ::System::Net::ConnectionPool::State m_State;
    // Field size check
    static_assert(sizeof(::System::Net::ConnectionPool::State) == 0x4);
    // Padding between fields: m_State and: m_StackOld
    char __padding1[0x4] = {};
    // private System.Net.InterlockedStack m_StackOld
    // Size: 0x8
    // Offset: 0x20
    ::System::Net::InterlockedStack* m_StackOld;
    // Field size check
    static_assert(sizeof(::System::Net::InterlockedStack*) == 0x8);
    // private System.Net.InterlockedStack m_StackNew
    // Size: 0x8
    // Offset: 0x28
    ::System::Net::InterlockedStack* m_StackNew;
    // Field size check
    static_assert(sizeof(::System::Net::InterlockedStack*) == 0x8);
    // private System.Int32 m_WaitCount
    // Size: 0x4
    // Offset: 0x30
    int m_WaitCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_WaitCount and: m_WaitHandles
    char __padding4[0x4] = {};
    // private System.Threading.WaitHandle[] m_WaitHandles
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::System::Threading::WaitHandle*> m_WaitHandles;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Threading::WaitHandle*>) == 0x8);
    // private System.Exception m_ResError
    // Size: 0x8
    // Offset: 0x40
    ::System::Exception* m_ResError;
    // Field size check
    static_assert(sizeof(::System::Exception*) == 0x8);
    // private System.Boolean m_ErrorOccured
    // Size: 0x1
    // Offset: 0x48
    bool m_ErrorOccured;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ErrorOccured and: m_ErrorTimer
    char __padding7[0x7] = {};
    // private System.Net.TimerThread/System.Net.Timer m_ErrorTimer
    // Size: 0x8
    // Offset: 0x50
    ::System::Net::TimerThread::Timer* m_ErrorTimer;
    // Field size check
    static_assert(sizeof(::System::Net::TimerThread::Timer*) == 0x8);
    // private System.Collections.ArrayList m_ObjectList
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::ArrayList* m_ObjectList;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // private System.Int32 m_TotalObjects
    // Size: 0x4
    // Offset: 0x60
    int m_TotalObjects;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_TotalObjects and: m_QueuedRequests
    char __padding10[0x4] = {};
    // private System.Collections.Queue m_QueuedRequests
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Queue* m_QueuedRequests;
    // Field size check
    static_assert(sizeof(::System::Collections::Queue*) == 0x8);
    // private System.Threading.Thread m_AsyncThread
    // Size: 0x8
    // Offset: 0x70
    ::System::Threading::Thread* m_AsyncThread;
    // Field size check
    static_assert(sizeof(::System::Threading::Thread*) == 0x8);
    // private System.Int32 m_MaxPoolSize
    // Size: 0x4
    // Offset: 0x78
    int m_MaxPoolSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_MinPoolSize
    // Size: 0x4
    // Offset: 0x7C
    int m_MinPoolSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Net.ServicePoint m_ServicePoint
    // Size: 0x8
    // Offset: 0x80
    ::System::Net::ServicePoint* m_ServicePoint;
    // Field size check
    static_assert(sizeof(::System::Net::ServicePoint*) == 0x8);
    // private System.Net.CreateConnectionDelegate m_CreateConnectionCallback
    // Size: 0x8
    // Offset: 0x88
    ::System::Net::CreateConnectionDelegate* m_CreateConnectionCallback;
    // Field size check
    static_assert(sizeof(::System::Net::CreateConnectionDelegate*) == 0x8);
    public:
    // Get static field: static private System.Net.TimerThread/System.Net.Callback s_CleanupCallback
    static ::System::Net::TimerThread::Callback* _get_s_CleanupCallback();
    // Set static field: static private System.Net.TimerThread/System.Net.Callback s_CleanupCallback
    static void _set_s_CleanupCallback(::System::Net::TimerThread::Callback* value);
    // Get static field: static private System.Net.TimerThread/System.Net.Callback s_CancelErrorCallback
    static ::System::Net::TimerThread::Callback* _get_s_CancelErrorCallback();
    // Set static field: static private System.Net.TimerThread/System.Net.Callback s_CancelErrorCallback
    static void _set_s_CancelErrorCallback(::System::Net::TimerThread::Callback* value);
