// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Net.CookieToken
#include "System/Net/CookieToken.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Autogenerated type: System.Net.CookieTokenizer
  class CookieTokenizer : public ::Il2CppObject {
    public:
    // Nested type: System::Net::CookieTokenizer::RecognizedAttribute
    struct RecognizedAttribute;
    // private System.Boolean m_eofCookie
    // Offset: 0x10
    bool m_eofCookie;
    // private System.Int32 m_index
    // Offset: 0x14
    int m_index;
    // private System.Int32 m_length
    // Offset: 0x18
    int m_length;
    // private System.String m_name
    // Offset: 0x20
    ::Il2CppString* m_name;
    // private System.Boolean m_quoted
    // Offset: 0x28
    bool m_quoted;
    // private System.Int32 m_start
    // Offset: 0x2C
    int m_start;
    // private System.Net.CookieToken m_token
    // Offset: 0x30
    System::Net::CookieToken m_token;
    // private System.Int32 m_tokenLength
    // Offset: 0x34
    int m_tokenLength;
    // private System.String m_tokenStream
    // Offset: 0x38
    ::Il2CppString* m_tokenStream;
    // private System.String m_value
    // Offset: 0x40
    ::Il2CppString* m_value;
    // Get static field: static private System.Net.CookieTokenizer/RecognizedAttribute[] RecognizedAttributes
    static ::Array<System::Net::CookieTokenizer::RecognizedAttribute>* _get_RecognizedAttributes();
    // Set static field: static private System.Net.CookieTokenizer/RecognizedAttribute[] RecognizedAttributes
    static void _set_RecognizedAttributes(::Array<System::Net::CookieTokenizer::RecognizedAttribute>* value);
    // Get static field: static private System.Net.CookieTokenizer/RecognizedAttribute[] RecognizedServerAttributes
    static ::Array<System::Net::CookieTokenizer::RecognizedAttribute>* _get_RecognizedServerAttributes();
    // Set static field: static private System.Net.CookieTokenizer/RecognizedAttribute[] RecognizedServerAttributes
    static void _set_RecognizedServerAttributes(::Array<System::Net::CookieTokenizer::RecognizedAttribute>* value);
    // System.Void .ctor(System.String tokenStream)
    // Offset: 0x14DF604
    static CookieTokenizer* New_ctor(::Il2CppString* tokenStream);
    // System.Boolean get_EndOfCookie()
    // Offset: 0x14DF784
    bool get_EndOfCookie();
    // System.Void set_EndOfCookie(System.Boolean value)
    // Offset: 0x14DF78C
    void set_EndOfCookie(bool value);
    // System.Boolean get_Eof()
    // Offset: 0x14DF774
    bool get_Eof();
    // System.String get_Name()
    // Offset: 0x14DF798
    ::Il2CppString* get_Name();
    // System.Void set_Name(System.String value)
    // Offset: 0x14DF7A0
    void set_Name(::Il2CppString* value);
    // System.Boolean get_Quoted()
    // Offset: 0x14DF7A8
    bool get_Quoted();
    // System.Void set_Quoted(System.Boolean value)
    // Offset: 0x14DF7B0
    void set_Quoted(bool value);
    // System.Net.CookieToken get_Token()
    // Offset: 0x14DF7BC
    System::Net::CookieToken get_Token();
    // System.Void set_Token(System.Net.CookieToken value)
    // Offset: 0x14DF7C4
    void set_Token(System::Net::CookieToken value);
    // System.String get_Value()
    // Offset: 0x14DF7CC
    ::Il2CppString* get_Value();
    // System.Void set_Value(System.String value)
    // Offset: 0x14DF7D4
    void set_Value(::Il2CppString* value);
    // System.String Extract()
    // Offset: 0x14DF7DC
    ::Il2CppString* Extract();
    // System.Net.CookieToken FindNext(System.Boolean ignoreComma, System.Boolean ignoreEquals)
    // Offset: 0x14DF86C
    System::Net::CookieToken FindNext(bool ignoreComma, bool ignoreEquals);
    // System.Net.CookieToken Next(System.Boolean first, System.Boolean parseResponseCookies)
    // Offset: 0x14DF648
    System::Net::CookieToken Next(bool first, bool parseResponseCookies);
    // System.Void Reset()
    // Offset: 0x14DFB28
    void Reset();
    // System.Net.CookieToken TokenFromName(System.Boolean parseResponseCookies)
    // Offset: 0x14DFBB0
    System::Net::CookieToken TokenFromName(bool parseResponseCookies);
    // static private System.Void .cctor()
    // Offset: 0x14DFDE0
    static void _cctor();
  }; // System.Net.CookieTokenizer
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Net::CookieTokenizer*, "System.Net", "CookieTokenizer");
#pragma pack(pop)
