// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.CookieVariant
#include "System/Net/CookieVariant.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: Comparer
  class Comparer;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IComparer
  class IComparer;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x9A
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.Cookie
  // [TokenAttribute] Offset: FFFFFFFF
  class Cookie : public ::Il2CppObject {
    public:
    // private System.String m_comment
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* m_comment;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Uri m_commentUri
    // Size: 0x8
    // Offset: 0x18
    System::Uri* m_commentUri;
    // Field size check
    static_assert(sizeof(System::Uri*) == 0x8);
    // private System.Net.CookieVariant m_cookieVariant
    // Size: 0x4
    // Offset: 0x20
    System::Net::CookieVariant m_cookieVariant;
    // Field size check
    static_assert(sizeof(System::Net::CookieVariant) == 0x4);
    // private System.Boolean m_discard
    // Size: 0x1
    // Offset: 0x24
    bool m_discard;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_discard and: m_domain
    char __padding3[0x3] = {};
    // private System.String m_domain
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* m_domain;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean m_domain_implicit
    // Size: 0x1
    // Offset: 0x30
    bool m_domain_implicit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_domain_implicit and: m_expires
    char __padding5[0x7] = {};
    // private System.DateTime m_expires
    // Size: 0x8
    // Offset: 0x38
    System::DateTime m_expires;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // private System.String m_name
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* m_name;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String m_path
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* m_path;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean m_path_implicit
    // Size: 0x1
    // Offset: 0x50
    bool m_path_implicit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_path_implicit and: m_port
    char __padding9[0x7] = {};
    // private System.String m_port
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppString* m_port;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean m_port_implicit
    // Size: 0x1
    // Offset: 0x60
    bool m_port_implicit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_port_implicit and: m_port_list
    char __padding11[0x7] = {};
    // private System.Int32[] m_port_list
    // Size: 0x8
    // Offset: 0x68
    ::Array<int>* m_port_list;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Boolean m_secure
    // Size: 0x1
    // Offset: 0x70
    bool m_secure;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [OptionalFieldAttribute] Offset: 0xDA7C28
    // private System.Boolean m_httpOnly
    // Size: 0x1
    // Offset: 0x71
    bool m_httpOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_httpOnly and: m_timeStamp
    char __padding14[0x6] = {};
    // private System.DateTime m_timeStamp
    // Size: 0x8
    // Offset: 0x78
    System::DateTime m_timeStamp;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // private System.String m_value
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppString* m_value;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Int32 m_version
    // Size: 0x4
    // Offset: 0x88
    int m_version;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_version and: m_domainKey
    char __padding17[0x4] = {};
    // private System.String m_domainKey
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppString* m_domainKey;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.Boolean IsQuotedVersion
    // Size: 0x1
    // Offset: 0x98
    bool IsQuotedVersion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean IsQuotedDomain
    // Size: 0x1
    // Offset: 0x99
    bool IsQuotedDomain;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: Cookie
