// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.CookieVariant
#include "System/Net/CookieVariant.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: Comparer
  class Comparer;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IComparer
  class IComparer;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: Cookie
  class Cookie;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::Cookie);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::Cookie*, "System.Net", "Cookie");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x9A
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.Cookie
  // [TokenAttribute] Offset: FFFFFFFF
  class Cookie : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.String m_comment
    // Size: 0x8
    // Offset: 0x10
    ::StringW m_comment;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Uri m_commentUri
    // Size: 0x8
    // Offset: 0x18
    ::System::Uri* m_commentUri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Net.CookieVariant m_cookieVariant
    // Size: 0x4
    // Offset: 0x20
    ::System::Net::CookieVariant m_cookieVariant;
    // Field size check
    static_assert(sizeof(::System::Net::CookieVariant) == 0x4);
    // private System.Boolean m_discard
    // Size: 0x1
    // Offset: 0x24
    bool m_discard;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_discard and: m_domain
    char __padding3[0x3] = {};
    // private System.String m_domain
    // Size: 0x8
    // Offset: 0x28
    ::StringW m_domain;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_domain_implicit
    // Size: 0x1
    // Offset: 0x30
    bool m_domain_implicit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_domain_implicit and: m_expires
    char __padding5[0x7] = {};
    // private System.DateTime m_expires
    // Size: 0x8
    // Offset: 0x38
    ::System::DateTime m_expires;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.String m_name
    // Size: 0x8
    // Offset: 0x40
    ::StringW m_name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_path
    // Size: 0x8
    // Offset: 0x48
    ::StringW m_path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_path_implicit
    // Size: 0x1
    // Offset: 0x50
    bool m_path_implicit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_path_implicit and: m_port
    char __padding9[0x7] = {};
    // private System.String m_port
    // Size: 0x8
    // Offset: 0x58
    ::StringW m_port;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_port_implicit
    // Size: 0x1
    // Offset: 0x60
    bool m_port_implicit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_port_implicit and: m_port_list
    char __padding11[0x7] = {};
    // private System.Int32[] m_port_list
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<int> m_port_list;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Boolean m_secure
    // Size: 0x1
    // Offset: 0x70
    bool m_secure;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [OptionalFieldAttribute] Offset: 0x119B0C0
    // private System.Boolean m_httpOnly
    // Size: 0x1
    // Offset: 0x71
    bool m_httpOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_httpOnly and: m_timeStamp
    char __padding14[0x6] = {};
    // private System.DateTime m_timeStamp
    // Size: 0x8
    // Offset: 0x78
    ::System::DateTime m_timeStamp;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.String m_value
    // Size: 0x8
    // Offset: 0x80
    ::StringW m_value;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 m_version
    // Size: 0x4
    // Offset: 0x88
    int m_version;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_version and: m_domainKey
    char __padding17[0x4] = {};
    // private System.String m_domainKey
    // Size: 0x8
    // Offset: 0x90
    ::StringW m_domainKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Boolean IsQuotedVersion
    // Size: 0x1
    // Offset: 0x98
    bool IsQuotedVersion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean IsQuotedDomain
    // Size: 0x1
    // Offset: 0x99
    bool IsQuotedDomain;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static readonly System.Char[] PortSplitDelimiters
    static ::ArrayW<::Il2CppChar> _get_PortSplitDelimiters();
    // Set static field: static readonly System.Char[] PortSplitDelimiters
    static void _set_PortSplitDelimiters(::ArrayW<::Il2CppChar> value);
    // Get static field: static readonly System.Char[] Reserved2Name
    static ::ArrayW<::Il2CppChar> _get_Reserved2Name();
    // Set static field: static readonly System.Char[] Reserved2Name
    static void _set_Reserved2Name(::ArrayW<::Il2CppChar> value);
    // Get static field: static readonly System.Char[] Reserved2Value
    static ::ArrayW<::Il2CppChar> _get_Reserved2Value();
    // Set static field: static readonly System.Char[] Reserved2Value
    static void _set_Reserved2Value(::ArrayW<::Il2CppChar> value);
