// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.WebRequest
#include "System/Net/WebRequest.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: FtpAsyncResult
  class FtpAsyncResult;
  // Forward declaring type: ServicePoint
  class ServicePoint;
  // Forward declaring type: NetworkCredential
  class NetworkCredential;
  // Forward declaring type: IPHostEntry
  class IPHostEntry;
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
  // Forward declaring type: IWebProxy
  class IWebProxy;
  // Forward declaring type: FtpWebResponse
  class FtpWebResponse;
  // Skipping declaration: RequestState because it is already included!
  // Forward declaring type: FtpStatus
  class FtpStatus;
  // Forward declaring type: IPAddress
  class IPAddress;
  // Forward declaring type: ICredentials
  class ICredentials;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Forward declaring type: WebResponse
  class WebResponse;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: StreamReader
  class StreamReader;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: FtpWebRequest
  class FtpWebRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::FtpWebRequest);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::FtpWebRequest*, "System.Net", "FtpWebRequest");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0xF8
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.FtpWebRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class FtpWebRequest : public ::System::Net::WebRequest {
    public:
    // Nested type: ::System::Net::FtpWebRequest::RequestState
    struct RequestState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.FtpWebRequest/System.Net.RequestState
    // [TokenAttribute] Offset: FFFFFFFF
    struct RequestState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RequestState
      constexpr RequestState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.FtpWebRequest/System.Net.RequestState Before
      static constexpr const int Before = 0;
      // Get static field: static public System.Net.FtpWebRequest/System.Net.RequestState Before
      static ::System::Net::FtpWebRequest::RequestState _get_Before();
      // Set static field: static public System.Net.FtpWebRequest/System.Net.RequestState Before
      static void _set_Before(::System::Net::FtpWebRequest::RequestState value);
      // static field const value: static public System.Net.FtpWebRequest/System.Net.RequestState Scheduled
      static constexpr const int Scheduled = 1;
      // Get static field: static public System.Net.FtpWebRequest/System.Net.RequestState Scheduled
      static ::System::Net::FtpWebRequest::RequestState _get_Scheduled();
      // Set static field: static public System.Net.FtpWebRequest/System.Net.RequestState Scheduled
      static void _set_Scheduled(::System::Net::FtpWebRequest::RequestState value);
      // static field const value: static public System.Net.FtpWebRequest/System.Net.RequestState Connecting
      static constexpr const int Connecting = 2;
      // Get static field: static public System.Net.FtpWebRequest/System.Net.RequestState Connecting
      static ::System::Net::FtpWebRequest::RequestState _get_Connecting();
      // Set static field: static public System.Net.FtpWebRequest/System.Net.RequestState Connecting
      static void _set_Connecting(::System::Net::FtpWebRequest::RequestState value);
      // static field const value: static public System.Net.FtpWebRequest/System.Net.RequestState Authenticating
      static constexpr const int Authenticating = 3;
      // Get static field: static public System.Net.FtpWebRequest/System.Net.RequestState Authenticating
      static ::System::Net::FtpWebRequest::RequestState _get_Authenticating();
      // Set static field: static public System.Net.FtpWebRequest/System.Net.RequestState Authenticating
      static void _set_Authenticating(::System::Net::FtpWebRequest::RequestState value);
      // static field const value: static public System.Net.FtpWebRequest/System.Net.RequestState OpeningData
      static constexpr const int OpeningData = 4;
      // Get static field: static public System.Net.FtpWebRequest/System.Net.RequestState OpeningData
      static ::System::Net::FtpWebRequest::RequestState _get_OpeningData();
      // Set static field: static public System.Net.FtpWebRequest/System.Net.RequestState OpeningData
      static void _set_OpeningData(::System::Net::FtpWebRequest::RequestState value);
      // static field const value: static public System.Net.FtpWebRequest/System.Net.RequestState TransferInProgress
      static constexpr const int TransferInProgress = 5;
      // Get static field: static public System.Net.FtpWebRequest/System.Net.RequestState TransferInProgress
      static ::System::Net::FtpWebRequest::RequestState _get_TransferInProgress();
      // Set static field: static public System.Net.FtpWebRequest/System.Net.RequestState TransferInProgress
      static void _set_TransferInProgress(::System::Net::FtpWebRequest::RequestState value);
      // static field const value: static public System.Net.FtpWebRequest/System.Net.RequestState Finished
      static constexpr const int Finished = 6;
      // Get static field: static public System.Net.FtpWebRequest/System.Net.RequestState Finished
      static ::System::Net::FtpWebRequest::RequestState _get_Finished();
      // Set static field: static public System.Net.FtpWebRequest/System.Net.RequestState Finished
      static void _set_Finished(::System::Net::FtpWebRequest::RequestState value);
      // static field const value: static public System.Net.FtpWebRequest/System.Net.RequestState Aborted
      static constexpr const int Aborted = 7;
      // Get static field: static public System.Net.FtpWebRequest/System.Net.RequestState Aborted
      static ::System::Net::FtpWebRequest::RequestState _get_Aborted();
      // Set static field: static public System.Net.FtpWebRequest/System.Net.RequestState Aborted
      static void _set_Aborted(::System::Net::FtpWebRequest::RequestState value);
      // static field const value: static public System.Net.FtpWebRequest/System.Net.RequestState Error
      static constexpr const int Error = 8;
      // Get static field: static public System.Net.FtpWebRequest/System.Net.RequestState Error
      static ::System::Net::FtpWebRequest::RequestState _get_Error();
      // Set static field: static public System.Net.FtpWebRequest/System.Net.RequestState Error
      static void _set_Error(::System::Net::FtpWebRequest::RequestState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Net.FtpWebRequest/System.Net.RequestState
    #pragma pack(pop)
    static check_size<sizeof(FtpWebRequest::RequestState), 0 + sizeof(int)> __System_Net_FtpWebRequest_RequestStateSizeCheck;
    static_assert(sizeof(FtpWebRequest::RequestState) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Uri requestUri
    // Size: 0x8
    // Offset: 0x38
    ::System::Uri* requestUri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.String file_name
    // Size: 0x8
    // Offset: 0x40
    ::StringW file_name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Net.ServicePoint servicePoint
    // Size: 0x8
    // Offset: 0x48
    ::System::Net::ServicePoint* servicePoint;
    // Field size check
    static_assert(sizeof(::System::Net::ServicePoint*) == 0x8);
    // private System.IO.Stream origDataStream
    // Size: 0x8
    // Offset: 0x50
    ::System::IO::Stream* origDataStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.IO.Stream dataStream
    // Size: 0x8
    // Offset: 0x58
    ::System::IO::Stream* dataStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.IO.Stream controlStream
    // Size: 0x8
    // Offset: 0x60
    ::System::IO::Stream* controlStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.IO.StreamReader controlReader
    // Size: 0x8
    // Offset: 0x68
    ::System::IO::StreamReader* controlReader;
    // Field size check
    static_assert(sizeof(::System::IO::StreamReader*) == 0x8);
    // private System.Net.NetworkCredential credentials
    // Size: 0x8
    // Offset: 0x70
    ::System::Net::NetworkCredential* credentials;
    // Field size check
    static_assert(sizeof(::System::Net::NetworkCredential*) == 0x8);
    // private System.Net.IPHostEntry hostEntry
    // Size: 0x8
    // Offset: 0x78
    ::System::Net::IPHostEntry* hostEntry;
    // Field size check
    static_assert(sizeof(::System::Net::IPHostEntry*) == 0x8);
    // private System.Net.IPEndPoint localEndPoint
    // Size: 0x8
    // Offset: 0x80
    ::System::Net::IPEndPoint* localEndPoint;
    // Field size check
    static_assert(sizeof(::System::Net::IPEndPoint*) == 0x8);
    // private System.Net.IPEndPoint remoteEndPoint
    // Size: 0x8
    // Offset: 0x88
    ::System::Net::IPEndPoint* remoteEndPoint;
    // Field size check
    static_assert(sizeof(::System::Net::IPEndPoint*) == 0x8);
    // private System.Net.IWebProxy proxy
    // Size: 0x8
    // Offset: 0x90
    ::System::Net::IWebProxy* proxy;
    // Field size check
    static_assert(sizeof(::System::Net::IWebProxy*) == 0x8);
    // private System.Int32 timeout
    // Size: 0x4
    // Offset: 0x98
    int timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 rwTimeout
    // Size: 0x4
    // Offset: 0x9C
    int rwTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int64 offset
    // Size: 0x8
    // Offset: 0xA0
    int64_t offset;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean binary
    // Size: 0x1
    // Offset: 0xA8
    bool binary;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean enableSsl
    // Size: 0x1
    // Offset: 0xA9
    bool enableSsl;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean usePassive
    // Size: 0x1
    // Offset: 0xAA
    bool usePassive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean keepAlive
    // Size: 0x1
    // Offset: 0xAB
    bool keepAlive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: keepAlive and: method
    char __padding18[0x4] = {};
    // private System.String method
    // Size: 0x8
    // Offset: 0xB0
    ::StringW method;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String renameTo
    // Size: 0x8
    // Offset: 0xB8
    ::StringW renameTo;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Object locker
    // Size: 0x8
    // Offset: 0xC0
    ::Il2CppObject* locker;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Net.FtpWebRequest/System.Net.RequestState requestState
    // Size: 0x4
    // Offset: 0xC8
    ::System::Net::FtpWebRequest::RequestState requestState;
    // Field size check
    static_assert(sizeof(::System::Net::FtpWebRequest::RequestState) == 0x4);
    // Padding between fields: requestState and: asyncResult
    char __padding22[0x4] = {};
    // private System.Net.FtpAsyncResult asyncResult
    // Size: 0x8
    // Offset: 0xD0
    ::System::Net::FtpAsyncResult* asyncResult;
    // Field size check
    static_assert(sizeof(::System::Net::FtpAsyncResult*) == 0x8);
    // private System.Net.FtpWebResponse ftpResponse
    // Size: 0x8
    // Offset: 0xD8
    ::System::Net::FtpWebResponse* ftpResponse;
    // Field size check
    static_assert(sizeof(::System::Net::FtpWebResponse*) == 0x8);
    // private System.IO.Stream requestStream
    // Size: 0x8
    // Offset: 0xE0
    ::System::IO::Stream* requestStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.String initial_path
    // Size: 0x8
    // Offset: 0xE8
    ::StringW initial_path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Text.Encoding dataEncoding
    // Size: 0x8
    // Offset: 0xF0
    ::System::Text::Encoding* dataEncoding;
    // Field size check
    static_assert(sizeof(::System::Text::Encoding*) == 0x8);
    public:
    // Get static field: static private readonly System.String[] supportedCommands
    static ::ArrayW<::StringW> _get_supportedCommands();
    // Set static field: static private readonly System.String[] supportedCommands
    static void _set_supportedCommands(::ArrayW<::StringW> value);
    // Get instance field reference: private System.Uri requestUri
    ::System::Uri*& dyn_requestUri();
    // Get instance field reference: private System.String file_name
    ::StringW& dyn_file_name();
    // Get instance field reference: private System.Net.ServicePoint servicePoint
    ::System::Net::ServicePoint*& dyn_servicePoint();
    // Get instance field reference: private System.IO.Stream origDataStream
    ::System::IO::Stream*& dyn_origDataStream();
