// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.HttpListenerRequestUriBuilder
  // [] Offset: FFFFFFFF
  class HttpListenerRequestUriBuilder : public ::Il2CppObject {
    public:
    // Nested type: System::Net::HttpListenerRequestUriBuilder::ParsingResult
    struct ParsingResult;
    // Nested type: System::Net::HttpListenerRequestUriBuilder::EncodingType
    struct EncodingType;
    // private readonly System.String rawUri
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* rawUri;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.String cookedUriScheme
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* cookedUriScheme;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.String cookedUriHost
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* cookedUriHost;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.String cookedUriPath
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* cookedUriPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private readonly System.String cookedUriQuery
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppString* cookedUriQuery;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Text.StringBuilder requestUriString
    // Size: 0x8
    // Offset: 0x38
    System::Text::StringBuilder* requestUriString;
    // Field size check
    static_assert(sizeof(System::Text::StringBuilder*) == 0x8);
    // private System.Collections.Generic.List`1<System.Byte> rawOctets
    // Size: 0x8
    // Offset: 0x40
    System::Collections::Generic::List_1<uint8_t>* rawOctets;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<uint8_t>*) == 0x8);
    // private System.String rawPath
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* rawPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Uri requestUri
    // Size: 0x8
    // Offset: 0x50
    System::Uri* requestUri;
    // Field size check
    static_assert(sizeof(System::Uri*) == 0x8);
    // Creating value type constructor for type: HttpListenerRequestUriBuilder
    HttpListenerRequestUriBuilder(::Il2CppString* rawUri_ = {}, ::Il2CppString* cookedUriScheme_ = {}, ::Il2CppString* cookedUriHost_ = {}, ::Il2CppString* cookedUriPath_ = {}, ::Il2CppString* cookedUriQuery_ = {}, System::Text::StringBuilder* requestUriString_ = {}, System::Collections::Generic::List_1<uint8_t>* rawOctets_ = {}, ::Il2CppString* rawPath_ = {}, System::Uri* requestUri_ = {}) noexcept : rawUri{rawUri_}, cookedUriScheme{cookedUriScheme_}, cookedUriHost{cookedUriHost_}, cookedUriPath{cookedUriPath_}, cookedUriQuery{cookedUriQuery_}, requestUriString{requestUriString_}, rawOctets{rawOctets_}, rawPath{rawPath_}, requestUri{requestUri_} {}
    // Get static field: static private readonly System.Boolean useCookedRequestUrl
    static bool _get_useCookedRequestUrl();
    // Set static field: static private readonly System.Boolean useCookedRequestUrl
    static void _set_useCookedRequestUrl(bool value);
    // Get static field: static private readonly System.Text.Encoding utf8Encoding
    static System::Text::Encoding* _get_utf8Encoding();
    // Set static field: static private readonly System.Text.Encoding utf8Encoding
    static void _set_utf8Encoding(System::Text::Encoding* value);
    // Get static field: static private readonly System.Text.Encoding ansiEncoding
    static System::Text::Encoding* _get_ansiEncoding();
    // Set static field: static private readonly System.Text.Encoding ansiEncoding
    static void _set_ansiEncoding(System::Text::Encoding* value);
    // static private System.Void .cctor()
    // Offset: 0x148E2F0
    static void _cctor();
    // private System.Void .ctor(System.String rawUri, System.String cookedUriScheme, System.String cookedUriHost, System.String cookedUriPath, System.String cookedUriQuery)
    // Offset: 0x148E444
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static HttpListenerRequestUriBuilder* New_ctor(::Il2CppString* rawUri, ::Il2CppString* cookedUriScheme, ::Il2CppString* cookedUriHost, ::Il2CppString* cookedUriPath, ::Il2CppString* cookedUriQuery) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Net::HttpListenerRequestUriBuilder::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<HttpListenerRequestUriBuilder*, creationType>(rawUri, cookedUriScheme, cookedUriHost, cookedUriPath, cookedUriQuery)));
    }
    // static public System.Uri GetRequestUri(System.String rawUri, System.String cookedUriScheme, System.String cookedUriHost, System.String cookedUriPath, System.String cookedUriQuery)
    // Offset: 0x148E03C
    static System::Uri* GetRequestUri(::Il2CppString* rawUri, ::Il2CppString* cookedUriScheme, ::Il2CppString* cookedUriHost, ::Il2CppString* cookedUriPath, ::Il2CppString* cookedUriQuery);
    // private System.Uri Build()
    // Offset: 0x148E598
    System::Uri* Build();
    // private System.Void BuildRequestUriUsingCookedPath()
    // Offset: 0x148E6B0
    void BuildRequestUriUsingCookedPath();
    // private System.Void BuildRequestUriUsingRawPath()
    // Offset: 0x148E93C
    void BuildRequestUriUsingRawPath();
    // static private System.Text.Encoding GetEncoding(System.Net.HttpListenerRequestUriBuilder/EncodingType type)
    // Offset: 0x148EE48
    static System::Text::Encoding* GetEncoding(System::Net::HttpListenerRequestUriBuilder::EncodingType type);
    // private System.Net.HttpListenerRequestUriBuilder/ParsingResult BuildRequestUriUsingRawPath(System.Text.Encoding encoding)
    // Offset: 0x148EEE0
    System::Net::HttpListenerRequestUriBuilder::ParsingResult BuildRequestUriUsingRawPath(System::Text::Encoding* encoding);
    // private System.Net.HttpListenerRequestUriBuilder/ParsingResult ParseRawPath(System.Text.Encoding encoding)
    // Offset: 0x148F120
    System::Net::HttpListenerRequestUriBuilder::ParsingResult ParseRawPath(System::Text::Encoding* encoding);
    // private System.Boolean AppendUnicodeCodePointValuePercentEncoded(System.String codePoint)
    // Offset: 0x148F5E0
    bool AppendUnicodeCodePointValuePercentEncoded(::Il2CppString* codePoint);
    // private System.Boolean AddPercentEncodedOctetToRawOctetsList(System.Text.Encoding encoding, System.String escapedCharacter)
    // Offset: 0x148F89C
    bool AddPercentEncodedOctetToRawOctetsList(System::Text::Encoding* encoding, ::Il2CppString* escapedCharacter);
    // private System.Boolean EmptyDecodeAndAppendRawOctetsList(System.Text.Encoding encoding)
    // Offset: 0x148F274
    bool EmptyDecodeAndAppendRawOctetsList(System::Text::Encoding* encoding);
    // static private System.Void AppendOctetsPercentEncoded(System.Text.StringBuilder target, System.Collections.Generic.IEnumerable`1<System.Byte> octets)
    // Offset: 0x148F9B8
    static void AppendOctetsPercentEncoded(System::Text::StringBuilder* target, System::Collections::Generic::IEnumerable_1<uint8_t>* octets);
    // static private System.String GetOctetsAsString(System.Collections.Generic.IEnumerable`1<System.Byte> octets)
    // Offset: 0x148FC98
    static ::Il2CppString* GetOctetsAsString(System::Collections::Generic::IEnumerable_1<uint8_t>* octets);
    // static private System.String GetPath(System.String uriString)
    // Offset: 0x148ECEC
    static ::Il2CppString* GetPath(::Il2CppString* uriString);
    // static private System.String AddSlashToAsteriskOnlyPath(System.String path)
    // Offset: 0x148E514
    static ::Il2CppString* AddSlashToAsteriskOnlyPath(::Il2CppString* path);
    // private System.Void LogWarning(System.String methodName, System.String message, params System.Object[] args)
    // Offset: 0x148ECB0
    void LogWarning(::Il2CppString* methodName, ::Il2CppString* message, ::Array<::Il2CppObject*>* args);
    // Creating initializer_list -> params proxy for: System.Void LogWarning(System.String methodName, System.String message, params System.Object[] args)
    void LogWarning(::Il2CppString* methodName, ::Il2CppString* message, std::initializer_list<::Il2CppObject*> args);
    // Creating TArgs -> initializer_list proxy for: System.Void LogWarning(System.String methodName, System.String message, params System.Object[] args)
    template<class ...TParams>
    void LogWarning(::Il2CppString* methodName, ::Il2CppString* message, TParams&&... args) {
      LogWarning(methodName, message, {args...});
    }
  }; // System.Net.HttpListenerRequestUriBuilder
  #pragma pack(pop)
  static check_size<sizeof(HttpListenerRequestUriBuilder), 80 + sizeof(System::Uri*)> __System_Net_HttpListenerRequestUriBuilderSizeCheck;
  static_assert(sizeof(HttpListenerRequestUriBuilder) == 0x58);
}
DEFINE_IL2CPP_ARG_TYPE(System::Net::HttpListenerRequestUriBuilder*, "System.Net", "HttpListenerRequestUriBuilder");
