// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Net.WebRequest
#include "System/Net/WebRequest.hpp"
// Including type: System.Net.DecompressionMethods
#include "System/Net/DecompressionMethods.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Skipping declaration: NtlmAuthState because it is already included!
  // Forward declaring type: HttpContinueDelegate
  class HttpContinueDelegate;
  // Forward declaring type: CookieContainer
  class CookieContainer;
  // Forward declaring type: ICredentials
  class ICredentials;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Forward declaring type: IWebProxy
  class IWebProxy;
  // Forward declaring type: ServicePoint
  class ServicePoint;
  // Forward declaring type: WebConnectionStream
  class WebConnectionStream;
  // Forward declaring type: HttpWebResponse
  class HttpWebResponse;
  // Forward declaring type: WebAsyncResult
  class WebAsyncResult;
  // Forward declaring type: WebConnection
  class WebConnection;
  // Forward declaring type: ServerCertValidationCallback
  class ServerCertValidationCallback;
  // Forward declaring type: SimpleAsyncResult
  class SimpleAsyncResult;
  // Forward declaring type: HttpStatusCode
  struct HttpStatusCode;
  // Forward declaring type: WebResponse
  class WebResponse;
  // Forward declaring type: WebExceptionStatus
  struct WebExceptionStatus;
  // Forward declaring type: SimpleAsyncCallback
  class SimpleAsyncCallback;
  // Forward declaring type: WebConnectionData
  class WebConnectionData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
}
// Forward declaring namespace: Mono::Security::Interface
namespace Mono::Security::Interface {
  // Forward declaring type: MonoTlsProvider
  class MonoTlsProvider;
  // Forward declaring type: MonoTlsSettings
  class MonoTlsSettings;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Autogenerated type: System.Net.HttpWebRequest
  class HttpWebRequest : public System::Net::WebRequest {
    public:
    // Nested type: System::Net::HttpWebRequest::NtlmAuthState
    struct NtlmAuthState;
    // Nested type: System::Net::HttpWebRequest::AuthorizationState
    struct AuthorizationState;
    // Nested type: System::Net::HttpWebRequest::$$c__DisplayClass238_0
    class $$c__DisplayClass238_0;
    // Autogenerated type: System.Net.HttpWebRequest/NtlmAuthState
    struct NtlmAuthState : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: NtlmAuthState
      constexpr NtlmAuthState(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.HttpWebRequest/NtlmAuthState None
      static constexpr const int None = 0;
      // Get static field: static public System.Net.HttpWebRequest/NtlmAuthState None
      static System::Net::HttpWebRequest::NtlmAuthState _get_None();
      // Set static field: static public System.Net.HttpWebRequest/NtlmAuthState None
      static void _set_None(System::Net::HttpWebRequest::NtlmAuthState value);
      // static field const value: static public System.Net.HttpWebRequest/NtlmAuthState Challenge
      static constexpr const int Challenge = 1;
      // Get static field: static public System.Net.HttpWebRequest/NtlmAuthState Challenge
      static System::Net::HttpWebRequest::NtlmAuthState _get_Challenge();
      // Set static field: static public System.Net.HttpWebRequest/NtlmAuthState Challenge
      static void _set_Challenge(System::Net::HttpWebRequest::NtlmAuthState value);
      // static field const value: static public System.Net.HttpWebRequest/NtlmAuthState Response
      static constexpr const int Response = 2;
      // Get static field: static public System.Net.HttpWebRequest/NtlmAuthState Response
      static System::Net::HttpWebRequest::NtlmAuthState _get_Response();
      // Set static field: static public System.Net.HttpWebRequest/NtlmAuthState Response
      static void _set_Response(System::Net::HttpWebRequest::NtlmAuthState value);
    }; // System.Net.HttpWebRequest/NtlmAuthState
    // Autogenerated type: System.Net.HttpWebRequest/AuthorizationState
    struct AuthorizationState : public System::ValueType {
      public:
      // private readonly System.Net.HttpWebRequest request
      // Offset: 0x0
      System::Net::HttpWebRequest* request;
      // private readonly System.Boolean isProxy
      // Offset: 0x8
      bool isProxy;
      // private System.Boolean isCompleted
      // Offset: 0x9
      bool isCompleted;
      // private System.Net.HttpWebRequest/NtlmAuthState ntlm_auth_state
      // Offset: 0xC
      System::Net::HttpWebRequest::NtlmAuthState ntlm_auth_state;
      // Creating value type constructor for type: AuthorizationState
      constexpr AuthorizationState(System::Net::HttpWebRequest* request_ = {}, bool isProxy_ = {}, bool isCompleted_ = {}, System::Net::HttpWebRequest::NtlmAuthState ntlm_auth_state_ = {}) noexcept : request{request_}, isProxy{isProxy_}, isCompleted{isCompleted_}, ntlm_auth_state{ntlm_auth_state_} {}
      // public System.Boolean get_IsCompleted()
      // Offset: 0xC6AA04
      bool get_IsCompleted();
      // public System.Net.HttpWebRequest/NtlmAuthState get_NtlmAuthState()
      // Offset: 0xC6AA0C
      System::Net::HttpWebRequest::NtlmAuthState get_NtlmAuthState();
      // public System.Boolean get_IsNtlmAuthenticated()
      // Offset: 0xC6AA14
      bool get_IsNtlmAuthenticated();
      // public System.Void .ctor(System.Net.HttpWebRequest request, System.Boolean isProxy)
      // Offset: 0xC6AA34
      AuthorizationState(System::Net::HttpWebRequest* request, bool isProxy);
      // public System.Boolean CheckAuthorization(System.Net.WebResponse response, System.Net.HttpStatusCode code)
      // Offset: 0xC6AA70
      bool CheckAuthorization(System::Net::WebResponse* response, System::Net::HttpStatusCode code);
      // public System.Void Reset()
      // Offset: 0xC6AA78
      void Reset();
      // public override System.String ToString()
      // Offset: 0xC6AA80
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::Il2CppString* ToString();
    }; // System.Net.HttpWebRequest/AuthorizationState
    // private System.Uri requestUri
    // Offset: 0x20
    System::Uri* requestUri;
    // private System.Uri actualUri
    // Offset: 0x28
    System::Uri* actualUri;
    // private System.Boolean hostChanged
    // Offset: 0x30
    bool hostChanged;
    // private System.Boolean allowAutoRedirect
    // Offset: 0x31
    bool allowAutoRedirect;
    // private System.Boolean allowBuffering
    // Offset: 0x32
    bool allowBuffering;
    // private System.Security.Cryptography.X509Certificates.X509CertificateCollection certificates
    // Offset: 0x38
    System::Security::Cryptography::X509Certificates::X509CertificateCollection* certificates;
    // private System.String connectionGroup
    // Offset: 0x40
    ::Il2CppString* connectionGroup;
    // private System.Boolean haveContentLength
    // Offset: 0x48
    bool haveContentLength;
    // private System.Int64 contentLength
    // Offset: 0x50
    int64_t contentLength;
    // private System.Net.HttpContinueDelegate continueDelegate
    // Offset: 0x58
    System::Net::HttpContinueDelegate* continueDelegate;
    // private System.Net.CookieContainer cookieContainer
    // Offset: 0x60
    System::Net::CookieContainer* cookieContainer;
    // private System.Net.ICredentials credentials
    // Offset: 0x68
    System::Net::ICredentials* credentials;
    // private System.Boolean haveResponse
    // Offset: 0x70
    bool haveResponse;
    // private System.Boolean haveRequest
    // Offset: 0x71
    bool haveRequest;
    // private System.Boolean requestSent
    // Offset: 0x72
    bool requestSent;
    // private System.Net.WebHeaderCollection webHeaders
    // Offset: 0x78
    System::Net::WebHeaderCollection* webHeaders;
    // private System.Boolean keepAlive
    // Offset: 0x80
    bool keepAlive;
    // private System.Int32 maxAutoRedirect
    // Offset: 0x84
    int maxAutoRedirect;
    // private System.String mediaType
    // Offset: 0x88
    ::Il2CppString* mediaType;
    // private System.String method
    // Offset: 0x90
    ::Il2CppString* method;
    // private System.String initialMethod
    // Offset: 0x98
    ::Il2CppString* initialMethod;
    // private System.Boolean pipelined
    // Offset: 0xA0
    bool pipelined;
    // private System.Boolean preAuthenticate
    // Offset: 0xA1
    bool preAuthenticate;
    // private System.Boolean usedPreAuth
    // Offset: 0xA2
    bool usedPreAuth;
    // private System.Version version
    // Offset: 0xA8
    System::Version* version;
    // private System.Boolean force_version
    // Offset: 0xB0
    bool force_version;
    // private System.Version actualVersion
    // Offset: 0xB8
    System::Version* actualVersion;
    // private System.Net.IWebProxy proxy
    // Offset: 0xC0
    System::Net::IWebProxy* proxy;
    // private System.Boolean sendChunked
    // Offset: 0xC8
    bool sendChunked;
    // private System.Net.ServicePoint servicePoint
    // Offset: 0xD0
    System::Net::ServicePoint* servicePoint;
    // private System.Int32 timeout
    // Offset: 0xD8
    int timeout;
    // private System.Net.WebConnectionStream writeStream
    // Offset: 0xE0
    System::Net::WebConnectionStream* writeStream;
    // private System.Net.HttpWebResponse webResponse
    // Offset: 0xE8
    System::Net::HttpWebResponse* webResponse;
    // private System.Net.WebAsyncResult asyncWrite
    // Offset: 0xF0
    System::Net::WebAsyncResult* asyncWrite;
    // private System.Net.WebAsyncResult asyncRead
    // Offset: 0xF8
    System::Net::WebAsyncResult* asyncRead;
    // private System.EventHandler abortHandler
    // Offset: 0x100
    System::EventHandler* abortHandler;
    // private System.Int32 aborted
    // Offset: 0x108
    int aborted;
    // private System.Boolean gotRequestStream
    // Offset: 0x10C
    bool gotRequestStream;
    // private System.Int32 redirects
    // Offset: 0x110
    int redirects;
    // private System.Boolean expectContinue
    // Offset: 0x114
    bool expectContinue;
    // private System.Byte[] bodyBuffer
    // Offset: 0x118
    ::Array<uint8_t>* bodyBuffer;
    // private System.Int32 bodyBufferLength
    // Offset: 0x120
    int bodyBufferLength;
    // private System.Boolean getResponseCalled
    // Offset: 0x124
    bool getResponseCalled;
    // private System.Exception saved_exc
    // Offset: 0x128
    System::Exception* saved_exc;
    // private System.Object locker
    // Offset: 0x130
    ::Il2CppObject* locker;
    // private System.Boolean finished_reading
    // Offset: 0x138
    bool finished_reading;
    // System.Net.WebConnection WebConnection
    // Offset: 0x140
    System::Net::WebConnection* WebConnection;
    // private System.Net.DecompressionMethods auto_decomp
    // Offset: 0x148
    System::Net::DecompressionMethods auto_decomp;
    // private System.Int32 readWriteTimeout
    // Offset: 0x14C
    int readWriteTimeout;
    // private Mono.Security.Interface.MonoTlsProvider tlsProvider
    // Offset: 0x150
    Mono::Security::Interface::MonoTlsProvider* tlsProvider;
    // private Mono.Security.Interface.MonoTlsSettings tlsSettings
    // Offset: 0x158
    Mono::Security::Interface::MonoTlsSettings* tlsSettings;
    // private System.Net.ServerCertValidationCallback certValidationCallback
    // Offset: 0x160
    System::Net::ServerCertValidationCallback* certValidationCallback;
    // private System.Net.HttpWebRequest/AuthorizationState auth_state
    // Offset: 0x168
    System::Net::HttpWebRequest::AuthorizationState auth_state;
    // private System.Net.HttpWebRequest/AuthorizationState proxy_auth_state
    // Offset: 0x178
    System::Net::HttpWebRequest::AuthorizationState proxy_auth_state;
    // private System.String host
    // Offset: 0x188
    ::Il2CppString* host;
    // System.Action`1<System.IO.Stream> ResendContentFactory
    // Offset: 0x190
    System::Action_1<System::IO::Stream*>* ResendContentFactory;
    // private System.Boolean <ThrowOnError>k__BackingField
    // Offset: 0x198
    bool ThrowOnError;
    // private System.Boolean unsafe_auth_blah
    // Offset: 0x199
    bool unsafe_auth_blah;
    // private System.Boolean <ReuseConnection>k__BackingField
    // Offset: 0x19A
    bool ReuseConnection;
    // System.Net.WebConnection StoredConnection
    // Offset: 0x1A0
    System::Net::WebConnection* StoredConnection;
    // Get static field: static private System.Int32 defaultMaxResponseHeadersLength
    static int _get_defaultMaxResponseHeadersLength();
    // Set static field: static private System.Int32 defaultMaxResponseHeadersLength
    static void _set_defaultMaxResponseHeadersLength(int value);
    // public System.Void .ctor(System.Uri uri)
    // Offset: 0x123F5E4
    static HttpWebRequest* New_ctor(System::Uri* uri);
    // private System.Void ResetAuthorization()
    // Offset: 0x123FC28
    void ResetAuthorization();
    // public System.Uri get_Address()
    // Offset: 0x124032C
    System::Uri* get_Address();
    // System.Void set_Address(System.Uri value)
    // Offset: 0x1240334
    void set_Address(System::Uri* value);
    // public System.Void set_AllowAutoRedirect(System.Boolean value)
    // Offset: 0x124033C
    void set_AllowAutoRedirect(bool value);
