// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: MemoryStream
  class MemoryStream;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: EndPointListener
  class EndPointListener;
  // Forward declaring type: HttpListenerContext
  class HttpListenerContext;
  // Forward declaring type: ListenerPrefix
  class ListenerPrefix;
  // Forward declaring type: RequestStream
  class RequestStream;
  // Forward declaring type: ResponseStream
  class ResponseStream;
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
  // Forward declaring type: HttpListener
  class HttpListener;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509Certificate
  class X509Certificate;
  // Forward declaring type: X509Certificate2
  class X509Certificate2;
  // Forward declaring type: X509Chain
  class X509Chain;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: Timer
  class Timer;
}
// Forward declaring namespace: System::Net::Security
namespace System::Net::Security {
  // Forward declaring type: SslStream
  class SslStream;
  // Forward declaring type: SslPolicyErrors
  struct SslPolicyErrors;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Size: 0xBC
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.HttpConnection
  // [TokenAttribute] Offset: FFFFFFFF
  class HttpConnection : public ::Il2CppObject {
    public:
    // Nested type: System::Net::HttpConnection::InputState
    struct InputState;
    // Nested type: System::Net::HttpConnection::LineState
    struct LineState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.HttpConnection/System.Net.InputState
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputState/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: InputState
      constexpr InputState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.HttpConnection/System.Net.InputState RequestLine
      static constexpr const int RequestLine = 0;
      // Get static field: static public System.Net.HttpConnection/System.Net.InputState RequestLine
      static System::Net::HttpConnection::InputState _get_RequestLine();
      // Set static field: static public System.Net.HttpConnection/System.Net.InputState RequestLine
      static void _set_RequestLine(System::Net::HttpConnection::InputState value);
      // static field const value: static public System.Net.HttpConnection/System.Net.InputState Headers
      static constexpr const int Headers = 1;
      // Get static field: static public System.Net.HttpConnection/System.Net.InputState Headers
      static System::Net::HttpConnection::InputState _get_Headers();
      // Set static field: static public System.Net.HttpConnection/System.Net.InputState Headers
      static void _set_Headers(System::Net::HttpConnection::InputState value);
      // Get instance field: public System.Int32 value__
      int _get_value__();
      // Set instance field: public System.Int32 value__
      void _set_value__(int value);
    }; // System.Net.HttpConnection/System.Net.InputState
    #pragma pack(pop)
    static check_size<sizeof(HttpConnection::InputState), 0 + sizeof(int)> __System_Net_HttpConnection_InputStateSizeCheck;
    static_assert(sizeof(HttpConnection::InputState) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.HttpConnection/System.Net.LineState
    // [TokenAttribute] Offset: FFFFFFFF
    struct LineState/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: LineState
      constexpr LineState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.HttpConnection/System.Net.LineState None
      static constexpr const int None = 0;
      // Get static field: static public System.Net.HttpConnection/System.Net.LineState None
      static System::Net::HttpConnection::LineState _get_None();
      // Set static field: static public System.Net.HttpConnection/System.Net.LineState None
      static void _set_None(System::Net::HttpConnection::LineState value);
      // static field const value: static public System.Net.HttpConnection/System.Net.LineState CR
      static constexpr const int CR = 1;
      // Get static field: static public System.Net.HttpConnection/System.Net.LineState CR
      static System::Net::HttpConnection::LineState _get_CR();
      // Set static field: static public System.Net.HttpConnection/System.Net.LineState CR
      static void _set_CR(System::Net::HttpConnection::LineState value);
      // static field const value: static public System.Net.HttpConnection/System.Net.LineState LF
      static constexpr const int LF = 2;
      // Get static field: static public System.Net.HttpConnection/System.Net.LineState LF
      static System::Net::HttpConnection::LineState _get_LF();
      // Set static field: static public System.Net.HttpConnection/System.Net.LineState LF
      static void _set_LF(System::Net::HttpConnection::LineState value);
      // Get instance field: public System.Int32 value__
      int _get_value__();
      // Set instance field: public System.Int32 value__
      void _set_value__(int value);
    }; // System.Net.HttpConnection/System.Net.LineState
    #pragma pack(pop)
    static check_size<sizeof(HttpConnection::LineState), 0 + sizeof(int)> __System_Net_HttpConnection_LineStateSizeCheck;
    static_assert(sizeof(HttpConnection::LineState) == 0x4);
    // private System.Net.Sockets.Socket sock
    // Size: 0x8
    // Offset: 0x10
    System::Net::Sockets::Socket* sock;
    // Field size check
    static_assert(sizeof(System::Net::Sockets::Socket*) == 0x8);
    // private System.IO.Stream stream
    // Size: 0x8
    // Offset: 0x18
    System::IO::Stream* stream;
    // Field size check
    static_assert(sizeof(System::IO::Stream*) == 0x8);
    // private System.Net.EndPointListener epl
    // Size: 0x8
    // Offset: 0x20
    System::Net::EndPointListener* epl;
    // Field size check
    static_assert(sizeof(System::Net::EndPointListener*) == 0x8);
    // private System.IO.MemoryStream ms
    // Size: 0x8
    // Offset: 0x28
    System::IO::MemoryStream* ms;
    // Field size check
    static_assert(sizeof(System::IO::MemoryStream*) == 0x8);
    // private System.Byte[] buffer
    // Size: 0x8
    // Offset: 0x30
    ::Array<uint8_t>* buffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Net.HttpListenerContext context
    // Size: 0x8
    // Offset: 0x38
    System::Net::HttpListenerContext* context;
    // Field size check
    static_assert(sizeof(System::Net::HttpListenerContext*) == 0x8);
    // private System.Text.StringBuilder current_line
    // Size: 0x8
    // Offset: 0x40
    System::Text::StringBuilder* current_line;
    // Field size check
    static_assert(sizeof(System::Text::StringBuilder*) == 0x8);
    // private System.Net.ListenerPrefix prefix
    // Size: 0x8
    // Offset: 0x48
    System::Net::ListenerPrefix* prefix;
    // Field size check
    static_assert(sizeof(System::Net::ListenerPrefix*) == 0x8);
    // private System.Net.RequestStream i_stream
    // Size: 0x8
    // Offset: 0x50
    System::Net::RequestStream* i_stream;
    // Field size check
    static_assert(sizeof(System::Net::RequestStream*) == 0x8);
    // private System.Net.ResponseStream o_stream
    // Size: 0x8
    // Offset: 0x58
    System::Net::ResponseStream* o_stream;
    // Field size check
    static_assert(sizeof(System::Net::ResponseStream*) == 0x8);
    // private System.Boolean chunked
    // Size: 0x1
    // Offset: 0x60
    bool chunked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: chunked and: reuses
    char __padding10[0x3] = {};
    // private System.Int32 reuses
    // Size: 0x4
    // Offset: 0x64
    int reuses;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean context_bound
    // Size: 0x1
    // Offset: 0x68
    bool context_bound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean secure
    // Size: 0x1
    // Offset: 0x69
    bool secure;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: secure and: cert
    char __padding13[0x6] = {};
    // private System.Security.Cryptography.X509Certificates.X509Certificate cert
    // Size: 0x8
    // Offset: 0x70
    System::Security::Cryptography::X509Certificates::X509Certificate* cert;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Certificate*) == 0x8);
    // private System.Int32 s_timeout
    // Size: 0x4
    // Offset: 0x78
    int s_timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: s_timeout and: timer
    char __padding15[0x4] = {};
    // private System.Threading.Timer timer
    // Size: 0x8
    // Offset: 0x80
    System::Threading::Timer* timer;
    // Field size check
    static_assert(sizeof(System::Threading::Timer*) == 0x8);
    // private System.Net.IPEndPoint local_ep
    // Size: 0x8
    // Offset: 0x88
    System::Net::IPEndPoint* local_ep;
    // Field size check
    static_assert(sizeof(System::Net::IPEndPoint*) == 0x8);
    // private System.Net.HttpListener last_listener
    // Size: 0x8
    // Offset: 0x90
    System::Net::HttpListener* last_listener;
    // Field size check
    static_assert(sizeof(System::Net::HttpListener*) == 0x8);
    // private System.Int32[] client_cert_errors
    // Size: 0x8
    // Offset: 0x98
    ::Array<int>* client_cert_errors;
    // Field size check
    static_assert(sizeof(::Array<int>*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509Certificate2 client_cert
    // Size: 0x8
    // Offset: 0xA0
    System::Security::Cryptography::X509Certificates::X509Certificate2* client_cert;
    // Field size check
    static_assert(sizeof(System::Security::Cryptography::X509Certificates::X509Certificate2*) == 0x8);
    // private System.Net.Security.SslStream ssl_stream
    // Size: 0x8
    // Offset: 0xA8
    System::Net::Security::SslStream* ssl_stream;
    // Field size check
    static_assert(sizeof(System::Net::Security::SslStream*) == 0x8);
    // private System.Net.HttpConnection/System.Net.InputState input_state
    // Size: 0x4
    // Offset: 0xB0
    System::Net::HttpConnection::InputState input_state;
    // Field size check
    static_assert(sizeof(System::Net::HttpConnection::InputState) == 0x4);
    // private System.Net.HttpConnection/System.Net.LineState line_state
    // Size: 0x4
    // Offset: 0xB4
    System::Net::HttpConnection::LineState line_state;
    // Field size check
    static_assert(sizeof(System::Net::HttpConnection::LineState) == 0x4);
    // private System.Int32 position
    // Size: 0x4
    // Offset: 0xB8
    int position;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: HttpConnection
