// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Skipping declaration: State because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Autogenerated type: System.Net.MonoChunkStream
  class MonoChunkStream : public ::Il2CppObject {
    public:
    // Nested type: System::Net::MonoChunkStream::State
    struct State;
    // Nested type: System::Net::MonoChunkStream::Chunk
    class Chunk;
    // Autogenerated type: System.Net.MonoChunkStream/State
    struct State : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.MonoChunkStream/State None
      static constexpr const int None = 0;
      // Get static field: static public System.Net.MonoChunkStream/State None
      static System::Net::MonoChunkStream::State _get_None();
      // Set static field: static public System.Net.MonoChunkStream/State None
      static void _set_None(System::Net::MonoChunkStream::State value);
      // static field const value: static public System.Net.MonoChunkStream/State PartialSize
      static constexpr const int PartialSize = 1;
      // Get static field: static public System.Net.MonoChunkStream/State PartialSize
      static System::Net::MonoChunkStream::State _get_PartialSize();
      // Set static field: static public System.Net.MonoChunkStream/State PartialSize
      static void _set_PartialSize(System::Net::MonoChunkStream::State value);
      // static field const value: static public System.Net.MonoChunkStream/State Body
      static constexpr const int Body = 2;
      // Get static field: static public System.Net.MonoChunkStream/State Body
      static System::Net::MonoChunkStream::State _get_Body();
      // Set static field: static public System.Net.MonoChunkStream/State Body
      static void _set_Body(System::Net::MonoChunkStream::State value);
      // static field const value: static public System.Net.MonoChunkStream/State BodyFinished
      static constexpr const int BodyFinished = 3;
      // Get static field: static public System.Net.MonoChunkStream/State BodyFinished
      static System::Net::MonoChunkStream::State _get_BodyFinished();
      // Set static field: static public System.Net.MonoChunkStream/State BodyFinished
      static void _set_BodyFinished(System::Net::MonoChunkStream::State value);
      // static field const value: static public System.Net.MonoChunkStream/State Trailer
      static constexpr const int Trailer = 4;
      // Get static field: static public System.Net.MonoChunkStream/State Trailer
      static System::Net::MonoChunkStream::State _get_Trailer();
      // Set static field: static public System.Net.MonoChunkStream/State Trailer
      static void _set_Trailer(System::Net::MonoChunkStream::State value);
    }; // System.Net.MonoChunkStream/State
    // System.Net.WebHeaderCollection headers
    // Offset: 0x10
    System::Net::WebHeaderCollection* headers;
    // private System.Int32 chunkSize
    // Offset: 0x18
    int chunkSize;
    // private System.Int32 chunkRead
    // Offset: 0x1C
    int chunkRead;
    // private System.Int32 totalWritten
    // Offset: 0x20
    int totalWritten;
    // private System.Net.MonoChunkStream/State state
    // Offset: 0x24
    System::Net::MonoChunkStream::State state;
    // private System.Text.StringBuilder saved
    // Offset: 0x28
    System::Text::StringBuilder* saved;
    // private System.Boolean sawCR
    // Offset: 0x30
    bool sawCR;
    // private System.Boolean gotit
    // Offset: 0x31
    bool gotit;
    // private System.Int32 trailerState
    // Offset: 0x34
    int trailerState;
    // private System.Collections.ArrayList chunks
    // Offset: 0x38
    System::Collections::ArrayList* chunks;
    // public System.Void .ctor(System.Byte[] buffer, System.Int32 offset, System.Int32 size, System.Net.WebHeaderCollection headers)
    // Offset: 0x1473820
    static MonoChunkStream* New_ctor(::Array<uint8_t>* buffer, int offset, int size, System::Net::WebHeaderCollection* headers);
    // public System.Void .ctor(System.Net.WebHeaderCollection headers)
    // Offset: 0x1473880
    static MonoChunkStream* New_ctor(System::Net::WebHeaderCollection* headers);
    // public System.Void ResetBuffer()
    // Offset: 0x1473978
    void ResetBuffer();
    // public System.Void WriteAndReadBack(System.Byte[] buffer, System.Int32 offset, System.Int32 size, ref System.Int32 read)
    // Offset: 0x14739AC
    void WriteAndReadBack(::Array<uint8_t>* buffer, int offset, int size, int& read);
    // public System.Int32 Read(System.Byte[] buffer, System.Int32 offset, System.Int32 size)
    // Offset: 0x1473A2C
    int Read(::Array<uint8_t>* buffer, int offset, int size);
    // private System.Int32 ReadFromChunks(System.Byte[] buffer, System.Int32 offset, System.Int32 size)
    // Offset: 0x1473A30
    int ReadFromChunks(::Array<uint8_t>* buffer, int offset, int size);
    // public System.Void Write(System.Byte[] buffer, System.Int32 offset, System.Int32 size)
    // Offset: 0x147394C
    void Write(::Array<uint8_t>* buffer, int offset, int size);
    // private System.Void InternalWrite(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x1473CF8
    void InternalWrite(::Array<uint8_t>* buffer, int& offset, int size);
    // public System.Boolean get_WantMore()
    // Offset: 0x1474680
    bool get_WantMore();
    // public System.Boolean get_DataAvailable()
    // Offset: 0x14746A8
    bool get_DataAvailable();
    // public System.Int32 get_ChunkLeft()
    // Offset: 0x14747B0
    int get_ChunkLeft();
    // private System.Net.MonoChunkStream/State ReadBody(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x1474130
    System::Net::MonoChunkStream::State ReadBody(::Array<uint8_t>* buffer, int& offset, int size);
    // private System.Net.MonoChunkStream/State GetChunkSize(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x1473E38
    System::Net::MonoChunkStream::State GetChunkSize(::Array<uint8_t>* buffer, int& offset, int size);
    // static private System.String RemoveChunkExtension(System.String input)
    // Offset: 0x1474864
    static ::Il2CppString* RemoveChunkExtension(::Il2CppString* input);
    // private System.Net.MonoChunkStream/State ReadCRLF(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x147426C
    System::Net::MonoChunkStream::State ReadCRLF(::Array<uint8_t>* buffer, int& offset, int size);
    // private System.Net.MonoChunkStream/State ReadTrailer(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x147437C
    System::Net::MonoChunkStream::State ReadTrailer(::Array<uint8_t>* buffer, int& offset, int size);
    // static private System.Void ThrowProtocolViolation(System.String message)
    // Offset: 0x14747F0
    static void ThrowProtocolViolation(::Il2CppString* message);
  }; // System.Net.MonoChunkStream
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Net::MonoChunkStream*, "System.Net", "MonoChunkStream");
DEFINE_IL2CPP_ARG_TYPE(System::Net::MonoChunkStream::State, "System.Net", "MonoChunkStream/State");
#pragma pack(pop)
