// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: ConnectionPool
  class ConnectionPool;
  // Forward declaring type: IPAddress
  class IPAddress;
  // Forward declaring type: GeneralAsyncDelegate
  class GeneralAsyncDelegate;
  // Forward declaring type: ServicePoint
  class ServicePoint;
  // Forward declaring type: BufferOffsetSize
  class BufferOffsetSize;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: WeakReference
  class WeakReference;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: NetworkStream
  class NetworkStream;
  // Forward declaring type: Socket
  class Socket;
  // Forward declaring type: SocketShutdown
  struct SocketShutdown;
  // Forward declaring type: SelectMode
  struct SelectMode;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: PooledStream
  class PooledStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::PooledStream);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::PooledStream*, "System.Net", "PooledStream");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.PooledStream
  // [TokenAttribute] Offset: FFFFFFFF
  class PooledStream : public ::System::IO::Stream {
    public:
    public:
    // private System.Boolean m_CheckLifetime
    // Size: 0x1
    // Offset: 0x28
    bool m_CheckLifetime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CheckLifetime and: m_Lifetime
    char __padding0[0x7] = {};
    // private System.TimeSpan m_Lifetime
    // Size: 0x8
    // Offset: 0x30
    ::System::TimeSpan m_Lifetime;
    // Field size check
    static_assert(sizeof(::System::TimeSpan) == 0x8);
    // private System.DateTime m_CreateTime
    // Size: 0x8
    // Offset: 0x38
    ::System::DateTime m_CreateTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.Boolean m_ConnectionIsDoomed
    // Size: 0x1
    // Offset: 0x40
    bool m_ConnectionIsDoomed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ConnectionIsDoomed and: m_ConnectionPool
    char __padding3[0x7] = {};
    // private System.Net.ConnectionPool m_ConnectionPool
    // Size: 0x8
    // Offset: 0x48
    ::System::Net::ConnectionPool* m_ConnectionPool;
    // Field size check
    static_assert(sizeof(::System::Net::ConnectionPool*) == 0x8);
    // private System.WeakReference m_Owner
    // Size: 0x8
    // Offset: 0x50
    ::System::WeakReference* m_Owner;
    // Field size check
    static_assert(sizeof(::System::WeakReference*) == 0x8);
    // private System.Int32 m_PooledCount
    // Size: 0x4
    // Offset: 0x58
    int m_PooledCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_Initalizing
    // Size: 0x1
    // Offset: 0x5C
    bool m_Initalizing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Initalizing and: m_ServerAddress
    char __padding7[0x3] = {};
    // private System.Net.IPAddress m_ServerAddress
    // Size: 0x8
    // Offset: 0x60
    ::System::Net::IPAddress* m_ServerAddress;
    // Field size check
    static_assert(sizeof(::System::Net::IPAddress*) == 0x8);
    // private System.Net.Sockets.NetworkStream m_NetworkStream
    // Size: 0x8
    // Offset: 0x68
    ::System::Net::Sockets::NetworkStream* m_NetworkStream;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::NetworkStream*) == 0x8);
    // private System.Net.Sockets.Socket m_AbortSocket
    // Size: 0x8
    // Offset: 0x70
    ::System::Net::Sockets::Socket* m_AbortSocket;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::Socket*) == 0x8);
    // private System.Net.Sockets.Socket m_AbortSocket6
    // Size: 0x8
    // Offset: 0x78
    ::System::Net::Sockets::Socket* m_AbortSocket6;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::Socket*) == 0x8);
    // private System.Boolean m_JustConnected
    // Size: 0x1
    // Offset: 0x80
    bool m_JustConnected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_JustConnected and: m_AsyncCallback
    char __padding12[0x7] = {};
    // private System.Net.GeneralAsyncDelegate m_AsyncCallback
    // Size: 0x8
    // Offset: 0x88
    ::System::Net::GeneralAsyncDelegate* m_AsyncCallback;
    // Field size check
    static_assert(sizeof(::System::Net::GeneralAsyncDelegate*) == 0x8);
    public:
    // Get instance field reference: private System.Boolean m_CheckLifetime
    [[deprecated("Use field access instead!")]] bool& dyn_m_CheckLifetime();
    // Get instance field reference: private System.TimeSpan m_Lifetime
    [[deprecated("Use field access instead!")]] ::System::TimeSpan& dyn_m_Lifetime();
    // Get instance field reference: private System.DateTime m_CreateTime
    [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_m_CreateTime();
    // Get instance field reference: private System.Boolean m_ConnectionIsDoomed
    [[deprecated("Use field access instead!")]] bool& dyn_m_ConnectionIsDoomed();
    // Get instance field reference: private System.Net.ConnectionPool m_ConnectionPool
