// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: EventArgs
  class EventArgs;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPHostEntry
  class IPHostEntry;
  // Forward declaring type: WebConnectionGroup
  class WebConnectionGroup;
  // Forward declaring type: BindIPEndPoint
  class BindIPEndPoint;
  // Forward declaring type: HttpWebRequest
  class HttpWebRequest;
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: Timer
  class Timer;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509Certificate
  class X509Certificate;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.ServicePoint
  // [TokenAttribute] Offset: FFFFFFFF
  class ServicePoint : public ::Il2CppObject {
    public:
    // private readonly System.Uri uri
    // Size: 0x8
    // Offset: 0x10
    System::Uri* uri;
    // Field size check
    static_assert(sizeof(System::Uri*) == 0x8);
    // private System.Int32 connectionLimit
    // Size: 0x4
    // Offset: 0x18
    int connectionLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 maxIdleTime
    // Size: 0x4
    // Offset: 0x1C
    int maxIdleTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 currentConnections
    // Size: 0x4
    // Offset: 0x20
    int currentConnections;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: currentConnections and: idleSince
    char __padding3[0x4] = {};
    // private System.DateTime idleSince
    // Size: 0x8
    // Offset: 0x28
    System::DateTime idleSince;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // private System.DateTime lastDnsResolve
    // Size: 0x8
    // Offset: 0x30
    System::DateTime lastDnsResolve;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // private System.Version protocolVersion
    // Size: 0x8
    // Offset: 0x38
    System::Version* protocolVersion;
    // Field size check
    static_assert(sizeof(System::Version*) == 0x8);
    // private System.Net.IPHostEntry host
    // Size: 0x8
    // Offset: 0x40
    System::Net::IPHostEntry* host;
    // Field size check
    static_assert(sizeof(System::Net::IPHostEntry*) == 0x8);
    // private System.Boolean usesProxy
    // Size: 0x1
    // Offset: 0x48
    bool usesProxy;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: usesProxy and: groups
    char __padding8[0x7] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,System.Net.WebConnectionGroup> groups
    // Size: 0x8
    // Offset: 0x50
    System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Net::WebConnectionGroup*>* groups;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Net::WebConnectionGroup*>*) == 0x8);
    // private System.Boolean sendContinue
    // Size: 0x1
    // Offset: 0x58
    bool sendContinue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean useConnect
    // Size: 0x1
    // Offset: 0x59
    bool useConnect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useConnect and: hostE
    char __padding11[0x6] = {};
    // private System.Object hostE
    // Size: 0x8
    // Offset: 0x60
    ::Il2CppObject* hostE;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean useNagle
    // Size: 0x1
    // Offset: 0x68
    bool useNagle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useNagle and: endPointCallback
    char __padding13[0x7] = {};
    // private System.Net.BindIPEndPoint endPointCallback
    // Size: 0x8
    // Offset: 0x70
    System::Net::BindIPEndPoint* endPointCallback;
    // Field size check
    static_assert(sizeof(System::Net::BindIPEndPoint*) == 0x8);
    // private System.Boolean tcp_keepalive
    // Size: 0x1
    // Offset: 0x78
    bool tcp_keepalive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tcp_keepalive and: tcp_keepalive_time
    char __padding15[0x3] = {};
    // private System.Int32 tcp_keepalive_time
    // Size: 0x4
    // Offset: 0x7C
    int tcp_keepalive_time;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 tcp_keepalive_interval
    // Size: 0x4
    // Offset: 0x80
    int tcp_keepalive_interval;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: tcp_keepalive_interval and: idleTimer
    char __padding17[0x4] = {};
    // private System.Threading.Timer idleTimer
    // Size: 0x8
    // Offset: 0x88
    System::Threading::Timer* idleTimer;
    // Field size check
    static_assert(sizeof(System::Threading::Timer*) == 0x8);
    // private System.Object m_ServerCertificateOrBytes
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppObject* m_ServerCertificateOrBytes;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object m_ClientCertificateOrBytes
    // Size: 0x8
    // Offset: 0x98
    ::Il2CppObject* m_ClientCertificateOrBytes;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // Creating value type constructor for type: ServicePoint
