// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IAsyncResult
#include "System/IAsyncResult.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: SimpleAsyncCallback
  class SimpleAsyncCallback;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
  // Forward declaring type: WaitHandle
  class WaitHandle;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Autogenerated type: System.Net.SimpleAsyncResult
  class SimpleAsyncResult : public ::Il2CppObject/*, public System::IAsyncResult*/ {
    public:
    // Nested type: System::Net::SimpleAsyncResult::$$c__DisplayClass9_0
    class $$c__DisplayClass9_0;
    // Nested type: System::Net::SimpleAsyncResult::$$c__DisplayClass11_0
    class $$c__DisplayClass11_0;
    // private System.Threading.ManualResetEvent handle
    // Offset: 0x10
    System::Threading::ManualResetEvent* handle;
    // private System.Boolean synch
    // Offset: 0x18
    bool synch;
    // private System.Boolean isCompleted
    // Offset: 0x19
    bool isCompleted;
    // private readonly System.Net.SimpleAsyncCallback cb
    // Offset: 0x20
    System::Net::SimpleAsyncCallback* cb;
    // private System.Object state
    // Offset: 0x28
    ::Il2CppObject* state;
    // private System.Boolean callbackDone
    // Offset: 0x30
    bool callbackDone;
    // private System.Exception exc
    // Offset: 0x38
    System::Exception* exc;
    // private System.Object locker
    // Offset: 0x40
    ::Il2CppObject* locker;
    // private System.Nullable`1<System.Boolean> user_read_synch
    // Offset: 0x48
    System::Nullable_1<bool> user_read_synch;
    // Creating interface conversion operator: operator System::IAsyncResult
    operator System::IAsyncResult() noexcept {
      return *reinterpret_cast<System::IAsyncResult*>(this);
    }
    // private System.Void .ctor(System.Net.SimpleAsyncCallback cb)
    // Offset: 0x10D0108
    static SimpleAsyncResult* New_ctor(System::Net::SimpleAsyncCallback* cb);
    // protected System.Void .ctor(System.AsyncCallback cb, System.Object state)
    // Offset: 0x10D0198
    static SimpleAsyncResult* New_ctor(System::AsyncCallback* cb, ::Il2CppObject* state);
    // static public System.Void Run(System.Func`2<System.Net.SimpleAsyncResult,System.Boolean> func, System.Net.SimpleAsyncCallback callback)
    // Offset: 0x10D02C0
    static void Run(System::Func_2<System::Net::SimpleAsyncResult*, bool>* func, System::Net::SimpleAsyncCallback* callback);
    // static public System.Void RunWithLock(System.Object locker, System.Func`2<System.Net.SimpleAsyncResult,System.Boolean> func, System.Net.SimpleAsyncCallback callback)
    // Offset: 0x10D0494
    static void RunWithLock(::Il2CppObject* locker, System::Func_2<System::Net::SimpleAsyncResult*, bool>* func, System::Net::SimpleAsyncCallback* callback);
    // protected System.Void Reset_internal()
    // Offset: 0x10D05B4
    void Reset_internal();
    // System.Void SetCompleted(System.Boolean synch, System.Exception e)
    // Offset: 0x10D0448
    void SetCompleted(bool synch, System::Exception* e);
    // System.Void SetCompleted(System.Boolean synch)
    // Offset: 0x10D03F8
    void SetCompleted(bool synch);
    // private System.Void SetCompleted_internal(System.Boolean synch, System.Exception e)
    // Offset: 0x10D0674
    void SetCompleted_internal(bool synch, System::Exception* e);
    // protected System.Void SetCompleted_internal(System.Boolean synch)
    // Offset: 0x10D0760
    void SetCompleted_internal(bool synch);
    // private System.Void DoCallback_private()
    // Offset: 0x10D073C
    void DoCallback_private();
    // protected System.Void DoCallback_internal()
    // Offset: 0x10D076C
    void DoCallback_internal();
    // System.Void WaitUntilComplete()
    // Offset: 0x10D0790
    void WaitUntilComplete();
    // System.Boolean WaitUntilComplete(System.Int32 timeout, System.Boolean exitContext)
    // Offset: 0x10D098C
    bool WaitUntilComplete(int timeout, bool exitContext);
    // System.Boolean get_CompletedSynchronouslyPeek()
    // Offset: 0x10D0AAC
    bool get_CompletedSynchronouslyPeek();
    // System.Boolean get_GotException()
    // Offset: 0x10D0AB4
    bool get_GotException();
    // System.Exception get_Exception()
    // Offset: 0x10D0AC4
    System::Exception* get_Exception();
    // public System.Object get_AsyncState()
    // Offset: 0x10D09F4
    // Implemented from: System.IAsyncResult
    // Base method: System.Object IAsyncResult::get_AsyncState()
    ::Il2CppObject* get_AsyncState();
    // Creating proxy method: System_IAsyncResult_get_AsyncState
    // Maps to method: get_AsyncState
    ::Il2CppObject* System_IAsyncResult_get_AsyncState();
    // public System.Threading.WaitHandle get_AsyncWaitHandle()
    // Offset: 0x10D0884
    // Implemented from: System.IAsyncResult
    // Base method: System.Threading.WaitHandle IAsyncResult::get_AsyncWaitHandle()
    System::Threading::WaitHandle* get_AsyncWaitHandle();
    // Creating proxy method: System_IAsyncResult_get_AsyncWaitHandle
    // Maps to method: get_AsyncWaitHandle
    System::Threading::WaitHandle* System_IAsyncResult_get_AsyncWaitHandle();
    // public System.Boolean get_CompletedSynchronously()
    // Offset: 0x10D09FC
    // Implemented from: System.IAsyncResult
    // Base method: System.Boolean IAsyncResult::get_CompletedSynchronously()
    bool get_CompletedSynchronously();
    // Creating proxy method: System_IAsyncResult_get_CompletedSynchronously
    // Maps to method: get_CompletedSynchronously
    bool System_IAsyncResult_get_CompletedSynchronously();
    // public System.Boolean get_IsCompleted()
    // Offset: 0x10D07D8
    // Implemented from: System.IAsyncResult
    // Base method: System.Boolean IAsyncResult::get_IsCompleted()
    bool get_IsCompleted();
    // Creating proxy method: System_IAsyncResult_get_IsCompleted
    // Maps to method: get_IsCompleted
    bool System_IAsyncResult_get_IsCompleted();
  }; // System.Net.SimpleAsyncResult
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Net::SimpleAsyncResult*, "System.Net", "SimpleAsyncResult");
#pragma pack(pop)
