// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Net.ReadState
#include "System/Net/ReadState.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: HttpWebRequest
  class HttpWebRequest;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Autogenerated type: System.Net.WebConnectionData
  class WebConnectionData : public ::Il2CppObject {
    public:
    // private System.Net.HttpWebRequest _request
    // Offset: 0x10
    System::Net::HttpWebRequest* request;
    // public System.Int32 StatusCode
    // Offset: 0x18
    int StatusCode;
    // public System.String StatusDescription
    // Offset: 0x20
    ::Il2CppString* StatusDescription;
    // public System.Net.WebHeaderCollection Headers
    // Offset: 0x28
    System::Net::WebHeaderCollection* Headers;
    // public System.Version Version
    // Offset: 0x30
    System::Version* Version;
    // public System.Version ProxyVersion
    // Offset: 0x38
    System::Version* ProxyVersion;
    // public System.IO.Stream stream
    // Offset: 0x40
    System::IO::Stream* stream;
    // public System.String[] Challenge
    // Offset: 0x48
    ::Array<::Il2CppString*>* Challenge;
    // private System.Net.ReadState _readState
    // Offset: 0x50
    System::Net::ReadState readState;
    // public System.Void .ctor(System.Net.HttpWebRequest request)
    // Offset: 0x121C890
    static WebConnectionData* New_ctor(System::Net::HttpWebRequest* request);
    // public System.Net.HttpWebRequest get_request()
    // Offset: 0x121F2A8
    System::Net::HttpWebRequest* get_request();
    // public System.Void set_request(System.Net.HttpWebRequest value)
    // Offset: 0x121F2B0
    void set_request(System::Net::HttpWebRequest* value);
    // public System.Net.ReadState get_ReadState()
    // Offset: 0x121F2B8
    System::Net::ReadState get_ReadState();
    // public System.Void set_ReadState(System.Net.ReadState value)
    // Offset: 0x121BBC0
    void set_ReadState(System::Net::ReadState value);
    // public System.Void .ctor()
    // Offset: 0x12187D4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static WebConnectionData* New_ctor();
  }; // System.Net.WebConnectionData
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Net::WebConnectionData*, "System.Net", "WebConnectionData");
#pragma pack(pop)
