// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: WebConnection
  class WebConnection;
  // Forward declaring type: HttpWebRequest
  class HttpWebRequest;
  // Forward declaring type: WebConnectionData
  class WebConnectionData;
  // Forward declaring type: SimpleAsyncCallback
  class SimpleAsyncCallback;
  // Forward declaring type: SimpleAsyncResult
  class SimpleAsyncResult;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: MemoryStream
  class MemoryStream;
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Size: 0xD2
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.WebConnectionStream
  class WebConnectionStream : public System::IO::Stream {
    public:
    // Nested type: System::Net::WebConnectionStream::$$c__DisplayClass75_0
    class $$c__DisplayClass75_0;
    // Nested type: System::Net::WebConnectionStream::$$c__DisplayClass76_0
    class $$c__DisplayClass76_0;
    // Nested type: System::Net::WebConnectionStream::$$c__DisplayClass80_0
    class $$c__DisplayClass80_0;
    // private System.Boolean isRead
    // Size: 0x1
    // Offset: 0x28
    bool isRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isRead and: cnc
    char __padding0[0x7] = {};
    // private System.Net.WebConnection cnc
    // Size: 0x8
    // Offset: 0x30
    System::Net::WebConnection* cnc;
    // Field size check
    static_assert(sizeof(System::Net::WebConnection*) == 0x8);
    // private System.Net.HttpWebRequest request
    // Size: 0x8
    // Offset: 0x38
    System::Net::HttpWebRequest* request;
    // Field size check
    static_assert(sizeof(System::Net::HttpWebRequest*) == 0x8);
    // private System.Byte[] readBuffer
    // Size: 0x8
    // Offset: 0x40
    ::Array<uint8_t>* readBuffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Int32 readBufferOffset
    // Size: 0x4
    // Offset: 0x48
    int readBufferOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 readBufferSize
    // Size: 0x4
    // Offset: 0x4C
    int readBufferSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 stream_length
    // Size: 0x4
    // Offset: 0x50
    int stream_length;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: stream_length and: contentLength
    char __padding6[0x4] = {};
    // private System.Int64 contentLength
    // Size: 0x8
    // Offset: 0x58
    int64_t contentLength;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 totalRead
    // Size: 0x8
    // Offset: 0x60
    int64_t totalRead;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Int64 totalWritten
    // Size: 0x8
    // Offset: 0x68
    int64_t totalWritten;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean nextReadCalled
    // Size: 0x1
    // Offset: 0x70
    bool nextReadCalled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: nextReadCalled and: pendingReads
    char __padding10[0x3] = {};
    // private System.Int32 pendingReads
    // Size: 0x4
    // Offset: 0x74
    int pendingReads;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 pendingWrites
    // Size: 0x4
    // Offset: 0x78
    int pendingWrites;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: pendingWrites and: pending
    char __padding12[0x4] = {};
    // private System.Threading.ManualResetEvent pending
    // Size: 0x8
    // Offset: 0x80
    System::Threading::ManualResetEvent* pending;
    // Field size check
    static_assert(sizeof(System::Threading::ManualResetEvent*) == 0x8);
    // private System.Boolean allowBuffering
    // Size: 0x1
    // Offset: 0x88
    bool allowBuffering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean sendChunked
    // Size: 0x1
    // Offset: 0x89
    bool sendChunked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sendChunked and: writeBuffer
    char __padding15[0x6] = {};
    // private System.IO.MemoryStream writeBuffer
    // Size: 0x8
    // Offset: 0x90
    System::IO::MemoryStream* writeBuffer;
    // Field size check
    static_assert(sizeof(System::IO::MemoryStream*) == 0x8);
    // private System.Boolean requestWritten
    // Size: 0x1
    // Offset: 0x98
    bool requestWritten;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: requestWritten and: headers
    char __padding17[0x7] = {};
    // private System.Byte[] headers
    // Size: 0x8
    // Offset: 0xA0
    ::Array<uint8_t>* headers;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Boolean disposed
    // Size: 0x1
    // Offset: 0xA8
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean headersSent
    // Size: 0x1
    // Offset: 0xA9
    bool headersSent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: headersSent and: locker
    char __padding20[0x6] = {};
    // private System.Object locker
    // Size: 0x8
    // Offset: 0xB0
    ::Il2CppObject* locker;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean initRead
    // Size: 0x1
    // Offset: 0xB8
    bool initRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean read_eof
    // Size: 0x1
    // Offset: 0xB9
    bool read_eof;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean complete_request_written
    // Size: 0x1
    // Offset: 0xBA
    bool complete_request_written;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: complete_request_written and: read_timeout
    char __padding24[0x1] = {};
    // private System.Int32 read_timeout
    // Size: 0x4
    // Offset: 0xBC
    int read_timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 write_timeout
    // Size: 0x4
    // Offset: 0xC0
    int write_timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: write_timeout and: cb_wrapper
    char __padding26[0x4] = {};
    // private System.AsyncCallback cb_wrapper
    // Size: 0x8
    // Offset: 0xC8
    System::AsyncCallback* cb_wrapper;
    // Field size check
    static_assert(sizeof(System::AsyncCallback*) == 0x8);
    // System.Boolean IgnoreIOErrors
    // Size: 0x1
    // Offset: 0xD0
    bool IgnoreIOErrors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xD889A4
    // private System.Boolean <GetResponseOnClose>k__BackingField
    // Size: 0x1
    // Offset: 0xD1
    bool GetResponseOnClose;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: WebConnectionStream
