// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Net.WebExceptionStatus
#include "System/Net/WebExceptionStatus.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: EventArgs
  class EventArgs;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: ServicePoint
  class ServicePoint;
  // Forward declaring type: IWebConnectionState
  class IWebConnectionState;
  // Forward declaring type: WebConnectionData
  class WebConnectionData;
  // Forward declaring type: MonoChunkStream
  class MonoChunkStream;
  // Forward declaring type: HttpWebRequest
  class HttpWebRequest;
  // Forward declaring type: NetworkCredential
  class NetworkCredential;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Queue
  class Queue;
}
// Forward declaring namespace: Mono::Net::Security
namespace Mono::Net::Security {
  // Forward declaring type: MonoTlsStream
  class MonoTlsStream;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.WebConnection
  class WebConnection : public ::Il2CppObject {
    public:
    // Nested type: System::Net::WebConnection::NtlmAuthState
    struct NtlmAuthState;
    // Nested type: System::Net::WebConnection::AbortHelper
    class AbortHelper;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.WebConnection/NtlmAuthState
    struct NtlmAuthState/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: NtlmAuthState
      constexpr NtlmAuthState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.WebConnection/NtlmAuthState None
      static constexpr const int None = 0;
      // Get static field: static public System.Net.WebConnection/NtlmAuthState None
      static System::Net::WebConnection::NtlmAuthState _get_None();
      // Set static field: static public System.Net.WebConnection/NtlmAuthState None
      static void _set_None(System::Net::WebConnection::NtlmAuthState value);
      // static field const value: static public System.Net.WebConnection/NtlmAuthState Challenge
      static constexpr const int Challenge = 1;
      // Get static field: static public System.Net.WebConnection/NtlmAuthState Challenge
      static System::Net::WebConnection::NtlmAuthState _get_Challenge();
      // Set static field: static public System.Net.WebConnection/NtlmAuthState Challenge
      static void _set_Challenge(System::Net::WebConnection::NtlmAuthState value);
      // static field const value: static public System.Net.WebConnection/NtlmAuthState Response
      static constexpr const int Response = 2;
      // Get static field: static public System.Net.WebConnection/NtlmAuthState Response
      static System::Net::WebConnection::NtlmAuthState _get_Response();
      // Set static field: static public System.Net.WebConnection/NtlmAuthState Response
      static void _set_Response(System::Net::WebConnection::NtlmAuthState value);
    }; // System.Net.WebConnection/NtlmAuthState
    #pragma pack(pop)
    static check_size<sizeof(WebConnection::NtlmAuthState), 0 + sizeof(int)> __System_Net_WebConnection_NtlmAuthStateSizeCheck;
    static_assert(sizeof(WebConnection::NtlmAuthState) == 0x4);
    // private System.Net.ServicePoint sPoint
    // Size: 0x8
    // Offset: 0x10
    System::Net::ServicePoint* sPoint;
    // Field size check
    static_assert(sizeof(System::Net::ServicePoint*) == 0x8);
    // private System.IO.Stream nstream
    // Size: 0x8
    // Offset: 0x18
    System::IO::Stream* nstream;
    // Field size check
    static_assert(sizeof(System::IO::Stream*) == 0x8);
    // System.Net.Sockets.Socket socket
    // Size: 0x8
    // Offset: 0x20
    System::Net::Sockets::Socket* socket;
    // Field size check
    static_assert(sizeof(System::Net::Sockets::Socket*) == 0x8);
    // private System.Object socketLock
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* socketLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Net.IWebConnectionState state
    // Size: 0x8
    // Offset: 0x30
    System::Net::IWebConnectionState* state;
    // Field size check
    static_assert(sizeof(System::Net::IWebConnectionState*) == 0x8);
    // private System.Net.WebExceptionStatus status
    // Size: 0x4
    // Offset: 0x38
    System::Net::WebExceptionStatus status;
    // Field size check
    static_assert(sizeof(System::Net::WebExceptionStatus) == 0x4);
    // private System.Boolean keepAlive
    // Size: 0x1
    // Offset: 0x3C
    bool keepAlive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: keepAlive and: buffer
    char __padding6[0x3] = {};
    // private System.Byte[] buffer
    // Size: 0x8
    // Offset: 0x40
    ::Array<uint8_t>* buffer;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.EventHandler abortHandler
    // Size: 0x8
    // Offset: 0x48
    System::EventHandler* abortHandler;
    // Field size check
    static_assert(sizeof(System::EventHandler*) == 0x8);
    // private System.Net.WebConnection/AbortHelper abortHelper
    // Size: 0x8
    // Offset: 0x50
    System::Net::WebConnection::AbortHelper* abortHelper;
    // Field size check
    static_assert(sizeof(System::Net::WebConnection::AbortHelper*) == 0x8);
    // System.Net.WebConnectionData Data
    // Size: 0x8
    // Offset: 0x58
    System::Net::WebConnectionData* Data;
    // Field size check
    static_assert(sizeof(System::Net::WebConnectionData*) == 0x8);
    // private System.Boolean chunkedRead
    // Size: 0x1
    // Offset: 0x60
    bool chunkedRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: chunkedRead and: chunkStream
    char __padding11[0x7] = {};
    // private System.Net.MonoChunkStream chunkStream
    // Size: 0x8
    // Offset: 0x68
    System::Net::MonoChunkStream* chunkStream;
    // Field size check
    static_assert(sizeof(System::Net::MonoChunkStream*) == 0x8);
    // private System.Collections.Queue queue
    // Size: 0x8
    // Offset: 0x70
    System::Collections::Queue* queue;
    // Field size check
    static_assert(sizeof(System::Collections::Queue*) == 0x8);
    // private System.Boolean reused
    // Size: 0x1
    // Offset: 0x78
    bool reused;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: reused and: position
    char __padding14[0x3] = {};
    // private System.Int32 position
    // Size: 0x4
    // Offset: 0x7C
    int position;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Net.HttpWebRequest priority_request
    // Size: 0x8
    // Offset: 0x80
    System::Net::HttpWebRequest* priority_request;
    // Field size check
    static_assert(sizeof(System::Net::HttpWebRequest*) == 0x8);
    // private System.Net.NetworkCredential ntlm_credentials
    // Size: 0x8
    // Offset: 0x88
    System::Net::NetworkCredential* ntlm_credentials;
    // Field size check
    static_assert(sizeof(System::Net::NetworkCredential*) == 0x8);
    // private System.Boolean ntlm_authenticated
    // Size: 0x1
    // Offset: 0x90
    bool ntlm_authenticated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean unsafe_sharing
    // Size: 0x1
    // Offset: 0x91
    bool unsafe_sharing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: unsafe_sharing and: connect_ntlm_auth_state
    char __padding19[0x2] = {};
    // private System.Net.WebConnection/NtlmAuthState connect_ntlm_auth_state
    // Size: 0x4
    // Offset: 0x94
    System::Net::WebConnection::NtlmAuthState connect_ntlm_auth_state;
    // Field size check
    static_assert(sizeof(System::Net::WebConnection::NtlmAuthState) == 0x4);
    // private System.Net.HttpWebRequest connect_request
    // Size: 0x8
    // Offset: 0x98
    System::Net::HttpWebRequest* connect_request;
    // Field size check
    static_assert(sizeof(System::Net::HttpWebRequest*) == 0x8);
    // private System.Exception connect_exception
    // Size: 0x8
    // Offset: 0xA0
    System::Exception* connect_exception;
    // Field size check
    static_assert(sizeof(System::Exception*) == 0x8);
    // private Mono.Net.Security.MonoTlsStream tlsStream
    // Size: 0x8
    // Offset: 0xA8
    Mono::Net::Security::MonoTlsStream* tlsStream;
    // Field size check
    static_assert(sizeof(Mono::Net::Security::MonoTlsStream*) == 0x8);
    // Creating value type constructor for type: WebConnection
