// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ComponentModel.Component
#include "System/ComponentModel/Component.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: ICredentials
  class ICredentials;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Forward declaring type: WebResponse
  class WebResponse;
  // Forward declaring type: WebRequest
  class WebRequest;
  // Forward declaring type: IWebProxy
  class IWebProxy;
  // Forward declaring type: OpenReadCompletedEventHandler
  class OpenReadCompletedEventHandler;
  // Forward declaring type: OpenWriteCompletedEventHandler
  class OpenWriteCompletedEventHandler;
  // Forward declaring type: DownloadStringCompletedEventHandler

  // Forward declaring type: UploadDataCompletedEventArgs
  class UploadDataCompletedEventArgs;
  // Forward declaring type: UploadFileCompletedEventArgs
  class UploadFileCompletedEventArgs;
  // Forward declaring type: UploadValuesCompletedEventArgs
  class UploadValuesCompletedEventArgs;
  // Forward declaring type: DownloadProgressChangedEventArgs
  class DownloadProgressChangedEventArgs;
  // Forward declaring type: UploadProgressChangedEventArgs
  class UploadProgressChangedEventArgs;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: String
  class String;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: System::Collections::Specialized
namespace System::Collections::Specialized {
  // Forward declaring type: NameValueCollection
  class NameValueCollection;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System::Net::Cache
namespace System::Net::Cache {
  // Forward declaring type: RequestCachePolicy
  class RequestCachePolicy;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: AsyncOperation
  class AsyncOperation;
  // Forward declaring type: AsyncCompletedEventHandler
  class AsyncCompletedEventHandler;
  // Forward declaring type: AsyncCompletedEventArgs
  class AsyncCompletedEventArgs;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: SendOrPostCallback
  class SendOrPostCallback;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: FileStream
  class FileStream;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
  // Forward declaring type: TaskCompletionSource`1<TResult>
  template<typename TResult>
  class TaskCompletionSource_1;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: WebClient
  class WebClient;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::WebClient);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::WebClient*, "System.Net", "WebClient");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x158
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.WebClient
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: 8FFCC4
  class WebClient : public ::System::ComponentModel::Component {
    public:
    // Nested type: ::System::Net::WebClient::ProgressData
    class ProgressData;
    // Nested type: ::System::Net::WebClient::DownloadBitsState
    class DownloadBitsState;
    // Nested type: ::System::Net::WebClient::UploadBitsState
    class UploadBitsState;
    // Nested type: ::System::Net::WebClient::WebClientWriteStream
    class WebClientWriteStream;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass219_0
    class $$c__DisplayClass219_0;
    // Nested type: ::System::Net::WebClient::$$c
    class $$c;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass221_0
    class $$c__DisplayClass221_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass225_0
    class $$c__DisplayClass225_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass229_0
    class $$c__DisplayClass229_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass231_0
    class $$c__DisplayClass231_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass233_0
    class $$c__DisplayClass233_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass237_0
    class $$c__DisplayClass237_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass241_0
    class $$c__DisplayClass241_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass245_0
    class $$c__DisplayClass245_0;
    public:
    // private System.Uri m_baseAddress
    // Size: 0x8
    // Offset: 0x28
    ::System::Uri* m_baseAddress;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Net.ICredentials m_credentials
    // Size: 0x8
    // Offset: 0x30
    ::System::Net::ICredentials* m_credentials;
    // Field size check
    static_assert(sizeof(::System::Net::ICredentials*) == 0x8);
    // private System.Net.WebHeaderCollection m_headers
    // Size: 0x8
    // Offset: 0x38
    ::System::Net::WebHeaderCollection* m_headers;
    // Field size check
    static_assert(sizeof(::System::Net::WebHeaderCollection*) == 0x8);
    // private System.Collections.Specialized.NameValueCollection m_requestParameters
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Specialized::NameValueCollection* m_requestParameters;
    // Field size check
    static_assert(sizeof(::System::Collections::Specialized::NameValueCollection*) == 0x8);
    // private System.Net.WebResponse m_WebResponse
    // Size: 0x8
    // Offset: 0x48
    ::System::Net::WebResponse* m_WebResponse;
    // Field size check
    static_assert(sizeof(::System::Net::WebResponse*) == 0x8);
    // private System.Net.WebRequest m_WebRequest
    // Size: 0x8
    // Offset: 0x50
    ::System::Net::WebRequest* m_WebRequest;
    // Field size check
    static_assert(sizeof(::System::Net::WebRequest*) == 0x8);
    // private System.Text.Encoding m_Encoding
    // Size: 0x8
    // Offset: 0x58
    ::System::Text::Encoding* m_Encoding;
    // Field size check
    static_assert(sizeof(::System::Text::Encoding*) == 0x8);
    // private System.String m_Method
    // Size: 0x8
    // Offset: 0x60
    ::StringW m_Method;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int64 m_ContentLength
    // Size: 0x8
    // Offset: 0x68
    int64_t m_ContentLength;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean m_InitWebClientAsync
    // Size: 0x1
    // Offset: 0x70
    bool m_InitWebClientAsync;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Cancelled
    // Size: 0x1
    // Offset: 0x71
    bool m_Cancelled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Cancelled and: m_Progress
    char __padding10[0x6] = {};
    // private System.Net.WebClient/System.Net.ProgressData m_Progress
    // Size: 0x8
    // Offset: 0x78
    ::System::Net::WebClient::ProgressData* m_Progress;
    // Field size check
    static_assert(sizeof(::System::Net::WebClient::ProgressData*) == 0x8);
    // private System.Net.IWebProxy m_Proxy
    // Size: 0x8
    // Offset: 0x80
    ::System::Net::IWebProxy* m_Proxy;
    // Field size check
    static_assert(sizeof(::System::Net::IWebProxy*) == 0x8);
    // private System.Boolean m_ProxySet
    // Size: 0x1
    // Offset: 0x88
    bool m_ProxySet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ProxySet and: m_CachePolicy
    char __padding13[0x7] = {};
    // private System.Net.Cache.RequestCachePolicy m_CachePolicy
    // Size: 0x8
    // Offset: 0x90
    ::System::Net::Cache::RequestCachePolicy* m_CachePolicy;
    // Field size check
    static_assert(sizeof(::System::Net::Cache::RequestCachePolicy*) == 0x8);
    // private System.Boolean <AllowReadStreamBuffering>k__BackingField
    // Size: 0x1
    // Offset: 0x98
    bool AllowReadStreamBuffering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <AllowWriteStreamBuffering>k__BackingField
    // Size: 0x1
    // Offset: 0x99
    bool AllowWriteStreamBuffering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AllowWriteStreamBuffering and: m_CallNesting
    char __padding16[0x2] = {};
    // private System.Int32 m_CallNesting
    // Size: 0x4
    // Offset: 0x9C
    int m_CallNesting;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.ComponentModel.AsyncOperation m_AsyncOp
    // Size: 0x8
    // Offset: 0xA0
    ::System::ComponentModel::AsyncOperation* m_AsyncOp;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::AsyncOperation*) == 0x8);
    // private System.Net.OpenReadCompletedEventHandler OpenReadCompleted
    // Size: 0x8
    // Offset: 0xA8
    ::System::Net::OpenReadCompletedEventHandler* OpenReadCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::OpenReadCompletedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback openReadOperationCompleted
    // Size: 0x8
    // Offset: 0xB0
    ::System::Threading::SendOrPostCallback* openReadOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Net.OpenWriteCompletedEventHandler OpenWriteCompleted
    // Size: 0x8
    // Offset: 0xB8
    ::System::Net::OpenWriteCompletedEventHandler* OpenWriteCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::OpenWriteCompletedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback openWriteOperationCompleted
    // Size: 0x8
    // Offset: 0xC0
    ::System::Threading::SendOrPostCallback* openWriteOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Net.DownloadStringCompletedEventHandler DownloadStringCompleted
    // Size: 0x8
    // Offset: 0xC8
    ::System::Net::DownloadStringCompletedEventHandler* DownloadStringCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::DownloadStringCompletedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback downloadStringOperationCompleted
    // Size: 0x8
    // Offset: 0xD0
    ::System::Threading::SendOrPostCallback* downloadStringOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Net.DownloadDataCompletedEventHandler DownloadDataCompleted
    // Size: 0x8
    // Offset: 0xD8
    ::System::Net::DownloadDataCompletedEventHandler* DownloadDataCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::DownloadDataCompletedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback downloadDataOperationCompleted
    // Size: 0x8
    // Offset: 0xE0
    ::System::Threading::SendOrPostCallback* downloadDataOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.ComponentModel.AsyncCompletedEventHandler DownloadFileCompleted
    // Size: 0x8
    // Offset: 0xE8
    ::System::ComponentModel::AsyncCompletedEventHandler* DownloadFileCompleted;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::AsyncCompletedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback downloadFileOperationCompleted
    // Size: 0x8
    // Offset: 0xF0
    ::System::Threading::SendOrPostCallback* downloadFileOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Net.UploadStringCompletedEventHandler UploadStringCompleted
    // Size: 0x8
    // Offset: 0xF8
    ::System::Net::UploadStringCompletedEventHandler* UploadStringCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::UploadStringCompletedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback uploadStringOperationCompleted
    // Size: 0x8
    // Offset: 0x100
    ::System::Threading::SendOrPostCallback* uploadStringOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Net.UploadDataCompletedEventHandler UploadDataCompleted
    // Size: 0x8
    // Offset: 0x108
    ::System::Net::UploadDataCompletedEventHandler* UploadDataCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::UploadDataCompletedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback uploadDataOperationCompleted
    // Size: 0x8
    // Offset: 0x110
    ::System::Threading::SendOrPostCallback* uploadDataOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Net.UploadFileCompletedEventHandler UploadFileCompleted
    // Size: 0x8
    // Offset: 0x118
    ::System::Net::UploadFileCompletedEventHandler* UploadFileCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::UploadFileCompletedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback uploadFileOperationCompleted
    // Size: 0x8
    // Offset: 0x120
    ::System::Threading::SendOrPostCallback* uploadFileOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Net.UploadValuesCompletedEventHandler UploadValuesCompleted
    // Size: 0x8
    // Offset: 0x128
    ::System::Net::UploadValuesCompletedEventHandler* UploadValuesCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::UploadValuesCompletedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback uploadValuesOperationCompleted
    // Size: 0x8
    // Offset: 0x130
    ::System::Threading::SendOrPostCallback* uploadValuesOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Net.DownloadProgressChangedEventHandler DownloadProgressChanged
    // Size: 0x8
    // Offset: 0x138
    ::System::Net::DownloadProgressChangedEventHandler* DownloadProgressChanged;
    // Field size check
    static_assert(sizeof(::System::Net::DownloadProgressChangedEventHandler*) == 0x8);
    // private System.Net.UploadProgressChangedEventHandler UploadProgressChanged
    // Size: 0x8
    // Offset: 0x140
    ::System::Net::UploadProgressChangedEventHandler* UploadProgressChanged;
    // Field size check
    static_assert(sizeof(::System::Net::UploadProgressChangedEventHandler*) == 0x8);
    // private System.Threading.SendOrPostCallback reportDownloadProgressChanged
    // Size: 0x8
    // Offset: 0x148
    ::System::Threading::SendOrPostCallback* reportDownloadProgressChanged;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback reportUploadProgressChanged
    // Size: 0x8
    // Offset: 0x150
    ::System::Threading::SendOrPostCallback* reportUploadProgressChanged;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    public:
    // static field const value: static private System.Int32 DefaultCopyBufferLength
    static constexpr const int DefaultCopyBufferLength = 8192;
    // Get static field: static private System.Int32 DefaultCopyBufferLength
    static int _get_DefaultCopyBufferLength();
    // Set static field: static private System.Int32 DefaultCopyBufferLength
    static void _set_DefaultCopyBufferLength(int value);
    // static field const value: static private System.Int32 DefaultDownloadBufferLength
    static constexpr const int DefaultDownloadBufferLength = 65536;
    // Get static field: static private System.Int32 DefaultDownloadBufferLength
    static int _get_DefaultDownloadBufferLength();
    // Set static field: static private System.Int32 DefaultDownloadBufferLength
