// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Net.IWebProxy
#include "System/Net/IWebProxy.hpp"
// Including type: System.Runtime.Serialization.ISerializable
#include "System/Runtime/Serialization/ISerializable.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: ICredentials
  class ICredentials;
  // Forward declaring type: AutoWebProxyScriptEngine
  class AutoWebProxyScriptEngine;
}
// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: Regex
  class Regex;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Autogenerated type: System.Net.WebProxy
  class WebProxy : public ::Il2CppObject/*, public System::Net::IWebProxy, public System::Runtime::Serialization::ISerializable*/ {
    public:
    // private System.Boolean _UseRegistry
    // Offset: 0x10
    bool UseRegistry;
    // private System.Boolean _BypassOnLocal
    // Offset: 0x11
    bool BypassOnLocal;
    // private System.Boolean m_EnableAutoproxy
    // Offset: 0x12
    bool m_EnableAutoproxy;
    // private System.Uri _ProxyAddress
    // Offset: 0x18
    System::Uri* ProxyAddress;
    // private System.Collections.ArrayList _BypassList
    // Offset: 0x20
    System::Collections::ArrayList* BypassList;
    // private System.Net.ICredentials _Credentials
    // Offset: 0x28
    System::Net::ICredentials* Credentials;
    // private System.Text.RegularExpressions.Regex[] _RegExBypassList
    // Offset: 0x30
    ::Array<System::Text::RegularExpressions::Regex*>* RegExBypassList;
    // private System.Collections.Hashtable _ProxyHostAddresses
    // Offset: 0x38
    System::Collections::Hashtable* ProxyHostAddresses;
    // private System.Net.AutoWebProxyScriptEngine m_ScriptEngine
    // Offset: 0x40
    System::Net::AutoWebProxyScriptEngine* m_ScriptEngine;
    // Creating interface conversion operator: operator System::Net::IWebProxy
    operator System::Net::IWebProxy() noexcept {
      return *reinterpret_cast<System::Net::IWebProxy*>(this);
    }
    // Creating interface conversion operator: operator System::Runtime::Serialization::ISerializable
    operator System::Runtime::Serialization::ISerializable() noexcept {
      return *reinterpret_cast<System::Runtime::Serialization::ISerializable*>(this);
    }
    // public System.Void .ctor(System.Uri Address, System.Boolean BypassOnLocal, System.String[] BypassList, System.Net.ICredentials Credentials)
    // Offset: 0x1226178
    static WebProxy* New_ctor(System::Uri* Address, bool BypassOnLocal, ::Array<::Il2CppString*>* BypassList, System::Net::ICredentials* Credentials);
    // public System.Boolean get_UseDefaultCredentials()
    // Offset: 0x12264D8
    bool get_UseDefaultCredentials();
    // public System.Void set_UseDefaultCredentials(System.Boolean value)
    // Offset: 0x122655C
    void set_UseDefaultCredentials(bool value);
    // private System.Void UpdateRegExList(System.Boolean canThrow)
    // Offset: 0x1226258
    void UpdateRegExList(bool canThrow);
    // private System.Boolean IsMatchInBypassList(System.Uri input)
    // Offset: 0x1226A28
    bool IsMatchInBypassList(System::Uri* input);
    // private System.Boolean IsLocal(System.Uri host)
    // Offset: 0x1226BC0
    bool IsLocal(System::Uri* host);
    // private System.Boolean IsLocalInProxyHash(System.Uri host)
    // Offset: 0x1226D30
    bool IsLocalInProxyHash(System::Uri* host);
    // private System.Boolean IsBypassedManual(System.Uri host)
    // Offset: 0x1226944
    bool IsBypassedManual(System::Uri* host);
    // protected System.Void .ctor(System.Runtime.Serialization.SerializationInfo serializationInfo, System.Runtime.Serialization.StreamingContext streamingContext)
    // Offset: 0x122704C
    static WebProxy* New_ctor(System::Runtime::Serialization::SerializationInfo* serializationInfo, System::Runtime::Serialization::StreamingContext streamingContext);
    // protected System.Void GetObjectData(System.Runtime.Serialization.SerializationInfo serializationInfo, System.Runtime.Serialization.StreamingContext streamingContext)
    // Offset: 0x1227344
    void GetObjectData(System::Runtime::Serialization::SerializationInfo* serializationInfo, System::Runtime::Serialization::StreamingContext streamingContext);
    // System.Net.AutoWebProxyScriptEngine get_ScriptEngine()
    // Offset: 0x1227440
    System::Net::AutoWebProxyScriptEngine* get_ScriptEngine();
    // static public System.Net.IWebProxy CreateDefaultProxy()
    // Offset: 0x1227448
    static System::Net::IWebProxy* CreateDefaultProxy();
    // System.Void .ctor(System.Boolean enableAutoproxy)
    // Offset: 0x12274B0
    static WebProxy* New_ctor(bool enableAutoproxy);
    // System.Void UnsafeUpdateFromRegistry()
    // Offset: 0x122732C
    void UnsafeUpdateFromRegistry();
    // private System.Boolean GetProxyAuto(System.Uri destination, out System.Uri proxyUri)
    // Offset: 0x1226788
    bool GetProxyAuto(System::Uri* destination, System::Uri*& proxyUri);
    // private System.Boolean IsBypassedAuto(System.Uri destination, out System.Boolean isBypassed)
    // Offset: 0x1226F2C
    bool IsBypassedAuto(System::Uri* destination, bool& isBypassed);
    // static private System.Boolean AreAllBypassed(System.Collections.Generic.IEnumerable`1<System.String> proxies, System.Boolean checkFirstOnly)
    // Offset: 0x12274E8
    static bool AreAllBypassed(System::Collections::Generic::IEnumerable_1<::Il2CppString*>* proxies, bool checkFirstOnly);
    // static private System.Uri ProxyUri(System.String proxyName)
    // Offset: 0x122779C
    static System::Uri* ProxyUri(::Il2CppString* proxyName);
    // public System.Void .ctor()
    // Offset: 0x1226164
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static WebProxy* New_ctor();
    // public System.Net.ICredentials get_Credentials()
    // Offset: 0x12264D0
    // Implemented from: System.Net.IWebProxy
    // Base method: System.Net.ICredentials IWebProxy::get_Credentials()
    System::Net::ICredentials* get_Credentials();
    // public System.Uri GetProxy(System.Uri destination)
    // Offset: 0x12265E8
    // Implemented from: System.Net.IWebProxy
    // Base method: System.Uri IWebProxy::GetProxy(System.Uri destination)
    System::Uri* GetProxy(System::Uri* destination);
    // public System.Boolean IsBypassed(System.Uri host)
    // Offset: 0x1226E38
    // Implemented from: System.Net.IWebProxy
    // Base method: System.Boolean IWebProxy::IsBypassed(System.Uri host)
    bool IsBypassed(System::Uri* host);
    // private System.Void System.Runtime.Serialization.ISerializable.GetObjectData(System.Runtime.Serialization.SerializationInfo serializationInfo, System.Runtime.Serialization.StreamingContext streamingContext)
    // Offset: 0x1227338
    // Implemented from: System.Runtime.Serialization.ISerializable
    // Base method: System.Void ISerializable::GetObjectData(System.Runtime.Serialization.SerializationInfo serializationInfo, System.Runtime.Serialization.StreamingContext streamingContext)
    void System_Runtime_Serialization_ISerializable_GetObjectData(System::Runtime::Serialization::SerializationInfo* serializationInfo, System::Runtime::Serialization::StreamingContext streamingContext);
  }; // System.Net.WebProxy
  check_size<sizeof(WebProxy), 64 + sizeof(void*) + 8 - (64 + sizeof(void*)) % 8> __System_Net_WebProxySizeCheck;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Net::WebProxy*, "System.Net", "WebProxy");
#pragma pack(pop)
