// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x10
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: HoudiniEngineUnity.HAPI_HandleBindingInfo
  // [TokenAttribute] Offset: FFFFFFFF
  struct HAPI_HandleBindingInfo/*, public System::ValueType*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // public System.Int32 handleParmNameSH
    // Size: 0x4
    // Offset: 0x0
    int handleParmNameSH;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 assetParmNameSH
    // Size: 0x4
    // Offset: 0x4
    int assetParmNameSH;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 assetParmId
    // Size: 0x4
    // Offset: 0x8
    int assetParmId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 assetParmIndex
    // Size: 0x4
    // Offset: 0xC
    int assetParmIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: HAPI_HandleBindingInfo
    constexpr HAPI_HandleBindingInfo(int handleParmNameSH_ = {}, int assetParmNameSH_ = {}, int assetParmId_ = {}, int assetParmIndex_ = {}) noexcept : handleParmNameSH{handleParmNameSH_}, assetParmNameSH{assetParmNameSH_}, assetParmId{assetParmId_}, assetParmIndex{assetParmIndex_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field reference: public System.Int32 handleParmNameSH
    int& dyn_handleParmNameSH();
    // Get instance field reference: public System.Int32 assetParmNameSH
    int& dyn_assetParmNameSH();
    // Get instance field reference: public System.Int32 assetParmId
    int& dyn_assetParmId();
    // Get instance field reference: public System.Int32 assetParmIndex
    int& dyn_assetParmIndex();
  }; // HoudiniEngineUnity.HAPI_HandleBindingInfo
  #pragma pack(pop)
  static check_size<sizeof(HAPI_HandleBindingInfo), 12 + sizeof(int)> __HoudiniEngineUnity_HAPI_HandleBindingInfoSizeCheck;
  static_assert(sizeof(HAPI_HandleBindingInfo) == 0x10);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(HoudiniEngineUnity::HAPI_HandleBindingInfo, "HoudiniEngineUnity", "HAPI_HandleBindingInfo");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
