// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: HoudiniEngineUnity.HAPI_RSTOrder
#include "HoudiniEngineUnity/HAPI_RSTOrder.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x24
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: HoudiniEngineUnity.HAPI_Transform
  // [TokenAttribute] Offset: FFFFFFFF
  struct HAPI_Transform/*, public System::ValueType*/ {
    public:
    // public System.Single[] position
    // Size: 0x8
    // Offset: 0x0
    ::ArrayWrapper<float> position;
    // Field size check
    static_assert(sizeof(::ArrayWrapper<float>) == 0x8);
    // public System.Single[] rotationQuaternion
    // Size: 0x8
    // Offset: 0x8
    ::ArrayWrapper<float> rotationQuaternion;
    // Field size check
    static_assert(sizeof(::ArrayWrapper<float>) == 0x8);
    // public System.Single[] scale
    // Size: 0x8
    // Offset: 0x10
    ::ArrayWrapper<float> scale;
    // Field size check
    static_assert(sizeof(::ArrayWrapper<float>) == 0x8);
    // public System.Single[] shear
    // Size: 0x8
    // Offset: 0x18
    ::ArrayWrapper<float> shear;
    // Field size check
    static_assert(sizeof(::ArrayWrapper<float>) == 0x8);
    // public HoudiniEngineUnity.HAPI_RSTOrder rstOrder
    // Size: 0x4
    // Offset: 0x20
    HoudiniEngineUnity::HAPI_RSTOrder rstOrder;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_RSTOrder) == 0x4);
    // Creating value type constructor for type: HAPI_Transform
    constexpr HAPI_Transform(::ArrayWrapper<float> position_ = {nullptr}, ::ArrayWrapper<float> rotationQuaternion_ = {nullptr}, ::ArrayWrapper<float> scale_ = {nullptr}, ::ArrayWrapper<float> shear_ = {nullptr}, HoudiniEngineUnity::HAPI_RSTOrder rstOrder_ = {}) noexcept : position{position_}, rotationQuaternion{rotationQuaternion_}, scale{scale_}, shear{shear_}, rstOrder{rstOrder_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field reference: public System.Single[] position
    ::ArrayWrapper<float>& dyn_position();
    // Get instance field reference: public System.Single[] rotationQuaternion
    ::ArrayWrapper<float>& dyn_rotationQuaternion();
    // Get instance field reference: public System.Single[] scale
    ::ArrayWrapper<float>& dyn_scale();
    // Get instance field reference: public System.Single[] shear
    ::ArrayWrapper<float>& dyn_shear();
    // Get instance field reference: public HoudiniEngineUnity.HAPI_RSTOrder rstOrder
    HoudiniEngineUnity::HAPI_RSTOrder& dyn_rstOrder();
    // public System.Void .ctor(System.Boolean initializeFields)
    // Offset: 0x1439B90
    HAPI_Transform(bool initializeFields) {
      static auto ___internal__logger = ::Logger::get().WithContext("HoudiniEngineUnity::HAPI_Transform::.ctor");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(*this, ".ctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(initializeFields)})));
      ::il2cpp_utils::RunMethodThrow<void, false>(*this, ___internal__method, initializeFields);
    }
    // public System.Void Init()
    // Offset: 0x1439C44
    void Init();
  }; // HoudiniEngineUnity.HAPI_Transform
  #pragma pack(pop)
  static check_size<sizeof(HAPI_Transform), 32 + sizeof(HoudiniEngineUnity::HAPI_RSTOrder)> __HoudiniEngineUnity_HAPI_TransformSizeCheck;
  static_assert(sizeof(HAPI_Transform) == 0x24);
}
DEFINE_IL2CPP_ARG_TYPE(HoudiniEngineUnity::HAPI_Transform, "HoudiniEngineUnity", "HAPI_Transform");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: HoudiniEngineUnity::HAPI_Transform::HAPI_Transform
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: HoudiniEngineUnity::HAPI_Transform::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (HoudiniEngineUnity::HAPI_Transform::*)()>(&HoudiniEngineUnity::HAPI_Transform::Init)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(HoudiniEngineUnity::HAPI_Transform), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
