// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: HoudiniEngineUnity.IEquivable`1
#include "HoudiniEngineUnity/IEquivable_1.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_InputObjectInfo
  class HEU_InputObjectInfo;
  // Forward declaring type: HEU_InputHDAInfo
  class HEU_InputHDAInfo;
  // Forward declaring type: HEU_HoudiniAsset
  class HEU_HoudiniAsset;
  // Forward declaring type: HEU_InputInterfaceTilemapSettings
  class HEU_InputInterfaceTilemapSettings;
  // Forward declaring type: HEU_InputNodeUICache
  class HEU_InputNodeUICache;
  // Skipping declaration: InputNodeType because it is already included!
  // Skipping declaration: InputObjectType because it is already included!
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
  // Forward declaring type: HEU_InputPreset
  class HEU_InputPreset;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_InputNode
  class HEU_InputNode;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::HoudiniEngineUnity::HEU_InputNode);
DEFINE_IL2CPP_ARG_TYPE(::HoudiniEngineUnity::HEU_InputNode*, "HoudiniEngineUnity", "HEU_InputNode");
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_InputNode
  // [TokenAttribute] Offset: FFFFFFFF
  class HEU_InputNode : public ::UnityEngine::ScriptableObject/*, public ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_InputNode*>*/ {
    public:
    // Nested type: ::HoudiniEngineUnity::HEU_InputNode::InputNodeType
    struct InputNodeType;
    // Nested type: ::HoudiniEngineUnity::HEU_InputNode::InputObjectType
    struct InputObjectType;
    // Nested type: ::HoudiniEngineUnity::HEU_InputNode::InternalObjectType
    struct InternalObjectType;
    // Nested type: ::HoudiniEngineUnity::HEU_InputNode::InputActions
    struct InputActions;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputNodeType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputNodeType
      constexpr InputNodeType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType CONNECTION
      static constexpr const int CONNECTION = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType CONNECTION
      static ::HoudiniEngineUnity::HEU_InputNode::InputNodeType _get_CONNECTION();
      // Set static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType CONNECTION
      static void _set_CONNECTION(::HoudiniEngineUnity::HEU_InputNode::InputNodeType value);
      // static field const value: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType NODE
      static constexpr const int NODE = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType NODE
      static ::HoudiniEngineUnity::HEU_InputNode::InputNodeType _get_NODE();
      // Set static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType NODE
      static void _set_NODE(::HoudiniEngineUnity::HEU_InputNode::InputNodeType value);
      // static field const value: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType PARAMETER
      static constexpr const int PARAMETER = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType PARAMETER
      static ::HoudiniEngineUnity::HEU_InputNode::InputNodeType _get_PARAMETER();
      // Set static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType PARAMETER
      static void _set_PARAMETER(::HoudiniEngineUnity::HEU_InputNode::InputNodeType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType
    #pragma pack(pop)
    static check_size<sizeof(HEU_InputNode::InputNodeType), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_InputNode_InputNodeTypeSizeCheck;
    static_assert(sizeof(HEU_InputNode::InputNodeType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputObjectType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputObjectType
      constexpr InputObjectType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType HDA
      static constexpr const int HDA = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType HDA
      static ::HoudiniEngineUnity::HEU_InputNode::InputObjectType _get_HDA();
      // Set static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType HDA
      static void _set_HDA(::HoudiniEngineUnity::HEU_InputNode::InputObjectType value);
      // static field const value: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType UNITY_MESH
      static constexpr const int UNITY_MESH = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType UNITY_MESH
      static ::HoudiniEngineUnity::HEU_InputNode::InputObjectType _get_UNITY_MESH();
      // Set static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType UNITY_MESH
      static void _set_UNITY_MESH(::HoudiniEngineUnity::HEU_InputNode::InputObjectType value);
      // static field const value: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType CURVE
      static constexpr const int CURVE = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType CURVE
      static ::HoudiniEngineUnity::HEU_InputNode::InputObjectType _get_CURVE();
      // Set static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType CURVE
      static void _set_CURVE(::HoudiniEngineUnity::HEU_InputNode::InputObjectType value);
      // static field const value: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType TERRAIN
      static constexpr const int TERRAIN = 3;
      // Get static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType TERRAIN
      static ::HoudiniEngineUnity::HEU_InputNode::InputObjectType _get_TERRAIN();
      // Set static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType TERRAIN
      static void _set_TERRAIN(::HoudiniEngineUnity::HEU_InputNode::InputObjectType value);
      // static field const value: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType BOUNDING_BOX
      static constexpr const int BOUNDING_BOX = 4;
      // Get static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType BOUNDING_BOX
      static ::HoudiniEngineUnity::HEU_InputNode::InputObjectType _get_BOUNDING_BOX();
      // Set static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType BOUNDING_BOX
      static void _set_BOUNDING_BOX(::HoudiniEngineUnity::HEU_InputNode::InputObjectType value);
      // static field const value: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType TILEMAP
      static constexpr const int TILEMAP = 5;
      // Get static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType TILEMAP
      static ::HoudiniEngineUnity::HEU_InputNode::InputObjectType _get_TILEMAP();
      // Set static field: static public HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType TILEMAP
      static void _set_TILEMAP(::HoudiniEngineUnity::HEU_InputNode::InputObjectType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType
    #pragma pack(pop)
    static check_size<sizeof(HEU_InputNode::InputObjectType), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_InputNode_InputObjectTypeSizeCheck;
    static_assert(sizeof(HEU_InputNode::InputObjectType) == 0x4);
    public:
    // private HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType _inputNodeType
    // Size: 0x4
    // Offset: 0x18
    ::HoudiniEngineUnity::HEU_InputNode::InputNodeType inputNodeType;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_InputNode::InputNodeType) == 0x4);
    // private HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType _inputObjectType
    // Size: 0x4
    // Offset: 0x1C
    ::HoudiniEngineUnity::HEU_InputNode::InputObjectType inputObjectType;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_InputNode::InputObjectType) == 0x4);
    // private HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputObjectType _pendingInputObjectType
    // Size: 0x4
    // Offset: 0x20
    ::HoudiniEngineUnity::HEU_InputNode::InputObjectType pendingInputObjectType;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_InputNode::InputObjectType) == 0x4);
    // Padding between fields: pendingInputObjectType and: inputObjects
    char __padding2[0x4] = {};
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_InputObjectInfo> _inputObjects
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::HoudiniEngineUnity::HEU_InputObjectInfo*>* inputObjects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::HoudiniEngineUnity::HEU_InputObjectInfo*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> _inputObjectsConnectedAssetIDs
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<int>* inputObjectsConnectedAssetIDs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private UnityEngine.GameObject _inputAsset
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* inputAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject _connectedInputAsset
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* connectedInputAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_InputHDAInfo> _inputAssetInfos
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::HoudiniEngineUnity::HEU_InputHDAInfo*>* inputAssetInfos;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::HoudiniEngineUnity::HEU_InputHDAInfo*>*) == 0x8);
    // private System.Int32 _nodeID
    // Size: 0x4
    // Offset: 0x50
    int nodeID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _inputIndex
    // Size: 0x4
    // Offset: 0x54
    int inputIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _requiresCook
    // Size: 0x1
    // Offset: 0x58
    bool requiresCook;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _requiresUpload
    // Size: 0x1
    // Offset: 0x59
    bool requiresUpload;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: requiresUpload and: inputName
    char __padding11[0x6] = {};
    // private System.String _inputName
    // Size: 0x8
    // Offset: 0x60
    ::StringW inputName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _labelName
    // Size: 0x8
    // Offset: 0x68
    ::StringW labelName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _paramName
    // Size: 0x8
    // Offset: 0x70
    ::StringW paramName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 _connectedNodeID
    // Size: 0x4
    // Offset: 0x78
    int connectedNodeID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _keepWorldTransform
    // Size: 0x1
    // Offset: 0x7C
    bool keepWorldTransform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _packGeometryBeforeMerging
    // Size: 0x1
    // Offset: 0x7D
    bool packGeometryBeforeMerging;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: packGeometryBeforeMerging and: parentAsset
    char __padding17[0x2] = {};
    // private HoudiniEngineUnity.HEU_HoudiniAsset _parentAsset
    // Size: 0x8
    // Offset: 0x80
    ::HoudiniEngineUnity::HEU_HoudiniAsset* parentAsset;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_HoudiniAsset*) == 0x8);
    // private HoudiniEngineUnity.HEU_InputInterfaceTilemapSettings _tilemapSettings
    // Size: 0x8
    // Offset: 0x88
    ::HoudiniEngineUnity::HEU_InputInterfaceTilemapSettings* tilemapSettings;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_InputInterfaceTilemapSettings*) == 0x8);
    // public HoudiniEngineUnity.HEU_InputNodeUICache _uiCache
    // Size: 0x8
    // Offset: 0x90
    ::HoudiniEngineUnity::HEU_InputNodeUICache* uiCache;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_InputNodeUICache*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_InputNode*>
    operator ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_InputNode*>() noexcept {
      return *reinterpret_cast<::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_InputNode*>*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private HoudiniEngineUnity.HEU_InputNode/HoudiniEngineUnity.InputNodeType _inputNodeType
    [[deprecated("Use field access instead!")]] ::HoudiniEngineUnity::HEU_InputNode::InputNodeType& dyn__inputNodeType();
