// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HoudiniEngineUnity.IEquivable`1
#include "HoudiniEngineUnity/IEquivable_1.hpp"
// Including type: HoudiniEngineUnity.HAPI_AssetInfo
#include "HoudiniEngineUnity/HAPI_AssetInfo.hpp"
// Including type: HoudiniEngineUnity.HAPI_NodeInfo
#include "HoudiniEngineUnity/HAPI_NodeInfo.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveDrawCollision
#include "HoudiniEngineUnity/HEU_Curve_CurveDrawCollision.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!

  // Forward declaring type: HEU_AssetSerializedMetaData
  class HEU_AssetSerializedMetaData;
  // Skipping declaration: HEU_AssetType because it is already included!
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
  // Skipping declaration: AssetCookStatus because it is already included!
  // Skipping declaration: AssetCookResult because it is already included!
  // Forward declaring type: HAPI_ObjectInfo
  struct HAPI_ObjectInfo;
  // Forward declaring type: HAPI_Transform
  struct HAPI_Transform;
  // Forward declaring type: HEU_PartData
  class HEU_PartData;
  // Forward declaring type: HEU_GeneratedOutput
  class HEU_GeneratedOutput;
  // Forward declaring type: HEU_GeoNode
  class HEU_GeoNode;
  // Forward declaring type: HEU_ObjectInstanceInfo
  class HEU_ObjectInstanceInfo;
  // Forward declaring type: HEU_InputPreset
  class HEU_InputPreset;
  // Forward declaring type: HEU_VolumeCachePreset
  class HEU_VolumeCachePreset;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityAction`3<T0, T1, T2>
  template<typename T0, typename T1, typename T2>
  class UnityAction_3;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x271
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_HoudiniAsset
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class HEU_HoudiniAsset : public UnityEngine::MonoBehaviour/*, public HoudiniEngineUnity::IEquivable_1<HoudiniEngineUnity::HEU_HoudiniAsset*>*/ {
    public:
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType
    struct HEU_AssetType;
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction
    struct AssetBuildAction;
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus
    struct AssetCookStatus;
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookResult
    struct AssetCookResult;
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::UpdateUIDelegate
    class UpdateUIDelegate;
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::AssetInstantiationMethod
    struct AssetInstantiationMethod;
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::$$c__DisplayClass281_0
    class $$c__DisplayClass281_0;
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::$$c
    class $$c;
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::$$c__DisplayClass365_0
    class $$c__DisplayClass365_0;
    // Nested type: HoudiniEngineUnity::HEU_HoudiniAsset::$$c__DisplayClass365_1
    class $$c__DisplayClass365_1;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType
    // [TokenAttribute] Offset: FFFFFFFF
    struct HEU_AssetType/*, public System::Enum*/ {
      public:
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      protected:
      #endif
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: HEU_AssetType
      constexpr HEU_AssetType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_INVALID
      static constexpr const int TYPE_INVALID = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_INVALID
      static HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType _get_TYPE_INVALID();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_INVALID
      static void _set_TYPE_INVALID(HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_HDA
      static constexpr const int TYPE_HDA = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_HDA
      static HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType _get_TYPE_HDA();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_HDA
      static void _set_TYPE_HDA(HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_CURVE
      static constexpr const int TYPE_CURVE = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_CURVE
      static HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType _get_TYPE_CURVE();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_CURVE
      static void _set_TYPE_CURVE(HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_INPUT
      static constexpr const int TYPE_INPUT = 3;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_INPUT
      static HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType _get_TYPE_INPUT();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType TYPE_INPUT
      static void _set_TYPE_INPUT(HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType
    #pragma pack(pop)
    static check_size<sizeof(HEU_HoudiniAsset::HEU_AssetType), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_HoudiniAsset_HEU_AssetTypeSizeCheck;
    static_assert(sizeof(HEU_HoudiniAsset::HEU_AssetType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction
    // [TokenAttribute] Offset: FFFFFFFF
    struct AssetBuildAction/*, public System::Enum*/ {
      public:
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      protected:
      #endif
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AssetBuildAction
      constexpr AssetBuildAction(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction NONE
      static constexpr const int NONE = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction NONE
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction _get_NONE();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction NONE
      static void _set_NONE(HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction RELOAD
      static constexpr const int RELOAD = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction RELOAD
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction _get_RELOAD();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction RELOAD
      static void _set_RELOAD(HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction COOK
      static constexpr const int COOK = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction COOK
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction _get_COOK();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction COOK
      static void _set_COOK(HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction INVALID
      static constexpr const int INVALID = 3;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction INVALID
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction _get_INVALID();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction INVALID
      static void _set_INVALID(HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction STRIP_HEDATA
      static constexpr const int STRIP_HEDATA = 4;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction STRIP_HEDATA
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction _get_STRIP_HEDATA();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction STRIP_HEDATA
      static void _set_STRIP_HEDATA(HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction DUPLICATE
      static constexpr const int DUPLICATE = 5;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction DUPLICATE
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction _get_DUPLICATE();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction DUPLICATE
      static void _set_DUPLICATE(HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction RESET_PARAMS
      static constexpr const int RESET_PARAMS = 6;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction RESET_PARAMS
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction _get_RESET_PARAMS();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction RESET_PARAMS
      static void _set_RESET_PARAMS(HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction
    #pragma pack(pop)
    static check_size<sizeof(HEU_HoudiniAsset::AssetBuildAction), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_HoudiniAsset_AssetBuildActionSizeCheck;
    static_assert(sizeof(HEU_HoudiniAsset::AssetBuildAction) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus
    // [TokenAttribute] Offset: FFFFFFFF
    struct AssetCookStatus/*, public System::Enum*/ {
      public:
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      protected:
      #endif
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AssetCookStatus
      constexpr AssetCookStatus(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus NONE
      static constexpr const int NONE = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus NONE
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus _get_NONE();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus NONE
      static void _set_NONE(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus COOKING
      static constexpr const int COOKING = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus COOKING
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus _get_COOKING();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus COOKING
      static void _set_COOKING(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus POSTCOOK
      static constexpr const int POSTCOOK = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus POSTCOOK
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus _get_POSTCOOK();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus POSTCOOK
      static void _set_POSTCOOK(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus LOADING
      static constexpr const int LOADING = 3;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus LOADING
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus _get_LOADING();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus LOADING
      static void _set_LOADING(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus POSTLOAD
      static constexpr const int POSTLOAD = 4;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus POSTLOAD
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus _get_POSTLOAD();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus POSTLOAD
      static void _set_POSTLOAD(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus PRELOAD
      static constexpr const int PRELOAD = 5;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus PRELOAD
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus _get_PRELOAD();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus PRELOAD
      static void _set_PRELOAD(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus SELECT_SUBASSET
      static constexpr const int SELECT_SUBASSET = 6;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus SELECT_SUBASSET
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus _get_SELECT_SUBASSET();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus SELECT_SUBASSET
      static void _set_SELECT_SUBASSET(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus
    #pragma pack(pop)
    static check_size<sizeof(HEU_HoudiniAsset::AssetCookStatus), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_HoudiniAsset_AssetCookStatusSizeCheck;
    static_assert(sizeof(HEU_HoudiniAsset::AssetCookStatus) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult
    // [TokenAttribute] Offset: FFFFFFFF
    struct AssetCookResult/*, public System::Enum*/ {
      public:
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      protected:
      #endif
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AssetCookResult
      constexpr AssetCookResult(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult NONE
      static constexpr const int NONE = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult NONE
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookResult _get_NONE();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult NONE
      static void _set_NONE(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookResult value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult SUCCESS
      static constexpr const int SUCCESS = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult SUCCESS
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookResult _get_SUCCESS();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult SUCCESS
      static void _set_SUCCESS(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookResult value);
      // static field const value: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult ERRORED
      static constexpr const int ERRORED = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult ERRORED
      static HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookResult _get_ERRORED();
      // Set static field: static public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult ERRORED
      static void _set_ERRORED(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookResult value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult
    #pragma pack(pop)
    static check_size<sizeof(HEU_HoudiniAsset::AssetCookResult), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_HoudiniAsset_AssetCookResultSizeCheck;
    static_assert(sizeof(HEU_HoudiniAsset::AssetCookResult) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType _assetType
    // Size: 0x4
    // Offset: 0x18
    HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType assetType;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType) == 0x4);
    // private HoudiniEngineUnity.HAPI_AssetInfo _assetInfo
    // Size: 0x3E
    // Offset: 0x1C
    HoudiniEngineUnity::HAPI_AssetInfo assetInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_AssetInfo) == 0x3E);
    // Padding between fields: assetInfo and: nodeInfo
    char __padding1[0x2] = {};
    // private HoudiniEngineUnity.HAPI_NodeInfo _nodeInfo
    // Size: 0x42
    // Offset: 0x5C
    HoudiniEngineUnity::HAPI_NodeInfo nodeInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_NodeInfo) == 0x42);
    // Padding between fields: nodeInfo and: assetName
    char __padding2[0x2] = {};
    // private System.String _assetName
    // Size: 0x8
    // Offset: 0xA0
    ::Il2CppString* assetName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String _assetOpName
    // Size: 0x8
    // Offset: 0xA8
    ::Il2CppString* assetOpName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String _assetHelp
    // Size: 0x8
    // Offset: 0xB0
    ::Il2CppString* assetHelp;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Int32 _assetID
    // Size: 0x4
    // Offset: 0xB8
    int assetID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: assetID and: assetPath
    char __padding6[0x4] = {};
    // private System.String _assetPath
    // Size: 0x8
    // Offset: 0xC0
    ::Il2CppString* assetPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean _loadAssetFromMemory
    // Size: 0x1
    // Offset: 0xC8
    bool loadAssetFromMemory;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _alwaysOverwriteOnLoad
    // Size: 0x1
    // Offset: 0xC9
    bool alwaysOverwriteOnLoad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: alwaysOverwriteOnLoad and: assetFileObject
    char __padding9[0x6] = {};
    // private UnityEngine.Object _assetFileObject
    // Size: 0x8
    // Offset: 0xD0
    UnityEngine::Object* assetFileObject;
    // Field size check
    static_assert(sizeof(UnityEngine::Object*) == 0x8);
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_ObjectNode> _objectNodes
    // Size: 0x8
    // Offset: 0xD8
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_ObjectNode*>* objectNodes;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_ObjectNode*>*) == 0x8);
    // private UnityEngine.GameObject _rootGameObject
    // Size: 0x8
    // Offset: 0xE0
    UnityEngine::GameObject* rootGameObject;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_MaterialData> _materialCache
    // Size: 0x8
    // Offset: 0xE8
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_MaterialData*>* materialCache;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_MaterialData*>*) == 0x8);
    // private HoudiniEngineUnity.HEU_Parameters _parameters
    // Size: 0x8
    // Offset: 0xF0
    HoudiniEngineUnity::HEU_Parameters* parameters;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_Parameters*) == 0x8);
    // private UnityEngine.Matrix4x4 _lastSyncedTransformMatrix
    // Size: 0x40
    // Offset: 0xF8
    UnityEngine::Matrix4x4 lastSyncedTransformMatrix;
    // Field size check
    static_assert(sizeof(UnityEngine::Matrix4x4) == 0x40);
    // private System.String _assetCacheFolderPath
    // Size: 0x8
    // Offset: 0x138
    ::Il2CppString* assetCacheFolderPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String[] _subassetNames
    // Size: 0x8
    // Offset: 0x140
    ::ArrayW<::Il2CppString*> subassetNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppString*>) == 0x8);
    // private System.Int32 _selectedSubassetIndex
    // Size: 0x4
    // Offset: 0x148
    int selectedSubassetIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: selectedSubassetIndex and: savedAssetPreset
    char __padding18[0x4] = {};
    // private HoudiniEngineUnity.HEU_AssetPreset _savedAssetPreset
    // Size: 0x8
    // Offset: 0x150
    HoudiniEngineUnity::HEU_AssetPreset* savedAssetPreset;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_AssetPreset*) == 0x8);
    // private HoudiniEngineUnity.HEU_RecookPreset _recookPreset
    // Size: 0x8
    // Offset: 0x158
    HoudiniEngineUnity::HEU_RecookPreset* recookPreset;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_RecookPreset*) == 0x8);
    // private System.Int32 _totalCookCount
    // Size: 0x4
    // Offset: 0x160
    int totalCookCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetBuildAction _requestBuildAction
    // Size: 0x4
    // Offset: 0x164
    HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction requestBuildAction;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_HoudiniAsset::AssetBuildAction) == 0x4);
    // private System.Boolean _checkParameterChangeForCook
    // Size: 0x1
    // Offset: 0x168
    bool checkParameterChangeForCook;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _skipCookCheck
    // Size: 0x1
    // Offset: 0x169
    bool skipCookCheck;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _uploadParameters
    // Size: 0x1
    // Offset: 0x16A
    bool uploadParameters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _forceUploadInputs
    // Size: 0x1
    // Offset: 0x16B
    bool forceUploadInputs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _upstreamCookChanged
    // Size: 0x1
    // Offset: 0x16C
    bool upstreamCookChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: upstreamCookChanged and: cookStatus
    char __padding27[0x3] = {};
    // private HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookStatus _cookStatus
    // Size: 0x4
    // Offset: 0x170
    HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus cookStatus;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookStatus) == 0x4);
    // private HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.AssetCookResult _lastCookResult
    // Size: 0x4
    // Offset: 0x174
    HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookResult lastCookResult;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_HoudiniAsset::AssetCookResult) == 0x4);
    // private System.Boolean _isCookingAssetReloaded
    // Size: 0x1
    // Offset: 0x178
    bool isCookingAssetReloaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _bForceUpdate
    // Size: 0x1
    // Offset: 0x179
    bool bForceUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bForceUpdate and: sessionID
    char __padding31[0x6] = {};
    // private System.Int64 _sessionID
    // Size: 0x8
    // Offset: 0x180
    int64_t sessionID;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean <WarnedPrefabNotSupported>k__BackingField
    // Size: 0x1
    // Offset: 0x188
    bool WarnedPrefabNotSupported;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _uiLocked
    // Size: 0x1
    // Offset: 0x189
    bool uiLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showHDAOptions
    // Size: 0x1
    // Offset: 0x18A
    bool showHDAOptions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showGenerateSection
    // Size: 0x1
    // Offset: 0x18B
    bool showGenerateSection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showBakeSection
    // Size: 0x1
    // Offset: 0x18C
    bool showBakeSection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showEventsSection
    // Size: 0x1
    // Offset: 0x18D
    bool showEventsSection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showCurvesSection
    // Size: 0x1
    // Offset: 0x18E
    bool showCurvesSection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showInputNodesSection
    // Size: 0x1
    // Offset: 0x18F
    bool showInputNodesSection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showToolsSection
    // Size: 0x1
    // Offset: 0x190
    bool showToolsSection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showTerrainSection
    // Size: 0x1
    // Offset: 0x191
    bool showTerrainSection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showTerrainSection and: instanceInputUIState
    char __padding42[0x6] = {};
    // private HoudiniEngineUnity.HEU_InstanceInputUIState _instanceInputUIState
    // Size: 0x8
    // Offset: 0x198
    HoudiniEngineUnity::HEU_InstanceInputUIState* instanceInputUIState;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_InstanceInputUIState*) == 0x8);
    // public HoudiniEngineUnity.ReloadEvent _reloadEvent
    // Size: 0x8
    // Offset: 0x1A0
    HoudiniEngineUnity::ReloadEvent* reloadEvent;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::ReloadEvent*) == 0x8);
    // public HoudiniEngineUnity.CookedEvent _cookedEvent
    // Size: 0x8
    // Offset: 0x1A8
    HoudiniEngineUnity::CookedEvent* cookedEvent;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::CookedEvent*) == 0x8);
    // public HoudiniEngineUnity.BakedEvent _bakedEvent
    // Size: 0x8
    // Offset: 0x1B0
    HoudiniEngineUnity::BakedEvent* bakedEvent;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::BakedEvent*) == 0x8);
    // public HoudiniEngineUnity.HEU_ReloadDataEvent _reloadDataEvent
    // Size: 0x8
    // Offset: 0x1B8
    HoudiniEngineUnity::HEU_ReloadDataEvent* reloadDataEvent;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_ReloadDataEvent*) == 0x8);
    // public HoudiniEngineUnity.HEU_CookedDataEvent _cookedDataEvent
    // Size: 0x8
    // Offset: 0x1C0
    HoudiniEngineUnity::HEU_CookedDataEvent* cookedDataEvent;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_CookedDataEvent*) == 0x8);
    // public HoudiniEngineUnity.HEU_BakedDataEvent _bakedDataEvent
    // Size: 0x8
    // Offset: 0x1C8
    HoudiniEngineUnity::HEU_BakedDataEvent* bakedDataEvent;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_BakedDataEvent*) == 0x8);
    // public HoudiniEngineUnity.HEU_PreAssetEvent _preAssetEvent
    // Size: 0x8
    // Offset: 0x1D0
    HoudiniEngineUnity::HEU_PreAssetEvent* preAssetEvent;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_PreAssetEvent*) == 0x8);
    // public HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.UpdateUIDelegate _refreshUIDelegate
    // Size: 0x8
    // Offset: 0x1D8
    HoudiniEngineUnity::HEU_HoudiniAsset::UpdateUIDelegate* refreshUIDelegate;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_HoudiniAsset::UpdateUIDelegate*) == 0x8);
    // public HoudiniEngineUnity.CookedEvent _downstreamConnectionCookedEvent
    // Size: 0x8
    // Offset: 0x1E0
    HoudiniEngineUnity::CookedEvent* downstreamConnectionCookedEvent;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::CookedEvent*) == 0x8);
    // private System.Boolean _generateUVs
    // Size: 0x1
    // Offset: 0x1E8
    bool generateUVs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _generateTangents
    // Size: 0x1
    // Offset: 0x1E9
    bool generateTangents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _generateNormals
    // Size: 0x1
    // Offset: 0x1EA
    bool generateNormals;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _pushTransformToHoudini
    // Size: 0x1
    // Offset: 0x1EB
    bool pushTransformToHoudini;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _transformChangeTriggersCooks
    // Size: 0x1
    // Offset: 0x1EC
    bool transformChangeTriggersCooks;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _cookingTriggersDownCooks
    // Size: 0x1
    // Offset: 0x1ED
    bool cookingTriggersDownCooks;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _autoCookOnParameterChange
    // Size: 0x1
    // Offset: 0x1EE
    bool autoCookOnParameterChange;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _ignoreNonDisplayNodes
    // Size: 0x1
    // Offset: 0x1EF
    bool ignoreNonDisplayNodes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _generateMeshUsingPoints
    // Size: 0x1
    // Offset: 0x1F0
    bool generateMeshUsingPoints;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _useLODGroups
    // Size: 0x1
    // Offset: 0x1F1
    bool useLODGroups;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _splitGeosByGroup
    // Size: 0x1
    // Offset: 0x1F2
    bool splitGeosByGroup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _sessionSyncAutoCook
    // Size: 0x1
    // Offset: 0x1F3
    bool sessionSyncAutoCook;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _bakeUpdateKeepPreviousTransformValues
    // Size: 0x1
    // Offset: 0x1F4
    bool bakeUpdateKeepPreviousTransformValues;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _pauseCooking
    // Size: 0x1
    // Offset: 0x1F5
    bool pauseCooking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _curveEditorEnabled
    // Size: 0x1
    // Offset: 0x1F6
    bool curveEditorEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: curveEditorEnabled and: curves
    char __padding67[0x1] = {};
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_Curve> _curves
    // Size: 0x8
    // Offset: 0x1F8
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_Curve*>* curves;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_Curve*>*) == 0x8);
    // private HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveDrawCollision _curveDrawCollision
    // Size: 0x4
    // Offset: 0x200
    HoudiniEngineUnity::HEU_Curve::CurveDrawCollision curveDrawCollision;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_Curve::CurveDrawCollision) == 0x4);
    // Padding between fields: curveDrawCollision and: curveDrawColliders
    char __padding69[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.Collider> _curveDrawColliders
    // Size: 0x8
    // Offset: 0x208
    System::Collections::Generic::List_1<UnityEngine::Collider*>* curveDrawColliders;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<UnityEngine::Collider*>*) == 0x8);
    // private UnityEngine.LayerMask _curveDrawLayerMask
    // Size: 0x4
    // Offset: 0x210
    UnityEngine::LayerMask curveDrawLayerMask;
    // Field size check
    static_assert(sizeof(UnityEngine::LayerMask) == 0x4);
    // private System.Single _curveProjectMaxDistance
    // Size: 0x4
    // Offset: 0x214
    float curveProjectMaxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _curveProjectDirection
    // Size: 0xC
    // Offset: 0x218
    UnityEngine::Vector3 curveProjectDirection;
    // Field size check
    static_assert(sizeof(UnityEngine::Vector3) == 0xC);
    // private System.Boolean _curveDisableScaleRotation
    // Size: 0x1
    // Offset: 0x224
    bool curveDisableScaleRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _curveCookOnDrag
    // Size: 0x1
    // Offset: 0x225
    bool curveCookOnDrag;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _curveFrameSelectedNodes
    // Size: 0x1
    // Offset: 0x226
    bool curveFrameSelectedNodes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: curveFrameSelectedNodes and: curveFrameSelectedNodeDistance
    char __padding76[0x1] = {};
    // private System.Single _curveFrameSelectedNodeDistance
    // Size: 0x4
    // Offset: 0x228
    float curveFrameSelectedNodeDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: curveFrameSelectedNodeDistance and: inputNodes
    char __padding77[0x4] = {};
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_InputNode> _inputNodes
    // Size: 0x8
    // Offset: 0x230
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_InputNode*>* inputNodes;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_InputNode*>*) == 0x8);
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_Handle> _handles
    // Size: 0x8
    // Offset: 0x238
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_Handle*>* handles;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_Handle*>*) == 0x8);
    // private System.Boolean _handlesEnabled
    // Size: 0x1
    // Offset: 0x240
    bool handlesEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: handlesEnabled and: volumeCaches
    char __padding80[0x7] = {};
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_VolumeCache> _volumeCaches
    // Size: 0x8
    // Offset: 0x248
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_VolumeCache*>* volumeCaches;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_VolumeCache*>*) == 0x8);
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_AttributesStore> _attributeStores
    // Size: 0x8
    // Offset: 0x250
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_AttributesStore*>* attributeStores;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_AttributesStore*>*) == 0x8);
    // private System.Boolean _editableNodesToolsEnabled
    // Size: 0x1
    // Offset: 0x258
    bool editableNodesToolsEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: editableNodesToolsEnabled and: toolsInfo
    char __padding83[0x7] = {};
    // private HoudiniEngineUnity.HEU_ToolsInfo _toolsInfo
    // Size: 0x8
    // Offset: 0x260
    HoudiniEngineUnity::HEU_ToolsInfo* toolsInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_ToolsInfo*) == 0x8);
    // private HoudiniEngineUnity.HEU_AssetSerializedMetaData _serializedMetaData
    // Size: 0x8
    // Offset: 0x268
    HoudiniEngineUnity::HEU_AssetSerializedMetaData* serializedMetaData;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_AssetSerializedMetaData*) == 0x8);
    // private System.Boolean _pendingAutoCookOnMouseRelease
    // Size: 0x1
    // Offset: 0x270
    bool pendingAutoCookOnMouseRelease;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator HoudiniEngineUnity::IEquivable_1<HoudiniEngineUnity::HEU_HoudiniAsset*>
    operator HoudiniEngineUnity::IEquivable_1<HoudiniEngineUnity::HEU_HoudiniAsset*>() noexcept {
      return *reinterpret_cast<HoudiniEngineUnity::IEquivable_1<HoudiniEngineUnity::HEU_HoudiniAsset*>*>(this);
    }
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: private HoudiniEngineUnity.HEU_HoudiniAsset/HoudiniEngineUnity.HEU_AssetType _assetType
    HoudiniEngineUnity::HEU_HoudiniAsset::HEU_AssetType& dyn__assetType();
    // Get instance field reference: private HoudiniEngineUnity.HAPI_AssetInfo _assetInfo
    HoudiniEngineUnity::HAPI_AssetInfo& dyn__assetInfo();
