// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HoudiniEngineUnity.HEU_GenerateOptions
#include "HoudiniEngineUnity/HEU_GenerateOptions.hpp"
// Including type: HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo
#include "HoudiniEngineUnity/HEU_ThreadedTaskLoadGeo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_GeneratedOutput
  class HEU_GeneratedOutput;
  // Forward declaring type: HEU_LoadBufferVolume
  class HEU_LoadBufferVolume;
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
  // Forward declaring type: HEU_LoadBufferMesh
  class HEU_LoadBufferMesh;
  // Forward declaring type: HEU_LoadBufferInstancer
  class HEU_LoadBufferInstancer;
  // Forward declaring type: HEU_LoadBufferBase
  class HEU_LoadBufferBase;
  // Forward declaring type: HAPI_Transform
  struct HAPI_Transform;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_BaseSync
  class HEU_BaseSync;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::HoudiniEngineUnity::HEU_BaseSync);
DEFINE_IL2CPP_ARG_TYPE(::HoudiniEngineUnity::HEU_BaseSync*, "HoudiniEngineUnity", "HEU_BaseSync");
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x7D
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_BaseSync
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class HEU_BaseSync : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.Int32 _cookNodeID
    // Size: 0x4
    // Offset: 0x18
    int cookNodeID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: cookNodeID and: sessionID
    char __padding0[0x4] = {};
    // public System.Int64 _sessionID
    // Size: 0x8
    // Offset: 0x20
    int64_t sessionID;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.String _nodeName
    // Size: 0x8
    // Offset: 0x28
    ::StringW nodeName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean _initialized
    // Size: 0x1
    // Offset: 0x30
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean _syncing
    // Size: 0x1
    // Offset: 0x31
    bool syncing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean _deleteParent
    // Size: 0x1
    // Offset: 0x32
    bool deleteParent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: deleteParent and: generatedOutputs
    char __padding5[0x5] = {};
    // public System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_GeneratedOutput> _generatedOutputs
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::HoudiniEngineUnity::HEU_GeneratedOutput*>* generatedOutputs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::HoudiniEngineUnity::HEU_GeneratedOutput*>*) == 0x8);
    // public System.String _outputCacheDirectory
    // Size: 0x8
    // Offset: 0x40
    ::StringW outputCacheDirectory;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.List`1<System.String> _outputCacheFilePaths
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::StringW>* outputCacheFilePaths;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public HoudiniEngineUnity.HEU_GenerateOptions _generateOptions
    // Size: 0x5
    // Offset: 0x50
    ::HoudiniEngineUnity::HEU_GenerateOptions generateOptions;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_GenerateOptions) == 0x5);
    // Padding between fields: generateOptions and: log
    char __padding9[0x3] = {};
    // public System.Text.StringBuilder _log
    // Size: 0x8
    // Offset: 0x58
    ::System::Text::StringBuilder* log;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // public System.Text.StringBuilder _error
    // Size: 0x8
    // Offset: 0x60
    ::System::Text::StringBuilder* error;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // public System.Boolean _sessionSyncAutoCook
    // Size: 0x1
    // Offset: 0x68
    bool sessionSyncAutoCook;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sessionSyncAutoCook and: loadTask
    char __padding12[0x7] = {};
    // protected HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo _loadTask
    // Size: 0x8
    // Offset: 0x70
    ::HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo* loadTask;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo*) == 0x8);
    // protected System.Int32 _totalCookCount
    // Size: 0x4
    // Offset: 0x78
    int totalCookCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _firstSyncComplete
    // Size: 0x1
    // Offset: 0x7C
    bool firstSyncComplete;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Int32 _cookNodeID
    [[deprecated("Use field access instead!")]] int& dyn__cookNodeID();
    // Get instance field reference: public System.Int64 _sessionID
    [[deprecated("Use field access instead!")]] int64_t& dyn__sessionID();
    // Get instance field reference: public System.String _nodeName
    [[deprecated("Use field access instead!")]] ::StringW& dyn__nodeName();
    // Get instance field reference: public System.Boolean _initialized
    [[deprecated("Use field access instead!")]] bool& dyn__initialized();
    // Get instance field reference: public System.Boolean _syncing
    [[deprecated("Use field access instead!")]] bool& dyn__syncing();
