// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: HoudiniEngineUnity.IEquivable`1
#include "HoudiniEngineUnity/IEquivable_1.hpp"
// Including type: HoudiniEngineUnity.HAPI_PartType
#include "HoudiniEngineUnity/HAPI_PartType.hpp"
// Including type: HoudiniEngineUnity.TransformData
#include "HoudiniEngineUnity/TransformData.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_Curve
  class HEU_Curve;
  // Forward declaring type: HEU_GeoNode
  class HEU_GeoNode;
  // Forward declaring type: HEU_ObjectInstanceInfo
  class HEU_ObjectInstanceInfo;
  // Forward declaring type: HEU_AttributesStore
  class HEU_AttributesStore;
  // Forward declaring type: HEU_GeneratedOutput
  class HEU_GeneratedOutput;
  // Forward declaring type: HEU_HoudiniAsset
  class HEU_HoudiniAsset;
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
  // Forward declaring type: HAPI_PartInfo
  struct HAPI_PartInfo;
  // Skipping declaration: PartOutputType because it is already included!
  // Forward declaring type: HAPI_Transform
  struct HAPI_Transform;
  // Forward declaring type: HEU_MaterialData
  class HEU_MaterialData;
  // Forward declaring type: HEU_ObjectNode
  class HEU_ObjectNode;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: TerrainData
  class TerrainData;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_PartData
  class HEU_PartData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::HoudiniEngineUnity::HEU_PartData);
DEFINE_IL2CPP_ARG_TYPE(::HoudiniEngineUnity::HEU_PartData*, "HoudiniEngineUnity", "HEU_PartData");
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_PartData
  // [TokenAttribute] Offset: FFFFFFFF
  class HEU_PartData : public ::UnityEngine::ScriptableObject/*, public ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_PartData*>*/ {
    public:
    // Nested type: ::HoudiniEngineUnity::HEU_PartData::PartOutputType
    struct PartOutputType;
    // Nested type: ::HoudiniEngineUnity::HEU_PartData::$$c
    class $$c;
    // Nested type: ::HoudiniEngineUnity::HEU_PartData::$$c__DisplayClass86_0
    class $$c__DisplayClass86_0;
    // Nested type: ::HoudiniEngineUnity::HEU_PartData::$$c__DisplayClass88_0
    class $$c__DisplayClass88_0;
    // Nested type: ::HoudiniEngineUnity::HEU_PartData::$$c__DisplayClass88_1
    class $$c__DisplayClass88_1;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType
    // [TokenAttribute] Offset: FFFFFFFF
    struct PartOutputType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: PartOutputType
      constexpr PartOutputType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType NONE
      static constexpr const int NONE = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType NONE
      static ::HoudiniEngineUnity::HEU_PartData::PartOutputType _get_NONE();
      // Set static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType NONE
      static void _set_NONE(::HoudiniEngineUnity::HEU_PartData::PartOutputType value);
      // static field const value: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType MESH
      static constexpr const int MESH = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType MESH
      static ::HoudiniEngineUnity::HEU_PartData::PartOutputType _get_MESH();
      // Set static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType MESH
      static void _set_MESH(::HoudiniEngineUnity::HEU_PartData::PartOutputType value);
      // static field const value: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType VOLUME
      static constexpr const int VOLUME = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType VOLUME
      static ::HoudiniEngineUnity::HEU_PartData::PartOutputType _get_VOLUME();
      // Set static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType VOLUME
      static void _set_VOLUME(::HoudiniEngineUnity::HEU_PartData::PartOutputType value);
      // static field const value: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType CURVE
      static constexpr const int CURVE = 3;
      // Get static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType CURVE
      static ::HoudiniEngineUnity::HEU_PartData::PartOutputType _get_CURVE();
      // Set static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType CURVE
      static void _set_CURVE(::HoudiniEngineUnity::HEU_PartData::PartOutputType value);
      // static field const value: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType INSTANCER
      static constexpr const int INSTANCER = 4;
      // Get static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType INSTANCER
      static ::HoudiniEngineUnity::HEU_PartData::PartOutputType _get_INSTANCER();
      // Set static field: static public HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType INSTANCER
      static void _set_INSTANCER(::HoudiniEngineUnity::HEU_PartData::PartOutputType value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType
    #pragma pack(pop)
    static check_size<sizeof(HEU_PartData::PartOutputType), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_PartData_PartOutputTypeSizeCheck;
    static_assert(sizeof(HEU_PartData::PartOutputType) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Int32 _partID
    // Size: 0x4
    // Offset: 0x18
    int partID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: partID and: partName
    char __padding0[0x4] = {};
    // private System.String _partName
    // Size: 0x8
    // Offset: 0x20
    ::StringW partName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 _objectNodeID
    // Size: 0x4
    // Offset: 0x28
    int objectNodeID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _geoID
    // Size: 0x4
    // Offset: 0x2C
    int geoID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private HoudiniEngineUnity.HAPI_PartType _partType
    // Size: 0x4
    // Offset: 0x30
    ::HoudiniEngineUnity::HAPI_PartType partType;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HAPI_PartType) == 0x4);
    // Padding between fields: partType and: geoNode
    char __padding4[0x4] = {};
    // private HoudiniEngineUnity.HEU_GeoNode _geoNode
    // Size: 0x8
    // Offset: 0x38
    ::HoudiniEngineUnity::HEU_GeoNode* geoNode;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_GeoNode*) == 0x8);
    // private System.Boolean _isAttribInstancer
    // Size: 0x1
    // Offset: 0x40
    bool isAttribInstancer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isPartInstanced
    // Size: 0x1
    // Offset: 0x41
    bool isPartInstanced;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPartInstanced and: partPointCount
    char __padding7[0x2] = {};
    // private System.Int32 _partPointCount
    // Size: 0x4
    // Offset: 0x44
    int partPointCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _isObjectInstancer
    // Size: 0x1
    // Offset: 0x48
    bool isObjectInstancer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _objectInstancesGenerated
    // Size: 0x1
    // Offset: 0x49
    bool objectInstancesGenerated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: objectInstancesGenerated and: objectInstanceInfos
    char __padding10[0x6] = {};
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_ObjectInstanceInfo> _objectInstanceInfos
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::HoudiniEngineUnity::HEU_ObjectInstanceInfo*>* objectInstanceInfos;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::HoudiniEngineUnity::HEU_ObjectInstanceInfo*>*) == 0x8);
    // private UnityEngine.Vector3 _terrainOffsetPosition
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 terrainOffsetPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: terrainOffsetPosition and: assetDBTerrainData
    char __padding12[0x4] = {};
    // private UnityEngine.Object _assetDBTerrainData
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Object* assetDBTerrainData;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private System.Boolean _isPartEditable
    // Size: 0x1
    // Offset: 0x70
    bool isPartEditable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPartEditable and: partOutputType
    char __padding14[0x3] = {};
    // private HoudiniEngineUnity.HEU_PartData/HoudiniEngineUnity.PartOutputType _partOutputType
    // Size: 0x4
    // Offset: 0x74
    ::HoudiniEngineUnity::HEU_PartData::PartOutputType partOutputType;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_PartData::PartOutputType) == 0x4);
    // private HoudiniEngineUnity.HEU_Curve _curve
    // Size: 0x8
    // Offset: 0x78
    ::HoudiniEngineUnity::HEU_Curve* curve;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_Curve*) == 0x8);
    // private HoudiniEngineUnity.HEU_AttributesStore _attributesStore
    // Size: 0x8
    // Offset: 0x80
    ::HoudiniEngineUnity::HEU_AttributesStore* attributesStore;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_AttributesStore*) == 0x8);
    // private System.Boolean _haveInstancesBeenGenerated
    // Size: 0x1
    // Offset: 0x88
    bool haveInstancesBeenGenerated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: haveInstancesBeenGenerated and: meshVertexCount
    char __padding18[0x3] = {};
    // private System.Int32 _meshVertexCount
    // Size: 0x4
    // Offset: 0x8C
    int meshVertexCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private HoudiniEngineUnity.HEU_GeneratedOutput _generatedOutput
    // Size: 0x8
    // Offset: 0x90
    ::HoudiniEngineUnity::HEU_GeneratedOutput* generatedOutput;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_GeneratedOutput*) == 0x8);
    // private System.String _volumeLayerName
    // Size: 0x8
    // Offset: 0x98
    ::StringW volumeLayerName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating interface conversion operator: operator ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_PartData*>
    operator ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_PartData*>() noexcept {
      return *reinterpret_cast<::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_PartData*>*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Int32 _partID
    int& dyn__partID();
    // Get instance field reference: private System.String _partName
    ::StringW& dyn__partName();
    // Get instance field reference: private System.Int32 _objectNodeID
    int& dyn__objectNodeID();
    // Get instance field reference: private System.Int32 _geoID
    int& dyn__geoID();
