// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HoudiniEngineUnity.HEU_ThreadedTask
#include "HoudiniEngineUnity/HEU_ThreadedTask.hpp"
// Including type: HoudiniEngineUnity.HEU_GenerateOptions
#include "HoudiniEngineUnity/HEU_GenerateOptions.hpp"
// Including type: HoudiniEngineUnity.HAPI_PartInfo
#include "HoudiniEngineUnity/HAPI_PartInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Skipping declaration: LoadType because it is already included!
  // Forward declaring type: HEU_LoadBufferVolume
  class HEU_LoadBufferVolume;
  // Forward declaring type: HEU_BaseSync
  class HEU_BaseSync;
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
  // Forward declaring type: HAPI_ObjectInfo
  struct HAPI_ObjectInfo;
  // Forward declaring type: HEU_LoadBufferMesh
  class HEU_LoadBufferMesh;
  // Forward declaring type: HEU_LoadBufferInstancer
  class HEU_LoadBufferInstancer;
  // Forward declaring type: HEU_LoadBufferBase
  class HEU_LoadBufferBase;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_ThreadedTaskLoadGeo
  class HEU_ThreadedTaskLoadGeo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo);
DEFINE_IL2CPP_ARG_TYPE(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo*, "HoudiniEngineUnity", "HEU_ThreadedTaskLoadGeo");
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo
  // [TokenAttribute] Offset: FFFFFFFF
  class HEU_ThreadedTaskLoadGeo : public HoudiniEngineUnity::HEU_ThreadedTask {
    public:
    // Nested type: HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType
    struct LoadType;
    // Nested type: HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData
    class HEU_LoadData;
    // Nested type: HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadObject
    class HEU_LoadObject;
    // Nested type: HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadCallbackType
    struct HEU_LoadCallbackType;
    // Nested type: HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadCallback
    class HEU_LoadCallback;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType
    // [TokenAttribute] Offset: FFFFFFFF
    struct LoadType/*, public System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LoadType
      constexpr LoadType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType FILE
      static constexpr const int FILE = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType FILE
      static HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType _get_FILE();
      // Set static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType FILE
      static void _set_FILE(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType value);
      // static field const value: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType NODE
      static constexpr const int NODE = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType NODE
      static HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType _get_NODE();
      // Set static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType NODE
      static void _set_NODE(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType value);
      // static field const value: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType ASSET
      static constexpr const int ASSET = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType ASSET
      static HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType _get_ASSET();
      // Set static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType ASSET
      static void _set_ASSET(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType
    #pragma pack(pop)
    static check_size<sizeof(HEU_ThreadedTaskLoadGeo::LoadType), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_ThreadedTaskLoadGeo_LoadTypeSizeCheck;
    static_assert(sizeof(HEU_ThreadedTaskLoadGeo::LoadType) == 0x4);
    // Size: 0x38
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData
    // [TokenAttribute] Offset: FFFFFFFF
    class HEU_LoadData : public ::Il2CppObject {
      public:
      // Nested type: HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus
      struct LoadStatus;
      // Size: 0x4
      #pragma pack(push, 1)
      // Autogenerated type: HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus
      // [TokenAttribute] Offset: FFFFFFFF
      struct LoadStatus/*, public System::Enum*/ {
        public:
        public:
        // public System.Int32 value__
        // Size: 0x4
        // Offset: 0x0
        int value;
        // Field size check
        static_assert(sizeof(int) == 0x4);
        public:
        // Creating value type constructor for type: LoadStatus
        constexpr LoadStatus(int value_ = {}) noexcept : value{value_} {}
        // Creating interface conversion operator: operator System::Enum
        operator System::Enum() noexcept {
          return *reinterpret_cast<System::Enum*>(this);
        }
        // Creating conversion operator: operator int
        constexpr operator int() const noexcept {
          return value;
        }
        // static field const value: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus NONE
        static constexpr const int NONE = 0;
        // Get static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus NONE
        static HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus _get_NONE();
        // Set static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus NONE
        static void _set_NONE(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus value);
        // static field const value: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus STARTED
        static constexpr const int STARTED = 1;
        // Get static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus STARTED
        static HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus _get_STARTED();
        // Set static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus STARTED
        static void _set_STARTED(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus value);
        // static field const value: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus SUCCESS
        static constexpr const int SUCCESS = 2;
        // Get static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus SUCCESS
        static HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus _get_SUCCESS();
        // Set static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus SUCCESS
        static void _set_SUCCESS(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus value);
        // static field const value: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus ERROR
        static constexpr const int ERROR = 3;
        // Get static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus ERROR
        static HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus _get_ERROR();
        // Set static field: static public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus ERROR
        static void _set_ERROR(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus value);
        // Get instance field reference: public System.Int32 value__
        int& dyn_value__();
      }; // HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus
      #pragma pack(pop)
      static check_size<sizeof(HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_ThreadedTaskLoadGeo_HEU_LoadData_LoadStatusSizeCheck;
      static_assert(sizeof(HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus) == 0x4);
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      #ifdef CODEGEN_FIELD_ACCESSIBILITY
      CODEGEN_FIELD_ACCESSIBILITY:
      #else
      protected:
      #endif
      #endif
      // public System.Int32 _cookNodeID
      // Size: 0x4
      // Offset: 0x10
      int cookNodeID;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus _loadStatus
      // Size: 0x4
      // Offset: 0x14
      HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus loadStatus;
      // Field size check
      static_assert(sizeof(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus) == 0x4);
      // public System.Text.StringBuilder _logStr
      // Size: 0x8
      // Offset: 0x18
      System::Text::StringBuilder* logStr;
      // Field size check
      static_assert(sizeof(System::Text::StringBuilder*) == 0x8);
      // public HoudiniEngineUnity.HEU_SessionBase _session
      // Size: 0x8
      // Offset: 0x20
      HoudiniEngineUnity::HEU_SessionBase* session;
      // Field size check
      static_assert(sizeof(HoudiniEngineUnity::HEU_SessionBase*) == 0x8);
      // public System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadObject> _loadedObjects
      // Size: 0x8
      // Offset: 0x28
      System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadObject*>* loadedObjects;
      // Field size check
      static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadObject*>*) == 0x8);
      // public System.Collections.Generic.Dictionary`2<System.Int32,HoudiniEngineUnity.HEU_LoadBufferBase> _idBuffersMap
      // Size: 0x8
      // Offset: 0x30
      System::Collections::Generic::Dictionary_2<int, HoudiniEngineUnity::HEU_LoadBufferBase*>* idBuffersMap;
      // Field size check
      static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, HoudiniEngineUnity::HEU_LoadBufferBase*>*) == 0x8);
      public:
      // Get instance field reference: public System.Int32 _cookNodeID
      int& dyn__cookNodeID();
      // Get instance field reference: public HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus _loadStatus
      HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus& dyn__loadStatus();
      // Get instance field reference: public System.Text.StringBuilder _logStr
      System::Text::StringBuilder*& dyn__logStr();
      // Get instance field reference: public HoudiniEngineUnity.HEU_SessionBase _session
      HoudiniEngineUnity::HEU_SessionBase*& dyn__session();
      // Get instance field reference: public System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadObject> _loadedObjects
      System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadObject*>*& dyn__loadedObjects();
      // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.Int32,HoudiniEngineUnity.HEU_LoadBufferBase> _idBuffersMap
      System::Collections::Generic::Dictionary_2<int, HoudiniEngineUnity::HEU_LoadBufferBase*>*& dyn__idBuffersMap();
      // public System.Void .ctor()
      // Offset: 0x19A3720
      // Implemented from: System.Object
      // Base method: System.Void Object::.ctor()
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static HEU_ThreadedTaskLoadGeo::HEU_LoadData* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<HEU_ThreadedTaskLoadGeo::HEU_LoadData*, creationType>()));
      }
    }; // HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData
    #pragma pack(pop)
    static check_size<sizeof(HEU_ThreadedTaskLoadGeo::HEU_LoadData), 48 + sizeof(System::Collections::Generic::Dictionary_2<int, HoudiniEngineUnity::HEU_LoadBufferBase*>*)> __HoudiniEngineUnity_HEU_ThreadedTaskLoadGeo_HEU_LoadDataSizeCheck;
    static_assert(sizeof(HEU_ThreadedTaskLoadGeo::HEU_LoadData) == 0x38);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private HoudiniEngineUnity.HEU_BaseSync _ownerSync
    // Size: 0x8
    // Offset: 0x38
    HoudiniEngineUnity::HEU_BaseSync* ownerSync;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_BaseSync*) == 0x8);
    // private HoudiniEngineUnity.HEU_SessionBase _session
    // Size: 0x8
    // Offset: 0x40
    HoudiniEngineUnity::HEU_SessionBase* session;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_SessionBase*) == 0x8);
    // private HoudiniEngineUnity.HEU_GenerateOptions _generateOptions
    // Size: 0x5
    // Offset: 0x48
    HoudiniEngineUnity::HEU_GenerateOptions generateOptions;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_GenerateOptions) == 0x5);
    // Padding between fields: generateOptions and: loadType
    char __padding2[0x3] = {};
    // private HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType _loadType
    // Size: 0x4
    // Offset: 0x50
    HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType loadType;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType) == 0x4);
    // Padding between fields: loadType and: filePath
    char __padding3[0x4] = {};
    // private System.String _filePath
    // Size: 0x8
    // Offset: 0x58
    ::StringW filePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData _loadData
    // Size: 0x8
    // Offset: 0x60
    HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData* loadData;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData*) == 0x8);
    // private HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadCallback _loadCallback
    // Size: 0x8
    // Offset: 0x68
    HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadCallback* loadCallback;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadCallback*) == 0x8);
    public:
    // Get instance field reference: private HoudiniEngineUnity.HEU_BaseSync _ownerSync
    HoudiniEngineUnity::HEU_BaseSync*& dyn__ownerSync();
    // Get instance field reference: private HoudiniEngineUnity.HEU_SessionBase _session
    HoudiniEngineUnity::HEU_SessionBase*& dyn__session();
    // Get instance field reference: private HoudiniEngineUnity.HEU_GenerateOptions _generateOptions
    HoudiniEngineUnity::HEU_GenerateOptions& dyn__generateOptions();
    // Get instance field reference: private HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType _loadType
    HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType& dyn__loadType();
    // Get instance field reference: private System.String _filePath
    ::StringW& dyn__filePath();
    // Get instance field reference: private HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData _loadData
    HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData*& dyn__loadData();
    // Get instance field reference: private HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadCallback _loadCallback
    HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadCallback*& dyn__loadCallback();
    // public System.Void SetupLoad(HoudiniEngineUnity.HEU_SessionBase session, HoudiniEngineUnity.HEU_BaseSync ownerSync, HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.LoadType loadType, System.Int32 cookNodeID, System.String name, System.String filePath)
    // Offset: 0x19A362C
    void SetupLoad(HoudiniEngineUnity::HEU_SessionBase* session, HoudiniEngineUnity::HEU_BaseSync* ownerSync, HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType loadType, int cookNodeID, ::StringW name, ::StringW filePath);
    // public System.Void SetupLoadNode(HoudiniEngineUnity.HEU_SessionBase session, HoudiniEngineUnity.HEU_BaseSync ownerSync, System.Int32 cookNodeID, System.String name)
    // Offset: 0x19A3728
    void SetupLoadNode(HoudiniEngineUnity::HEU_SessionBase* session, HoudiniEngineUnity::HEU_BaseSync* ownerSync, int cookNodeID, ::StringW name);
    // public System.Void SetupLoadFile(HoudiniEngineUnity.HEU_SessionBase session, HoudiniEngineUnity.HEU_BaseSync ownerSync, System.Int32 cookNodeID, System.String filePath)
    // Offset: 0x19A373C
    void SetupLoadFile(HoudiniEngineUnity::HEU_SessionBase* session, HoudiniEngineUnity::HEU_BaseSync* ownerSync, int cookNodeID, ::StringW filePath);
    // public System.Void SetupLoadAsset(HoudiniEngineUnity.HEU_SessionBase session, HoudiniEngineUnity.HEU_BaseSync ownerSync, System.String assetPath, System.String name)
    // Offset: 0x19A3750
    void SetupLoadAsset(HoudiniEngineUnity::HEU_SessionBase* session, HoudiniEngineUnity::HEU_BaseSync* ownerSync, ::StringW assetPath, ::StringW name);
    // public System.Void SetLoadCallback(HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadCallback loadCallback)
    // Offset: 0x19A3764
    void SetLoadCallback(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadCallback* loadCallback);
    // protected System.Boolean CookNode(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 cookNodeID)
    // Offset: 0x19A3F80
    bool CookNode(HoudiniEngineUnity::HEU_SessionBase* session, int cookNodeID);
    // protected System.Boolean LoadObjectBuffers(HoudiniEngineUnity.HEU_SessionBase session, ref HoudiniEngineUnity.HAPI_ObjectInfo objectInfo)
    // Offset: 0x19A4158
    bool LoadObjectBuffers(HoudiniEngineUnity::HEU_SessionBase* session, ByRef<HoudiniEngineUnity::HAPI_ObjectInfo> objectInfo);
    // protected System.Boolean LoadNodeBuffer(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 nodeID, HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadObject loadObject)
    // Offset: 0x19A42D8
    bool LoadNodeBuffer(HoudiniEngineUnity::HEU_SessionBase* session, int nodeID, HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadObject* loadObject);
    // protected System.Void BuildBufferIDsMap(HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData loadData)
    // Offset: 0x19A6398
    void BuildBufferIDsMap(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData* loadData);
    // public System.Boolean DoFileLoad()
    // Offset: 0x19A67AC
    bool DoFileLoad();
    // public System.Boolean DoAssetLoad()
    // Offset: 0x19A6C30
    bool DoAssetLoad();
    // private System.Boolean QueryParts(System.Int32 nodeID, ref System.Collections.Generic.List`1<HoudiniEngineUnity.HAPI_PartInfo> meshParts, ref System.Collections.Generic.List`1<HoudiniEngineUnity.HAPI_PartInfo> volumeParts, ref System.Collections.Generic.List`1<HoudiniEngineUnity.HAPI_PartInfo> instancerParts, ref System.Collections.Generic.List`1<HoudiniEngineUnity.HAPI_PartInfo> curveParts, ref System.Collections.Generic.List`1<HoudiniEngineUnity.HAPI_PartInfo> scatterInstancerParts)
    // Offset: 0x19A45B8
    bool QueryParts(int nodeID, ByRef<System::Collections::Generic::List_1<HoudiniEngineUnity::HAPI_PartInfo>*> meshParts, ByRef<System::Collections::Generic::List_1<HoudiniEngineUnity::HAPI_PartInfo>*> volumeParts, ByRef<System::Collections::Generic::List_1<HoudiniEngineUnity::HAPI_PartInfo>*> instancerParts, ByRef<System::Collections::Generic::List_1<HoudiniEngineUnity::HAPI_PartInfo>*> curveParts, ByRef<System::Collections::Generic::List_1<HoudiniEngineUnity::HAPI_PartInfo>*> scatterInstancerParts);
    // private System.String CreateLogString(HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus status, System.String logStr)
    // Offset: 0x19A70D4
    ::StringW CreateLogString(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus status, ::StringW logStr);
    // private System.Void AppendLog(HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus status, System.String logStr)
    // Offset: 0x19A3A80
    void AppendLog(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus status, ::StringW logStr);
    // private System.Void SetLog(HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo/HoudiniEngineUnity.HEU_LoadData/HoudiniEngineUnity.LoadStatus status, System.String logStr)
    // Offset: 0x19A7184
    void SetLog(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus status, ::StringW logStr);
    // private System.Boolean CreateFileNode(out System.Int32 fileNodeID)
    // Offset: 0x19A6A80
    bool CreateFileNode(ByRef<int> fileNodeID);
    // public System.Int32 GetCookNodeID()
    // Offset: 0x19A72A4
    int GetCookNodeID();
    // private System.Int32 GetDisplayNodeID(System.Int32 objNodeID)
    // Offset: 0x19A6B10
    int GetDisplayNodeID(int objNodeID);
    // private System.Boolean SetFileParm(System.Int32 fileNodeID, System.String filePath)
    // Offset: 0x19A6B68
    bool SetFileParm(int fileNodeID, ::StringW filePath);
    // private System.Void Sleep()
    // Offset: 0x19A414C
    void Sleep();
    // public System.Boolean GenerateTerrainBuffers(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 nodeID, System.Collections.Generic.List`1<HoudiniEngineUnity.HAPI_PartInfo> volumeParts, System.Collections.Generic.List`1<HoudiniEngineUnity.HAPI_PartInfo> scatterInstancerParts, out System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_LoadBufferVolume> volumeBuffers)
    // Offset: 0x19A4D40
    bool GenerateTerrainBuffers(HoudiniEngineUnity::HEU_SessionBase* session, int nodeID, System::Collections::Generic::List_1<HoudiniEngineUnity::HAPI_PartInfo>* volumeParts, System::Collections::Generic::List_1<HoudiniEngineUnity::HAPI_PartInfo>* scatterInstancerParts, ByRef<System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_LoadBufferVolume*>*> volumeBuffers);
    // private System.Void LoadStringFromAttribute(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 geoID, System.Int32 partID, System.String attrName, ref System.String strValue)
    // Offset: 0x19A72C0
    void LoadStringFromAttribute(HoudiniEngineUnity::HEU_SessionBase* session, int geoID, int partID, ::StringW attrName, ByRef<::StringW> strValue);
    // private System.Void LoadFloatFromAttribute(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 geoID, System.Int32 partID, System.String attrName, ref System.Single floatValue)
    // Offset: 0x19A7354
    void LoadFloatFromAttribute(HoudiniEngineUnity::HEU_SessionBase* session, int geoID, int partID, ::StringW attrName, ByRef<float> floatValue);
    // private System.Void LoadLayerColorFromAttribute(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 geoID, System.Int32 partID, System.String attrName, ref UnityEngine.Color colorValue)
    // Offset: 0x19A7474
    void LoadLayerColorFromAttribute(HoudiniEngineUnity::HEU_SessionBase* session, int geoID, int partID, ::StringW attrName, ByRef<UnityEngine::Color> colorValue);
    // private System.Void LoadLayerVector2FromAttribute(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 geoID, System.Int32 partID, System.String attrName, ref UnityEngine.Vector2 vectorValue)
    // Offset: 0x19A7638
    void LoadLayerVector2FromAttribute(HoudiniEngineUnity::HEU_SessionBase* session, int geoID, int partID, ::StringW attrName, ByRef<UnityEngine::Vector2> vectorValue);
    // public System.Boolean GenerateMeshBuffers(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 nodeID, System.Collections.Generic.List`1<HoudiniEngineUnity.HAPI_PartInfo> meshParts, System.Boolean bSplitPoints, System.Boolean bUseLODGroups, System.Boolean bGenerateUVs, System.Boolean bGenerateTangents, System.Boolean bGenerateNormals, out System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_LoadBufferMesh> meshBuffers)
    // Offset: 0x19A493C
    bool GenerateMeshBuffers(HoudiniEngineUnity::HEU_SessionBase* session, int nodeID, System::Collections::Generic::List_1<HoudiniEngineUnity::HAPI_PartInfo>* meshParts, bool bSplitPoints, bool bUseLODGroups, bool bGenerateUVs, bool bGenerateTangents, bool bGenerateNormals, ByRef<System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_LoadBufferMesh*>*> meshBuffers);
    // public System.Boolean GenerateInstancerBuffers(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 nodeID, System.Collections.Generic.List`1<HoudiniEngineUnity.HAPI_PartInfo> instancerParts, out System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_LoadBufferInstancer> instancerBuffers)
    // Offset: 0x19A6078
    bool GenerateInstancerBuffers(HoudiniEngineUnity::HEU_SessionBase* session, int nodeID, System::Collections::Generic::List_1<HoudiniEngineUnity::HAPI_PartInfo>* instancerParts, ByRef<System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_LoadBufferInstancer*>*> instancerBuffers);
    // private HoudiniEngineUnity.HEU_LoadBufferInstancer GeneratePartsInstancerBuffer(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 geoID, System.Int32 partID, System.String partName, HoudiniEngineUnity.HAPI_PartInfo partInfo)
    // Offset: 0x19A78B4
    HoudiniEngineUnity::HEU_LoadBufferInstancer* GeneratePartsInstancerBuffer(HoudiniEngineUnity::HEU_SessionBase* session, int geoID, int partID, ::StringW partName, HoudiniEngineUnity::HAPI_PartInfo partInfo);
    // private HoudiniEngineUnity.HEU_LoadBufferInstancer GeneratePointAttributeInstancerBuffer(HoudiniEngineUnity.HEU_SessionBase session, System.Int32 geoID, System.Int32 partID, System.String partName, HoudiniEngineUnity.HAPI_PartInfo partInfo)
    // Offset: 0x19A7B2C
    HoudiniEngineUnity::HEU_LoadBufferInstancer* GeneratePointAttributeInstancerBuffer(HoudiniEngineUnity::HEU_SessionBase* session, int geoID, int partID, ::StringW partName, HoudiniEngineUnity::HAPI_PartInfo partInfo);
    // static public HoudiniEngineUnity.HEU_LoadBufferVolume GetLoadBufferVolumeFromTileIndex(System.Int32 tileIndex, System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_LoadBufferVolume> buffers)
    // Offset: 0x19A77A0
    static HoudiniEngineUnity::HEU_LoadBufferVolume* GetLoadBufferVolumeFromTileIndex(int tileIndex, System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_LoadBufferVolume*>* buffers);
    // public System.Void .ctor()
    // Offset: 0x19A7EAC
    // Implemented from: HoudiniEngineUnity.HEU_ThreadedTask
    // Base method: System.Void HEU_ThreadedTask::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static HEU_ThreadedTaskLoadGeo* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<HEU_ThreadedTaskLoadGeo*, creationType>()));
    }
    // protected override System.Void DoWork()
    // Offset: 0x19A376C
    // Implemented from: HoudiniEngineUnity.HEU_ThreadedTask
    // Base method: System.Void HEU_ThreadedTask::DoWork()
    void DoWork();
    // protected override System.Void OnComplete()
    // Offset: 0x19A6F90
    // Implemented from: HoudiniEngineUnity.HEU_ThreadedTask
    // Base method: System.Void HEU_ThreadedTask::OnComplete()
    void OnComplete();
    // protected override System.Void OnStopped()
    // Offset: 0x19A7030
    // Implemented from: HoudiniEngineUnity.HEU_ThreadedTask
    // Base method: System.Void HEU_ThreadedTask::OnStopped()
    void OnStopped();
    // protected override System.Void CleanUp()
    // Offset: 0x19A70C8
    // Implemented from: HoudiniEngineUnity.HEU_ThreadedTask
    // Base method: System.Void HEU_ThreadedTask::CleanUp()
    void CleanUp();
  }; // HoudiniEngineUnity.HEU_ThreadedTaskLoadGeo
  #pragma pack(pop)
  static check_size<sizeof(HEU_ThreadedTaskLoadGeo), 104 + sizeof(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadCallback*)> __HoudiniEngineUnity_HEU_ThreadedTaskLoadGeoSizeCheck;
  static_assert(sizeof(HEU_ThreadedTaskLoadGeo) == 0x70);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData);
DEFINE_IL2CPP_ARG_TYPE(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData*, "HoudiniEngineUnity", "HEU_ThreadedTaskLoadGeo/HEU_LoadData");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::HEU_LoadData::LoadStatus, "HoudiniEngineUnity", "HEU_ThreadedTaskLoadGeo/HEU_LoadData/LoadStatus");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::LoadType, "HoudiniEngineUnity", "HEU_ThreadedTaskLoadGeo/LoadType");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: HoudiniEngineUnity::HEU_ThreadedTaskLoadGeo::SetupLoad
// Il2CppName: SetupLoad
template<>
