// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: HoudiniEngineUnity.HAPI_PDG_WorkitemResultInfo
#include "HoudiniEngineUnity/HAPI_PDG_WorkitemResultInfo.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_WorkItemTally
  class HEU_WorkItemTally;
  // Forward declaring type: HEU_HoudiniAsset
  class HEU_HoudiniAsset;
  // Forward declaring type: HEU_TOPNetworkData
  class HEU_TOPNetworkData;
  // Skipping declaration: LinkState because it is already included!
  // Forward declaring type: HEU_CookedEventData
  class HEU_CookedEventData;
  // Forward declaring type: HEU_ReloadEventData
  class HEU_ReloadEventData;
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
  // Forward declaring type: HEU_TOPNodeData
  class HEU_TOPNodeData;
  // Forward declaring type: HEU_TOPWorkResult
  class HEU_TOPWorkResult;
  // Forward declaring type: HAPI_PDG_WorkitemInfo
  struct HAPI_PDG_WorkitemInfo;
  // Forward declaring type: HAPI_NodeInfo
  struct HAPI_NodeInfo;
  // Forward declaring type: TOPNodeTags
  class TOPNodeTags;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_PDGAssetLink
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class HEU_PDGAssetLink : public UnityEngine::MonoBehaviour/*, public UnityEngine::ISerializationCallbackReceiver*/ {
    public:
    // Nested type: HoudiniEngineUnity::HEU_PDGAssetLink::LinkState
    struct LinkState;
    // Nested type: HoudiniEngineUnity::HEU_PDGAssetLink::UpdateUIDelegate
    class UpdateUIDelegate;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState
    // [TokenAttribute] Offset: FFFFFFFF
    struct LinkState/*, public System::Enum*/ {
      public:
      #ifdef USE_CODEGEN_FIELDS
      public:
      #else
      protected:
      #endif
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LinkState
      constexpr LinkState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState INACTIVE
      static constexpr const int INACTIVE = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState INACTIVE
      static HoudiniEngineUnity::HEU_PDGAssetLink::LinkState _get_INACTIVE();
      // Set static field: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState INACTIVE
      static void _set_INACTIVE(HoudiniEngineUnity::HEU_PDGAssetLink::LinkState value);
      // static field const value: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState LINKING
      static constexpr const int LINKING = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState LINKING
      static HoudiniEngineUnity::HEU_PDGAssetLink::LinkState _get_LINKING();
      // Set static field: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState LINKING
      static void _set_LINKING(HoudiniEngineUnity::HEU_PDGAssetLink::LinkState value);
      // static field const value: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState LINKED
      static constexpr const int LINKED = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState LINKED
      static HoudiniEngineUnity::HEU_PDGAssetLink::LinkState _get_LINKED();
      // Set static field: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState LINKED
      static void _set_LINKED(HoudiniEngineUnity::HEU_PDGAssetLink::LinkState value);
      // static field const value: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState ERROR_NOT_LINKED
      static constexpr const int ERROR_NOT_LINKED = 3;
      // Get static field: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState ERROR_NOT_LINKED
      static HoudiniEngineUnity::HEU_PDGAssetLink::LinkState _get_ERROR_NOT_LINKED();
      // Set static field: static public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState ERROR_NOT_LINKED
      static void _set_ERROR_NOT_LINKED(HoudiniEngineUnity::HEU_PDGAssetLink::LinkState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState
    #pragma pack(pop)
    static check_size<sizeof(HEU_PDGAssetLink::LinkState), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_PDGAssetLink_LinkStateSizeCheck;
    static_assert(sizeof(HEU_PDGAssetLink::LinkState) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    protected:
    #endif
    // private System.String _assetPath
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* assetPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private UnityEngine.GameObject _assetGO
    // Size: 0x8
    // Offset: 0x20
    UnityEngine::GameObject* assetGO;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private System.String _assetName
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* assetName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Int32 _assetID
    // Size: 0x4
    // Offset: 0x30
    int assetID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: assetID and: heu
    char __padding3[0x4] = {};
    // private HoudiniEngineUnity.HEU_HoudiniAsset _heu
    // Size: 0x8
    // Offset: 0x38
    HoudiniEngineUnity::HEU_HoudiniAsset* heu;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_HoudiniAsset*) == 0x8);
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_TOPNetworkData> _topNetworks
    // Size: 0x8
    // Offset: 0x40
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_TOPNetworkData*>* topNetworks;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_TOPNetworkData*>*) == 0x8);
    // public System.String[] _topNetworkNames
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::Il2CppString*> topNetworkNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppString*>) == 0x8);
    // private System.Int32 _selectedTOPNetwork
    // Size: 0x4
    // Offset: 0x50
    int selectedTOPNetwork;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.LinkState _linkState
    // Size: 0x4
    // Offset: 0x54
    HoudiniEngineUnity::HEU_PDGAssetLink::LinkState linkState;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_PDGAssetLink::LinkState) == 0x4);
    // public System.Boolean _autoCook
    // Size: 0x1
    // Offset: 0x58
    bool autoCook;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean _useHEngineData
    // Size: 0x1
    // Offset: 0x59
    bool useHEngineData;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useHEngineData and: repaintUIDelegate
    char __padding10[0x6] = {};
    // public HoudiniEngineUnity.HEU_PDGAssetLink/HoudiniEngineUnity.UpdateUIDelegate _repaintUIDelegate
    // Size: 0x8
    // Offset: 0x60
    HoudiniEngineUnity::HEU_PDGAssetLink::UpdateUIDelegate* repaintUIDelegate;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_PDGAssetLink::UpdateUIDelegate*) == 0x8);
    // private System.Int32 _numWorkItems
    // Size: 0x4
    // Offset: 0x68
    int numWorkItems;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: numWorkItems and: workItemTally
    char __padding12[0x4] = {};
    // public HoudiniEngineUnity.HEU_WorkItemTally _workItemTally
    // Size: 0x8
    // Offset: 0x70
    HoudiniEngineUnity::HEU_WorkItemTally* workItemTally;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_WorkItemTally*) == 0x8);
    // public UnityEngine.GameObject _loadRootGameObject
    // Size: 0x8
    // Offset: 0x78
    UnityEngine::GameObject* loadRootGameObject;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private System.String _outputCachePathRoot
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppString* outputCachePathRoot;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    public:
    // Creating interface conversion operator: operator UnityEngine::ISerializationCallbackReceiver
    operator UnityEngine::ISerializationCallbackReceiver() noexcept {
      return *reinterpret_cast<UnityEngine::ISerializationCallbackReceiver*>(this);
    }
    // Deleting conversion operator: operator System::IntPtr
    constexpr operator System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.String _assetPath
    ::Il2CppString*& dyn__assetPath();
    // Get instance field reference: private UnityEngine.GameObject _assetGO
    UnityEngine::GameObject*& dyn__assetGO();
    // Get instance field reference: private System.String _assetName
    ::Il2CppString*& dyn__assetName();
    // Get instance field reference: private System.Int32 _assetID
    int& dyn__assetID();
