// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: HoudiniEngineUnity.HAPI_GeoInfo
#include "HoudiniEngineUnity/HAPI_GeoInfo.hpp"
// Including type: HoudiniEngineUnity.HAPI_PartInfo
#include "HoudiniEngineUnity/HAPI_PartInfo.hpp"
// Including type: HoudiniEngineUnity.HAPI_AttributeInfo
#include "HoudiniEngineUnity/HAPI_AttributeInfo.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
#include "extern/beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_UnityMaterialInfo
  class HEU_UnityMaterialInfo;
  // Forward declaring type: HEU_MaterialData
  class HEU_MaterialData;
  // Forward declaring type: HEU_MeshIndexFormat
  class HEU_MeshIndexFormat;
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
  // Forward declaring type: HEU_GeneratedOutputData
  class HEU_GeneratedOutputData;
  // Forward declaring type: HEU_GeoGroup
  class HEU_GeoGroup;
  // Forward declaring type: HEU_GeneratedOutput
  class HEU_GeneratedOutput;
  // Forward declaring type: HEU_MeshData
  class HEU_MeshData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: MeshTopology
  struct MeshTopology;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x2B8
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_GenerateGeoCache
  // [TokenAttribute] Offset: FFFFFFFF
  class HEU_GenerateGeoCache : public ::Il2CppObject {
    public:
    // Nested type: HoudiniEngineUnity::HEU_GenerateGeoCache::HEU_ColliderInfo
    class HEU_ColliderInfo;
    // Nested type: HoudiniEngineUnity::HEU_GenerateGeoCache::$$c
    class $$c;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    private:
    #endif
    // private System.Int32 <AssetID>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    int AssetID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public HoudiniEngineUnity.HAPI_GeoInfo _geoInfo
    // Size: 0x24
    // Offset: 0x14
    HoudiniEngineUnity::HAPI_GeoInfo geoInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_GeoInfo) == 0x24);
    // public HoudiniEngineUnity.HAPI_PartInfo _partInfo
    // Size: 0x2D
    // Offset: 0x38
    HoudiniEngineUnity::HAPI_PartInfo partInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_PartInfo) == 0x2D);
    // Padding between fields: partInfo and: partName
    char __padding2[0x3] = {};
    // public System.String _partName
    // Size: 0x8
    // Offset: 0x68
    ::Il2CppString* partName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.Int32[] _vertexList
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<int> vertexList;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Int32[] _faceCounts
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<int> faceCounts;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Int32[] _houdiniMaterialIDs
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<int> houdiniMaterialIDs;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Boolean _singleFaceUnityMaterial
    // Size: 0x1
    // Offset: 0x88
    bool singleFaceUnityMaterial;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean _singleFaceHoudiniMaterial
    // Size: 0x1
    // Offset: 0x89
    bool singleFaceHoudiniMaterial;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: singleFaceHoudiniMaterial and: unityMaterialInfos
    char __padding8[0x6] = {};
    // public System.Collections.Generic.Dictionary`2<System.Int32,HoudiniEngineUnity.HEU_UnityMaterialInfo> _unityMaterialInfos
    // Size: 0x8
    // Offset: 0x90
    System::Collections::Generic::Dictionary_2<int, HoudiniEngineUnity::HEU_UnityMaterialInfo*>* unityMaterialInfos;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, HoudiniEngineUnity::HEU_UnityMaterialInfo*>*) == 0x8);
    // public HoudiniEngineUnity.HAPI_AttributeInfo _unityMaterialAttrInfo
    // Size: 0x24
    // Offset: 0x98
    HoudiniEngineUnity::HAPI_AttributeInfo unityMaterialAttrInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_AttributeInfo) == 0x24);
    // Padding between fields: unityMaterialAttrInfo and: unityMaterialAttrName
    char __padding10[0x4] = {};
    // public System.Int32[] _unityMaterialAttrName
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<int> unityMaterialAttrName;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Int32,System.String> _unityMaterialAttrStringsMap
    // Size: 0x8
    // Offset: 0xC8
    System::Collections::Generic::Dictionary_2<int, ::Il2CppString*>* unityMaterialAttrStringsMap;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, ::Il2CppString*>*) == 0x8);
    // public HoudiniEngineUnity.HAPI_AttributeInfo _substanceMaterialAttrNameInfo
    // Size: 0x24
    // Offset: 0xD0
    HoudiniEngineUnity::HAPI_AttributeInfo substanceMaterialAttrNameInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_AttributeInfo) == 0x24);
    // Padding between fields: substanceMaterialAttrNameInfo and: substanceMaterialAttrName
    char __padding13[0x4] = {};
    // public System.Int32[] _substanceMaterialAttrName
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<int> substanceMaterialAttrName;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Int32,System.String> _substanceMaterialAttrStringsMap
    // Size: 0x8
    // Offset: 0x100
    System::Collections::Generic::Dictionary_2<int, ::Il2CppString*>* substanceMaterialAttrStringsMap;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, ::Il2CppString*>*) == 0x8);
    // public HoudiniEngineUnity.HAPI_AttributeInfo _substanceMaterialAttrIndexInfo
    // Size: 0x24
    // Offset: 0x108
    HoudiniEngineUnity::HAPI_AttributeInfo substanceMaterialAttrIndexInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_AttributeInfo) == 0x24);
    // Padding between fields: substanceMaterialAttrIndexInfo and: substanceMaterialAttrIndex
    char __padding16[0x4] = {};
    // public System.Int32[] _substanceMaterialAttrIndex
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<int> substanceMaterialAttrIndex;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_MaterialData> _inUseMaterials
    // Size: 0x8
    // Offset: 0x138
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_MaterialData*>* inUseMaterials;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_MaterialData*>*) == 0x8);
    // public HoudiniEngineUnity.HAPI_AttributeInfo _posAttrInfo
    // Size: 0x24
    // Offset: 0x140
    HoudiniEngineUnity::HAPI_AttributeInfo posAttrInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_AttributeInfo) == 0x24);
    // Padding between fields: posAttrInfo and: uvsAttrInfo
    char __padding19[0x4] = {};
    // public HoudiniEngineUnity.HAPI_AttributeInfo[] _uvsAttrInfo
    // Size: 0x8
    // Offset: 0x168
    ::ArrayW<HoudiniEngineUnity::HAPI_AttributeInfo> uvsAttrInfo;
    // Field size check
    static_assert(sizeof(::ArrayW<HoudiniEngineUnity::HAPI_AttributeInfo>) == 0x8);
    // public HoudiniEngineUnity.HAPI_AttributeInfo _normalAttrInfo
    // Size: 0x24
    // Offset: 0x170
    HoudiniEngineUnity::HAPI_AttributeInfo normalAttrInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_AttributeInfo) == 0x24);
    // Padding between fields: normalAttrInfo and: colorAttrInfo
    char __padding21[0x4] = {};
    // public HoudiniEngineUnity.HAPI_AttributeInfo _colorAttrInfo
    // Size: 0x24
    // Offset: 0x198
    HoudiniEngineUnity::HAPI_AttributeInfo colorAttrInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_AttributeInfo) == 0x24);
    // Padding between fields: colorAttrInfo and: alphaAttrInfo
    char __padding22[0x4] = {};
    // public HoudiniEngineUnity.HAPI_AttributeInfo _alphaAttrInfo
    // Size: 0x24
    // Offset: 0x1C0
    HoudiniEngineUnity::HAPI_AttributeInfo alphaAttrInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_AttributeInfo) == 0x24);
    // Padding between fields: alphaAttrInfo and: tangentAttrInfo
    char __padding23[0x4] = {};
    // public HoudiniEngineUnity.HAPI_AttributeInfo _tangentAttrInfo
    // Size: 0x24
    // Offset: 0x1E8
    HoudiniEngineUnity::HAPI_AttributeInfo tangentAttrInfo;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_AttributeInfo) == 0x24);
    // Padding between fields: tangentAttrInfo and: posAttr
    char __padding24[0x4] = {};
    // public System.Single[] _posAttr
    // Size: 0x8
    // Offset: 0x210
    ::ArrayW<float> posAttr;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Single[][] _uvsAttr
    // Size: 0x8
    // Offset: 0x218
    ::ArrayW<::ArrayW<float>> uvsAttr;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<float>>) == 0x8);
    // public System.Single[] _normalAttr
    // Size: 0x8
    // Offset: 0x220
    ::ArrayW<float> normalAttr;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Single[] _colorAttr
    // Size: 0x8
    // Offset: 0x228
    ::ArrayW<float> colorAttr;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Single[] _alphaAttr
    // Size: 0x8
    // Offset: 0x230
    ::ArrayW<float> alphaAttr;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Single[] _tangentAttr
    // Size: 0x8
    // Offset: 0x238
    ::ArrayW<float> tangentAttr;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.String[] _groups
    // Size: 0x8
    // Offset: 0x240
    ::ArrayW<::Il2CppString*> groups;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppString*>) == 0x8);
    // public System.Boolean _hasGroupGeometry
    // Size: 0x1
    // Offset: 0x248
    bool hasGroupGeometry;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasGroupGeometry and: groupSplitVertexIndices
    char __padding32[0x7] = {};
    // public System.Collections.Generic.Dictionary`2<System.String,System.Int32[]> _groupSplitVertexIndices
    // Size: 0x8
    // Offset: 0x250
    System::Collections::Generic::Dictionary_2<::Il2CppString*, ::ArrayW<int>>* groupSplitVertexIndices;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, ::ArrayW<int>>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<System.Int32>> _groupSplitFaceIndices
    // Size: 0x8
    // Offset: 0x258
    System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Collections::Generic::List_1<int>*>* groupSplitFaceIndices;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Collections::Generic::List_1<int>*>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<System.Int32>> _groupVertexOffsets
    // Size: 0x8
    // Offset: 0x260
    System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Collections::Generic::List_1<int>*>* groupVertexOffsets;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<::Il2CppString*, System::Collections::Generic::List_1<int>*>*) == 0x8);
    // public System.Int32[] _allCollisionVertexList
    // Size: 0x8
    // Offset: 0x268
    ::ArrayW<int> allCollisionVertexList;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Int32[] _allCollisionFaceIndices
    // Size: 0x8
    // Offset: 0x270
    ::ArrayW<int> allCollisionFaceIndices;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Single _normalCosineThreshold
    // Size: 0x4
    // Offset: 0x278
    float normalCosineThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean _hasLODGroups
    // Size: 0x1
    // Offset: 0x27C
    bool hasLODGroups;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasLODGroups and: LODTransitionValues
    char __padding39[0x3] = {};
    // public System.Single[] _LODTransitionValues
    // Size: 0x8
    // Offset: 0x280
    ::ArrayW<float> LODTransitionValues;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Boolean _isMeshReadWrite
    // Size: 0x1
    // Offset: 0x288
    bool isMeshReadWrite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isMeshReadWrite and: colliderInfos
    char __padding41[0x7] = {};
    // public System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_GenerateGeoCache/HoudiniEngineUnity.HEU_ColliderInfo> _colliderInfos
    // Size: 0x8
    // Offset: 0x290
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_GenerateGeoCache::HEU_ColliderInfo*>* colliderInfos;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_GenerateGeoCache::HEU_ColliderInfo*>*) == 0x8);
    // public System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_MaterialData> _materialCache
    // Size: 0x8
    // Offset: 0x298
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_MaterialData*>* materialCache;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_MaterialData*>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Int32,HoudiniEngineUnity.HEU_MaterialData> _materialIDToDataMap
    // Size: 0x8
    // Offset: 0x2A0
    System::Collections::Generic::Dictionary_2<int, HoudiniEngineUnity::HEU_MaterialData*>* materialIDToDataMap;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::Dictionary_2<int, HoudiniEngineUnity::HEU_MaterialData*>*) == 0x8);
    // public System.String _assetCacheFolderPath
    // Size: 0x8
    // Offset: 0x2A8
    ::Il2CppString* assetCacheFolderPath;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public HoudiniEngineUnity.HEU_MeshIndexFormat _meshIndexFormat
    // Size: 0x8
    // Offset: 0x2B0
    HoudiniEngineUnity::HEU_MeshIndexFormat* meshIndexFormat;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_MeshIndexFormat*) == 0x8);
    public:
    // Get instance field reference: private System.Int32 <AssetID>k__BackingField
    int& dyn_$AssetID$k__BackingField();
    // Get instance field reference: public HoudiniEngineUnity.HAPI_GeoInfo _geoInfo
    HoudiniEngineUnity::HAPI_GeoInfo& dyn__geoInfo();
    // Get instance field reference: public HoudiniEngineUnity.HAPI_PartInfo _partInfo
    HoudiniEngineUnity::HAPI_PartInfo& dyn__partInfo();
    // Get instance field reference: public System.String _partName
    ::Il2CppString*& dyn__partName();
    // Get instance field reference: public System.Int32[] _vertexList
    ::ArrayW<int>& dyn__vertexList();
    // Get instance field reference: public System.Int32[] _faceCounts
    ::ArrayW<int>& dyn__faceCounts();
