// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: HoudiniEngineUnity.IEquivable`1
#include "HoudiniEngineUnity/IEquivable_1.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_HoudiniAsset
  class HEU_HoudiniAsset;
  // Skipping declaration: CurveEditState because it is already included!
  // Forward declaring type: CurveNodeData
  class CurveNodeData;
  // Forward declaring type: HEU_Parameters
  class HEU_Parameters;
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_Curve
  // [TokenAttribute] Offset: FFFFFFFF
  class HEU_Curve : public UnityEngine::ScriptableObject/*, public HoudiniEngineUnity::IEquivable_1<HoudiniEngineUnity::HEU_Curve*>*/ {
    public:
    // Nested type: HoudiniEngineUnity::HEU_Curve::CurveEditState
    struct CurveEditState;
    // Nested type: HoudiniEngineUnity::HEU_Curve::Interaction
    struct Interaction;
    // Nested type: HoudiniEngineUnity::HEU_Curve::CurveDrawCollision
    struct CurveDrawCollision;
    // Nested type: HoudiniEngineUnity::HEU_Curve::$$c__DisplayClass38_0
    class $$c__DisplayClass38_0;
    // Nested type: HoudiniEngineUnity::HEU_Curve::$$c__DisplayClass40_0
    class $$c__DisplayClass40_0;
    // Nested type: HoudiniEngineUnity::HEU_Curve::$$c__DisplayClass48_0
    class $$c__DisplayClass48_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState
    // [TokenAttribute] Offset: FFFFFFFF
    struct CurveEditState/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: CurveEditState
      constexpr CurveEditState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState INVALID
      static constexpr const int INVALID = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState INVALID
      static HoudiniEngineUnity::HEU_Curve::CurveEditState _get_INVALID();
      // Set static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState INVALID
      static void _set_INVALID(HoudiniEngineUnity::HEU_Curve::CurveEditState value);
      // static field const value: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState GENERATED
      static constexpr const int GENERATED = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState GENERATED
      static HoudiniEngineUnity::HEU_Curve::CurveEditState _get_GENERATED();
      // Set static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState GENERATED
      static void _set_GENERATED(HoudiniEngineUnity::HEU_Curve::CurveEditState value);
      // static field const value: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState EDITING
      static constexpr const int EDITING = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState EDITING
      static HoudiniEngineUnity::HEU_Curve::CurveEditState _get_EDITING();
      // Set static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState EDITING
      static void _set_EDITING(HoudiniEngineUnity::HEU_Curve::CurveEditState value);
      // static field const value: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState REQUIRES_GENERATION
      static constexpr const int REQUIRES_GENERATION = 3;
      // Get static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState REQUIRES_GENERATION
      static HoudiniEngineUnity::HEU_Curve::CurveEditState _get_REQUIRES_GENERATION();
      // Set static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState REQUIRES_GENERATION
      static void _set_REQUIRES_GENERATION(HoudiniEngineUnity::HEU_Curve::CurveEditState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState
    #pragma pack(pop)
    static check_size<sizeof(HEU_Curve::CurveEditState), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_Curve_CurveEditStateSizeCheck;
    static_assert(sizeof(HEU_Curve::CurveEditState) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction
    // [TokenAttribute] Offset: FFFFFFFF
    struct Interaction/*, public System::Enum*/ {
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Creating value type constructor for type: Interaction
      constexpr Interaction(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator System::Enum
      operator System::Enum() noexcept {
        return *reinterpret_cast<System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction VIEW
      static constexpr const int VIEW = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction VIEW
      static HoudiniEngineUnity::HEU_Curve::Interaction _get_VIEW();
      // Set static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction VIEW
      static void _set_VIEW(HoudiniEngineUnity::HEU_Curve::Interaction value);
      // static field const value: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction ADD
      static constexpr const int ADD = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction ADD
      static HoudiniEngineUnity::HEU_Curve::Interaction _get_ADD();
      // Set static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction ADD
      static void _set_ADD(HoudiniEngineUnity::HEU_Curve::Interaction value);
      // static field const value: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction EDIT
      static constexpr const int EDIT = 2;
      // Get static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction EDIT
      static HoudiniEngineUnity::HEU_Curve::Interaction _get_EDIT();
      // Set static field: static public HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction EDIT
      static void _set_EDIT(HoudiniEngineUnity::HEU_Curve::Interaction value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.Interaction
    #pragma pack(pop)
    static check_size<sizeof(HEU_Curve::Interaction), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_Curve_InteractionSizeCheck;
    static_assert(sizeof(HEU_Curve::Interaction) == 0x4);
    // private System.Int32 _geoID
    // Size: 0x4
    // Offset: 0x18
    int geoID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: geoID and: curveNodeData
    char __padding0[0x4] = {};
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.CurveNodeData> _curveNodeData
    // Size: 0x8
    // Offset: 0x20
    System::Collections::Generic::List_1<HoudiniEngineUnity::CurveNodeData*>* curveNodeData;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::CurveNodeData*>*) == 0x8);
    // private UnityEngine.Vector3[] _vertices
    // Size: 0x8
    // Offset: 0x28
    ::ArrayWrapper<UnityEngine::Vector3> vertices;
    // Field size check
    static_assert(sizeof(::ArrayWrapper<UnityEngine::Vector3>) == 0x8);
    // private System.Boolean _isEditable
    // Size: 0x1
    // Offset: 0x30
    bool isEditable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isEditable and: parameters
    char __padding3[0x7] = {};
    // private HoudiniEngineUnity.HEU_Parameters _parameters
    // Size: 0x8
    // Offset: 0x38
    HoudiniEngineUnity::HEU_Parameters* parameters;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_Parameters*) == 0x8);
    // private System.Boolean _bUploadParameterPreset
    // Size: 0x1
    // Offset: 0x40
    bool bUploadParameterPreset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bUploadParameterPreset and: curveName
    char __padding5[0x7] = {};
    // private System.String _curveName
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* curveName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public UnityEngine.GameObject _targetGameObject
    // Size: 0x8
    // Offset: 0x50
    UnityEngine::GameObject* targetGameObject;
    // Field size check
    static_assert(sizeof(UnityEngine::GameObject*) == 0x8);
    // private System.Boolean _isGeoCurve
    // Size: 0x1
    // Offset: 0x58
    bool isGeoCurve;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isGeoCurve and: editState
    char __padding8[0x3] = {};
    // private HoudiniEngineUnity.HEU_Curve/HoudiniEngineUnity.CurveEditState _editState
    // Size: 0x4
    // Offset: 0x5C
    HoudiniEngineUnity::HEU_Curve::CurveEditState editState;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_Curve::CurveEditState) == 0x4);
    // private HoudiniEngineUnity.HEU_HoudiniAsset _parentAsset
    // Size: 0x8
    // Offset: 0x60
    HoudiniEngineUnity::HEU_HoudiniAsset* parentAsset;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HEU_HoudiniAsset*) == 0x8);
    // Creating value type constructor for type: HEU_Curve
