// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: HoudiniEngineUnity.HAPI_PDG_EventInfo
#include "HoudiniEngineUnity/HAPI_PDG_EventInfo.hpp"
// Including type: HoudiniEngineUnity.HAPI_PDG_State
#include "HoudiniEngineUnity/HAPI_PDG_State.hpp"
// Including type: HoudiniEngineUnity.HEU_TOPNodeData
#include "HoudiniEngineUnity/HEU_TOPNodeData.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_PDGAssetLink
  class HEU_PDGAssetLink;
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
  // Forward declaring type: HEU_TOPNetworkData
  class HEU_TOPNetworkData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_PDGSession
  // [TokenAttribute] Offset: FFFFFFFF
  class HEU_PDGSession : public ::Il2CppObject {
    public:
    // Nested type: HoudiniEngineUnity::HEU_PDGSession::EventMessageColor
    struct EventMessageColor;
    // private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_PDGAssetLink> _pdgAssets
    // Size: 0x8
    // Offset: 0x10
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_PDGAssetLink*>* pdgAssets;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_PDGAssetLink*>*) == 0x8);
    // public System.Int32 _pdgMaxProcessEvents
    // Size: 0x4
    // Offset: 0x18
    int pdgMaxProcessEvents;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: pdgMaxProcessEvents and: pdgQueryEvents
    char __padding1[0x4] = {};
    // public HoudiniEngineUnity.HAPI_PDG_EventInfo[] _pdgQueryEvents
    // Size: 0x8
    // Offset: 0x20
    ::ArrayWrapper<HoudiniEngineUnity::HAPI_PDG_EventInfo> pdgQueryEvents;
    // Field size check
    static_assert(sizeof(::ArrayWrapper<HoudiniEngineUnity::HAPI_PDG_EventInfo>) == 0x8);
    // public System.Int32 _pdgContextSize
    // Size: 0x4
    // Offset: 0x28
    int pdgContextSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: pdgContextSize and: pdgContextIDs
    char __padding3[0x4] = {};
    // public System.Int32[] _pdgContextIDs
    // Size: 0x8
    // Offset: 0x30
    ::ArrayWrapper<int> pdgContextIDs;
    // Field size check
    static_assert(sizeof(::ArrayWrapper<int>) == 0x8);
    // public System.Boolean _errored
    // Size: 0x1
    // Offset: 0x38
    bool errored;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: errored and: errorMsg
    char __padding5[0x7] = {};
    // public System.String _errorMsg
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* errorMsg;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public HoudiniEngineUnity.HAPI_PDG_State _pdgState
    // Size: 0x4
    // Offset: 0x48
    HoudiniEngineUnity::HAPI_PDG_State pdgState;
    // Field size check
    static_assert(sizeof(HoudiniEngineUnity::HAPI_PDG_State) == 0x4);
    // Padding between fields: pdgState and: pdgEventMessages
    char __padding7[0x4] = {};
    // private System.Text.StringBuilder _pdgEventMessages
    // Size: 0x8
    // Offset: 0x50
    System::Text::StringBuilder* pdgEventMessages;
    // Field size check
    static_assert(sizeof(System::Text::StringBuilder*) == 0x8);
    // private System.String[] _eventMessageColorCode
    // Size: 0x8
    // Offset: 0x58
    ::ArrayWrapper<::Il2CppString*> eventMessageColorCode;
    // Field size check
    static_assert(sizeof(::ArrayWrapper<::Il2CppString*>) == 0x8);
    // Get static field: static private HoudiniEngineUnity.HEU_PDGSession _pdgSession
    static HoudiniEngineUnity::HEU_PDGSession* _get__pdgSession();
    // Set static field: static private HoudiniEngineUnity.HEU_PDGSession _pdgSession
    static void _set__pdgSession(HoudiniEngineUnity::HEU_PDGSession* value);
    // Get instance field reference: private System.Collections.Generic.List`1<HoudiniEngineUnity.HEU_PDGAssetLink> _pdgAssets
    System::Collections::Generic::List_1<HoudiniEngineUnity::HEU_PDGAssetLink*>*& dyn__pdgAssets();
    // Get instance field reference: public System.Int32 _pdgMaxProcessEvents
    int& dyn__pdgMaxProcessEvents();
    // Get instance field reference: public HoudiniEngineUnity.HAPI_PDG_EventInfo[] _pdgQueryEvents
