// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: HoudiniEngineUnity.IEquivable`1
#include "HoudiniEngineUnity/IEquivable_1.hpp"
// Including type: HoudiniEngineUnity.HAPI_RSTOrder
#include "HoudiniEngineUnity/HAPI_RSTOrder.hpp"
// Including type: HoudiniEngineUnity.HAPI_XYZOrder
#include "HoudiniEngineUnity/HAPI_XYZOrder.hpp"
// Including type: HoudiniEngineUnity.HAPI_TransformEuler
#include "HoudiniEngineUnity/HAPI_TransformEuler.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_HandleParamBinding
  class HEU_HandleParamBinding;
  // Skipping declaration: HEU_HandleType because it is already included!
  // Forward declaring type: HEU_SessionBase
  class HEU_SessionBase;
  // Forward declaring type: HAPI_HandleInfo
  struct HAPI_HandleInfo;
  // Forward declaring type: HEU_Parameters
  class HEU_Parameters;
  // Forward declaring type: HEU_HoudiniAsset
  class HEU_HoudiniAsset;
}
// Completed forward declares
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Forward declaring type: HEU_Handle
  class HEU_Handle;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::HoudiniEngineUnity::HEU_Handle);
DEFINE_IL2CPP_ARG_TYPE(::HoudiniEngineUnity::HEU_Handle*, "HoudiniEngineUnity", "HEU_Handle");
// Type namespace: HoudiniEngineUnity
namespace HoudiniEngineUnity {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: HoudiniEngineUnity.HEU_Handle
  // [TokenAttribute] Offset: FFFFFFFF
  class HEU_Handle : public ::UnityEngine::ScriptableObject/*, public ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_Handle*>*/ {
    public:
    // Nested type: ::HoudiniEngineUnity::HEU_Handle::HEU_HandleType
    struct HEU_HandleType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HoudiniEngineUnity.HEU_Handle/HoudiniEngineUnity.HEU_HandleType
    // [TokenAttribute] Offset: FFFFFFFF
    struct HEU_HandleType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: HEU_HandleType
      constexpr HEU_HandleType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating interface conversion operator: i_Enum
      inline ::System::Enum* i_Enum() noexcept {
        return reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HoudiniEngineUnity.HEU_Handle/HoudiniEngineUnity.HEU_HandleType XFORM
      static constexpr const int XFORM = 0;
      // Get static field: static public HoudiniEngineUnity.HEU_Handle/HoudiniEngineUnity.HEU_HandleType XFORM
      static ::HoudiniEngineUnity::HEU_Handle::HEU_HandleType _get_XFORM();
      // Set static field: static public HoudiniEngineUnity.HEU_Handle/HoudiniEngineUnity.HEU_HandleType XFORM
      static void _set_XFORM(::HoudiniEngineUnity::HEU_Handle::HEU_HandleType value);
      // static field const value: static public HoudiniEngineUnity.HEU_Handle/HoudiniEngineUnity.HEU_HandleType UNSUPPORTED
      static constexpr const int UNSUPPORTED = 1;
      // Get static field: static public HoudiniEngineUnity.HEU_Handle/HoudiniEngineUnity.HEU_HandleType UNSUPPORTED
      static ::HoudiniEngineUnity::HEU_Handle::HEU_HandleType _get_UNSUPPORTED();
      // Set static field: static public HoudiniEngineUnity.HEU_Handle/HoudiniEngineUnity.HEU_HandleType UNSUPPORTED
      static void _set_UNSUPPORTED(::HoudiniEngineUnity::HEU_Handle::HEU_HandleType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // HoudiniEngineUnity.HEU_Handle/HoudiniEngineUnity.HEU_HandleType
    #pragma pack(pop)
    static check_size<sizeof(HEU_Handle::HEU_HandleType), 0 + sizeof(int)> __HoudiniEngineUnity_HEU_Handle_HEU_HandleTypeSizeCheck;
    static_assert(sizeof(HEU_Handle::HEU_HandleType) == 0x4);
    public:
    // private System.String _handleName
    // Size: 0x8
    // Offset: 0x18
    ::StringW handleName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private HoudiniEngineUnity.HEU_Handle/HoudiniEngineUnity.HEU_HandleType _handleType
    // Size: 0x4
    // Offset: 0x20
    ::HoudiniEngineUnity::HEU_Handle::HEU_HandleType handleType;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_Handle::HEU_HandleType) == 0x4);
    // private System.Int32 _handleIndex
    // Size: 0x4
    // Offset: 0x24
    int handleIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private HoudiniEngineUnity.HEU_HandleParamBinding _handleParamTranslateBinding
    // Size: 0x8
    // Offset: 0x28
    ::HoudiniEngineUnity::HEU_HandleParamBinding* handleParamTranslateBinding;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_HandleParamBinding*) == 0x8);
    // private HoudiniEngineUnity.HEU_HandleParamBinding _handleParamRotateBinding
    // Size: 0x8
    // Offset: 0x30
    ::HoudiniEngineUnity::HEU_HandleParamBinding* handleParamRotateBinding;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_HandleParamBinding*) == 0x8);
    // private HoudiniEngineUnity.HEU_HandleParamBinding _handleParamScaleBinding
    // Size: 0x8
    // Offset: 0x38
    ::HoudiniEngineUnity::HEU_HandleParamBinding* handleParamScaleBinding;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HEU_HandleParamBinding*) == 0x8);
    // private UnityEngine.Vector3 _handlePosition
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::Vector3 handlePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion _handleRotation
    // Size: 0x10
    // Offset: 0x4C
    ::UnityEngine::Quaternion handleRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 _handleScale
    // Size: 0xC
    // Offset: 0x5C
    ::UnityEngine::Vector3 handleScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private HoudiniEngineUnity.HAPI_RSTOrder _rstOrder
    // Size: 0x4
    // Offset: 0x68
    ::HoudiniEngineUnity::HAPI_RSTOrder rstOrder;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HAPI_RSTOrder) == 0x4);
    // private HoudiniEngineUnity.HAPI_XYZOrder _xyzOrder
    // Size: 0x4
    // Offset: 0x6C
    ::HoudiniEngineUnity::HAPI_XYZOrder xyzOrder;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HAPI_XYZOrder) == 0x4);
    // private HoudiniEngineUnity.HAPI_TransformEuler _convertedTransformEuler
    // Size: 0x28
    // Offset: 0x70
    ::HoudiniEngineUnity::HAPI_TransformEuler convertedTransformEuler;
    // Field size check
    static_assert(sizeof(::HoudiniEngineUnity::HAPI_TransformEuler) == 0x28);
    public:
    // Creating interface conversion operator: operator ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_Handle*>
    operator ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_Handle*>() noexcept {
      return *reinterpret_cast<::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_Handle*>*>(this);
    }
    // Creating interface conversion operator: i_HEU_Handle
    inline ::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_Handle*>* i_HEU_Handle() noexcept {
      return reinterpret_cast<::HoudiniEngineUnity::IEquivable_1<::HoudiniEngineUnity::HEU_Handle*>*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
