// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.MarshalByRefObject
#include "System/MarshalByRefObject.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: AssemblyLoadEventHandler
  class AssemblyLoadEventHandler;
  // Forward declaring type: ResolveEventHandler
  class ResolveEventHandler;
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: UnhandledExceptionEventHandler
  class UnhandledExceptionEventHandler;
  // Forward declaring type: EventHandler`1<TEventArgs>
  class EventHandler_1;
}
// Forward declaring namespace: System::Runtime::ExceptionServices
namespace System::Runtime::ExceptionServices {
  // Forward declaring type: FirstChanceExceptionEventArgs
  class FirstChanceExceptionEventArgs;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Security::Principal
namespace System::Security::Principal {
  // Forward declaring type: IPrincipal
  class IPrincipal;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: Assembly
  class Assembly;
  // Forward declaring type: MethodInfo
  class MethodInfo;
}
// Forward declaring namespace: System::Security::Policy
namespace System::Security::Policy {
  // Forward declaring type: Evidence
  class Evidence;
}
// Forward declaring namespace: System::Runtime::Remoting::Contexts
namespace System::Runtime::Remoting::Contexts {
  // Forward declaring type: Context
  class Context;
}
// Forward declaring namespace: System::Runtime::Remoting::Messaging
namespace System::Runtime::Remoting::Messaging {
  // Forward declaring type: CADMethodCallMessage
  class CADMethodCallMessage;
  // Forward declaring type: CADMethodReturnMessage
  class CADMethodReturnMessage;
}
// Completed forward declares
// Type namespace: System
namespace System {
  // Forward declaring type: AppDomain
  class AppDomain;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::AppDomain);
DEFINE_IL2CPP_ARG_TYPE(System::AppDomain*, "System", "AppDomain");
// Type namespace: System
namespace System {
  // Size: 0xA0
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.AppDomain
  // [TokenAttribute] Offset: FFFFFFFF
  // [ClassInterfaceAttribute] Offset: 1187804
  // [ComVisibleAttribute] Offset: 1187804
  class AppDomain : public System::MarshalByRefObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.IntPtr _mono_app_domain
    // Size: 0x8
    // Offset: 0x18
    System::IntPtr mono_app_domain;
    // Field size check
    static_assert(sizeof(System::IntPtr) == 0x8);
    // private System.Object _evidence
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* evidence;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _granted
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* granted;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Int32 _principalPolicy
    // Size: 0x4
    // Offset: 0x30
    int principalPolicy;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: principalPolicy and: AssemblyLoad
    char __padding3[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0x118DBD0
    // private System.AssemblyLoadEventHandler AssemblyLoad
    // Size: 0x8
    // Offset: 0x38
    System::AssemblyLoadEventHandler* AssemblyLoad;
    // Field size check
    static_assert(sizeof(System::AssemblyLoadEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0x118DBE0
    // private System.ResolveEventHandler AssemblyResolve
    // Size: 0x8
    // Offset: 0x40
    System::ResolveEventHandler* AssemblyResolve;
    // Field size check
    static_assert(sizeof(System::ResolveEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0x118DBF0
    // private System.EventHandler DomainUnload
    // Size: 0x8
    // Offset: 0x48
    System::EventHandler* DomainUnload;
    // Field size check
    static_assert(sizeof(System::EventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0x118DC00
    // private System.EventHandler ProcessExit
    // Size: 0x8
    // Offset: 0x50
    System::EventHandler* ProcessExit;
    // Field size check
    static_assert(sizeof(System::EventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0x118DC10
    // private System.ResolveEventHandler ResourceResolve
    // Size: 0x8
    // Offset: 0x58
    System::ResolveEventHandler* ResourceResolve;
    // Field size check
    static_assert(sizeof(System::ResolveEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0x118DC20
    // private System.ResolveEventHandler TypeResolve
    // Size: 0x8
    // Offset: 0x60
    System::ResolveEventHandler* TypeResolve;
    // Field size check
    static_assert(sizeof(System::ResolveEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0x118DC30
    // private System.UnhandledExceptionEventHandler UnhandledException
    // Size: 0x8
    // Offset: 0x68
    System::UnhandledExceptionEventHandler* UnhandledException;
    // Field size check
    static_assert(sizeof(System::UnhandledExceptionEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0x118DC40
    // private System.EventHandler`1<System.Runtime.ExceptionServices.FirstChanceExceptionEventArgs> FirstChanceException
    // Size: 0x8
    // Offset: 0x70
    System::EventHandler_1<System::Runtime::ExceptionServices::FirstChanceExceptionEventArgs*>* FirstChanceException;
    // Field size check
    static_assert(sizeof(System::EventHandler_1<System::Runtime::ExceptionServices::FirstChanceExceptionEventArgs*>*) == 0x8);
    // private System.Object _domain_manager
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppObject* domain_manager;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0x118DC50
    // private System.ResolveEventHandler ReflectionOnlyAssemblyResolve
    // Size: 0x8
    // Offset: 0x80
    System::ResolveEventHandler* ReflectionOnlyAssemblyResolve;
    // Field size check
    static_assert(sizeof(System::ResolveEventHandler*) == 0x8);
    // private System.Object _activation
    // Size: 0x8
    // Offset: 0x88
    ::Il2CppObject* activation;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _applicationIdentity
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppObject* applicationIdentity;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> compatibility_switch
    // Size: 0x8
    // Offset: 0x98
    System::Collections::Generic::List_1<::StringW>* compatibility_switch;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<::StringW>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::Il2CppObject*
    constexpr operator ::Il2CppObject*() const noexcept = delete;
    // Get static field: static private System.String _process_guid
    static ::StringW _get__process_guid();
    // Set static field: static private System.String _process_guid
    static void _set__process_guid(::StringW value);
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Object> type_resolve_in_progress
    static System::Collections::Generic::Dictionary_2<::StringW, ::Il2CppObject*>* _get_type_resolve_in_progress();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Object> type_resolve_in_progress
