// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include <stdint.h>
// Including type: System.MarshalByRefObject
#include "System/MarshalByRefObject.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: AssemblyLoadEventHandler
  class AssemblyLoadEventHandler;
  // Forward declaring type: ResolveEventHandler
  class ResolveEventHandler;
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: UnhandledExceptionEventHandler
  class UnhandledExceptionEventHandler;
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
}
// Forward declaring namespace: System::Runtime::ExceptionServices
namespace System::Runtime::ExceptionServices {
  // Forward declaring type: FirstChanceExceptionEventArgs
  class FirstChanceExceptionEventArgs;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Security::Principal
namespace System::Security::Principal {
  // Forward declaring type: IPrincipal
  class IPrincipal;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: Assembly
  class Assembly;
  // Forward declaring type: AssemblyName
  class AssemblyName;
  // Forward declaring type: MethodInfo
  class MethodInfo;
}
// Forward declaring namespace: System::Security::Policy
namespace System::Security::Policy {
  // Forward declaring type: Evidence
  class Evidence;
}
// Forward declaring namespace: System::Runtime::Remoting::Contexts
namespace System::Runtime::Remoting::Contexts {
  // Forward declaring type: Context
  class Context;
}
// Forward declaring namespace: System::Runtime::Remoting::Messaging
namespace System::Runtime::Remoting::Messaging {
  // Forward declaring type: CADMethodCallMessage
  class CADMethodCallMessage;
  // Forward declaring type: CADMethodReturnMessage
  class CADMethodReturnMessage;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
struct CsObject;
struct CsString;
template<class T>
struct Array;
// Completed il2cpp-utils forward declares
// Type namespace: System
namespace System {
  // Autogenerated type: System.AppDomain
  class AppDomain : public System::MarshalByRefObject {
    public:
    // private System.IntPtr _mono_app_domain
    // Offset: 0x18
    System::IntPtr mono_app_domain;
    // Get static field: static private System.String _process_guid
    static ::CsString* _get__process_guid();
    // Set static field: static private System.String _process_guid
    static void _set__process_guid(::CsString* value);
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Object> type_resolve_in_progress
    static System::Collections::Generic::Dictionary_2<::CsString*, ::CsObject*>* _get_type_resolve_in_progress();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Object> type_resolve_in_progress
    static void _set_type_resolve_in_progress(System::Collections::Generic::Dictionary_2<::CsString*, ::CsObject*>* value);
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Object> assembly_resolve_in_progress
    static System::Collections::Generic::Dictionary_2<::CsString*, ::CsObject*>* _get_assembly_resolve_in_progress();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Object> assembly_resolve_in_progress
    static void _set_assembly_resolve_in_progress(System::Collections::Generic::Dictionary_2<::CsString*, ::CsObject*>* value);
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Object> assembly_resolve_in_progress_refonly
    static System::Collections::Generic::Dictionary_2<::CsString*, ::CsObject*>* _get_assembly_resolve_in_progress_refonly();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.String,System.Object> assembly_resolve_in_progress_refonly
    static void _set_assembly_resolve_in_progress_refonly(System::Collections::Generic::Dictionary_2<::CsString*, ::CsObject*>* value);
    // private System.Object _evidence
    // Offset: 0x20
    ::CsObject* evidence;
    // private System.Object _granted
    // Offset: 0x28
    ::CsObject* granted;
    // private System.Int32 _principalPolicy
    // Offset: 0x30
    int principalPolicy;
    // Get static field: static private System.Object _principal
    static ::CsObject* _get__principal();
    // Set static field: static private System.Object _principal
    static void _set__principal(::CsObject* value);
    // Get static field: static private System.AppDomain default_domain
    static System::AppDomain* _get_default_domain();
    // Set static field: static private System.AppDomain default_domain
    static void _set_default_domain(System::AppDomain* value);
    // private System.AssemblyLoadEventHandler AssemblyLoad
    // Offset: 0x38
    System::AssemblyLoadEventHandler* AssemblyLoad;
    // private System.ResolveEventHandler AssemblyResolve
    // Offset: 0x40
    System::ResolveEventHandler* AssemblyResolve;
    // private System.EventHandler DomainUnload
    // Offset: 0x48
    System::EventHandler* DomainUnload;
    // private System.EventHandler ProcessExit
    // Offset: 0x50
    System::EventHandler* ProcessExit;
    // private System.ResolveEventHandler ResourceResolve
    // Offset: 0x58
    System::ResolveEventHandler* ResourceResolve;
    // private System.ResolveEventHandler TypeResolve
    // Offset: 0x60
    System::ResolveEventHandler* TypeResolve;
    // private System.UnhandledExceptionEventHandler UnhandledException
    // Offset: 0x68
    System::UnhandledExceptionEventHandler* UnhandledException;
    // private System.EventHandler`1<System.Runtime.ExceptionServices.FirstChanceExceptionEventArgs> FirstChanceException
    // Offset: 0x70
    System::EventHandler_1<System::Runtime::ExceptionServices::FirstChanceExceptionEventArgs*>* FirstChanceException;
    // private System.Object _domain_manager
    // Offset: 0x78
    ::CsObject* domain_manager;
    // private System.ResolveEventHandler ReflectionOnlyAssemblyResolve
    // Offset: 0x80
    System::ResolveEventHandler* ReflectionOnlyAssemblyResolve;
    // private System.Object _activation
    // Offset: 0x88
    ::CsObject* activation;
    // private System.Object _applicationIdentity
    // Offset: 0x90
    ::CsObject* applicationIdentity;
    // private System.Collections.Generic.List`1<System.String> compatibility_switch
    // Offset: 0x98
    System::Collections::Generic::List_1<::CsString*>* compatibility_switch;
    // private System.String getFriendlyName()
    // Offset: 0x10A76E8
    ::CsString* getFriendlyName();
    // public System.String get_FriendlyName()
    // Offset: 0x10A76EC
    ::CsString* get_FriendlyName();
    // System.Security.Principal.IPrincipal get_DefaultPrincipal()
    // Offset: 0x10A76F0
    System::Security::Principal::IPrincipal* get_DefaultPrincipal();
    // static private System.AppDomain getCurDomain()
    // Offset: 0x10A7870
    static System::AppDomain* getCurDomain();
    // static public System.AppDomain get_CurrentDomain()
    // Offset: 0x10A7874
    static System::AppDomain* get_CurrentDomain();
    // private System.Reflection.Assembly[] GetAssemblies(System.Boolean refOnly)
    // Offset: 0x10A7878
    ::Array<System::Reflection::Assembly*>* GetAssemblies(bool refOnly);
    // public System.Reflection.Assembly[] GetAssemblies()
    // Offset: 0x10A7880
    ::Array<System::Reflection::Assembly*>* GetAssemblies();
    // public System.Object GetData(System.String name)
    // Offset: 0x10A7888
    ::CsObject* GetData(::CsString* name);
    // System.Reflection.Assembly LoadAssembly(System.String assemblyRef, System.Security.Policy.Evidence securityEvidence, System.Boolean refOnly)
    // Offset: 0x10A7894
    System::Reflection::Assembly* LoadAssembly(::CsString* assemblyRef, System::Security::Policy::Evidence* securityEvidence, bool refOnly);
    // System.Reflection.Assembly LoadSatellite(System.Reflection.AssemblyName assemblyRef, System.Boolean throwOnError)
    // Offset: 0x10A789C
    System::Reflection::Assembly* LoadSatellite(System::Reflection::AssemblyName* assemblyRef, bool throwOnError);
    // public System.Reflection.Assembly Load(System.String assemblyString)
    // Offset: 0x10A79A8
    System::Reflection::Assembly* Load(::CsString* assemblyString);
    // System.Reflection.Assembly Load(System.String assemblyString, System.Security.Policy.Evidence assemblySecurity, System.Boolean refonly)
    // Offset: 0x10A79B4
    System::Reflection::Assembly* Load(::CsString* assemblyString, System::Security::Policy::Evidence* assemblySecurity, bool refonly);
    // static private System.AppDomain InternalSetDomainByID(System.Int32 domain_id)
    // Offset: 0x10A7AE0
    static System::AppDomain* InternalSetDomainByID(int domain_id);
    // static private System.AppDomain InternalSetDomain(System.AppDomain context)
    // Offset: 0x10A7AE4
    static System::AppDomain* InternalSetDomain(System::AppDomain* context);
    // static System.Void InternalPushDomainRefByID(System.Int32 domain_id)
    // Offset: 0x10A7AE8
    static void InternalPushDomainRefByID(int domain_id);
    // static System.Void InternalPopDomainRef()
    // Offset: 0x10A7AEC
    static void InternalPopDomainRef();
    // static System.Runtime.Remoting.Contexts.Context InternalSetContext(System.Runtime.Remoting.Contexts.Context context)
    // Offset: 0x10A7AF0
    static System::Runtime::Remoting::Contexts::Context* InternalSetContext(System::Runtime::Remoting::Contexts::Context* context);
    // static System.Runtime.Remoting.Contexts.Context InternalGetContext()
    // Offset: 0x10A7AF4
    static System::Runtime::Remoting::Contexts::Context* InternalGetContext();
    // static System.Runtime.Remoting.Contexts.Context InternalGetDefaultContext()
    // Offset: 0x10A7AF8
    static System::Runtime::Remoting::Contexts::Context* InternalGetDefaultContext();
    // static System.String InternalGetProcessGuid(System.String newguid)
    // Offset: 0x10A7AFC
    static ::CsString* InternalGetProcessGuid(::CsString* newguid);
    // static System.Object InvokeInDomainByID(System.Int32 domain_id, System.Reflection.MethodInfo method, System.Object obj, System.Object[] args)
    // Offset: 0x10A7B00
    static ::CsObject* InvokeInDomainByID(int domain_id, System::Reflection::MethodInfo* method, ::CsObject* obj, ::Array<::CsObject*>* args);
    // static System.String GetProcessGuid()
    // Offset: 0x10A7C50
    static ::CsString* GetProcessGuid();
    // static private System.Boolean InternalIsFinalizingForUnload(System.Int32 domain_id)
    // Offset: 0x10A7D10
    static bool InternalIsFinalizingForUnload(int domain_id);
    // public System.Boolean IsFinalizingForUnload()
    // Offset: 0x10A7D14
    bool IsFinalizingForUnload();
    // private System.Int32 getDomainID()
    // Offset: 0x10A7D2C
    int getDomainID();
    // static public System.Int32 GetCurrentThreadId()
    // Offset: 0x10A7D34
    static int GetCurrentThreadId();
    // private System.Void DoAssemblyLoad(System.Reflection.Assembly assembly)
    // Offset: 0x10A7D40
    void DoAssemblyLoad(System::Reflection::Assembly* assembly);
    // private System.Reflection.Assembly DoAssemblyResolve(System.String name, System.Reflection.Assembly requestingAssembly, System.Boolean refonly)
    // Offset: 0x10A7DD4
    System::Reflection::Assembly* DoAssemblyResolve(::CsString* name, System::Reflection::Assembly* requestingAssembly, bool refonly);
    // System.Reflection.Assembly DoTypeResolve(System.Object name_or_tb)
    // Offset: 0x10A8074
    System::Reflection::Assembly* DoTypeResolve(::CsObject* name_or_tb);
    // System.Reflection.Assembly DoResourceResolve(System.String name, System.Reflection.Assembly requesting)
    // Offset: 0x10A82E8
    System::Reflection::Assembly* DoResourceResolve(::CsString* name, System::Reflection::Assembly* requesting);
    // private System.Void DoDomainUnload()
    // Offset: 0x10A8420
    void DoDomainUnload();
    // System.Byte[] GetMarshalledDomainObjRef()
    // Offset: 0x10A843C
    ::Array<uint8_t>* GetMarshalledDomainObjRef();
    // System.Void ProcessMessageInDomain(System.Byte[] arrRequest, System.Runtime.Remoting.Messaging.CADMethodCallMessage cadMsg, System.Byte[] arrResponse, System.Runtime.Remoting.Messaging.CADMethodReturnMessage cadMrm)
    // Offset: 0x10A8514
    void ProcessMessageInDomain(::Array<uint8_t>* arrRequest, System::Runtime::Remoting::Messaging::CADMethodCallMessage* cadMsg, ::Array<uint8_t>*& arrResponse, System::Runtime::Remoting::Messaging::CADMethodReturnMessage*& cadMrm);
    // public System.Void add_DomainUnload(System.EventHandler value)
    // Offset: 0x10A865C
    void add_DomainUnload(System::EventHandler* value);
    // public System.Void remove_DomainUnload(System.EventHandler value)
    // Offset: 0x10A8700
    void remove_DomainUnload(System::EventHandler* value);
    // public System.Void add_ProcessExit(System.EventHandler value)
    // Offset: 0x10A87A4
    void add_ProcessExit(System::EventHandler* value);
    // public System.Void remove_ProcessExit(System.EventHandler value)
    // Offset: 0x10A8848
    void remove_ProcessExit(System::EventHandler* value);
    // public System.Void add_UnhandledException(System.UnhandledExceptionEventHandler value)
    // Offset: 0x10A88EC
    void add_UnhandledException(System::UnhandledExceptionEventHandler* value);
    // public System.Void remove_UnhandledException(System.UnhandledExceptionEventHandler value)
    // Offset: 0x10A8990
    void remove_UnhandledException(System::UnhandledExceptionEventHandler* value);
    // private System.Void .ctor()
    // Offset: 0x10A76E0
    // Implemented from: System.MarshalByRefObject
    // Base method: System.Void MarshalByRefObject::.ctor()
    // Base method: System.Void Object::.ctor()
    static AppDomain* New_ctor();
    // public override System.Object InitializeLifetimeService()
    // Offset: 0x10A788C
    // Implemented from: System.MarshalByRefObject
    // Base method: System.Object MarshalByRefObject::InitializeLifetimeService()
    ::CsObject* InitializeLifetimeService();
    // public override System.String ToString()
    // Offset: 0x10A7D3C
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::CsString* ToString();
  }; // System.AppDomain
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::AppDomain*, "System", "AppDomain");
#pragma pack(pop)
