// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.MarshalByRefObject
#include "System/MarshalByRefObject.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: AssemblyLoadEventHandler
  class AssemblyLoadEventHandler;
  // Forward declaring type: ResolveEventHandler
  class ResolveEventHandler;
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: UnhandledExceptionEventHandler
  class UnhandledExceptionEventHandler;
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
}
// Forward declaring namespace: System::Runtime::ExceptionServices
namespace System::Runtime::ExceptionServices {
  // Forward declaring type: FirstChanceExceptionEventArgs
  class FirstChanceExceptionEventArgs;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Security::Principal
namespace System::Security::Principal {
  // Forward declaring type: IPrincipal
  class IPrincipal;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: Assembly
  class Assembly;
  // Forward declaring type: MethodInfo
  class MethodInfo;
}
// Forward declaring namespace: System::Security::Policy
namespace System::Security::Policy {
  // Forward declaring type: Evidence
  class Evidence;
}
// Forward declaring namespace: System::Runtime::Remoting::Contexts
namespace System::Runtime::Remoting::Contexts {
  // Forward declaring type: Context
  class Context;
}
// Forward declaring namespace: System::Runtime::Remoting::Messaging
namespace System::Runtime::Remoting::Messaging {
  // Forward declaring type: CADMethodCallMessage
  class CADMethodCallMessage;
  // Forward declaring type: CADMethodReturnMessage
  class CADMethodReturnMessage;
}
// Completed forward declares
// Type namespace: System
namespace System {
  // Size: 0xA0
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.AppDomain
  // [TokenAttribute] Offset: FFFFFFFF
  // [ClassInterfaceAttribute] Offset: D6889C
  // [ComVisibleAttribute] Offset: D6889C
  class AppDomain : public System::MarshalByRefObject {
    public:
    // private System.IntPtr _mono_app_domain
    // Size: 0x8
    // Offset: 0x18
    System::IntPtr mono_app_domain;
    // Field size check
    static_assert(sizeof(System::IntPtr) == 0x8);
    // private System.Object _evidence
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* evidence;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _granted
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* granted;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Int32 _principalPolicy
    // Size: 0x4
    // Offset: 0x30
    int principalPolicy;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: principalPolicy and: AssemblyLoad
    char __padding3[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xD6E84C
    // private System.AssemblyLoadEventHandler AssemblyLoad
    // Size: 0x8
    // Offset: 0x38
    System::AssemblyLoadEventHandler* AssemblyLoad;
    // Field size check
    static_assert(sizeof(System::AssemblyLoadEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD6E85C
    // private System.ResolveEventHandler AssemblyResolve
    // Size: 0x8
    // Offset: 0x40
    System::ResolveEventHandler* AssemblyResolve;
    // Field size check
    static_assert(sizeof(System::ResolveEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD6E86C
    // private System.EventHandler DomainUnload
    // Size: 0x8
    // Offset: 0x48
    System::EventHandler* DomainUnload;
    // Field size check
    static_assert(sizeof(System::EventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD6E87C
    // private System.EventHandler ProcessExit
    // Size: 0x8
    // Offset: 0x50
    System::EventHandler* ProcessExit;
    // Field size check
    static_assert(sizeof(System::EventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD6E88C
    // private System.ResolveEventHandler ResourceResolve
    // Size: 0x8
    // Offset: 0x58
    System::ResolveEventHandler* ResourceResolve;
    // Field size check
    static_assert(sizeof(System::ResolveEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD6E89C
    // private System.ResolveEventHandler TypeResolve
    // Size: 0x8
    // Offset: 0x60
    System::ResolveEventHandler* TypeResolve;
    // Field size check
    static_assert(sizeof(System::ResolveEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD6E8AC
    // private System.UnhandledExceptionEventHandler UnhandledException
    // Size: 0x8
    // Offset: 0x68
    System::UnhandledExceptionEventHandler* UnhandledException;
    // Field size check
    static_assert(sizeof(System::UnhandledExceptionEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD6E8BC
    // private System.EventHandler`1<System.Runtime.ExceptionServices.FirstChanceExceptionEventArgs> FirstChanceException
    // Size: 0x8
    // Offset: 0x70
    System::EventHandler_1<System::Runtime::ExceptionServices::FirstChanceExceptionEventArgs*>* FirstChanceException;
    // Field size check
    static_assert(sizeof(System::EventHandler_1<System::Runtime::ExceptionServices::FirstChanceExceptionEventArgs*>*) == 0x8);
    // private System.Object _domain_manager
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppObject* domain_manager;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xD6E8CC
    // private System.ResolveEventHandler ReflectionOnlyAssemblyResolve
    // Size: 0x8
    // Offset: 0x80
    System::ResolveEventHandler* ReflectionOnlyAssemblyResolve;
    // Field size check
    static_assert(sizeof(System::ResolveEventHandler*) == 0x8);
    // private System.Object _activation
    // Size: 0x8
    // Offset: 0x88
    ::Il2CppObject* activation;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _applicationIdentity
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppObject* applicationIdentity;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> compatibility_switch
    // Size: 0x8
    // Offset: 0x98
    System::Collections::Generic::List_1<::Il2CppString*>* compatibility_switch;
    // Field size check
    static_assert(sizeof(System::Collections::Generic::List_1<::Il2CppString*>*) == 0x8);
    // Creating value type constructor for type: AppDomain
