// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Coord
#include "System/Coord.hpp"
// Including type: System.SmallRect
#include "System/SmallRect.hpp"
// Completed includes
// Type namespace: System
namespace System {
  // Size: 0x16
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.ConsoleScreenBufferInfo
  // [TokenAttribute] Offset: FFFFFFFF
  struct ConsoleScreenBufferInfo/*, public System::ValueType*/ {
    public:
    // public System.Coord Size
    // Size: 0x4
    // Offset: 0x0
    System::Coord Size;
    // Field size check
    static_assert(sizeof(System::Coord) == 0x4);
    // public System.Coord CursorPosition
    // Size: 0x4
    // Offset: 0x4
    System::Coord CursorPosition;
    // Field size check
    static_assert(sizeof(System::Coord) == 0x4);
    // public System.Int16 Attribute
    // Size: 0x2
    // Offset: 0x8
    int16_t Attribute;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.SmallRect Window
    // Size: 0x8
    // Offset: 0xA
    System::SmallRect Window;
    // Field size check
    static_assert(sizeof(System::SmallRect) == 0x8);
    // public System.Coord MaxWindowSize
    // Size: 0x4
    // Offset: 0x12
    System::Coord MaxWindowSize;
    // Field size check
    static_assert(sizeof(System::Coord) == 0x4);
    // Creating value type constructor for type: ConsoleScreenBufferInfo
    constexpr ConsoleScreenBufferInfo(System::Coord Size_ = {}, System::Coord CursorPosition_ = {}, int16_t Attribute_ = {}, System::SmallRect Window_ = {}, System::Coord MaxWindowSize_ = {}) noexcept : Size{Size_}, CursorPosition{CursorPosition_}, Attribute{Attribute_}, Window{Window_}, MaxWindowSize{MaxWindowSize_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public System.Coord Size
    System::Coord _get_Size();
    // Set instance field: public System.Coord Size
    void _set_Size(System::Coord value);
    // Get instance field: public System.Coord CursorPosition
    System::Coord _get_CursorPosition();
    // Set instance field: public System.Coord CursorPosition
    void _set_CursorPosition(System::Coord value);
    // Get instance field: public System.Int16 Attribute
    int16_t _get_Attribute();
    // Set instance field: public System.Int16 Attribute
    void _set_Attribute(int16_t value);
    // Get instance field: public System.SmallRect Window
    System::SmallRect _get_Window();
    // Set instance field: public System.SmallRect Window
    void _set_Window(System::SmallRect value);
    // Get instance field: public System.Coord MaxWindowSize
    System::Coord _get_MaxWindowSize();
    // Set instance field: public System.Coord MaxWindowSize
    void _set_MaxWindowSize(System::Coord value);
  }; // System.ConsoleScreenBufferInfo
  #pragma pack(pop)
  static check_size<sizeof(ConsoleScreenBufferInfo), 18 + sizeof(System::Coord)> __System_ConsoleScreenBufferInfoSizeCheck;
  static_assert(sizeof(ConsoleScreenBufferInfo) == 0x16);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::ConsoleScreenBufferInfo, "System", "ConsoleScreenBufferInfo");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
