// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.ParseFlags
#include "System/ParseFlags.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.ParseFailureKind
#include "System/ParseFailureKind.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: Calendar
  class Calendar;
}
// Completed forward declares
// Type namespace: System
namespace System {
  // Autogenerated type: System.DateTimeResult
  struct DateTimeResult : public System::ValueType {
    public:
    // System.Int32 Year
    // Offset: 0x0
    int Year;
    // System.Int32 Month
    // Offset: 0x4
    int Month;
    // System.Int32 Day
    // Offset: 0x8
    int Day;
    // System.Int32 Hour
    // Offset: 0xC
    int Hour;
    // System.Int32 Minute
    // Offset: 0x10
    int Minute;
    // System.Int32 Second
    // Offset: 0x14
    int Second;
    // System.Double fraction
    // Offset: 0x18
    double fraction;
    // System.Int32 era
    // Offset: 0x20
    int era;
    // System.ParseFlags flags
    // Offset: 0x24
    System::ParseFlags flags;
    // System.TimeSpan timeZoneOffset
    // Offset: 0x28
    System::TimeSpan timeZoneOffset;
    // System.Globalization.Calendar calendar
    // Offset: 0x30
    System::Globalization::Calendar* calendar;
    // System.DateTime parsedDate
    // Offset: 0x38
    System::DateTime parsedDate;
    // System.ParseFailureKind failure
    // Offset: 0x40
    System::ParseFailureKind failure;
    // System.String failureMessageID
    // Offset: 0x48
    ::Il2CppString* failureMessageID;
    // System.Object failureMessageFormatArgument
    // Offset: 0x50
    ::Il2CppObject* failureMessageFormatArgument;
    // System.String failureArgumentName
    // Offset: 0x58
    ::Il2CppString* failureArgumentName;
    // Creating value type constructor for type: DateTimeResult
    constexpr DateTimeResult(int Year_ = {}, int Month_ = {}, int Day_ = {}, int Hour_ = {}, int Minute_ = {}, int Second_ = {}, double fraction_ = {}, int era_ = {}, System::ParseFlags flags_ = {}, System::TimeSpan timeZoneOffset_ = {}, System::Globalization::Calendar* calendar_ = {}, System::DateTime parsedDate_ = {}, System::ParseFailureKind failure_ = {}, ::Il2CppString* failureMessageID_ = {}, ::Il2CppObject* failureMessageFormatArgument_ = {}, ::Il2CppString* failureArgumentName_ = {}) noexcept : Year{Year_}, Month{Month_}, Day{Day_}, Hour{Hour_}, Minute{Minute_}, Second{Second_}, fraction{fraction_}, era{era_}, flags{flags_}, timeZoneOffset{timeZoneOffset_}, calendar{calendar_}, parsedDate{parsedDate_}, failure{failure_}, failureMessageID{failureMessageID_}, failureMessageFormatArgument{failureMessageFormatArgument_}, failureArgumentName{failureArgumentName_} {}
    // System.Void Init()
    // Offset: 0xA2CEB0
    void Init();
    // System.Void SetDate(System.Int32 year, System.Int32 month, System.Int32 day)
    // Offset: 0xA2CED0
    void SetDate(int year, int month, int day);
    // System.Void SetFailure(System.ParseFailureKind failure, System.String failureMessageID, System.Object failureMessageFormatArgument)
    // Offset: 0xA2CEDC
    void SetFailure(System::ParseFailureKind failure, ::Il2CppString* failureMessageID, ::Il2CppObject* failureMessageFormatArgument);
    // System.Void SetFailure(System.ParseFailureKind failure, System.String failureMessageID, System.Object failureMessageFormatArgument, System.String failureArgumentName)
    // Offset: 0xA2CF18
    void SetFailure(System::ParseFailureKind failure, ::Il2CppString* failureMessageID, ::Il2CppObject* failureMessageFormatArgument, ::Il2CppString* failureArgumentName);
  }; // System.DateTimeResult
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::DateTimeResult, "System", "DateTimeResult");
#pragma pack(pop)
