// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.ParseFlags
#include "System/ParseFlags.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.ParseFailureKind
#include "System/ParseFailureKind.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: Calendar
  class Calendar;
}
// Completed forward declares
// Type namespace: System
namespace System {
  // Size: 0x60
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.DateTimeResult
  struct DateTimeResult/*, public System::ValueType*/ {
    public:
    // System.Int32 Year
    // Size: 0x4
    // Offset: 0x0
    int Year;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 Month
    // Size: 0x4
    // Offset: 0x4
    int Month;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 Day
    // Size: 0x4
    // Offset: 0x8
    int Day;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 Hour
    // Size: 0x4
    // Offset: 0xC
    int Hour;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 Minute
    // Size: 0x4
    // Offset: 0x10
    int Minute;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 Second
    // Size: 0x4
    // Offset: 0x14
    int Second;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Double fraction
    // Size: 0x8
    // Offset: 0x18
    double fraction;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // System.Int32 era
    // Size: 0x4
    // Offset: 0x20
    int era;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.ParseFlags flags
    // Size: 0x4
    // Offset: 0x24
    System::ParseFlags flags;
    // Field size check
    static_assert(sizeof(System::ParseFlags) == 0x4);
    // System.TimeSpan timeZoneOffset
    // Size: 0x8
    // Offset: 0x28
    System::TimeSpan timeZoneOffset;
    // Field size check
    static_assert(sizeof(System::TimeSpan) == 0x8);
    // System.Globalization.Calendar calendar
    // Size: 0x8
    // Offset: 0x30
    System::Globalization::Calendar* calendar;
    // Field size check
    static_assert(sizeof(System::Globalization::Calendar*) == 0x8);
    // System.DateTime parsedDate
    // Size: 0x8
    // Offset: 0x38
    System::DateTime parsedDate;
    // Field size check
    static_assert(sizeof(System::DateTime) == 0x8);
    // System.ParseFailureKind failure
    // Size: 0x4
    // Offset: 0x40
    System::ParseFailureKind failure;
    // Field size check
    static_assert(sizeof(System::ParseFailureKind) == 0x4);
    // Padding between fields: failure and: failureMessageID
    char __padding12[0x4] = {};
    // System.String failureMessageID
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* failureMessageID;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.Object failureMessageFormatArgument
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppObject* failureMessageFormatArgument;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.String failureArgumentName
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppString* failureArgumentName;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: DateTimeResult
    constexpr DateTimeResult(int Year_ = {}, int Month_ = {}, int Day_ = {}, int Hour_ = {}, int Minute_ = {}, int Second_ = {}, double fraction_ = {}, int era_ = {}, System::ParseFlags flags_ = {}, System::TimeSpan timeZoneOffset_ = {}, System::Globalization::Calendar* calendar_ = {}, System::DateTime parsedDate_ = {}, System::ParseFailureKind failure_ = {}, ::Il2CppString* failureMessageID_ = {}, ::Il2CppObject* failureMessageFormatArgument_ = {}, ::Il2CppString* failureArgumentName_ = {}) noexcept : Year{Year_}, Month{Month_}, Day{Day_}, Hour{Hour_}, Minute{Minute_}, Second{Second_}, fraction{fraction_}, era{era_}, flags{flags_}, timeZoneOffset{timeZoneOffset_}, calendar{calendar_}, parsedDate{parsedDate_}, failure{failure_}, failureMessageID{failureMessageID_}, failureMessageFormatArgument{failureMessageFormatArgument_}, failureArgumentName{failureArgumentName_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // System.Void Init()
    // Offset: 0xF04C70
    void Init();
    // System.Void SetDate(System.Int32 year, System.Int32 month, System.Int32 day)
    // Offset: 0xF04C90
    void SetDate(int year, int month, int day);
    // System.Void SetFailure(System.ParseFailureKind failure, System.String failureMessageID, System.Object failureMessageFormatArgument)
    // Offset: 0xF04C9C
    void SetFailure(System::ParseFailureKind failure, ::Il2CppString* failureMessageID, ::Il2CppObject* failureMessageFormatArgument);
    // System.Void SetFailure(System.ParseFailureKind failure, System.String failureMessageID, System.Object failureMessageFormatArgument, System.String failureArgumentName)
    // Offset: 0xF04CA8
    void SetFailure(System::ParseFailureKind failure, ::Il2CppString* failureMessageID, ::Il2CppObject* failureMessageFormatArgument, ::Il2CppString* failureArgumentName);
  }; // System.DateTimeResult
  #pragma pack(pop)
  static check_size<sizeof(DateTimeResult), 88 + sizeof(::Il2CppString*)> __System_DateTimeResultSizeCheck;
  static_assert(sizeof(DateTimeResult) == 0x60);
  // Writing MetadataGetter for method: DateTimeResult::Init
  // Il2CppName: Init
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (DateTimeResult::*)()>(&DateTimeResult::Init)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(DateTimeResult), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
    }
  };
  // Writing MetadataGetter for method: DateTimeResult::SetDate
  // Il2CppName: SetDate
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (DateTimeResult::*)(int, int, int)>(&DateTimeResult::SetDate)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(DateTimeResult), "SetDate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<int>(), ::il2cpp_utils::ExtractIndependentType<int>(), ::il2cpp_utils::ExtractIndependentType<int>()});
    }
  };
  // Writing MetadataGetter for method: DateTimeResult::SetFailure
  // Il2CppName: SetFailure
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (DateTimeResult::*)(System::ParseFailureKind, ::Il2CppString*, ::Il2CppObject*)>(&DateTimeResult::SetFailure)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(DateTimeResult), "SetFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<System::ParseFailureKind>(), ::il2cpp_utils::ExtractIndependentType<::Il2CppString*>(), ::il2cpp_utils::ExtractIndependentType<::Il2CppObject*>()});
    }
  };
  // Writing MetadataGetter for method: DateTimeResult::SetFailure
  // Il2CppName: SetFailure
  template<>
  struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (DateTimeResult::*)(System::ParseFailureKind, ::Il2CppString*, ::Il2CppObject*, ::Il2CppString*)>(&DateTimeResult::SetFailure)> {
    const MethodInfo* get() {
      return ::il2cpp_utils::FindMethod(classof(DateTimeResult), "SetFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<System::ParseFailureKind>(), ::il2cpp_utils::ExtractIndependentType<::Il2CppString*>(), ::il2cpp_utils::ExtractIndependentType<::Il2CppObject*>(), ::il2cpp_utils::ExtractIndependentType<::Il2CppString*>()});
    }
  };
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::DateTimeResult, "System", "DateTimeResult");
