// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.DateTimeParse/TM
#include "System/DateTimeParse_TM.hpp"
// Completed includes
// Type namespace: System
namespace System {
  // Autogenerated type: System.DateTimeRawInfo
  struct DateTimeRawInfo : public System::ValueType {
    public:
    // private System.Int32* num
    // Offset: 0x0
    int* num;
    // System.Int32 numCount
    // Offset: 0x8
    int numCount;
    // System.Int32 month
    // Offset: 0xC
    int month;
    // System.Int32 year
    // Offset: 0x10
    int year;
    // System.Int32 dayOfWeek
    // Offset: 0x14
    int dayOfWeek;
    // System.Int32 era
    // Offset: 0x18
    int era;
    // System.DateTimeParse/TM timeMark
    // Offset: 0x1C
    System::DateTimeParse::TM timeMark;
    // System.Double fraction
    // Offset: 0x20
    double fraction;
    // System.Boolean hasSameDateAndTimeSeparators
    // Offset: 0x28
    bool hasSameDateAndTimeSeparators;
    // System.Boolean timeZone
    // Offset: 0x29
    bool timeZone;
    // Creating value type constructor for type: DateTimeRawInfo
    constexpr DateTimeRawInfo(int* num_ = {}, int numCount_ = {}, int month_ = {}, int year_ = {}, int dayOfWeek_ = {}, int era_ = {}, System::DateTimeParse::TM timeMark_ = {}, double fraction_ = {}, bool hasSameDateAndTimeSeparators_ = {}, bool timeZone_ = {}) noexcept : num{num_}, numCount{numCount_}, month{month_}, year{year_}, dayOfWeek{dayOfWeek_}, era{era_}, timeMark{timeMark_}, fraction{fraction_}, hasSameDateAndTimeSeparators{hasSameDateAndTimeSeparators_}, timeZone{timeZone_} {}
    // System.Void Init(System.Int32* numberBuffer)
    // Offset: 0xA2CE2C
    void Init(int* numberBuffer);
    // System.Void AddNumber(System.Int32 value)
    // Offset: 0xA2CE50
    void AddNumber(int value);
    // System.Int32 GetNumber(System.Int32 index)
    // Offset: 0xA2CE68
    int GetNumber(int index);
  }; // System.DateTimeRawInfo
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::DateTimeRawInfo, "System", "DateTimeRawInfo");
#pragma pack(pop)
