// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.Enum
#include "System/Enum.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Enum/ParseFailureKind
#include "System/Enum_ParseFailureKind.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: System
namespace System {
  // Size: 0x30
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Enum/EnumResult
  struct Enum::EnumResult/*, public System::ValueType*/ {
    public:
    // System.Object parsedEnum
    // Size: 0x8
    // Offset: 0x0
    ::Il2CppObject* parsedEnum;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Boolean canThrow
    // Size: 0x1
    // Offset: 0x8
    bool canThrow;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canThrow and: m_failure
    char __padding1[0x3] = {};
    // System.Enum/ParseFailureKind m_failure
    // Size: 0x4
    // Offset: 0xC
    System::Enum::ParseFailureKind m_failure;
    // Field size check
    static_assert(sizeof(System::Enum::ParseFailureKind) == 0x4);
    // System.String m_failureMessageID
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* m_failureMessageID;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.String m_failureParameter
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* m_failureParameter;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // System.Object m_failureMessageFormatArgument
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* m_failureMessageFormatArgument;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Exception m_innerException
    // Size: 0x8
    // Offset: 0x28
    System::Exception* m_innerException;
    // Field size check
    static_assert(sizeof(System::Exception*) == 0x8);
    // Creating value type constructor for type: EnumResult
    constexpr EnumResult(::Il2CppObject* parsedEnum_ = {}, bool canThrow_ = {}, System::Enum::ParseFailureKind m_failure_ = {}, ::Il2CppString* m_failureMessageID_ = {}, ::Il2CppString* m_failureParameter_ = {}, ::Il2CppObject* m_failureMessageFormatArgument_ = {}, System::Exception* m_innerException_ = {}) noexcept : parsedEnum{parsedEnum_}, canThrow{canThrow_}, m_failure{m_failure_}, m_failureMessageID{m_failureMessageID_}, m_failureParameter{m_failureParameter_}, m_failureMessageFormatArgument{m_failureMessageFormatArgument_}, m_innerException{m_innerException_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // System.Void Init(System.Boolean canMethodThrow)
    // Offset: 0xEFD7F4
    void Init(bool canMethodThrow);
    // System.Void SetFailure(System.Exception unhandledException)
    // Offset: 0xEFD800
    void SetFailure(System::Exception* unhandledException);
    // System.Void SetFailure(System.Enum/ParseFailureKind failure, System.String failureParameter)
    // Offset: 0xEFD810
    void SetFailure(System::Enum::ParseFailureKind failure, ::Il2CppString* failureParameter);
    // System.Void SetFailure(System.Enum/ParseFailureKind failure, System.String failureMessageID, System.Object failureMessageFormatArgument)
    // Offset: 0xEFD818
    void SetFailure(System::Enum::ParseFailureKind failure, ::Il2CppString* failureMessageID, ::Il2CppObject* failureMessageFormatArgument);
    // System.Exception GetEnumParseException()
    // Offset: 0xEFD820
    System::Exception* GetEnumParseException();
  }; // System.Enum/EnumResult
  #pragma pack(pop)
  static check_size<sizeof(Enum::EnumResult), 40 + sizeof(System::Exception*)> __System_Enum_EnumResultSizeCheck;
  static_assert(sizeof(Enum::EnumResult) == 0x30);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::Enum::EnumResult, "System", "Enum/EnumResult");
// Writing MetadataGetter for method: Enum::EnumResult::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Enum::EnumResult::*)(bool)>(&Enum::EnumResult::Init)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Enum::EnumResult), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<bool>()});
  }
};
// Writing MetadataGetter for method: Enum::EnumResult::SetFailure
// Il2CppName: SetFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Enum::EnumResult::*)(System::Exception*)>(&Enum::EnumResult::SetFailure)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Enum::EnumResult), "SetFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<System::Exception*>()});
  }
};
// Writing MetadataGetter for method: Enum::EnumResult::SetFailure
// Il2CppName: SetFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Enum::EnumResult::*)(System::Enum::ParseFailureKind, ::Il2CppString*)>(&Enum::EnumResult::SetFailure)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Enum::EnumResult), "SetFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<System::Enum::ParseFailureKind>(), ::il2cpp_utils::ExtractIndependentType<::Il2CppString*>()});
  }
};
// Writing MetadataGetter for method: Enum::EnumResult::SetFailure
// Il2CppName: SetFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Enum::EnumResult::*)(System::Enum::ParseFailureKind, ::Il2CppString*, ::Il2CppObject*)>(&Enum::EnumResult::SetFailure)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Enum::EnumResult), "SetFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractIndependentType<System::Enum::ParseFailureKind>(), ::il2cpp_utils::ExtractIndependentType<::Il2CppString*>(), ::il2cpp_utils::ExtractIndependentType<::Il2CppObject*>()});
  }
};
// Writing MetadataGetter for method: Enum::EnumResult::GetEnumParseException
// Il2CppName: GetEnumParseException
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<System::Exception* (Enum::EnumResult::*)()>(&Enum::EnumResult::GetEnumParseException)> {
  const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Enum::EnumResult), "GetEnumParseException", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
