// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Type namespace: System
namespace System {
  // Autogenerated type: System.InputRecord
  struct InputRecord : public System::ValueType {
    public:
    // public System.Int16 EventType
    // Offset: 0x0
    int16_t EventType;
    // public System.Boolean KeyDown
    // Offset: 0x2
    bool KeyDown;
    // public System.Int16 RepeatCount
    // Offset: 0x4
    int16_t RepeatCount;
    // public System.Int16 VirtualKeyCode
    // Offset: 0x6
    int16_t VirtualKeyCode;
    // public System.Int16 VirtualScanCode
    // Offset: 0x8
    int16_t VirtualScanCode;
    // public System.Char Character
    // Offset: 0xA
    ::Il2CppChar Character;
    // public System.Int32 ControlKeyState
    // Offset: 0xC
    int ControlKeyState;
    // private System.Int32 pad1
    // Offset: 0x10
    int pad1;
    // private System.Boolean pad2
    // Offset: 0x14
    bool pad2;
    // Creating value type constructor for type: InputRecord
    constexpr InputRecord(int16_t EventType_ = {}, bool KeyDown_ = {}, int16_t RepeatCount_ = {}, int16_t VirtualKeyCode_ = {}, int16_t VirtualScanCode_ = {}, ::Il2CppChar Character_ = {}, int ControlKeyState_ = {}, int pad1_ = {}, bool pad2_ = {}) noexcept : EventType{EventType_}, KeyDown{KeyDown_}, RepeatCount{RepeatCount_}, VirtualKeyCode{VirtualKeyCode_}, VirtualScanCode{VirtualScanCode_}, Character{Character_}, ControlKeyState{ControlKeyState_}, pad1{pad1_}, pad2{pad2_} {}
  }; // System.InputRecord
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::InputRecord, "System", "InputRecord");
#pragma pack(pop)
