// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Decimal
  struct Decimal;
  // Forward declaring type: IFormatProvider
  class IFormatProvider;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: NumberFormatInfo
  class NumberFormatInfo;
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: Thread
  class Thread;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: System
namespace System {
  // Forward declaring type: NumberFormatter
  class NumberFormatter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(System::NumberFormatter);
DEFINE_IL2CPP_ARG_TYPE(System::NumberFormatter*, "System", "NumberFormatter");
// Type namespace: System
namespace System {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: System.NumberFormatter
  // [TokenAttribute] Offset: FFFFFFFF
  class NumberFormatter : public ::Il2CppObject {
    public:
    // Nested type: System::NumberFormatter::CustomInfo
    class CustomInfo;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Globalization.NumberFormatInfo _nfi
    // Size: 0x8
    // Offset: 0x10
    System::Globalization::NumberFormatInfo* nfi;
    // Field size check
    static_assert(sizeof(System::Globalization::NumberFormatInfo*) == 0x8);
    // private System.Char[] _cbuf
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::Il2CppChar> cbuf;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
    // private System.Boolean _NaN
    // Size: 0x1
    // Offset: 0x20
    bool NaN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _infinity
    // Size: 0x1
    // Offset: 0x21
    bool infinity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isCustomFormat
    // Size: 0x1
    // Offset: 0x22
    bool isCustomFormat;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _specifierIsUpper
    // Size: 0x1
    // Offset: 0x23
    bool specifierIsUpper;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _positive
    // Size: 0x1
    // Offset: 0x24
    bool positive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: positive and: specifier
    char __padding6[0x1] = {};
    // private System.Char _specifier
    // Size: 0x2
    // Offset: 0x26
    ::Il2CppChar specifier;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // private System.Int32 _precision
    // Size: 0x4
    // Offset: 0x28
    int precision;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _defPrecision
    // Size: 0x4
    // Offset: 0x2C
    int defPrecision;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _digitsLen
    // Size: 0x4
    // Offset: 0x30
    int digitsLen;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _offset
    // Size: 0x4
    // Offset: 0x34
    int offset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _decPointPos
    // Size: 0x4
    // Offset: 0x38
    int decPointPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.UInt32 _val1
    // Size: 0x4
    // Offset: 0x3C
    uint val1;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _val2
    // Size: 0x4
    // Offset: 0x40
    uint val2;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _val3
    // Size: 0x4
    // Offset: 0x44
    uint val3;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _val4
    // Size: 0x4
    // Offset: 0x48
    uint val4;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Int32 _ind
    // Size: 0x4
    // Offset: 0x4C
    int ind;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private readonly System.UInt64* MantissaBitsTable
    static uint64_t* _get_MantissaBitsTable();
    // Set static field: static private readonly System.UInt64* MantissaBitsTable
    static void _set_MantissaBitsTable(uint64_t* value);
    // Get static field: static private readonly System.Int32* TensExponentTable
    static int* _get_TensExponentTable();
    // Set static field: static private readonly System.Int32* TensExponentTable
    static void _set_TensExponentTable(int* value);
    // Get static field: static private readonly System.Char* DigitLowerTable
    static ::Il2CppChar* _get_DigitLowerTable();
    // Set static field: static private readonly System.Char* DigitLowerTable
    static void _set_DigitLowerTable(::Il2CppChar* value);
    // Get static field: static private readonly System.Char* DigitUpperTable
