// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.IConsoleDriver
#include "System/IConsoleDriver.hpp"
// Including type: System.ConsoleColor
#include "System/ConsoleColor.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: TermInfoReader
  class TermInfoReader;
  // Forward declaring type: ByteMatcher
  class ByteMatcher;
  // Forward declaring type: ConsoleKeyInfo
  struct ConsoleKeyInfo;
  // Forward declaring type: TermInfoStrings
  struct TermInfoStrings;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: StreamReader
  class StreamReader;
  // Forward declaring type: CStreamWriter
  class CStreamWriter;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Completed forward declares
// Type namespace: System
namespace System {
  // Size: 0x11C
  #pragma pack(push, 1)
  // Autogenerated type: System.TermInfoDriver
  class TermInfoDriver : public ::Il2CppObject/*, public System::IConsoleDriver*/ {
    public:
    // private System.TermInfoReader reader
    // Size: 0x8
    // Offset: 0x10
    System::TermInfoReader* reader;
    // Field size check
    static_assert(sizeof(System::TermInfoReader*) == 0x8);
    // private System.Int32 cursorLeft
    // Size: 0x4
    // Offset: 0x18
    int cursorLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 cursorTop
    // Size: 0x4
    // Offset: 0x1C
    int cursorTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String title
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* title;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String titleFormat
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* titleFormat;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean cursorVisible
    // Size: 0x1
    // Offset: 0x30
    bool cursorVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cursorVisible and: csrVisible
    char __padding5[0x7] = {};
    // private System.String csrVisible
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* csrVisible;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String csrInvisible
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppString* csrInvisible;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String clear
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppString* clear;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String bell
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppString* bell;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String term
    // Size: 0x8
    // Offset: 0x58
    ::Il2CppString* term;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.IO.StreamReader stdin
    // Size: 0x8
    // Offset: 0x60
    System::IO::StreamReader* stdin;
    // Field size check
    static_assert(sizeof(System::IO::StreamReader*) == 0x8);
    // private System.IO.CStreamWriter stdout
    // Size: 0x8
    // Offset: 0x68
    System::IO::CStreamWriter* stdout;
    // Field size check
    static_assert(sizeof(System::IO::CStreamWriter*) == 0x8);
    // private System.Int32 windowWidth
    // Size: 0x4
    // Offset: 0x70
    int windowWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 windowHeight
    // Size: 0x4
    // Offset: 0x74
    int windowHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 bufferHeight
    // Size: 0x4
    // Offset: 0x78
    int bufferHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 bufferWidth
    // Size: 0x4
    // Offset: 0x7C
    int bufferWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Char[] buffer
    // Size: 0x8
    // Offset: 0x80
    ::Array<::Il2CppChar>* buffer;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppChar>*) == 0x8);
    // private System.Int32 readpos
    // Size: 0x4
    // Offset: 0x88
    int readpos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 writepos
    // Size: 0x4
    // Offset: 0x8C
    int writepos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String keypadXmit
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppString* keypadXmit;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String keypadLocal
    // Size: 0x8
    // Offset: 0x98
    ::Il2CppString* keypadLocal;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Boolean inited
    // Size: 0x1
    // Offset: 0xA0
    bool inited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inited and: initLock
    char __padding22[0x7] = {};
    // private System.Object initLock
    // Size: 0x8
    // Offset: 0xA8
    ::Il2CppObject* initLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean initKeys
    // Size: 0x1
    // Offset: 0xB0
    bool initKeys;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: initKeys and: origPair
    char __padding24[0x7] = {};
    // private System.String origPair
    // Size: 0x8
    // Offset: 0xB8
    ::Il2CppString* origPair;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String origColors
    // Size: 0x8
    // Offset: 0xC0
    ::Il2CppString* origColors;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String cursorAddress
    // Size: 0x8
    // Offset: 0xC8
    ::Il2CppString* cursorAddress;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.ConsoleColor fgcolor
    // Size: 0x4
    // Offset: 0xD0
    System::ConsoleColor fgcolor;
    // Field size check
    static_assert(sizeof(System::ConsoleColor) == 0x4);
    // Padding between fields: fgcolor and: setfgcolor
    char __padding28[0x4] = {};
    // private System.String setfgcolor
    // Size: 0x8
    // Offset: 0xD8
    ::Il2CppString* setfgcolor;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String setbgcolor
    // Size: 0x8
    // Offset: 0xE0
    ::Il2CppString* setbgcolor;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Int32 maxColors
    // Size: 0x4
    // Offset: 0xE8
    int maxColors;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean noGetPosition
    // Size: 0x1
    // Offset: 0xEC
    bool noGetPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: noGetPosition and: keymap
    char __padding32[0x3] = {};
    // private System.Collections.Hashtable keymap
    // Size: 0x8
    // Offset: 0xF0
    System::Collections::Hashtable* keymap;
    // Field size check
    static_assert(sizeof(System::Collections::Hashtable*) == 0x8);
    // private System.ByteMatcher rootmap
    // Size: 0x8
    // Offset: 0xF8
    System::ByteMatcher* rootmap;
    // Field size check
    static_assert(sizeof(System::ByteMatcher*) == 0x8);
    // private System.Int32 rl_startx
    // Size: 0x4
    // Offset: 0x100
    int rl_startx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 rl_starty
    // Size: 0x4
    // Offset: 0x104
    int rl_starty;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Byte[] control_characters
    // Size: 0x8
    // Offset: 0x108
    ::Array<uint8_t>* control_characters;
    // Field size check
    static_assert(sizeof(::Array<uint8_t>*) == 0x8);
    // private System.Char[] echobuf
    // Size: 0x8
    // Offset: 0x110
    ::Array<::Il2CppChar>* echobuf;
    // Field size check
    static_assert(sizeof(::Array<::Il2CppChar>*) == 0x8);
    // private System.Int32 echon
    // Size: 0x4
    // Offset: 0x118
    int echon;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Creating value type constructor for type: TermInfoDriver
