// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: System.TimeZoneInfo
#include "System/TimeZoneInfo.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Type namespace: System
namespace System {
  // Autogenerated type: System.TimeZoneInfo/SYSTEMTIME
  struct TimeZoneInfo::SYSTEMTIME : public System::ValueType {
    public:
    // System.UInt16 wYear
    // Offset: 0x0
    uint16_t wYear;
    // System.UInt16 wMonth
    // Offset: 0x2
    uint16_t wMonth;
    // System.UInt16 wDayOfWeek
    // Offset: 0x4
    uint16_t wDayOfWeek;
    // System.UInt16 wDay
    // Offset: 0x6
    uint16_t wDay;
    // System.UInt16 wHour
    // Offset: 0x8
    uint16_t wHour;
    // System.UInt16 wMinute
    // Offset: 0xA
    uint16_t wMinute;
    // System.UInt16 wSecond
    // Offset: 0xC
    uint16_t wSecond;
    // System.UInt16 wMilliseconds
    // Offset: 0xE
    uint16_t wMilliseconds;
    // Creating value type constructor for type: SYSTEMTIME
    constexpr SYSTEMTIME(uint16_t wYear_ = {}, uint16_t wMonth_ = {}, uint16_t wDayOfWeek_ = {}, uint16_t wDay_ = {}, uint16_t wHour_ = {}, uint16_t wMinute_ = {}, uint16_t wSecond_ = {}, uint16_t wMilliseconds_ = {}) noexcept : wYear{wYear_}, wMonth{wMonth_}, wDayOfWeek{wDayOfWeek_}, wDay{wDay_}, wHour{wHour_}, wMinute{wMinute_}, wSecond{wSecond_}, wMilliseconds{wMilliseconds_} {}
  }; // System.TimeZoneInfo/SYSTEMTIME
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::TimeZoneInfo::SYSTEMTIME, "System", "TimeZoneInfo/SYSTEMTIME");
#pragma pack(pop)
