// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Uri
#include "System/Uri.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: System
namespace System {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: System.Uri/System.MoreInfo
  // [TokenAttribute] Offset: FFFFFFFF
  class Uri::MoreInfo : public ::Il2CppObject {
    public:
    // public System.String Path
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* Path;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String Query
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* Query;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String Fragment
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppString* Fragment;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.String AbsoluteUri
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppString* AbsoluteUri;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // public System.Int32 Hash
    // Size: 0x4
    // Offset: 0x30
    int Hash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Hash and: RemoteUrl
    char __padding4[0x4] = {};
    // public System.String RemoteUrl
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppString* RemoteUrl;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // Creating value type constructor for type: MoreInfo
    MoreInfo(::Il2CppString* Path_ = {}, ::Il2CppString* Query_ = {}, ::Il2CppString* Fragment_ = {}, ::Il2CppString* AbsoluteUri_ = {}, int Hash_ = {}, ::Il2CppString* RemoteUrl_ = {}) noexcept : Path{Path_}, Query{Query_}, Fragment{Fragment_}, AbsoluteUri{AbsoluteUri_}, Hash{Hash_}, RemoteUrl{RemoteUrl_} {}
    // Get instance field: public System.String Path
    ::Il2CppString* _get_Path();
    // Set instance field: public System.String Path
    void _set_Path(::Il2CppString* value);
    // Get instance field: public System.String Query
    ::Il2CppString* _get_Query();
    // Set instance field: public System.String Query
    void _set_Query(::Il2CppString* value);
    // Get instance field: public System.String Fragment
    ::Il2CppString* _get_Fragment();
    // Set instance field: public System.String Fragment
    void _set_Fragment(::Il2CppString* value);
    // Get instance field: public System.String AbsoluteUri
    ::Il2CppString* _get_AbsoluteUri();
    // Set instance field: public System.String AbsoluteUri
    void _set_AbsoluteUri(::Il2CppString* value);
    // Get instance field: public System.Int32 Hash
    int _get_Hash();
    // Set instance field: public System.Int32 Hash
    void _set_Hash(int value);
    // Get instance field: public System.String RemoteUrl
    ::Il2CppString* _get_RemoteUrl();
    // Set instance field: public System.String RemoteUrl
    void _set_RemoteUrl(::Il2CppString* value);
    // public System.Void .ctor()
    // Offset: 0x1E0DAC0
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Uri::MoreInfo* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Uri::MoreInfo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Uri::MoreInfo*, creationType>()));
    }
  }; // System.Uri/System.MoreInfo
  #pragma pack(pop)
  static check_size<sizeof(Uri::MoreInfo), 56 + sizeof(::Il2CppString*)> __System_Uri_MoreInfoSizeCheck;
  static_assert(sizeof(Uri::MoreInfo) == 0x40);
}
DEFINE_IL2CPP_ARG_TYPE(System::Uri::MoreInfo*, "System", "Uri/MoreInfo");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Uri::MoreInfo::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
