// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.Object
#include "System/Object.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
struct CsObject;
struct CsString;
// Completed il2cpp-utils forward declares
// Type namespace: System
namespace System {
  // Autogenerated type: System.UriBuilder
  class UriBuilder : public ::CsObject {
    public:
    // private System.Boolean _changed
    // Offset: 0x10
    bool changed;
    // private System.String _fragment
    // Offset: 0x18
    ::CsString* fragment;
    // private System.String _host
    // Offset: 0x20
    ::CsString* host;
    // private System.String _password
    // Offset: 0x28
    ::CsString* password;
    // private System.String _path
    // Offset: 0x30
    ::CsString* path;
    // private System.Int32 _port
    // Offset: 0x38
    int port;
    // private System.String _query
    // Offset: 0x40
    ::CsString* query;
    // private System.String _scheme
    // Offset: 0x48
    ::CsString* scheme;
    // private System.String _schemeDelimiter
    // Offset: 0x50
    ::CsString* schemeDelimiter;
    // private System.Uri _uri
    // Offset: 0x58
    System::Uri* uri;
    // private System.String _username
    // Offset: 0x60
    ::CsString* username;
    // public System.Void .ctor(System.String uri)
    // Offset: 0x14F5684
    static UriBuilder* New_ctor(::CsString* uri);
    // private System.Void Init(System.Uri uri)
    // Offset: 0x14F5854
    void Init(System::Uri* uri);
    // public System.Void .ctor(System.String schemeName, System.String hostName)
    // Offset: 0x14F5BE4
    static UriBuilder* New_ctor(::CsString* schemeName, ::CsString* hostName);
    // public System.Void .ctor(System.String scheme, System.String host, System.Int32 portNumber)
    // Offset: 0x14F5F88
    static UriBuilder* New_ctor(::CsString* scheme, ::CsString* host, int portNumber);
    // public System.Void set_Host(System.String value)
    // Offset: 0x14F5E98
    void set_Host(::CsString* value);
    // public System.Void set_Path(System.String value)
    // Offset: 0x14F6054
    void set_Path(::CsString* value);
    // public System.Void set_Port(System.Int32 value)
    // Offset: 0x14F5FB4
    void set_Port(int value);
    // public System.Void set_Query(System.String value)
    // Offset: 0x14F611C
    void set_Query(::CsString* value);
    // public System.Void set_Scheme(System.String value)
    // Offset: 0x14F5D54
    void set_Scheme(::CsString* value);
    // public System.Uri get_Uri()
    // Offset: 0x14F61E4
    System::Uri* get_Uri();
    // private System.Void SetFieldsFromUri(System.Uri uri)
    // Offset: 0x14F5A20
    void SetFieldsFromUri(System::Uri* uri);
    // public override System.Boolean Equals(System.Object rparam)
    // Offset: 0x14F6298
    // Implemented from: System.Object
    // Base method: System.Boolean Object::Equals(System.Object rparam)
    bool Equals(::CsObject* rparam);
    // public override System.Int32 GetHashCode()
    // Offset: 0x14F62F8
    // Implemented from: System.Object
    // Base method: System.Int32 Object::GetHashCode()
    int GetHashCode();
    // public override System.String ToString()
    // Offset: 0x14F631C
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::CsString* ToString();
  }; // System.UriBuilder
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::UriBuilder*, "System", "UriBuilder");
#pragma pack(pop)
