// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Completed forward declares
// Type namespace: System
namespace System {
  // Autogenerated type: System.UriBuilder
  class UriBuilder : public ::Il2CppObject {
    public:
    // private System.Boolean _changed
    // Offset: 0x10
    bool changed;
    // private System.String _fragment
    // Offset: 0x18
    ::Il2CppString* fragment;
    // private System.String _host
    // Offset: 0x20
    ::Il2CppString* host;
    // private System.String _password
    // Offset: 0x28
    ::Il2CppString* password;
    // private System.String _path
    // Offset: 0x30
    ::Il2CppString* path;
    // private System.Int32 _port
    // Offset: 0x38
    int port;
    // private System.String _query
    // Offset: 0x40
    ::Il2CppString* query;
    // private System.String _scheme
    // Offset: 0x48
    ::Il2CppString* scheme;
    // private System.String _schemeDelimiter
    // Offset: 0x50
    ::Il2CppString* schemeDelimiter;
    // private System.Uri _uri
    // Offset: 0x58
    System::Uri* uri;
    // private System.String _username
    // Offset: 0x60
    ::Il2CppString* username;
    // public System.Void .ctor(System.String uri)
    // Offset: 0x1511548
    static UriBuilder* New_ctor(::Il2CppString* uri);
    // private System.Void Init(System.Uri uri)
    // Offset: 0x1511718
    void Init(System::Uri* uri);
    // public System.Void .ctor(System.String schemeName, System.String hostName)
    // Offset: 0x1511AA8
    static UriBuilder* New_ctor(::Il2CppString* schemeName, ::Il2CppString* hostName);
    // public System.Void .ctor(System.String scheme, System.String host, System.Int32 portNumber)
    // Offset: 0x1511E4C
    static UriBuilder* New_ctor(::Il2CppString* scheme, ::Il2CppString* host, int portNumber);
    // public System.Void set_Host(System.String value)
    // Offset: 0x1511D5C
    void set_Host(::Il2CppString* value);
    // public System.Void set_Path(System.String value)
    // Offset: 0x1511F18
    void set_Path(::Il2CppString* value);
    // public System.Void set_Port(System.Int32 value)
    // Offset: 0x1511E78
    void set_Port(int value);
    // public System.Void set_Query(System.String value)
    // Offset: 0x1511FE0
    void set_Query(::Il2CppString* value);
    // public System.Void set_Scheme(System.String value)
    // Offset: 0x1511C18
    void set_Scheme(::Il2CppString* value);
    // public System.Uri get_Uri()
    // Offset: 0x15120A8
    System::Uri* get_Uri();
    // private System.Void SetFieldsFromUri(System.Uri uri)
    // Offset: 0x15118E4
    void SetFieldsFromUri(System::Uri* uri);
    // public override System.Boolean Equals(System.Object rparam)
    // Offset: 0x151215C
    // Implemented from: System.Object
    // Base method: System.Boolean Object::Equals(System.Object rparam)
    bool Equals(::Il2CppObject* rparam);
    // public override System.Int32 GetHashCode()
    // Offset: 0x15121BC
    // Implemented from: System.Object
    // Base method: System.Int32 Object::GetHashCode()
    int GetHashCode();
    // public override System.String ToString()
    // Offset: 0x15121E0
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::Il2CppString* ToString();
  }; // System.UriBuilder
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(System::UriBuilder*, "System", "UriBuilder");
#pragma pack(pop)
