// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: Polyglot.GoogleDriveDownloadFormat
#include "Polyglot/GoogleDriveDownloadFormat.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: TextAsset
  class TextAsset;
}
// Completed forward declares
// Type namespace: Polyglot
namespace Polyglot {
  // Size: 0x31
  #pragma pack(push, 1)
  // Autogenerated type: Polyglot.LocalizationDocument
  // [TokenAttribute] Offset: FFFFFFFF
  class LocalizationDocument : public ::Il2CppObject {
    public:
    // private System.String docsId
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* docsId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String sheetId
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* sheetId;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private Polyglot.GoogleDriveDownloadFormat format
    // Size: 0x4
    // Offset: 0x20
    Polyglot::GoogleDriveDownloadFormat format;
    // Field size check
    static_assert(sizeof(Polyglot::GoogleDriveDownloadFormat) == 0x4);
    // Padding between fields: format and: textAsset
    char __padding2[0x4] = {};
    // private UnityEngine.TextAsset textAsset
    // Size: 0x8
    // Offset: 0x28
    UnityEngine::TextAsset* textAsset;
    // Field size check
    static_assert(sizeof(UnityEngine::TextAsset*) == 0x8);
    // private System.Boolean downloadOnStart
    // Size: 0x1
    // Offset: 0x30
    bool downloadOnStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Creating value type constructor for type: LocalizationDocument
    LocalizationDocument(::Il2CppString* docsId_ = {}, ::Il2CppString* sheetId_ = {}, Polyglot::GoogleDriveDownloadFormat format_ = {}, UnityEngine::TextAsset* textAsset_ = {}, bool downloadOnStart_ = {}) noexcept : docsId{docsId_}, sheetId{sheetId_}, format{format_}, textAsset{textAsset_}, downloadOnStart{downloadOnStart_} {}
    // Get instance field: private System.String docsId
    ::Il2CppString* _get_docsId();
    // Set instance field: private System.String docsId
    void _set_docsId(::Il2CppString* value);
    // Get instance field: private System.String sheetId
    ::Il2CppString* _get_sheetId();
    // Set instance field: private System.String sheetId
    void _set_sheetId(::Il2CppString* value);
    // Get instance field: private Polyglot.GoogleDriveDownloadFormat format
    Polyglot::GoogleDriveDownloadFormat _get_format();
    // Set instance field: private Polyglot.GoogleDriveDownloadFormat format
    void _set_format(Polyglot::GoogleDriveDownloadFormat value);
    // Get instance field: private UnityEngine.TextAsset textAsset
    UnityEngine::TextAsset* _get_textAsset();
    // Set instance field: private UnityEngine.TextAsset textAsset
    void _set_textAsset(UnityEngine::TextAsset* value);
    // Get instance field: private System.Boolean downloadOnStart
    bool _get_downloadOnStart();
    // Set instance field: private System.Boolean downloadOnStart
    void _set_downloadOnStart(bool value);
    // public UnityEngine.TextAsset get_TextAsset()
    // Offset: 0x2381B5C
    UnityEngine::TextAsset* get_TextAsset();
    // public System.Void set_TextAsset(UnityEngine.TextAsset value)
    // Offset: 0x2381B64
    void set_TextAsset(UnityEngine::TextAsset* value);
    // public System.String get_DocsId()
    // Offset: 0x2381B6C
    ::Il2CppString* get_DocsId();
    // public System.Void set_DocsId(System.String value)
    // Offset: 0x2381B74
    void set_DocsId(::Il2CppString* value);
    // public System.String get_SheetId()
    // Offset: 0x2381B7C
    ::Il2CppString* get_SheetId();
    // public System.Void set_SheetId(System.String value)
    // Offset: 0x2381B84
    void set_SheetId(::Il2CppString* value);
    // public Polyglot.GoogleDriveDownloadFormat get_Format()
    // Offset: 0x2381B8C
    Polyglot::GoogleDriveDownloadFormat get_Format();
    // public System.Void set_Format(Polyglot.GoogleDriveDownloadFormat value)
    // Offset: 0x2381B94
    void set_Format(Polyglot::GoogleDriveDownloadFormat value);
    // public System.Boolean get_DownloadOnStart()
    // Offset: 0x2381B9C
    bool get_DownloadOnStart();
    // public System.Void set_DownloadOnStart(System.Boolean value)
    // Offset: 0x2381BA4
    void set_DownloadOnStart(bool value);
    // public System.Void .ctor()
    // Offset: 0x2381BB0
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LocalizationDocument* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("Polyglot::LocalizationDocument::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LocalizationDocument*, creationType>()));
    }
  }; // Polyglot.LocalizationDocument
  #pragma pack(pop)
  static check_size<sizeof(LocalizationDocument), 48 + sizeof(bool)> __Polyglot_LocalizationDocumentSizeCheck;
  static_assert(sizeof(LocalizationDocument) == 0x31);
}
DEFINE_IL2CPP_ARG_TYPE(Polyglot::LocalizationDocument*, "Polyglot", "LocalizationDocument");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::get_TextAsset
// Il2CppName: get_TextAsset
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<UnityEngine::TextAsset* (Polyglot::LocalizationDocument::*)()>(&Polyglot::LocalizationDocument::get_TextAsset)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "get_TextAsset", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::set_TextAsset
// Il2CppName: set_TextAsset
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Polyglot::LocalizationDocument::*)(UnityEngine::TextAsset*)>(&Polyglot::LocalizationDocument::set_TextAsset)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine", "TextAsset")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "set_TextAsset", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::get_DocsId
// Il2CppName: get_DocsId
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Il2CppString* (Polyglot::LocalizationDocument::*)()>(&Polyglot::LocalizationDocument::get_DocsId)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "get_DocsId", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::set_DocsId
// Il2CppName: set_DocsId
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Polyglot::LocalizationDocument::*)(::Il2CppString*)>(&Polyglot::LocalizationDocument::set_DocsId)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "set_DocsId", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::get_SheetId
// Il2CppName: get_SheetId
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Il2CppString* (Polyglot::LocalizationDocument::*)()>(&Polyglot::LocalizationDocument::get_SheetId)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "get_SheetId", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::set_SheetId
// Il2CppName: set_SheetId
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Polyglot::LocalizationDocument::*)(::Il2CppString*)>(&Polyglot::LocalizationDocument::set_SheetId)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "set_SheetId", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::get_Format
// Il2CppName: get_Format
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<Polyglot::GoogleDriveDownloadFormat (Polyglot::LocalizationDocument::*)()>(&Polyglot::LocalizationDocument::get_Format)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "get_Format", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::set_Format
// Il2CppName: set_Format
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Polyglot::LocalizationDocument::*)(Polyglot::GoogleDriveDownloadFormat)>(&Polyglot::LocalizationDocument::set_Format)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("Polyglot", "GoogleDriveDownloadFormat")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "set_Format", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::get_DownloadOnStart
// Il2CppName: get_DownloadOnStart
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Polyglot::LocalizationDocument::*)()>(&Polyglot::LocalizationDocument::get_DownloadOnStart)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "get_DownloadOnStart", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::set_DownloadOnStart
// Il2CppName: set_DownloadOnStart
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Polyglot::LocalizationDocument::*)(bool)>(&Polyglot::LocalizationDocument::set_DownloadOnStart)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Polyglot::LocalizationDocument*), "set_DownloadOnStart", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Polyglot::LocalizationDocument::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
