// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PlayFab.SharedModels.PlayFabBaseModel
#include "PlayFab/SharedModels/PlayFabBaseModel.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: PlayFab.DataModels
namespace PlayFab::DataModels {
  // Forward declaring type: GetFileMetadata
  class GetFileMetadata;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PlayFab::DataModels::GetFileMetadata);
DEFINE_IL2CPP_ARG_TYPE(::PlayFab::DataModels::GetFileMetadata*, "PlayFab.DataModels", "GetFileMetadata");
// Type namespace: PlayFab.DataModels
namespace PlayFab::DataModels {
  // Size: 0x34
  #pragma pack(push, 1)
  // Autogenerated type: PlayFab.DataModels.GetFileMetadata
  // [TokenAttribute] Offset: FFFFFFFF
  class GetFileMetadata : public ::PlayFab::SharedModels::PlayFabBaseModel {
    public:
    public:
    // public System.String Checksum
    // Size: 0x8
    // Offset: 0x10
    ::StringW Checksum;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String DownloadUrl
    // Size: 0x8
    // Offset: 0x18
    ::StringW DownloadUrl;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String FileName
    // Size: 0x8
    // Offset: 0x20
    ::StringW FileName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.DateTime LastModified
    // Size: 0x8
    // Offset: 0x28
    ::System::DateTime LastModified;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // public System.Int32 Size
    // Size: 0x4
    // Offset: 0x30
    int Size;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public System.String Checksum
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Checksum();
    // Get instance field reference: public System.String DownloadUrl
    [[deprecated("Use field access instead!")]] ::StringW& dyn_DownloadUrl();
    // Get instance field reference: public System.String FileName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_FileName();
    // Get instance field reference: public System.DateTime LastModified
    [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_LastModified();
    // Get instance field reference: public System.Int32 Size
    [[deprecated("Use field access instead!")]] int& dyn_Size();
    // public System.Void .ctor()
    // Offset: 0xB5DEF8
    // Implemented from: PlayFab.SharedModels.PlayFabBaseModel
    // Base method: System.Void PlayFabBaseModel::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GetFileMetadata* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PlayFab::DataModels::GetFileMetadata::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GetFileMetadata*, creationType>()));
    }
  }; // PlayFab.DataModels.GetFileMetadata
  #pragma pack(pop)
  static check_size<sizeof(GetFileMetadata), 48 + sizeof(int)> __PlayFab_DataModels_GetFileMetadataSizeCheck;
  static_assert(sizeof(GetFileMetadata) == 0x34);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PlayFab::DataModels::GetFileMetadata::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
