// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVRSkeleton
#include "GlobalNamespace/OVRSkeleton.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRHand
  class OVRHand;
  // Forward declaring type: OVRSkeletonRenderer
  class OVRSkeletonRenderer;
  // Forward declaring type: OVRMesh
  class OVRMesh;
  // Forward declaring type: OVRMeshRenderer
  class OVRMeshRenderer;
  // Forward declaring type: OVRBoneCapsule
  class OVRBoneCapsule;
}
// Forward declaring namespace: OculusSampleFramework
namespace OculusSampleFramework {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: OculusSampleFramework
namespace OculusSampleFramework {
  // Forward declaring type: HandsManager
  class HandsManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::OculusSampleFramework::HandsManager);
DEFINE_IL2CPP_ARG_TYPE(::OculusSampleFramework::HandsManager*, "OculusSampleFramework", "HandsManager");
// Type namespace: OculusSampleFramework
namespace OculusSampleFramework {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: OculusSampleFramework.HandsManager
  // [TokenAttribute] Offset: FFFFFFFF
  class HandsManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::OculusSampleFramework::HandsManager::HandsVisualMode
    struct HandsVisualMode;
    // Nested type: ::OculusSampleFramework::HandsManager::$FindSkeletonVisualGameObjects$d__52
    class $FindSkeletonVisualGameObjects$d__52;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct HandsVisualMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: HandsVisualMode
      constexpr HandsVisualMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode Mesh
      static constexpr const int Mesh = 0;
      // Get static field: static public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode Mesh
      static ::OculusSampleFramework::HandsManager::HandsVisualMode _get_Mesh();
      // Set static field: static public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode Mesh
      static void _set_Mesh(::OculusSampleFramework::HandsManager::HandsVisualMode value);
      // static field const value: static public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode Skeleton
      static constexpr const int Skeleton = 1;
      // Get static field: static public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode Skeleton
      static ::OculusSampleFramework::HandsManager::HandsVisualMode _get_Skeleton();
      // Set static field: static public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode Skeleton
      static void _set_Skeleton(::OculusSampleFramework::HandsManager::HandsVisualMode value);
      // static field const value: static public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode Both
      static constexpr const int Both = 2;
      // Get static field: static public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode Both
      static ::OculusSampleFramework::HandsManager::HandsVisualMode _get_Both();
      // Set static field: static public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode Both
      static void _set_Both(::OculusSampleFramework::HandsManager::HandsVisualMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode
    #pragma pack(pop)
    static check_size<sizeof(HandsManager::HandsVisualMode), 0 + sizeof(int)> __OculusSampleFramework_HandsManager_HandsVisualModeSizeCheck;
    static_assert(sizeof(HandsManager::HandsVisualMode) == 0x4);
    public:
    // private UnityEngine.GameObject _leftHand
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* leftHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject _rightHand
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* rightHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public OculusSampleFramework.HandsManager/OculusSampleFramework.HandsVisualMode VisualMode
    // Size: 0x4
    // Offset: 0x28
    ::OculusSampleFramework::HandsManager::HandsVisualMode VisualMode;
    // Field size check
    static_assert(sizeof(::OculusSampleFramework::HandsManager::HandsVisualMode) == 0x4);
    // Padding between fields: VisualMode and: hand
    char __padding2[0x4] = {};
    // private OVRHand[] _hand
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::GlobalNamespace::OVRHand*> hand;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::OVRHand*>) == 0x8);
    // private OVRSkeleton[] _handSkeleton
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::GlobalNamespace::OVRSkeleton*> handSkeleton;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::OVRSkeleton*>) == 0x8);
    // private OVRSkeletonRenderer[] _handSkeletonRenderer
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::GlobalNamespace::OVRSkeletonRenderer*> handSkeletonRenderer;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::OVRSkeletonRenderer*>) == 0x8);
    // private OVRMesh[] _handMesh
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::GlobalNamespace::OVRMesh*> handMesh;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::OVRMesh*>) == 0x8);
    // private OVRMeshRenderer[] _handMeshRenderer
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::GlobalNamespace::OVRMeshRenderer*> handMeshRenderer;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::OVRMeshRenderer*>) == 0x8);
    // private UnityEngine.SkinnedMeshRenderer _leftMeshRenderer
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::SkinnedMeshRenderer* leftMeshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // private UnityEngine.SkinnedMeshRenderer _rightMeshRenderer
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::SkinnedMeshRenderer* rightMeshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // private UnityEngine.GameObject _leftSkeletonVisual
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* leftSkeletonVisual;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject _rightSkeletonVisual
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* rightSkeletonVisual;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single _currentHandAlpha
    // Size: 0x4
    // Offset: 0x78
    float currentHandAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 HandAlphaId
    // Size: 0x4
    // Offset: 0x7C
    int HandAlphaId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.String SKELETON_VISUALIZER_NAME
    static constexpr const char* SKELETON_VISUALIZER_NAME = "SkeletonRenderer";
    // Get static field: static private System.String SKELETON_VISUALIZER_NAME
    static ::StringW _get_SKELETON_VISUALIZER_NAME();
    // Set static field: static private System.String SKELETON_VISUALIZER_NAME
    static void _set_SKELETON_VISUALIZER_NAME(::StringW value);
    // Get static field: static private OculusSampleFramework.HandsManager <Instance>k__BackingField
    static ::OculusSampleFramework::HandsManager* _get_$Instance$k__BackingField();
    // Set static field: static private OculusSampleFramework.HandsManager <Instance>k__BackingField
