// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "extern/beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Security
namespace System::Security {
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: System.Security
namespace System::Security {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.Security.SecurityElement
  // [ComVisibleAttribute] Offset: C961E0
  class SecurityElement : public ::Il2CppObject {
    public:
    // Nested type: System::Security::SecurityElement::SecurityAttribute
    class SecurityAttribute;
    // private System.String text
    // Size: 0x8
    // Offset: 0x10
    ::Il2CppString* text;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.String tag
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppString* tag;
    // Field size check
    static_assert(sizeof(::Il2CppString*) == 0x8);
    // private System.Collections.ArrayList attributes
    // Size: 0x8
    // Offset: 0x20
    System::Collections::ArrayList* attributes;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // private System.Collections.ArrayList children
    // Size: 0x8
    // Offset: 0x28
    System::Collections::ArrayList* children;
    // Field size check
    static_assert(sizeof(System::Collections::ArrayList*) == 0x8);
    // Creating value type constructor for type: SecurityElement
    SecurityElement(::Il2CppString* text_ = {}, ::Il2CppString* tag_ = {}, System::Collections::ArrayList* attributes_ = {}, System::Collections::ArrayList* children_ = {}) noexcept : text{text_}, tag{tag_}, attributes{attributes_}, children{children_} {}
    // Get static field: static private readonly System.Char[] invalid_tag_chars
    static ::Array<::Il2CppChar>* _get_invalid_tag_chars();
    // Set static field: static private readonly System.Char[] invalid_tag_chars
    static void _set_invalid_tag_chars(::Array<::Il2CppChar>* value);
    // Get static field: static private readonly System.Char[] invalid_text_chars
    static ::Array<::Il2CppChar>* _get_invalid_text_chars();
    // Set static field: static private readonly System.Char[] invalid_text_chars
    static void _set_invalid_text_chars(::Array<::Il2CppChar>* value);
    // Get static field: static private readonly System.Char[] invalid_attr_name_chars
    static ::Array<::Il2CppChar>* _get_invalid_attr_name_chars();
    // Set static field: static private readonly System.Char[] invalid_attr_name_chars
    static void _set_invalid_attr_name_chars(::Array<::Il2CppChar>* value);
    // Get static field: static private readonly System.Char[] invalid_attr_value_chars
    static ::Array<::Il2CppChar>* _get_invalid_attr_value_chars();
    // Set static field: static private readonly System.Char[] invalid_attr_value_chars
    static void _set_invalid_attr_value_chars(::Array<::Il2CppChar>* value);
    // Get static field: static private readonly System.Char[] invalid_chars
    static ::Array<::Il2CppChar>* _get_invalid_chars();
    // Set static field: static private readonly System.Char[] invalid_chars
    static void _set_invalid_chars(::Array<::Il2CppChar>* value);
    // public System.Void .ctor(System.String tag)
    // Offset: 0x1975BB4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SecurityElement* New_ctor(::Il2CppString* tag) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Security::SecurityElement::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SecurityElement*, creationType>(tag)));
    }
    // public System.Void .ctor(System.String tag, System.String text)
    // Offset: 0x1975E0C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SecurityElement* New_ctor(::Il2CppString* tag, ::Il2CppString* text) {
      static auto ___internal__logger = ::Logger::get().WithContext("System::Security::SecurityElement::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SecurityElement*, creationType>(tag, text)));
    }
    // public System.Collections.Hashtable get_Attributes()
    // Offset: 0x19760E4
    System::Collections::Hashtable* get_Attributes();
    // public System.Collections.ArrayList get_Children()
    // Offset: 0x1976398
    System::Collections::ArrayList* get_Children();
    // public System.String get_Tag()
    // Offset: 0x19763A0
    ::Il2CppString* get_Tag();
    // public System.String get_Text()
    // Offset: 0x19763A8
    ::Il2CppString* get_Text();
    // public System.Void set_Text(System.String value)
    // Offset: 0x1975FD4
    void set_Text(::Il2CppString* value);
    // public System.Void AddAttribute(System.String name, System.String value)
    // Offset: 0x1975BBC
    void AddAttribute(::Il2CppString* name, ::Il2CppString* value);
    // public System.Void AddChild(System.Security.SecurityElement child)
    // Offset: 0x1975D3C
    void AddChild(System::Security::SecurityElement* child);
    // static public System.String Escape(System.String str)
    // Offset: 0x197698C
    static ::Il2CppString* Escape(::Il2CppString* str);
    // static private System.String Unescape(System.String str)
    // Offset: 0x197643C
    static ::Il2CppString* Unescape(::Il2CppString* str);
    // static public System.Security.SecurityElement FromString(System.String xml)
    // Offset: 0x1976B68
    static System::Security::SecurityElement* FromString(::Il2CppString* xml);
    // static public System.Boolean IsValidAttributeName(System.String name)
    // Offset: 0x1976D44
    static bool IsValidAttributeName(::Il2CppString* name);
    // static public System.Boolean IsValidAttributeValue(System.String value)
    // Offset: 0x1976DD0
    static bool IsValidAttributeValue(::Il2CppString* value);
    // static public System.Boolean IsValidTag(System.String tag)
    // Offset: 0x1975F48
    static bool IsValidTag(::Il2CppString* tag);
    // static public System.Boolean IsValidText(System.String text)
    // Offset: 0x19763B0
    static bool IsValidText(::Il2CppString* text);
    // public System.Security.SecurityElement SearchForChildByTag(System.String tag)
    // Offset: 0x1976E5C
    System::Security::SecurityElement* SearchForChildByTag(::Il2CppString* tag);
    // private System.Void ToXml(ref System.Text.StringBuilder s, System.Int32 level)
    // Offset: 0x1977014
    void ToXml(System::Text::StringBuilder*& s, int level);
    // System.Security.SecurityElement/SecurityAttribute GetAttribute(System.String name)
    // Offset: 0x1976578
    System::Security::SecurityElement::SecurityAttribute* GetAttribute(::Il2CppString* name);
    // System.Void set_m_strText(System.String value)
    // Offset: 0x1977554
    void set_m_strText(::Il2CppString* value);
    // System.String SearchForTextOfLocalName(System.String strLocalName)
    // Offset: 0x1964D30
    ::Il2CppString* SearchForTextOfLocalName(::Il2CppString* strLocalName);
    // static private System.Void .cctor()
    // Offset: 0x197755C
    static void _cctor();
    // public override System.String ToString()
    // Offset: 0x1976F84
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::Il2CppString* ToString();
  }; // System.Security.SecurityElement
  #pragma pack(pop)
  static check_size<sizeof(SecurityElement), 40 + sizeof(System::Collections::ArrayList*)> __System_Security_SecurityElementSizeCheck;
  static_assert(sizeof(SecurityElement) == 0x30);
}
DEFINE_IL2CPP_ARG_TYPE(System::Security::SecurityElement*, "System.Security", "SecurityElement");
