// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include "extern/beatsaber-hook/shared/utils/typedefs.h"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: UnityEngine::AI
namespace UnityEngine::AI {
  // Forward declaring type: NavMeshPath
  class NavMeshPath;
}
// Forward declaring namespace: RootMotion::Demos
namespace RootMotion::Demos {
  // Skipping declaration: State because it is already included!
}
// Completed forward declares
// Type namespace: RootMotion.Demos
namespace RootMotion::Demos {
  // Autogenerated type: RootMotion.Demos.Navigator
  class Navigator : public ::Il2CppObject {
    public:
    // Nested type: RootMotion::Demos::Navigator::State
    struct State;
    // Autogenerated type: RootMotion.Demos.Navigator/State
    struct State : public System::Enum {
      public:
      // public System.Int32 value__
      // Offset: 0x0
      int value;
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public RootMotion.Demos.Navigator/State Idle
      static constexpr const int Idle = 0;
      // Get static field: static public RootMotion.Demos.Navigator/State Idle
      static RootMotion::Demos::Navigator::State _get_Idle();
      // Set static field: static public RootMotion.Demos.Navigator/State Idle
      static void _set_Idle(RootMotion::Demos::Navigator::State value);
      // static field const value: static public RootMotion.Demos.Navigator/State Seeking
      static constexpr const int Seeking = 1;
      // Get static field: static public RootMotion.Demos.Navigator/State Seeking
      static RootMotion::Demos::Navigator::State _get_Seeking();
      // Set static field: static public RootMotion.Demos.Navigator/State Seeking
      static void _set_Seeking(RootMotion::Demos::Navigator::State value);
      // static field const value: static public RootMotion.Demos.Navigator/State OnPath
      static constexpr const int OnPath = 2;
      // Get static field: static public RootMotion.Demos.Navigator/State OnPath
      static RootMotion::Demos::Navigator::State _get_OnPath();
      // Set static field: static public RootMotion.Demos.Navigator/State OnPath
      static void _set_OnPath(RootMotion::Demos::Navigator::State value);
    }; // RootMotion.Demos.Navigator/State
    // public System.Boolean activeTargetSeeking
    // Offset: 0x10
    bool activeTargetSeeking;
    // public System.Single cornerRadius
    // Offset: 0x14
    float cornerRadius;
    // public System.Single recalculateOnPathDistance
    // Offset: 0x18
    float recalculateOnPathDistance;
    // public System.Single maxSampleDistance
    // Offset: 0x1C
    float maxSampleDistance;
    // public System.Single nextPathInterval
    // Offset: 0x20
    float nextPathInterval;
    // private UnityEngine.Vector3 <normalizedDeltaPosition>k__BackingField
    // Offset: 0x24
    UnityEngine::Vector3 normalizedDeltaPosition;
    // private RootMotion.Demos.Navigator/State <state>k__BackingField
    // Offset: 0x30
    RootMotion::Demos::Navigator::State state;
    // private UnityEngine.Transform transform
    // Offset: 0x38
    UnityEngine::Transform* transform;
    // private System.Int32 cornerIndex
    // Offset: 0x40
    int cornerIndex;
    // private UnityEngine.Vector3[] corners
    // Offset: 0x48
    ::Array<UnityEngine::Vector3>* corners;
    // private UnityEngine.AI.NavMeshPath path
    // Offset: 0x50
    UnityEngine::AI::NavMeshPath* path;
    // private UnityEngine.Vector3 lastTargetPosition
    // Offset: 0x58
    UnityEngine::Vector3 lastTargetPosition;
    // private System.Boolean initiated
    // Offset: 0x64
    bool initiated;
    // private System.Single nextPathTime
    // Offset: 0x68
    float nextPathTime;
    // public UnityEngine.Vector3 get_normalizedDeltaPosition()
    // Offset: 0x13AA928
    UnityEngine::Vector3 get_normalizedDeltaPosition();
    // private System.Void set_normalizedDeltaPosition(UnityEngine.Vector3 value)
    // Offset: 0x13AA934
    void set_normalizedDeltaPosition(UnityEngine::Vector3 value);
    // public RootMotion.Demos.Navigator/State get_state()
    // Offset: 0x13AA940
    RootMotion::Demos::Navigator::State get_state();
    // private System.Void set_state(RootMotion.Demos.Navigator/State value)
    // Offset: 0x13AA948
    void set_state(RootMotion::Demos::Navigator::State value);
    // public System.Void Initiate(UnityEngine.Transform transform)
    // Offset: 0x13AA950
    void Initiate(UnityEngine::Transform* transform);
    // public System.Void Update(UnityEngine.Vector3 targetPosition)
    // Offset: 0x13AAA48
    void Update(UnityEngine::Vector3 targetPosition);
    // private System.Void CalculatePath(UnityEngine.Vector3 targetPosition)
    // Offset: 0x13AAFA0
    void CalculatePath(UnityEngine::Vector3 targetPosition);
    // private System.Boolean Find(UnityEngine.Vector3 targetPosition)
    // Offset: 0x13AB010
    bool Find(UnityEngine::Vector3 targetPosition);
    // private System.Void Stop()
    // Offset: 0x13AAE68
    void Stop();
    // private System.Single HorDistance(UnityEngine.Vector3 p1, UnityEngine.Vector3 p2)
    // Offset: 0x13AAEDC
    float HorDistance(UnityEngine::Vector3 p1, UnityEngine::Vector3 p2);
    // public System.Void Visualize()
    // Offset: 0x13AB158
    void Visualize();
    // public System.Void .ctor()
    // Offset: 0x13AB308
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    static Navigator* New_ctor();
  }; // RootMotion.Demos.Navigator
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(RootMotion::Demos::Navigator*, "RootMotion.Demos", "Navigator");
DEFINE_IL2CPP_ARG_TYPE(RootMotion::Demos::Navigator::State, "RootMotion.Demos", "Navigator/State");
#pragma pack(pop)
