// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: OVR.OpenVR.HmdMatrix44_t
#include "OVR/OpenVR/HmdMatrix44_t.hpp"
// Completed includes
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Autogenerated type: OVR.OpenVR.Compositor_OverlaySettings
  struct Compositor_OverlaySettings : public System::ValueType {
    public:
    // public System.UInt32 size
    // Offset: 0x0
    uint size;
    // public System.Boolean curved
    // Offset: 0x4
    bool curved;
    // public System.Boolean antialias
    // Offset: 0x5
    bool antialias;
    // public System.Single scale
    // Offset: 0x8
    float scale;
    // public System.Single distance
    // Offset: 0xC
    float distance;
    // public System.Single alpha
    // Offset: 0x10
    float alpha;
    // public System.Single uOffset
    // Offset: 0x14
    float uOffset;
    // public System.Single vOffset
    // Offset: 0x18
    float vOffset;
    // public System.Single uScale
    // Offset: 0x1C
    float uScale;
    // public System.Single vScale
    // Offset: 0x20
    float vScale;
    // public System.Single gridDivs
    // Offset: 0x24
    float gridDivs;
    // public System.Single gridWidth
    // Offset: 0x28
    float gridWidth;
    // public System.Single gridScale
    // Offset: 0x2C
    float gridScale;
    // public OVR.OpenVR.HmdMatrix44_t transform
    // Offset: 0x30
    OVR::OpenVR::HmdMatrix44_t transform;
    // Creating value type constructor for type: Compositor_OverlaySettings
    constexpr Compositor_OverlaySettings(uint size_ = {}, bool curved_ = {}, bool antialias_ = {}, float scale_ = {}, float distance_ = {}, float alpha_ = {}, float uOffset_ = {}, float vOffset_ = {}, float uScale_ = {}, float vScale_ = {}, float gridDivs_ = {}, float gridWidth_ = {}, float gridScale_ = {}, OVR::OpenVR::HmdMatrix44_t transform_ = {}) noexcept : size{size_}, curved{curved_}, antialias{antialias_}, scale{scale_}, distance{distance_}, alpha{alpha_}, uOffset{uOffset_}, vOffset{vOffset_}, uScale{uScale_}, vScale{vScale_}, gridDivs{gridDivs_}, gridWidth{gridWidth_}, gridScale{gridScale_}, transform{transform_} {}
  }; // OVR.OpenVR.Compositor_OverlaySettings
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::Compositor_OverlaySettings, "OVR.OpenVR", "Compositor_OverlaySettings");
#pragma pack(pop)
