// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Size: 0x18
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVR.OpenVR.DistortionCoordinates_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct DistortionCoordinates_t/*, public System::ValueType*/ {
    public:
    // public System.Single rfRed0
    // Size: 0x4
    // Offset: 0x0
    float rfRed0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rfRed1
    // Size: 0x4
    // Offset: 0x4
    float rfRed1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rfGreen0
    // Size: 0x4
    // Offset: 0x8
    float rfGreen0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rfGreen1
    // Size: 0x4
    // Offset: 0xC
    float rfGreen1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rfBlue0
    // Size: 0x4
    // Offset: 0x10
    float rfBlue0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rfBlue1
    // Size: 0x4
    // Offset: 0x14
    float rfBlue1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Creating value type constructor for type: DistortionCoordinates_t
    constexpr DistortionCoordinates_t(float rfRed0_ = {}, float rfRed1_ = {}, float rfGreen0_ = {}, float rfGreen1_ = {}, float rfBlue0_ = {}, float rfBlue1_ = {}) noexcept : rfRed0{rfRed0_}, rfRed1{rfRed1_}, rfGreen0{rfGreen0_}, rfGreen1{rfGreen1_}, rfBlue0{rfBlue0_}, rfBlue1{rfBlue1_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: public System.Single rfRed0
    float _get_rfRed0();
    // Set instance field: public System.Single rfRed0
    void _set_rfRed0(float value);
    // Get instance field: public System.Single rfRed1
    float _get_rfRed1();
    // Set instance field: public System.Single rfRed1
    void _set_rfRed1(float value);
    // Get instance field: public System.Single rfGreen0
    float _get_rfGreen0();
    // Set instance field: public System.Single rfGreen0
    void _set_rfGreen0(float value);
    // Get instance field: public System.Single rfGreen1
    float _get_rfGreen1();
    // Set instance field: public System.Single rfGreen1
    void _set_rfGreen1(float value);
    // Get instance field: public System.Single rfBlue0
    float _get_rfBlue0();
    // Set instance field: public System.Single rfBlue0
    void _set_rfBlue0(float value);
    // Get instance field: public System.Single rfBlue1
    float _get_rfBlue1();
    // Set instance field: public System.Single rfBlue1
    void _set_rfBlue1(float value);
  }; // OVR.OpenVR.DistortionCoordinates_t
  #pragma pack(pop)
  static check_size<sizeof(DistortionCoordinates_t), 20 + sizeof(float)> __OVR_OpenVR_DistortionCoordinates_tSizeCheck;
  static_assert(sizeof(DistortionCoordinates_t) == 0x18);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::DistortionCoordinates_t, "OVR.OpenVR", "DistortionCoordinates_t");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
