// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin il2cpp-utils forward declares
struct Il2CppString;
// Completed il2cpp-utils forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Size: 0x8C
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVR.OpenVR.InputOriginInfo_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct InputOriginInfo_t/*, public System::ValueType*/ {
    public:
    // public System.UInt64 devicePath
    // Size: 0x8
    // Offset: 0x0
    uint64_t devicePath;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // public System.UInt32 trackedDeviceIndex
    // Size: 0x4
    // Offset: 0x8
    uint trackedDeviceIndex;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.Byte rchRenderModelComponentName0
    // Size: 0x1
    // Offset: 0xC
    uint8_t rchRenderModelComponentName0;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName1
    // Size: 0x1
    // Offset: 0xD
    uint8_t rchRenderModelComponentName1;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName2
    // Size: 0x1
    // Offset: 0xE
    uint8_t rchRenderModelComponentName2;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName3
    // Size: 0x1
    // Offset: 0xF
    uint8_t rchRenderModelComponentName3;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName4
    // Size: 0x1
    // Offset: 0x10
    uint8_t rchRenderModelComponentName4;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName5
    // Size: 0x1
    // Offset: 0x11
    uint8_t rchRenderModelComponentName5;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName6
    // Size: 0x1
    // Offset: 0x12
    uint8_t rchRenderModelComponentName6;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName7
    // Size: 0x1
    // Offset: 0x13
    uint8_t rchRenderModelComponentName7;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName8
    // Size: 0x1
    // Offset: 0x14
    uint8_t rchRenderModelComponentName8;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName9
    // Size: 0x1
    // Offset: 0x15
    uint8_t rchRenderModelComponentName9;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName10
    // Size: 0x1
    // Offset: 0x16
    uint8_t rchRenderModelComponentName10;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName11
    // Size: 0x1
    // Offset: 0x17
    uint8_t rchRenderModelComponentName11;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName12
    // Size: 0x1
    // Offset: 0x18
    uint8_t rchRenderModelComponentName12;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName13
    // Size: 0x1
    // Offset: 0x19
    uint8_t rchRenderModelComponentName13;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName14
    // Size: 0x1
    // Offset: 0x1A
    uint8_t rchRenderModelComponentName14;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName15
    // Size: 0x1
    // Offset: 0x1B
    uint8_t rchRenderModelComponentName15;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName16
    // Size: 0x1
    // Offset: 0x1C
    uint8_t rchRenderModelComponentName16;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName17
    // Size: 0x1
    // Offset: 0x1D
    uint8_t rchRenderModelComponentName17;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName18
    // Size: 0x1
    // Offset: 0x1E
    uint8_t rchRenderModelComponentName18;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName19
    // Size: 0x1
    // Offset: 0x1F
    uint8_t rchRenderModelComponentName19;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName20
    // Size: 0x1
    // Offset: 0x20
    uint8_t rchRenderModelComponentName20;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName21
    // Size: 0x1
    // Offset: 0x21
    uint8_t rchRenderModelComponentName21;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName22
    // Size: 0x1
    // Offset: 0x22
    uint8_t rchRenderModelComponentName22;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName23
    // Size: 0x1
    // Offset: 0x23
    uint8_t rchRenderModelComponentName23;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName24
    // Size: 0x1
    // Offset: 0x24
    uint8_t rchRenderModelComponentName24;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName25
    // Size: 0x1
    // Offset: 0x25
    uint8_t rchRenderModelComponentName25;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName26
    // Size: 0x1
    // Offset: 0x26
    uint8_t rchRenderModelComponentName26;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName27
    // Size: 0x1
    // Offset: 0x27
    uint8_t rchRenderModelComponentName27;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName28
    // Size: 0x1
    // Offset: 0x28
    uint8_t rchRenderModelComponentName28;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName29
    // Size: 0x1
    // Offset: 0x29
    uint8_t rchRenderModelComponentName29;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName30
    // Size: 0x1
    // Offset: 0x2A
    uint8_t rchRenderModelComponentName30;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName31
    // Size: 0x1
    // Offset: 0x2B
    uint8_t rchRenderModelComponentName31;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName32
    // Size: 0x1
    // Offset: 0x2C
    uint8_t rchRenderModelComponentName32;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName33
    // Size: 0x1
    // Offset: 0x2D
    uint8_t rchRenderModelComponentName33;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName34
    // Size: 0x1
    // Offset: 0x2E
    uint8_t rchRenderModelComponentName34;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName35
    // Size: 0x1
    // Offset: 0x2F
    uint8_t rchRenderModelComponentName35;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName36
    // Size: 0x1
    // Offset: 0x30
    uint8_t rchRenderModelComponentName36;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName37
    // Size: 0x1
    // Offset: 0x31
    uint8_t rchRenderModelComponentName37;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName38
    // Size: 0x1
    // Offset: 0x32
    uint8_t rchRenderModelComponentName38;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName39
    // Size: 0x1
    // Offset: 0x33
    uint8_t rchRenderModelComponentName39;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName40
    // Size: 0x1
    // Offset: 0x34
    uint8_t rchRenderModelComponentName40;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName41
    // Size: 0x1
    // Offset: 0x35
    uint8_t rchRenderModelComponentName41;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName42
    // Size: 0x1
    // Offset: 0x36
    uint8_t rchRenderModelComponentName42;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName43
    // Size: 0x1
    // Offset: 0x37
    uint8_t rchRenderModelComponentName43;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName44
    // Size: 0x1
    // Offset: 0x38
    uint8_t rchRenderModelComponentName44;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName45
    // Size: 0x1
    // Offset: 0x39
    uint8_t rchRenderModelComponentName45;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName46
    // Size: 0x1
    // Offset: 0x3A
    uint8_t rchRenderModelComponentName46;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName47
    // Size: 0x1
    // Offset: 0x3B
    uint8_t rchRenderModelComponentName47;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName48
    // Size: 0x1
    // Offset: 0x3C
    uint8_t rchRenderModelComponentName48;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName49
    // Size: 0x1
    // Offset: 0x3D
    uint8_t rchRenderModelComponentName49;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName50
    // Size: 0x1
    // Offset: 0x3E
    uint8_t rchRenderModelComponentName50;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName51
    // Size: 0x1
    // Offset: 0x3F
    uint8_t rchRenderModelComponentName51;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName52
    // Size: 0x1
    // Offset: 0x40
    uint8_t rchRenderModelComponentName52;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName53
    // Size: 0x1
    // Offset: 0x41
    uint8_t rchRenderModelComponentName53;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName54
    // Size: 0x1
    // Offset: 0x42
    uint8_t rchRenderModelComponentName54;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName55
    // Size: 0x1
    // Offset: 0x43
    uint8_t rchRenderModelComponentName55;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName56
    // Size: 0x1
    // Offset: 0x44
    uint8_t rchRenderModelComponentName56;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName57
    // Size: 0x1
    // Offset: 0x45
    uint8_t rchRenderModelComponentName57;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName58
    // Size: 0x1
    // Offset: 0x46
    uint8_t rchRenderModelComponentName58;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName59
    // Size: 0x1
    // Offset: 0x47
    uint8_t rchRenderModelComponentName59;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName60
    // Size: 0x1
    // Offset: 0x48
    uint8_t rchRenderModelComponentName60;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName61
    // Size: 0x1
    // Offset: 0x49
    uint8_t rchRenderModelComponentName61;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName62
    // Size: 0x1
    // Offset: 0x4A
    uint8_t rchRenderModelComponentName62;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName63
    // Size: 0x1
    // Offset: 0x4B
    uint8_t rchRenderModelComponentName63;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName64
    // Size: 0x1
    // Offset: 0x4C
    uint8_t rchRenderModelComponentName64;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName65
    // Size: 0x1
    // Offset: 0x4D
    uint8_t rchRenderModelComponentName65;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName66
    // Size: 0x1
    // Offset: 0x4E
    uint8_t rchRenderModelComponentName66;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName67
    // Size: 0x1
    // Offset: 0x4F
    uint8_t rchRenderModelComponentName67;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName68
    // Size: 0x1
    // Offset: 0x50
    uint8_t rchRenderModelComponentName68;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName69
    // Size: 0x1
    // Offset: 0x51
    uint8_t rchRenderModelComponentName69;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName70
    // Size: 0x1
    // Offset: 0x52
    uint8_t rchRenderModelComponentName70;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName71
    // Size: 0x1
    // Offset: 0x53
    uint8_t rchRenderModelComponentName71;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName72
    // Size: 0x1
    // Offset: 0x54
    uint8_t rchRenderModelComponentName72;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName73
    // Size: 0x1
    // Offset: 0x55
    uint8_t rchRenderModelComponentName73;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName74
    // Size: 0x1
    // Offset: 0x56
    uint8_t rchRenderModelComponentName74;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName75
    // Size: 0x1
    // Offset: 0x57
    uint8_t rchRenderModelComponentName75;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName76
    // Size: 0x1
    // Offset: 0x58
    uint8_t rchRenderModelComponentName76;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName77
    // Size: 0x1
    // Offset: 0x59
    uint8_t rchRenderModelComponentName77;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName78
    // Size: 0x1
    // Offset: 0x5A
    uint8_t rchRenderModelComponentName78;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName79
    // Size: 0x1
    // Offset: 0x5B
    uint8_t rchRenderModelComponentName79;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName80
    // Size: 0x1
    // Offset: 0x5C
    uint8_t rchRenderModelComponentName80;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName81
    // Size: 0x1
    // Offset: 0x5D
    uint8_t rchRenderModelComponentName81;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName82
    // Size: 0x1
    // Offset: 0x5E
    uint8_t rchRenderModelComponentName82;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName83
    // Size: 0x1
    // Offset: 0x5F
    uint8_t rchRenderModelComponentName83;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName84
    // Size: 0x1
    // Offset: 0x60
    uint8_t rchRenderModelComponentName84;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName85
    // Size: 0x1
    // Offset: 0x61
    uint8_t rchRenderModelComponentName85;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName86
    // Size: 0x1
    // Offset: 0x62
    uint8_t rchRenderModelComponentName86;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName87
    // Size: 0x1
    // Offset: 0x63
    uint8_t rchRenderModelComponentName87;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName88
    // Size: 0x1
    // Offset: 0x64
    uint8_t rchRenderModelComponentName88;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName89
    // Size: 0x1
    // Offset: 0x65
    uint8_t rchRenderModelComponentName89;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName90
    // Size: 0x1
    // Offset: 0x66
    uint8_t rchRenderModelComponentName90;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName91
    // Size: 0x1
    // Offset: 0x67
    uint8_t rchRenderModelComponentName91;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName92
    // Size: 0x1
    // Offset: 0x68
    uint8_t rchRenderModelComponentName92;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName93
    // Size: 0x1
    // Offset: 0x69
    uint8_t rchRenderModelComponentName93;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName94
    // Size: 0x1
    // Offset: 0x6A
    uint8_t rchRenderModelComponentName94;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName95
    // Size: 0x1
    // Offset: 0x6B
    uint8_t rchRenderModelComponentName95;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName96
    // Size: 0x1
    // Offset: 0x6C
    uint8_t rchRenderModelComponentName96;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName97
    // Size: 0x1
    // Offset: 0x6D
    uint8_t rchRenderModelComponentName97;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName98
    // Size: 0x1
    // Offset: 0x6E
    uint8_t rchRenderModelComponentName98;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName99
    // Size: 0x1
    // Offset: 0x6F
    uint8_t rchRenderModelComponentName99;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName100
    // Size: 0x1
    // Offset: 0x70
    uint8_t rchRenderModelComponentName100;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName101
    // Size: 0x1
    // Offset: 0x71
    uint8_t rchRenderModelComponentName101;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName102
    // Size: 0x1
    // Offset: 0x72
    uint8_t rchRenderModelComponentName102;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName103
    // Size: 0x1
    // Offset: 0x73
    uint8_t rchRenderModelComponentName103;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName104
    // Size: 0x1
    // Offset: 0x74
    uint8_t rchRenderModelComponentName104;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName105
    // Size: 0x1
    // Offset: 0x75
    uint8_t rchRenderModelComponentName105;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName106
    // Size: 0x1
    // Offset: 0x76
    uint8_t rchRenderModelComponentName106;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName107
    // Size: 0x1
    // Offset: 0x77
    uint8_t rchRenderModelComponentName107;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName108
    // Size: 0x1
    // Offset: 0x78
    uint8_t rchRenderModelComponentName108;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName109
    // Size: 0x1
    // Offset: 0x79
    uint8_t rchRenderModelComponentName109;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName110
    // Size: 0x1
    // Offset: 0x7A
    uint8_t rchRenderModelComponentName110;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName111
    // Size: 0x1
    // Offset: 0x7B
    uint8_t rchRenderModelComponentName111;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName112
    // Size: 0x1
    // Offset: 0x7C
    uint8_t rchRenderModelComponentName112;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName113
    // Size: 0x1
    // Offset: 0x7D
    uint8_t rchRenderModelComponentName113;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName114
    // Size: 0x1
    // Offset: 0x7E
    uint8_t rchRenderModelComponentName114;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName115
    // Size: 0x1
    // Offset: 0x7F
    uint8_t rchRenderModelComponentName115;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName116
    // Size: 0x1
    // Offset: 0x80
    uint8_t rchRenderModelComponentName116;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName117
    // Size: 0x1
    // Offset: 0x81
    uint8_t rchRenderModelComponentName117;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName118
    // Size: 0x1
    // Offset: 0x82
    uint8_t rchRenderModelComponentName118;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName119
    // Size: 0x1
    // Offset: 0x83
    uint8_t rchRenderModelComponentName119;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName120
    // Size: 0x1
    // Offset: 0x84
    uint8_t rchRenderModelComponentName120;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName121
    // Size: 0x1
    // Offset: 0x85
    uint8_t rchRenderModelComponentName121;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName122
    // Size: 0x1
    // Offset: 0x86
    uint8_t rchRenderModelComponentName122;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName123
    // Size: 0x1
    // Offset: 0x87
    uint8_t rchRenderModelComponentName123;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName124
    // Size: 0x1
    // Offset: 0x88
    uint8_t rchRenderModelComponentName124;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName125
    // Size: 0x1
    // Offset: 0x89
    uint8_t rchRenderModelComponentName125;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName126
    // Size: 0x1
    // Offset: 0x8A
    uint8_t rchRenderModelComponentName126;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte rchRenderModelComponentName127
    // Size: 0x1
    // Offset: 0x8B
    uint8_t rchRenderModelComponentName127;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Creating value type constructor for type: InputOriginInfo_t
