// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include <stdint.h>
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin il2cpp-utils forward declares
struct Il2CppString;
// Completed il2cpp-utils forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Autogenerated type: OVR.OpenVR.InputOriginInfo_t
  struct InputOriginInfo_t : public System::ValueType {
    public:
    // public System.UInt64 devicePath
    // Offset: 0x0
    uint64_t devicePath;
    // public System.UInt32 trackedDeviceIndex
    // Offset: 0x8
    uint trackedDeviceIndex;
    // public System.Byte rchRenderModelComponentName0
    // Offset: 0xC
    uint8_t rchRenderModelComponentName0;
    // public System.Byte rchRenderModelComponentName1
    // Offset: 0xD
    uint8_t rchRenderModelComponentName1;
    // public System.Byte rchRenderModelComponentName2
    // Offset: 0xE
    uint8_t rchRenderModelComponentName2;
    // public System.Byte rchRenderModelComponentName3
    // Offset: 0xF
    uint8_t rchRenderModelComponentName3;
    // public System.Byte rchRenderModelComponentName4
    // Offset: 0x10
    uint8_t rchRenderModelComponentName4;
    // public System.Byte rchRenderModelComponentName5
    // Offset: 0x11
    uint8_t rchRenderModelComponentName5;
    // public System.Byte rchRenderModelComponentName6
    // Offset: 0x12
    uint8_t rchRenderModelComponentName6;
    // public System.Byte rchRenderModelComponentName7
    // Offset: 0x13
    uint8_t rchRenderModelComponentName7;
    // public System.Byte rchRenderModelComponentName8
    // Offset: 0x14
    uint8_t rchRenderModelComponentName8;
    // public System.Byte rchRenderModelComponentName9
    // Offset: 0x15
    uint8_t rchRenderModelComponentName9;
    // public System.Byte rchRenderModelComponentName10
    // Offset: 0x16
    uint8_t rchRenderModelComponentName10;
    // public System.Byte rchRenderModelComponentName11
    // Offset: 0x17
    uint8_t rchRenderModelComponentName11;
    // public System.Byte rchRenderModelComponentName12
    // Offset: 0x18
    uint8_t rchRenderModelComponentName12;
    // public System.Byte rchRenderModelComponentName13
    // Offset: 0x19
    uint8_t rchRenderModelComponentName13;
    // public System.Byte rchRenderModelComponentName14
    // Offset: 0x1A
    uint8_t rchRenderModelComponentName14;
    // public System.Byte rchRenderModelComponentName15
    // Offset: 0x1B
    uint8_t rchRenderModelComponentName15;
    // public System.Byte rchRenderModelComponentName16
    // Offset: 0x1C
    uint8_t rchRenderModelComponentName16;
    // public System.Byte rchRenderModelComponentName17
    // Offset: 0x1D
    uint8_t rchRenderModelComponentName17;
    // public System.Byte rchRenderModelComponentName18
    // Offset: 0x1E
    uint8_t rchRenderModelComponentName18;
    // public System.Byte rchRenderModelComponentName19
    // Offset: 0x1F
    uint8_t rchRenderModelComponentName19;
    // public System.Byte rchRenderModelComponentName20
    // Offset: 0x20
    uint8_t rchRenderModelComponentName20;
    // public System.Byte rchRenderModelComponentName21
    // Offset: 0x21
    uint8_t rchRenderModelComponentName21;
    // public System.Byte rchRenderModelComponentName22
    // Offset: 0x22
    uint8_t rchRenderModelComponentName22;
    // public System.Byte rchRenderModelComponentName23
    // Offset: 0x23
    uint8_t rchRenderModelComponentName23;
    // public System.Byte rchRenderModelComponentName24
    // Offset: 0x24
    uint8_t rchRenderModelComponentName24;
    // public System.Byte rchRenderModelComponentName25
    // Offset: 0x25
    uint8_t rchRenderModelComponentName25;
    // public System.Byte rchRenderModelComponentName26
    // Offset: 0x26
    uint8_t rchRenderModelComponentName26;
    // public System.Byte rchRenderModelComponentName27
    // Offset: 0x27
    uint8_t rchRenderModelComponentName27;
    // public System.Byte rchRenderModelComponentName28
    // Offset: 0x28
    uint8_t rchRenderModelComponentName28;
    // public System.Byte rchRenderModelComponentName29
    // Offset: 0x29
    uint8_t rchRenderModelComponentName29;
    // public System.Byte rchRenderModelComponentName30
    // Offset: 0x2A
    uint8_t rchRenderModelComponentName30;
    // public System.Byte rchRenderModelComponentName31
    // Offset: 0x2B
    uint8_t rchRenderModelComponentName31;
    // public System.Byte rchRenderModelComponentName32
    // Offset: 0x2C
    uint8_t rchRenderModelComponentName32;
    // public System.Byte rchRenderModelComponentName33
    // Offset: 0x2D
    uint8_t rchRenderModelComponentName33;
    // public System.Byte rchRenderModelComponentName34
    // Offset: 0x2E
    uint8_t rchRenderModelComponentName34;
    // public System.Byte rchRenderModelComponentName35
    // Offset: 0x2F
    uint8_t rchRenderModelComponentName35;
    // public System.Byte rchRenderModelComponentName36
    // Offset: 0x30
    uint8_t rchRenderModelComponentName36;
    // public System.Byte rchRenderModelComponentName37
    // Offset: 0x31
    uint8_t rchRenderModelComponentName37;
    // public System.Byte rchRenderModelComponentName38
    // Offset: 0x32
    uint8_t rchRenderModelComponentName38;
    // public System.Byte rchRenderModelComponentName39
    // Offset: 0x33
    uint8_t rchRenderModelComponentName39;
    // public System.Byte rchRenderModelComponentName40
    // Offset: 0x34
    uint8_t rchRenderModelComponentName40;
    // public System.Byte rchRenderModelComponentName41
    // Offset: 0x35
    uint8_t rchRenderModelComponentName41;
    // public System.Byte rchRenderModelComponentName42
    // Offset: 0x36
    uint8_t rchRenderModelComponentName42;
    // public System.Byte rchRenderModelComponentName43
    // Offset: 0x37
    uint8_t rchRenderModelComponentName43;
    // public System.Byte rchRenderModelComponentName44
    // Offset: 0x38
    uint8_t rchRenderModelComponentName44;
    // public System.Byte rchRenderModelComponentName45
    // Offset: 0x39
    uint8_t rchRenderModelComponentName45;
    // public System.Byte rchRenderModelComponentName46
    // Offset: 0x3A
    uint8_t rchRenderModelComponentName46;
    // public System.Byte rchRenderModelComponentName47
    // Offset: 0x3B
    uint8_t rchRenderModelComponentName47;
    // public System.Byte rchRenderModelComponentName48
    // Offset: 0x3C
    uint8_t rchRenderModelComponentName48;
    // public System.Byte rchRenderModelComponentName49
    // Offset: 0x3D
    uint8_t rchRenderModelComponentName49;
    // public System.Byte rchRenderModelComponentName50
    // Offset: 0x3E
    uint8_t rchRenderModelComponentName50;
    // public System.Byte rchRenderModelComponentName51
    // Offset: 0x3F
    uint8_t rchRenderModelComponentName51;
    // public System.Byte rchRenderModelComponentName52
    // Offset: 0x40
    uint8_t rchRenderModelComponentName52;
    // public System.Byte rchRenderModelComponentName53
    // Offset: 0x41
    uint8_t rchRenderModelComponentName53;
    // public System.Byte rchRenderModelComponentName54
    // Offset: 0x42
    uint8_t rchRenderModelComponentName54;
    // public System.Byte rchRenderModelComponentName55
    // Offset: 0x43
    uint8_t rchRenderModelComponentName55;
    // public System.Byte rchRenderModelComponentName56
    // Offset: 0x44
    uint8_t rchRenderModelComponentName56;
    // public System.Byte rchRenderModelComponentName57
    // Offset: 0x45
    uint8_t rchRenderModelComponentName57;
    // public System.Byte rchRenderModelComponentName58
    // Offset: 0x46
    uint8_t rchRenderModelComponentName58;
    // public System.Byte rchRenderModelComponentName59
    // Offset: 0x47
    uint8_t rchRenderModelComponentName59;
    // public System.Byte rchRenderModelComponentName60
    // Offset: 0x48
    uint8_t rchRenderModelComponentName60;
    // public System.Byte rchRenderModelComponentName61
    // Offset: 0x49
    uint8_t rchRenderModelComponentName61;
    // public System.Byte rchRenderModelComponentName62
    // Offset: 0x4A
    uint8_t rchRenderModelComponentName62;
    // public System.Byte rchRenderModelComponentName63
    // Offset: 0x4B
    uint8_t rchRenderModelComponentName63;
    // public System.Byte rchRenderModelComponentName64
    // Offset: 0x4C
    uint8_t rchRenderModelComponentName64;
    // public System.Byte rchRenderModelComponentName65
    // Offset: 0x4D
    uint8_t rchRenderModelComponentName65;
    // public System.Byte rchRenderModelComponentName66
    // Offset: 0x4E
    uint8_t rchRenderModelComponentName66;
    // public System.Byte rchRenderModelComponentName67
    // Offset: 0x4F
    uint8_t rchRenderModelComponentName67;
    // public System.Byte rchRenderModelComponentName68
    // Offset: 0x50
    uint8_t rchRenderModelComponentName68;
    // public System.Byte rchRenderModelComponentName69
    // Offset: 0x51
    uint8_t rchRenderModelComponentName69;
    // public System.Byte rchRenderModelComponentName70
    // Offset: 0x52
    uint8_t rchRenderModelComponentName70;
    // public System.Byte rchRenderModelComponentName71
    // Offset: 0x53
    uint8_t rchRenderModelComponentName71;
    // public System.Byte rchRenderModelComponentName72
    // Offset: 0x54
    uint8_t rchRenderModelComponentName72;
    // public System.Byte rchRenderModelComponentName73
    // Offset: 0x55
    uint8_t rchRenderModelComponentName73;
    // public System.Byte rchRenderModelComponentName74
    // Offset: 0x56
    uint8_t rchRenderModelComponentName74;
    // public System.Byte rchRenderModelComponentName75
    // Offset: 0x57
    uint8_t rchRenderModelComponentName75;
    // public System.Byte rchRenderModelComponentName76
    // Offset: 0x58
    uint8_t rchRenderModelComponentName76;
    // public System.Byte rchRenderModelComponentName77
    // Offset: 0x59
    uint8_t rchRenderModelComponentName77;
    // public System.Byte rchRenderModelComponentName78
    // Offset: 0x5A
    uint8_t rchRenderModelComponentName78;
    // public System.Byte rchRenderModelComponentName79
    // Offset: 0x5B
    uint8_t rchRenderModelComponentName79;
    // public System.Byte rchRenderModelComponentName80
    // Offset: 0x5C
    uint8_t rchRenderModelComponentName80;
    // public System.Byte rchRenderModelComponentName81
    // Offset: 0x5D
    uint8_t rchRenderModelComponentName81;
    // public System.Byte rchRenderModelComponentName82
    // Offset: 0x5E
    uint8_t rchRenderModelComponentName82;
    // public System.Byte rchRenderModelComponentName83
    // Offset: 0x5F
    uint8_t rchRenderModelComponentName83;
    // public System.Byte rchRenderModelComponentName84
    // Offset: 0x60
    uint8_t rchRenderModelComponentName84;
    // public System.Byte rchRenderModelComponentName85
    // Offset: 0x61
    uint8_t rchRenderModelComponentName85;
    // public System.Byte rchRenderModelComponentName86
    // Offset: 0x62
    uint8_t rchRenderModelComponentName86;
    // public System.Byte rchRenderModelComponentName87
    // Offset: 0x63
    uint8_t rchRenderModelComponentName87;
    // public System.Byte rchRenderModelComponentName88
    // Offset: 0x64
    uint8_t rchRenderModelComponentName88;
    // public System.Byte rchRenderModelComponentName89
    // Offset: 0x65
    uint8_t rchRenderModelComponentName89;
    // public System.Byte rchRenderModelComponentName90
    // Offset: 0x66
    uint8_t rchRenderModelComponentName90;
    // public System.Byte rchRenderModelComponentName91
    // Offset: 0x67
    uint8_t rchRenderModelComponentName91;
    // public System.Byte rchRenderModelComponentName92
    // Offset: 0x68
    uint8_t rchRenderModelComponentName92;
    // public System.Byte rchRenderModelComponentName93
    // Offset: 0x69
    uint8_t rchRenderModelComponentName93;
    // public System.Byte rchRenderModelComponentName94
    // Offset: 0x6A
    uint8_t rchRenderModelComponentName94;
    // public System.Byte rchRenderModelComponentName95
    // Offset: 0x6B
    uint8_t rchRenderModelComponentName95;
    // public System.Byte rchRenderModelComponentName96
    // Offset: 0x6C
    uint8_t rchRenderModelComponentName96;
    // public System.Byte rchRenderModelComponentName97
    // Offset: 0x6D
    uint8_t rchRenderModelComponentName97;
    // public System.Byte rchRenderModelComponentName98
    // Offset: 0x6E
    uint8_t rchRenderModelComponentName98;
    // public System.Byte rchRenderModelComponentName99
    // Offset: 0x6F
    uint8_t rchRenderModelComponentName99;
    // public System.Byte rchRenderModelComponentName100
    // Offset: 0x70
    uint8_t rchRenderModelComponentName100;
    // public System.Byte rchRenderModelComponentName101
    // Offset: 0x71
    uint8_t rchRenderModelComponentName101;
    // public System.Byte rchRenderModelComponentName102
    // Offset: 0x72
    uint8_t rchRenderModelComponentName102;
    // public System.Byte rchRenderModelComponentName103
    // Offset: 0x73
    uint8_t rchRenderModelComponentName103;
    // public System.Byte rchRenderModelComponentName104
    // Offset: 0x74
    uint8_t rchRenderModelComponentName104;
    // public System.Byte rchRenderModelComponentName105
    // Offset: 0x75
    uint8_t rchRenderModelComponentName105;
    // public System.Byte rchRenderModelComponentName106
    // Offset: 0x76
    uint8_t rchRenderModelComponentName106;
    // public System.Byte rchRenderModelComponentName107
    // Offset: 0x77
    uint8_t rchRenderModelComponentName107;
    // public System.Byte rchRenderModelComponentName108
    // Offset: 0x78
    uint8_t rchRenderModelComponentName108;
    // public System.Byte rchRenderModelComponentName109
    // Offset: 0x79
    uint8_t rchRenderModelComponentName109;
    // public System.Byte rchRenderModelComponentName110
    // Offset: 0x7A
    uint8_t rchRenderModelComponentName110;
    // public System.Byte rchRenderModelComponentName111
    // Offset: 0x7B
    uint8_t rchRenderModelComponentName111;
    // public System.Byte rchRenderModelComponentName112
    // Offset: 0x7C
    uint8_t rchRenderModelComponentName112;
    // public System.Byte rchRenderModelComponentName113
    // Offset: 0x7D
    uint8_t rchRenderModelComponentName113;
    // public System.Byte rchRenderModelComponentName114
    // Offset: 0x7E
    uint8_t rchRenderModelComponentName114;
    // public System.Byte rchRenderModelComponentName115
    // Offset: 0x7F
    uint8_t rchRenderModelComponentName115;
    // public System.Byte rchRenderModelComponentName116
    // Offset: 0x80
    uint8_t rchRenderModelComponentName116;
    // public System.Byte rchRenderModelComponentName117
    // Offset: 0x81
    uint8_t rchRenderModelComponentName117;
    // public System.Byte rchRenderModelComponentName118
    // Offset: 0x82
    uint8_t rchRenderModelComponentName118;
    // public System.Byte rchRenderModelComponentName119
    // Offset: 0x83
    uint8_t rchRenderModelComponentName119;
    // public System.Byte rchRenderModelComponentName120
    // Offset: 0x84
    uint8_t rchRenderModelComponentName120;
    // public System.Byte rchRenderModelComponentName121
    // Offset: 0x85
    uint8_t rchRenderModelComponentName121;
    // public System.Byte rchRenderModelComponentName122
    // Offset: 0x86
    uint8_t rchRenderModelComponentName122;
    // public System.Byte rchRenderModelComponentName123
    // Offset: 0x87
    uint8_t rchRenderModelComponentName123;
    // public System.Byte rchRenderModelComponentName124
    // Offset: 0x88
    uint8_t rchRenderModelComponentName124;
    // public System.Byte rchRenderModelComponentName125
    // Offset: 0x89
    uint8_t rchRenderModelComponentName125;
    // public System.Byte rchRenderModelComponentName126
    // Offset: 0x8A
    uint8_t rchRenderModelComponentName126;
    // public System.Byte rchRenderModelComponentName127
    // Offset: 0x8B
    uint8_t rchRenderModelComponentName127;
    // Creating value type constructor for type: InputOriginInfo_t
