// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Autogenerated type: OVR.OpenVR.IVRApplications
  struct IVRApplications : public System::ValueType {
    public:
    // Nested type: OVR::OpenVR::IVRApplications::_AddApplicationManifest
    class _AddApplicationManifest;
    // Nested type: OVR::OpenVR::IVRApplications::_RemoveApplicationManifest
    class _RemoveApplicationManifest;
    // Nested type: OVR::OpenVR::IVRApplications::_IsApplicationInstalled
    class _IsApplicationInstalled;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationCount
    class _GetApplicationCount;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationKeyByIndex
    class _GetApplicationKeyByIndex;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationKeyByProcessId
    class _GetApplicationKeyByProcessId;
    // Nested type: OVR::OpenVR::IVRApplications::_LaunchApplication
    class _LaunchApplication;
    // Nested type: OVR::OpenVR::IVRApplications::_LaunchTemplateApplication
    class _LaunchTemplateApplication;
    // Nested type: OVR::OpenVR::IVRApplications::_LaunchApplicationFromMimeType
    class _LaunchApplicationFromMimeType;
    // Nested type: OVR::OpenVR::IVRApplications::_LaunchDashboardOverlay
    class _LaunchDashboardOverlay;
    // Nested type: OVR::OpenVR::IVRApplications::_CancelApplicationLaunch
    class _CancelApplicationLaunch;
    // Nested type: OVR::OpenVR::IVRApplications::_IdentifyApplication
    class _IdentifyApplication;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationProcessId
    class _GetApplicationProcessId;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationsErrorNameFromEnum
    class _GetApplicationsErrorNameFromEnum;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationPropertyString
    class _GetApplicationPropertyString;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationPropertyBool
    class _GetApplicationPropertyBool;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationPropertyUint64
    class _GetApplicationPropertyUint64;
    // Nested type: OVR::OpenVR::IVRApplications::_SetApplicationAutoLaunch
    class _SetApplicationAutoLaunch;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationAutoLaunch
    class _GetApplicationAutoLaunch;
    // Nested type: OVR::OpenVR::IVRApplications::_SetDefaultApplicationForMimeType
    class _SetDefaultApplicationForMimeType;
    // Nested type: OVR::OpenVR::IVRApplications::_GetDefaultApplicationForMimeType
    class _GetDefaultApplicationForMimeType;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationSupportedMimeTypes
    class _GetApplicationSupportedMimeTypes;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationsThatSupportMimeType
    class _GetApplicationsThatSupportMimeType;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationLaunchArguments
    class _GetApplicationLaunchArguments;
    // Nested type: OVR::OpenVR::IVRApplications::_GetStartingApplication
    class _GetStartingApplication;
    // Nested type: OVR::OpenVR::IVRApplications::_GetTransitionState
    class _GetTransitionState;
    // Nested type: OVR::OpenVR::IVRApplications::_PerformApplicationPrelaunchCheck
    class _PerformApplicationPrelaunchCheck;
    // Nested type: OVR::OpenVR::IVRApplications::_GetApplicationsTransitionStateNameFromEnum
    class _GetApplicationsTransitionStateNameFromEnum;
    // Nested type: OVR::OpenVR::IVRApplications::_IsQuitUserPromptRequested
    class _IsQuitUserPromptRequested;
    // Nested type: OVR::OpenVR::IVRApplications::_LaunchInternalProcess
    class _LaunchInternalProcess;
    // Nested type: OVR::OpenVR::IVRApplications::_GetCurrentSceneProcessId
    class _GetCurrentSceneProcessId;
    // OVR.OpenVR.IVRApplications/_AddApplicationManifest AddApplicationManifest
    // Offset: 0x0
    OVR::OpenVR::IVRApplications::_AddApplicationManifest* AddApplicationManifest;
    // OVR.OpenVR.IVRApplications/_RemoveApplicationManifest RemoveApplicationManifest
    // Offset: 0x8
    OVR::OpenVR::IVRApplications::_RemoveApplicationManifest* RemoveApplicationManifest;
    // OVR.OpenVR.IVRApplications/_IsApplicationInstalled IsApplicationInstalled
    // Offset: 0x10
    OVR::OpenVR::IVRApplications::_IsApplicationInstalled* IsApplicationInstalled;
    // OVR.OpenVR.IVRApplications/_GetApplicationCount GetApplicationCount
    // Offset: 0x18
    OVR::OpenVR::IVRApplications::_GetApplicationCount* GetApplicationCount;
    // OVR.OpenVR.IVRApplications/_GetApplicationKeyByIndex GetApplicationKeyByIndex
    // Offset: 0x20
    OVR::OpenVR::IVRApplications::_GetApplicationKeyByIndex* GetApplicationKeyByIndex;
    // OVR.OpenVR.IVRApplications/_GetApplicationKeyByProcessId GetApplicationKeyByProcessId
    // Offset: 0x28
    OVR::OpenVR::IVRApplications::_GetApplicationKeyByProcessId* GetApplicationKeyByProcessId;
    // OVR.OpenVR.IVRApplications/_LaunchApplication LaunchApplication
    // Offset: 0x30
    OVR::OpenVR::IVRApplications::_LaunchApplication* LaunchApplication;
    // OVR.OpenVR.IVRApplications/_LaunchTemplateApplication LaunchTemplateApplication
    // Offset: 0x38
    OVR::OpenVR::IVRApplications::_LaunchTemplateApplication* LaunchTemplateApplication;
    // OVR.OpenVR.IVRApplications/_LaunchApplicationFromMimeType LaunchApplicationFromMimeType
    // Offset: 0x40
    OVR::OpenVR::IVRApplications::_LaunchApplicationFromMimeType* LaunchApplicationFromMimeType;
    // OVR.OpenVR.IVRApplications/_LaunchDashboardOverlay LaunchDashboardOverlay
    // Offset: 0x48
    OVR::OpenVR::IVRApplications::_LaunchDashboardOverlay* LaunchDashboardOverlay;
    // OVR.OpenVR.IVRApplications/_CancelApplicationLaunch CancelApplicationLaunch
    // Offset: 0x50
    OVR::OpenVR::IVRApplications::_CancelApplicationLaunch* CancelApplicationLaunch;
    // OVR.OpenVR.IVRApplications/_IdentifyApplication IdentifyApplication
    // Offset: 0x58
    OVR::OpenVR::IVRApplications::_IdentifyApplication* IdentifyApplication;
    // OVR.OpenVR.IVRApplications/_GetApplicationProcessId GetApplicationProcessId
    // Offset: 0x60
    OVR::OpenVR::IVRApplications::_GetApplicationProcessId* GetApplicationProcessId;
    // OVR.OpenVR.IVRApplications/_GetApplicationsErrorNameFromEnum GetApplicationsErrorNameFromEnum
    // Offset: 0x68
    OVR::OpenVR::IVRApplications::_GetApplicationsErrorNameFromEnum* GetApplicationsErrorNameFromEnum;
    // OVR.OpenVR.IVRApplications/_GetApplicationPropertyString GetApplicationPropertyString
    // Offset: 0x70
    OVR::OpenVR::IVRApplications::_GetApplicationPropertyString* GetApplicationPropertyString;
    // OVR.OpenVR.IVRApplications/_GetApplicationPropertyBool GetApplicationPropertyBool
    // Offset: 0x78
    OVR::OpenVR::IVRApplications::_GetApplicationPropertyBool* GetApplicationPropertyBool;
    // OVR.OpenVR.IVRApplications/_GetApplicationPropertyUint64 GetApplicationPropertyUint64
    // Offset: 0x80
    OVR::OpenVR::IVRApplications::_GetApplicationPropertyUint64* GetApplicationPropertyUint64;
    // OVR.OpenVR.IVRApplications/_SetApplicationAutoLaunch SetApplicationAutoLaunch
    // Offset: 0x88
    OVR::OpenVR::IVRApplications::_SetApplicationAutoLaunch* SetApplicationAutoLaunch;
    // OVR.OpenVR.IVRApplications/_GetApplicationAutoLaunch GetApplicationAutoLaunch
    // Offset: 0x90
    OVR::OpenVR::IVRApplications::_GetApplicationAutoLaunch* GetApplicationAutoLaunch;
    // OVR.OpenVR.IVRApplications/_SetDefaultApplicationForMimeType SetDefaultApplicationForMimeType
    // Offset: 0x98
    OVR::OpenVR::IVRApplications::_SetDefaultApplicationForMimeType* SetDefaultApplicationForMimeType;
    // OVR.OpenVR.IVRApplications/_GetDefaultApplicationForMimeType GetDefaultApplicationForMimeType
    // Offset: 0xA0
    OVR::OpenVR::IVRApplications::_GetDefaultApplicationForMimeType* GetDefaultApplicationForMimeType;
    // OVR.OpenVR.IVRApplications/_GetApplicationSupportedMimeTypes GetApplicationSupportedMimeTypes
    // Offset: 0xA8
    OVR::OpenVR::IVRApplications::_GetApplicationSupportedMimeTypes* GetApplicationSupportedMimeTypes;
    // OVR.OpenVR.IVRApplications/_GetApplicationsThatSupportMimeType GetApplicationsThatSupportMimeType
    // Offset: 0xB0
    OVR::OpenVR::IVRApplications::_GetApplicationsThatSupportMimeType* GetApplicationsThatSupportMimeType;
    // OVR.OpenVR.IVRApplications/_GetApplicationLaunchArguments GetApplicationLaunchArguments
    // Offset: 0xB8
    OVR::OpenVR::IVRApplications::_GetApplicationLaunchArguments* GetApplicationLaunchArguments;
    // OVR.OpenVR.IVRApplications/_GetStartingApplication GetStartingApplication
    // Offset: 0xC0
    OVR::OpenVR::IVRApplications::_GetStartingApplication* GetStartingApplication;
    // OVR.OpenVR.IVRApplications/_GetTransitionState GetTransitionState
    // Offset: 0xC8
    OVR::OpenVR::IVRApplications::_GetTransitionState* GetTransitionState;
    // OVR.OpenVR.IVRApplications/_PerformApplicationPrelaunchCheck PerformApplicationPrelaunchCheck
    // Offset: 0xD0
    OVR::OpenVR::IVRApplications::_PerformApplicationPrelaunchCheck* PerformApplicationPrelaunchCheck;
    // OVR.OpenVR.IVRApplications/_GetApplicationsTransitionStateNameFromEnum GetApplicationsTransitionStateNameFromEnum
    // Offset: 0xD8
    OVR::OpenVR::IVRApplications::_GetApplicationsTransitionStateNameFromEnum* GetApplicationsTransitionStateNameFromEnum;
    // OVR.OpenVR.IVRApplications/_IsQuitUserPromptRequested IsQuitUserPromptRequested
    // Offset: 0xE0
    OVR::OpenVR::IVRApplications::_IsQuitUserPromptRequested* IsQuitUserPromptRequested;
    // OVR.OpenVR.IVRApplications/_LaunchInternalProcess LaunchInternalProcess
    // Offset: 0xE8
    OVR::OpenVR::IVRApplications::_LaunchInternalProcess* LaunchInternalProcess;
    // OVR.OpenVR.IVRApplications/_GetCurrentSceneProcessId GetCurrentSceneProcessId
    // Offset: 0xF0
    OVR::OpenVR::IVRApplications::_GetCurrentSceneProcessId* GetCurrentSceneProcessId;
    // Creating value type constructor for type: IVRApplications
    constexpr IVRApplications(OVR::OpenVR::IVRApplications::_AddApplicationManifest* AddApplicationManifest_ = {}, OVR::OpenVR::IVRApplications::_RemoveApplicationManifest* RemoveApplicationManifest_ = {}, OVR::OpenVR::IVRApplications::_IsApplicationInstalled* IsApplicationInstalled_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationCount* GetApplicationCount_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationKeyByIndex* GetApplicationKeyByIndex_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationKeyByProcessId* GetApplicationKeyByProcessId_ = {}, OVR::OpenVR::IVRApplications::_LaunchApplication* LaunchApplication_ = {}, OVR::OpenVR::IVRApplications::_LaunchTemplateApplication* LaunchTemplateApplication_ = {}, OVR::OpenVR::IVRApplications::_LaunchApplicationFromMimeType* LaunchApplicationFromMimeType_ = {}, OVR::OpenVR::IVRApplications::_LaunchDashboardOverlay* LaunchDashboardOverlay_ = {}, OVR::OpenVR::IVRApplications::_CancelApplicationLaunch* CancelApplicationLaunch_ = {}, OVR::OpenVR::IVRApplications::_IdentifyApplication* IdentifyApplication_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationProcessId* GetApplicationProcessId_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationsErrorNameFromEnum* GetApplicationsErrorNameFromEnum_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationPropertyString* GetApplicationPropertyString_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationPropertyBool* GetApplicationPropertyBool_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationPropertyUint64* GetApplicationPropertyUint64_ = {}, OVR::OpenVR::IVRApplications::_SetApplicationAutoLaunch* SetApplicationAutoLaunch_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationAutoLaunch* GetApplicationAutoLaunch_ = {}, OVR::OpenVR::IVRApplications::_SetDefaultApplicationForMimeType* SetDefaultApplicationForMimeType_ = {}, OVR::OpenVR::IVRApplications::_GetDefaultApplicationForMimeType* GetDefaultApplicationForMimeType_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationSupportedMimeTypes* GetApplicationSupportedMimeTypes_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationsThatSupportMimeType* GetApplicationsThatSupportMimeType_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationLaunchArguments* GetApplicationLaunchArguments_ = {}, OVR::OpenVR::IVRApplications::_GetStartingApplication* GetStartingApplication_ = {}, OVR::OpenVR::IVRApplications::_GetTransitionState* GetTransitionState_ = {}, OVR::OpenVR::IVRApplications::_PerformApplicationPrelaunchCheck* PerformApplicationPrelaunchCheck_ = {}, OVR::OpenVR::IVRApplications::_GetApplicationsTransitionStateNameFromEnum* GetApplicationsTransitionStateNameFromEnum_ = {}, OVR::OpenVR::IVRApplications::_IsQuitUserPromptRequested* IsQuitUserPromptRequested_ = {}, OVR::OpenVR::IVRApplications::_LaunchInternalProcess* LaunchInternalProcess_ = {}, OVR::OpenVR::IVRApplications::_GetCurrentSceneProcessId* GetCurrentSceneProcessId_ = {}) noexcept : AddApplicationManifest{AddApplicationManifest_}, RemoveApplicationManifest{RemoveApplicationManifest_}, IsApplicationInstalled{IsApplicationInstalled_}, GetApplicationCount{GetApplicationCount_}, GetApplicationKeyByIndex{GetApplicationKeyByIndex_}, GetApplicationKeyByProcessId{GetApplicationKeyByProcessId_}, LaunchApplication{LaunchApplication_}, LaunchTemplateApplication{LaunchTemplateApplication_}, LaunchApplicationFromMimeType{LaunchApplicationFromMimeType_}, LaunchDashboardOverlay{LaunchDashboardOverlay_}, CancelApplicationLaunch{CancelApplicationLaunch_}, IdentifyApplication{IdentifyApplication_}, GetApplicationProcessId{GetApplicationProcessId_}, GetApplicationsErrorNameFromEnum{GetApplicationsErrorNameFromEnum_}, GetApplicationPropertyString{GetApplicationPropertyString_}, GetApplicationPropertyBool{GetApplicationPropertyBool_}, GetApplicationPropertyUint64{GetApplicationPropertyUint64_}, SetApplicationAutoLaunch{SetApplicationAutoLaunch_}, GetApplicationAutoLaunch{GetApplicationAutoLaunch_}, SetDefaultApplicationForMimeType{SetDefaultApplicationForMimeType_}, GetDefaultApplicationForMimeType{GetDefaultApplicationForMimeType_}, GetApplicationSupportedMimeTypes{GetApplicationSupportedMimeTypes_}, GetApplicationsThatSupportMimeType{GetApplicationsThatSupportMimeType_}, GetApplicationLaunchArguments{GetApplicationLaunchArguments_}, GetStartingApplication{GetStartingApplication_}, GetTransitionState{GetTransitionState_}, PerformApplicationPrelaunchCheck{PerformApplicationPrelaunchCheck_}, GetApplicationsTransitionStateNameFromEnum{GetApplicationsTransitionStateNameFromEnum_}, IsQuitUserPromptRequested{IsQuitUserPromptRequested_}, LaunchInternalProcess{LaunchInternalProcess_}, GetCurrentSceneProcessId{GetCurrentSceneProcessId_} {}
  }; // OVR.OpenVR.IVRApplications
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::IVRApplications, "OVR.OpenVR", "IVRApplications");
#pragma pack(pop)
