// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Autogenerated type: OVR.OpenVR.IVRChaperone
  struct IVRChaperone : public System::ValueType {
    public:
    // Nested type: OVR::OpenVR::IVRChaperone::_GetCalibrationState
    class _GetCalibrationState;
    // Nested type: OVR::OpenVR::IVRChaperone::_GetPlayAreaSize
    class _GetPlayAreaSize;
    // Nested type: OVR::OpenVR::IVRChaperone::_GetPlayAreaRect
    class _GetPlayAreaRect;
    // Nested type: OVR::OpenVR::IVRChaperone::_ReloadInfo
    class _ReloadInfo;
    // Nested type: OVR::OpenVR::IVRChaperone::_SetSceneColor
    class _SetSceneColor;
    // Nested type: OVR::OpenVR::IVRChaperone::_GetBoundsColor
    class _GetBoundsColor;
    // Nested type: OVR::OpenVR::IVRChaperone::_AreBoundsVisible
    class _AreBoundsVisible;
    // Nested type: OVR::OpenVR::IVRChaperone::_ForceBoundsVisible
    class _ForceBoundsVisible;
    // OVR.OpenVR.IVRChaperone/_GetCalibrationState GetCalibrationState
    // Offset: 0x0
    OVR::OpenVR::IVRChaperone::_GetCalibrationState* GetCalibrationState;
    // OVR.OpenVR.IVRChaperone/_GetPlayAreaSize GetPlayAreaSize
    // Offset: 0x8
    OVR::OpenVR::IVRChaperone::_GetPlayAreaSize* GetPlayAreaSize;
    // OVR.OpenVR.IVRChaperone/_GetPlayAreaRect GetPlayAreaRect
    // Offset: 0x10
    OVR::OpenVR::IVRChaperone::_GetPlayAreaRect* GetPlayAreaRect;
    // OVR.OpenVR.IVRChaperone/_ReloadInfo ReloadInfo
    // Offset: 0x18
    OVR::OpenVR::IVRChaperone::_ReloadInfo* ReloadInfo;
    // OVR.OpenVR.IVRChaperone/_SetSceneColor SetSceneColor
    // Offset: 0x20
    OVR::OpenVR::IVRChaperone::_SetSceneColor* SetSceneColor;
    // OVR.OpenVR.IVRChaperone/_GetBoundsColor GetBoundsColor
    // Offset: 0x28
    OVR::OpenVR::IVRChaperone::_GetBoundsColor* GetBoundsColor;
    // OVR.OpenVR.IVRChaperone/_AreBoundsVisible AreBoundsVisible
    // Offset: 0x30
    OVR::OpenVR::IVRChaperone::_AreBoundsVisible* AreBoundsVisible;
    // OVR.OpenVR.IVRChaperone/_ForceBoundsVisible ForceBoundsVisible
    // Offset: 0x38
    OVR::OpenVR::IVRChaperone::_ForceBoundsVisible* ForceBoundsVisible;
    // Creating value type constructor for type: IVRChaperone
    constexpr IVRChaperone(OVR::OpenVR::IVRChaperone::_GetCalibrationState* GetCalibrationState_ = {}, OVR::OpenVR::IVRChaperone::_GetPlayAreaSize* GetPlayAreaSize_ = {}, OVR::OpenVR::IVRChaperone::_GetPlayAreaRect* GetPlayAreaRect_ = {}, OVR::OpenVR::IVRChaperone::_ReloadInfo* ReloadInfo_ = {}, OVR::OpenVR::IVRChaperone::_SetSceneColor* SetSceneColor_ = {}, OVR::OpenVR::IVRChaperone::_GetBoundsColor* GetBoundsColor_ = {}, OVR::OpenVR::IVRChaperone::_AreBoundsVisible* AreBoundsVisible_ = {}, OVR::OpenVR::IVRChaperone::_ForceBoundsVisible* ForceBoundsVisible_ = {}) noexcept : GetCalibrationState{GetCalibrationState_}, GetPlayAreaSize{GetPlayAreaSize_}, GetPlayAreaRect{GetPlayAreaRect_}, ReloadInfo{ReloadInfo_}, SetSceneColor{SetSceneColor_}, GetBoundsColor{GetBoundsColor_}, AreBoundsVisible{AreBoundsVisible_}, ForceBoundsVisible{ForceBoundsVisible_} {}
  }; // OVR.OpenVR.IVRChaperone
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::IVRChaperone, "OVR.OpenVR", "IVRChaperone");
#pragma pack(pop)
