// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Size: 0xA0
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVR.OpenVR.IVRChaperoneSetup
  // [] Offset: FFFFFFFF
  struct IVRChaperoneSetup/*, public System::ValueType*/ {
    public:
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_CommitWorkingCopy
    class _CommitWorkingCopy;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_RevertWorkingCopy
    class _RevertWorkingCopy;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_GetWorkingPlayAreaSize
    class _GetWorkingPlayAreaSize;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_GetWorkingPlayAreaRect
    class _GetWorkingPlayAreaRect;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo
    class _GetWorkingCollisionBoundsInfo;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo
    class _GetLiveCollisionBoundsInfo;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose
    class _GetWorkingSeatedZeroPoseToRawTrackingPose;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose
    class _GetWorkingStandingZeroPoseToRawTrackingPose;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_SetWorkingPlayAreaSize
    class _SetWorkingPlayAreaSize;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo
    class _SetWorkingCollisionBoundsInfo;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose
    class _SetWorkingSeatedZeroPoseToRawTrackingPose;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose
    class _SetWorkingStandingZeroPoseToRawTrackingPose;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_ReloadFromDisk
    class _ReloadFromDisk;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose
    class _GetLiveSeatedZeroPoseToRawTrackingPose;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo
    class _SetWorkingCollisionBoundsTagsInfo;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo
    class _GetLiveCollisionBoundsTagsInfo;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo
    class _SetWorkingPhysicalBoundsInfo;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo
    class _GetLivePhysicalBoundsInfo;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_ExportLiveToBuffer
    class _ExportLiveToBuffer;
    // Nested type: OVR::OpenVR::IVRChaperoneSetup::_ImportFromBufferToWorking
    class _ImportFromBufferToWorking;
    // OVR.OpenVR.IVRChaperoneSetup/_CommitWorkingCopy CommitWorkingCopy
    // Size: 0x8
    // Offset: 0x0
    OVR::OpenVR::IVRChaperoneSetup::_CommitWorkingCopy* CommitWorkingCopy;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_CommitWorkingCopy*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_RevertWorkingCopy RevertWorkingCopy
    // Size: 0x8
    // Offset: 0x8
    OVR::OpenVR::IVRChaperoneSetup::_RevertWorkingCopy* RevertWorkingCopy;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_RevertWorkingCopy*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_GetWorkingPlayAreaSize GetWorkingPlayAreaSize
    // Size: 0x8
    // Offset: 0x10
    OVR::OpenVR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* GetWorkingPlayAreaSize;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_GetWorkingPlayAreaSize*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_GetWorkingPlayAreaRect GetWorkingPlayAreaRect
    // Size: 0x8
    // Offset: 0x18
    OVR::OpenVR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* GetWorkingPlayAreaRect;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_GetWorkingPlayAreaRect*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_GetWorkingCollisionBoundsInfo GetWorkingCollisionBoundsInfo
    // Size: 0x8
    // Offset: 0x20
    OVR::OpenVR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* GetWorkingCollisionBoundsInfo;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_GetLiveCollisionBoundsInfo GetLiveCollisionBoundsInfo
    // Size: 0x8
    // Offset: 0x28
    OVR::OpenVR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* GetLiveCollisionBoundsInfo;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_GetWorkingSeatedZeroPoseToRawTrackingPose GetWorkingSeatedZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x30
    OVR::OpenVR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* GetWorkingSeatedZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_GetWorkingStandingZeroPoseToRawTrackingPose GetWorkingStandingZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x38
    OVR::OpenVR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* GetWorkingStandingZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_SetWorkingPlayAreaSize SetWorkingPlayAreaSize
    // Size: 0x8
    // Offset: 0x40
    OVR::OpenVR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* SetWorkingPlayAreaSize;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_SetWorkingPlayAreaSize*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_SetWorkingCollisionBoundsInfo SetWorkingCollisionBoundsInfo
    // Size: 0x8
    // Offset: 0x48
    OVR::OpenVR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* SetWorkingCollisionBoundsInfo;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_SetWorkingSeatedZeroPoseToRawTrackingPose SetWorkingSeatedZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x50
    OVR::OpenVR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* SetWorkingSeatedZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_SetWorkingStandingZeroPoseToRawTrackingPose SetWorkingStandingZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x58
    OVR::OpenVR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* SetWorkingStandingZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_ReloadFromDisk ReloadFromDisk
    // Size: 0x8
    // Offset: 0x60
    OVR::OpenVR::IVRChaperoneSetup::_ReloadFromDisk* ReloadFromDisk;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_ReloadFromDisk*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_GetLiveSeatedZeroPoseToRawTrackingPose GetLiveSeatedZeroPoseToRawTrackingPose
    // Size: 0x8
    // Offset: 0x68
    OVR::OpenVR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* GetLiveSeatedZeroPoseToRawTrackingPose;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_SetWorkingCollisionBoundsTagsInfo SetWorkingCollisionBoundsTagsInfo
    // Size: 0x8
    // Offset: 0x70
    OVR::OpenVR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* SetWorkingCollisionBoundsTagsInfo;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_GetLiveCollisionBoundsTagsInfo GetLiveCollisionBoundsTagsInfo
    // Size: 0x8
    // Offset: 0x78
    OVR::OpenVR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* GetLiveCollisionBoundsTagsInfo;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_SetWorkingPhysicalBoundsInfo SetWorkingPhysicalBoundsInfo
    // Size: 0x8
    // Offset: 0x80
    OVR::OpenVR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* SetWorkingPhysicalBoundsInfo;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_GetLivePhysicalBoundsInfo GetLivePhysicalBoundsInfo
    // Size: 0x8
    // Offset: 0x88
    OVR::OpenVR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* GetLivePhysicalBoundsInfo;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_ExportLiveToBuffer ExportLiveToBuffer
    // Size: 0x8
    // Offset: 0x90
    OVR::OpenVR::IVRChaperoneSetup::_ExportLiveToBuffer* ExportLiveToBuffer;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_ExportLiveToBuffer*) == 0x8);
    // OVR.OpenVR.IVRChaperoneSetup/_ImportFromBufferToWorking ImportFromBufferToWorking
    // Size: 0x8
    // Offset: 0x98
    OVR::OpenVR::IVRChaperoneSetup::_ImportFromBufferToWorking* ImportFromBufferToWorking;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRChaperoneSetup::_ImportFromBufferToWorking*) == 0x8);
    // Creating value type constructor for type: IVRChaperoneSetup
    constexpr IVRChaperoneSetup(OVR::OpenVR::IVRChaperoneSetup::_CommitWorkingCopy* CommitWorkingCopy_ = {}, OVR::OpenVR::IVRChaperoneSetup::_RevertWorkingCopy* RevertWorkingCopy_ = {}, OVR::OpenVR::IVRChaperoneSetup::_GetWorkingPlayAreaSize* GetWorkingPlayAreaSize_ = {}, OVR::OpenVR::IVRChaperoneSetup::_GetWorkingPlayAreaRect* GetWorkingPlayAreaRect_ = {}, OVR::OpenVR::IVRChaperoneSetup::_GetWorkingCollisionBoundsInfo* GetWorkingCollisionBoundsInfo_ = {}, OVR::OpenVR::IVRChaperoneSetup::_GetLiveCollisionBoundsInfo* GetLiveCollisionBoundsInfo_ = {}, OVR::OpenVR::IVRChaperoneSetup::_GetWorkingSeatedZeroPoseToRawTrackingPose* GetWorkingSeatedZeroPoseToRawTrackingPose_ = {}, OVR::OpenVR::IVRChaperoneSetup::_GetWorkingStandingZeroPoseToRawTrackingPose* GetWorkingStandingZeroPoseToRawTrackingPose_ = {}, OVR::OpenVR::IVRChaperoneSetup::_SetWorkingPlayAreaSize* SetWorkingPlayAreaSize_ = {}, OVR::OpenVR::IVRChaperoneSetup::_SetWorkingCollisionBoundsInfo* SetWorkingCollisionBoundsInfo_ = {}, OVR::OpenVR::IVRChaperoneSetup::_SetWorkingSeatedZeroPoseToRawTrackingPose* SetWorkingSeatedZeroPoseToRawTrackingPose_ = {}, OVR::OpenVR::IVRChaperoneSetup::_SetWorkingStandingZeroPoseToRawTrackingPose* SetWorkingStandingZeroPoseToRawTrackingPose_ = {}, OVR::OpenVR::IVRChaperoneSetup::_ReloadFromDisk* ReloadFromDisk_ = {}, OVR::OpenVR::IVRChaperoneSetup::_GetLiveSeatedZeroPoseToRawTrackingPose* GetLiveSeatedZeroPoseToRawTrackingPose_ = {}, OVR::OpenVR::IVRChaperoneSetup::_SetWorkingCollisionBoundsTagsInfo* SetWorkingCollisionBoundsTagsInfo_ = {}, OVR::OpenVR::IVRChaperoneSetup::_GetLiveCollisionBoundsTagsInfo* GetLiveCollisionBoundsTagsInfo_ = {}, OVR::OpenVR::IVRChaperoneSetup::_SetWorkingPhysicalBoundsInfo* SetWorkingPhysicalBoundsInfo_ = {}, OVR::OpenVR::IVRChaperoneSetup::_GetLivePhysicalBoundsInfo* GetLivePhysicalBoundsInfo_ = {}, OVR::OpenVR::IVRChaperoneSetup::_ExportLiveToBuffer* ExportLiveToBuffer_ = {}, OVR::OpenVR::IVRChaperoneSetup::_ImportFromBufferToWorking* ImportFromBufferToWorking_ = {}) noexcept : CommitWorkingCopy{CommitWorkingCopy_}, RevertWorkingCopy{RevertWorkingCopy_}, GetWorkingPlayAreaSize{GetWorkingPlayAreaSize_}, GetWorkingPlayAreaRect{GetWorkingPlayAreaRect_}, GetWorkingCollisionBoundsInfo{GetWorkingCollisionBoundsInfo_}, GetLiveCollisionBoundsInfo{GetLiveCollisionBoundsInfo_}, GetWorkingSeatedZeroPoseToRawTrackingPose{GetWorkingSeatedZeroPoseToRawTrackingPose_}, GetWorkingStandingZeroPoseToRawTrackingPose{GetWorkingStandingZeroPoseToRawTrackingPose_}, SetWorkingPlayAreaSize{SetWorkingPlayAreaSize_}, SetWorkingCollisionBoundsInfo{SetWorkingCollisionBoundsInfo_}, SetWorkingSeatedZeroPoseToRawTrackingPose{SetWorkingSeatedZeroPoseToRawTrackingPose_}, SetWorkingStandingZeroPoseToRawTrackingPose{SetWorkingStandingZeroPoseToRawTrackingPose_}, ReloadFromDisk{ReloadFromDisk_}, GetLiveSeatedZeroPoseToRawTrackingPose{GetLiveSeatedZeroPoseToRawTrackingPose_}, SetWorkingCollisionBoundsTagsInfo{SetWorkingCollisionBoundsTagsInfo_}, GetLiveCollisionBoundsTagsInfo{GetLiveCollisionBoundsTagsInfo_}, SetWorkingPhysicalBoundsInfo{SetWorkingPhysicalBoundsInfo_}, GetLivePhysicalBoundsInfo{GetLivePhysicalBoundsInfo_}, ExportLiveToBuffer{ExportLiveToBuffer_}, ImportFromBufferToWorking{ImportFromBufferToWorking_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
  }; // OVR.OpenVR.IVRChaperoneSetup
  #pragma pack(pop)
  static check_size<sizeof(IVRChaperoneSetup), 152 + sizeof(OVR::OpenVR::IVRChaperoneSetup::_ImportFromBufferToWorking*)> __OVR_OpenVR_IVRChaperoneSetupSizeCheck;
  static_assert(sizeof(IVRChaperoneSetup) == 0xA0);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::IVRChaperoneSetup, "OVR.OpenVR", "IVRChaperoneSetup");
