// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Size: 0x90
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVR.OpenVR.IVRInput
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRInput/*, public System::ValueType*/ {
    public:
    // Nested type: OVR::OpenVR::IVRInput::_SetActionManifestPath
    class _SetActionManifestPath;
    // Nested type: OVR::OpenVR::IVRInput::_GetActionSetHandle
    class _GetActionSetHandle;
    // Nested type: OVR::OpenVR::IVRInput::_GetActionHandle
    class _GetActionHandle;
    // Nested type: OVR::OpenVR::IVRInput::_GetInputSourceHandle
    class _GetInputSourceHandle;
    // Nested type: OVR::OpenVR::IVRInput::_UpdateActionState
    class _UpdateActionState;
    // Nested type: OVR::OpenVR::IVRInput::_GetDigitalActionData
    class _GetDigitalActionData;
    // Nested type: OVR::OpenVR::IVRInput::_GetAnalogActionData
    class _GetAnalogActionData;
    // Nested type: OVR::OpenVR::IVRInput::_GetPoseActionData
    class _GetPoseActionData;
    // Nested type: OVR::OpenVR::IVRInput::_GetSkeletalActionData
    class _GetSkeletalActionData;
    // Nested type: OVR::OpenVR::IVRInput::_GetSkeletalBoneData
    class _GetSkeletalBoneData;
    // Nested type: OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed
    class _GetSkeletalBoneDataCompressed;
    // Nested type: OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData
    class _DecompressSkeletalBoneData;
    // Nested type: OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction
    class _TriggerHapticVibrationAction;
    // Nested type: OVR::OpenVR::IVRInput::_GetActionOrigins
    class _GetActionOrigins;
    // Nested type: OVR::OpenVR::IVRInput::_GetOriginLocalizedName
    class _GetOriginLocalizedName;
    // Nested type: OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo
    class _GetOriginTrackedDeviceInfo;
    // Nested type: OVR::OpenVR::IVRInput::_ShowActionOrigins
    class _ShowActionOrigins;
    // Nested type: OVR::OpenVR::IVRInput::_ShowBindingsForActionSet
    class _ShowBindingsForActionSet;
    // OVR.OpenVR.IVRInput/OVR.OpenVR._SetActionManifestPath SetActionManifestPath
    // Size: 0x8
    // Offset: 0x0
    OVR::OpenVR::IVRInput::_SetActionManifestPath* SetActionManifestPath;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_SetActionManifestPath*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionSetHandle GetActionSetHandle
    // Size: 0x8
    // Offset: 0x8
    OVR::OpenVR::IVRInput::_GetActionSetHandle* GetActionSetHandle;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetActionSetHandle*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionHandle GetActionHandle
    // Size: 0x8
    // Offset: 0x10
    OVR::OpenVR::IVRInput::_GetActionHandle* GetActionHandle;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetActionHandle*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetInputSourceHandle GetInputSourceHandle
    // Size: 0x8
    // Offset: 0x18
    OVR::OpenVR::IVRInput::_GetInputSourceHandle* GetInputSourceHandle;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetInputSourceHandle*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._UpdateActionState UpdateActionState
    // Size: 0x8
    // Offset: 0x20
    OVR::OpenVR::IVRInput::_UpdateActionState* UpdateActionState;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_UpdateActionState*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetDigitalActionData GetDigitalActionData
    // Size: 0x8
    // Offset: 0x28
    OVR::OpenVR::IVRInput::_GetDigitalActionData* GetDigitalActionData;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetDigitalActionData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetAnalogActionData GetAnalogActionData
    // Size: 0x8
    // Offset: 0x30
    OVR::OpenVR::IVRInput::_GetAnalogActionData* GetAnalogActionData;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetAnalogActionData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetPoseActionData GetPoseActionData
    // Size: 0x8
    // Offset: 0x38
    OVR::OpenVR::IVRInput::_GetPoseActionData* GetPoseActionData;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetPoseActionData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalActionData GetSkeletalActionData
    // Size: 0x8
    // Offset: 0x40
    OVR::OpenVR::IVRInput::_GetSkeletalActionData* GetSkeletalActionData;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetSkeletalActionData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneData GetSkeletalBoneData
    // Size: 0x8
    // Offset: 0x48
    OVR::OpenVR::IVRInput::_GetSkeletalBoneData* GetSkeletalBoneData;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetSkeletalBoneData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneDataCompressed GetSkeletalBoneDataCompressed
    // Size: 0x8
    // Offset: 0x50
    OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed* GetSkeletalBoneDataCompressed;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._DecompressSkeletalBoneData DecompressSkeletalBoneData
    // Size: 0x8
    // Offset: 0x58
    OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData* DecompressSkeletalBoneData;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._TriggerHapticVibrationAction TriggerHapticVibrationAction
    // Size: 0x8
    // Offset: 0x60
    OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction* TriggerHapticVibrationAction;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionOrigins GetActionOrigins
    // Size: 0x8
    // Offset: 0x68
    OVR::OpenVR::IVRInput::_GetActionOrigins* GetActionOrigins;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetActionOrigins*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginLocalizedName GetOriginLocalizedName
    // Size: 0x8
    // Offset: 0x70
    OVR::OpenVR::IVRInput::_GetOriginLocalizedName* GetOriginLocalizedName;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetOriginLocalizedName*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginTrackedDeviceInfo GetOriginTrackedDeviceInfo
    // Size: 0x8
    // Offset: 0x78
    OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo* GetOriginTrackedDeviceInfo;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._ShowActionOrigins ShowActionOrigins
    // Size: 0x8
    // Offset: 0x80
    OVR::OpenVR::IVRInput::_ShowActionOrigins* ShowActionOrigins;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_ShowActionOrigins*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._ShowBindingsForActionSet ShowBindingsForActionSet
    // Size: 0x8
    // Offset: 0x88
    OVR::OpenVR::IVRInput::_ShowBindingsForActionSet* ShowBindingsForActionSet;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRInput::_ShowBindingsForActionSet*) == 0x8);
    // Creating value type constructor for type: IVRInput
    constexpr IVRInput(OVR::OpenVR::IVRInput::_SetActionManifestPath* SetActionManifestPath_ = {}, OVR::OpenVR::IVRInput::_GetActionSetHandle* GetActionSetHandle_ = {}, OVR::OpenVR::IVRInput::_GetActionHandle* GetActionHandle_ = {}, OVR::OpenVR::IVRInput::_GetInputSourceHandle* GetInputSourceHandle_ = {}, OVR::OpenVR::IVRInput::_UpdateActionState* UpdateActionState_ = {}, OVR::OpenVR::IVRInput::_GetDigitalActionData* GetDigitalActionData_ = {}, OVR::OpenVR::IVRInput::_GetAnalogActionData* GetAnalogActionData_ = {}, OVR::OpenVR::IVRInput::_GetPoseActionData* GetPoseActionData_ = {}, OVR::OpenVR::IVRInput::_GetSkeletalActionData* GetSkeletalActionData_ = {}, OVR::OpenVR::IVRInput::_GetSkeletalBoneData* GetSkeletalBoneData_ = {}, OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed* GetSkeletalBoneDataCompressed_ = {}, OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData* DecompressSkeletalBoneData_ = {}, OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction* TriggerHapticVibrationAction_ = {}, OVR::OpenVR::IVRInput::_GetActionOrigins* GetActionOrigins_ = {}, OVR::OpenVR::IVRInput::_GetOriginLocalizedName* GetOriginLocalizedName_ = {}, OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo* GetOriginTrackedDeviceInfo_ = {}, OVR::OpenVR::IVRInput::_ShowActionOrigins* ShowActionOrigins_ = {}, OVR::OpenVR::IVRInput::_ShowBindingsForActionSet* ShowBindingsForActionSet_ = {}) noexcept : SetActionManifestPath{SetActionManifestPath_}, GetActionSetHandle{GetActionSetHandle_}, GetActionHandle{GetActionHandle_}, GetInputSourceHandle{GetInputSourceHandle_}, UpdateActionState{UpdateActionState_}, GetDigitalActionData{GetDigitalActionData_}, GetAnalogActionData{GetAnalogActionData_}, GetPoseActionData{GetPoseActionData_}, GetSkeletalActionData{GetSkeletalActionData_}, GetSkeletalBoneData{GetSkeletalBoneData_}, GetSkeletalBoneDataCompressed{GetSkeletalBoneDataCompressed_}, DecompressSkeletalBoneData{DecompressSkeletalBoneData_}, TriggerHapticVibrationAction{TriggerHapticVibrationAction_}, GetActionOrigins{GetActionOrigins_}, GetOriginLocalizedName{GetOriginLocalizedName_}, GetOriginTrackedDeviceInfo{GetOriginTrackedDeviceInfo_}, ShowActionOrigins{ShowActionOrigins_}, ShowBindingsForActionSet{ShowBindingsForActionSet_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._SetActionManifestPath SetActionManifestPath
    OVR::OpenVR::IVRInput::_SetActionManifestPath* _get_SetActionManifestPath();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._SetActionManifestPath SetActionManifestPath
    void _set_SetActionManifestPath(OVR::OpenVR::IVRInput::_SetActionManifestPath* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionSetHandle GetActionSetHandle
    OVR::OpenVR::IVRInput::_GetActionSetHandle* _get_GetActionSetHandle();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionSetHandle GetActionSetHandle
    void _set_GetActionSetHandle(OVR::OpenVR::IVRInput::_GetActionSetHandle* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionHandle GetActionHandle
    OVR::OpenVR::IVRInput::_GetActionHandle* _get_GetActionHandle();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionHandle GetActionHandle
    void _set_GetActionHandle(OVR::OpenVR::IVRInput::_GetActionHandle* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetInputSourceHandle GetInputSourceHandle
    OVR::OpenVR::IVRInput::_GetInputSourceHandle* _get_GetInputSourceHandle();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetInputSourceHandle GetInputSourceHandle
    void _set_GetInputSourceHandle(OVR::OpenVR::IVRInput::_GetInputSourceHandle* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._UpdateActionState UpdateActionState
    OVR::OpenVR::IVRInput::_UpdateActionState* _get_UpdateActionState();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._UpdateActionState UpdateActionState
    void _set_UpdateActionState(OVR::OpenVR::IVRInput::_UpdateActionState* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetDigitalActionData GetDigitalActionData
    OVR::OpenVR::IVRInput::_GetDigitalActionData* _get_GetDigitalActionData();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetDigitalActionData GetDigitalActionData
    void _set_GetDigitalActionData(OVR::OpenVR::IVRInput::_GetDigitalActionData* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetAnalogActionData GetAnalogActionData
    OVR::OpenVR::IVRInput::_GetAnalogActionData* _get_GetAnalogActionData();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetAnalogActionData GetAnalogActionData
    void _set_GetAnalogActionData(OVR::OpenVR::IVRInput::_GetAnalogActionData* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetPoseActionData GetPoseActionData
    OVR::OpenVR::IVRInput::_GetPoseActionData* _get_GetPoseActionData();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetPoseActionData GetPoseActionData
    void _set_GetPoseActionData(OVR::OpenVR::IVRInput::_GetPoseActionData* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalActionData GetSkeletalActionData
    OVR::OpenVR::IVRInput::_GetSkeletalActionData* _get_GetSkeletalActionData();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalActionData GetSkeletalActionData
    void _set_GetSkeletalActionData(OVR::OpenVR::IVRInput::_GetSkeletalActionData* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneData GetSkeletalBoneData
    OVR::OpenVR::IVRInput::_GetSkeletalBoneData* _get_GetSkeletalBoneData();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneData GetSkeletalBoneData
    void _set_GetSkeletalBoneData(OVR::OpenVR::IVRInput::_GetSkeletalBoneData* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneDataCompressed GetSkeletalBoneDataCompressed
    OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed* _get_GetSkeletalBoneDataCompressed();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneDataCompressed GetSkeletalBoneDataCompressed
    void _set_GetSkeletalBoneDataCompressed(OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._DecompressSkeletalBoneData DecompressSkeletalBoneData
    OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData* _get_DecompressSkeletalBoneData();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._DecompressSkeletalBoneData DecompressSkeletalBoneData
    void _set_DecompressSkeletalBoneData(OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._TriggerHapticVibrationAction TriggerHapticVibrationAction
    OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction* _get_TriggerHapticVibrationAction();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._TriggerHapticVibrationAction TriggerHapticVibrationAction
    void _set_TriggerHapticVibrationAction(OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionOrigins GetActionOrigins
    OVR::OpenVR::IVRInput::_GetActionOrigins* _get_GetActionOrigins();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionOrigins GetActionOrigins
    void _set_GetActionOrigins(OVR::OpenVR::IVRInput::_GetActionOrigins* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginLocalizedName GetOriginLocalizedName
    OVR::OpenVR::IVRInput::_GetOriginLocalizedName* _get_GetOriginLocalizedName();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginLocalizedName GetOriginLocalizedName
    void _set_GetOriginLocalizedName(OVR::OpenVR::IVRInput::_GetOriginLocalizedName* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginTrackedDeviceInfo GetOriginTrackedDeviceInfo
    OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo* _get_GetOriginTrackedDeviceInfo();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginTrackedDeviceInfo GetOriginTrackedDeviceInfo
    void _set_GetOriginTrackedDeviceInfo(OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._ShowActionOrigins ShowActionOrigins
    OVR::OpenVR::IVRInput::_ShowActionOrigins* _get_ShowActionOrigins();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._ShowActionOrigins ShowActionOrigins
    void _set_ShowActionOrigins(OVR::OpenVR::IVRInput::_ShowActionOrigins* value);
    // Get instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._ShowBindingsForActionSet ShowBindingsForActionSet
    OVR::OpenVR::IVRInput::_ShowBindingsForActionSet* _get_ShowBindingsForActionSet();
    // Set instance field: OVR.OpenVR.IVRInput/OVR.OpenVR._ShowBindingsForActionSet ShowBindingsForActionSet
    void _set_ShowBindingsForActionSet(OVR::OpenVR::IVRInput::_ShowBindingsForActionSet* value);
  }; // OVR.OpenVR.IVRInput
  #pragma pack(pop)
  static check_size<sizeof(IVRInput), 136 + sizeof(OVR::OpenVR::IVRInput::_ShowBindingsForActionSet*)> __OVR_OpenVR_IVRInputSizeCheck;
  static_assert(sizeof(IVRInput) == 0x90);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::IVRInput, "OVR.OpenVR", "IVRInput");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
