// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Autogenerated type: OVR.OpenVR.IVRInput
  struct IVRInput : public System::ValueType {
    public:
    // Nested type: OVR::OpenVR::IVRInput::_SetActionManifestPath
    class _SetActionManifestPath;
    // Nested type: OVR::OpenVR::IVRInput::_GetActionSetHandle
    class _GetActionSetHandle;
    // Nested type: OVR::OpenVR::IVRInput::_GetActionHandle
    class _GetActionHandle;
    // Nested type: OVR::OpenVR::IVRInput::_GetInputSourceHandle
    class _GetInputSourceHandle;
    // Nested type: OVR::OpenVR::IVRInput::_UpdateActionState
    class _UpdateActionState;
    // Nested type: OVR::OpenVR::IVRInput::_GetDigitalActionData
    class _GetDigitalActionData;
    // Nested type: OVR::OpenVR::IVRInput::_GetAnalogActionData
    class _GetAnalogActionData;
    // Nested type: OVR::OpenVR::IVRInput::_GetPoseActionData
    class _GetPoseActionData;
    // Nested type: OVR::OpenVR::IVRInput::_GetSkeletalActionData
    class _GetSkeletalActionData;
    // Nested type: OVR::OpenVR::IVRInput::_GetSkeletalBoneData
    class _GetSkeletalBoneData;
    // Nested type: OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed
    class _GetSkeletalBoneDataCompressed;
    // Nested type: OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData
    class _DecompressSkeletalBoneData;
    // Nested type: OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction
    class _TriggerHapticVibrationAction;
    // Nested type: OVR::OpenVR::IVRInput::_GetActionOrigins
    class _GetActionOrigins;
    // Nested type: OVR::OpenVR::IVRInput::_GetOriginLocalizedName
    class _GetOriginLocalizedName;
    // Nested type: OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo
    class _GetOriginTrackedDeviceInfo;
    // Nested type: OVR::OpenVR::IVRInput::_ShowActionOrigins
    class _ShowActionOrigins;
    // Nested type: OVR::OpenVR::IVRInput::_ShowBindingsForActionSet
    class _ShowBindingsForActionSet;
    // OVR.OpenVR.IVRInput/_SetActionManifestPath SetActionManifestPath
    // Offset: 0x0
    OVR::OpenVR::IVRInput::_SetActionManifestPath* SetActionManifestPath;
    // OVR.OpenVR.IVRInput/_GetActionSetHandle GetActionSetHandle
    // Offset: 0x8
    OVR::OpenVR::IVRInput::_GetActionSetHandle* GetActionSetHandle;
    // OVR.OpenVR.IVRInput/_GetActionHandle GetActionHandle
    // Offset: 0x10
    OVR::OpenVR::IVRInput::_GetActionHandle* GetActionHandle;
    // OVR.OpenVR.IVRInput/_GetInputSourceHandle GetInputSourceHandle
    // Offset: 0x18
    OVR::OpenVR::IVRInput::_GetInputSourceHandle* GetInputSourceHandle;
    // OVR.OpenVR.IVRInput/_UpdateActionState UpdateActionState
    // Offset: 0x20
    OVR::OpenVR::IVRInput::_UpdateActionState* UpdateActionState;
    // OVR.OpenVR.IVRInput/_GetDigitalActionData GetDigitalActionData
    // Offset: 0x28
    OVR::OpenVR::IVRInput::_GetDigitalActionData* GetDigitalActionData;
    // OVR.OpenVR.IVRInput/_GetAnalogActionData GetAnalogActionData
    // Offset: 0x30
    OVR::OpenVR::IVRInput::_GetAnalogActionData* GetAnalogActionData;
    // OVR.OpenVR.IVRInput/_GetPoseActionData GetPoseActionData
    // Offset: 0x38
    OVR::OpenVR::IVRInput::_GetPoseActionData* GetPoseActionData;
    // OVR.OpenVR.IVRInput/_GetSkeletalActionData GetSkeletalActionData
    // Offset: 0x40
    OVR::OpenVR::IVRInput::_GetSkeletalActionData* GetSkeletalActionData;
    // OVR.OpenVR.IVRInput/_GetSkeletalBoneData GetSkeletalBoneData
    // Offset: 0x48
    OVR::OpenVR::IVRInput::_GetSkeletalBoneData* GetSkeletalBoneData;
    // OVR.OpenVR.IVRInput/_GetSkeletalBoneDataCompressed GetSkeletalBoneDataCompressed
    // Offset: 0x50
    OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed* GetSkeletalBoneDataCompressed;
    // OVR.OpenVR.IVRInput/_DecompressSkeletalBoneData DecompressSkeletalBoneData
    // Offset: 0x58
    OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData* DecompressSkeletalBoneData;
    // OVR.OpenVR.IVRInput/_TriggerHapticVibrationAction TriggerHapticVibrationAction
    // Offset: 0x60
    OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction* TriggerHapticVibrationAction;
    // OVR.OpenVR.IVRInput/_GetActionOrigins GetActionOrigins
    // Offset: 0x68
    OVR::OpenVR::IVRInput::_GetActionOrigins* GetActionOrigins;
    // OVR.OpenVR.IVRInput/_GetOriginLocalizedName GetOriginLocalizedName
    // Offset: 0x70
    OVR::OpenVR::IVRInput::_GetOriginLocalizedName* GetOriginLocalizedName;
    // OVR.OpenVR.IVRInput/_GetOriginTrackedDeviceInfo GetOriginTrackedDeviceInfo
    // Offset: 0x78
    OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo* GetOriginTrackedDeviceInfo;
    // OVR.OpenVR.IVRInput/_ShowActionOrigins ShowActionOrigins
    // Offset: 0x80
    OVR::OpenVR::IVRInput::_ShowActionOrigins* ShowActionOrigins;
    // OVR.OpenVR.IVRInput/_ShowBindingsForActionSet ShowBindingsForActionSet
    // Offset: 0x88
    OVR::OpenVR::IVRInput::_ShowBindingsForActionSet* ShowBindingsForActionSet;
    // Creating value type constructor for type: IVRInput
    constexpr IVRInput(OVR::OpenVR::IVRInput::_SetActionManifestPath* SetActionManifestPath_ = {}, OVR::OpenVR::IVRInput::_GetActionSetHandle* GetActionSetHandle_ = {}, OVR::OpenVR::IVRInput::_GetActionHandle* GetActionHandle_ = {}, OVR::OpenVR::IVRInput::_GetInputSourceHandle* GetInputSourceHandle_ = {}, OVR::OpenVR::IVRInput::_UpdateActionState* UpdateActionState_ = {}, OVR::OpenVR::IVRInput::_GetDigitalActionData* GetDigitalActionData_ = {}, OVR::OpenVR::IVRInput::_GetAnalogActionData* GetAnalogActionData_ = {}, OVR::OpenVR::IVRInput::_GetPoseActionData* GetPoseActionData_ = {}, OVR::OpenVR::IVRInput::_GetSkeletalActionData* GetSkeletalActionData_ = {}, OVR::OpenVR::IVRInput::_GetSkeletalBoneData* GetSkeletalBoneData_ = {}, OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed* GetSkeletalBoneDataCompressed_ = {}, OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData* DecompressSkeletalBoneData_ = {}, OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction* TriggerHapticVibrationAction_ = {}, OVR::OpenVR::IVRInput::_GetActionOrigins* GetActionOrigins_ = {}, OVR::OpenVR::IVRInput::_GetOriginLocalizedName* GetOriginLocalizedName_ = {}, OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo* GetOriginTrackedDeviceInfo_ = {}, OVR::OpenVR::IVRInput::_ShowActionOrigins* ShowActionOrigins_ = {}, OVR::OpenVR::IVRInput::_ShowBindingsForActionSet* ShowBindingsForActionSet_ = {}) noexcept : SetActionManifestPath{SetActionManifestPath_}, GetActionSetHandle{GetActionSetHandle_}, GetActionHandle{GetActionHandle_}, GetInputSourceHandle{GetInputSourceHandle_}, UpdateActionState{UpdateActionState_}, GetDigitalActionData{GetDigitalActionData_}, GetAnalogActionData{GetAnalogActionData_}, GetPoseActionData{GetPoseActionData_}, GetSkeletalActionData{GetSkeletalActionData_}, GetSkeletalBoneData{GetSkeletalBoneData_}, GetSkeletalBoneDataCompressed{GetSkeletalBoneDataCompressed_}, DecompressSkeletalBoneData{DecompressSkeletalBoneData_}, TriggerHapticVibrationAction{TriggerHapticVibrationAction_}, GetActionOrigins{GetActionOrigins_}, GetOriginLocalizedName{GetOriginLocalizedName_}, GetOriginTrackedDeviceInfo{GetOriginTrackedDeviceInfo_}, ShowActionOrigins{ShowActionOrigins_}, ShowBindingsForActionSet{ShowBindingsForActionSet_} {}
  }; // OVR.OpenVR.IVRInput
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::IVRInput, "OVR.OpenVR", "IVRInput");
#pragma pack(pop)
