// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Forward declaring type: IVRInput
  struct IVRInput;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::OVR::OpenVR::IVRInput, "OVR.OpenVR", "IVRInput");
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Size: 0x90
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVR.OpenVR.IVRInput
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRInput/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::OVR::OpenVR::IVRInput::_SetActionManifestPath
    class _SetActionManifestPath;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetActionSetHandle
    class _GetActionSetHandle;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetActionHandle
    class _GetActionHandle;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetInputSourceHandle
    class _GetInputSourceHandle;
    // Nested type: ::OVR::OpenVR::IVRInput::_UpdateActionState
    class _UpdateActionState;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetDigitalActionData
    class _GetDigitalActionData;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetAnalogActionData
    class _GetAnalogActionData;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetPoseActionData
    class _GetPoseActionData;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetSkeletalActionData
    class _GetSkeletalActionData;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetSkeletalBoneData
    class _GetSkeletalBoneData;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed
    class _GetSkeletalBoneDataCompressed;
    // Nested type: ::OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData
    class _DecompressSkeletalBoneData;
    // Nested type: ::OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction
    class _TriggerHapticVibrationAction;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetActionOrigins
    class _GetActionOrigins;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetOriginLocalizedName
    class _GetOriginLocalizedName;
    // Nested type: ::OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo
    class _GetOriginTrackedDeviceInfo;
    // Nested type: ::OVR::OpenVR::IVRInput::_ShowActionOrigins
    class _ShowActionOrigins;
    // Nested type: ::OVR::OpenVR::IVRInput::_ShowBindingsForActionSet
    class _ShowBindingsForActionSet;
    public:
    // OVR.OpenVR.IVRInput/OVR.OpenVR._SetActionManifestPath SetActionManifestPath
    // Size: 0x8
    // Offset: 0x0
    ::OVR::OpenVR::IVRInput::_SetActionManifestPath* SetActionManifestPath;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_SetActionManifestPath*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionSetHandle GetActionSetHandle
    // Size: 0x8
    // Offset: 0x8
    ::OVR::OpenVR::IVRInput::_GetActionSetHandle* GetActionSetHandle;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetActionSetHandle*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionHandle GetActionHandle
    // Size: 0x8
    // Offset: 0x10
    ::OVR::OpenVR::IVRInput::_GetActionHandle* GetActionHandle;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetActionHandle*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetInputSourceHandle GetInputSourceHandle
    // Size: 0x8
    // Offset: 0x18
    ::OVR::OpenVR::IVRInput::_GetInputSourceHandle* GetInputSourceHandle;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetInputSourceHandle*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._UpdateActionState UpdateActionState
    // Size: 0x8
    // Offset: 0x20
    ::OVR::OpenVR::IVRInput::_UpdateActionState* UpdateActionState;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_UpdateActionState*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetDigitalActionData GetDigitalActionData
    // Size: 0x8
    // Offset: 0x28
    ::OVR::OpenVR::IVRInput::_GetDigitalActionData* GetDigitalActionData;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetDigitalActionData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetAnalogActionData GetAnalogActionData
    // Size: 0x8
    // Offset: 0x30
    ::OVR::OpenVR::IVRInput::_GetAnalogActionData* GetAnalogActionData;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetAnalogActionData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetPoseActionData GetPoseActionData
    // Size: 0x8
    // Offset: 0x38
    ::OVR::OpenVR::IVRInput::_GetPoseActionData* GetPoseActionData;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetPoseActionData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalActionData GetSkeletalActionData
    // Size: 0x8
    // Offset: 0x40
    ::OVR::OpenVR::IVRInput::_GetSkeletalActionData* GetSkeletalActionData;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetSkeletalActionData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneData GetSkeletalBoneData
    // Size: 0x8
    // Offset: 0x48
    ::OVR::OpenVR::IVRInput::_GetSkeletalBoneData* GetSkeletalBoneData;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetSkeletalBoneData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneDataCompressed GetSkeletalBoneDataCompressed
    // Size: 0x8
    // Offset: 0x50
    ::OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed* GetSkeletalBoneDataCompressed;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._DecompressSkeletalBoneData DecompressSkeletalBoneData
    // Size: 0x8
    // Offset: 0x58
    ::OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData* DecompressSkeletalBoneData;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._TriggerHapticVibrationAction TriggerHapticVibrationAction
    // Size: 0x8
    // Offset: 0x60
    ::OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction* TriggerHapticVibrationAction;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionOrigins GetActionOrigins
    // Size: 0x8
    // Offset: 0x68
    ::OVR::OpenVR::IVRInput::_GetActionOrigins* GetActionOrigins;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetActionOrigins*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginLocalizedName GetOriginLocalizedName
    // Size: 0x8
    // Offset: 0x70
    ::OVR::OpenVR::IVRInput::_GetOriginLocalizedName* GetOriginLocalizedName;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetOriginLocalizedName*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginTrackedDeviceInfo GetOriginTrackedDeviceInfo
    // Size: 0x8
    // Offset: 0x78
    ::OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo* GetOriginTrackedDeviceInfo;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._ShowActionOrigins ShowActionOrigins
    // Size: 0x8
    // Offset: 0x80
    ::OVR::OpenVR::IVRInput::_ShowActionOrigins* ShowActionOrigins;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_ShowActionOrigins*) == 0x8);
    // OVR.OpenVR.IVRInput/OVR.OpenVR._ShowBindingsForActionSet ShowBindingsForActionSet
    // Size: 0x8
    // Offset: 0x88
    ::OVR::OpenVR::IVRInput::_ShowBindingsForActionSet* ShowBindingsForActionSet;
    // Field size check
    static_assert(sizeof(::OVR::OpenVR::IVRInput::_ShowBindingsForActionSet*) == 0x8);
    public:
    // Creating value type constructor for type: IVRInput
    constexpr IVRInput(::OVR::OpenVR::IVRInput::_SetActionManifestPath* SetActionManifestPath_ = {}, ::OVR::OpenVR::IVRInput::_GetActionSetHandle* GetActionSetHandle_ = {}, ::OVR::OpenVR::IVRInput::_GetActionHandle* GetActionHandle_ = {}, ::OVR::OpenVR::IVRInput::_GetInputSourceHandle* GetInputSourceHandle_ = {}, ::OVR::OpenVR::IVRInput::_UpdateActionState* UpdateActionState_ = {}, ::OVR::OpenVR::IVRInput::_GetDigitalActionData* GetDigitalActionData_ = {}, ::OVR::OpenVR::IVRInput::_GetAnalogActionData* GetAnalogActionData_ = {}, ::OVR::OpenVR::IVRInput::_GetPoseActionData* GetPoseActionData_ = {}, ::OVR::OpenVR::IVRInput::_GetSkeletalActionData* GetSkeletalActionData_ = {}, ::OVR::OpenVR::IVRInput::_GetSkeletalBoneData* GetSkeletalBoneData_ = {}, ::OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed* GetSkeletalBoneDataCompressed_ = {}, ::OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData* DecompressSkeletalBoneData_ = {}, ::OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction* TriggerHapticVibrationAction_ = {}, ::OVR::OpenVR::IVRInput::_GetActionOrigins* GetActionOrigins_ = {}, ::OVR::OpenVR::IVRInput::_GetOriginLocalizedName* GetOriginLocalizedName_ = {}, ::OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo* GetOriginTrackedDeviceInfo_ = {}, ::OVR::OpenVR::IVRInput::_ShowActionOrigins* ShowActionOrigins_ = {}, ::OVR::OpenVR::IVRInput::_ShowBindingsForActionSet* ShowBindingsForActionSet_ = {}) noexcept : SetActionManifestPath{SetActionManifestPath_}, GetActionSetHandle{GetActionSetHandle_}, GetActionHandle{GetActionHandle_}, GetInputSourceHandle{GetInputSourceHandle_}, UpdateActionState{UpdateActionState_}, GetDigitalActionData{GetDigitalActionData_}, GetAnalogActionData{GetAnalogActionData_}, GetPoseActionData{GetPoseActionData_}, GetSkeletalActionData{GetSkeletalActionData_}, GetSkeletalBoneData{GetSkeletalBoneData_}, GetSkeletalBoneDataCompressed{GetSkeletalBoneDataCompressed_}, DecompressSkeletalBoneData{DecompressSkeletalBoneData_}, TriggerHapticVibrationAction{TriggerHapticVibrationAction_}, GetActionOrigins{GetActionOrigins_}, GetOriginLocalizedName{GetOriginLocalizedName_}, GetOriginTrackedDeviceInfo{GetOriginTrackedDeviceInfo_}, ShowActionOrigins{ShowActionOrigins_}, ShowBindingsForActionSet{ShowBindingsForActionSet_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._SetActionManifestPath SetActionManifestPath
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_SetActionManifestPath*& dyn_SetActionManifestPath();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionSetHandle GetActionSetHandle
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetActionSetHandle*& dyn_GetActionSetHandle();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionHandle GetActionHandle
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetActionHandle*& dyn_GetActionHandle();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetInputSourceHandle GetInputSourceHandle
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetInputSourceHandle*& dyn_GetInputSourceHandle();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._UpdateActionState UpdateActionState
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_UpdateActionState*& dyn_UpdateActionState();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetDigitalActionData GetDigitalActionData
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetDigitalActionData*& dyn_GetDigitalActionData();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetAnalogActionData GetAnalogActionData
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetAnalogActionData*& dyn_GetAnalogActionData();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetPoseActionData GetPoseActionData
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetPoseActionData*& dyn_GetPoseActionData();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalActionData GetSkeletalActionData
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetSkeletalActionData*& dyn_GetSkeletalActionData();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneData GetSkeletalBoneData
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetSkeletalBoneData*& dyn_GetSkeletalBoneData();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetSkeletalBoneDataCompressed GetSkeletalBoneDataCompressed
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetSkeletalBoneDataCompressed*& dyn_GetSkeletalBoneDataCompressed();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._DecompressSkeletalBoneData DecompressSkeletalBoneData
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_DecompressSkeletalBoneData*& dyn_DecompressSkeletalBoneData();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._TriggerHapticVibrationAction TriggerHapticVibrationAction
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_TriggerHapticVibrationAction*& dyn_TriggerHapticVibrationAction();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetActionOrigins GetActionOrigins
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetActionOrigins*& dyn_GetActionOrigins();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginLocalizedName GetOriginLocalizedName
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetOriginLocalizedName*& dyn_GetOriginLocalizedName();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._GetOriginTrackedDeviceInfo GetOriginTrackedDeviceInfo
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_GetOriginTrackedDeviceInfo*& dyn_GetOriginTrackedDeviceInfo();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._ShowActionOrigins ShowActionOrigins
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_ShowActionOrigins*& dyn_ShowActionOrigins();
    // Get instance field reference: OVR.OpenVR.IVRInput/OVR.OpenVR._ShowBindingsForActionSet ShowBindingsForActionSet
    [[deprecated("Use field access instead!")]] ::OVR::OpenVR::IVRInput::_ShowBindingsForActionSet*& dyn_ShowBindingsForActionSet();
  }; // OVR.OpenVR.IVRInput
  #pragma pack(pop)
  static check_size<sizeof(IVRInput), 136 + sizeof(::OVR::OpenVR::IVRInput::_ShowBindingsForActionSet*)> __OVR_OpenVR_IVRInputSizeCheck;
  static_assert(sizeof(IVRInput) == 0x90);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
