// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Size: 0x98
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVR.OpenVR.IVRRenderModels
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRRenderModels/*, public System::ValueType*/ {
    public:
    // Nested type: OVR::OpenVR::IVRRenderModels::_LoadRenderModel_Async
    class _LoadRenderModel_Async;
    // Nested type: OVR::OpenVR::IVRRenderModels::_FreeRenderModel
    class _FreeRenderModel;
    // Nested type: OVR::OpenVR::IVRRenderModels::_LoadTexture_Async
    class _LoadTexture_Async;
    // Nested type: OVR::OpenVR::IVRRenderModels::_FreeTexture
    class _FreeTexture;
    // Nested type: OVR::OpenVR::IVRRenderModels::_LoadTextureD3D11_Async
    class _LoadTextureD3D11_Async;
    // Nested type: OVR::OpenVR::IVRRenderModels::_LoadIntoTextureD3D11_Async
    class _LoadIntoTextureD3D11_Async;
    // Nested type: OVR::OpenVR::IVRRenderModels::_FreeTextureD3D11
    class _FreeTextureD3D11;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetRenderModelName
    class _GetRenderModelName;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetRenderModelCount
    class _GetRenderModelCount;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetComponentCount
    class _GetComponentCount;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetComponentName
    class _GetComponentName;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetComponentButtonMask
    class _GetComponentButtonMask;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetComponentRenderModelName
    class _GetComponentRenderModelName;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetComponentStateForDevicePath
    class _GetComponentStateForDevicePath;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetComponentState
    class _GetComponentState;
    // Nested type: OVR::OpenVR::IVRRenderModels::_RenderModelHasComponent
    class _RenderModelHasComponent;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetRenderModelThumbnailURL
    class _GetRenderModelThumbnailURL;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetRenderModelOriginalPath
    class _GetRenderModelOriginalPath;
    // Nested type: OVR::OpenVR::IVRRenderModels::_GetRenderModelErrorNameFromEnum
    class _GetRenderModelErrorNameFromEnum;
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadRenderModel_Async LoadRenderModel_Async
    // Size: 0x8
    // Offset: 0x0
    OVR::OpenVR::IVRRenderModels::_LoadRenderModel_Async* LoadRenderModel_Async;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_LoadRenderModel_Async*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._FreeRenderModel FreeRenderModel
    // Size: 0x8
    // Offset: 0x8
    OVR::OpenVR::IVRRenderModels::_FreeRenderModel* FreeRenderModel;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_FreeRenderModel*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadTexture_Async LoadTexture_Async
    // Size: 0x8
    // Offset: 0x10
    OVR::OpenVR::IVRRenderModels::_LoadTexture_Async* LoadTexture_Async;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_LoadTexture_Async*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._FreeTexture FreeTexture
    // Size: 0x8
    // Offset: 0x18
    OVR::OpenVR::IVRRenderModels::_FreeTexture* FreeTexture;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_FreeTexture*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadTextureD3D11_Async LoadTextureD3D11_Async
    // Size: 0x8
    // Offset: 0x20
    OVR::OpenVR::IVRRenderModels::_LoadTextureD3D11_Async* LoadTextureD3D11_Async;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_LoadTextureD3D11_Async*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadIntoTextureD3D11_Async LoadIntoTextureD3D11_Async
    // Size: 0x8
    // Offset: 0x28
    OVR::OpenVR::IVRRenderModels::_LoadIntoTextureD3D11_Async* LoadIntoTextureD3D11_Async;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_LoadIntoTextureD3D11_Async*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._FreeTextureD3D11 FreeTextureD3D11
    // Size: 0x8
    // Offset: 0x30
    OVR::OpenVR::IVRRenderModels::_FreeTextureD3D11* FreeTextureD3D11;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_FreeTextureD3D11*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelName GetRenderModelName
    // Size: 0x8
    // Offset: 0x38
    OVR::OpenVR::IVRRenderModels::_GetRenderModelName* GetRenderModelName;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetRenderModelName*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelCount GetRenderModelCount
    // Size: 0x8
    // Offset: 0x40
    OVR::OpenVR::IVRRenderModels::_GetRenderModelCount* GetRenderModelCount;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetRenderModelCount*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentCount GetComponentCount
    // Size: 0x8
    // Offset: 0x48
    OVR::OpenVR::IVRRenderModels::_GetComponentCount* GetComponentCount;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetComponentCount*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentName GetComponentName
    // Size: 0x8
    // Offset: 0x50
    OVR::OpenVR::IVRRenderModels::_GetComponentName* GetComponentName;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetComponentName*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentButtonMask GetComponentButtonMask
    // Size: 0x8
    // Offset: 0x58
    OVR::OpenVR::IVRRenderModels::_GetComponentButtonMask* GetComponentButtonMask;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetComponentButtonMask*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentRenderModelName GetComponentRenderModelName
    // Size: 0x8
    // Offset: 0x60
    OVR::OpenVR::IVRRenderModels::_GetComponentRenderModelName* GetComponentRenderModelName;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetComponentRenderModelName*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentStateForDevicePath GetComponentStateForDevicePath
    // Size: 0x8
    // Offset: 0x68
    OVR::OpenVR::IVRRenderModels::_GetComponentStateForDevicePath* GetComponentStateForDevicePath;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetComponentStateForDevicePath*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentState GetComponentState
    // Size: 0x8
    // Offset: 0x70
    OVR::OpenVR::IVRRenderModels::_GetComponentState* GetComponentState;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetComponentState*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._RenderModelHasComponent RenderModelHasComponent
    // Size: 0x8
    // Offset: 0x78
    OVR::OpenVR::IVRRenderModels::_RenderModelHasComponent* RenderModelHasComponent;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_RenderModelHasComponent*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelThumbnailURL GetRenderModelThumbnailURL
    // Size: 0x8
    // Offset: 0x80
    OVR::OpenVR::IVRRenderModels::_GetRenderModelThumbnailURL* GetRenderModelThumbnailURL;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetRenderModelThumbnailURL*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelOriginalPath GetRenderModelOriginalPath
    // Size: 0x8
    // Offset: 0x88
    OVR::OpenVR::IVRRenderModels::_GetRenderModelOriginalPath* GetRenderModelOriginalPath;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetRenderModelOriginalPath*) == 0x8);
    // OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelErrorNameFromEnum GetRenderModelErrorNameFromEnum
    // Size: 0x8
    // Offset: 0x90
    OVR::OpenVR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* GetRenderModelErrorNameFromEnum;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRRenderModels::_GetRenderModelErrorNameFromEnum*) == 0x8);
    // Creating value type constructor for type: IVRRenderModels
    constexpr IVRRenderModels(OVR::OpenVR::IVRRenderModels::_LoadRenderModel_Async* LoadRenderModel_Async_ = {}, OVR::OpenVR::IVRRenderModels::_FreeRenderModel* FreeRenderModel_ = {}, OVR::OpenVR::IVRRenderModels::_LoadTexture_Async* LoadTexture_Async_ = {}, OVR::OpenVR::IVRRenderModels::_FreeTexture* FreeTexture_ = {}, OVR::OpenVR::IVRRenderModels::_LoadTextureD3D11_Async* LoadTextureD3D11_Async_ = {}, OVR::OpenVR::IVRRenderModels::_LoadIntoTextureD3D11_Async* LoadIntoTextureD3D11_Async_ = {}, OVR::OpenVR::IVRRenderModels::_FreeTextureD3D11* FreeTextureD3D11_ = {}, OVR::OpenVR::IVRRenderModels::_GetRenderModelName* GetRenderModelName_ = {}, OVR::OpenVR::IVRRenderModels::_GetRenderModelCount* GetRenderModelCount_ = {}, OVR::OpenVR::IVRRenderModels::_GetComponentCount* GetComponentCount_ = {}, OVR::OpenVR::IVRRenderModels::_GetComponentName* GetComponentName_ = {}, OVR::OpenVR::IVRRenderModels::_GetComponentButtonMask* GetComponentButtonMask_ = {}, OVR::OpenVR::IVRRenderModels::_GetComponentRenderModelName* GetComponentRenderModelName_ = {}, OVR::OpenVR::IVRRenderModels::_GetComponentStateForDevicePath* GetComponentStateForDevicePath_ = {}, OVR::OpenVR::IVRRenderModels::_GetComponentState* GetComponentState_ = {}, OVR::OpenVR::IVRRenderModels::_RenderModelHasComponent* RenderModelHasComponent_ = {}, OVR::OpenVR::IVRRenderModels::_GetRenderModelThumbnailURL* GetRenderModelThumbnailURL_ = {}, OVR::OpenVR::IVRRenderModels::_GetRenderModelOriginalPath* GetRenderModelOriginalPath_ = {}, OVR::OpenVR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* GetRenderModelErrorNameFromEnum_ = {}) noexcept : LoadRenderModel_Async{LoadRenderModel_Async_}, FreeRenderModel{FreeRenderModel_}, LoadTexture_Async{LoadTexture_Async_}, FreeTexture{FreeTexture_}, LoadTextureD3D11_Async{LoadTextureD3D11_Async_}, LoadIntoTextureD3D11_Async{LoadIntoTextureD3D11_Async_}, FreeTextureD3D11{FreeTextureD3D11_}, GetRenderModelName{GetRenderModelName_}, GetRenderModelCount{GetRenderModelCount_}, GetComponentCount{GetComponentCount_}, GetComponentName{GetComponentName_}, GetComponentButtonMask{GetComponentButtonMask_}, GetComponentRenderModelName{GetComponentRenderModelName_}, GetComponentStateForDevicePath{GetComponentStateForDevicePath_}, GetComponentState{GetComponentState_}, RenderModelHasComponent{RenderModelHasComponent_}, GetRenderModelThumbnailURL{GetRenderModelThumbnailURL_}, GetRenderModelOriginalPath{GetRenderModelOriginalPath_}, GetRenderModelErrorNameFromEnum{GetRenderModelErrorNameFromEnum_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadRenderModel_Async LoadRenderModel_Async
    OVR::OpenVR::IVRRenderModels::_LoadRenderModel_Async* _get_LoadRenderModel_Async();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadRenderModel_Async LoadRenderModel_Async
    void _set_LoadRenderModel_Async(OVR::OpenVR::IVRRenderModels::_LoadRenderModel_Async* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._FreeRenderModel FreeRenderModel
    OVR::OpenVR::IVRRenderModels::_FreeRenderModel* _get_FreeRenderModel();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._FreeRenderModel FreeRenderModel
    void _set_FreeRenderModel(OVR::OpenVR::IVRRenderModels::_FreeRenderModel* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadTexture_Async LoadTexture_Async
    OVR::OpenVR::IVRRenderModels::_LoadTexture_Async* _get_LoadTexture_Async();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadTexture_Async LoadTexture_Async
    void _set_LoadTexture_Async(OVR::OpenVR::IVRRenderModels::_LoadTexture_Async* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._FreeTexture FreeTexture
    OVR::OpenVR::IVRRenderModels::_FreeTexture* _get_FreeTexture();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._FreeTexture FreeTexture
    void _set_FreeTexture(OVR::OpenVR::IVRRenderModels::_FreeTexture* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadTextureD3D11_Async LoadTextureD3D11_Async
    OVR::OpenVR::IVRRenderModels::_LoadTextureD3D11_Async* _get_LoadTextureD3D11_Async();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadTextureD3D11_Async LoadTextureD3D11_Async
    void _set_LoadTextureD3D11_Async(OVR::OpenVR::IVRRenderModels::_LoadTextureD3D11_Async* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadIntoTextureD3D11_Async LoadIntoTextureD3D11_Async
    OVR::OpenVR::IVRRenderModels::_LoadIntoTextureD3D11_Async* _get_LoadIntoTextureD3D11_Async();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._LoadIntoTextureD3D11_Async LoadIntoTextureD3D11_Async
    void _set_LoadIntoTextureD3D11_Async(OVR::OpenVR::IVRRenderModels::_LoadIntoTextureD3D11_Async* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._FreeTextureD3D11 FreeTextureD3D11
    OVR::OpenVR::IVRRenderModels::_FreeTextureD3D11* _get_FreeTextureD3D11();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._FreeTextureD3D11 FreeTextureD3D11
    void _set_FreeTextureD3D11(OVR::OpenVR::IVRRenderModels::_FreeTextureD3D11* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelName GetRenderModelName
    OVR::OpenVR::IVRRenderModels::_GetRenderModelName* _get_GetRenderModelName();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelName GetRenderModelName
    void _set_GetRenderModelName(OVR::OpenVR::IVRRenderModels::_GetRenderModelName* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelCount GetRenderModelCount
    OVR::OpenVR::IVRRenderModels::_GetRenderModelCount* _get_GetRenderModelCount();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelCount GetRenderModelCount
    void _set_GetRenderModelCount(OVR::OpenVR::IVRRenderModels::_GetRenderModelCount* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentCount GetComponentCount
    OVR::OpenVR::IVRRenderModels::_GetComponentCount* _get_GetComponentCount();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentCount GetComponentCount
    void _set_GetComponentCount(OVR::OpenVR::IVRRenderModels::_GetComponentCount* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentName GetComponentName
    OVR::OpenVR::IVRRenderModels::_GetComponentName* _get_GetComponentName();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentName GetComponentName
    void _set_GetComponentName(OVR::OpenVR::IVRRenderModels::_GetComponentName* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentButtonMask GetComponentButtonMask
    OVR::OpenVR::IVRRenderModels::_GetComponentButtonMask* _get_GetComponentButtonMask();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentButtonMask GetComponentButtonMask
    void _set_GetComponentButtonMask(OVR::OpenVR::IVRRenderModels::_GetComponentButtonMask* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentRenderModelName GetComponentRenderModelName
    OVR::OpenVR::IVRRenderModels::_GetComponentRenderModelName* _get_GetComponentRenderModelName();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentRenderModelName GetComponentRenderModelName
    void _set_GetComponentRenderModelName(OVR::OpenVR::IVRRenderModels::_GetComponentRenderModelName* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentStateForDevicePath GetComponentStateForDevicePath
    OVR::OpenVR::IVRRenderModels::_GetComponentStateForDevicePath* _get_GetComponentStateForDevicePath();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentStateForDevicePath GetComponentStateForDevicePath
    void _set_GetComponentStateForDevicePath(OVR::OpenVR::IVRRenderModels::_GetComponentStateForDevicePath* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentState GetComponentState
    OVR::OpenVR::IVRRenderModels::_GetComponentState* _get_GetComponentState();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetComponentState GetComponentState
    void _set_GetComponentState(OVR::OpenVR::IVRRenderModels::_GetComponentState* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._RenderModelHasComponent RenderModelHasComponent
    OVR::OpenVR::IVRRenderModels::_RenderModelHasComponent* _get_RenderModelHasComponent();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._RenderModelHasComponent RenderModelHasComponent
    void _set_RenderModelHasComponent(OVR::OpenVR::IVRRenderModels::_RenderModelHasComponent* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelThumbnailURL GetRenderModelThumbnailURL
    OVR::OpenVR::IVRRenderModels::_GetRenderModelThumbnailURL* _get_GetRenderModelThumbnailURL();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelThumbnailURL GetRenderModelThumbnailURL
    void _set_GetRenderModelThumbnailURL(OVR::OpenVR::IVRRenderModels::_GetRenderModelThumbnailURL* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelOriginalPath GetRenderModelOriginalPath
    OVR::OpenVR::IVRRenderModels::_GetRenderModelOriginalPath* _get_GetRenderModelOriginalPath();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelOriginalPath GetRenderModelOriginalPath
    void _set_GetRenderModelOriginalPath(OVR::OpenVR::IVRRenderModels::_GetRenderModelOriginalPath* value);
    // Get instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelErrorNameFromEnum GetRenderModelErrorNameFromEnum
    OVR::OpenVR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* _get_GetRenderModelErrorNameFromEnum();
    // Set instance field: OVR.OpenVR.IVRRenderModels/OVR.OpenVR._GetRenderModelErrorNameFromEnum GetRenderModelErrorNameFromEnum
    void _set_GetRenderModelErrorNameFromEnum(OVR::OpenVR::IVRRenderModels::_GetRenderModelErrorNameFromEnum* value);
  }; // OVR.OpenVR.IVRRenderModels
  #pragma pack(pop)
  static check_size<sizeof(IVRRenderModels), 144 + sizeof(OVR::OpenVR::IVRRenderModels::_GetRenderModelErrorNameFromEnum*)> __OVR_OpenVR_IVRRenderModelsSizeCheck;
  static_assert(sizeof(IVRRenderModels) == 0x98);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::IVRRenderModels, "OVR.OpenVR", "IVRRenderModels");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
