// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Autogenerated type: OVR.OpenVR.IVRSettings
  struct IVRSettings : public System::ValueType {
    public:
    // Nested type: OVR::OpenVR::IVRSettings::_GetSettingsErrorNameFromEnum
    class _GetSettingsErrorNameFromEnum;
    // Nested type: OVR::OpenVR::IVRSettings::_Sync
    class _Sync;
    // Nested type: OVR::OpenVR::IVRSettings::_SetBool
    class _SetBool;
    // Nested type: OVR::OpenVR::IVRSettings::_SetInt32
    class _SetInt32;
    // Nested type: OVR::OpenVR::IVRSettings::_SetFloat
    class _SetFloat;
    // Nested type: OVR::OpenVR::IVRSettings::_SetString
    class _SetString;
    // Nested type: OVR::OpenVR::IVRSettings::_GetBool
    class _GetBool;
    // Nested type: OVR::OpenVR::IVRSettings::_GetInt32
    class _GetInt32;
    // Nested type: OVR::OpenVR::IVRSettings::_GetFloat
    class _GetFloat;
    // Nested type: OVR::OpenVR::IVRSettings::_GetString
    class _GetString;
    // Nested type: OVR::OpenVR::IVRSettings::_RemoveSection
    class _RemoveSection;
    // Nested type: OVR::OpenVR::IVRSettings::_RemoveKeyInSection
    class _RemoveKeyInSection;
    // OVR.OpenVR.IVRSettings/_GetSettingsErrorNameFromEnum GetSettingsErrorNameFromEnum
    // Offset: 0x0
    OVR::OpenVR::IVRSettings::_GetSettingsErrorNameFromEnum* GetSettingsErrorNameFromEnum;
    // OVR.OpenVR.IVRSettings/_Sync Sync
    // Offset: 0x8
    OVR::OpenVR::IVRSettings::_Sync* Sync;
    // OVR.OpenVR.IVRSettings/_SetBool SetBool
    // Offset: 0x10
    OVR::OpenVR::IVRSettings::_SetBool* SetBool;
    // OVR.OpenVR.IVRSettings/_SetInt32 SetInt32
    // Offset: 0x18
    OVR::OpenVR::IVRSettings::_SetInt32* SetInt32;
    // OVR.OpenVR.IVRSettings/_SetFloat SetFloat
    // Offset: 0x20
    OVR::OpenVR::IVRSettings::_SetFloat* SetFloat;
    // OVR.OpenVR.IVRSettings/_SetString SetString
    // Offset: 0x28
    OVR::OpenVR::IVRSettings::_SetString* SetString;
    // OVR.OpenVR.IVRSettings/_GetBool GetBool
    // Offset: 0x30
    OVR::OpenVR::IVRSettings::_GetBool* GetBool;
    // OVR.OpenVR.IVRSettings/_GetInt32 GetInt32
    // Offset: 0x38
    OVR::OpenVR::IVRSettings::_GetInt32* GetInt32;
    // OVR.OpenVR.IVRSettings/_GetFloat GetFloat
    // Offset: 0x40
    OVR::OpenVR::IVRSettings::_GetFloat* GetFloat;
    // OVR.OpenVR.IVRSettings/_GetString GetString
    // Offset: 0x48
    OVR::OpenVR::IVRSettings::_GetString* GetString;
    // OVR.OpenVR.IVRSettings/_RemoveSection RemoveSection
    // Offset: 0x50
    OVR::OpenVR::IVRSettings::_RemoveSection* RemoveSection;
    // OVR.OpenVR.IVRSettings/_RemoveKeyInSection RemoveKeyInSection
    // Offset: 0x58
    OVR::OpenVR::IVRSettings::_RemoveKeyInSection* RemoveKeyInSection;
    // Creating value type constructor for type: IVRSettings
    constexpr IVRSettings(OVR::OpenVR::IVRSettings::_GetSettingsErrorNameFromEnum* GetSettingsErrorNameFromEnum_ = {}, OVR::OpenVR::IVRSettings::_Sync* Sync_ = {}, OVR::OpenVR::IVRSettings::_SetBool* SetBool_ = {}, OVR::OpenVR::IVRSettings::_SetInt32* SetInt32_ = {}, OVR::OpenVR::IVRSettings::_SetFloat* SetFloat_ = {}, OVR::OpenVR::IVRSettings::_SetString* SetString_ = {}, OVR::OpenVR::IVRSettings::_GetBool* GetBool_ = {}, OVR::OpenVR::IVRSettings::_GetInt32* GetInt32_ = {}, OVR::OpenVR::IVRSettings::_GetFloat* GetFloat_ = {}, OVR::OpenVR::IVRSettings::_GetString* GetString_ = {}, OVR::OpenVR::IVRSettings::_RemoveSection* RemoveSection_ = {}, OVR::OpenVR::IVRSettings::_RemoveKeyInSection* RemoveKeyInSection_ = {}) noexcept : GetSettingsErrorNameFromEnum{GetSettingsErrorNameFromEnum_}, Sync{Sync_}, SetBool{SetBool_}, SetInt32{SetInt32_}, SetFloat{SetFloat_}, SetString{SetString_}, GetBool{GetBool_}, GetInt32{GetInt32_}, GetFloat{GetFloat_}, GetString{GetString_}, RemoveSection{RemoveSection_}, RemoveKeyInSection{RemoveKeyInSection_} {}
  }; // OVR.OpenVR.IVRSettings
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::IVRSettings, "OVR.OpenVR", "IVRSettings");
#pragma pack(pop)
