// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "extern/beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Size: 0x60
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVR.OpenVR.IVRSettings
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRSettings/*, public System::ValueType*/ {
    public:
    // Nested type: OVR::OpenVR::IVRSettings::_GetSettingsErrorNameFromEnum
    class _GetSettingsErrorNameFromEnum;
    // Nested type: OVR::OpenVR::IVRSettings::_Sync
    class _Sync;
    // Nested type: OVR::OpenVR::IVRSettings::_SetBool
    class _SetBool;
    // Nested type: OVR::OpenVR::IVRSettings::_SetInt32
    class _SetInt32;
    // Nested type: OVR::OpenVR::IVRSettings::_SetFloat
    class _SetFloat;
    // Nested type: OVR::OpenVR::IVRSettings::_SetString
    class _SetString;
    // Nested type: OVR::OpenVR::IVRSettings::_GetBool
    class _GetBool;
    // Nested type: OVR::OpenVR::IVRSettings::_GetInt32
    class _GetInt32;
    // Nested type: OVR::OpenVR::IVRSettings::_GetFloat
    class _GetFloat;
    // Nested type: OVR::OpenVR::IVRSettings::_GetString
    class _GetString;
    // Nested type: OVR::OpenVR::IVRSettings::_RemoveSection
    class _RemoveSection;
    // Nested type: OVR::OpenVR::IVRSettings::_RemoveKeyInSection
    class _RemoveKeyInSection;
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._GetSettingsErrorNameFromEnum GetSettingsErrorNameFromEnum
    // Size: 0x8
    // Offset: 0x0
    OVR::OpenVR::IVRSettings::_GetSettingsErrorNameFromEnum* GetSettingsErrorNameFromEnum;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_GetSettingsErrorNameFromEnum*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._Sync Sync
    // Size: 0x8
    // Offset: 0x8
    OVR::OpenVR::IVRSettings::_Sync* Sync;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_Sync*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._SetBool SetBool
    // Size: 0x8
    // Offset: 0x10
    OVR::OpenVR::IVRSettings::_SetBool* SetBool;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_SetBool*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._SetInt32 SetInt32
    // Size: 0x8
    // Offset: 0x18
    OVR::OpenVR::IVRSettings::_SetInt32* SetInt32;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_SetInt32*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._SetFloat SetFloat
    // Size: 0x8
    // Offset: 0x20
    OVR::OpenVR::IVRSettings::_SetFloat* SetFloat;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_SetFloat*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._SetString SetString
    // Size: 0x8
    // Offset: 0x28
    OVR::OpenVR::IVRSettings::_SetString* SetString;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_SetString*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._GetBool GetBool
    // Size: 0x8
    // Offset: 0x30
    OVR::OpenVR::IVRSettings::_GetBool* GetBool;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_GetBool*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._GetInt32 GetInt32
    // Size: 0x8
    // Offset: 0x38
    OVR::OpenVR::IVRSettings::_GetInt32* GetInt32;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_GetInt32*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._GetFloat GetFloat
    // Size: 0x8
    // Offset: 0x40
    OVR::OpenVR::IVRSettings::_GetFloat* GetFloat;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_GetFloat*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._GetString GetString
    // Size: 0x8
    // Offset: 0x48
    OVR::OpenVR::IVRSettings::_GetString* GetString;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_GetString*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._RemoveSection RemoveSection
    // Size: 0x8
    // Offset: 0x50
    OVR::OpenVR::IVRSettings::_RemoveSection* RemoveSection;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_RemoveSection*) == 0x8);
    // OVR.OpenVR.IVRSettings/OVR.OpenVR._RemoveKeyInSection RemoveKeyInSection
    // Size: 0x8
    // Offset: 0x58
    OVR::OpenVR::IVRSettings::_RemoveKeyInSection* RemoveKeyInSection;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::IVRSettings::_RemoveKeyInSection*) == 0x8);
    // Creating value type constructor for type: IVRSettings
    constexpr IVRSettings(OVR::OpenVR::IVRSettings::_GetSettingsErrorNameFromEnum* GetSettingsErrorNameFromEnum_ = {}, OVR::OpenVR::IVRSettings::_Sync* Sync_ = {}, OVR::OpenVR::IVRSettings::_SetBool* SetBool_ = {}, OVR::OpenVR::IVRSettings::_SetInt32* SetInt32_ = {}, OVR::OpenVR::IVRSettings::_SetFloat* SetFloat_ = {}, OVR::OpenVR::IVRSettings::_SetString* SetString_ = {}, OVR::OpenVR::IVRSettings::_GetBool* GetBool_ = {}, OVR::OpenVR::IVRSettings::_GetInt32* GetInt32_ = {}, OVR::OpenVR::IVRSettings::_GetFloat* GetFloat_ = {}, OVR::OpenVR::IVRSettings::_GetString* GetString_ = {}, OVR::OpenVR::IVRSettings::_RemoveSection* RemoveSection_ = {}, OVR::OpenVR::IVRSettings::_RemoveKeyInSection* RemoveKeyInSection_ = {}) noexcept : GetSettingsErrorNameFromEnum{GetSettingsErrorNameFromEnum_}, Sync{Sync_}, SetBool{SetBool_}, SetInt32{SetInt32_}, SetFloat{SetFloat_}, SetString{SetString_}, GetBool{GetBool_}, GetInt32{GetInt32_}, GetFloat{GetFloat_}, GetString{GetString_}, RemoveSection{RemoveSection_}, RemoveKeyInSection{RemoveKeyInSection_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetSettingsErrorNameFromEnum GetSettingsErrorNameFromEnum
    OVR::OpenVR::IVRSettings::_GetSettingsErrorNameFromEnum* _get_GetSettingsErrorNameFromEnum();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetSettingsErrorNameFromEnum GetSettingsErrorNameFromEnum
    void _set_GetSettingsErrorNameFromEnum(OVR::OpenVR::IVRSettings::_GetSettingsErrorNameFromEnum* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._Sync Sync
    OVR::OpenVR::IVRSettings::_Sync* _get_Sync();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._Sync Sync
    void _set_Sync(OVR::OpenVR::IVRSettings::_Sync* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._SetBool SetBool
    OVR::OpenVR::IVRSettings::_SetBool* _get_SetBool();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._SetBool SetBool
    void _set_SetBool(OVR::OpenVR::IVRSettings::_SetBool* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._SetInt32 SetInt32
    OVR::OpenVR::IVRSettings::_SetInt32* _get_SetInt32();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._SetInt32 SetInt32
    void _set_SetInt32(OVR::OpenVR::IVRSettings::_SetInt32* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._SetFloat SetFloat
    OVR::OpenVR::IVRSettings::_SetFloat* _get_SetFloat();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._SetFloat SetFloat
    void _set_SetFloat(OVR::OpenVR::IVRSettings::_SetFloat* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._SetString SetString
    OVR::OpenVR::IVRSettings::_SetString* _get_SetString();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._SetString SetString
    void _set_SetString(OVR::OpenVR::IVRSettings::_SetString* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetBool GetBool
    OVR::OpenVR::IVRSettings::_GetBool* _get_GetBool();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetBool GetBool
    void _set_GetBool(OVR::OpenVR::IVRSettings::_GetBool* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetInt32 GetInt32
    OVR::OpenVR::IVRSettings::_GetInt32* _get_GetInt32();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetInt32 GetInt32
    void _set_GetInt32(OVR::OpenVR::IVRSettings::_GetInt32* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetFloat GetFloat
    OVR::OpenVR::IVRSettings::_GetFloat* _get_GetFloat();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetFloat GetFloat
    void _set_GetFloat(OVR::OpenVR::IVRSettings::_GetFloat* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetString GetString
    OVR::OpenVR::IVRSettings::_GetString* _get_GetString();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._GetString GetString
    void _set_GetString(OVR::OpenVR::IVRSettings::_GetString* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._RemoveSection RemoveSection
    OVR::OpenVR::IVRSettings::_RemoveSection* _get_RemoveSection();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._RemoveSection RemoveSection
    void _set_RemoveSection(OVR::OpenVR::IVRSettings::_RemoveSection* value);
    // Get instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._RemoveKeyInSection RemoveKeyInSection
    OVR::OpenVR::IVRSettings::_RemoveKeyInSection* _get_RemoveKeyInSection();
    // Set instance field: OVR.OpenVR.IVRSettings/OVR.OpenVR._RemoveKeyInSection RemoveKeyInSection
    void _set_RemoveKeyInSection(OVR::OpenVR::IVRSettings::_RemoveKeyInSection* value);
  }; // OVR.OpenVR.IVRSettings
  #pragma pack(pop)
  static check_size<sizeof(IVRSettings), 88 + sizeof(OVR::OpenVR::IVRSettings::_RemoveKeyInSection*)> __OVR_OpenVR_IVRSettingsSizeCheck;
  static_assert(sizeof(IVRSettings) == 0x60);
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::IVRSettings, "OVR.OpenVR", "IVRSettings");
#include "extern/beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
