// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Autogenerated type: OVR.OpenVR.IVRTrackedCamera
  struct IVRTrackedCamera : public System::ValueType {
    public:
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_GetCameraErrorNameFromEnum
    class _GetCameraErrorNameFromEnum;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_HasCamera
    class _HasCamera;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_GetCameraFrameSize
    class _GetCameraFrameSize;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_GetCameraIntrinsics
    class _GetCameraIntrinsics;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_GetCameraProjection
    class _GetCameraProjection;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_AcquireVideoStreamingService
    class _AcquireVideoStreamingService;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_ReleaseVideoStreamingService
    class _ReleaseVideoStreamingService;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamFrameBuffer
    class _GetVideoStreamFrameBuffer;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamTextureSize
    class _GetVideoStreamTextureSize;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamTextureD3D11
    class _GetVideoStreamTextureD3D11;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamTextureGL
    class _GetVideoStreamTextureGL;
    // Nested type: OVR::OpenVR::IVRTrackedCamera::_ReleaseVideoStreamTextureGL
    class _ReleaseVideoStreamTextureGL;
    // OVR.OpenVR.IVRTrackedCamera/_GetCameraErrorNameFromEnum GetCameraErrorNameFromEnum
    // Offset: 0x0
    OVR::OpenVR::IVRTrackedCamera::_GetCameraErrorNameFromEnum* GetCameraErrorNameFromEnum;
    // OVR.OpenVR.IVRTrackedCamera/_HasCamera HasCamera
    // Offset: 0x8
    OVR::OpenVR::IVRTrackedCamera::_HasCamera* HasCamera;
    // OVR.OpenVR.IVRTrackedCamera/_GetCameraFrameSize GetCameraFrameSize
    // Offset: 0x10
    OVR::OpenVR::IVRTrackedCamera::_GetCameraFrameSize* GetCameraFrameSize;
    // OVR.OpenVR.IVRTrackedCamera/_GetCameraIntrinsics GetCameraIntrinsics
    // Offset: 0x18
    OVR::OpenVR::IVRTrackedCamera::_GetCameraIntrinsics* GetCameraIntrinsics;
    // OVR.OpenVR.IVRTrackedCamera/_GetCameraProjection GetCameraProjection
    // Offset: 0x20
    OVR::OpenVR::IVRTrackedCamera::_GetCameraProjection* GetCameraProjection;
    // OVR.OpenVR.IVRTrackedCamera/_AcquireVideoStreamingService AcquireVideoStreamingService
    // Offset: 0x28
    OVR::OpenVR::IVRTrackedCamera::_AcquireVideoStreamingService* AcquireVideoStreamingService;
    // OVR.OpenVR.IVRTrackedCamera/_ReleaseVideoStreamingService ReleaseVideoStreamingService
    // Offset: 0x30
    OVR::OpenVR::IVRTrackedCamera::_ReleaseVideoStreamingService* ReleaseVideoStreamingService;
    // OVR.OpenVR.IVRTrackedCamera/_GetVideoStreamFrameBuffer GetVideoStreamFrameBuffer
    // Offset: 0x38
    OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamFrameBuffer* GetVideoStreamFrameBuffer;
    // OVR.OpenVR.IVRTrackedCamera/_GetVideoStreamTextureSize GetVideoStreamTextureSize
    // Offset: 0x40
    OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamTextureSize* GetVideoStreamTextureSize;
    // OVR.OpenVR.IVRTrackedCamera/_GetVideoStreamTextureD3D11 GetVideoStreamTextureD3D11
    // Offset: 0x48
    OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamTextureD3D11* GetVideoStreamTextureD3D11;
    // OVR.OpenVR.IVRTrackedCamera/_GetVideoStreamTextureGL GetVideoStreamTextureGL
    // Offset: 0x50
    OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamTextureGL* GetVideoStreamTextureGL;
    // OVR.OpenVR.IVRTrackedCamera/_ReleaseVideoStreamTextureGL ReleaseVideoStreamTextureGL
    // Offset: 0x58
    OVR::OpenVR::IVRTrackedCamera::_ReleaseVideoStreamTextureGL* ReleaseVideoStreamTextureGL;
    // Creating value type constructor for type: IVRTrackedCamera
    constexpr IVRTrackedCamera(OVR::OpenVR::IVRTrackedCamera::_GetCameraErrorNameFromEnum* GetCameraErrorNameFromEnum_ = {}, OVR::OpenVR::IVRTrackedCamera::_HasCamera* HasCamera_ = {}, OVR::OpenVR::IVRTrackedCamera::_GetCameraFrameSize* GetCameraFrameSize_ = {}, OVR::OpenVR::IVRTrackedCamera::_GetCameraIntrinsics* GetCameraIntrinsics_ = {}, OVR::OpenVR::IVRTrackedCamera::_GetCameraProjection* GetCameraProjection_ = {}, OVR::OpenVR::IVRTrackedCamera::_AcquireVideoStreamingService* AcquireVideoStreamingService_ = {}, OVR::OpenVR::IVRTrackedCamera::_ReleaseVideoStreamingService* ReleaseVideoStreamingService_ = {}, OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamFrameBuffer* GetVideoStreamFrameBuffer_ = {}, OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamTextureSize* GetVideoStreamTextureSize_ = {}, OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamTextureD3D11* GetVideoStreamTextureD3D11_ = {}, OVR::OpenVR::IVRTrackedCamera::_GetVideoStreamTextureGL* GetVideoStreamTextureGL_ = {}, OVR::OpenVR::IVRTrackedCamera::_ReleaseVideoStreamTextureGL* ReleaseVideoStreamTextureGL_ = {}) noexcept : GetCameraErrorNameFromEnum{GetCameraErrorNameFromEnum_}, HasCamera{HasCamera_}, GetCameraFrameSize{GetCameraFrameSize_}, GetCameraIntrinsics{GetCameraIntrinsics_}, GetCameraProjection{GetCameraProjection_}, AcquireVideoStreamingService{AcquireVideoStreamingService_}, ReleaseVideoStreamingService{ReleaseVideoStreamingService_}, GetVideoStreamFrameBuffer{GetVideoStreamFrameBuffer_}, GetVideoStreamTextureSize{GetVideoStreamTextureSize_}, GetVideoStreamTextureD3D11{GetVideoStreamTextureD3D11_}, GetVideoStreamTextureGL{GetVideoStreamTextureGL_}, ReleaseVideoStreamTextureGL{ReleaseVideoStreamTextureGL_} {}
  }; // OVR.OpenVR.IVRTrackedCamera
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::IVRTrackedCamera, "OVR.OpenVR", "IVRTrackedCamera");
#pragma pack(pop)
