// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
#pragma pack(push, 8)
// Begin includes
#include <stdint.h>
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: OVR.OpenVR.VRControllerAxis_t
#include "OVR/OpenVR/VRControllerAxis_t.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OVR::OpenVR
namespace OVR::OpenVR {
  // Forward declaring type: VRControllerState_t
  struct VRControllerState_t;
}
// Completed forward declares
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Autogenerated type: OVR.OpenVR.VRControllerState_t_Packed
  struct VRControllerState_t_Packed : public System::ValueType {
    public:
    // public System.UInt32 unPacketNum
    // Offset: 0x0
    uint unPacketNum;
    // public System.UInt64 ulButtonPressed
    // Offset: 0x4
    uint64_t ulButtonPressed;
    // public System.UInt64 ulButtonTouched
    // Offset: 0xC
    uint64_t ulButtonTouched;
    // public OVR.OpenVR.VRControllerAxis_t rAxis0
    // Offset: 0x14
    OVR::OpenVR::VRControllerAxis_t rAxis0;
    // public OVR.OpenVR.VRControllerAxis_t rAxis1
    // Offset: 0x1C
    OVR::OpenVR::VRControllerAxis_t rAxis1;
    // public OVR.OpenVR.VRControllerAxis_t rAxis2
    // Offset: 0x24
    OVR::OpenVR::VRControllerAxis_t rAxis2;
    // public OVR.OpenVR.VRControllerAxis_t rAxis3
    // Offset: 0x2C
    OVR::OpenVR::VRControllerAxis_t rAxis3;
    // public OVR.OpenVR.VRControllerAxis_t rAxis4
    // Offset: 0x34
    OVR::OpenVR::VRControllerAxis_t rAxis4;
    // Creating value type constructor for type: VRControllerState_t_Packed
    constexpr VRControllerState_t_Packed(uint unPacketNum_ = {}, uint64_t ulButtonPressed_ = {}, uint64_t ulButtonTouched_ = {}, OVR::OpenVR::VRControllerAxis_t rAxis0_ = {}, OVR::OpenVR::VRControllerAxis_t rAxis1_ = {}, OVR::OpenVR::VRControllerAxis_t rAxis2_ = {}, OVR::OpenVR::VRControllerAxis_t rAxis3_ = {}, OVR::OpenVR::VRControllerAxis_t rAxis4_ = {}) noexcept : unPacketNum{unPacketNum_}, ulButtonPressed{ulButtonPressed_}, ulButtonTouched{ulButtonTouched_}, rAxis0{rAxis0_}, rAxis1{rAxis1_}, rAxis2{rAxis2_}, rAxis3{rAxis3_}, rAxis4{rAxis4_} {}
    // public System.Void .ctor(OVR.OpenVR.VRControllerState_t unpacked)
    // Offset: 0xA2DB94
    static VRControllerState_t_Packed* New_ctor(OVR::OpenVR::VRControllerState_t unpacked);
    // public System.Void Unpack(ref OVR.OpenVR.VRControllerState_t unpacked)
    // Offset: 0xA2DBC0
    void Unpack(OVR::OpenVR::VRControllerState_t& unpacked);
  }; // OVR.OpenVR.VRControllerState_t_Packed
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::VRControllerState_t_Packed, "OVR.OpenVR", "VRControllerState_t_Packed");
#pragma pack(pop)
