// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: OVR.OpenVR.EDualAnalogWhich
#include "OVR/OpenVR/EDualAnalogWhich.hpp"
// Completed includes
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Forward declaring type: VREvent_DualAnalog_t
  struct VREvent_DualAnalog_t;
}
#include "extern/beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(OVR::OpenVR::VREvent_DualAnalog_t, "OVR.OpenVR", "VREvent_DualAnalog_t");
// Type namespace: OVR.OpenVR
namespace OVR::OpenVR {
  // Size: 0x14
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVR.OpenVR.VREvent_DualAnalog_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct VREvent_DualAnalog_t/*, public System::ValueType*/ {
    public:
    public:
    // public System.Single x
    // Size: 0x4
    // Offset: 0x0
    float x;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single y
    // Size: 0x4
    // Offset: 0x4
    float y;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single transformedX
    // Size: 0x4
    // Offset: 0x8
    float transformedX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single transformedY
    // Size: 0x4
    // Offset: 0xC
    float transformedY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public OVR.OpenVR.EDualAnalogWhich which
    // Size: 0x4
    // Offset: 0x10
    OVR::OpenVR::EDualAnalogWhich which;
    // Field size check
    static_assert(sizeof(OVR::OpenVR::EDualAnalogWhich) == 0x4);
    public:
    // Creating value type constructor for type: VREvent_DualAnalog_t
    constexpr VREvent_DualAnalog_t(float x_ = {}, float y_ = {}, float transformedX_ = {}, float transformedY_ = {}, OVR::OpenVR::EDualAnalogWhich which_ = {}) noexcept : x{x_}, y{y_}, transformedX{transformedX_}, transformedY{transformedY_}, which{which_} {}
    // Creating interface conversion operator: operator System::ValueType
    operator System::ValueType() noexcept {
      return *reinterpret_cast<System::ValueType*>(this);
    }
    // Get instance field reference: public System.Single x
    float& dyn_x();
    // Get instance field reference: public System.Single y
    float& dyn_y();
    // Get instance field reference: public System.Single transformedX
    float& dyn_transformedX();
    // Get instance field reference: public System.Single transformedY
    float& dyn_transformedY();
    // Get instance field reference: public OVR.OpenVR.EDualAnalogWhich which
    OVR::OpenVR::EDualAnalogWhich& dyn_which();
  }; // OVR.OpenVR.VREvent_DualAnalog_t
  #pragma pack(pop)
  static check_size<sizeof(VREvent_DualAnalog_t), 16 + sizeof(OVR::OpenVR::EDualAnalogWhich)> __OVR_OpenVR_VREvent_DualAnalog_tSizeCheck;
  static_assert(sizeof(VREvent_DualAnalog_t) == 0x14);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
